{
  "positive": [
    {
      "review": "I started playing Warframe on September 21st. Now, on November 12th, I've accumulated a total of 466 hours.\r\n\r\nThe game's addictive potential is [b]NO JOKE[/b].\r\n\r\nI wouldn't recommend it to anyone with a family, hobbies, or a purpose in life.",
      "voted_up": true,
      "votes_helpful": 81
    },
    {
      "review": "The recent review bombing has left me speechless and really shows that some seriously cannot read or just wait a few days to wait out changes. DE is a godsend in terms of community feedback and communication. They listen and they work on changes the community actually wants. \n\nExample: UI changes are bad? DE worked on it, improved in less than a week. \nRecoil changes aren´t good? DE worked on it and gave us an extra Toggle in less than a week. \nDamage attenuation is annoying and kills the fun? Good, DE changed it and made it better, now also only bosses have it which makes a lot more sense as well. \nA character is bad, needs a REWORK? DE worked on them, made em better, even with new abilities.\n\nIt just takes TIME which many people do not seem to get. Coding and testing takes time. After they released an update, there is usually a lot of hotfixes A DAY, which shows, they´re actively listening to the community. They even play the game themselves, the community managers are often seen in game, not just in chats but actually playing the missions. \n\nSome people have been used to DE, an actual GOOD development team, for too long and it shows. Every time some minor bug comes up, people cry, even though its CLEAR that DE will effectively work on it as fast they can the moment they get the feedback or backlash. \n\nPeople cannot, READ! Damage got massively BUFFED and they talk about nerfs. \nThe community is often really helpful but goddamn, do they need to learn how to read/ start reading and UNDERSTANDING patch notes.\n\nI´ve been playing this game for a long time, on console and pc. I´ve been there almost since the beginning and its improved A LOT. They´re even effectively working on improving new player experience while also keeping the \"OG\" players in mind. \n\nThey´re also working on improving older content, which of course takes a lot of time. \n\nThis is one of the few games where i would NOT advice listening to the negative reviews and just test things out yourself. IT IS ALL FREE after all. the community WILL help you if you need it and there is clans that will accept and guide you through things if needed. New player experience is as good as ever right now and is only going to improve further. \n\nDon´t rush, take your time, there is no \"FOMO\". You can earn everything for FREE. Some might cry about the amount of grind/ time things take but its honestly not even close to being bad. Its a LOOTER SHOOTER, expect a grind!",
      "voted_up": true,
      "votes_helpful": 126
    },
    {
      "review": "it took me about 1800 hours to do all achievements and finally design my warframe\r\nready to start the game now",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "yaaay runny shooty jumpy- oh that's a moral question about human existance.... yaaay jumpy and shooty and ker-bonk hehe....",
      "voted_up": true,
      "votes_helpful": 52
    },
    {
      "review": "Please no more syndicates. No more mining and fishing and gathering and hunting in my game about war and space demons. It hurts. My soul is broken. I find a new cool area with a new cast of characters and new mechanics. Look inside, syndicate. I could syndicare less man.",
      "voted_up": true,
      "votes_helpful": 41
    },
    {
      "review": "Fun game with plenty of depth and freedom in its gameplay. Player driven in-game market is insanely active and doesnt require you to spend any real money. But you cant recommend this game to any of your friends cause all theyll see is the 3 day build time to Rhino and then they drop it so fast, you think you smoked meth.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "I keep having crashouts about this game and i just got to the (current) endgame content. 10/10 will crash out again",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This game is very fun to play and the game is definitely complex but its worth playing and grinding and the veterans are really helpful and friendly but there are a few who aren't , found minimal toxicity compared to other games tho. Definitely take your time exploring the game its really fun once you get into it",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "There’s a huge amount of content, tons of Warframes and weapons to try, and always something new to build or experiment with. Even after thousands of hours, I still find new playstyles. The community is great, and the devs keep the game alive with constant updates and big ideas. The early game can be confusing, but once it clicks, it becomes incredibly addictive.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "by far the best i played its a very good game with good story simple gameplay and hours of content i highly recommend it for new players who want to try it or have got burned out by a few other free to play games who shall not be named its very addictive HOWEVER its a game that doesnt hold your hand and requires some learning such as modding and creating builds and you will feel overwhelmed but the game doesnt make you rush you can play it at your own pace and every content and update in the game including new weapons warframes quests and other items are free and can be aquired by simply playing",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Where do i even begin with this. This game is the first ever game that im about to cross 1000hrs in. I feel that alone says about how addictive it can get to play this (even more so with other people).\n\nNow ofcourse there will be moments where you'll feel burnt out or have sheer bad luck, not getting the drops you wanted, and for that i say it is completely okay to take a break. Remember it is a game you play for your enjoyment.\n \nAnother thing to add to the last point, about 90% (give or take) of the stuff in the game is f2p friendly (granted you have to grind for it) thanks to the wonderful addition of the trading system which even allows you to exchange the game's premium currency. Not only that but there is no FOMO as well (well except mabye a tiny amount of items).\n\nAll in all, frame go zoom, gun go brrt and enemies go kaboom.\n\nNow, i must be on my way to get more Tellurium.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It is very grind heavy but there is no fomo(anymore) and everything besides a few \"mistakes\"(Founders, and the original heirlooms) are obtainable via recurring events, prime resurgence, or just by playing(year round). It is possible to obtain a meta build without paying a dime, the only \"pay to win\" is the true endgame-fashionframe... And slots. Besides that it is pay to skip the grind. \r\nAlso not to maintain you can trade stuff you don't want to get plat a good portion of the time.\r\n\r\nOutside of the free to play friendly slogan, the gameplay is very nice. There is basically a frame and weapon for everyone... I do mean everyone... Want a beam sure, want split beams sure, wanna deal pure fire and burn a enemy sure, wanna mind control enemies there is a frame and a status(for weapons) that is just for that, wanna blow up enemies with a big gun-well you can do that in the sky missions and later deploy that big gun(plus their is regular boom sticks aka launchers), wanna shotgun while surviving fifty trillion hits. You can just pick a flavor(glutton tank, absolute tank, health regen tank, shield mommy, etc)\r\n\r\nBesides that the parkour is good, and when you decide to stay hooked... Well lets say you be reworded with the best story missions in a f2p game ever. \r\n\r\nThis game has years of polish and you should not brush it off as pay to win despite the grind as that is so far from the truth you are spitting in the devs face. Just if you can survive the grind, you will like the game if you can find the loadout you like for your perferred playstyle :3\r\n\r\nSincerly a Transbian Pubby Girl",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I don't need therapy, I need more Endo.\n\n10/10 game, I've been playing on and off for a couple years <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I have only played Warframe a little, roughly 3.5k hours since launch. I love this game, I play for a while take a break and eventually come back! Great game, fun to play, highly recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is literally the best free to play game ever made! The game itself is incredible with a good story and beautiful animation! The devs care about the game and it's player base. Every update they do leaves you wanting more and after two years straight of playing, I'm still not tired of playing it. It's basically the only game I play and tell everyone about now. I gladly spend money every year for the Tennocon pass, even if i have everything from Baro. It's such a good game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has cause me happiness, pain, sorrow, joy, and blue balls. Sometimes ill finally complete a task and start squirting everywhere, other times ill get so mad i put my balls in the toaster. 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "spent 1000+ hours, tried to drop the game probably 3 times but still returned to it and actively playing. It makes me feel like im in relations with abusive lesbian who teaches me only how to dress to impress. And somehow i like it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game will give you an addiction if you are someone that like grinding or being a completionist like myself. (Please send help i can't stop!)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you enjoy Destiny 2, you will enjoy this game as well. It's almost exactly like Destiny 2 except better in almost every way. There are some ways it could improve but still a great game overall.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like the style and the overall aspect of the game ! The warframes are so so pretty and the combat is cool too. Just am taking this game a step at a time. <33",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Best Game Ever, No Matter How I long I stop playing this game,, I keep coming back.\r\nTHIS GAME IS AMAZING",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "To say \"you're a space ninja\" just doesn't communicate the actual power fantasy this game drops you into.\n\nThe absolutely insane variety of different weapons and warframes, with all the different ways you can customize and min-max your playstyle is what really draws me to this game. There always seems to be more to discover even after playing this game for more then 6000 hrs (at the point of writing this).\n\nThere are so many different mechanics, effects and rules you can bend and theory-craft around that it literally took me years to get around to, play around for myself or even understand them.\n\nFor me, in essence, Warframe is an optimization game. \nWhile you can indeed do pretty much everything with that one warframe and that specific gun, the game encourages you to adapt, experiment and optimize for the situation.\n\nTesting and discovering new cool ways to play this game is what kept me around and I wholeheartedly recommend this game to that specific subset of people that like optimizing and theory-crafting as much as I do.\n\nThe story is pretty unique, both stylishly and narratively. It draws inspiration from spirituality, philosophy and as well from many different established science fiction themes. In other words - the story is weird, the world and locations are weird - I like that. It provoked thought and many story moments stayed with me for years later.\n\nBesides, the community is nice. The devs listen to the players. \nThe game is constantly worked on and updated regularly (new content every ~3 months). For a totally free game its unheard of. The monetization model that does exist is fair and not greedy, while allowing the player to trade with other players and get everything via effort and time. Other game developers should all take a page from Warframe's book in that regard.\n\nI do wish for a way to change and customize the UI via addons that will allow me to track buffs, effects and timers better (like in WoW).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "space ninja killing disgusting creatures, HELL YEAHHH, totally worth it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Warframe isn’t just a game it’s a masterpiece of modern sci-fi. The stunning visuals, fast and fluid movement, and deep combat system give players complete freedom to experiment. Daily quests, co-op missions, and endless customization let you truly express yourself. Clans, community events, and constant new content keep the game fresh no matter how long you play. In short, Warframe perfectly blends action, strategy, and RPG elements—it’s absolutely amazing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i have spent far too much time on this game i could have been doing something better with my life but i was lowballing new players for some plat. This game ruined my life. u should play it the devs are nice",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ignore the thumbs up and the 2000 hours played. I do not recommend this game unless you're willing to make this game your 9 to 5. You'll blink and suddenly you're MR 22 with galvanized mods, 15 prime warframes, and playing the market like a stock broker. If you start you don't quit, you just take longer breaks. 10/10 game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you have played destiny 2, but gave up on it due to dev's basically doing the same or just need to get your fix of looting and shooting this would scratch that particular itch...\n\nif you can get past the early content from 12 years ago and get to the later stuff you will probably never look back.\nyep that is correct 12 year old content is still in the game, unlike a certain game dest..achoo.. sorry i'm allergic to content getting removed but sill having to buy it to play stuff...\n\nSo in conclusion you want to play a game that you don't have to spend money if u don't want to and get to play content get access to all content form every version / update and have fun finding the secret things DE-( Digital Extremes ) pit in Flappy Frame.... Welcome Tenno to your new home we look forward to seeing you around the Origen system.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While I have a few gripes with this game, I genuinely cannot believe that it is free and that you can get basically anything in it for free. The only things you can't get for free are \"tennogen\" cosmetics which are made by players and are money-only so that they can get a cut. \nDon't get discouraged by the foundry timers, they are maybe the worst thing in this game and you can grow numb to them pretty quickly. Do something else while your stuff crafts.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "GAS GAS GAS GOTTA STEP ON THE GAS! Except you will be doing that with GAUSS. I can dirt bike/mountain bike too? This game is ADHD fueled so much to do. but the same that too thats crippling. you will feel so overwhelmed by the sheer amount of hing u have to complete. I can see why this game has been going on for 12+ years now. After 1k hours of play, I can confidently say at least 300-400 of those hours is just me doing nothing, just standing in game in my orbiter whilst Steam runs this game in the background. Sometimes I open up warframe, run a few missions or bounties and then straight up do nothing for the following hours.\r\nOnce my laptop sleeps, it still runs in the background so I completely forget that I was previously playing WF and head off to do my own thing, work or school related. The game doesnt take that much toll on my PC and even with my crappy Wi-Fi, it still does well enough lol.\r\n\r\nLots of mythological and folklores- except i dont know enough to be into them. \r\n\r\nremember to take breaks when playing WF, easy to get overwhelmed and feel the need to do everything at the same time lol. \r\n\r\nDifferent warframes to play as and even as someone with lots of hours, I havent even gathered half of them and I still feel like a novice. the community is very helpful and open (with the very few who are not so nice).\r\n\r\nWE ARE GETTING A REWORK!! MY TENNO IS GONNA BE PRETTIER!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game where it feels like I have done so much but yet barely anything at the same time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Took 8 years and 4 tries to get into it. Now I cant put it down. The community is nice and helpful while the well of content is more like a bottomless pit. Its nice to have a F2P game that doesn't have my wallet at gunpoint.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "my friend recommended this game and im already enjoying it it, unlike destiny 2 ,warframe gives the opportunity to level up and discover all of the aspect of the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Easily the best free to play game out there and live service done right I played warframe a bit back when it first came out on ps4 now playing it on pc wow the game sure has changed alot lol if you're put off by the fear of mtxs now there is (it's a free to play game, what do you expect ? the devs to just give everything for free ?) but warframe is one of those rare moments where I don't feel guilty for spending money on mtxs not to mention the game isn't in your face with said mtxs you can hypothetically get everything in the game without spending a cent but it can be a bit of a grind (as a monster hunter fan I'm use to the grind) but hey for what it is you get to play as various outer space cyber ninjas with different play styles, a awesome story, and a fun gameplay loop",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Warframe is an interesting distraction for folks who tired of other paid MMOs. It's absolutely worth a 50-100 stroll for free, and that's the best thing I can say about it. The concept is great, the content is expansive, and the graphics/artwork are very close to today's standards (well, maybe 2022-ish). \n\nThe best thing I can say about this game is the lack of in-your-face monetization. While there are options to quickly move ahead with gear, many of the early equipment becomes available just by playing. You can easily get 30+ hours out of this game just playing a space ninja. And that's why it still exists with a higher concurrent player base than many AAA titles released in the past year. \n\nThe problem with Warframe is that it's early game gives you a notion that you can farily grind everything out. But after 130+ hours, I can tell you that is not the case. And the loop they get you addicted to is the same as mobile gaming from the early 2010s. They've just done a far better job hiding the time gates behind perceived power creeps during the first 100 hours. But once you're into the MR10+ range, you start to realize the need to buy plat to advance at a decent rate. \n\nThis isn't to say you can't just face grind everything till your heart's content. Because you can. And again, the monetization isn't all that predatory. But the game is constantly tempting you to spend plat to speed up a build in order to level up your MR. In some ways, it's an amazing F2P system and doesn't penalize players for just wanted to blow shit up for a few hours a week. In others, it preys on the minority of players that really do want to progress and aren't willing to wait for a new warframe, weapon, etc. to be completed. \n\nI'm glad I played it, got a ton of value for next to nothing. But you start to realize the king has no clothes about 100+ hours in and that the grind ahead is going to cost you a decade of time or $1K of money.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game contains Disturbing Addiction for a LOOTTT of Players lolz like me\ni love this game soo much content and im happy to be part of this community",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Over a thousand hours of my life spent playing this game. It can be a great game to play on the side or it can also be your second job grinding everything",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hands down one of, if not the, best free game out there on the market today. A solid 9/10, though i can admit they do need to adjust the new player experience by a tad, which each update seemingly doing so little by little. Love the devs. :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. I've been playing it for more than a decade at this point, even though my hours played don't reflect that kind of time. Warframe is one of those games that has so much you can do and there's always something that you can be working towards. I know some people feel like this game requires you to purchase a lot of things just to make it worth while, however, in the time that I've been playing I've maybe bought Plat 2 or 3 times.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Contender for one of the most engaging games in general, and easily the absolute best F2P game out there currently.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's peak but really hard to get into alone like I did, recommend to have friends but that's also impossible in the big 25",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Superb fast gunplay meets great melee meets parkour space ninja's with magic. And it's viable solo and very ready to matchmake coop pve. Wrapped in power fantasy that still challenges you. [b]And it succeeds at all of it.[/b]\r\n\r\n[b]F2P but not pay to win[/b] - in fact, buying too much actually kinda deprives you. But a little here and there keeps both the game and excellent player economy going. Part of what keeps this game going strong is how the dev's didn't rake in the dough, but instead set it up so it's best to take purchase currency and buy items from players rather than the store. Earning pay currency is very viable, even for early-mid game players. Because of this, I've happily supported the game many times.\r\n\r\nNormally, melee wrecks shooters. Not here. The seamless transition combined with the movement makes for a beautiful combo:\r\nBrap brap... mag runs out, quick slide sword spin, reload.\r\nSwoop in from above, surprise ground slam, slash slash, brap brap. It's great.\r\n\r\nPlenty of different settings (some are surprisingly intricate and very stylish for their alien architecture).\r\nPlenty of mission types, especially as you progress, though most are at their core focused around shooting. This is one of the few games where not only do I not hate the defense missions, they are actually one of my favorite modes. (as soon as you can earn him, use frost bubble shield)\r\n\r\nBut I haven't told you what you do in the game: At it's core, it's a fast paced PVE looter-shooter.\r\n1. plenty of solo story arcs/missions (some are pretty cinematic).\r\n2. jumping into missions with players.\r\ncommon missions are (shoot and fight to) reach objectives, eliminate enemies, defend things, sneak in & infiltrate and hack or sabotage/blow up things, reach and defeat a boss, some open world locations, and a number of endless modes where you have to decide how far to push your capabilites)\r\n3. helping and/or being helped (including taxi and carry to things you haven't unlocked yet). Notably helpful community and useful chat. Struggling with a boss, people will help if you ask.\r\n4. earning exp to level up your warframes, weapons, pets, and \"mastery rank\" (unlocks new items and other bonuses)\r\n5. mods. The heart of the game is finding, trading, earning, then upgrading mods and putting them on your warframes and weapons to make interesting and increasingly powerful builds.\r\n6. going after more warframes, finding your favorite combo's and really customizing your play styles (since you will have several go to's for different game modes)\r\n7. unlock the whole starchart and complete stories to unlock more modes and challenges.\r\n8. as with customizing your loadouts, it becomes natural to personalize your warframes, ships, & gear too. Why play vanilla Volt, when I can make him jet black and shoot red lightning? Nidus plays like Carnage, so I'm going to make him look like Carnage too.\r\nThink of it this way: if you can, you buy a car you like and in a color you like. and it's satisfying. How much more satisfying would it be if you pieced it together and picked every color?\r\n\r\nTips for new players:\r\n1. Start with the regular/tenno path. (do Duviri later, after you've cleared a planet or 2).\r\nEventually you will be able to get the frames you didn't choose, but it will be a while. All will melee, so don't think you need Excalibur for that. You are choosing your superpowers. (Don't fret it, even if Volt is best choice)\r\nExcal = swords and sword dash super power (remember you can already sword slide with any frame)\r\nVolt = emperor palpatine + super speed + energy shield (helps with def and can carry and shooting through = damage boost!) + nuke\r\nMag = more complex (better for a returning player - if they don't take volt), damage protection, status infliction, all useful and powerful if you know when and how to use them, but lacks the wow feeling of excal and volt. (honestly they should change mag out for some other frame to start with)\r\n\r\n2. don't let the game dupe you into wasting your starting free Platinum to rush item construction. Use it for a couple weapon slots and then a warframe slot. (you can earn more in nightware rewards)\r\n\r\n3. Open the menu and at the upper left near your name - set it to solo or friends only, just for the first number of missions (otherwise more experienced players will blast through before you even know what was happening) when it starts getting hard (defense or boss missions) then swap it to public and leave it there. (game is more fun with people)\r\n\r\n4. ask for help. They even have a helpful chat bot, so you can ask \"where is [item name]?\" and it will tell you what planet and where to get it.\r\n\r\n5. once you freak out about build times, realize you get a flow of items making, so there is something ready most of the time. then build time rarely matters. on that: don't buy weapons or warframes for platinum. Instead but the blueprints for credits (cheap easy earn currency) then build them.\r\n(exception: buying one extra frame early is nice. Not needed, but nice. I recommend Nidus or Nekros or Khora)\r\n\r\n6. when you get to the point where your damage feels weak and you need help, doubling up on the same category of damage is weaker vs different types that multiply:\r\n+%dmg +%dmg + % dmg = weaker than\r\n+%dmg + elem + multishot + crit + firerate = super extra strong\r\n\r\n7. sell weapons you've maxed rank (30) to clear space for new unless it's something powerful you need or special or a crafting ingredient. to do so, open menu, equipment, inventory, then tab over to the weapons. You get no benefit to make a duplicate and try to level that again (which is why you can hide owned and Mastered in the store page where you buy blueprints)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’ve been playing Warframe on and off for a while now, and every time I come back, I’m surprised at how much it’s grown. The movement and combat feel incredibly smooth — nothing else really compares once you get used to sliding, bullet jumping, and slicing through enemies at high speed.\n\nWhat I really love is how much freedom the game gives you. You can play solo or with friends, take it slow and explore, or just jump into fast missions and farm gear. The amount of customization is insane — from the Warframes themselves to weapons and even how your ship looks.\n\nThe devs actually care about the game too; they keep adding new content and updating old stuff. It’s one of those rare free games that doesn’t feel pay-to-win  you can earn everything just by playing.\n\nOverall, it’s one of the most rewarding games I’ve played, especially if you like sci-fi and fast-paced action. Definitely worth giving a shot, even in 2025.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One Of my most favourite Game. Connection Issues very frequent however it doesnt deter from how free and fun this game is. LOVE LOVE\n\n9.8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I struggled for years to get into this game despite wanting to because the new player experience was rough to say the least. They have since updated it and WOW, this game is just peak. I've played many MMOs but few have captured me like this one has. Amazing story, content, and progression. Totally free to play and an absolute blast regardless of if you like shooters, MMOs, or simply want run at mach 10 while looking cool as hell.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A masterclass in what can be offered for free. Actual free. Well worth investing the time to get past its hurdles and understand its inscrutable systems. Tons of variety and buildcrafting to be had, best-in-class movement system, tons and tons of content.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I mean come on!!!! Fantastic game, really, but ... yes.... \n\nNote: There is no Mac or Linux client currently available. One can only imagine the scene unfolding in some small office somewhere, where the developers sit among stacks of teacups and half-eaten biscuits, staring at screens with the kind of solemn concentration usually reserved for chess grandmasters or people trying to decide which cake to have with their afternoon tea. Somewhere in the corner MacBooks and Linux machines sit quietly, like well-mannered guests who have arrived too early to a party and are politely pretending not to notice that the door is firmly closed in their faces. The developers glance at them, sip their tea, and shrug in a way that is both mysterious and slightly charming, as if to say, 'Perhaps another day, my dear friends, perhaps another day.'\n\nMeanwhile the Windows users are clicking merrily away, probably humming a tune, completely unaware that elsewhere the air is heavy with wistfulness and quiet despair. One imagines the Mac and Linux folk staring out of rain-spattered windows, lost in thought, contemplating the cruel injustice of their situation while pigeons strut purposefully along the wet pavement, seemingly smug in their freedom to come and go as they please. A cat curls on a radiator, its tail twitching in rhythm with the melancholy, and a tea kettle whistles in the distance, perhaps in solidarity.\n\nPerhaps they write letters to themselves, or to no one in particular, small haikus about incompatibility and longing, or sketch delicate penguins trudging nobly through endless fields of code, dressed for the cold yet never complaining. Perhaps they rehearse polite speeches for when they are finally acknowledged, making sure to bow slightly before every sentence and to apologise in advance for taking up too much bandwidth.\n\nIt is all very civilized, like a queue in a foggy English town that stretches on forever, where nobody complains even though they might be waiting hours, because manners are more important than comfort. Yet in this waiting, in the polite sighs and soft tea slurps, there is a strange sort of beauty. A quiet absurd beauty, like a cucumber sandwich left on the windowsill that is still edible but slightly sad, or a teacup perched precariously on the edge of a table daring gravity to intervene while no one quite watches. It is tragic and delightful at once, like a very polite comedy in which the plot may never resolve, but everyone continues to sip tea and smile faintly, knowing that life, software incompatibility, and pigeons will march on regardless.\n\nAnd perhaps, just perhaps, one day a soft murmur will ripple through the office, biscuits will be nibbled in celebration, and Mac and Linux machines will be invited inside. Until then, we wait, we sigh, we sip, and we imagine penguins in bowler hats conducting very serious business meetings in tiny boardrooms full of glowing monitors, utterly dignified and entirely British.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It’s super addicting. Who needs friends when you could have MR30? If you could transform ADHD into a game, this would be it. There's so much to do, a lot more to discover, and I don’t understand any of it. \r\nCan’t stop!\r\nWon’t stop!\r\nHelp me!!!!!!\r\nOOOOO pretty warfame......Uh Oh",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Active devs, active community, constant updates, easy to catch up to new content, rewarding to master. You won't regret trying it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Personally I like the long story and endless things to do. Your never bored. Pretty cool characters, customization, and weapons.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Simply put this is the best free to play game in existence. Thanks for coming to my ted talk.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Oraxia does things to my silly little lesbian mind \r\n\r\nOh and uh, the game's good too. Shout out to Valkyr, Gyre, Oraxia, Koumei, Gauss, Lavos and Wisp for being really really fun to play!\r\n\r\nI hope next pride icon is Wisp so she and Hildryn can be together like in their reveal image and prime resurgence\r\n\r\nEarly game is a bit of a slog, but! As of me writing this they're starting to work on streamlining the process a lot!\r\nEnd Game Warframe is some of the most fun I've ever had in any game. I've been playing since 2020, and it has cemented itself as my favorite game of all time. It takes investment, but it is WORTH it imo.\r\n\r\nValkyr and Voruna should kiss, violently (Though adding Garuda and Khora to the polycule is a-okay with me)\r\n\r\nAlmost everything can be acquired in game due to the premium currency being tradable. You can get almost everything with time instead of money!\r\n\r\nEmber Heirloom\r\n\r\nIt's a very fun game to play, the wide variety of frames leads to MANY types of playstyles being available, the movement is EXCELLENT, and the modding system, while admittedly confusing, leads to VERY satisfying moments when you finally get a build all together.\r\n\r\nThe devs are just as horny as the playerbase and I think that is awesome\r\n\r\nAll in all, I'd say Warframe is a 9/10 for me. The Statistical Anomaly is what mainly brings it down for me, but it's still my favorite game, and it was a soft landing for when Destiny defenestrated me.\r\n\r\nYareli Mating Press",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is probably the best game of all time. Honestly it deserves awards and more marketing. I have been playing this game since Covid. I am on all platforms. This game offers so much and it takes up so little space. They are improving the new player experience greatly. I have sunk so many hours into this game its worth every moment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games with one of the best communities and devs out there but dont take my word for it download the game and see",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, play the game. I can't really stretch how good this game is, how awesome DE is as a company and how beautiful the community is.\n\nI'm out of words genuinely but one thing I can say for sure; give it a shot, you won't regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of the most fun and addicting games I've ever played. Progress in this game is a marathon, every milestone feels incredibly rewarding and no matter the playstyle you have, you can thrive. Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The missions are very fun to play and waste some time. And the story is pretty interesting, it loses me sometimes but the game play for the story is great. I don't like waiting on things to build but i get why they do it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tirando a dificuldade de se orientar no início, esse jogo não tem problema algum. 220 horas e muito dinheiro depois eu posso dizer que é o melhor looter-shooter que eu já joguei. tem a melhor comunidade de qualquer outro jogo. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've sunken more than 2000 hours in this game and finally, I've reached True Master. This game is an addiction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "11 hours is maybe not much to say anything, but until now only online gaming I did were CCG games but this thing got mw hooked!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of love from the devs, a bit rough around the edges, a bit of jank, a monetization model that just makes you want to pay them anyways, a game and community very much worth experiencing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game makes me wanna spend shit, despite everything being farmable, thats how much i love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "один минус, мой друг не цифродрочер и отказался играть со мной(((((",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the graphics and the storyline. A really good game if you like space and RPGs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I made the switch to PC seven months ago, and one of the first games I got on here was Warframe. I started playing almost ten years ago when I was in middle school, and the game was very different back then. Being around to watch it grow, continuing to play it with friends every now and again has really put into perspective just how truly awesome the developers and the game really is. It is intimidating at first, trying to understand the mod system, build crafting, the grinds that you get to experience for new weapons, materials, new frames to place, etc. After that main hurdle though, it's a nice time to relax and enjoy just blowing things up and watching numbers fill your screen.\r\n\r\nAs long as Digital Extremes continues to support Warframe and future titles like their sister project Soulframe, I'll always recommend someone to at least try them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a great game dont get me wrong but getting plat aside from buying it is almost impossible because everything in the shop is hundreds of plats and the most youll get from trading is 15",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has A pregnant warframe and her past is very sad and it made me pregnant xx",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "never had so much fun grinding for things in a game where i understand zero percent of what's going on, 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and worth the hundreds of dollars i have spent on the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game above all others, by which all other games are measured.\r\nIt asks only for your time, demands and insists upon nothing, \r\nand offers everything (ever more, and ever better).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bruh… Warframe had me feelin’ like I got adopted by space gods and thrown into a turbo-galactic daycare where everybody got rockets for legs.\n\nFrom the moment I loaded in, I’m slicin’, slidin’, zoomin’ — whole game feel like parkour on alien Adderall. Movin’ so fast my monitor started speakin’ fluent Twizzy.\n\nThe frames go CRAZY too. Every suit look like a luxury spaceship with anger issues. Abilities hittin’ like dimensional tax fraud — no explanation, just BOOM, everything gone.\n\nUpgrade system? Don’t even get me started. Mods stacked so high I swear I was buildin’ the Ziggurat of Zaiborgs. My damage numbers ain’t even numbers anymore, they glyphs from ancient turbo runes.\n\nAnd the grind? Bro I LOVE the grind. I’m doin’ missions at 4AM like\n“One more relic, twin… one more… Twizzy can’t sleep till the prime is built.”\n\nCommunity goated too. Everyone movin’ like semi-sentient hoverboards, helpin’ you farm, showin’ you builds, speakin’ in riddles and DPS math.\n\nThis game so fire it turned my PC fans into afterburners.\n\n7/10 — this that warp-drive, star-slicer, intergalactic-Tonka simulator. Twizzy certified.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10, game is basically destiny 2 but better in every way, including that EVERYTHING in the game (except some skins) can be obtained for free!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, but better with friends. Gets kinda grindy at times (especially later on), but never that bad and there are so many things you can do if you get bored of one type of activity. I LOVE that you can earn premium paid currency without paying a dime into the game. I do recommend you support the devs if you like the game enough to buy skins or want to skip some of the effort (while most things don't take too much effort proportional to the reward, there are a small few things that take a ton of effort compared to the reward that you might want to pay to skip), but it's nice to be able to put in some enjoyable effort to get Prime components to trade with people in exchange for their premium currency (that they also traded or paid for).\r\n\r\nIt's no BG3 or Cyberpunk of course, but it's probably one of the best games out there of its genre (and it's not trying to be BG3 or Cyberpunk, rather it's trying to just be better than Genshin or WOW, which I'd say it succeeds at overall). 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "By far my most played game. And with good reason.\nHere's what I think about it:\n\nPositives:\n1) Variety ( LOTS of warframes, guns, melees, mods, builds etc. )\n2) A LOT of content ( Warframe came out almost 13 years ago. You can only imagine how much content you've got to cover )\n3) Customization ( I already mentioned builds, which is a form of customization, but there's also A LOT of skins, all sort of \" mounts \", ships, back attachments, color palettes etc. )\n4) F2P ( Not only is the game F2P, but you can also earn the premium currency, Platinum, by trading with other players )\n5) The community is probably the best I've seen in any game. I've been given a lot of advices and stuff by random players. Like for example the Ignis Wraith blueprint.\n6) Satisfying combat ( Fast, parkour like movements and goddamn you feel powerful when you wipe an entire room full of enemies )\n7) It runs well\n8) Audio ( Maybe the graphics are a bit outdated but the music is top notch )\n\nNegatives:\n1) A bit overwhelming for a new player ( There's all sort of currencies and materials and etc. )\n2) At some point, after many hundred hours, you wake up and you realize you're overpowered and that there's very few things in the game that are remotely challenging anymore.\n3) It has gotten better now, but for the longest time some of the warframes were very underwhelming while others can do literally all the content in the game. This isn't a big problem, but I thought I'd just mention it.\n4) It can be a bit grindy depending on how much time you've got on your hands. Although in my opinion it is better than other similar games\n5) Time-gating ( Long crafting duration, things that you can only do once a week etc. )\n\nThis has been my favorite game for years. I urge you to give it a try. Sadly, at my age, I have less time for games so I've slowly stepped away from live-service games. If I had more time, I would definitely play more Warframe.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun game and surpisingly good storylines and writing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Warframe is the game where I start a mission thinking it’ll be chill, then suddenly I’m a space ninja flying through walls, shooting lasers, and somehow killing 200 enemies before my brain catches up. Abilities explode everywhere, loot rains from the sky, and every boss fight feels like juggling chainsaws blindfolded. Insane, gorgeous, and absolutely addicting chaos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this for years, Space Ninjas and Space Mom? Sign me up for more jumping and dicing through the enemies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I get scared booting this game up when I am broke. The odds of a 75% off plat while POOR is a nightmare.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Warframe is the only game where you play as a hyperactive space ninja who can backflip through ten rooms, vaporize 40 enemies, and still somehow forget what the actual mission objective was. The movement is buttery smooth, the combat is explosive, and the story goes from “kinda cool” to “WHAT DID I JUST WITNESS?” in record time.\n\nYou’ll spend hours grinding for a weapon, then immediately start grinding for another weapon you didn’t even know existed. And yet — it never feels bad. Warframe is basically a free-to-play fever dream powered by caffeine, loot, and parkour.\n\nFinal verdict: 10/10 — Fast, fun, overwhelming, and somehow comforting. Space ninja therapy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game in it self is really good the missions the lore the characters etc but my only problem is its a very long term commitement game which is mostly my problem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The early game is... rough to say the least- but if you soldier through it is a game worthy of your time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the only truly free to play MMO-ish game out there, with no progression or QoL features locked away. It is also full of half-baked systems and buggy jank, but no worse in that regard than so-called AAA these days, and unlike those, there's still a fun experience to have.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Actual masterpiece of a game. Amazing dev team that cares so much for the community they built and that same community is filled with some of the nicest most helpful and chill people out of any6 game community ive ever experienced\n\nthis game is 100% free on top of being better that any AAAA game ive seen on the market. there is so much to do, so much to explore, constant content updates that again, are free. and one of the most in depth and complex story/lores of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good\r\nI have too many Condroc floofs, but it is worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve spent way too many hours in Warframe. Every time I log in, I’m ready to grind, farm, and become a space ninja god…\n…and then the game loads, I stare at my Orbiter for 3 seconds, and all my motivation evaporates like I never had it.\n\nWarframe is basically:\n“Wow, that’s cool!” → “Wait, I’ve done this 400 times.” → “I’ll do it again anyway.”\n\nStill a great game, still addictive, still confusing, and yes, still somehow repetitive enough to make me question my life choices.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like the quality of the graphics, creativity of the environment, and the vast amounts of variety as far as mechanics and gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm new to the genre and it all kind of feels fresh to me so take this with a grain of salt i suppose- but the game is sleek and the movement is fun. Cool free game and I feel overpowered even without paying a cent so I don't feel the need to pay any money to compete at least for these first 11 hours. Will probably get bored by 20 or 30 hours in but it's free so i'm happy to enjoy hoverboarding and fishing and killing stuff in between.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Warframe is a game that can take a bit to get used to at first, everything might feel like a bit of a grind, but if you let yourself get absorbed the story is spectacular and the game turns into a fun power fantasy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with a ton of content. Has crosplay and crossave. Can trade prime currency, no battlepass, no pay to play/win.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Variety of content, guns, melees and 'classes' all with different ways to build them to keep things fresh.\r\nIncredible community and devs that make this game one of my absolute favourites to come back time and time again.\r\nStarted in 2014 and its only gotten better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "litteraly the best game u can ever play, for free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While I've been playing this game on and off for the past few years, always a bit turned off from the sci-fi setting, confusing story, and lack of true MMO elements and character creation (I am a traditionalist from games such as World of Warcraft), I must admit there is something charming about the game that always has me revisiting. Each time I revisit, they've expanded or iterated on systems that make coming back fresh and brand new every time, and a lot more enjoyable than the last romp through this universe. I enjoy my time with Warframe when I do play it, especially with friends who are more active than me. I look forward to seeing this game grow more and more, and I look forward to getting deeper and deeper into it as time goes on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game, amazing story and lore, characters and many different way to play. More than 10 years and still something i always come back to play at least once a week",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is fun. Played it for a while. Not gonna bore you. Just download and enjoy.  DE is probably the best game company!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you should try play for a month first, if you only play only for 3 to 5 hour, you won't get the beauty side of this game, but hey, it's a free game. This game is time consuming, but almost everything is free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really dont know why i didnt touch this game i probably thought it was another crappy free to play live service game but after i started playing it exceeded my expectations storys fun to go through rn the missions and different factions are fun to fight though i do wish there was more factions to fight adding some variety since only one faction truly uses robots and shields while the others focus more like regular grunts with the exception of the orokin versions of the enemies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After a couple hours on a few platforms I can say that I have lived this game. The lore is quite deep, and the game-play is magnificently capable of addictive rhythmic structures. The system integration is the excellence that has inspired me on more than several occasions. \n\nI am of Warframe in the sense that it is beautiful. When you play that hours become characters in your paragraphs of hope to your desire. I can describe the satisfaction but Warframe has given me more. \n\nI have left and may i return.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i wannna leave a funny silly review but this game is honestly so fun and as someone who recently started to play it, its not only super welcoming and friendly to newcomers (both the game and community) but also a very flexible game that lets you do things as a f2p that other games could only dream of. its full of things to do and at times can be overwhelming, it's one of those games you can easily return to after not playing for awhile and it also hard to get bored or not have anything to do (atleast for me). i can and will always recommend this gem of a game :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall — 6.7/10\n\nWarframe is a unique high-content mechanically excellent action game that rewards long-term investment. Its movement and combat systems are among the best in the genre but experience is hindered by steep early complexity, significant grind, and uneven legacy systems.\nFor players willing to commit time and learn its layered systems, Warframe offers depth and longevity that few free-to-play titles can match",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its that one game i keep returning to.\nGraphics,Story,gameplay everything just keeps calling me back over and over.\nFor new players can be a bit intimidating at first but when u get into it there is no turning back.\nIf u want to be stuck for the rest of your life to a game you gonna keep returning.press that download button and give it a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, love playing it with my dad and younger brother. The story is great, and so is the gameplay. My only issue is the wait time in between crafting weapons ands warframes",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The game obviously oozes charm and passion. The developers obviously love their jobs and the world that they have created. And yet, the game has sped up through power creep to the point where many objectives are trivialized and speedran in public lobbies. The game also suffers from MMO-itis, where the developers are obliged to design the game around full-time grinders rather than people with a day job, which dramatically reduces enjoyment for those of us with limited gaming time.",
      "voted_up": false,
      "votes_helpful": 92
    },
    {
      "review": "The developers believe that this game is only for the \"right\" citizens. If you're from the Russian Federation, then you're not welcome here. I don't recommend it, although I liked the game initially.\n\nРазработчики считают, что эта игра только для \"правильных\" граждан. Если ты из РФ, то тебе тут не рады. Не рекомендую, хотя изначально игра понравилась.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Desperately requires end game content apart from ETA and levelcap, so much powercreep and so little to use it on.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "First played since beta and supported the game as a \"founder\". The game immediately hooked me and the gameplay kept me coming back. However over time I consistently saw how the Devs really have no idea where they wanted to take the game and adding this and that, which never really made sense. Constantly \"evolving\" the game and just kept seeing the missed potential.\nEventually you will see it's a never ending content treadmill to keep you playing and hopefully paying. Wouldn't recommend.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The gameplay is not too bad and thr amount of farming required is pretty fun, at times.\n\nSadly this is going to be a negative review simply due to the pathetic DE support. I recently returned to the game and discovered that my account was hacked. Yet contacting the support team yields no results\n\nWhomever hacked the account breached the Warframe Terms of Service and I was informed by the suppprt team that they can't assist me in re-obtaining my account and it will remain in suspension.\n\nAfter all that, heartbreaking news, they had the arrogance to add \"Thank you for understanding\".\n\nWhat a way to rub salt in new wounds DE.\n\nPS: To those who still play or wish to play the game, for your safety, please activate 2FA on your account and ensure your email is secure as well as DE support doesn't give a crap if it was hacked.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is 70% inconvenience 30% sliding at high speed while swinging a sword",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bugging launcher and shitting connection",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No Doubt It's a fun game but there are times I don't even know what I'm doing, I'm not saying it's a bad thing, its just that its hard to navigate the UI sometimes and at points the game is repetitive the game's just not for me but I would recommend it if you like such games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wont yuck your yum but this game is more suited to be enjoyed by ppl that played on or near release so u can handle the over saturation of things to get and do 3.2/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "im a new player and i enjoyed playing this game until yesterday I tried to login and I found out my account get suspended until 2035 and I tried to reach out to support and I didn't get any answer form them, i have 40 days login so its a new account and i don't have 3rd party softwares, I thought it's a bug first then I found out that a lot of player playing Warframe for many years get suspend for no reason and I think that is dumb thing like who'll be around to play in 2035",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game, so many strange decisions. I like the devs willingness to experiment. however the story and gameplay should still atleast try to make sense, Brand new player gets thrown at 3 different timelines introduced to 2 different progression systems with 0 explanation or story context. I really am not sure with what they are attempting for a story but it's a pretty sad failure at one for something that genuinely has potential. \nyeah no new war doesnt' even work, died to a 10 foot fall as the drifter, this is actually pathetic, i've never seen a game with this many scripting issues that insists on putting itself into these stupid scenes. i hope soul frame isn't like this, this is just sad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there's this bug that makes you unable to shoot, operator.. the only way to fix it is through self resurrect, or going to archwing on open world, all things aside this bug is great.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "love the gameplay but with all the stuff going on i feel like ill never make any progress going free to play\ni get they need to make money but this is too much",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game to sink endless hours in as far as story. Everything else as a new player just feels frustrating to the point where I just uninstalled. There are way to many different materials for blueprints to craft stuff. Way to many mods that are just completely useless and some of the grinding for warframes are just stupid. The new player experience feels like it was never looked into and probably never will.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the community's nice until you disagree with both them and DE on an issue, at which point you get put in the stocks and have tomatoes & live hand grenades thrown at you",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Been playing this non stop for a long time was fun at first until you get to a point that every time a host disconnects you get a mission failed and lose everything you worked for the most stupid crap ever . Recently was playing and wanted to leave the squad after a mission was over it told me mission failed and lost everything in that mission yet it kept me with the same people and never let me leave personally i would not bother playing this game anymore or spending a single $ after so many missions i have played 50% of the time its mission failed due to host leaving or bugged game i dont recommend this game at all to anyone because you cant do anything but fail a mission",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have absolutely no idea what they did with the most recent update, every single quest I have cannot be completed because it is bugged. All seven of them. I can't even play the Duviri spiral because every session gets bugged and doesnt show objectives so everyone just immediately just leaves because it's too frustrating to continue. They also genuinely expect you to post technical issues on a public forum without submitting a ticket, thats their version of tech support.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have spent over 130 hours in the game and i purchased a lot of cosmetic stuff and warframes. Now they are missing and wont give back to me. Screw any epic game the same thing happened on fornite. I would only play if you don't plan on spending real money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game does not login with Steam, automatically or otherwise. It'll claim that the server is unavailable, or that Login failed because information is inaccurate when attempting to Login with Steam, so it is essentially unplayable for some who want to play and try it out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "... honestly i tryed it for a bit (50 hours) way too much grinding, too much waiting and well i didnt like it,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honest review for someone that played it a good amount of time for a beginner. \nThe Thing is I love games that satisfy you with the feeling of \"I have achieved something\" and warframe is definitly a game of this kind. But... only for a span of time, and its different for all people cause as long as you can hold on to the illusion that the story doesnt matter, and that you dont need to invest too much time into it, you are all good. Everybody is different at having the ability or capacity to hold on to their illusion. \n\nOn my behalf, I am done. I am done pretending that the story is somehow good, cause its shit. I am done pretending that the crafting time is somehow okey. I am done pretending that getting units is easy. Yeah maybe for someone playing 1000 of hours, after that everything seems easy. I am also done with the level design, the \"oh the levels are all random so good\" bullshit comments. This game is really like a drug, but only as long as you can uphold the illusion I mentioned earlier.\n\nThe game is repetetive, nobody can tell me otherwise. Some dude in the game invited me to his training ground or whatever thats called, and started to flex on me he was legendary rank 5.  I just watched him and thought damn you gonna be like that dude, just delusional. He spent 14 thousand hours on the game, and I thought, nah I dont want to do that. I wanted to warn the new players, hopefully this comment gets some attention. Dont fall for the trap that its free, its f\"ing time consuming. And I mean really time consuming, and for what to get one good warframe or to get a B rank weapon, thats still shit cause you have to farm all the mods, which is not that hard except some with a drop chance of 4,5. But thats not bad I liked that, as I said before. \n\nIts all these little things that add up to build up a good warframe, I also had a good melee weapon could shred through enemies, but one week to have fun with only one weapon and then be happy about the new weapon that you also have to use another week, cause the other weapons are shit at your rank. Its not about patience!! Its about how much you value your own time, and this game is not it. \n\nCongrats to the developers, and I wanted to add again, you have to change the whole story its shit, nothing is significant its so random, without any reasonable story line. Thats all this was just a warning for the new players to not get fooled by the enormous free content. Its all seems enormous. But empty inside.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The progression is designed to be as hostile as possible to non-whales.\r\n\r\nAfter maxing out my first suit, I started working towards the first alternative you get from an early mission on Earth. The amount of time needed just for this ONE suit is absolutely insane, requiring so many different materials that you need other blueprints for, which can only be obtained by grinding faction rep and currency to buy a mining tool, etc.\r\nI realised that it would probably take me 3+ days of real time just to get this single suit out of several dozen, and came to the conclusion that only whales and insane people would keep playing this game past this point.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "spent 12 hours to download the game just to find out that their EULA is very non-specific and purposefully vague.\n\nthe only reason it would be vague is if they are trying to hide something between the lines that they are legally obligated to mention that they don't want to say outright.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[BR] A muito tempo atráz, esse jogo de merda respeitava seu tempo e sua carteira, não mais.\n\n[EN] A long time age, this shitty ass game respected your time and money, not anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game doesnt give a single line about how to get better cards im stuck on venus because all i pull is retarded cards and theres 0 guide that the game gives to get further into the game not worth the time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dogshit worst game ever printed.\nfor the record. i think everything about this game is amazing. however, the grind literally makes it unplayably bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly this game is a huge waste of time and the community is just an echo chamber of people sniffing their own farts",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The story and visuals feel like they were made by someone completely out of their mind. The gameplay might be decent, but the storyline experience is so bizarre and disturbing that it’s hard to enjoy. Think twice before playing if you don’t want to be shocked by how weird and uncomfortable it gets",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst support system, cannot recommend this game to anyone. 10/10 would play again if i could",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks dick and balls on some gangsta shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its fine for 10 hours, but it gets really repetitive. And the story is quite boring if im being honest",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game looks cool but 0 gameplay depth. just zoom through levels to kill maybe 8 mobs so u can collect loot again and get flooded with pointless audio cut scenes. just really boring quickly. i played 4.5 hours years ago and tried this again and didnt make it 30 mins.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dungeon spamming, every weapon is scaled bad and every level is basically the same",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you play too much Warframe, you will hate it. It WILL become different than the beast you came to love.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was able to launch the game literally just once, haven't been able to even access the launcher since",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It says play with your friends, but the absolutely mind boggling amount of crap that is required to be done solo nearly makes playing unbearable. Disappointing, to say the least; and it feels an awful lot like an EA game after a while.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't mind grinding for resources and items, but to get any item in this game takes longer than the main quests or side quests. I'm not patient enough to spend hours on a game just for one or two items.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ой да классная игра\nкусок кыаылыа \nиграл играл\nвышел сегодня зашел войдите через стим \nу вас нет акк связанного со стим\nладно создаю нового со стим  \nна этот акк уже есть учетка варфр \nсчитал гоывыныо и буду считать кыаыл вонючий а не игра, разрабы дыыаылыбаыеыбыыыы",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is called Warframe and they give you shitting quest about the story that has no use of any frame an stupid puzzle game for shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is shit.\n\nMassively over complicated and overwhelming. Not to mention that it's also incredibly bland.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont even comment about grammer i dont care i am angry at this shit so i dont care for it\r\n\r\nhi i have tried to get my account back online after i left in 2014 and i have changed my email since then and as good as the comunity is it just baffels me that you do not get an email address to contact support. this is just completly retarded as i now would ahve to make a fucking second account wich is fucking late 2000's problem solving we are in fucking 2025 just give people a contact email to fucking help with account stuff like this. it just baffels me that people just say \"oh make a new account and try to resolve it that way\" like what the fuck kind of backwards logic is this shit. you cant expect people to have ten thousand emails just for shit like this ye ai can accept that you should ahve more then 1 email but if i only have one email for games and 1 for work/other privet shit you cant just expect people to just make another because you odnt want to give them an email to write support in these cases like what the fuck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Over 180 hrs and maybe a 1/4 of it was good or fun. I didn't put any money into it and just grinded. Got to 3 characters/warframes fairly built out and gave up after an overwhelming feeling of slowly going nowhere. I'm also fairly anti social with strangers and didnt want to join a clan which seemed like the best way to get stuff done fast outside of money. I like how it looks, although a bit repetitive with some of the level generation. It's been at least 4 years since i've played so i'm sure much has been added, changed, and done. Feels great to play, physics and gameplay-wise but i also dislike 3rd person and rarely warm up to a game with it. I wanted to go back and review some games i've put hours and hours into so the other consumers may not have to. If you're anything like me you'll have fun but eventually always feel like it was grinding for little to nothing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has been almost perfect from the start. It has a ton of great qualities, and the developers clearly love what they do and what they've created. It's great that there's so much content and gameplay variety, and all the other good things.\n\nBut the main problem is by far the most glaring: fan service. More and more content is tied to gooning, and it's sad to see that DE feels the need to resort to this when the game was doing perfectly well without it. Look at the comments under every post on any network even remotely connected to Warframe or DE. Or even to the developers themselves. A new type of community is emerging: one that plays while drooling over fan service. By the way, DE are so focused on the gooning material, they are forgetting to fix some important things that make the game what he was. Get a move on, DE, you're killing your game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not working with a VPN in this game and age is fucking pathetic and should get you kicked off this fucking platform",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got permabanned because i was playing with my friend, after all the money i've spent im simply disappointed with D.E. \r\nI will not be playing anymore and i will advise all my friends against it, as they've already said so themselfs...\r\nIt was one of my favourite games before but now i cant even look at it...\r\nD.E. you've deeply disappointed me and my friends... \r\nfrankly fuck you D.E. after everything i did for you...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great gameplay. Unfortunately ruined by garbaxe  quest design and ux design. I dont understand how is a game is both great and sucks at the same time. It is so cryptic that it feels like doing homework rather than playing a game. It is a shame because gameplay is just perfect.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Long story short, I don't like the direction the game is going anymore.\n\nOK, so this review is a long time coming. I have been playing warframe for a very long time across multiple platforms. I have seen it change into something that doesn't feel like the game I have so many fond memories of.\n\nAt it's core, you play as a character called a tenno who controls alien ninja war machines called warframes. The gameplay is genuinely great and one of the reasons I love the game so much. It's fast paced, grindy, and there is a lot to do. I love games with a good RNG farming system. Also, its hard to beat a free game with how much is in it.\n\nSince the change in leadership and their creative direction, the game is moving away from the high octane shooter looter that I feel many people play the game for. What have they added in recent updates? More fun and interesting content? More high adrenaline missions to farm for rare items? More story that explains the backstory of the star system you play in? No... a dating sim... Why a dating sim in a game about alien ninja war machines ripping through hordes of enemies? What a fantastic question. The Drifter is lame and this isn't why I play the game. If I wanted to go on a date, I would go touch grass. I didn't enjoy the 1999 questline, you can't even beat it without making friends with all of the NPCs in the new area which was obnoxious (because the power of friendship... I guess? idk).\n\nOne saying in the game is that \"fashion-frame is the end game\" which I agree with. There are tons of cool ways to customize your character. In recent updates, the developers have traded cool for sexy and awesome for perverted. I can't be the only person on the planet who feels like this is getting too common everywhere. I would expect this stuff out of a crappy mobile game, not here. It's just gross. For specifics, I am referring to things like the Valkyr and Ember heirloom skins. I am just kinda over it. You want to see for yourself how the game has changed in this aspect? Look at Nova, one of the oldest frames, then look at those heirloom skins again. or better yet, look at base Ember and then look at her heirloom skin. Modesty has left everywhere in favor of selling sex. Sometimes I don't even blame them though because all the basement dwellers in the in game chat seem to enjoy being pervy and talking about how much cake their frame has. Maybe I am in the minority on this one, who knows or cares anyway I guess.\n\nThe story is starting to make less and less sense as well. Many of the new \"story\" quests don't actually give any meaningful insights to the game, they just keep adding new crap. Jade shadows for example... a preggo frame? Really? Just why? Did you just need to check a box? The warframes are literally machines. I don't get it. The duviri paradox questline is just some sped kid's fever dream that you get stuck in... somehow... I would just rather have something coherent that ties other things in the universe together where I feel like they don't, they just keep adding more fluff.\n\nThe game is fun, but it just isn't the same. The silver lining is that you can just simply not interact with parts of the story you don't like, but the fact that they are even in the game is just strange to me. I play the game because I like build crafting, I like grinding out events, I like how powerful you can feel in a hack and slash type of game. They're moving away from that, capping damage, and adding garbage \"story\". Game's getting soft.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Nobody reading my review is gonna be an experienced player. This is not a game to try and get into now. Period. Unless you want a full time job at your pc, stay away",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game crashes repeatedly during long missions, costing you all drops and exp rewards you spent time earning.  Not worth your time until DE fixes this system and protects players from crash issues.  Quick google search shows this has been a known issue for multiple years and zero has been done by the devs to fix.  \r\n\r\nDon't play games that don't respect your time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fast Version: Typical FTP Slop\r\n\r\nComplete waste of time. Mastery system requires you to wait 24 real hours before you can attempt to rank up, if you fail, you have to wait an additional 24 hours. This is a toxic system, and the design choices are baffling. How can you create a fast paced movement PVE Shooter, and then slow players down with artificial difficulty via the mastery system? Its terrible game design. I really tried to enjoy it as a new player, but I just couldn't, I hope it rots to be honest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So many f2p games could be 3x more enjoyable if they weren't f2p and had the microtransactions cut. This is one of them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I run around for a specific drop for 5 hrs and never get it and have to spend platinum to buy it off of someone else",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The issue with this game is it used to be good when it came out and for a few years after it was \"perfect\" then they started adding a bunch of things that took away from the core game. Open world maps, making prime parts not worth as much by adding a currency system to them. How they had something amazing and then systematically adding things to the point where the game is not the same experience. Trading used to actually work, now with being able to ducat and trading things other than primes and mods it lowers the meaning and value of prime parts. Ironically adding too much stuff dilutes the core game. Not enough people are participating in the main game anymore because they are pulled towards arbitrary directions. I could go on but for those who have played back in the day I am sure this makes sense. The game is just not as good as it once was. It's really sad, I really wanted the experience I once had with the game and will never get that again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "My Girlfriend is Making sleep on the couch because i play this to much. I have 33 hours in one week of playing. this game is too good and now i prioritize it over pussy. See me as a warning",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "devs, and comunity got their own thumbs up their own dont know what.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is HORRIBLY grindy, you can technically pay 2 skip progress but i'm not made of gold so yeah. If you are poor and have no time don't bother with this one chief",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Once a darling of the free to play genre, Warframe has dissappointingly gone the way of so many others and become a mostly corrupt mess. It plays a lot like a mobile game now with timers and gates on everything, constantly demanding your microtransactions to avoid hours and hours of farming, which they also made impossible to do afk. Nerf by nerf, little by little, a once fairly enjoyable experience where you could unlock everything on Cetus in a week or so has become months of grinding Fortuna rep with a faction you dont like so you can get the Xaku warframe from Deimos. But hey thats okay you can avoid that just get out the wallet and pay to make the problem go away.\n\nI played Warframe for years and I've always tried to get people into it, but more and more as time progresses I have to add caveats. You can play a huge open exploration map... unfortuantely half the mining nodes are bugged or placed on the roof where you cant get them. You can play as nearly 100 characters. It takes 8 hours of farming each one but hey you can kinda technically do that thing eventually in three years of playing 8 hours daily. All of the original frames will get nerfed and youll have to unlock new variants like Excalibur Umbra to do anything, following endless story missions that are disperate from one another and dont feel like they contribute to a central story. One second youre killing Vay Hek and the next second hes been dead for 3 years and his zombie is back. The pacing has become an absolute nightmare. There is feature bloat on top of the existing feature bloat and its very easy to break the flow and sequence of the story and be left in narrative limbo wondering what the heck is going on, whos working for who, and why I should even care when nothing has any consequences because you're just space jesus anyway. I've played a lot of the new content (unlocked Nokko, sorta fun, functionally useless compared to similar frames that work a lot less for the same result, but being immortal is cool) and done the Call of the Tempestrati, which was an absolutely abysmal experience about an edgelord, a hamfisted variant of phoenix from valorant, token asian female, token dominatrix female and a 90s tech nerd. Its gonna be tough hacking through all of that trash and dealing with those characters who have been done to death so many times I dont remember a single one of their names. Phoenix is called something like \"Clancy\" and has a sissy white guy name but thats literally all I remember about these characters im apparently supposed to like according to the story. They are utterly forgettable. The samurai guy has a scar over his eye. The british gangster guy unironically says \"SKKKRAAAA\" like youre in a battle with Big Shaq. They all call your character \"Marty\" which is a really funny reference to that joke they did two hours ago where one of the characters called you \"Marty McFlea\" because of your time travelling.\n\nThis game used to be about stuffing cyborgs up the asses of mutants because you were the last real human left and now it's about using friendship magic to stop temporal paradoxes in the boopledompf region from causing a cascade resonance in the disseltinkledink and doing a woozlewah, which is really bad for you let me tell you right now, im not going to show you at any point im just going to have characters endlessly babble about it during every mission. In a genre that thrives on \"Show, don't tell\" this games narrative is presented as \"Tell and tell and tell and tell and tell and show 1 second of the problem, then tell and tell and tell and tell...\". Heres 20 character names that will mean nothing to you in an hour. Because Dunbar's number isnt real.\n\nI'm still gonna play this game just out of raw stubbornness. Some kind of sunk cost fallacy, or nostalgia for the times when you could just log on, pop World on Fire, and chat about builds with other Tenno. When the strategy of the studio was to deliver enjoyable content and not to just shit out mobile garbage with time gates to keep you playing for as long as possible, because that increases the odds of you spending. The fact that the mining nodes still dont work properly 15 years later makes it extremely unlikely that I'll ever start Soulframe though. With Warframe quickly running out of ideas the next hare brained installment is going to be pure Chinese mobile game market inspired garbage. The writing is already on the wall. Who even asked for the Wukong warframe? Have you ever seen anyone use it? Lets go with that design for our sequel. The one thing in the entire game that noone likes. People play Atlas for christ's sakes XD",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "having to metagame to understand how a game mechanic works, then finding out its based on audio cues that have zero accessibility accommodations, just to solo a simple mission after a long break wtf. fix ya game DE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I personally can't recommend this game\n\nAs someone who favors single-player games, I kind of enjoyed my time so far. The story is intriguing and the community has been nice up to this point.\n\nBut there are a few issues that make the experience a no-no for me.\n\n[-] [b]Enemies keep respawning in areas I've already cleared.[/b] This one is negligible and I get it that the game doesn't want me to ever feel like the map is empty, but there's a difference between a map being empty and being empty because I cleared it.\n\n[--] I tried playing in public, which means people may join me on a mission when I start one, and I had nothing but bad experiences that forced me to go solo. [b]People ignore me greeting them and directly go for the mission objective,[/b] whereas I prefer to take my time and explore the area at my own pace. Not even a \"Hello.\"\n\n[--] [b]A lot of things are taken for granted and information is scattered around without any logic.[/b] Let's take for example the help text that explains Polarities. It's shown after a looong list of help texts for no apparent reason, not to mention I don't even have the certainty that it's there in the first place unless I loop through them all. Overall not a great new-player experience. Every piece of information in this game is placed in a list of tooltips that you read by continuously pressing the same button, which does not play really well in my opinion.\n\n[---] [b]Enemies can see me through closed doors and on different height levels.[/b] Enough said here. Often the doors are also already open due to enemies standing too close, which makes them spot me immediately. I am supposed to open the doors, not them. And if they do it should be because I somehow alerted them and not because they were walking around there.\n\n[---] [b]My play style is completely invalidated by multiple factors.[/b] I prefer to play stealthy from a distance rather than melee the whole level, but that's never actually possible. Rooms are FILLED with alarm stations to the extent that even preventing one enemy from triggering one is pointless as there is another in the backroom easily accessible for the others. Not to mention you CANNOT disable an alarm station beforehand.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "this is a great game if you enjoy developers that dont care about their players or their concerns, god forbid you help and play this game for 9 years without a single issue and one chat message as dumb as mentioning Nezhas feminine stature will get you PERMANENTLY BANNED. oh but theres an appeal section just submit a ticket. sure, that would work great if it didnt take them 3 weeks to respond only to hit you with a generic copy paste of the EULA aggreement and not put you in contact with anyone with the players best interest in mind. you wanna make a new account? too bad, that one will get banned too for \"avoiding\" the first one without warning, whether you apologize or write tickets, try to move onto different accounts even new platforms and ISPs digital extremes will ban you because they DO NOT care about their players. 2500+ hours in this game and 3 attempts to rejoin the community after hours of my life spent helping others and enjoying this game and I, aswell as THOUSANDS, of others are unable to return to the game they love because DE is an incompetent company that refuses to adress player concerns or update their support system. no, i do not reccomend this game. stay far away from these scumbags.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "WOW, this game is bad...repetitious right out of the gate, by the time I hit 5 hours I was wishing I'd never heard of this game. It is very pretty, and pretty shallow. Controls are just awful, slow to respond and animation locked. This game is ALL about looking pretty, game play falls a distant second. Mash your button/special again BTW.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like woke fodder, censorship in all forms of communication, capitulation to the Chinese authority, and endless farming for the next non-end game gear then this is your new master. Get ready to scrape your knees and hollow out your throat because this free to play game wants your money however worthless way that they can divide you from it. FARMFRAME!!! Something new and unimproved every two to six months and all it requires is more time than you will ever have!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "All the money i put in to this game is gone!!! everything i had and grind for is gone cuz of the dumb dev del my account cuz i havent played over a year, you know people have lifes...!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I find the game way more of a grind to get anywhere, and the story is confusing. i think i will pass on this for now and play destiny 2  as i feel like at least its a more direct experience experience and your not forced to do the story for most of the content to do anything",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do NOT get this game at all.you will NOT have fun. I'm not saying this is in a fun way or funny way either. you will waste your time on this pay2win slop they call a game. it's not worth your time if you're returning or new. they will shove micro-transactions into your face as soon as you launch. you will \"get\" free stuff, but it's just an incentive to get you to waste your time further. Do NOT play this if you value your time and money. as i was writing this review, i saw DLCs for new players. one of them is 160 dollars. WARFRAME is a scam and is not worth it. Another game commonly compared to warframe is Destiny 2. You may think that Destiny is worse (which it isn't), ofr the amount of DLCs it has, BUT you can get two DLCs for the price of one at a lower cost then DLCS meant for new players.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Been playing since the silver grove update and was dissapointed to find myself banned with no warning",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "just finished the quest line with the weird doll and thanx or something like that. annoyed me that playing as a human in the weird mirror relm didn't keep my same keybinds as when i was playing the regular mode that shouldn't happen in an apparent mql that i have to do.................",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "used to play this before but now Cant login cant signup. stupid recaptcha",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "first day: fun \r\nsecond day: grinding \r\nthird day: regret\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n100 days in: grinding \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nday ????: Help",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ugliest characters I've seen in a game. Anti-cool ninjas.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The key to faking out the parents is the clammy hands. It’s a good non-specific symptom; I’m a big believer in it. A lot of people will tell you that a good phony fever is a dead lock, but you get a nervous mother, you could wind up in a doctor’s office. That’s worse than school. You fake a stomach cramp, and when you’re bent over, moaning and wailing, you lick your palms. It’s a little childish and stupid, but then, so is high school.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh. Confuse for new players. I reach a level limit and drop off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "been raking in cash off this lazy pile of crap they made over a decade ago and have not done anything at all with except add new bullshit to the cash shop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a waste of time that will try to femenize your brain with girly horse shit and at no fucking point in the EULA did it say i would adopt the mentaly ill white child",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "have to be completely honest: Warframe’s support system feels completely robotic and lacks any real human empathy. When I contacted them about my permanent ban, I only received automated, pre-written responses. It felt like no one actually read or understood my situation.\n\nAs a dedicated player who spent time and money in the game, this is extremely disappointing. The support process is rigid, cold, and gives no chance for meaningful dialogue. Right now, it feels like you’re talking to a bot rather than a real person.\n\nI hope the developers seriously reconsider how they handle player support, because the current system is frustrating and leaves loyal players feeling unheard and ignored.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game is to buggy on pc runs fine on console fix this bs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "massivley over complicated and most missions are single player",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "incredibly grindy and repetitive. Don't waste your time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "cant run and falls like a baby (-_-) 1/10 would not recommend. Good graphics but so does clash royale. he loses bones like I lose baby teeth, gets eaten by worms, I dont know maybe he should try shower next time. hes slower than the worm. stone is invisible :))))))))))))))))))))))) the worm is camping. he runs like a paraplegic",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thumbs down, because if I thumb it up I’ll keep playing. Please, someone, take the plats from my hands.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kuva lich is probably the worst mechanic ive seen in any game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "хз, симулятор резни хуй пойми кого за бессмертного хуй пойми кого, скукота одним словом",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally impossible to sign up on steamdeck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "6 hours to grinding to get a simple resource to play the game and none drop. terrible drop rate in this game and not new player friendly. PLAY ANYTHING ELSE",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The new war ruined it for me. Whatever dev thought it was a good idea to lock people in that quest no thank you. There should be an option to skip that questline entirely I refuse to play through that garbage until they make a skip for it I wont pick this back up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Woulnd't actively recomend to people but still a fun game while it lasted.\n\nIt's fun for roughly the first 100 hours but after that it starts going downhill, and getting real boring to the repetative nature of things, there isn't much done for the likes of me to keep the gameplay and gameloop fresh so it died out for me after that. But it still was pretty entertaining for the first 100 hours. (Also best played with friends/guilds)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The New War quest is a game stopper. Its, incredibly stupid and a complete different game and it locks you away from the parts of the game that you love.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ban until 2035 for being reported chat is really unreasonable, instead of being able to ban chat or ban for 1 month.\nI have spent thousands of hours and hundreds of dollars on this game. I really love it but this has made me have a different view of the support team\nThe game is biased towards Chinese players\nYou can go to forums, youtube, you will see many articles talking about being banned for chatting but words like 'The' are also considered a violation according to their rules if reported, 'Killer....', 'Stupid'\nThe only case of being unbanned the first time is because you are Chinese, you also know that the game is currently being bought back",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great game terrible developers. They don't censor words in their chats and permanently ban you for saying words they don't censor. Lost my 7 year old account over saying the F word which they dont censor. so instead of censoring the word they will ban you from accessing years of gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "People say \"it's ninja fps go brr\" when really it's just a practice of constantly running the same monotonous missions over and over again, with invulnerability because the devs can't get it through their head standing in one spot immortal and shooting shit is not fucking fun. \nLook, if you want to play a game semi-afk with your brain off shooting enemies, abusing shield gating or invulnerability passives go head. If you want some actual gameplay over standing like a turret shooting targets grinding for the next \"ooo shiny something\" look somewhere else. Also enemy HP is still dogshit at scaling because ooo lets use a really lazy scaling algorithm that relies on the player to maximize crit damage and base damage. cus fuck actual build varity.(Viral+Heat+Magnet damage)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I said the word Wuz in a friendly manner. Its suppose to be the polite version of Pus\"\" I got instant kicked lost 45 minutes of farm progress. FOR wuz?!?!?!!?!?!?!?!?!!?!?!?! \n\nWhile developer Digital Extremes does not release an official list of blocked words in\nWarframe, you can generally know what to avoid by following the game's Code of Conduct, which prohibits hate speech, targeted harassment, and other abusive behavior. The game's automated chat moderation, which can result in bans, often has a strict interpretation of these rules. \nHow to detect a \"wrong\" word",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun, but holy hell are there bugs all around. Some go way back, as old as 8 years and have yet to be fixed. And this is more of a sidenote, but the necessity to research for how to complete a mission online is coming up quite often, especially if you don't wish to hear every Npc interaction and quieten the game to low volume.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Online multiplayer game advertised as coop but the main quests and all good content is single player.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I put around 1700 hours into Warframe. I grinded everything, pushed through every wall, aimed for endgame, and genuinely loved it. Then suddenly — boom — I’m permanently banned for a chat argument from months ago. Someone provoked me, insulted me, kept poking at me, and I finally reacted. One moment, one sentence — and apparently 1700 hours don’t matter. For some people that’s literally years of grind wiped out instantly.\r\n\r\nHere’s the part people really need to understand — because I didn’t, until it was too late:\r\nYou don’t need to be insulting someone.\r\nYou don’t need to mean anything malicious.\r\nYou can literally be joking with your own friends.\r\nYou can say something that wasn’t intended to offend anyone at all.\r\nAnd guess what?\r\nA single moment, a single slip-up, one stupid sentence in clan chat or squad chat — and months later it can still come back and obliterate your entire account. No warning, no “hey, don’t say that,” no nothing. Just instant permanent deletion.\r\nThey don’t hand out mutes.\r\nThey don’t hand out temporary timeouts.\r\nThey go straight for “remove this player from existence.”\r\n\r\nAfter my ban, I started digging into it — and it turns out this nonsense is everywhere. People get banned for harmless jokes, friendly sarcasm, or something taken completely out of context. Even long-term players with perfect histories get wiped instantly. The system doesn’t care what you meant or who you were talking to — it just swings the hammer without thinking.\r\n\r\nAnd here’s the part that really makes you laugh (or rage):\r\nLoyalty means absolutely NOTHING.\r\n1700 hours? Doesn’t matter.\r\n3000 hours? Doesn’t matter.\r\n5000 hours? Still doesn’t matter.\r\nYou can be the most dedicated, helpful, legitimate player ever — if you type one wrong word once, even if it wasn’t serious, even if it was friendly banter, even if you were DEFENDING yourself, the system will nuke your account without hesitation. Being loyal? Forget it.\r\n\r\nReaching out to support?\r\nPrepare yourself.\r\nYou’ll get the most robotic, emotionless replies imaginable. It’s like they have a menu of preset responses and pick one at random. There’s no real conversation, no context, no attempt to understand anything. You might as well send your ticket to a refrigerator — at least it won’t pretend it cares while giving you copy-paste nonsense.\r\n\r\nLet’s be clear: rules are fine. But going straight to PERMANENT deletion over a dumb moment, a sarcastic joke, or a heated argument is ridiculous. It’s like handing someone a life sentence for arguing in a supermarket. Humans joke. Humans argue. Humans get annoyed. Humans make mistakes. But in Warframe? You’re expected to be a flawless, emotionless robot 24/7.\r\n\r\nAnd the most ridiculous part?\r\nChat is basically the backbone of the entire game.\r\nTrading, recruiting, clans, squads, help channels — without chat, Warframe would collapse. The game relies on communication. Yet the same system that keeps the community alive is also the fastest way to lose your entire account. Want to enjoy the game? Stay away from chat. But without chat… what exactly are you left with?\r\nThe irony is painful.\r\n\r\nHonestly, once the shock faded, I almost felt relieved. Because the truth? The grind is brutal. I genuinely have no idea how new players survive without spending money. Free-to-play players? Prepare for thousands of hours of grinding. I spent some money — not even much — and even then I barely touched endgame. Without paying, I’d probably still be stuck in the early star chart.\r\n\r\nSo here’s the final warning:\r\nWarframe is an incredible game — one of the best gameplay experiences out there.\r\nBut the chat system?\r\nIt’s a landmine waiting for you to step on it.\r\nStep on it once — even by accident, even joking with friends — and your entire account evaporates.\r\n\r\nIf you choose to play:\r\nEnjoy the gameplay.\r\nEnjoy the combat.\r\nEnjoy the world.\r\nBut be careful — because ONE single word can cost you everything you ever earned.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Full of bugs have glitched outside the map 10times during missions, missions bug out often, the game worked better in the beta and alpha",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wanted to get back into the game after years, but I gotta pay to change my username? Fuck that",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have been playing Warframe as a free to play player since 2015, I like the game but I have to admit I still can't recommend it to anyone.\nThere are still a lot of issues that have existed for years that have not gotten fixed or properly addressed like gameplay bugs. \nI've had this specific issue for a long time, I'll switch to my operator and sometimes I get locked into a glitchy run animation and I can't use abilities or any weapons until I use a console command or die to get out of it.\n\nI can honestly look past this issue, the main problem is that a lot of warframe's content is just more beneficial to run with squads or at the very least with randoms so you have to experience P2P disconnects unless you have a trusted squad to run with.\n\nI had a terrible experience when I was running relic missions with random players on survival missions on steel path and a player in my squad wanted to extract at 5 minutes so he tried extracting but couldn't because he didn't mod his equipment properly and he used all his revives.\n\nI noticed this person was the host as well, and when he realized the rest of the squad didn't want to extract, he left or disconnected and caused a host migration which failed and disconnected my entire squad so I couldn't even relic share with the other two who got disconnected.\n\nI don't blame this person, I blame the fact that warframe has used player hosted sessions for years to reduce costs which has been understandable at one point but now that Digital Extremes announced their new game which could also have P2P and not to mention already that Digital Extremes is making $25 to $141 million annually.\n\nif your previous games are known to have issues like these, how can I trust that your new game won't have these exact same issues? Or if they will ever get fixed?\n\nI also felt that the recently added \"The Teacher\" quest did not explain the importance of ability strength, duration and range which I can see a lot of new players still not understanding how modding works. Hopefully they wont end up like the guy who caused a host migration.\nWarframe is a great game, especially for someone who doesn't want to spend a lot of money on a game. I just can't recommend it for newer players until these issues get fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you get sucked into eternal grindation 10/10 would never recommend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You must choose to either aim or shoot. And if you are able to aim at your target and then shoot it jumps post. -UV on pitted against you...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fix your bounties. you create unfinishable/winnable bounties based on enemies literally not spawning fast enough.\r\nA bounty requires 100 kills to finish. you don't spawn enough to complete within time limitations.\r\nthis constitutes a negative review because Ive wasted 18minutes multiple times because the missions simply don't spawn enough enemies. anger. fix this",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}