{
  "positive": [
    {
      "review": "-spend 4 hours learning the game against bots\r\n- get confident enough for a multiplayer match\r\n- gets SLAMMED SO HARD\r\n-the guy friends me and asks if im okay because he thinks im having a stroke with the way im playing.\r\n- go back to bots :(",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "This is one of the best RTS games ever made. The gameplay is cinematic and the mechanics are unmatched.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "i remember this game like i remember being a teenager: happier.... full of life.... flame clown cars.... random OP elite troop blobs that suffer no MG suppression.... i miss it all....you never know what you have until it's gone.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "this game is one of the best strategic games i played \r\nbut its not so realistic as i thought \r\nbut i recommend to waste ur time by it and play it with ur friends \r\nfun fact i am always a noob in this game :)",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fantastic RTS game with countless different units and abilities, and endless opportunity to adjust strategy. \r\nHighly recommend.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "CoH2 – The Best RTS Out There\n\nCompany of Heroes 2 is tactical brilliance in action. Every battle demands strategy, positioning, and quick thinking. Destructible environments, balanced factions, and intense multiplayer make each match thrilling and rewarding. For any RTS fan, this is unmatched WWII strategy at its finest.\n\nDecisions matter — one misstep can turn the tide of battle, making victory feel truly earned.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "still the greatest rts ever made. im never buying coh3 you'll never catch me playing that slop shit",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "COH2 is still a pretty good RTS game to play both against players and AI, although AI can be dumb, using mods allows them to be at their full potetial... or be utterly bullshit and steamrolled you, which is fun too !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun to play with a friend, HOWEVER the computer is vicious on harder difficulties. Once you learn the build order that works best for you, I think you'll find out that this is a gem and well worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played CoH3 on my Xbox before switching to PC a year ago and it felt like absolute unfinished modern slop, this game is much better to play in basically everyway so far: \n-Combat feel, attention to detail with units, map design, and just the overall aesthetic of the game as well as general design choices feel much better than CoH3 (Ostfront > Italian Front all day). \n-It has a well established modding scene; Wikingr, Spearhead, Eichenlaub, AllUnits mod etc. A few of the mods I mentioned are a complete overhaul of game mechanics and unit roster. Better yet, they make the AI much more competitive to play against. Aggressive, good use of their unit comps and proper usage of their commander call ins. This is great as the intelligence of the Vanilla AI is arguably the only thing CoH2 lacks compared to CoH3. \n-The game still has a fairly active multiplayer scene for it's age but of course most of them will crush a newbies so your mileage will vary. \n-Yes the game has alot of DLC, as does CoH3... The in game supply system allows you to earn new Commanders/Doctrines, intel bulletins (stat modifiers such as increased accuracy for a specific unit type), skins and etc just by playing. I got the complete edition of the game with all DLCs and bundles for less than 40$, and I'm sure you could find keys for even cheaper.\n-Last but not least no retarded woke campaign or modern goyslop feel like I got from playing CoH3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game both single and multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic and fun strategy game, would absolutely recomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game I come back to when I'm tired of role playing, first person shooter, I want to kick back and think strategy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First playthrough review time.\n\nI got this game for free, and it is a real-time strategy game set on the Eastern Front of the Second World War. In this type of game, players control their army and make decisions while the battle happens at the same time, instead of waiting for each side to play one after the other. The game shows big battles, changing battle lines, and the push to control more territory. Players need to capture and connect key areas on the map, as these provide the resources needed to build and strengthen their army. Buildings, cover, and unit upgrades all affect how fights unfold, making each battle feel different depending on which areas are held.\n\nThis game includes two main campaigns, the Soviet campaign and the US campaign as well as additional scenario based missions through the Theater of War DLCs. The game also includes features that make careful planning important. Units can only see so far, so moving without thinking can be dangerous. Weather plays a big role too, with deep snow, cold, and weak ice affecting how soldiers and vehicles move. Additional missions give players more battles from both sides of the war, showing different situations and challenges.\n\nOverall, the game gives a detailed and challenging look at fighting on the Eastern Front. Players need to make steady decisions, pay attention to the environment, and control their territory carefully. All of these elements work together to create a strategy game where planning, movement, and resource use are very important.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST WWII RTS GAME EVER, 2000hrs of gaming just passed so fast that I couldn't realize it...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game I love death charging infantry, bit difficult if you are new to the rts genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun strategy game, a little micromanagement heavy, but that's to be expected regarding games similar to this.  Can be frustrating at times, (especially when your veteran team gets obliterated by a heat seeking mortar, or when your veteran vehicle gets destroyed by an at rifle as you can't avoid them when they're fired at the vehicle).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest WW2 RTS game series. I prefer the original COH but COH2 has a larger player base for multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Reasons for future me not to come back to Multiplayer out of nostalgia:\n- Conenction Lost. It happens randomly throughout the game and you can do nothing about it.\n- Matchmaking is not working anymore. You will lose 7 games in a row which will bring you into a tilt because you will be assigned to matches with people much higher experience who will obliterate your army and you can learn nothing from it because the difference in experience is extreme.\n- Playing agains bots is boring. You will win every match against extreme difficulty bots so there is no fun here.\n\n14 Nov 2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Alright game, but doesn't compare to the first one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game! Loved the first part and now this was even better. Soon gonna get the third version seems cool as well !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, similar in style to the old Command and Conquer games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, I recommend this game to any person seeking for a solid RTS. The campaign is good for what it is and it serves as an introduction to newcomers. Mods give this game infinite replay-ability, especially when it comes to skirmish mode. \n\nOnly downside is the DLCs being a little bit too expensive. Pattern packs are waaaayyyy to overpriced and it's infinitely better to use mods. Otherwise, I recommend this game, especially when it is on sale. \n\n9/10 for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TL:DR; About the best CoH in terms of balance and mechanics. Fun campaign, a terrible portent of things to come in terms of Nickle & Dime-ing DLC for Relic and Sega.\n\nIts hard to think of much to say about this that wasn't already true of the first. Each faction feels reasonably balanced against each other and represents the strength/weakness of their historical counterparts. Campaign is good and gives you a good mix of unique scenarios to overcome as it teaches you how to play. I'd say the history is reasonably portrayed as well, which is important as we move further away from its living memory.\n\nI'm not good enough to play this against humans, and I can manage versus the AI. I don't have much to say about the Player Vs Player multiplayer, but it seems mostly fair enough from what I've experianced-\n\nMostly. Aside from the deluge of cosmetic DLC which is more-or-less ignorable, every faction aside from the soviet and basic german ones must be bought. Every commander except a small starter set who represents your selection of special units and ability's must be bought. You might not even like the faction or commander you buy until you try it- good luck getting a refund on DLC. Its obnoxious at best and actively harmful to players experiance at worst.\n\nIts a shame the DLC situation is the way it is as it always leave me with a sour taste when I think back on this game. Its rock-solid otherwise, and worth coming back to just to play through the campaign again and go a few rounds agaisnt the CPU.\n\nIf you're going to sell me a game. Sell me the fucking game. Don't shave off bits and pieces and sell them to me later.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game. I play all the time with family and friends. Its easily one of my favorite RTS. I only wish there were more skins and generals for the Allies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am God-awful at this game, but I love it. It has such a charm and awesome atmosphere, and it's really fun with friends. It does have a pretty steep learning curve tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game one of the few games where I can spend several hours on a match just letting things alternate very fun to build up as much as you can and have a back and forth standstill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good mechanics, good detail. Good strategy. Only improvement would be better hands off ability of the units. The AI of the units is pretty weak, requires a lot of player input/involvement.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good strat game, a little old but still fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game can often be badly affected when there is any change in internet speed etc. and this can spoil the game play. Older games using cdroms installing software on HDD didn't have this problem. Skirmish games should be included as Assault squad 1.Prices for games keep changing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best ever strategy game even better than its successor company of heroes 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Company of Heroes 2 is a real-time strategy game developed by Relic Entertainment and released as the sequel to the original Company of Heroes. It focuses on the Eastern Front of World War II, depicting the conflict between the Soviet Red Army and Nazi Germany.\n\nGameplay emphasizes tactical control of small squads rather than large armies. Players must use cover, flanking, and combined-arms tactics to succeed. The terrain and weather play crucial roles—deep snow, ice, and blizzards affect visibility, mobility, and survival, forcing adaptation to harsh battlefield conditions.\n\nThe campaign follows the Soviet perspective through a series of missions that mix scripted objectives with dynamic combat. It blends historical realism with a dramatized narrative about duty, sacrifice, and the brutality of war. Alternate game modes, including skirmish and multiplayer, extend replay value with varied maps and strategies.\n\nCombat is visceral and punishing. Every unit matters, and poor positioning can quickly lead to losses. Cover systems, suppression mechanics, and destructible environments make engagements dynamic and unpredictable. Victory relies on resource control and maintaining front-line pressure.\n\nVisually, the game uses the Essence 3.0 engine, featuring realistic lighting, particle effects, and environmental destruction. Snow, fire, and debris react dynamically, contributing to immersion and strategic variability.\n\nSound design is exceptional. Explosions, weapon fire, and soldier dialogue are impactful and situationally aware. The orchestral soundtrack and multilingual voice acting reinforce the grim, authentic tone of the Eastern Front setting.\n\nOverall, Company of Heroes 2 refines the tactical formula of its predecessor with harsher environments, improved visuals, and demanding strategy. It remains one of the most polished and intense WWII real-time strategy games, rewarding players who value precision, planning, and adaptability.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Quagmire would be a more appropriate title. It's a fun frantic simulator but the simulation is getting into a war of attrition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "recommended , historically accurate and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love Strategy game but hate realism aspect from strategy game, then this game is perfect or you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every faction is op except my own which is underpowered, which makes me wonder why I'm playing said faction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best RTS games I've ever played. Mechanically best out of the three.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best CoH, but most of the people playing MP on this shouldn't be allowed to access online games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great fun and tactical",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a strange man from the internet has me play this game with him. its alright",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, would like to change camera angle though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "when i dream i see the Pak40 shoot, and i watch the sherman deflect it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "with 44-45 realism mod this game is amazing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty much a strategy masterpiece.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Part 1 is my favorite of al time. This ones respectable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bridge chokepoint: Check!  88's and flak pointed at bridge: Check!  \r\nField artillery pointed at enemy base: Check!\r\nDeath from above!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game best $18 spent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dont buy coh 3, buy this, trust me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game to spend time on",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fucks harder than a step brother on the hub",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun. don't forget to flank",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sturmtiger goes boom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Get this verdammten Panzer out of here!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tankları yürütmeye çalışırken haktan",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best RTS ever made!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than coh 1 and 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best ww2 rts in my opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gud game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love defend. defend is life",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nobody reads my reviews anyway.\nI'll throw in a recipe for Varenyky.\n\nRecipe for Potato Dumplings (Varenyky)\nIngredients:\nFor the dough:\nWheat flour – 500 g\nWater – 200 ml\nEgg – 1\nSalt – 1 tsp\nFor the filling:\nPotatoes – 1 kg\nOnions – 2\nLard or butter – 50 g\nSalt – to taste\nGround black pepper – to taste\nPreparation steps:\nMaking the dough:\nSifting the flour: Sift the flour into a large bowl.\nMaking the dough: Add salt and the egg to the flour. Gradually pour in the water, constantly stirring. Knead the dough until it becomes smooth and elastic.\nResting the dough: Wrap the dough in plastic wrap or cover it with a towel and let it rest for 30 minutes.\nPreparing the filling:\nBoiling the potatoes: Peel the potatoes, cut them into large pieces, and boil until tender in salted water.\nPreparing the onions: While the potatoes are boiling, finely chop the onions. Sauté the onions in lard or butter until golden brown.\nMaking the potato puree: Drain the potatoes and mash them. Add the sautéed onions, salt, and pepper to taste, and mix well.\nForming the dumplings:\nRolling out the dough: Roll out the dough into a thin sheet about 2-3 mm thick. Use a glass or cutter to cut out circles approximately 7-8 cm in diameter.\nForming the dumplings: Place a spoonful of potato filling on each circle of dough. Fold the dough in half and pinch the edges tightly to seal the dumplings.\nCooking the dumplings:\nBoiling water: Bring a large pot of water to a boil, add salt.\nCooking the dumplings: Gently drop the dumplings into the boiling water, stirring carefully to prevent sticking. Cook until done (approximately 5-7 minutes after they float to the surface).\nServing:\nRemoving the dumplings: Remove the dumplings with a slotted spoon and place them on a plate.\nServing: Serve the dumplings hot, optionally drizzling with melted butter, sour cream, or sautéed onions.\nEnjoy your meal!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Very nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best coh",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolute Childhood Nostalgia",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bloody good show!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "so many leavers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "CHINGON!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hell yea brothers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "лучшая rts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kino",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "*thumbs up*",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "😪✌️",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a badge",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "tank",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yaaaaaaaaaaaaaaaa",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GHB",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ya",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣤⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⣰⣿⣿⣿⣿⠿⠿⣿⣿⣿⣿⣿⣿⣿⣧⢀⠀⠀⠀⠀\n⠀⠀⠀⣿⣿⣿⠋⠀⠀⠀⠀⠀⠙⠀⠙⣿⣿⣿⣷⢳⢀⠀⠀⠀\n⠀⠀⣠⣿⣿⣿⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⢀\n⠀⠀⣸⣿⣿⣿⠸⠀⠀⠀⠒⠒⠒⠐⠀⠀⢿⣿⣿⣿⣿⣿⠀⠀\n⠀⣴⣿⣿⣿⡿⠀⠒⣋⣙⡒⢰⠀⠤⣖⠒⢾⣿⣿⣿⣿⣧⠀⠀\n⢺⣿⣿⣿⣿⢀⠀⠀⠉⠉⠉⠸⠀⡇⠉⠉⠀⢿⣿⣿⣿⣄⠀⠀\n⠀⠙⣿⣿⣧⢻⠀⠀⠀⠀⠀⠠⠀⠰⠀⠀⠀⣸⠸⣿⣿⠿⠰⠀\n⠀⠀⠀⠹⣿⣿⣿⣷⠀⡠⠙⣲⣔⣅⢡⣰⣷⣿⣿⣿⣧⠀⠀⠀\n⠀⠀⠀⣼⣿⣿⣿⣿⠀⡿⠭⠭⠭⠭⢿⠀⣿⢻⣿⣿⠃⠀⠀⠀\n⠀⠀⠀⠙⠛⣿⢻⠹⣿⠐⠙⠛⠟⠉⢀⣴⡟⢿⣿⡏⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⡟⠀⠀⠻⣦⣤⣶⠾⠋⠀⠀⠁⡦⢄⢀⠀⠀⠀\n⠀⠀⠀⠀⡠⠁⡇⠑⢄⠀⠀⠀⠀⠀⠀⠔⠀⠀⠁⠀⠀⠀⠉⠁\n⠀⠔⠊⠁⠀⠀⣇⠀⠀⠀⠑⡤⠤⢎⠁⠀⠀⡘⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⢢⠠⠀⡠⢆⠀⠀⡠⠙⢄⠀⡸⠀⠀⠀⠀⠀⠀ You're breathtaking",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fairly solid game with a fun campaign, a fun vs AI skirmish mode, and... well a questionable PvP community. One match, my teammate yelled at me to leave & even started attacking me for being bad at the game. Never touched it again since.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "This is one of the best RTS games ever made. The gameplay is cinematic and the mechanics are unmatched.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Company of Heroes 2 is one of the most complete and best strategic simulators of World War II. The gameplay is highly realistic and every battle feels authentic. The level of detail in the tanks and combat vehicles is outstanding; from the way they move and sound, to how they take damage and the tactical role they play on the battlefield, everything conveys the feeling of real warfare. The story campaign is also truly breathtaking and delivers an unforgettable experience. If you are looking for a deep and thrilling historical strategy game, this is a perfect choice.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "i remember this game like i remember being a teenager: happier.... full of life.... flame clown cars.... random OP elite troop blobs that suffer no MG suppression.... i miss it all....you never know what you have until it's gone.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "this game took a dear friend of mine...for him, nothing else exists anymore but this game....it must be a really great game...",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "One of the best RTS game, especially with friends and mod :) \n\nVanilla is useless, bulletproof troops and artillery resistant squads are not fun at all. I recommend AKULA World at War mod, in my opinion it has the best balance between realism and fun. \n\nOf course as the first one, optimization is crap and Relic are rats with their DLCs. Just make sure you have the 5 factions (everything else is useless) and check out guides for optimization.\n\nWorks well on Linux with Proton, make sure you follow the guide to copy the right ucrtbase.dll to avoid sync error in multiplayer.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "-spend 4 hours learning the game against bots\r\n- get confident enough for a multiplayer match\r\n- gets SLAMMED SO HARD\r\n-the guy friends me and asks if im okay because he thinks im having a stroke with the way im playing.\r\n- go back to bots :(",
      "voted_up": true,
      "votes_helpful": 3
    }
  ],
  "negative": [
    {
      "review": "Just found this in my library, somewhat nice game but extremely little content, seems more like a demo than a full game, only 2 factions to pick from (Germany/USSR), quite a few maps though but nothing else.\n\nWouldn't really recommend to spend money on unless you wanna pay to play the other factions.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game look's nice, good details and voice actor's are really good too, but i do have a problem with how HUD look's and the ammount of stuff that happens in short ammount of time. I played CoH 1 before and well its amazing game. CoH 2 is good visualy and with sounds but HUD and main menu are kinda too flashy. CoH 1 had this dark color not so flashy which was giving off feeling of war game. Mechanics are well not bad either but comparing them to CoH 1 they are bad and the ammount of restrictions campaign gives you is really annoying. Of course CoH 1 campaign also gave you restrictions but still you had time to do your own tactics while in this game like i said its too fast everything happens in short ammount of time which is confusing. 4/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Needs no introduction, a considerable package in an alternate strategy-game style of resource management that scratches a unique itch for most. However, the 64-bit update released a few years back annihilated my performance (on modern specs, mind you!) and I expect not to return in favour of its predecessor CoH 1.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's an extremely frustrating game and a genuine waste of time. The AI has the worst pathfinding I've ever seen in a game, and to make things even worse there's collisions between vehicles to the point you have waves of tanks and even soldiers frozen in place because they can't move. The AI is a blatant cheater, with a certain double standard when enemy tanks can mow down your soldiers like a hot knife on butter but your own tanks will take forever to take down enemy soldiers. \r\n\r\nThe game also crashes frequently, and there's also desyncronization problems that really cause hours of your life to be lost. \r\n\r\nBasically, it's not worth it. In some ways, even Age of Empires 2 is better than this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's a good game but when a big enough explosion happens my computer instantly turns off...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It can be good with the right mods. But Relic should really open up the mod tools for this game to thrive more like the first installation. I also really don't understand this scummy microtransaction politic. Locking a faction behind 10 bucks. Shame on you for all of this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant load the game. game suckls",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No german Campaign and the design of the Ui.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game sucks bad now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mac users cannot play with windows players",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant even start anymore",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too much DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"Unable to connect to Relic servers\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i got turned into ai",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. Locking parts of the game behind paywalls for no reason is scummy.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Play games against PC, go against people, get matchmaked against 3k hours diabetic team, uninstall, repeat.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Don't buy the base game you dont get access to any of the campaigns or missions only online play or Skrims. So dont look at the base game price point at all just look at with DLC or theres no point. Playing vs player that have years of experience is not fun as a new player and you cant really learn the game unless you play vs ai since no story missions are unlocked.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Haven't played CoH2 in a while but even when I did it was apparent how greedy this game can get. Locking nations of World War 2 (especially large players in the war) is not only scummy but disrupts engaging gameplay in a rather nasty way. I don't have much to say given how little I care to even play this game years later.\r\n\r\nAvoid unless you like shelling out tons of money.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "That's the most unfair game you will ever play. Even if i have 200 hours in this shit i wouldn't recommend this to anybody. They should pay people to play this fucking crap. For your sanity i suggest to stay away from this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game look's nice, good details and voice actor's are really good too, but i do have a problem with how HUD look's and the ammount of stuff that happens in short ammount of time. I played CoH 1 before and well its amazing game. CoH 2 is good visualy and with sounds but HUD and main menu are kinda too flashy. CoH 1 had this dark color not so flashy which was giving off feeling of war game. Mechanics are well not bad either but comparing them to CoH 1 they are bad and the ammount of restrictions campaign gives you is really annoying. Of course CoH 1 campaign also gave you restrictions but still you had time to do your own tactics while in this game like i said its too fast everything happens in short ammount of time which is confusing. 4/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Needs no introduction, a considerable package in an alternate strategy-game style of resource management that scratches a unique itch for most. However, the 64-bit update released a few years back annihilated my performance (on modern specs, mind you!) and I expect not to return in favour of its predecessor CoH 1.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is so buggy and the AI just cheats, I only play this for the WW2 strategy genre, but god is it frustrating how badly balanced and optimized this game is. I will not be buying anymore games from this compnay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was enjoying the campaign, playing on easy and it was fun........ until it wasn't!  Easy is not very easy, quickly became so challenging I couldn't win. I'm getting zerged by enemy tanks and I wasn't capable of building anywhere near enough. Maybe it's me? I expected easy to be, well, easy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Its kinda boring tbh I mean the game is good but it gets boring after a while I feel like people just see tank and gun and expect the game to be good for me at least I mean I looked up gameplay and reviews it looked cool but it's not all that",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's an extremely frustrating game and a genuine waste of time. The AI has the worst pathfinding I've ever seen in a game, and to make things even worse there's collisions between vehicles to the point you have waves of tanks and even soldiers frozen in place because they can't move. The AI is a blatant cheater, with a certain double standard when enemy tanks can mow down your soldiers like a hot knife on butter but your own tanks will take forever to take down enemy soldiers. \r\n\r\nThe game also crashes frequently, and there's also desyncronization problems that really cause hours of your life to be lost. \r\n\r\nBasically, it's not worth it. In some ways, even Age of Empires 2 is better than this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "20 hours was about the most i could do before the games systems got too irritating\r\n1. the unskippable cutscenes during the campaign were annoying to deal with, especially on hard mode\r\n2. the multiplayer has 1 gamemode that also got very irritating. the games are limited due to how many units you can control at a time. youre allowed to have 100 supply but every unit you create uses up a large fraction of that supply. you think youre playing an RTS with control over an army but you realize later you control maybe 7 units at most while wishing you were playing starcraft or aoe2 or anything else really\r\ni got it on sale so ill try not to complain too much, but if youre really interested in seeing what its about id suggest waiting for a sale as well",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't even play this game due to a broken title screen. How the fuck do devs let this shit slide? I didn't pay money to do the rest of your job, lazy fucking devs. 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the sever unstable like a garbage, keep crashing and disconnecting, and once you crash you cant rejoin",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is sold in parts with DLCs that all should have been apart of the main game. You can't even play as US forces without buying a DLC. I'll never buy from this developer again. I only paid $5 for the game and I overpaid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mac support issues blackscreen of death, joining by invite or anything game related black death screen cool.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Finally tried this game that I got for free in the library at some point, because I had an itch for, well, this kind of game.\r\n\r\nI'm primarily a single-player guy for RTT/RTS game, and I think this is the FIRST in the genre where I abandoned the campaign simply with how unenjoyable it was getting. Micro-heavy and plodding level design where your hard-capped resources have to contend with scripted and heavy-handed enemy spawns, often from directions you've already cleared and/or in quantities you shouldn't really be facing without placing a morbillion AT mines. The Lublin level was the last straw.\r\n\r\nAlso the game might be old now but it doesn't get a pardon for not supporting hotkey swaps whatsoever, even if you're ok with the absence of a WASD pan setting. I had to rummage and tinker for 40 minutes to get a third-party script do the trick.\r\n\r\nMight be a classic for many, but I was disappointed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "small POV camera that meant to create chaos, split second decision gameplay however AI failed to keep up with taking position, path finding and required constant babysit.\r\nGame design also plain simple with limited unit types, strategy, not recommended if you seeking for strategic nor tactical strategic game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant mod singleplayer, the tool was done terrible, and yet they banned a tool like corsix mod studio that could fix the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After finishing CoH 1 and playing this one immidiately,it feels like a cartoonish game,units when moving dont feel like they have any weight they move too fast and lighty around,the ragdols are non existing and big guns like AT and Tanks feel and look like toys when they move and fire,im sure the game is fun for some but if you are expecting something like CoH1 dont buy it because its not even close to that masterpiece",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this quite possibly might be one of the worst games I have ever played, and that's coming from someone who has played through the entirety of Superman 64 and Sonic 06, has several thousand hours in Destiny 2, and actually willingly bought Metal Gear Survive, so one could say I am well versed in games that are complete garbage. An rts from 2013 dropping in the single digit frame rates sometimes is actually wild to me. this is one of those games that you get for Christmas as a little kid and the cover looks super fucking cool, and then you put it in your console and it is the biggest disappointment your child eyes have ever seen. I got this game somehow like 2 years ago for free and I still feel as though i paid too much money for this. this might be the first game ever that i truly straight up just remove from my account, because not even a lap dance from Scarlett Johansson could convince me to try out this game again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a good game but when a big enough explosion happens my computer instantly turns off...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My friends always play Company of Heroes 3 in Discord and complain about \"Stucks\" and \"Blobbers\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "God forbid people running Linux would want to play with people running Windows. Who in their right mind would EVER want to do that?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know how to do basic things like install a machine gun or how to use a mortar team and I can't find any information anywhere. Also to ask for artillery is a mystery to me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It can be good with the right mods. But Relic should really open up the mod tools for this game to thrive more like the first installation. I also really don't understand this scummy microtransaction politic. Locking a faction behind 10 bucks. Shame on you for all of this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant load the game. game suckls",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No german Campaign and the design of the Ui.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mac users cannot play with windows players",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant even start anymore",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too much DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"Unable to connect to Relic servers\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "washed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. Locking parts of the game behind paywalls for no reason is scummy.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Don't buy the base game you dont get access to any of the campaigns or missions only online play or Skrims. So dont look at the base game price point at all just look at with DLC or theres no point. Playing vs player that have years of experience is not fun as a new player and you cant really learn the game unless you play vs ai since no story missions are unlocked.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game look's nice, good details and voice actor's are really good too, but i do have a problem with how HUD look's and the ammount of stuff that happens in short ammount of time. I played CoH 1 before and well its amazing game. CoH 2 is good visualy and with sounds but HUD and main menu are kinda too flashy. CoH 1 had this dark color not so flashy which was giving off feeling of war game. Mechanics are well not bad either but comparing them to CoH 1 they are bad and the ammount of restrictions campaign gives you is really annoying. Of course CoH 1 campaign also gave you restrictions but still you had time to do your own tactics while in this game like i said its too fast everything happens in short ammount of time which is confusing. 4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gave up on this after 3 failed attempts to complete the second mission, far too much happening on screen, too many unclear options, too many tasks to keep track of, maybe more experienced RTS players will like it but if you're not a hardcore RTS player don't waste your money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Haven't played CoH2 in a while but even when I did it was apparent how greedy this game can get. Locking nations of World War 2 (especially large players in the war) is not only scummy but disrupts engaging gameplay in a rather nasty way. I don't have much to say given how little I care to even play this game years later.\r\n\r\nAvoid unless you like shelling out tons of money.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "That's the most unfair game you will ever play. Even if i have 200 hours in this shit i wouldn't recommend this to anybody. They should pay people to play this fucking crap. For your sanity i suggest to stay away from this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Garbage. Loved the first. Couldn't recall every playing this one, so purchased recently. I've tried, but it's just a horrible experience and I can't stand it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The campaing is such a slog. The story is very boring but some of the scenarios are as interesting as this type of game can have. The gameplay of the whole game feels a bit half baked.  I didnt discover hot keys for units and i think there are none, only for tactics. Selecting multiple units or creating squads is not a thing. navigating the map was clunky with either clicking on minimap or flinign the mouse, and no zoom out option makes it super easy to over shot area and tyring to select multiple units at the same times is very annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just found this in my library, somewhat nice game but extremely little content, seems more like a demo than a full game, only 2 factions to pick from (Germany/USSR), quite a few maps though but nothing else.\n\nWouldn't really recommend to spend money on unless you wanna pay to play the other factions.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is so buggy and the AI just cheats, I only play this for the WW2 strategy genre, but god is it frustrating how badly balanced and optimized this game is. I will not be buying anymore games from this compnay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its kinda boring tbh I mean the game is good but it gets boring after a while I feel like people just see tank and gun and expect the game to be good for me at least I mean I looked up gameplay and reviews it looked cool but it's not all that",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "20 hours was about the most i could do before the games systems got too irritating\r\n1. the unskippable cutscenes during the campaign were annoying to deal with, especially on hard mode\r\n2. the multiplayer has 1 gamemode that also got very irritating. the games are limited due to how many units you can control at a time. youre allowed to have 100 supply but every unit you create uses up a large fraction of that supply. you think youre playing an RTS with control over an army but you realize later you control maybe 7 units at most while wishing you were playing starcraft or aoe2 or anything else really\r\ni got it on sale so ill try not to complain too much, but if youre really interested in seeing what its about id suggest waiting for a sale as well",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't even play this game due to a broken title screen. How the fuck do devs let this shit slide? I didn't pay money to do the rest of your job, lazy fucking devs. 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the sever unstable like a garbage, keep crashing and disconnecting, and once you crash you cant rejoin",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this quite possibly might be one of the worst games I have ever played, and that's coming from someone who has played through the entirety of Superman 64 and Sonic 06, has several thousand hours in Destiny 2, and actually willingly bought Metal Gear Survive, so one could say I am well versed in games that are complete garbage. An rts from 2013 dropping in the single digit frame rates sometimes is actually wild to me. this is one of those games that you get for Christmas as a little kid and the cover looks super fucking cool, and then you put it in your console and it is the biggest disappointment your child eyes have ever seen. I got this game somehow like 2 years ago for free and I still feel as though i paid too much money for this. this might be the first game ever that i truly straight up just remove from my account, because not even a lap dance from Scarlett Johansson could convince me to try out this game again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is sold in parts with DLCs that all should have been apart of the main game. You can't even play as US forces without buying a DLC. I'll never buy from this developer again. I only paid $5 for the game and I overpaid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mac support issues blackscreen of death, joining by invite or anything game related black death screen cool.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Needs no introduction, a considerable package in an alternate strategy-game style of resource management that scratches a unique itch for most. However, the 64-bit update released a few years back annihilated my performance (on modern specs, mind you!) and I expect not to return in favour of its predecessor CoH 1.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "small POV camera that meant to create chaos, split second decision gameplay however AI failed to keep up with taking position, path finding and required constant babysit.\r\nGame design also plain simple with limited unit types, strategy, not recommended if you seeking for strategic nor tactical strategic game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant mod singleplayer, the tool was done terrible, and yet they banned a tool like corsix mod studio that could fix the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's an extremely frustrating game and a genuine waste of time. The AI has the worst pathfinding I've ever seen in a game, and to make things even worse there's collisions between vehicles to the point you have waves of tanks and even soldiers frozen in place because they can't move. The AI is a blatant cheater, with a certain double standard when enemy tanks can mow down your soldiers like a hot knife on butter but your own tanks will take forever to take down enemy soldiers. \r\n\r\nThe game also crashes frequently, and there's also desyncronization problems that really cause hours of your life to be lost. \r\n\r\nBasically, it's not worth it. In some ways, even Age of Empires 2 is better than this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "After finishing CoH 1 and playing this one immidiately,it feels like a cartoonish game,units when moving dont feel like they have any weight they move too fast and lighty around,the ragdols are non existing and big guns like AT and Tanks feel and look like toys when they move and fire,im sure the game is fun for some but if you are expecting something like CoH1 dont buy it because its not even close to that masterpiece",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game but when a big enough explosion happens my computer instantly turns off...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gAME IS LITERALLY BROKEN. Desyncs within one minute of playing with friends",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It can be good with the right mods. But Relic should really open up the mod tools for this game to thrive more like the first installation. I also really don't understand this scummy microtransaction politic. Locking a faction behind 10 bucks. Shame on you for all of this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dlc factions no longer work in game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game sucks bad now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mac users cannot play with windows players",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"Unable to connect to Relic servers\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fix your servers!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i got turned into ai",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. Locking parts of the game behind paywalls for no reason is scummy.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Don't buy the base game you dont get access to any of the campaigns or missions only online play or Skrims. So dont look at the base game price point at all just look at with DLC or theres no point. Playing vs player that have years of experience is not fun as a new player and you cant really learn the game unless you play vs ai since no story missions are unlocked.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game look's nice, good details and voice actor's are really good too, but i do have a problem with how HUD look's and the ammount of stuff that happens in short ammount of time. I played CoH 1 before and well its amazing game. CoH 2 is good visualy and with sounds but HUD and main menu are kinda too flashy. CoH 1 had this dark color not so flashy which was giving off feeling of war game. Mechanics are well not bad either but comparing them to CoH 1 they are bad and the ammount of restrictions campaign gives you is really annoying. Of course CoH 1 campaign also gave you restrictions but still you had time to do your own tactics while in this game like i said its too fast everything happens in short ammount of time which is confusing. 4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gave up on this after 3 failed attempts to complete the second mission, far too much happening on screen, too many unclear options, too many tasks to keep track of, maybe more experienced RTS players will like it but if you're not a hardcore RTS player don't waste your money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Haven't played CoH2 in a while but even when I did it was apparent how greedy this game can get. Locking nations of World War 2 (especially large players in the war) is not only scummy but disrupts engaging gameplay in a rather nasty way. I don't have much to say given how little I care to even play this game years later.\r\n\r\nAvoid unless you like shelling out tons of money.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "That's the most unfair game you will ever play. Even if i have 200 hours in this shit i wouldn't recommend this to anybody. They should pay people to play this fucking crap. For your sanity i suggest to stay away from this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Garbage. Loved the first. Couldn't recall every playing this one, so purchased recently. I've tried, but it's just a horrible experience and I can't stand it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The campaing is such a slog. The story is very boring but some of the scenarios are as interesting as this type of game can have. The gameplay of the whole game feels a bit half baked.  I didnt discover hot keys for units and i think there are none, only for tactics. Selecting multiple units or creating squads is not a thing. navigating the map was clunky with either clicking on minimap or flinign the mouse, and no zoom out option makes it super easy to over shot area and tyring to select multiple units at the same times is very annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just found this in my library, somewhat nice game but extremely little content, seems more like a demo than a full game, only 2 factions to pick from (Germany/USSR), quite a few maps though but nothing else.\n\nWouldn't really recommend to spend money on unless you wanna pay to play the other factions.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is so buggy and the AI just cheats, I only play this for the WW2 strategy genre, but god is it frustrating how badly balanced and optimized this game is. I will not be buying anymore games from this compnay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its kinda boring tbh I mean the game is good but it gets boring after a while I feel like people just see tank and gun and expect the game to be good for me at least I mean I looked up gameplay and reviews it looked cool but it's not all that",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "20 hours was about the most i could do before the games systems got too irritating\r\n1. the unskippable cutscenes during the campaign were annoying to deal with, especially on hard mode\r\n2. the multiplayer has 1 gamemode that also got very irritating. the games are limited due to how many units you can control at a time. youre allowed to have 100 supply but every unit you create uses up a large fraction of that supply. you think youre playing an RTS with control over an army but you realize later you control maybe 7 units at most while wishing you were playing starcraft or aoe2 or anything else really\r\ni got it on sale so ill try not to complain too much, but if youre really interested in seeing what its about id suggest waiting for a sale as well",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't even play this game due to a broken title screen. How the fuck do devs let this shit slide? I didn't pay money to do the rest of your job, lazy fucking devs. 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the sever unstable like a garbage, keep crashing and disconnecting, and once you crash you cant rejoin",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this quite possibly might be one of the worst games I have ever played, and that's coming from someone who has played through the entirety of Superman 64 and Sonic 06, has several thousand hours in Destiny 2, and actually willingly bought Metal Gear Survive, so one could say I am well versed in games that are complete garbage. An rts from 2013 dropping in the single digit frame rates sometimes is actually wild to me. this is one of those games that you get for Christmas as a little kid and the cover looks super fucking cool, and then you put it in your console and it is the biggest disappointment your child eyes have ever seen. I got this game somehow like 2 years ago for free and I still feel as though i paid too much money for this. this might be the first game ever that i truly straight up just remove from my account, because not even a lap dance from Scarlett Johansson could convince me to try out this game again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is sold in parts with DLCs that all should have been apart of the main game. You can't even play as US forces without buying a DLC. I'll never buy from this developer again. I only paid $5 for the game and I overpaid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mac support issues blackscreen of death, joining by invite or anything game related black death screen cool.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Needs no introduction, a considerable package in an alternate strategy-game style of resource management that scratches a unique itch for most. However, the 64-bit update released a few years back annihilated my performance (on modern specs, mind you!) and I expect not to return in favour of its predecessor CoH 1.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "small POV camera that meant to create chaos, split second decision gameplay however AI failed to keep up with taking position, path finding and required constant babysit.\r\nGame design also plain simple with limited unit types, strategy, not recommended if you seeking for strategic nor tactical strategic game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant mod singleplayer, the tool was done terrible, and yet they banned a tool like corsix mod studio that could fix the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's an extremely frustrating game and a genuine waste of time. The AI has the worst pathfinding I've ever seen in a game, and to make things even worse there's collisions between vehicles to the point you have waves of tanks and even soldiers frozen in place because they can't move. The AI is a blatant cheater, with a certain double standard when enemy tanks can mow down your soldiers like a hot knife on butter but your own tanks will take forever to take down enemy soldiers. \r\n\r\nThe game also crashes frequently, and there's also desyncronization problems that really cause hours of your life to be lost. \r\n\r\nBasically, it's not worth it. In some ways, even Age of Empires 2 is better than this.",
      "voted_up": false,
      "votes_helpful": 5
    }
  ]
}