{
  "positive": [
    {
      "review": "This is one of the most touching stories I have experienced. Not just in a game, in general. \r\n\r\n\r\nWhile the gameplay is solid, combat feels good and exploration can be tedious, the narrative, the performances and the music together with visuals tell a beautiful tale of redemption, change, growth, choice... \r\n\r\nWe all can be better and we must be better. For the sake of our children.\r\n\r\n\r\nI highly recommend this game to anyone who cares about narratives in videogames. Be mindful that it can make you cry.",
      "voted_up": true,
      "votes_helpful": 57
    },
    {
      "review": "I wanted to love God of War Ragnarök the same way I loved the first one. The 2018 game was the first video game that truly pulled me in, and I could not get enough of it. The story, the pacing, the connection between Kratos and Atreus. Everything felt powerful. Everything felt meaningful. I was excited for the sequel thinking it would give me that same feeling again.\n\nInstead, I found myself frustrated almost the entire time.\n\nThe biggest problem for me is being forced to play as Atreus. In the first game he felt like a helper. He supported you, he added to the story, and his moments made sense. In Ragnarök it feels like the entire game shifts to being about him. And not in a subtle or natural way. The writing pushes him into the spotlight so hard that Kratos feels pushed into the background.\n\nAtreus comes across as whiny, impulsive, and constantly making choices that make everything worse. It is exhausting to play through his sections. Every time I was switched to him, I felt myself wanting to rush through it just to get back to Kratos. I lost count of how many times I caught myself sighing and thinking here we go again. The pacing falls apart because of it. The story keeps dragging you away from the part you actually want to play.\n\nThe worst part is that the game itself looks amazing. The world is gorgeous. The combat is still strong. The environments are detailed. It has everything it needs to be great, but the story choice to center so much of the experience on Atreus took the joy out of it for me.\n\nWith the first God of War, I could not put the controller down. I stayed up late. I cried. I cared. With Ragnarök, I kept putting the controller down and trying to talk myself into picking it back up. I still have not finished it because the motivation is just not there. Every time I think about continuing, I remember how it felt the last time I was forced into another Atreus section and I stop.\n\nI know some people enjoyed the direction they took, but for me it was disappointing. If someone asked me which one to play, I would tell them without hesitation to play the first God of War. The emotional weight and the pacing of the first game are on a completely different level.\n\nRagnarök had all the potential in the world, but it never connected with me the way the first one did. I wish it had.",
      "voted_up": true,
      "votes_helpful": 49
    },
    {
      "review": "EXCELLENT! Amazing part 2 that was already held by a solid foundation.\n\nBest part for me is story telling and acting. Everyone is really nailing this acting wise.\nThor was amazing as a character! Same as Angrboda and Thrud. Felt like Odin had a very soft voice that did not fit such a grandiose god. On the other hand this softer voice maybe better suited to achieve \"perceived\" thrust. However, listening to him felt off.\n\nGameplay is very good as expected. It is fun and opens a lot of options for player to find their play style. Perfect in every sense.\n\nOnly part I did not enjoy was when Atreus and Angrboda met. Going with her felt like a big chore to get off the list. Athreus here acted like a spoiled teenager which made it harder to connect with him as a character. Another less enjoyable part was Vanaheim. Story here was going off the tracks.\n\nLevel design of Jotunheim and afterwards Vanaheim where packed with all sorts off colours and details. This made it harder to focus on your view. Felt like it was too saturated and contrasted. However Midgard, Muspleheim and Svartalfeheim were the way to go!\n\nThere were some silly parts like Kratos making the room dark and extinguishing 1 out 10 candles. Nothing critically bad.\n\nDue to game crashing on my side, Valhalla DLC is unplayable. As each crash reset the run back to beginning I am unable to complete the runs.\n\nOVERALL, if you liked the first game (AND YOU SHOULD!) you will like this one. This is is a must for everyone!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "God of War Ragnarök is an absolute masterclass visually fantastically beautiful featuring some of the best combat of all time, memorable characters and one of the best gameplays ever.\r\nNext God of War game",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This is one of the all time greats. Not just graphics and sound design, music and setting, but the story and acting are absolute top notch. This also hits a lot harder when you played the first God of War games when you were younger and you play this when you are older, with kids, having undergone happiness, loss, failures, wins and defeats.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "As someone who has played most God of War games before, this one (and God of war 2018) are easily my favourites! Absolute masterpiece for several reasons:\r\n\r\n-Storytelling is amazing\r\n-Depth about characters and great character development\r\n-Satisfying and challenging combat, rewarding skilled timing (the parry sound is the best part)\r\n-Sidequests feel important, have great variety and are equally satisfying to complete\r\n-Bossfights are well thought out.\r\n-Great plot twist, which lets be honest for those who played it, nobody expected it\r\n-Graphics are detailed and made with love\r\n-So many ways to play the game with plenty of gear, weapons, attacks and attatchments\r\n-Mimir is the GOAT\r\n-The relief after beating Gna after HOURS\r\n\r\n10/10 would recommend for anyone\r\n\r\nThank you Santa Monica Studios for this amazing game! <3",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This is the kind of game that sets the bar. God of War Ragnarök does exactly that.\n\nIt improves on its predecessor in almost every way—smooth-as-butter performance, stunning visuals, weighty and engaging combat, an emotional soundtrack, and a story that ties everything together beautifully.\n\nAn unforgettable experience from start to finish.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The most heartfelt story I've ever felt in a video game along with some of the most fun and challenging game play 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Beautiful story, game design and callbacks",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Its a God of War game what do you all expect its great !!!\r\njust wish it has more to the story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "God of War Ragnarök is an outstanding experience from start to finish—gorgeous visuals, tight combat (played it on no mercy), and an emotional story that hits hard. The character development is top-tier, and the father-son dynamic is better than ever. [spoiler]My only gripe is the pacing dip during Atreus’s visit to Ironwood, which felt slower than the rest of the game’s momentum. Aside from that,[/spoiler] it’s an incredible journey and absolutely worth playing.\n\n\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☑ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great story, Great combat, and the Valhalla DLC is also excellent. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic sequel to GoW 2018, and just like that game a very fun 100% to go for as well. Valhalla DLC is not only free but extensive, and gives the Ghost of Sparta some great closure to his overall story.\r\n\r\nThat said, I hear we're going to Egypt next? That's gonna be so good. Excited to see where GoW goes next\r\n\r\nNow put the original games on Steam already--",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the most enjoyable games I've ever played (and at 76 I've played a lot!). Found everything and finished all except 'Berserkers' which was just too difficult for me. Huge thank you to everyone who posted help and in particular the people at PowerPyx.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easily my favourite single-player story game. Every minute of this was incredible — from the emotional, perfectly-paced story to the fluid, fun, and deeply satisfying combat. The range of difficulty settings makes every boss fight feel meaningful, whether you want a challenge or just the cinematic experience.\r\n\r\nThe visuals are jaw-dropping, and the seamless transition between gameplay and cutscenes is unreal — it never breaks immersion for a second. And the soundtrack? Absolutely stellar. I’m still listening to it a year later.\r\n\r\nIt’s one of those rare games that just nails everything — story, gameplay, music, emotion. A true masterpiece.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is the epitome of what a single player game should be. No further words.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "god it's such a good game. only downside is when you are in between realms it is SO LAGGY other than that \r\n10/10 story 10/10 combat 10/10 weapons 10/10 DLC 10/10 characters 10/10 graphics 10000/10 GAME",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, definitely worth it. This review is after 100%ing the game, so it isn't too, too, long, but it is replay-able, so that is a definite plus. Great graphics, you probably want a 3090 or better if you want the best out of it, but otherwise, it is worth the price, definitely get it if it is on sale.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It was absolutely a pleasure to watch Kratos evolve troughout all the games \n\nTruly one of the best characters development",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games that I played. Simple as that. It stayed loyal to its path through the years without diverges from it's path ending up to a Masterpiece!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bought GoW 1 to get the Kratos storyline, definitely worth the $. Great Artwork, story and satisfying combat. 100% was straightforward as well.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "God of War: Ragnarök delivers an emotional, beautifully crafted story about fate, family, and the cost of war. Kratos is still a walking earthquake, but this time he’s trying to be a better father while the universe actively refuses to give him a break. The combat is brutal and satisfying, the visuals are stunning and the character moments hit harder than any axe swing. A powerful sequel that’s worth every minute.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After 100% completion I can say that this game was worth it.  Sunk 76 hours into it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really digging the last game in this epic Norse saga with stunning visuals, fluid combat and heartfelt storytelling between Kratos and Atreus. The port shines with customizable graphics, smooth performance, enhancing the emotional journey through realms filled with gods and monsters. However, occasional bugs and demanding hardware requirements slightly hinder the experience. Still a must-play for fans of the series and action-adventure enjoyers. 4/5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"In your life has anyone ever worshiped you, ever prayed for you?\" YES! \nSuch an amazing story and game, a massive upgrade from the first one with so much side content to add to the already amazing main story and gameplay, loved everything about it and the story about how the cruelest God of War became the God of Hope. \nTODAY, WE WILL BE BETTER!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best character development of all time from Kratos game is a GEM",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Both this and GOW 2018 have been one of the best games I have ever played. The combat isn't terribly hard on the \"medium\" type difficulty, and the story line is absolutely amazing. There aren't many games I take the time to do everything in, but I am for them both. Normally I wait a long time before playing a second playthrough so it almost feels like a new experience, but I am going to beat them both on the hardest difficulty after I 100% them. You don't need to know the story of the previous games to get into it either, but it does help get some backstory and it brings you closer to Kratos as a character. Even just watching summary videos and game movies was enough for me to understand how truly dynamic of a character Kratos is throughout all of the games. I highly recommend anyone play it if you are on the fence about it. I am picky with my games, and I am soooo glad I decided to give this one a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game amazing, only the Atreus spoils because he is unbearable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A solid continuation to the incredible story and game that preceded it. \n\nThe main Story + Valhalla DLC is brilliant and offers a really satisfying conclusion to Kratos' Norse mythology arc as well as a heartfelt redemption story that feels both earned and rewarding. \n\nGameplay, like in the previous game, is satisfying and more refined. Improving but not changing the core elements which made the previous games combat enjoyable and easy to learn but difficult to master. \n\nUNFORTUNATELY. \n\nThe capricious pantheon of Sony have decided to force players to create an online PSN account in order to play an exclusively singleplayer game. So in order to play this game, you have to sacrifice your personal data to the Sony Gods. \n\nWhile I feel the need to recommend this game because of the great work Santa Monica studios has done. I can't 100% recommend a product that sadly promotes anti-consumer practices. If you just want the story, I recommend watching the hundreds of youtube videos out there that show it. It's what I did while I was waiting for it to come out on PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love the GOW series in general. I think Rag shows amazing character development just from Kratos alone. The gameplay is amazing and seamless from Playstation as I have played on both PC and console. I really have no complaints about the game and I cannot wait for the next one in the series to be announced!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10, just too bad you can't play Atreus after the game ends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PROs:\n- Story Hits Hard: If you played the 2018 game, this is the payoff. The ending is emotional perfection and \"Boy\" (Atreus) is actually useful now.\n- Combat Evolved: It’s the familiar hammer-and-axe brutality we love, but faster and more vertical. You get new toys, and the power in your fists feels addictive.\n- The Scope: Exploring the Nine Realms, facing gods and monsters—it reminds you why AAA action-adventures still matter.\n- Valhalla DLC: Included for free. It's a surprisingly deep roguelite mode.\n\nCONs:\n- Pacing: Some segments and arcs don’t always land, and there are a few overly sentimental beats.\n- Innovation: If you expect groundbreaking innovation everywhere, it plays it a bit safe.\n- Final Thoughts: This is one hell of a journey. If you’re in for god-slaying, giant landscapes, and Norse mythos, this one’s a must-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just finished this game after waiting so long for it to come out on PC and be able to justify the price. \r\n\r\nAfter completing the story + the free Valhalla DLC I honestly have no words that can explain how story rich this game is. I played the first one when it came out on PS4 and fell in love with it instantly. This game encapsulates everything there is to making a quality game in todays market. The voice acting, the emotion, the gameplay, the balance between a retired spartan warrior to a wise aged father is none the less poetic. \r\n\r\nGOW Ragnarok is basically GOW 2018 with more daddy issues and I LOVE IT. \r\n\r\nPraying to the GOW gods to continue this series and get it to a point where Kratos hands down the axe to Atreus. PLEASE !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing game (New game plus is even better,[spoiler] but you wont be able to access the spear areas until after you get it again by progressing through the story.[/spoiler])",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story somehow becomes even more immersive and emotional than before and that was a high bar to beat from its 2018 predecessor. However, this game is much larger than the previous, and much longer. \r\n\r\nIf you enjoyed the first one alot and didnt feel worn down by puzzles and fights, then you are in for an amazing treat. If you found yourself a bit tired after playing the last game, brace yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a goated game, this is my second playthrough and almost 100% again but in PC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My top games of all time: Mass Effect Trilogy, Witcher Trilogy, DA Origins and now God of War 2018 and Ragnarok. Brilliantly written and acted.  Absolutely without question the best character development and evolution I've ever experienced.  I very much felt like I was playing a masterpiece.  When I finished the game the first time I didn't even pause before starting it again. I'm not good at writing so I'm going to post 6 paragraphs on the virtues of the game.  All I can say is that it is one of the best games I've ever played and can not recommend it enough. One bit of advice...I would play GoW 2018 first.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bought it on ps5 100% it,  and now on my legion go s and bought it again, absolutely worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOW series did for playstation studios, what MGS series and R.E series did for Konami and Capcom respectively. i.e > pure awesomeness\n\nGOW Ragnarok is an amazing game, with a stellar storyline than the original, with better and more fluent button combo mash. fantastic characters, and a magnificent conclusion to the GOW norse mythology lore.\n\nthe buildup that GOW created, can be felt in this game as well, the emotions and battles that the players engages in from the start to end are just worth every penny. at full price or on sale, this and the original game , are well deserved their weight in gold.\n\nepic game, epic battles, voice overs were fantastic as always. must for everyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a strong sequel with sharp combat, great visuals, and a story that mostly hits the mark.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game on PS5 and wanted to play it on PC. Like before, I thoroughly enjoyed this game, and I actually wanted to explore every aspect of the game, something most games won't entice me to do. Only problem is this game, like 2018 on PC, has a tendency to run into crashes every now and then.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my favorite game, watching Kratos accept himself for who he truly is was beautiful. Every second of that story is a work of art. The Valhalla DLC is free, but I would have totally paid for it. 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing sequel to the first GOW game from the Nordic series! Highly advise everyone that can afford it to play it you will instantly fall in love with graphics, characters and story!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall this game deserves a 10/10 on presentation (story and graphics).\n7/10 on gameplay.\n3/10 on replayability.\n\nThe game story picks up where the 2018' game left off, and closes the threads and questions in a very cinematic and engaging story.\n\nKratos gameplay has a properly brutal feel to it, even tho the combat system falters against hordes of enemies, and works much better against bosses and minibosses. \n\nThe Atreus sections are filled with annoying Teenage angst and awkwardness that most adults playing this game didn't sign up for. This is made worse by the fact you cannot just skip them during NG+. The unskippable story-time \"walk and listen\" sections also breaks the replayability of the game in harder difficulty modes.\n\nThere is a nagging feeling that the story beats designed to humanize Kratos and deconstruct his angry man persona takes precedence over replayability, as well as the countless \"accessibility\" options designed to turn the game into an almost-QTE driven story.\n\nAnd it begs the question why ? One can only guess, and only the developpers could answer that question, but it feels like driving home the \"message\" was more important than the \"game\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game on PS5 originally, and while I believe that it runs better on console than my PC, it's still a wonderful experience. I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game in my personal opnion!\n\n- great story\n- lots to explore \n- the combat is challenging, yet fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For the love of god Santa Monica Studio. PLEASE RELEASE ALL THE GOW GAMES!!!!\n\nThis game is just as good as the 2018 one. Only complaint I had was a certain part dragged on a bit longer than it should have, but besides that this shit is GODLY! PLAY IT NOW!!!! 💪😎🤳",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ONE OF THE BEST GAMES I HAVE PLAYED AND I HAVEN'T FINISHED IT YET. The only bad thing is playing as Boy he needs more ways to attack. Overall probably the best game I have in my steam library. GoW 2018 in second",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Epic, emotional, and stunningly crafted. The combat is tighter, the story hits hard, and every moment feels purposeful. A powerful and unforgettable sequel.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Made me cry 8 times 10/10!\r\nBeen playing for weeks and there was just always something going on and never felt repetitive, commentory from Mimir was so well implemented and even the DLC was awesome. Both games are worth every cent to support the creators.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, amazing story, beautiful graphics, fun combat experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ragnarök is a masterful blend of cinematic storytelling and mechanically deep combat. The father/son dynamic carries emotional weight across a sprawling mythic backdrop. Combat rewards deliberate choice of runic abilities and equipment; bosses are epic and memorable.\n\nWhat I liked: superb writing and character work; layered combat; production values are top-tier.\nWhat I disliked: long runtime can make completionists feel stretched; some optional areas feel padding.\n\nPros: narrative excellence; satisfying combat; rich side content.\nCons: long grind to 100% completion; occasional fetch-like optional quests.\n\nTip: do side quests interleaved with main story to keep pacing natural and avoid backtracking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Combat is fun\nStory is a masterpiece\nFree DLC is great\nBuy the game its worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game for calm and reasonable people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better game, shittier PC port! [spoiler] The Berserker king went so hard he killed my PC [/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you played 2018, you must play this. If you haven't and think this game isn't for you: Open your heart to it.\n\nThis is what I liked about Ragnarok:\n- main characters development\n- side characters development too\n- story, encounters and worlds were better than 2018, by far\n- amazing and fitting visuals\n- although I do like the late game combat of 2018, this one's variety makes it much more fun\n- side content made 100%-ing this game worth it\n- free roguelike dlc with some story to it\n\nWhat i disliked:\n- how much certain NPCs yap during combat, completely unnecessary. (I had used a mod to remove that, but I've heard they added an option to lower it)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recenzija God of War Ragnarök – 7.5/10\n\nGod of War Ragnarök je igra u kojoj ima mnogo toga da se vidi i mnogo toga da se uradi. Njena najveća snaga je svakako odlična priča, koja te lako uvuče i natera da provedeš sate u igri. Sa svojim polu–otvorenim svetom i velikim brojem sporednih misija, uvek ćeš imati nešto da istražuješ  bilo da želiš da napraviš pauzu od glavne priče ili da jednostavno uživaš u ogromnom svetu devet oblasti.\n\nSa tehničke strane, igra blista. Ima vrlo malo bagova, nema problema sa performansama, i sve deluje ispeglano i kvalitetno odrađeno. Jasno je da je uložen veliki trud da svet bude imerzivan i fluidan.\n\nIpak, treba pomenuti da ovo nije isti God of War na koji su mnogi navikli. Brutalan, haotičan stil starijih delova, pun neprekidnog akcionog pokolja, sada je zamenjen modernijim pristupom sa jačim fokusom na priču i emociju. Novijoj publici to može biti fenomenalno, ali oni koji žale za starim, sirovijim God of War stilom možda neće biti oduševljeni.\n\nSve u svemu, ovo je kvalitetna igra sa mnogo sadržaja, ali sa jasnom promenom identiteta.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In my opinion, the game is on the list of the best single-player games ever created.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kısaca konuşmak gerekirse, oyun HARİKA! Gerek hikayesi gerekse oynanışı. Oynanış hakkında 1. oyun kadar çok fazla bir çeşitlilik göremedim ama güzel bir cila da çekmişler. Özellikle, yeni aldığımız silah çok tatmin edici. Hikayesi ağır ama bir o kadar da merak uyandırarak götüren bir serüveni var. 1. oyunun da hikayesi oldukça sağlamdı, fakat burda işler açıklığa kavuşturulmuş. 1. oyunda, kitabın ilk 60 sayfası ise, ragnarök kalan 500 sayfa gibi bir şey. Oyuna yeni oynanabilir bir karakter geliyor, bu atreus. Atreus u ilk kontrol edeceğimiz zaman aha geçmiş olsun, kesin çok kötüdür izlenimi ile yaklaştım. Fakat yanılmışım, mekanikleri çok hafif hissettiriyor ve hızlı hissettiriyor. Aynı örümcek adam gibi sağa sola oynadım. Helal olsun çok iyi iş başarmışsınız. Oyunun açık dünyası, 1. oyuna göre çok daha fazla keşfe açık ve daha fazla merak uyandıran bir dünya eklemişler. Yan görevlerde çok sağlam olmuş. Ana oyunu destekler nitelikte bir hikaye koymuşlar. Bence takdir edilesi bir davranış. Oyun boyunca bir kaç yürüme sekansları var, bazılarının hoşuna gitmemiş, çünkü oynayışı birazcık baltalıyor gibi olmuş. Buna çok katılmıyorum, daha çok hikayeci olduğum için, hikaye tarafı yürümeler çok hoşuma gitti. Oyunda gerek çok güldüm, gerek çok duygulandım. Bu oyun bana neredeyse her duyguyu yaşattı. Ragnarökte bayağı bir insan tanıyoruz. 1. oyunda 10 kişiyi tanırken, burda 40 kadar kişiyi tanıyoruz. E bu da birazcık, \"bunlar da kim böyle\" izlenimi yarattı. Odin ve Thor haaaarika işlenmiş. Özellikle Odin in o kötü adam tasfirine bayıldım! Ek olarak ta bu oyuna özel olarak bir DLC paketi var. Hikaye türünde giden bir rogue like oyun olmuş. Gayette güzel yapmışlar. Fakat, artıları varsa eksileri de var maalesef. Epik sahne durumları oldukça azaltıldığını fark ettim, buna çok üzüldüm. Çok daha güzel bir sinematikli epik sahneler barındıracağını düşünmüştüm... Özellikle o son boss ta ÇOK ÜZÜLDÜM. Çok sönük kalmış bir son boss fight olmuş. Son boss tan bahsetmişken, oyunun sonu çok aceleye getirilmiş. Oyun ufak ufak ilerlerken bir anda NOLUYOR OLM??? kafasını yakalıyoruz. Olaylar çok hızlı gelişiyor maalesef ve tabii bu da hikaye anlatımını bir tık bozuyor. Ama hikaye iyi mi, HARİKÜLADE. Buna asla bir lafım yok, lafımsa son kısımlar oldu. Oyunun pc portunda ufak tefek sorunlar var maalesef, onlarda MİCRO SHUTTER lar oldu ne yazık ki... Oyun 9.5/10 lik ken, pc portunda ise 9.3/10 kadar bir puan alır benim gözümde. 2018 oynanış olarak çok daha fazla gözüme girmişti, burda da iyiydi fakat 2018 bir başkaydı ya. Bu kadar eksiği olmasına rağmen BAŞYAPIT bir oyun olduğunu söyleyebilirim. Hatta, ragnarök ün puanı düşük olmasına karşın, 2018 i bile geçeceğini düşünüyorum.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the game a lot, but the story being so focused on Atreus is not my favorite. You're forced to play as him several times. Each time it feels awful. I really don't care about Atreus that much. I liked how Atreus was part of *Kratos'* redemption arc in the first one, but the second one puts too much emphasis on him as a character. Strange choice considering the audience of the game is likely not Atreus' age but I digress. The dialogue is good, but it feels weird that Kratos is the only one that talks like an ancient god would (if they spoke english ig). Like why is Odin joking around like my jewish uncle? Idk man. Really fun combat, overall story isn't bad just...why they made those choices is weird. If I wanted to watch another shitty hollywood movie I would do that, and that's kinda where the story went for me. Overall if the idea of those story issues don't bother you, then the game is worth it. Here's hoping we go back to Kratos focus for the next game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful follow-up to GoW2018. If you liked that game, you will be right at home here. Some parts drag a bit (Atreus and Angrboda in particular) but the story payoffs are great. I now love Thrud :)\r\n\r\nIncredible accessibility options (I'm looking at you, miniboss checkpointing) make this an easy recommend even to gamers who struggle with action/combat. \r\n\r\nPlayed on Steam Deck - looks and plays great (40fps on average).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excelente juego, graficos hermosos y jugabilidad muy entretenida!\r\nEste es uno de esos titulos que se deben jugar por lo menos 1 vez en la vida 😊",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful story, game design and callbacks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probobly one 0f the best games i ever played, amazing graphics,jokes, story and nice amount of diffculty... 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is just the best package deal of everything... Story rich, amazing combat and gameplay, breathtaking graphics. What more can you ask for? just buy it...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this story is incredible, its a very fun combat system with diverse attacks and combos, puzzles are kind of tricky but thats the point of  a puzzle",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aside from a few sections that drag a bit, like collecting fruit for half an hour for some reason, the game is fantastic. The combat is satisfying, the story is great, and the world is fun to explore. Graphics are top tier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what can i say, im a bit bias becuase ive beeen a fan of this franchise, yet with every new game is better than the last in its own way! story is top tier, graphics are superier and the game play is legenday ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Goated game can't wait for the next, Spear is so fun. I'm built like Thor.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Forced me to stand up when looking too long at the fireflies. 0 out of 10, won't play again.\r\n\r\nNah but It's pretty damn fun. and has a magnificent story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but still needs bug fixes. While doing the word of fate freya gets stuck not being able to open the dead, not getting on the sled, or fighting. and when i tried doing side missions she didnt even get on the canoe . finna go reset my game and start from the very beginning.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is worth playing, but the previous part is better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God of War is an incredible blend of powerful storytelling, stunning visuals, and intense combat. The character development—especially the relationship between Kratos and Atreus—adds real emotional depth to the experience. It’s one of those games that stays with you long after the credits roll.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My Better StoryGame The Kratos Evolution is so good.\nGameplay is so clean 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good in overall, satisfying gameplay, lots of content, beautiful graphics, sweet puzzles, funny scenes and etc. The only think I dislike about this game is the parts where we have to play as Atreus. It is so bloody annoying like why do I gotta play as Atreus? Even if it's for few chapters, I do not want to play as Atreus! screw the story. It is really annoying to play as Atreus and it is forced so you cannot skip it. I am currently on my 5th playthrough on the game and I am still struggling to pass the Jotunheim chapter. Atreus is so weak, useless skills, poor combat, very strong foes and not even mentioning the \"Rage\" they give us. Please add an option to skip Atreus gameplay, or make Atreus stronger.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Went in with silly high expectations because 2018 hit on basically every axis:\ncinematic, focused, mysterious, emotionally raw, tight pacing. Ragnarök steps into that shadow by going bigger in every direction, bigger worlds, bigger cast, bigger story, more open-ended structure, and it nails a lot of that ambition. But it also picks up a few cracks that come with expanding the formula.\n\nLet us start with what it absolutely nails. Emotional storytelling is still top-tier.\nIt’s softer and less mysterious than the first game, but when it hits, it really hits.\nSeveral moments straight-up punch you in the chest. Character depth also goes wider this time. Almost every major character gets layers like in the first game, and the cast is genuinely interesting, the game cares about their arcs, and finds fun and interesting ways to explore many themes. Combat is improved in nearly every way. Smoother, snappier, more options, more flow. Side content feels more meaningful, less like filler. Huge, gorgeous set pieces and some “holy shit” moments that fully deliver as one would come to expect from the series. The ending lands, it pulls a ridiculous amount of threads together without collapsing.\n\nNow onto what drags it down slightly. Mimir is actually worse this time.\nNot mysterious, not insightful: more chatty, more “forced clever.”\nIn 2018, he was this old head with real weight. Here he’s just… commentating, which leads me right onto a bigger overall critique. Some characters feel re-written.\nA bit too theatrical, a bit too “scripted drama” compared to the rawness of the first game. The pacing also stutters. The original was lean, sharp, consistently engaging.\nRagnarök dips more often, with longer stretches where things feel padded or slightly tedious. Combat fatigue returns. Even if it’s improved, it still eventually settles into predictable patterns, especially by hour 40. The open structure slightly hurts the atmosphere due to lack of attention to detail. The first game had mystery, restraint, “that foggy mythic vibe.” Ragnarök is flashier, louder, more colorful, beautiful, but a bit less cohesive. A few minor plot holes, nothing game-breaking, but notwworthy.\n\nThe vibe I walked away with is like watching an insanely well-produced, long-running prestige TV saga. Not as magical or tight as Season 1, but the emotional core never slips, and the overall experience is still beautiful and satisfying. Definitely worth playing after the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than 2018 in every way apart from the story. Story's pacing is far too fast and forced to play as someone that isn't the God of War, in a God of War game... strange.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible single player experience. Improves on things from the first, and carries a surprisingly touching story about Keaton and Atreus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the platinum made me want to blow up a firework in my throat, and dont even get me started on those bullshit crows.\nGna was actually easier than i expected, but king hrolf - I fought him for an hour and a half straight than rage quit, then i came back and did it first try. the artifacts pmo so bad. \nGreat game though, will never play again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is better than the game..... and the game is masterpiece. Had to replay on PC. If on any sort of sale and you can definitely give it a play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing gameplay, the combat is very smooth. The story keeps you immersed and wishes the campaign was even longer. Currently playing the DLC and it is equally good. Can't wait for the next part, heard it is going to be in egyptian setting. Good Luck Gamers. Recommended - 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game although it has some noticeable flaws. I spent 50 hours on my first playthrough and still missed quite a bit of optional content apparently. This game is like 85% awesome and 15% frustrating. \r\n\r\nAwesome combat, decent story. There were some very memorable boss fights and action sequences, as well as some good quotes and character moments. \r\n\r\nI genuinely feel like the amount of looting and puzzles drag the game down. I like collecting loot and crafting in my games but it's just not done well in this game. It feels completely unnecessary and unimpactful to bother crafting and equipping different sets of gear. The looting animations get very repetitive and it feels like the game is wasting your time. The worst part is that you can't just ignore that stuff because there are valuable upgrades and new abilities inside some of the loot chests. The different gear sets are most interesting to me for the cosmetic changes. I think they needed to reduce the amount of looting, speed up the animations, and make gear/stats more meaningful to gameplay. \r\n\r\nI also don't understand why they completely removed the 'fists and shield' moveset from the first game, and it's really annoying that they made us relearn all the abilities we gained throughout the first game on top of learning new abilities introduced in this game. It wastes your experience points and makes the progression system feel unnecessarily drawn out. I would rather have a smaller skill tree than have to relearn abilities I just spent 30+ hours using in the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Steamdeck;This game is amazing. The only complaint I have is that Steam lists it as compatible with the steamdecks native graphics settings.\n\nIts not. Look up a tutorial on optimizing the graphics settings before you play. Otherwise its twitchy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finished God of War Ragnarök on PS5 when it launched, and the moment it hit PC I bought it again without thinking. This game is massive in every sense bigger worlds, bigger battles, bigger emotional swings. It’s the kind of game that makes “just one more mission” turn into three hours.\r\n\r\nThe music deserves special mention. It’s incredible epic, emotional, and perfectly matched to the tone of the journey. Combat feels sharper than ever, and the set pieces are some of the best in the series.\r\n\r\nI’m not sure I loved it quite as much as the first game, but that’s a very high bar. Ragnarök still delivers some truly great characters, unforgettable story moments, and a world that’s a joy to explore.\r\n\r\nIf you loved the 2018 game, Ragnarök is absolutely worth the ride again especially on PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Death can have me when it earns me\". I precame a bit when I heard it, the rest of the game is equally making you wet throughout its entirety.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been a big fan of GOW since the PS2 era. I love the new GOW games for their more open-world approach. The aesthetics of this game look so much better than 2018 GOW, and that was a fantastic game. Kratos is such an interesting character, and is a much wiser man than his younger self. This chemistry between Kratos and his son, Atreus, works really well. Christopher Judge is one of my favourite actors, and I remember enjoying his performance as Teal'k. He is the perfect voice actor for Kratos, and I hope that he'll continue this role throughout the GOW franchise. If you love 2018 GOW then you're gonna love Ragnarok.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The sequel game from the god of puzzles franchise is even better than the first",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I came for the game play, I stayed and ended for the feels.  The story this tells really does leave me misty eyed.   It was worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A truly great game. Great story, wonderful characters, and a very fun battle system. I enjoyed every minute of this and the DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cinematic, well written and acted, top notch production.  beautiful game.  combat is visceral and satisfying, though the difficulty is a little uneven at times.  story boss fights are pretty easy but some of the optional bosses are rough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I adored this game. It looks great, plays great, and I really enjoyed the story. As someone who grew up with Kratos when he was a savage Greek it has been amazing to see his character transformation and reflect on my own ways in which I've grown. I took it pretty slow and 100%ed the game. Between the base game and the free (and awesome!) Valhalla expansion I got ~100 hours of great time. The game has one of the most heartfelt/beautiful/\"real\" scenes I've ever experienced in my 35+ years of gaming. You'll know it when you get there. Anyway, strongly recommend this game and I'm super stoked to see where this series goes next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game some chapters were a little too long and I kinda lost interest but I still had a lot of fun playing this, action sequences and bossfights were amazing 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is probably the most amazing game I have ever played. The music, production and entire voice cast was beyond exceptional. Moments of tears, laughter and pure awe. It's just perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really great gameplay and story, love it, but the menus and UI are...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SOOOO GOOOOOODDDDDDDD! Wish I could forget the memory of it and play again!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "top three games i've ever played alongside valheim and subnautica. I truly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best game I've played in a while. absolutely would recommend if you an awesome story and a challenging gameplay experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "loved the story. if you bought the game post dlc, you'll probably no longer feel like playing that until after a long pause.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good story. The combat is a bit more frustrating and clunky compared to the first game, but the story more than makes up for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The previous installment of this new branch of the God of War franchise set the standard for breathtaking storytelling and moving dialogue. What a pleasure it was to play the sequel that maintained the high benchmarks that were set, and then just gave us even more.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "5/10 - big disappointment after great previous part.\n\nPros:\n+ Nice gfx\n+ Still interesting setting - but wasted opportunity\n\nCons:\n- It seems the producer is trying to change God of War into some generic fantasy story. It also has more teenage-fantasy feeling that was absent in previous parts of the series. Even though the last part was already different from the early GoW games - it was still dramatic and bloody feud of Kratos (as a father fighting for survival of his son) vs (psychotic) God, fitting the setting very nice. Now we have some generic \"good guys vs bad guys\" story with naive looking maps, cliche characters/sides and cringy dialogues. There is also not so much Kratos here - as we play many missions with Atreus. This could be interesting addition if those missions were not so dull and not so dominating for the game.\n- \"Newyorkisation\"/racial checkboxing in form of angrboda wouldnt be so bad probably..... IF she wasnt THE most irritating and dull character in the whole game. And also the map/missions where we first meet her is the worst/most boring map of the game. Amazing acheivment...\n- Opponents get very repetitive after first 10 hours. Boss fights are VERY underwhelming/disappointing. It was also a problem of the previous game but it somehow got worse. I would call only two of those fights \"epic\", the rest were not worth of remembering. This is not how GoW game should be.\n- Equipment/builds are mostly pile of forgetable garbage and statistics you get along the way.\n- \"Puzzles\" are mostly about forcing you to click more and more abilities to open the simple path. Empty time fillers.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I really really like this game, this review is not that much about the game but about the very poor performance you have to endure on PC, and the constant crashes, I have more than the recommended requirements for it and it still crashes, its infuriating, I just wish this could be fixed.\nThe game itself is great and I have no complaints regarding the game itself.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Not as good as God of War 2018, which I liked.\nTLDR - Convoluted exposition, lots of boring fetch quests, lots of climbing and squeezing through walls to disguise loading... Sweet Baby Inc. involvement is very obvious and detracts hugely from the game. Fighting the giant DEI granny who tortures animals is a low point for the game. Utter nonsense. \nIn general the writing is tedious and a lot of the story is monotonous.\nOn the positive side, the visuals and voice acting are both great.\nIn terms of stability... the game has crashed a couple of times on me... once during a boss fight. Arghhh.\nBuy it on sale if you liked previous instalments.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Let's say that the story doesn't matter. For me personally it did compromise my playing experience, but let's assume that for the average player it doesn't.\nThis game is still one I wouldn't recommend, mainly because of the Atreus sections: they're not skip-able, they're long and tedious with too much dialogue from highly Americanized characters that do not fit the game's mythology/fantasy setting at all (they speak extremely casually about trivial topics and jokey-jokes), and the combat is considerably less complete than Kratos since obviously they didn't go to the trouble of making two separate and fully complete playable characters. Atreus has no armor to customize (beyond appearance), has much no real build variety, and plays much less fun than Kratos. I initially saw that this game has much less wall climbing and thought it would be more replayable than the 2018 GOW game, and how wrong was I on that point... since this time you're instead stuck with playing atreus for two long and tedious sessions every time you want to beat the game again.\n\nAlso, the game was clearly rushed half way through and abruptly rushes to the final boss fights, which were huge disappointments: the 2018 GOW game got its claim to fame from the first fight with Baldr, which featured a lot of environmental changes and destructions, demonstrating how a world realistically changes when two superpowered beings fight. The final battles against Odin and Thor, two vastly more powerful gods, fail to even dent the wooden houses in Asgard.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Grand fan du précedent jeu, je ne comprends pas comment ils ont pu à ce point foirer la suite. Alors oui c'est beau, la modélisation est canon, mais les passages forcés avec le gamin, l'histoire molle et sans rebondissements, les cinématiques à rallonge font que je m'emmerde passé 10 minutes de jeu.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vanaheim the compass ranges from useless to entirely broken.\r\nIf you can manage to get through without looking up \"how to get out of the abandoned village\" then you're a master of the luck stat that's for sure.\r\n\r\nJust seems to be full of little annoying problems, characters bugging out, broken areas of the map, nornir chests idols hidden in really weird places not much like prior game. Weirdly some boss fights you'd think should be hard are fairly easy and fun, minibosses can be insanely difficult and work entirely different to the prior game. Travellers are a total nightmare, they're basically immune to rune attacks, trying one will get you killed.\r\n\r\nIf it weren't for an engaging story I'd have stopped playing this ages ago. Just slogging my way through rage quits to finish at this point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As a fan of the series and completely in love with God of War (2018), I have to say that I wasn’t as captivated by this game as others seem to be.\n\nI can’t deny that it’s a masterpiece, and it’s even the best version of any other game in the franchise. This is a superior product. However, the ending left me unsatisfied and felt a bit rushed.\n\nThe emotional tone left by the first game as a father-and-son adventure can’t be replicated in this larger-scale god-hunter story—and that’s okay. After all, this is still God of War.\n\nIn my personal opinion, the first game explored new depths that this one overlooks. It’s a great game, but I don’t necessarily recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Enemies are atrociously hard to fight on the easiest game mode mode. Which is a shame because this game had a really compelling story, ruined by the combat. I can't even finish the main story because the combat is that bad. Enemies are too fast, too unpredictable, deal too much damage, and the worst part, they come in hordes. Bosses don't even deal that much damage. \r\n\r\nDo not buy this game, you're better off spending your money on anything else.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wanted to play it since it was announced and I absolutely loved the game that came before it but unfortunately due to a massive string of technical issues I'm forced to refund it. The game freezes every time on the cutscene with Thor and every time it crashes to desktop. Reinstalling the game and the drivers, verifying the game cache and tinkering with the settings, managing temps, nothing works. The 2018 game ran absolutely flawlessly without any problem whatsoever. It's a damn shame really as I really looked forward to playing this one.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I had bought this game not too long ago. I was excited to start playing it as I had played this game on the PS4 before. However, when I tried opening the game, the game would not launch. I would get an error saying \"SCE_PSPC_ERROR_IPMI_ERROR_TIMEDOUT 0x8002051a\". I tried to fix it multiple times. but nothing seemed to have worked. I'm really disappointed and I have refunded the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This review isnt about the game itself, more about the fact that i simply cannot launch the game anymore. Whenever i do, it just goes to a white screen/black screen and it remains that way, not loading the game at all. I tried my best on fixing it but nothing works. I love the game, but i cannot recommend it when you're facing this issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was looking forward to playing this. Imagine my disappointment when I tried to launch the game only to get an  error message (SCE_PSPC_ERROR_IPMI_ERROR_TIMEDOUT 0x8002051a) every time. I did some research and learned that it has something to do with Sony's PlayStation software that is attached to the game. From what I read, older versions worked just fine (which explains the reviews because people were able to play it), but the Sony software auto-updates, and new installs come with the newest version, which seems to be incompatible and leaves the user unable to even launch the game. \n\nThere were a few tricks to get it to possibly get it to work, but short of downloading mods and other workarounds, I never got it to work at all, so I am attempting a refund, because I shouldn't have to perform a bunch of tricks to get a AAA game to launch. Hopefully this is something that gets fixed in the near future, because it's so disappointing to download a massive game that you're looking forward to enjoying, only to find out there's no way to play because of the publisher's attached software.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Straight off the bat, this port is broken.\n\nThe controls don't work unless you're using the default preset from the Devs. The game doesn't support valve controller presets and if you so much as tab out of the game you lose haptics until you re enable the default controller preset.\n\nIf you want to have a somewhat enjoyable experience it's recommend you make a custom layout from the default preset then save that layout. However if you still want haptics you'll have to switch between a generic gamepad preset then back to the one you've just made and never touch steam buttons or turn off the device as you'll have to do this process all over again. THIS IS RIDICULOUS!\n\nDon't buy this Game...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Agh, now I have to put it back to a negative review. Was working well, this game just sometiems doesn't feel like running, now it's crashing immediately at startup. This should not be a probelm for a AAA game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In the 5 hours I have played this game it has crashed about 5 or 6 times, hard crashing my pc about half of them. I don't know wtf is going on with this game's optimization along with the fact that the game is almost 200 FUCKING GIGABYTES that it's having this many performance issues. I haven't had any freezing issues but I've seen plenty of people also complaining about that as well. I didn't have ANY issues with crashing on any other game until I installed this piece of shit. I don't crash at all in any other game BUT this one. Idk wtf is in those 175GBs of bullshit that's causing this game to not work on my PC, but it's frustrating. I can't imagine myself ever finishing this game if it's gonna just keep doing this.\n\nPlaystation for the love of god get your fucking shit straight.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is shame on the gaming studio that they have not fixed the issue with crashing/ black screen for months. I would not recommend anyone buying this game, check the discussions tab, you will know how many players have this issue. I was able to play for 4 hours, a lot of content/ map/ art if copied from the previous game. Maybe there is more content but I can't tell since I can't play the game anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the u.i. is cheap under developed and has no flow even the journal text font looks out of place, clearly they over corrected here but outside of that youre going to get a general sense of the game just feelings kind of \"off\" the voice acting and performance is fine and is done well as it is kind of the only thing keeping this game standing, its a damn shame given the bones they had to work with. everything even traveling between worlds feels like it was simplified to an insulting degree. if im honest its good enough to enjoy but i cant help but feel like they just shat out something passable and called it a day",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In the original God of War trilogy Kratos was an assertive man's man, banging chicks and revenge killing Olympus. It was a massive vibe. \n\nIn the first reboot God of War (2018) they turned Kratos into a wise and now jaded father figure looking to just scatter some ashes.\n\nI was digging the character arc and I was super pumped for Kratos' character development in the second game.\n\nNow with this game they turned him into an aging pushover wimp and made his character play second fiddle to his own son. Why???\n\nAtreus is annoying (like every teenager so accurate I guess?) but the game forces you to play as him for what seems like hours... \nHis sections are boring, his bow gameplay feels bland and this whole game somehow ends up feeling pretty much like the first reboot game but waaay more gay.\n\nShould've called it Cuck of War: Ragnarok.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I’m sorry, but this God of War is painfully boring. I dread booting it up.\n\nI can’t even pin down one cause, but good lord, 3/4 of the cast sound like they need therapy and a long break from complaining. After a full day of work and putting my three kids to bed, the last thing I want is to sit down and listen to another round of characters unloading their issues at me instead of letting me play the game.\n\nThe pacing crawls. The dialogue drags. Every time momentum builds, the game slams on the brakes so someone can deliver another emotional monologue. I don’t mind story, but this feels like wading through wet cardboard; heavy, slow, and joyless.\n\nGames are supposed to offer escape. This one feels like extra homework. I wanted mythic adventure, not hours of guided therapy sessions.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really like god of war but whenever I load up game I get a permanent black screen and basic verify files doesn't fix, reinstall doesn't fix, loading old save doesn't fix, deleting user preferences doesn't fix and this is an issue that really shouldn't even happen at all for a $100 game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty bad\r\n\r\nOutside of Heimdal and Thor there are no interesting boss fights. Krato's character is constantly being ruined by Santa Monica.\r\n\r\nThe replay value for this game is non existent, especially due to sections like ironwood being a 1 hour playable cutscene, it just kills the joy from the game\r\n\r\nThe berserkers are nowhere near as interesting as the valkyries, and for some reason Santa Monica decided to make a major variety of them DUAL enemies\r\n\r\ndef the weakest God Of War game in my eyes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I essentially have a dead game that won't start due to the PSSDK mandatory run requirement used to run this piece of shit, I have uninstalled the game 10 times, installed, uninstalled, and reinstalled all sdk runtime installers and managers as needed another 10 times. I refuse to go in as admin to fix a problem sony fucked up when they packaged this garbage ass port. Until these LAZY ASS developers get off their ass and fix this shit we are all gonna suffer from a dead game because sony doesn't want to fix their game. And I'm not gonna fiddle fuck my computer to make it run because sony won't. SONY GET OFF YOUR STUPID LAZY ASS AND FIX YOUR FUCKING GAME.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is good but if only they will fix the rediculous amount of bugs in this game with black screen from launching the game to flinking of screen playing the game or talk about the freezes or sudden crash , total mess imagine spending 30 min struggling to make the game work each time after 2 years i dont recommend\r\nspending your money for this stress",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know how to review this without comparing it to God of War (2018). It's an okay game.\nIt's definitely not as focused of an experience. More is better is the punchline of this game.\nMore characters! More weapons! More puzzles! More exploration!\nUntil you realise how unrewarding it all feels. \n\nI can't fully put that into words but GOW2018 hooked me and didn't let go. Ragnarok however I've come back to and stopped three times now. The gaps feel so long between important events. The enviroments feel so linear and generic. Puzzles are ruined by your companions chiming in every 5 seconds even with hints turned off. Armor and weapons have more effects but the game will pigeonhole you after a few levels if you don't do all the sidequests the game wants you to. It's just a strangely unrewarding loop of things.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't recommend the game for just one reason:\r\nPoor port for PC, where the game can't maintain 120 fps at 2k res on Medium graphics settings.\r\nIt's unacceptable (for me at least) to play it on a very good PC (RTX4080 + I9-13900K) and the game fails to maintain that.\r\nThis game and Last of Us Part 1 remake have the same problem and while they are both one of the best games ever made, these 2 PC ports are not worth it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is great fun, the gameplay is responsive, easy to learn yet with it's difficulties making it an enjoyable challenge. The story is lacking, a lot. You have literal WAR GODS actively trying to stop any warfare, but I can overlook this considering what happened earlier in this story. However, race swapping pre established characters is absolutely sick and incredibly racist. But somehow it's ok in this instance since it's directed against a minority that only makes up 7% of the population and was ordered to be done by Sweet baby inc. Absolutely disgusting behaviour!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "overrated honestly. Only buy it if its 50 or more procent off, and if you want to 100% complete it just play on the easiest difficulty, as there is no achivement for playing on \"give me god of war\" and the combat gets really boring. \n\nbase game 6/10\nvalhalla 7/10 if you like rougelikes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Atreus and Angraboda BS needs to be cut from this game. It honestly ruined the whole experience. Go make a Bluey game for kids or something if you want to go that BS route",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is OK. Not as good as the first one. Story is worse. Bosses arent as cool. It feels like they half-assed this one.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "first game was great. it was raw and unfiltered yet smooth. this is ass. treats you like youre stupid. doesnt let you solve puzzles on your own. doesnt let you decide where to go without this stupid little atreus shit laying out all your options for you with his retarded ass pubescent voice lines.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played less than 30 min. Plagued with unskippable cutscenes of b-movie grade dialogue and non sense. I remember the original GOW games on Plyastation. They were great and epic. This one has an effeminate boy following you everywhere and the badass action hero is now an emotional old man... REFUND.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Loved playing this on the PS5, and love it just as much on the PC. But please, the audio settings are so annoying to fix. Constantly puts me in Speaker mode and doesn't let me turn on Headphones mode, using a HyperX III with Dolby Atmos. Audio sounds flatter and extremely unbalanced. I hope they fix this some time soon.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The visuals in this game are amazing.  The storytelling is not.  It's super boring for a majority of the game with tons of ridiculous walking and talking about nothing.  Some of the characters are super annoying too. Major step down from the God of War 2022.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the worst games in recent memory was God of War 2018. A long, drawn out, soulless adventure that took everything you loved about God of War originally and threw it out the window to become a Last of Us styled Sony Movie cutscene bullshit experience. No fun boss fights, a terrible combat system, shoehorned RPG elements, a focus on story over actual gameplay, and worst of all, some truly annoying characters. (Atreus.) God of War 2018 was a trainwreck, a game that fundamentally ruined my favorite franchise of all time, and now, years later, after sitting through that garbage for the platinum, Ragnarok is upon us. Would you believe me if i said this is actually an improvement over 2018 in one singular aspect, and a completely separate trainwreck in almost every other regard? Isn't that amazing? Even the morons that enjoyed 2018 don't like this game. Sony's dedication to making every game play and feel exactly the same is admirable.\nAnyway, I will give credit where it is due. This games combat is a marked improvement over 2018, so much so that looking at gameplay of 2018 just reiterates to me how terrible that game was. Kratos having 3 weapons adds a lot, especially having the blades right at the start. I enjoy the spear gameplay, and the overall flow of combat is much better, more enemies, less waiting around than 2018, and amazingly, actual enemy variety, which was one of the worst parts about 2018. So basically, the game is fun when you are fighting something, and every other time is a boring, vapid, overblown and overdramatic mess. Not a good mix.\nThe only other positive I can give is this. The character designs for the Norse gods encountered here are cool, especially Thor. Odin looks appropriately shifty and evil, and I especially like the attention to actual Norse mythos with designs such as Hiemdall. I enjoy the mythology, and same as 2018, Mimir and his stories are a highlight.\nOnto the bad. This game is boring as hell. It is too long, too overdramatic, and more than anything it is boring beyond belief. The story is pitiful, actually worse and less engaging than 2018, (I can't believe they managed that), and the characters are annoying and contrived, and worst of all is the tone. This feels like a marvel movie, and that is not a good thing. These two norse games have had two good characters, Kratos and Mimir, and just when you're trudging through the game at a snail's pace, just wanting to get to the action, it actually makes you play as Atreus. My jaw dropped, really. Any Atreus section is boring, and the combat sucks so much ass it makes you wanna turn the game to easy mode and just skip all the tedium. Atreus is not as annoying as he was in 2018, but at the same time he is still so annoying that nothing has really changed. The segment of Ironwood alone almost made me give up on this bullshit but I had to see it through. The story beats are predictable, contrived, and the ending is so, so unsatisfying, even compared to 2018. The twist was admirable as an attempt, but ultimately feels flat, especially in the postgame where you actually meet the real Tyr. What an absolute waste of what could have been an interesting dynamic, Tyr and Kratos, two very different gods of war. At least it had a few unique boss fights, unlike 2018, so I will give it that credit.\nThe one saving grace of this game is actually the stupid roguelike mode if you can believe that. While 2018 had a god awful attempt at something like this, Valhalla is, to put it simply, entertaining. No dumb characters to listen to whine, no stupid exploration at a snail's pace, just combat. That's all this game is good for. The callbacks to Greece, old weapons, old enemies, a familiar face, and the overall story of Valhalla was the only time during this game I actually felt like I gave a shit about anything. Kratos is my favorite character in anything ever, and when he isn't surrounded by marvel characters and stupid side characters like that dumbass squirrel, he can shine. But as soon as you start getting into the groove of it, It's over. I took my trophies and dipped, because it offers little after the fact.\nDon't let the 90 hours of gametime fool you, this game sucks ass upon ass. I would rather play it than 2018, simply for the combat's sake, but that is a vapid statement, as I would rather die than ever touch either of these games again. I play and platinum them so that I can explain to you how garbage they are, and when the next godawful God of war sequel comes out, where they will inevitably force you to play as Atreus again, I will be here, in the reviews, to let you know that it's just as garbage as the last two. This franchise use to mean something to me, and though Valhalla offered glimpses back into the fun and exciting era of Greece, where everything was bombastic, exciting, and more than anything entertaining, the success of these two Norse games will no doubt keep us from ever having the franchise return to it's roots. It is a shame, and that's exactly how I would describe this game. While 2018 was abysmal, a slap in the face even, Ragnarok is somehow worse. You see the glimpses of fun in the heat of combat, and feel shame that this franchise has been reduced to a Last of Us ripoff. If you think this is a good game, I hope for your sake that you are on medication or currently seeking asylum.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cant play because of Sony's Sdk crashing the game on launch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think one of the laziest sequels to follow up from such an incredible original (GOW 2018). This is one of the purest examples of publishers adding time rather than value in order to make a game feel more substantial: More collectibles to fill time; More backtracking to collect said collectibles; Unskippable cutscenes; Small, non-threatening, unnecessary fights whenever you approach a chest (because they lock chests during combat and adding a fight before opening a chest adds time (BUT PROVIDES NO VALUE)); Lackluster overworld compared to last game (Tyr's temple vs. B&S's Treehouse); repetitive puzzles that only block your physical progression but don't provide any reward; walking simulators for hours that still provide no story progression and only filler fights (looking at you Atreus); lock-stepping inventory upgrades to story progression forcing investment of TIME; and adding forced side quests masquerading as main quests but that have nothing to do with the overarching story. This game steals your time in order to try to trick you into thinking its providing a substantial experience. It is not.\n\nSlowest game I've played in a long time. I am 11 hours in and I am still confused with no motivation to continue, hoping that clarity is just around the corner (it never is). Arguments between characters are endless loops with no closure until one is proven right or wrong by a certain story event. Any story progression is dampened with either a character's reluctance or a vague \"you'll understand this reveal at a later date.\" Then what's the point in revealing it? \n\nThis game feels like they planned a trilogy, realized 3 years into developing Ragnarok that they didn't have enough story for a trilogy, didn't change their release timeline, kept everything they worked on, then dropped the finale in right where they left off working on this one, and then slapped a $60 sticker on it.\n\nThis is a far cry from the previous game despite its similar, shiny exterior. At least the combat folks did their job. But for a story-driven, immersive game, this should not have been acceptable. Santa Monica should not be proud to put their name on this game for their asking price.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unfortunately by far not as good as the first one. \ntoo long and repetetive.. enemies are all damage sponges",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Has good and bad, for me rather dissapointment. Graphics and action are great. Lot of content, enemy types and variations. Story have highs and lows, on one hand main story of Kratos and his son is well written with emotional weight, on other cheap melodrama moments and questionably one-sided lecturing on topics like \"toxic masculinity\", you get the idea. Puzzles are bad, they are basically all find a switch, in most cases switch hidden behind bushes or similar clutter. Difficulty ballance is weird, part up to first boss fight is quite easy even on the highest difficulty, next areas everything incl. basic regular mobs become sponges.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "poor playstation port now not working on pc with no fixes found online so far",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The most disappointing GoW game since GoW ascencion",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "worth like 30$ if you are unemployed. otherwise worth maybe 15$.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring ahh Ironwood cutscenes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "GoW 2018 is great, but this one is boring.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "stupid game wasted my money\r\n\\",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "enchimento de chouriços MAXIMO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "He doesn't call him BOY",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "turned the series into a gey disney movie",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad gamr",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very woke",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game has a game breaking memeroy bleed bug that is causing it to crash anytime you pause after like 5-10 minutes. SONY PLEASE FIX IMMEDIATELY!!!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "5/10 - big disappointment after great previous part.\n\nPros:\n+ Nice gfx\n+ Still interesting setting - but wasted opportunity\n\nCons:\n- It seems the producer is trying to change God of War into some generic fantasy story. It also has more teenage-fantasy feeling that was absent in previous parts of the series. Even though the last part was already different from the early GoW games - it was still dramatic and bloody feud of Kratos (as a father fighting for survival of his son) vs (psychotic) God, fitting the setting very nice. Now we have some generic \"good guys vs bad guys\" story with naive looking maps, cliche characters/sides and cringy dialogues. There is also not so much Kratos here - as we play many missions with Atreus. This could be interesting addition if those missions were not so dull and not so dominating for the game.\n- \"Newyorkisation\"/racial checkboxing in form of angrboda wouldnt be so bad probably..... IF she wasnt THE most irritating and dull character in the whole game. And also the map/missions where we first meet her is the worst/most boring map of the game. Amazing acheivment...\n- Opponents get very repetitive after first 10 hours. Boss fights are VERY underwhelming/disappointing. It was also a problem of the previous game but it somehow got worse. I would call only two of those fights \"epic\", the rest were not worth of remembering. This is not how GoW game should be.\n- Equipment/builds are mostly pile of forgetable garbage and statistics you get along the way.\n- \"Puzzles\" are mostly about forcing you to click more and more abilities to open the simple path. Empty time fillers.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Ever since the last patch the game runs fine for 90 minutes to two hours and then completely freezes while audio continues. unacceptable. I love this game but it needs serious work to fix that.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "I really really like this game, this review is not that much about the game but about the very poor performance you have to endure on PC, and the constant crashes, I have more than the recommended requirements for it and it still crashes, its infuriating, I just wish this could be fixed.\nThe game itself is great and I have no complaints regarding the game itself.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "The combat is really trash compared to the 2018 game. I've no idea how they messed it up so bad. You are playing a weakling.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game doesnt even launch get a playstation sdk runtime no matter what i do from everything online nothing helps fix ur game kinda shocking i loved the game before this one and was looking forward to it",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "BE WARNED. \n\nI got this game and was very excited to play it. had an unfixable playstation plugin runtime error that has rendered this game unplayable. i've tried a bunch of things and it still wont start.\n\nfun game until this issue came up but until this can be fixed, i dont recommend playing this port.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Not as good as God of War 2018, which I liked.\nTLDR - Convoluted exposition, lots of boring fetch quests, lots of climbing and squeezing through walls to disguise loading... Sweet Baby Inc. involvement is very obvious and detracts hugely from the game. Fighting the giant DEI granny who tortures animals is a low point for the game. Utter nonsense. \nIn general the writing is tedious and a lot of the story is monotonous.\nOn the positive side, the visuals and voice acting are both great.\nIn terms of stability... the game has crashed a couple of times on me... once during a boss fight. Arghhh.\nBuy it on sale if you liked previous instalments.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Let's say that the story doesn't matter. For me personally it did compromise my playing experience, but let's assume that for the average player it doesn't.\nThis game is still one I wouldn't recommend, mainly because of the Atreus sections: they're not skip-able, they're long and tedious with too much dialogue from highly Americanized characters that do not fit the game's mythology/fantasy setting at all (they speak extremely casually about trivial topics and jokey-jokes), and the combat is considerably less complete than Kratos since obviously they didn't go to the trouble of making two separate and fully complete playable characters. Atreus has no armor to customize (beyond appearance), has much no real build variety, and plays much less fun than Kratos. I initially saw that this game has much less wall climbing and thought it would be more replayable than the 2018 GOW game, and how wrong was I on that point... since this time you're instead stuck with playing atreus for two long and tedious sessions every time you want to beat the game again.\n\nAlso, the game was clearly rushed half way through and abruptly rushes to the final boss fights, which were huge disappointments: the 2018 GOW game got its claim to fame from the first fight with Baldr, which featured a lot of environmental changes and destructions, demonstrating how a world realistically changes when two superpowered beings fight. The final battles against Odin and Thor, two vastly more powerful gods, fail to even dent the wooden houses in Asgard.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Grand fan du précedent jeu, je ne comprends pas comment ils ont pu à ce point foirer la suite. Alors oui c'est beau, la modélisation est canon, mais les passages forcés avec le gamin, l'histoire molle et sans rebondissements, les cinématiques à rallonge font que je m'emmerde passé 10 minutes de jeu.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just for the Ironwood part alone I will leave this game a negative review.\n\nAlso for the love of god, for the next game can we not have this \"Disney ride\" style of the game again? I absolutely hate that some puzzles have clear and obvious solutions to them but no, you can only do the illogical way that the developers say so. Let me ACTUALLY play the game!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The most glaring problem in God of War Ragnarök is without a doubt the UI design. The UI in this game is straight-up terrible. In God of War (2018), everything was clean, minimalist, and respectful to the player. In the new game, it’s the complete opposite: the text is unnecessarily huge, taking up half the screen. Informative messages are shoved right into your face with massive black shadows behind them. It honestly looks like it was designed by someone with zero sense of aesthetics.\n\nThe navigation is a complete mess. In the previous game, you could access the map, quests, and gear easily with different buttons. Now everything is crammed into one menu. The user experience is basically nonexistent. The game doesn’t guide you — it yells at you. The UI doesn’t serve the player; it gets in the way.\n\nAnd if that’s not enough, the map system is a total disaster. Getting from one place to another is absurdly complicated. Even something as simple as finding a fast route feels like a chore. The map is designed not to help the player, but to frustrate them.\n\nIn short, the game might have an incredible story, but when it comes to UI design, it completely fails. The clean and simple design of 2018 is gone. What we have now is a cluttered, ugly, and frustrating system. Seeing such a terrible UI in a game of this caliber is honestly embarrassing.\n\n(Whoever designed the interface should be fired.)\n- but a game with a rich story",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Vanaheim the compass ranges from useless to entirely broken.\r\nIf you can manage to get through without looking up \"how to get out of the abandoned village\" then you're a master of the luck stat that's for sure.\r\n\r\nJust seems to be full of little annoying problems, characters bugging out, broken areas of the map, nornir chests idols hidden in really weird places not much like prior game. Weirdly some boss fights you'd think should be hard are fairly easy and fun, minibosses can be insanely difficult and work entirely different to the prior game. Travellers are a total nightmare, they're basically immune to rune attacks, trying one will get you killed.\r\n\r\nIf it weren't for an engaging story I'd have stopped playing this ages ago. Just slogging my way through rage quits to finish at this point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Let me start by saying this is a phenomenal game. My issue is that with the addition of the Valhalla dlc, there is some sort of memory loss issue with the game that has not been fixed in the past year. What this means in practice is that the game will crash very consistently every hour and a half to two hours. If/when this issue is fixed, this game will get a glowing review from me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i love this game with a passion but it crashes every hour an i have 0 idea why my pc runs the the game just fine on all high settings no overheating or anything it just stops and ive seen people having the same issue.\n\nEDIT: after almost 40 hours the game still constantly crashes after about every hour the error that pops up says my gpu is either overheating or faulty drivers (neither of which are true) i do not recommend this game to anyone unless you have the patience for it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Everything was fine for a few hours now this game is unplayable. Nothing but constant crashes and more issues. Great game though, get it on your PS5 instead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As a fan of the series and completely in love with God of War (2018), I have to say that I wasn’t as captivated by this game as others seem to be.\n\nI can’t deny that it’s a masterpiece, and it’s even the best version of any other game in the franchise. This is a superior product. However, the ending left me unsatisfied and felt a bit rushed.\n\nThe emotional tone left by the first game as a father-and-son adventure can’t be replicated in this larger-scale god-hunter story—and that’s okay. After all, this is still God of War.\n\nIn my personal opinion, the first game explored new depths that this one overlooks. It’s a great game, but I don’t necessarily recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Enemies are atrociously hard to fight on the easiest game mode mode. Which is a shame because this game had a really compelling story, ruined by the combat. I can't even finish the main story because the combat is that bad. Enemies are too fast, too unpredictable, deal too much damage, and the worst part, they come in hordes. Bosses don't even deal that much damage. \r\n\r\nDo not buy this game, you're better off spending your money on anything else.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wanted to play it since it was announced and I absolutely loved the game that came before it but unfortunately due to a massive string of technical issues I'm forced to refund it. The game freezes every time on the cutscene with Thor and every time it crashes to desktop. Reinstalling the game and the drivers, verifying the game cache and tinkering with the settings, managing temps, nothing works. The 2018 game ran absolutely flawlessly without any problem whatsoever. It's a damn shame really as I really looked forward to playing this one.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I had bought this game not too long ago. I was excited to start playing it as I had played this game on the PS4 before. However, when I tried opening the game, the game would not launch. I would get an error saying \"SCE_PSPC_ERROR_IPMI_ERROR_TIMEDOUT 0x8002051a\". I tried to fix it multiple times. but nothing seemed to have worked. I'm really disappointed and I have refunded the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This review isnt about the game itself, more about the fact that i simply cannot launch the game anymore. Whenever i do, it just goes to a white screen/black screen and it remains that way, not loading the game at all. I tried my best on fixing it but nothing works. I love the game, but i cannot recommend it when you're facing this issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was looking forward to playing this. Imagine my disappointment when I tried to launch the game only to get an  error message (SCE_PSPC_ERROR_IPMI_ERROR_TIMEDOUT 0x8002051a) every time. I did some research and learned that it has something to do with Sony's PlayStation software that is attached to the game. From what I read, older versions worked just fine (which explains the reviews because people were able to play it), but the Sony software auto-updates, and new installs come with the newest version, which seems to be incompatible and leaves the user unable to even launch the game. \n\nThere were a few tricks to get it to possibly get it to work, but short of downloading mods and other workarounds, I never got it to work at all, so I am attempting a refund, because I shouldn't have to perform a bunch of tricks to get a AAA game to launch. Hopefully this is something that gets fixed in the near future, because it's so disappointing to download a massive game that you're looking forward to enjoying, only to find out there's no way to play because of the publisher's attached software.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Straight off the bat, this port is broken.\n\nThe controls don't work unless you're using the default preset from the Devs. The game doesn't support valve controller presets and if you so much as tab out of the game you lose haptics until you re enable the default controller preset.\n\nIf you want to have a somewhat enjoyable experience it's recommend you make a custom layout from the default preset then save that layout. However if you still want haptics you'll have to switch between a generic gamepad preset then back to the one you've just made and never touch steam buttons or turn off the device as you'll have to do this process all over again. THIS IS RIDICULOUS!\n\nDon't buy this Game...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Agh, now I have to put it back to a negative review. Was working well, this game just sometiems doesn't feel like running, now it's crashing immediately at startup. This should not be a probelm for a AAA game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In the 5 hours I have played this game it has crashed about 5 or 6 times, hard crashing my pc about half of them. I don't know wtf is going on with this game's optimization along with the fact that the game is almost 200 FUCKING GIGABYTES that it's having this many performance issues. I haven't had any freezing issues but I've seen plenty of people also complaining about that as well. I didn't have ANY issues with crashing on any other game until I installed this piece of shit. I don't crash at all in any other game BUT this one. Idk wtf is in those 175GBs of bullshit that's causing this game to not work on my PC, but it's frustrating. I can't imagine myself ever finishing this game if it's gonna just keep doing this.\n\nPlaystation for the love of god get your fucking shit straight.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is shame on the gaming studio that they have not fixed the issue with crashing/ black screen for months. I would not recommend anyone buying this game, check the discussions tab, you will know how many players have this issue. I was able to play for 4 hours, a lot of content/ map/ art if copied from the previous game. Maybe there is more content but I can't tell since I can't play the game anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the u.i. is cheap under developed and has no flow even the journal text font looks out of place, clearly they over corrected here but outside of that youre going to get a general sense of the game just feelings kind of \"off\" the voice acting and performance is fine and is done well as it is kind of the only thing keeping this game standing, its a damn shame given the bones they had to work with. everything even traveling between worlds feels like it was simplified to an insulting degree. if im honest its good enough to enjoy but i cant help but feel like they just shat out something passable and called it a day",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In the original God of War trilogy Kratos was an assertive man's man, banging chicks and revenge killing Olympus. It was a massive vibe. \n\nIn the first reboot God of War (2018) they turned Kratos into a wise and now jaded father figure looking to just scatter some ashes.\n\nI was digging the character arc and I was super pumped for Kratos' character development in the second game.\n\nNow with this game they turned him into an aging pushover wimp and made his character play second fiddle to his own son. Why???\n\nAtreus is annoying (like every teenager so accurate I guess?) but the game forces you to play as him for what seems like hours... \nHis sections are boring, his bow gameplay feels bland and this whole game somehow ends up feeling pretty much like the first reboot game but waaay more gay.\n\nShould've called it Cuck of War: Ragnarok.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I’m sorry, but this God of War is painfully boring. I dread booting it up.\n\nI can’t even pin down one cause, but good lord, 3/4 of the cast sound like they need therapy and a long break from complaining. After a full day of work and putting my three kids to bed, the last thing I want is to sit down and listen to another round of characters unloading their issues at me instead of letting me play the game.\n\nThe pacing crawls. The dialogue drags. Every time momentum builds, the game slams on the brakes so someone can deliver another emotional monologue. I don’t mind story, but this feels like wading through wet cardboard; heavy, slow, and joyless.\n\nGames are supposed to offer escape. This one feels like extra homework. I wanted mythic adventure, not hours of guided therapy sessions.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really like god of war but whenever I load up game I get a permanent black screen and basic verify files doesn't fix, reinstall doesn't fix, loading old save doesn't fix, deleting user preferences doesn't fix and this is an issue that really shouldn't even happen at all for a $100 game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty bad\r\n\r\nOutside of Heimdal and Thor there are no interesting boss fights. Krato's character is constantly being ruined by Santa Monica.\r\n\r\nThe replay value for this game is non existent, especially due to sections like ironwood being a 1 hour playable cutscene, it just kills the joy from the game\r\n\r\nThe berserkers are nowhere near as interesting as the valkyries, and for some reason Santa Monica decided to make a major variety of them DUAL enemies\r\n\r\ndef the weakest God Of War game in my eyes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I essentially have a dead game that won't start due to the PSSDK mandatory run requirement used to run this piece of shit, I have uninstalled the game 10 times, installed, uninstalled, and reinstalled all sdk runtime installers and managers as needed another 10 times. I refuse to go in as admin to fix a problem sony fucked up when they packaged this garbage ass port. Until these LAZY ASS developers get off their ass and fix this shit we are all gonna suffer from a dead game because sony doesn't want to fix their game. And I'm not gonna fiddle fuck my computer to make it run because sony won't. SONY GET OFF YOUR STUPID LAZY ASS AND FIX YOUR FUCKING GAME.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is good but if only they will fix the rediculous amount of bugs in this game with black screen from launching the game to flinking of screen playing the game or talk about the freezes or sudden crash , total mess imagine spending 30 min struggling to make the game work each time after 2 years i dont recommend\r\nspending your money for this stress",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know how to review this without comparing it to God of War (2018). It's an okay game.\nIt's definitely not as focused of an experience. More is better is the punchline of this game.\nMore characters! More weapons! More puzzles! More exploration!\nUntil you realise how unrewarding it all feels. \n\nI can't fully put that into words but GOW2018 hooked me and didn't let go. Ragnarok however I've come back to and stopped three times now. The gaps feel so long between important events. The enviroments feel so linear and generic. Puzzles are ruined by your companions chiming in every 5 seconds even with hints turned off. Armor and weapons have more effects but the game will pigeonhole you after a few levels if you don't do all the sidequests the game wants you to. It's just a strangely unrewarding loop of things.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't recommend the game for just one reason:\r\nPoor port for PC, where the game can't maintain 120 fps at 2k res on Medium graphics settings.\r\nIt's unacceptable (for me at least) to play it on a very good PC (RTX4080 + I9-13900K) and the game fails to maintain that.\r\nThis game and Last of Us Part 1 remake have the same problem and while they are both one of the best games ever made, these 2 PC ports are not worth it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is great fun, the gameplay is responsive, easy to learn yet with it's difficulties making it an enjoyable challenge. The story is lacking, a lot. You have literal WAR GODS actively trying to stop any warfare, but I can overlook this considering what happened earlier in this story. However, race swapping pre established characters is absolutely sick and incredibly racist. But somehow it's ok in this instance since it's directed against a minority that only makes up 7% of the population and was ordered to be done by Sweet baby inc. Absolutely disgusting behaviour!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "overrated honestly. Only buy it if its 50 or more procent off, and if you want to 100% complete it just play on the easiest difficulty, as there is no achivement for playing on \"give me god of war\" and the combat gets really boring. \n\nbase game 6/10\nvalhalla 7/10 if you like rougelikes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Atreus and Angraboda BS needs to be cut from this game. It honestly ruined the whole experience. Go make a Bluey game for kids or something if you want to go that BS route",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is OK. Not as good as the first one. Story is worse. Bosses arent as cool. It feels like they half-assed this one.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "first game was great. it was raw and unfiltered yet smooth. this is ass. treats you like youre stupid. doesnt let you solve puzzles on your own. doesnt let you decide where to go without this stupid little atreus shit laying out all your options for you with his retarded ass pubescent voice lines.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played less than 30 min. Plagued with unskippable cutscenes of b-movie grade dialogue and non sense. I remember the original GOW games on Plyastation. They were great and epic. This one has an effeminate boy following you everywhere and the badass action hero is now an emotional old man... REFUND.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Loved playing this on the PS5, and love it just as much on the PC. But please, the audio settings are so annoying to fix. Constantly puts me in Speaker mode and doesn't let me turn on Headphones mode, using a HyperX III with Dolby Atmos. Audio sounds flatter and extremely unbalanced. I hope they fix this some time soon.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The visuals in this game are amazing.  The storytelling is not.  It's super boring for a majority of the game with tons of ridiculous walking and talking about nothing.  Some of the characters are super annoying too. Major step down from the God of War 2022.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the worst games in recent memory was God of War 2018. A long, drawn out, soulless adventure that took everything you loved about God of War originally and threw it out the window to become a Last of Us styled Sony Movie cutscene bullshit experience. No fun boss fights, a terrible combat system, shoehorned RPG elements, a focus on story over actual gameplay, and worst of all, some truly annoying characters. (Atreus.) God of War 2018 was a trainwreck, a game that fundamentally ruined my favorite franchise of all time, and now, years later, after sitting through that garbage for the platinum, Ragnarok is upon us. Would you believe me if i said this is actually an improvement over 2018 in one singular aspect, and a completely separate trainwreck in almost every other regard? Isn't that amazing? Even the morons that enjoyed 2018 don't like this game. Sony's dedication to making every game play and feel exactly the same is admirable.\nAnyway, I will give credit where it is due. This games combat is a marked improvement over 2018, so much so that looking at gameplay of 2018 just reiterates to me how terrible that game was. Kratos having 3 weapons adds a lot, especially having the blades right at the start. I enjoy the spear gameplay, and the overall flow of combat is much better, more enemies, less waiting around than 2018, and amazingly, actual enemy variety, which was one of the worst parts about 2018. So basically, the game is fun when you are fighting something, and every other time is a boring, vapid, overblown and overdramatic mess. Not a good mix.\nThe only other positive I can give is this. The character designs for the Norse gods encountered here are cool, especially Thor. Odin looks appropriately shifty and evil, and I especially like the attention to actual Norse mythos with designs such as Hiemdall. I enjoy the mythology, and same as 2018, Mimir and his stories are a highlight.\nOnto the bad. This game is boring as hell. It is too long, too overdramatic, and more than anything it is boring beyond belief. The story is pitiful, actually worse and less engaging than 2018, (I can't believe they managed that), and the characters are annoying and contrived, and worst of all is the tone. This feels like a marvel movie, and that is not a good thing. These two norse games have had two good characters, Kratos and Mimir, and just when you're trudging through the game at a snail's pace, just wanting to get to the action, it actually makes you play as Atreus. My jaw dropped, really. Any Atreus section is boring, and the combat sucks so much ass it makes you wanna turn the game to easy mode and just skip all the tedium. Atreus is not as annoying as he was in 2018, but at the same time he is still so annoying that nothing has really changed. The segment of Ironwood alone almost made me give up on this bullshit but I had to see it through. The story beats are predictable, contrived, and the ending is so, so unsatisfying, even compared to 2018. The twist was admirable as an attempt, but ultimately feels flat, especially in the postgame where you actually meet the real Tyr. What an absolute waste of what could have been an interesting dynamic, Tyr and Kratos, two very different gods of war. At least it had a few unique boss fights, unlike 2018, so I will give it that credit.\nThe one saving grace of this game is actually the stupid roguelike mode if you can believe that. While 2018 had a god awful attempt at something like this, Valhalla is, to put it simply, entertaining. No dumb characters to listen to whine, no stupid exploration at a snail's pace, just combat. That's all this game is good for. The callbacks to Greece, old weapons, old enemies, a familiar face, and the overall story of Valhalla was the only time during this game I actually felt like I gave a shit about anything. Kratos is my favorite character in anything ever, and when he isn't surrounded by marvel characters and stupid side characters like that dumbass squirrel, he can shine. But as soon as you start getting into the groove of it, It's over. I took my trophies and dipped, because it offers little after the fact.\nDon't let the 90 hours of gametime fool you, this game sucks ass upon ass. I would rather play it than 2018, simply for the combat's sake, but that is a vapid statement, as I would rather die than ever touch either of these games again. I play and platinum them so that I can explain to you how garbage they are, and when the next godawful God of war sequel comes out, where they will inevitably force you to play as Atreus again, I will be here, in the reviews, to let you know that it's just as garbage as the last two. This franchise use to mean something to me, and though Valhalla offered glimpses back into the fun and exciting era of Greece, where everything was bombastic, exciting, and more than anything entertaining, the success of these two Norse games will no doubt keep us from ever having the franchise return to it's roots. It is a shame, and that's exactly how I would describe this game. While 2018 was abysmal, a slap in the face even, Ragnarok is somehow worse. You see the glimpses of fun in the heat of combat, and feel shame that this franchise has been reduced to a Last of Us ripoff. If you think this is a good game, I hope for your sake that you are on medication or currently seeking asylum.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cant play because of Sony's Sdk crashing the game on launch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think one of the laziest sequels to follow up from such an incredible original (GOW 2018). This is one of the purest examples of publishers adding time rather than value in order to make a game feel more substantial: More collectibles to fill time; More backtracking to collect said collectibles; Unskippable cutscenes; Small, non-threatening, unnecessary fights whenever you approach a chest (because they lock chests during combat and adding a fight before opening a chest adds time (BUT PROVIDES NO VALUE)); Lackluster overworld compared to last game (Tyr's temple vs. B&S's Treehouse); repetitive puzzles that only block your physical progression but don't provide any reward; walking simulators for hours that still provide no story progression and only filler fights (looking at you Atreus); lock-stepping inventory upgrades to story progression forcing investment of TIME; and adding forced side quests masquerading as main quests but that have nothing to do with the overarching story. This game steals your time in order to try to trick you into thinking its providing a substantial experience. It is not.\n\nSlowest game I've played in a long time. I am 11 hours in and I am still confused with no motivation to continue, hoping that clarity is just around the corner (it never is). Arguments between characters are endless loops with no closure until one is proven right or wrong by a certain story event. Any story progression is dampened with either a character's reluctance or a vague \"you'll understand this reveal at a later date.\" Then what's the point in revealing it? \n\nThis game feels like they planned a trilogy, realized 3 years into developing Ragnarok that they didn't have enough story for a trilogy, didn't change their release timeline, kept everything they worked on, then dropped the finale in right where they left off working on this one, and then slapped a $60 sticker on it.\n\nThis is a far cry from the previous game despite its similar, shiny exterior. At least the combat folks did their job. But for a story-driven, immersive game, this should not have been acceptable. Santa Monica should not be proud to put their name on this game for their asking price.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unfortunately by far not as good as the first one. \ntoo long and repetetive.. enemies are all damage sponges",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Has good and bad, for me rather dissapointment. Graphics and action are great. Lot of content, enemy types and variations. Story have highs and lows, on one hand main story of Kratos and his son is well written with emotional weight, on other cheap melodrama moments and questionably one-sided lecturing on topics like \"toxic masculinity\", you get the idea. Puzzles are bad, they are basically all find a switch, in most cases switch hidden behind bushes or similar clutter. Difficulty ballance is weird, part up to first boss fight is quite easy even on the highest difficulty, next areas everything incl. basic regular mobs become sponges.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The most disappointing GoW game since GoW ascencion",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "worth like 30$ if you are unemployed. otherwise worth maybe 15$.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring ahh Ironwood cutscenes",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}