{
  "positive": [
    {
      "review": "Ah, if only words didn't exist... things would be easier, right?\n\nWhen I first started playing, it took me a while to understand that these black silhouettes, merrily running about, were other people.\nSimple, yet pure. Through movement, through emotes, an endearing expression of the good in all of us.\nIt made me want to befriend everyone I met.\nIt made me remember these simple moments of bonding in real life.\n\nIt made me realize the value of words.\n\nMaybe we're too quick to resort to them. Maybe, if we listened carefully, we would find better ones.\nOr maybe I'm overthinking it.\n\nWhatever the case, dear reader, maybe one day our paths will cross.\nAnd I will try to listen. Will you?",
      "voted_up": true,
      "votes_helpful": 58
    },
    {
      "review": "Over all devices I have almost 1000 hours in this game, and I've been playing since 2021.\n\nIt's difficult to properly this describe this game. The visuals are beautiful, the music is soothing and captivating, flying is fun, and just the general feel of it is something I haven't encountered in any game before. \n\nYou can play it for 2h and just check it out. You can play through the \"\"main storyline\"\" and quit, and just experiencing that is worth it in of itself. The end sequence is one of the most beautiful things I have ever witnessed. You can continue playing, chat with players, enjoy and explore the new areas you unlock, and try to piece together some of the story that is only told through environmental storytelling. Or you can be like me and put 100rds of hours into it, because it is just so comforting and the gameplay loop really scritches something in your brain, and the few new things that get added are enough to keep you captivated. There is something for anyone that is curious about it.\n\nI wouldn't listen too much to people that say this is p2w - there is nothing to win. You make your own goal in this game. Don't try unlocking everything - you will absolutely get burnt out, frustrated and think this is p2w. The only thing you get additionally are cute cosmetics and sometimes secret areas. But that's it. The entirety of the game is open to you, to socialize in, to ravel in the beauty of it. \n\nIt's a special game. It's a piece of art you can glide through, and while ThatGameCompany has its issues, I feel it has been getting better during this year (2025). There is a lot of love put into this game that you can feel in many corners of it. Greed can never be completely wiped out of anything created by humans, don't let it taint the massive beauty that everything else is.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "[h3] Is Sky Worth Playing? [/h3]\n\nIt depends. The game isn’t for everyone — there’s no clear goal, no real progression. Some mechanics even tie the hands of new players who don’t have friends to help them enter certain areas or complete quests. Most of the enjoyment the game offers comes from talking to people and collecting cosmetics. Misantropes and socially anxious players likely won’t enjoy it, and completionists will probably burn out from the daily currency grind (unless they decide to pour their whole wallet into the game). Not to mention those who don’t like sitting around doing nothing or expect challenging quests. Sooner or later, the game becomes monotonous for many.\n\nI went through the phase of “This is the best thing I’ve ever seen” to “This feels like a second job” several times before I lost my account. Losing all the cosmetics I gathered over [i] four years [/i], including paid items, completely broke me. Only after a year-long break did I learn that the game was coming to PC.\n\nSo I returned. Not because I want to start from scratch, but because I want to change my approach.\nThe game truly is amazing. The world’s story might not be very deep, but it’s incredibly meaningful. [spoiler] “Every ending is just a new beginning.” [/spoiler] And I never expected philosophy to appeal to me.\n\nThe sky here is diverse. It’s unique. Nowhere else will you find moments like the ones this game can give you, especially player interactions. These encounters are special, mostly thanks to how friendly the community is. Truly, this game is about friendship. And the biggest paradox is that you don’t need deep relationships with anyone to feel it. Sky suits both extroverts and introverts. The only thing you need is the desire to show genuine kindness. And trust me, many people will respond you the same way.\n\nIf you feel that this peaceful world is right for you, I’ll give you just one piece of advice — don’t kill your love for the game by grinding candles every day. This game can become therapy if you learn to see the beauty in simple moments, whether it’s watching the world or talking to someone.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Beautiful game. Everyone I've meet were very sweet. It's fun making friends, and talking to people :3",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Beautiful game to play with your friends and loved ones. No competition, no guns and stuff, just pure co operation and bliss of exploring the world of sky together",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Such a calm game, fun with friends, my favorite soul game!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I don't really like it because I'm not in this type of games, but I recommend it to others.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played Sky a lot on mobile, and it's honestly one of the cutest games I know. It makes me feel like I've known strangers for years simply by using emotes, hugs, and whatever it lets me do. That pc version is exactly what I used to play before, and I still love everything about it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Soft, atmospheric, and emotionally driven, Sky delivers a peaceful world that encourages exploration and gentle cooperation. A calm, beautiful experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game gave me community ♥ \nAlthough I don't play as much as I did a few years ago, I always come back to it and each time it gets better and better. You can play this alone or with friends, some you'll even meet along the way! Either way, be prepared to fall in love with the stories. beautiful graphics the amazing soundtracks. \n\n I have absolutely loved this game since COVID, I'm so happy the pc version is as perfect ( if not even better ) than other platforms. \n\nThank you TGC ♥",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is the most beautiful game I have ever played. The visuals are amazing, the artists created this world of darkness and light. They created different kingdoms with different spirits (people) which show the suffering and greatness of mankind. The game involves co-operation, but not to a level that makes it unplayable if soloing. The devs constantly include new cosmetics and storylines every season.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Def my top all-time favourite game. Beautiful visuals and super fun to play with friends. :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A masterpiece of kindness and connection. This beautiful world is a peaceful escape where you help others without a single word. Pure magic!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really cozy and cute game by tgc, created great memories and found some amazing friends :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very enjoyable to play with friends and explore the world of Sky. I certainly recommend this for those that wanted Breath of the wild to have multiplayer aspects to it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very fun and cozy game. I adore the art-style and story, as well as how the story is told.\n\nThis is a comfort game, and you should play this game with an open heart. There is a lot of social aspects to the game, which makes it one of the most fun social games out there. I love the fashion, the designs, the characters, the emotes, and overall themes of Sky.\n\nThere is a lot locked behind events, paywalls, and grinding, but I wouldn't let that push you away from what the game truly is. I would love to see more ways to express ourselves through our little moths, without having to either grind for hours on end, or drop a bunch of cash on the game, but I won't complain too much about it either, since it is a F2P game.\n\nI have played a ton on PS5, and some on mobile, so when they released the game for PC, I was very pleased with how it was ported and love the cross-platform features.\n\nThis is an excellent game for anyone to play, and is honestly a very powerful and emotional game. I love Sky and it shall forever be in my heart.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love the game so much and I've only played for 8 days. The community and graphics is superb. Story quests are really heart-warming.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "(ESP)Es un juego que relaja bastante, puedes jugarlo solo pero también hay partes que requieren compañeros, no te preocupes puedes encontrarlos en el mismo juego y por qué no tal vez encontrar una nueva amistad. Vas descubriendo mundos, desbloqueando vestuarios, pero siempre recomendaría ver un tutorial antes para no \"desperdiciar\" recursos y encontrar nuevas rutas de farmeo.\r\n(ENG) is an incredibly relaxing and deeply soothing experience. While it's perfectly enjoyable solo, there are parts that require the help of others. Don't worry—the game makes it easy to find fellow players, and you might even forge some wonderful new friendships along the way! The core loop involves discovering beautiful worlds and unlocking charming cosmetics. However, to truly optimize your journey and avoid \"wasting\" precious resources, I would strongly recommend watching a beginner's tutorial first. It will help you discover the best farming routes and maximize your progress!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Over the course of owning this game on mobile, Nintendo Switch, PS4 and now PC, + PC Early Access. (Likely totally 1,000 hours or more. This game really is a charm of it's own. Wether your going through a tough time or just want to hang  out with friends, this game is suitable for anyone of any age. Highly Reccomend it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game! It's very relaxing and it's fun to collect cosmetics for my skykid. Though it does get repetitive, I still love this game very much. <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bes game ever. Relaxing vibe where you can chill with friends, and have an experience that you cannot find irl.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i blew off this game for years thinking i wouldn't like it til my friend recommended it to me and i have to say that i was so wrong, i am in love with it, it is such a beautiful game! aurora singing the music too!? ugh beautiful graphics and the stories you learn are so heart warming and heart wrenching. there is SO much to explore i keep finding little details i never noticed before just yes.. def recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "tranquil and captivating visuals. i love the element of exploration, i only wish we could do more within the world of sky, IE implementing more sandbox/survival mechanics. the seasonal spirit items being almost pay to win is very frustrating, seen as the ultimate goal of the game is to acquire cosmetics",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a long review; my apologies in advance.\n\n(NO SPOILER REVIEW)\n\nI can tell, Sky: children of light it's one of the best games of this type I ever played, it's a bunch of incredible memories and experiences alongside amazing people, that's why I have dedicated over 1100 hours on this game. The art, the places, the missions, the music, but most importantly: THE PLAYERS; this is why I can enjoy this game so much! and that's why I'm spending my time writing this review (I hope it's worth it for you).\n\nAnd with that already said, I'd like to point out the strengths and the weaknesses:\n\nTHE STRENGTH:\n\n\tIt's a very chill game, you can basically do whatever you want (it's more fun with friends), talk, travel, discover, make challenges like hide and seek, do missions together, etc... It's the best game I have ever seen to meet new people, the community it's also the most healthy I ever experienced! \n\tYou always can get help and in general feeling when you play it's magical! in short words, it's one of the best options to relax after a very hard day. The developers every time add new content so it's hard to get bored and you have access to a good part of the content for free.\n\nTHE WEAKNESSES:\n\n\tIn this section I'll start with the most obvious and important one... THE BUGS, every new up load it's a new kind of bugs... the game it's still playable but it can mess up with the experience sometimes... specially when you play with other people. \n\tAlso THE MICRO-TRANSACTIONS, unfortunately not all the content it's available for free and some of the items are just too expensive, many people cannot just afford all of them so normally if you are willing to pay you need to choose (not to mention you'll need to wait a while to see them available again). \n\tTo finish I also got THE CONNECTION PROBLEMS BETWEEN SERVERS; I play with friends that live in Asia and the connection problems (depends on the day) are usual, that of course could affect negatively the game experience.\n\nTo finish this review, I can tell you this game it's very enjoyable if you are looking for a calm, magical and anti-stress experience, but it's not perfect. I hope this review have been helpful and if you make it this far reading...\n\nI WISH YOU A GREAT DAY!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've actually been playing this game for years on another platform, and I'm having a blast doing it on the computer now! Obviously I recommend it, even if you're scared because of multiplayer, it's such a beautiful and fun experience, solo or with friends c: \r\nPut your headphones on and dig in!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is a lovely game to play, the times that i played it was magical and fun. totally worth the play time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sky Is a masterpiece of a game, I wish I could pay to get this game, This game has the best music I have heard and that's saying something, This game is my safe space. (Eden scary tho)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a really nice and relaxing game for those who enjoy adventures, it is definitely worth playing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I want to be clear with one thing, you don't play this game for the gameplay part, you play it for the experience. When you get into this one, you must understand its heavily story and experience-driven, the ambience is beautiful in every way, both music and graphics give you this heavenly cinematographic feel as if you were part of a long movie about recovering these lost souls and returning things to order. Its really easy to understand and quick to fall in love with.\nIt only took me about 20 minutes to fall in love with the concept and execution.\n\nHow is this game even free even for an early access build that yes, has some small issues at the time of writing this review but honestly, they are so minors you wont really care much.\nI feel im actively stealing from the developers by playing this without paying so i will seriously consider donating to them.\n\nIts simple, its addictive, its beautiful. Its a great game! Im probably going a bit insane for giving this game on early access such a high score but i think it might really deserve it.\nScore: 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly this game was there for me during the darkest part of my life, the friends i made here and the sky community as a whole has been an absolute pleasure to be apart of. i dont play as much as i used too, but its still amazing to see the effect of the community and where its ended up after all this time, truly a game that has grown with me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very shiny, best played on controller or phone. Even for those of us who hate multiplayer games, its as forced as most games. Easy to stay anon but easy to make friends. Very fun to play with friends you already have as well. The plot is a very interpretive rabbit hole, amazing how much storytelling they get across without a single word.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, cute and enjoyable. But the map is really difficult to understand and progression is hard without paying for a premium seasons pass. However it's cute and the co-op is nice, it's nothing crazy, but I enjoyed it and had fun with my friend for the little bit of time I played it. Needs more tutorial though, even if it's just readable settings cause I really didn't understand what was going on or what to do a lot and that made the experience less enjoyable. \r\n\r\nMusic is a 100/10 though, absolutly magical.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I, can't say enough how much this game is by far, is so unique to me.\nI'll be blunt out of the way first, I've not been friending anyone at all unless they friended me first, nor being more to ask them to do something with me, so there goes that part of friendship being important to playing the game out the window. The glitches are there, but it happens during serious moments in the story, or out of nowhere, that it is just outright so humorous to me, but other than that, game is stable at least to me. The mirco-transaction aren't going to make you stronger, and are just cosmetics, so that I think is fine. Working for the basic cosmetics though is a lot.\nNow, the everything else, I am at a loss for words. By the stars, I love Journey & Abzu gameplay videos when I was younger, with me finally experiencing the same studio that made those two, I'm still happy to see everything here. I am still surprised there is added horror-themed stuff in the game, I'm normally the type to feel strong fear to anything related, but I love that was added in anyways. Also, a few dark humorous part about getting some of the emotes, nice lol. I love how it has that Dark Souly(Never played it, but I heard a bit of the lore), but still super wholesome part about how the world works, but a lot of themes that might be based on Buddhism is unique and wonderful to see.\nIn short, I love the game. I've finished the game twice, and am willing to play a little longer. The multiplayer part is of course, what I'm happy to see done actually well here. Unlikely a game that might have VR stuff, actual wholesome(from what I see) community and good moderation, well done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you don't mind spending an admittedly considerable amount of moola on this game, it's lowk such a beautiful experience and a good portion of the people are amazing too! It is pretty demanding though, at least if you actually want to get a lot of stuff. You'd be wise to incorporate this game as routine if you wish to get that full experience. But making friends can ease the burden, trust. But there are some total weirdos and jerks, as with any social game, so be wary of that.\r\n\r\nThe game is just gorgeous with its well developed atmosphere, sounds, and even dressing up, one of the staples of this game I'd argue. And there's so much to do, even if you've already completed main game content!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game :) calm, relaxing, so much to explore, so much new stuff to find... beautiful, fun, soothing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so relaxing, calming, interesting, and exciting. Its double that with friends. you can make alot of new friends here too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really interesting game, it connect deep with your feelings and emotions, amazing community and storytelling",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "as a veteran, playing since the Season of Sanctuary, i have found many friends along the way. Met many amazing people, and i have gathered nearly 1000 hours on steam alone since the game came out, and i can say about 2000 on my phone before steam or more. This game, even if sometimes annoying because of the connection issues, or lag, or the iap's, shaped how i grew up and found someone who i care about a lot. Thank you Sky COTL for everything <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall i haven't played this game much but whenever i wanna go out for cozy relaxing game this one is best, atmosphere, wind sound and music is so soothing gameplay is another thing that i love.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game beautiful and relaxing you will enjoy flying any area and while searching the lost child that u need help and rescue from krill.. dark monster..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall 8/10!\nThe storyline is great! even without words, the emotions and physical actions of characters, and even you as the player convey so much emotion and feelings without a single whisper\nThe music is heavenly! with the collab alongside aurora it became a stunning melody that i can't help but go back to each time i play!\nThe visuals are calming and simple, it is not too overwhelming with details, but just enough to where you can understand what is what.\n\nMy only few complaints is the difficulty to gain and gather candles, having to plan a step by step \"run\" can lead to burnouts and frustrations. As well is that, i find the events a little straining as well, as it's more difficult for people without the seasons pass to gain anything that will allow them to gather and obtain outfits they genuinely love!\n\nEither way, this game has always had a special place in my heart, and has helped me through darker times, so despite my gripes with it, i am grateful for Sky; Children of the Light's existence.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game.\r\ngood story.\r\n\"ending\" feels like home.\r\nmake sure to play before looking up any online guides or playthroughs or such.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, wish to give it some bucks if they make it through steam interface. Phenomenal experience <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got to get to know some of the best people i have ever met playing this game. \n\nvery charming. and absolutely breathtaking to just relax and enjoy. thanks for the experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game since I was younger, started back in elementry and now after college i'm back playing it again on a new account. I absolutely love playing this game after work, the music is so soft and the game allows you to keep coming back to find new things that you didn't see on your first run through. \nI definitely recommend this game if you're looking for something just to get a breather from drama or chaos, or if you're just looking for something softer to play. This would be the game for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Everything about this game is truly stunning. I've met some awesome people so far none of them friends just passers by on a bench who just wanted to talk or listen. Honestly if you feel like trying this do it. This game is worth it in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game honestly feels magical. No AI tricks or weird systems behind the scenes — it’s just pure atmosphere, exploration, and connection. Flying around, helping random players, discovering little secrets… it all hits in such a peaceful, emotional way.\nSky has that rare vibe where you log in for ‘just a few minutes’ and suddenly an hour is gone because you were wandering around enjoying the music and lighting.\nIf you want something calming, social, and genuinely beautiful, this is one of the best experiences out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak 2022-2023 gameplay.. had so much fun playing this and honestly I had to use a Youtube tutorial to find those damned crystals or whatever it was.. nevertheless, I had such a great time playing this with friends and just admiring the scenery of this beautiful game!! 🥹",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It´s such a cozy game. I´ve been playing it since mid 2020. It’s perfect for relaxing after a long day with it´s beautiful scenery and an amazing soundtrack. The world is fun to explore and the little bits of story you uncover are really touching. If you just want something chill and heartwarming, this game is may be for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely phenominol game, i've played on mobile, ps5, and on here. Absolutely amazing visuals and a joy to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 game, didn't expect to go sledding down a Skyrim mountain to meet eldritch deities hunting me down in the underworld.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its such a good game honestly. yes, there are a few bugs. its sill just such a good game. Ive played this game so many times- and im starting off fresh with this new steam account. but, its just.. AMAZING. This game has actually made an impact on my life. i look forward to playing it. I look forward to the part of my day when i play it, and that helps me through the rest of my day. I know this makes me sound like im never off of it- i am. trust me, i just play it often enough to really love it. ps: the plot of the game isnt to beat eden. its to make friends, you just rebirth once you beat eden. and trust me; you'll make friends. its such a helpful game too- sometimes it makes you realize just what you have and that you should be grateful. so, thats all. and yes, im glazing this game. its good tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A beautiful game with great visuals and stellar music.\nTake your time to experience all the visuals, all the game lore and visit all the realms.\nOnce, all that is done, put the game away for good.\n\nIt's better to part your ways with a good experience rather than go through the daily rat race of collecting candle runs, witnessing server issues, constant disconnecting from your friends and server splits during important events. After you're done with the initial experience, all that's left to do is get online, run around collecting candles and buying overpriced in-app purchases and worrying about not having enough seasonal candles to get all the stuff from the seasonal stuff coz you missed couple days of candle runs.\n\nInitial Playthrough : 7/10\nRe-playability : 1/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was really nice to play for the first time, I just finished the game for the first time and overall It was pretty good. The only bad thing is that if you're going in blind and hoping for a one-and-done game or one with a satisfying ending, this game is probably not for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once you start playing you'll never truly be able to quit it,\nsure the devs are kind of money hungry but it's not necessary to enjoy the game at all and the people you meet on there will be your friends for life,\nit's perfect for a sit back and relax type of game session.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing game!\nA very relaxing game, if you look past literal hell, where you get to meet a bunch of amazing people!\nI love to just fly around and see how other people dress up their skykid :]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Sky, it's really cute, fun, and just wholesome overall! I was introduced to this game by a friend, and I couldn't stop playing this game. This game has brought out my inner child every time I play, and it's a safe place for everyone:\n\n- Free room to move and fly around\n- Goofing around with emotes that you unlock from freeing the spirits\n- Wearing stuff from temporary spells you earn\n- Decorate areas and your safe space\n- Interacting with creatures, as in some may attack, some may heal! (psstt, you can flip over the mean crabs!) :>\n- Being able to talk with friends, and only friends you've made\n- Explore each and every realm and the beauty of the environments\n- Bunch of events that happen here and there, and release cool items to collect (get em fast, before they poof and don't come back for a while!)\n- You can ask for help if you need, and a real player will actually assist you! You can do the same with another player who needs help\n\nLetting you know that players may show up as gray and boring at first, but once you light up each other with a candle, you can actually see them! When I first played, I thought they were bots lmao",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty gorgeous and chill game.\n\nSadly Includes FOMO like someone else mentioned, mostly a grind and same routines getting candles daily after completing the game.\n\nI still recommend to try it, maybe it's something for you or it might not be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sky is one of my favorite games of all time. I've been playing it for many years (but only a little while on Steam) and I've made some truly great memories. The community is wonderful, the world vibrant, the stories heartfelt. I couldn't recommend it enough, if you have the chance, I would absolutely try it out, you won't regret it :]\n\nSee you in the clouds, fellow sky kids!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games ever, best with friends but still good alone!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing game with an amazing community. Beautiful art style, music and base story. I can't recommend it enough <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The amount of time I've been playing has mainly been me confused. There is very little instructions on what to do or how to go about it, its been a trial and error majority of the time. The game seems nice, but its really off putting when you don't really know what you're actually doing or even working towards. Really do some research on the game before playing so you at least have an idea on what to do. Otherwise, its a nice cozy game to enjoy while the weather is feeling gloomy! Beautiful graphics, amazing soundtrack, very soothing!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I find it extremely comical that sky as an experience that tries to mirror a part of the  human condition mirror the exact same capitilistic suffering that people go through candle running everyday, craving cosmectics or useless stuff. The irony of it is perfect. Though you're making friend along the way and that is beautiful, together we candle run. Beautiful Game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the most quiet chill games ive played\nsincerly just wish the grind would be less\ni love the vibes and cosmetics sm.\nit definitely has nailed the relax and play vibes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is such a peaceful game. It's the perfect way to wind down from a stressful game, while also fueling your videogame desires. This is a open world game where you learn about the children of the light and the stories of spirits of sky people. This game can be played with other people and this is a perfect way to connect with your family, friends, and loved ones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cozy game and recommend to anyone that is looking for a great story-rich, and cozy game that you can heave fun with friends <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super relaxing atmosphere. Amazing story. Love returning here every time. Such an amazing game <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☑ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly relaxing game with tons of cool people to meet and hang out with. There's always something to do but you can also just relax where ever you want! Been playing since the game came out in beta and it's been incredible the whole time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sky is a social MMO story game in which you fly around, save spirits, and progress their friendship trees to unlock clothes. That's it. That's the game. It is very fun to talk to people from across the world but this requires investing your candles into their friendship tree or into a chat prop. There are chat benches in specific spots but these are limited. \n\nThatGameCompany uses FOMO in order to sell their season passes and seasonal candles which if you buy too late in the season there is a huge chance you may not be able to unlock it all. Which is why I remain FTP. \n\nIts fun as a little chill game and the community is still kicking even after 6 or so years after its release. Its free, play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sky is a poetic masterpiece that combines unparalleled visual beauty with a clever social interaction mechanic.\n\nThis is a game fundamentally about connection. The graceful freedom of flight and the deeply moving score create an incredible, meditative experience. Yet, its true strength lies in how we share this journey. Interacting, helping, and exchanging light with other players—often without a single word—feels incredibly heartwarming and authentic.\n\nIf you are looking for a peaceful, touching experience and want to feel the warmth of humanity rarely found in other multiplayer games, Sky: Children of the Light is a digital sanctuary you absolutely must visit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the most fun you'll have when you just started playing or new to this game. can be confusing at start or maybe addictive at first but that's the fun part. would recommend this for sure it's definitely one of kind experience everyone should have. play it for yourself and enjoy however you like!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive played this game since first release way back on Iphone only and can say without a doubt its one I always find myself coming back to, I played originally for a year almost daily on mobile before I took a long break just to realize its been released on steam and switch! I started playing again a few months ago and its just as beautiful and now even bigger with how much its expanded over the years.\nThis game is visually stunning, fun to play both with friends and by yourself, and has SO much customization I find myself willingly spending hours just to save for events that come by. Absolutely recommend this game to anyone looking for something calm and relaxing that you can enjoy with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very comfy, a little buggy but it's really enjoyable and really easy for me to not keep track of my time. Also, was that a relaxing yoga feature? very kind for my character after collecting candles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful art style. \r\n\r\nBut content is lacking. Nothing else to do just collect candles. There is socializing, but most people just go collect candles, so its hard to find someone to talk to. Half of the time or most servers feel empty.\r\n\r\nStill i recommend it play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game for years now (on both Switch and Steam) and it's charming and gentle world has captured me. Sometimes it is a little bit of a grind to run for candles, but just remember to take it at your own pace. If you need a break, take a break. However, Sky is a wonderful, peaceful escape from everyday stress. TGC keeps things fresh with new seasons, seasonal events, daily quests, and travelling spirits so it's always a delight to log on each day to see what's new.\r\n\r\nIt's free, so there's no harm in checking it out if you need a game to let you destress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so cozy and fun to play! Absolutely recomend for people looking for a chill game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nostalgic upgrade from Journey. The colours, music and atmosphere is very relaxing and beautiful!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a GORGEOUS visual style and a lovely story, but saying this as someone who has poured over 60 hours on pc and mobile, once you finish the first play through it quickly becomes monotonous and tedious. The grind for candles is incredibly slow, yet so many cosmetics are either very expensive or locked behind in app purchases, and many don’t even return for years..\n\nFor a social game, it’s odd that you have to spend ALOT of candles just to chat with other players which kind of defeats the whole purpose for me. The game also has lots of glitches and server issues FREQUENTLY.\n\nOverall, it’s a charming game at first, but the core mechanics and monetisation make it hard to enjoy long-term. It's not everyday I want to spend a soul sucking 2 hours for a mere 20 candles..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sky is a stunning social adventure about exploration and moral value.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun and nice community as well as a game that you can return to after a work day or school day. Only things i would change is the fact of how quick the game is and the fact that you need a friend for some things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really cute and all but it gets boring really fast as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game if your focus is to chill and socialize with other players..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Magical experience, I always come back for my candles and the kindness of every player I meet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good and chill game. Best played with a friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not really a game review, more of a port review.\n\nWhile the steam early access port works just fine, most of the time I'll just play it on my phone - as it's intended design. The steam version doesn't have all too many game breaking bugs but it's not uncommon that you'll encounter issues in the gui such as in your friends list (or 'constelation') having some friends just out of reach in the screen. The core quests, clothing and gameplay loop remains exactly how you'd expect it to (if you're used to the mobile version of the game). Overall not a bad steam port, but keep in mind that it is not the platform that the developers are most focused on (though they regularly post patches and hotfixes for all devices).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play the story, stay with friends but don't burn yourself out. The grind is there is you want everything but not necessary to enjoy the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s a lovely game to enjoy with friends or someone special. It can get a bit repetitive at times, but the music instruments make it totally worth it!\nI could spend hours just playing those.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very relaxing game (aside from eden), the people are pretty nice too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The initial experience of this game is defined by its commitment to beautifully executed non-verbal communication. Early on, observing the black silhouettes moving across the world—which are, in fact, other players—is a powerful realization. This interaction, facilitated purely through movement and simple emotes, strips away complexity and fosters a sense of profound, unadulterated connection. This fundamental design choice encourages a unique form of social bonding, echoing simple, genuine human interaction often overlooked in digital spaces. It highlights the power of observation and shared experience over explicit dialogue.\n\nThe accessibility of the experience is one of its strengths. New players can engage with it as a contained narrative, spending just a few hours. Completing the \"main storyline\" is highly recommended, as the final sequence stands as one of the most aesthetically and emotionally impactful moments in modern gaming. For those seeking depth, the game offers hundreds of hours of exploration. The environment richly narrates the lore, and the core gameplay loop provides a deeply comforting and consistently engaging experience, inviting prolonged immersion.\n\nA necessary comment on the economy: while the game is not pay-to-win—as there are no competitive goals—the acquisition of most unique, desirable cosmetics (especially seasonal items) for free-to-play players presents a significant, demanding grind. This requires a high degree of patience and commitment and can lead to frustration if the objective is unlocking every item. Players are advised to define their own progression goals to avoid burnout. Despite this demanding monetization structure, the game's performance is excellent and highly optimized. Furthermore, the developer's disposition and efficiency in handling support tickets are genuinely commendable and reliable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even with the limited playing time I' ve had so far, I can say that the feeling this game will give me, will be as immersive and memorable as Journey which I played years ago on the Playstation 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game can be very frustrating when it comes to server side issues.\n\n\nHowever looking past that, this game will restore your faith in humanity, and if anything like me, make you cry several times by how beautiful the people and game can be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I’ve ever played. I’ve been playing it for years and I don’t regret it at all. I really liked that they finally added a PC version. The community is still active and overall the vibe is pretty good. It’s a fun game to play both alone and with others. If you’re looking for something chill to relax, disconnect, or spend time with friends, this is the perfect game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's been one of my first steam games and it takes a while to get bored of it. i might not play it as often anymore, but it's nice to log in every once in a while and sit somewhere beautiful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am so glad this game is on pc, and I now prefer to play on steam than my switch and phone. Graphics are so much smoother and I don't have to worry about overheating my phone/ switch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mind relaxing and well made game with cute gameplay mechanics this is best experience to calm yourselves(be ware of the bugs)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great relaxing game to grind out cute cosmetics. Or else pay for them if they are in the shop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a cozy and relaxing game, but the most memorable moments are made when you're with a group of friends chatting and laughing while doing dailies :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a sweet game, full of pretty sceneries. Been playing for 3 years now. But TGC go easy on the prices of IAPs plz",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After you reach end game, which is after you've finished finding all the spirits, and the many area quests. It just becomes a grinding game if you aren't really into the social aspect, and even then the game is very buggy. I do love this game as I have been playing way before it came out for PC and switch, but there are also many things about the game for long time players that really put me off.\n\nThe visuals are stunning, and the soundtrack is also very good. Making friends in this game is also a very nice aspect to keep people playing the game, as well as grinding for cosmetics. Although this doesn't pertain specifically to the game, the treatment of newer players because of their lack of cosmetics and the lack of regard for the team working aspect (helping players open areas) of this game puts me off as well.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "on the surface, it's sweet and good and is intended to be really calming. it has a nice soundtrack and the graphics are pretty. sadly, it goes downhill from there - the majority of content revolves around FOMO about exclusive cosmetics for real money, the majority of which never return or do not return for potentially years on end.\r\n\r\nit wont run well on lower end devices - my laptop really struggles at certain points with loading, severe stuttering, and even overheating (bearing in mind my laptop can typically run big name games easily on the highest graphics settings).\r\n\r\ntrying to play with specific people REALLY does not work well - i played with my partner for the majority of the time and we were constantly getting kicked away from each other/unable to join each other for unknown reasons. the amount of leaving and joining we had to do to fix it was ridiculous and got very frustrating at points.\r\n\r\nthe gameplay loop is entirely fundamentally based in repetition and doing the same thing over and over daily - after youve completed the main questline (and even during) it really is just running the same route over and over to get candles which are again just for cosmetics. additionally some of the quests from certain seasons are almost not possible to complete nowadays because they require multiple people and there simply are not enough people trying to run the quests anymore so you end up waiting hours for people to join.\r\n\r\ntldr: if youre not into it already i wouldnt really recommend getting into it or doing much more than maybe running through the game once and then not touching it again - it's very pretty and soothing on the surface but the seasons and blatant money grabbing are exhausting and im sure there are other games that are also pretty and soothing without the constant undertones of \"give us money! give us money NOW!!! pleeaaasee we want ur money soooo bad give us ur money or youll miss out 😈\"",
      "voted_up": false,
      "votes_helpful": 137
    },
    {
      "review": "I'm still playing this game but there's really nothing to do except grinding to get the limited timed items.\n\nAt the beginning it's great, you explore, discover new places, routes, but once you saw every zone (which takes maybe 20h? maybe less, unsure) there's nothing much to do.\nThe game is beautiful, and so is the music. The ambience is great but it's FOMO the game. \nThere's constant timed events with a season pass for each of them. And the grinding consists of going and collecting things in different places. And that's it, that's all there is to do.\nThere's \"quests\" and all but the gameplay doesn't change (it's just fetch quests or bring spirit here).\nThere's a lore I guess but personally it didn't manage to interest me.\n(Also there's too many cutscenes at times, it's cool the first time you see them but becomes annoying by the 15th time)\n\nFeels like it could be something great if it wasn't so greedy and the only thing the team seems to add to the game is making the grinding longer and more tedious.\nI'm still playing but only from time to time, just to see what's new, do a bit of the current event, get bored, and leave for months.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I love this game. I truly do. I've met some absolutely lovely people in here, had tons of fun, it's been great.\n\nHowever, I cannot recommend a game with bad customer service, highly predatory microtransactions, poor gameplay incentives, bad social features... I could go on for days. \n\nDon't even get me started on how many times my friends have been muted over and over and over due to \"misunderstanding the context of a message\". If you want to moderate your game by disallowing people from speaking hardly at all, then please do so in a way that is NOT destroying people's relationships. This is blatantly unacceptable and I CANNOT recommend a game that does all of these things. It disgusts me. I'd love to hope the team agrees with me and simply can't do anything about it. But  regardless, this is the reality we live. I will continue to play this game but I will NEVER recommend it to someone. It's FAR too predatory, I've seen it happen way too many times, and it even works on me.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game has a *fantastic* atmosphere. I love the vision and goal. The call backs to earlier ThatGameCompany games are great (mainly Journey) and remind me of good memories from when I was younger, however I feel like this game needs some more time to cook before I can say it's a good experience and actually recommend it.\n\nHere are my reasons (as of 2025/11/05):\nIt feels like it's got a lot of the content it intends to include in the final version, which is good, but it just doesn't have that certain polish. I get that it's early access, but the immersion is broken almost every minute. \nHere is a list:\nanimations are jittery/un-immersive at times (objects in wrong positions, weird physics joint angles, and excessive clipping. I get that animation is hard, and I'm not saying they didn't put effort in. I see the love that is put in, but I wouldn't be honest if I said that I can ignore them. Their just too disconnected and messy.\nThe camera movement/controls are quite slippy in much the same way Journey's (another game by ThatGameCompany) camera controls feel on mouse. It's probably better on touch screen or with controller, but since this is a pc version I feel it's reasonable to expect decent camera control.\ntoo many cut scenes/slow cut scenes/long cut scenes.\nThe graphics are... jarring. Not the style. The style is fantastic, but without anti-aliasing a lot of stuff just doesn't work (looking at you line art on walls), and the low LOD distance is harsh in the opening scene. I get that it was originally for mobile, and if we were on a small mobile screen with limited compute these decisions would make sense, but we are on a pc now with plenty of power and a much larger screen. Not having these types of things really detracts from what is attempted here and it's hard to look past them when they are everywhere.\n\nIf this was ported to pc a few months ago I would understand most of these. Getting an engine to run on two separate devices is a nightmare all on it's own. But it's been on steam for over a year now, I see no reason most of these aren't already addressed.\n\nMost of these things are easy wins. If they get implemented I would happily return and continue playing, but as it stands right now these things break the immersion too much for me to really enjoy what is intended.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is geared toward kids yet full of FOMO. Some paid cosmetics are more pricy than a full game. Game is buggy and glitching every other day, and the devs refuse to listen to beta players and the player base about glitches. As been in early access for YEARS, favoring seasons and season passes over completing the game.\nThe game was way better 4 years ago.\nFix your damn game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Microtransaction filled grind fest don't waste your time. The developers will do the bare minimum and charge you $25 for it and not fix game breaking bugs for years. Every update is made to make the grind worse and to force you into buying their in game currency. The lack of polish would be intolerable if it was any other game but the fanbase is too kind to ever complain about it. Incredibly predatory FOMO game and the only people left playing are children and those trapped by the sunk cost fallacy.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a decent game. Fun to hang out with friends, and dress up. But I cannot in good conscience recommend this game to anyone. There are so many problems, that I and others I know, experience regularly:\nThe customer support is practically nonexistent. If you have a problem, you would have better luck googling it, than hoping the support team ever gets back to you.\nYou can get muted for the dumbest of things. I got muted for an hour for claiming gods can't get cancer. My friend got muted for talking about cutting their hair.\nFor a social game, the social aspects are severely lacking. Making friends is difficult, as most shadows seem more interested in the friendships they already have. Once you get friends, it is difficult to hang out with them when the servers are constantly shuffling players around like a bizarre cup game.\nConstant errors and bugs that the company seems loathe to fix, no matter how much it may inconvenience the player. However, if something were to be bugged with the shop, or players getting more wax/candles than they should, or anything else that could perceivably cost the company even a single dollar, then it gets fixed in an hour or less.\nThe cost of cosmetics is egregious at best, and they are constantly cycling events to better sell more cosmetics to players with at least a little cash on hand.\nAs I said, it's a decent game, and I do enjoy hanging out with the friends I've made on there. But every decision by TGC just feels like a slap in the face to the players. It feels cruel, it feels like bullying. It feels like getting your lunch money stolen in school, but the thief leaves you with a pretty bow and expects that to make up for it. So no, I do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Far too many microtransactions with absurd prices for a game that demands that you wait 2 weeks after you buy a season pass until you can do all of the quests within to get your items. Combine that with buggy controls and buggy camera with stiff controls that fight you ever step of the way. 4/10 needs a lot more care and adjustments to fix the weird problems like repeat cutsccenes for quests that can't be skipped.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "it is pretty repetitive. at first it was very fun but at some point it just felt like a choir and I lost the joy and whimsy that I use to feel.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it's more fun to draw art for this game than to actually play it, I wish this game was more like it was in 2021. also don't take your friendships on there outside of the game I promise it's not gonna end well 💀",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sky, Removed Message of the Day. With that stole my happiness >:((( \nRETURN BACK MESSAGE OF THE DAY!!!!!!\nreturn it back plsssssssssss ;-;",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sorry, i think i get the \"artsy\" idea of the game and the graphics, and sposed \"friend/community\" play thingy... ...but to me personally this is just bad (and seems to drain resources on my pc?). I get annoyed more then anything else. Since u can test it for free you can try it and see what u think.\r\nBut i just cant stand it...\r\nIt is a functioning \"game\" so i have to give it a 2/5.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is fun at first-- the visuals are adorable and endearing, the sounds are beautiful and add to the atmosphere, and it genuinely seems like a good game... Until you actually get past the tutorial and play for the first time.\r\n\r\nFirst off, the flight mechanics are extremely janky and finiky, and tend to send you the exact opposite direction you intend to go. It takes some time to half-master it, and even after that it still bugs out on you.\r\n\r\nSecond, the demand for multiplayer. I myself don't have a lot of friends who play video games, so I usually play games alone. The fact that in order to have a chance to get a cosmetic (I'll talk about that situation next) I have to have 2-8 people is outrageous. Maybe it sounded like a good concept, but it's genuinely so annoying because there are hardly enough people to make collecting all of the souls possible without spending immense time just waiting.\r\n\r\nThird, the god awful way the cosmetics system is set up. What do you mean I have to not only jump through hoops to get the soul for the cosmetic, then I have to spend candles (the main currency) in order to increase the friendship tree, then after that I get to find out that the hair I want costs 48 candles. Then they shove it into your face that \"well, if you don't have enough, just buy some!\" Yeah right. I'm not spending real money on a game like this that wastes its potential.\r\n\r\nFourth, the Eye of Eden segment. Lord, how they need to work on this. It's the most unfinished part of the game. If you make the accident of moving slightly and clipping a small edge, you get flung up by the wind and slammed by a rock. Not to mention, the barriers meant to protect you from getting hit don't work. You can get hit from behind the barriers if you're unlucky, then get knocked straight down... And then you can't get up... And then you get hit again... And you can't get up. If you are unlucky and hit in a downpour of rocks, you end up stunlocked and your light gets eaten up... then you die. But wait, you get to experience the whole end segment over and over and over every time you subject yourself to the Eye of Eden torture, and you get to wait a good twenty minutes until you get a few special little candles! Like, you couldn't even let us skip that after quite literally beating us? Okay.\r\n\r\nFifth, the skip cutscene option is a lie. You can't skip them. They are all gonna happen over and over and you can't do anything about it.\r\nTotally not because they're trying to increase your playtime... Right? Right?\r\n\r\n\r\nTLDR: Pay-to-even-slightly-enjoy game with unfinished mechanics. Don't bother investing time like I made the mistake doing-- this game shouldn't be released yet even with the Early Access title, because it is very obviously not close to finished.\r\nGames like Outlast Trials (who are made by an indie company, mind you) have released in much better quality in Early Access and don't fail to appease their fanbase as much as this game has. Not only is the dev team of Sky unwelcoming and refuse to listen, but they make almost everything locked behind a paywall. So unfortunate.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is cute. A nice idea with co-operative puzzles and a really nice community (a genuinely redeeming feature) BUT, and I can't stress this enough, it is so bland, SO poorly optimized, basic and boring.\nDecidedly not for me, though my younger siblings are enjoying the stress-free nature of the early game so far. I, however, am doing most of the actual quest-work, which fails to meet my standards of gameplay.\nIF this EVER comes out of Early access, which I doubt it will, it's not worth a gold piece in it's current state",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "More cutscenes than gameplay, absolutely tiring stuff. Only boring, no soaring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They were right when they said the music was half the game, the other half is un-skippable cutscenes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Could be fun if the friends list worked and if it wasn't just cutscenes. They just need to make it more accessible because the friends UI is really bad. Also add something besides cutscenes and flying with birds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "endless death, endless grind, repeated events and seasonal events where some shit cost money where the only way to get hearts in the dam game is to make fucking accounts cause no one wants to add random people to spare candles you can earn in game yet people add people for no fucking reason yet some just don't want to add you cause they want to be greedy mother fuckers with there candles",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not even the IRS is this greedy when it comes to cosmetics and rewards",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "its free so i cant complain, but it felt a bit boring sometimes, some rooms required 2 people to open and no one was around to open them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only reason why i play this is because seasonal depression is getting to me and i like to dissociate while playing a seemingly cosy game that just wants to grab your money.\r\nstill havent paid a single cent staying strong kids",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cutscene simulator.\nI start the game and float around, seems nice, good visuals.\nAfter about five minutes of being in a huge cloud It gets boring.\nHowever once an npc takes my hand and follows me around like a lost child I start feeling my testosterone dropping, after the 20th cutscene where it spawns in yet another but bigger npc to ask things of me with gestures I can't help but altf4 sorry.\n\nI tried playing again after some deliberation and thought of maybe this game is an MMO so it's social with text or voice chat, But I THINK I got to find a single other player but i'm not so sure, either way after reviews it seems game's kinda cringe tbh.\n\nIf there's voice chat to meet the girls and upset them with my foul mouth i'm down to play but idk, I'm out.\nAfter reading a dudes review of \"Unban me\" is what made me run it up for round two to see if I could mess around, got bored again though.\nAlso, game's buggy somehow lmfao. Visual screen tearing and blackout issues upon pressing the Enter key and writing to chat? Glitching into walls and collision kinda odd, Not like it matters.\n\nVisuals are great but upon the first 10 septoseconds of viewing the artwork on the steam store page yep it's \"Journey\" alright, nothing bad about that one seems precious, But if it's an MMO I 100% know it's geared to \"nostalgia\" filled 25-30y lgbtq escapism enjoyers.\n\nI'm reviewing as negative because I cannot spam the ESC key to leave the THIRTY SECOND cutscenes every ten seconds.\n\nIf anybody actually plays this game please tell me if it has voice chat and how to get to other real individuals, I wish to cause some chaos. Thanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not sure how to get multiplayer to work. But it’s just one of those environmental games. Barely a game yeah.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "everything is p2w and getting candles alone is such a hassle, i hate That Money Company. ignore my 90+ hours.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "S**t game community, mental problem kids everywhere.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i am not the the person for this game\nif you like chill game idk i played 19 minutes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played it a bit and it just feels low quality all over the place.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is literally unplayable if there isn't anyone guiding you",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "sky: friendship of the gay triangles",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WAY tooo many cut scenes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "gooner game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unban me",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "greedy",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "add tap strafng",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game wants your money. And if it can't have that, it'll gladly take your time.\n\nFor those that are familiar with That Game Company (TGC) and their original creation, Journey, Sky Children of the Light ironically betrays that games core value's in favor of commercial pursuit. Whereas Journey prioritized a contemplative experience of traveling at your own pace and enjoying the world around you, Sky immediately drops new players into the neverending rat race, your existence becoming a relentless grind that's driven by the fear of falling behind. \n\nIn 2022, one of the creators  had criticized IAPs (in app purchases) for preying on negative emotions, stating that \"...they appeal to our greed or fear of missing out...\" And while I did not play during the time of this interview to verify the integrity of such a statement, the departure from it now in 2025 is laughable. It still wears the deceptively ethereal aesthetic that was also present in Journey, but it holds none of its sincerity. \n\nWhile new players are free to roam at their own pace, this game is essentially an open world chatbox that encourages meeting and helping new people. Befriending others isn't free, however. That will cost you your in-game resources. And if you'd like the ability to talk to someone, that will cost you even more. These resources are the crux of the issue with this game, as not only is the amount you are able to collect capped out daily, they are also needed to purchase the other (and in my opinion, main) driving force of this game, cosmetics. \n\nIf you play for any amount of time in this game you will notice the cosmetics. Whether from other players, seasonal events, traveling spirits, or IAPs, the game is constantly showcasing  what's available. They will make it known to you how much time is left on certain events, what's available, and of course, they will lock the best looking cosmetics to IAPs. In no time, you'll find yourself planning months in advance for seasonal events, release cycles for potential returning cosmetics and rationing your resources so that you don't miss out on something you really want. The events are constantly following each other immediately after one ends, so there is little to no time to recuperate your losses when another one comes bounding up that trail.\n\nBut what does that leave you with? The desire to share is accompanied by caution and frugality. There is no longer time to connect, no time to chat, and for a game that is supposedly built around making connections, generosity becomes a luxury. \n\nAn average spirit's cosmetics costs about 140 candles, the game's primary resource. The daily cap for earning candles is 20, which if you like to play less hyper-optimized like me, you can earn with about 2 hours of playtime. This meaning you'd have to play for a minimum of 14 hours if you wanted to buy all of this spirit's items. That does NOT INCLUDE the time it takes to establish a routine in which you learn to gather all of said candles. Now you  may not necessarily want all of a spirit's items, but in a worst case scenario I had a spirit where I bought out most everything of for 200 candles. Which is 20 hours of my time. Sometimes singular items cost 140 candles. There's one in game right now for 120. That's 12 hours split across 6 days of your time, for one, singular item. For the majority of the time I played this game, I was unemployed which is how I was able to make this feasible. But for anyone with school, work, or a busy home life, how is this sustainable? Only now after 9 months of unbroken playtime do I feel comfortable because the next spirit isn't going to break my candle bank. If this all sounds tiring to you though, you can always use your real life dollars to buy more candles!\n\nWhen you are not actively grinding, the game will find other ways to waste your time. There's long, unskippable cutscenes such as one door animation that takes a staggering 50 seconds, camera pulls that another player activated that lasts 10 seconds, flights between areas. These scenes or moments aren't especially interesting either and you'll likely be experiencing them daily. The repetitive delays are constant.\n\nTo combat the time it takes to go from area to area whilst collecting candles, certain community efforts were made to help ease the grind. And every time the community has banded together to support one another, TCG has made their best efforts to shut it down. One method beloved by everyone allowed players to afk for a measly 10 minutes whilst you could simultaneously passively gather candles. It was a small mercy amongst the daily repetitive grind. TCG made sure to nip that in the bud. Another allowed you to cut 3-5 minutes of travel time between areas at a time. Since no fast travel methods exist, this was a lifesaver within a game that has constant long, uninteresting stretches of travel. TCG made sure to do away with that as well, not just once but several times! As it was harmless, what is the purpose for this other than to enforce some arbitrary rule they've created? TCG allows other unintended uses of traversal, such as chibi falling, so do they not realize their own hypocrisy? To me, the intention is clear. They want their players tired. They want fatigue, they want you burnt out from grinding, because when you are tired, you're more likely to buy. And that is the issue of it all really. This is not a game about connection. It doesn't encourage positive emotions like it claims, but preys on your burnout whilst the kind, patient players who continue to uplift each other in a system designed to wear them down carry its name.",
      "voted_up": false,
      "votes_helpful": 235
    },
    {
      "review": "Some reviews say to play it once, and never again. I personally wouldn't recommend you play it at all, if only for the fact that adding to the player count will give TGC a continued incentive to keep doing what they're currently doing, and have apparently [i] been [/i] doing way before I've joined.\n\nIt does genuinely hurt me to say this, too. At the core of the experience, it's a lighthearted and absolutely [i] gorgeous [/i] experience to go through. Flying feels absolutely phenomenal in Sky, and it's home to probably one of the most unique social systems I've ever seen in a game. Going from faceless strangers unable to communicate past gestures, all the way up to full-fledged friendships with unrestricted communication is honestly one of the most heartwarming experiences I could ever ask for. I do, with all my heart, love this game, even for what little I've played of it.\n\nBut the fact is that under the surface, past your first playthrough, that facade of a pristine utopian world, where everyone's happy and nothing goes wrong, quickly diminishes away once you realize that the game is so hyper-focused on draining your wallet on overpriced cosmetics, battle passes, FOMO, and even it's own core systems. It's a game that, despite it's charm, will always have one hand in your pocket while it regales you with it's bright, sunny atmosphere, and friendly playerbase.\n\nCandles are Sky's main currency, and already it's being torn in two by being the both the money you use to buy cosmetics to express yourself, and also the currency you use to make and develop friendships. With your candle grind being hard-capped at a measly 20 candles a day, assuming you do a *full candle run* without burning out midway through, (With [i] single cosmetics [/i] costing up to 100+ candles each????) that means that you are stuck with the ultimatum of \"Ignoring the grind, and focusing on making friends\" or \"Saving up your money to slowly chip away at that cape you want\". [b] It's a system that cannibalizes itself in order to coerce you into buying candle packs. [/b]\n\nDoing one will dip into the progress of another. Making friends and unlocking unrestricted chat between them will make your cosmetic grind even harder, on a game that's already being so heavily bogged down by its insane grind.\n\nThey are selling candle packs for actual money. There is a tangible value to these candles. [b] Friendships, in this social game, cost money. [/b] You can't even so much as [b] hug [/b] or even [b] chat [/b] outside of designated chatting areas, without it being tied to it's main form of monetization. You either make friends, become antisocial with other players for weeks on end in an attempt to save up candles, or fork up money in a vain attempt to have both.\n\nThis is depressing beyond belief. If someone like EA, Ubisoft, or any big corporation pulled this type of thing in one of their games there would be public outcry about it, and it blows my mind that the community is being so soft with TGC about this. I don't care if they're a \"Small indie company\" who \"Needs to keep the lights on\", this level of greed should be condemned. Not encouraged, not hand-waved away. It's a bad look for everyone involved, and has actively pushed me away from ever spending money on this game.\n\nThis type of monetization affects already paying players too. The price of candles is so clearly inflated, that you'll fork up an arm and a leg just to get even a fucking haircut. Since there's no regional pricing either, sometimes that outfit you want can cost an entire weeks worth of groceries. New players are already slaving away trying to get base game stuff, much less some of the cosmetics from the traveling spirits or events, and old players are having the value of candles diminishing after every event.\n\nIt doesn't help that even the main loop of going through \"Friendship trees\" with the spirits can have you doing memories that are either not challenging enough to be engaging, or too frustrating to be relaxing. You play tag with still holograms and escort purple lights at a snail's pace, only to watch a buggy cutscene drag it's feet across the floor, and for what? So you can reach the top of the tree, only to have the so-called \"privilege\" to pay for a [b] 190 CANDLE SHIRT? [/b]\n\nDon't even bother. Save yourself the heartbreak, Sky is nothing more than a PC port of a mobile game designed to prey on your relationships with others. It doesn't deserve to have the community that it has right now.\n\n\n[b] - Edit - [/b]\nI should probably address the complaints in the comments saying that you're not forced to buy cosmetics, or that they're simply \"Optional\". From an objective standpoint, yeah, TGC doesn't actively paywall the player or *force* them to purchase cosmetics. I still don't think simply saying that \"It's optional!\" is a good enough reason to simply let things stay the way they are.\n\nPart of the reason I'm so harsh on the monetization is because, as it stands, the game is pretty anorexic in terms of gameplay. It's clear that the game's main focus is on socializing and storytelling, but Sky is so incredibly thin on things for players to actually *do* together. There's maybe two races in the game, (One flying, one sliding) a handful of doors that require multiple people, and only a couple of multiplayer-focused side activities that players *have to go out of their way* to find. (Or even use candles to buy, like the soccer minigames found occasionally on the map, which alleviates the issue about as well as pouring salt on an open wound.)\n\nThere's hardly any challenges that require cooperation, no stories that involve you and another player, and candle runs seem to be the only thing that consistently has players bunching up together and doing. It feels like cosmetic grinds is *all* you can do, and the game reinforces that mindset, since sitting down and going through memories will only reward you with a gesture at best, (Your main form of communicating to strangers anyways.) and at worse, the ability to purchase cosmetics after doing a grind (Candle runs) that's completely separate from the main form of content: Memories.\n\nAnd self-expression is *a core part* of the social experience. The social aspect is, what I believe, one of Sky's strongest features, and part of what makes me love the game, so it frustrates me to see that the simple act of *making friends* has to get in the way of such a vital part of the experience, just so it can push people into dropping money on clothing that is WAY overpriced for what you get. \n\nSo even though the cosmetics are \"Optional\", the pricing, the hard cap on candles, the lack of \nmeaningful content, the split between socialization and the grind, it all severely hurts the game, and pushes away people who'd otherwise be willing to buy in for some of the cooler outfits-- or even just to support the devs, who have clearly worked hard on making Sky as beautiful as it is. But as it stands right now, Sky's monetization is incredibly predatory, and I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 108
    },
    {
      "review": "on the surface, it's sweet and good and is intended to be really calming. it has a nice soundtrack and the graphics are pretty. sadly, it goes downhill from there - the majority of content revolves around FOMO about exclusive cosmetics for real money, the majority of which never return or do not return for potentially years on end.\r\n\r\nit wont run well on lower end devices - my laptop really struggles at certain points with loading, severe stuttering, and even overheating (bearing in mind my laptop can typically run big name games easily on the highest graphics settings).\r\n\r\ntrying to play with specific people REALLY does not work well - i played with my partner for the majority of the time and we were constantly getting kicked away from each other/unable to join each other for unknown reasons. the amount of leaving and joining we had to do to fix it was ridiculous and got very frustrating at points.\r\n\r\nthe gameplay loop is entirely fundamentally based in repetition and doing the same thing over and over daily - after youve completed the main questline (and even during) it really is just running the same route over and over to get candles which are again just for cosmetics. additionally some of the quests from certain seasons are almost not possible to complete nowadays because they require multiple people and there simply are not enough people trying to run the quests anymore so you end up waiting hours for people to join.\r\n\r\ntldr: if youre not into it already i wouldnt really recommend getting into it or doing much more than maybe running through the game once and then not touching it again - it's very pretty and soothing on the surface but the seasons and blatant money grabbing are exhausting and im sure there are other games that are also pretty and soothing without the constant undertones of \"give us money! give us money NOW!!! pleeaaasee we want ur money soooo bad give us ur money or youll miss out 😈\"",
      "voted_up": false,
      "votes_helpful": 137
    },
    {
      "review": "I'm still playing this game but there's really nothing to do except grinding to get the limited timed items.\n\nAt the beginning it's great, you explore, discover new places, routes, but once you saw every zone (which takes maybe 20h? maybe less, unsure) there's nothing much to do.\nThe game is beautiful, and so is the music. The ambience is great but it's FOMO the game. \nThere's constant timed events with a season pass for each of them. And the grinding consists of going and collecting things in different places. And that's it, that's all there is to do.\nThere's \"quests\" and all but the gameplay doesn't change (it's just fetch quests or bring spirit here).\nThere's a lore I guess but personally it didn't manage to interest me.\n(Also there's too many cutscenes at times, it's cool the first time you see them but becomes annoying by the 15th time)\n\nFeels like it could be something great if it wasn't so greedy and the only thing the team seems to add to the game is making the grinding longer and more tedious.\nI'm still playing but only from time to time, just to see what's new, do a bit of the current event, get bored, and leave for months.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I have tried this game when it was released. So I wanted to play it again on pc. Althought it was an interesting experience I realized how horrible they are in terms of progress. It has been 5 years that this game has been released and there is no progress in terms of main story. It is just a loop. You learn lore of the game from event stories. Events are good but the game is grindy as hell. Everybody mustn't invest that amount of time in a game like this.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "I cannot recommend this game in good faith. It's kind of like going to an art museum. Everything is very fun to look at, and the first time going through is a wonderful experience, but there's not much else to do but talk to your friends and go to the overpriced gift shop when you're done.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "i love this game, really i do. i have thousands of hours, the 200 here is just on my pc. i've played sky for 5 years now, starting june 2020, and at first, yeah it was a lovely game, and on the surface, it still is. the problem is deep in the company itself, beginning with the ceo. tgc keeps pumping out in-app purchases like they're candy, and expecting everyone to spend 20 dollars or more for one outfit. on top of the horrid pricing of in-game items, tgc rarely listens to player feedback. it's not just me either, ask anyone who's given tgc plenty of feedback and they'll tell you the same thing i am, they don't listen.\n\nevery update introduces tens of new bugs within the game and there's been some bugs that aren't fixed for months or even years. their priority is not the playerbase, their priority is making money. it had such humble beginnings, a small game studio making a game about friendship and comfort. but as the years went by, everything went downhill. the game got more buggy, the playerbase was continuously pressured more and more to just grind grind grind grind for candles and other in-game currencies. they make \"quality of life\" updates acting like it'll fix the problem they're causing in the first place, but it doesn't.\n\nin the end, what sky has become is a grinding simulator. want dye? grind. want candles and cosmetics? grind. want even cooler cosmetics? better start digging into your wallet because if you want even one pair of pants or a single cape, it's $10 or more. don't even get me started on different currencies, iaps are even more expensive for other currencies. the playerbase has been begging tgc to fix these issues for years now and as i said before, they. don't. listen.\n\nif you want my advice, don't even get started in the game. sure, you could play through the story once, but the more players that download this game and play it, the more incentive tgc will have to continue what they've been doing. i've even stopped recommending it to friends or saying i play it because i don't want more people to become stuck in this cycle of endless grinding. it's not worth it. there's no other game out there that's exactly like sky, and that makes it hard for me to leave, but i have decided to quit spending money, it's not worth supporting the actions of the tgc. \n\nit hurts me to say these things. i wish i didn't need to, but at the rate tgc's going, it's only gonna get worse unless someone or something can convince them otherwise or they get a new ceo. this game holds a very very special place in my heart, it's become a huge part of my life, a part of me. but i won't sugarcoat all the issues and drag more people into the grind and all of the issues the game and the company has. i can't.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I love this game. I truly do. I've met some absolutely lovely people in here, had tons of fun, it's been great.\n\nHowever, I cannot recommend a game with bad customer service, highly predatory microtransactions, poor gameplay incentives, bad social features... I could go on for days. \n\nDon't even get me started on how many times my friends have been muted over and over and over due to \"misunderstanding the context of a message\". If you want to moderate your game by disallowing people from speaking hardly at all, then please do so in a way that is NOT destroying people's relationships. This is blatantly unacceptable and I CANNOT recommend a game that does all of these things. It disgusts me. I'd love to hope the team agrees with me and simply can't do anything about it. But  regardless, this is the reality we live. I will continue to play this game but I will NEVER recommend it to someone. It's FAR too predatory, I've seen it happen way too many times, and it even works on me.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game has a *fantastic* atmosphere. I love the vision and goal. The call backs to earlier ThatGameCompany games are great (mainly Journey) and remind me of good memories from when I was younger, however I feel like this game needs some more time to cook before I can say it's a good experience and actually recommend it.\n\nHere are my reasons (as of 2025/11/05):\nIt feels like it's got a lot of the content it intends to include in the final version, which is good, but it just doesn't have that certain polish. I get that it's early access, but the immersion is broken almost every minute. \nHere is a list:\nanimations are jittery/un-immersive at times (objects in wrong positions, weird physics joint angles, and excessive clipping. I get that animation is hard, and I'm not saying they didn't put effort in. I see the love that is put in, but I wouldn't be honest if I said that I can ignore them. Their just too disconnected and messy.\nThe camera movement/controls are quite slippy in much the same way Journey's (another game by ThatGameCompany) camera controls feel on mouse. It's probably better on touch screen or with controller, but since this is a pc version I feel it's reasonable to expect decent camera control.\ntoo many cut scenes/slow cut scenes/long cut scenes.\nThe graphics are... jarring. Not the style. The style is fantastic, but without anti-aliasing a lot of stuff just doesn't work (looking at you line art on walls), and the low LOD distance is harsh in the opening scene. I get that it was originally for mobile, and if we were on a small mobile screen with limited compute these decisions would make sense, but we are on a pc now with plenty of power and a much larger screen. Not having these types of things really detracts from what is attempted here and it's hard to look past them when they are everywhere.\n\nIf this was ported to pc a few months ago I would understand most of these. Getting an engine to run on two separate devices is a nightmare all on it's own. But it's been on steam for over a year now, I see no reason most of these aren't already addressed.\n\nMost of these things are easy wins. If they get implemented I would happily return and continue playing, but as it stands right now these things break the immersion too much for me to really enjoy what is intended.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is geared toward kids yet full of FOMO. Some paid cosmetics are more pricy than a full game. Game is buggy and glitching every other day, and the devs refuse to listen to beta players and the player base about glitches. As been in early access for YEARS, favoring seasons and season passes over completing the game.\nThe game was way better 4 years ago.\nFix your damn game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Sky: Children of the Light is one of the most visually stunning and emotionally moving games I’ve played. The art direction, music, and atmosphere capture the spirit of Journey beautifully. And, honestly, the only saving grace of the game is the social aspect—meeting strangers, helping each other, and building friendships in such a quiet, magical world. That feeling is unmatched.\r\n\r\nUnfortunately, everything else drags the experience down:\r\n\r\nThe grind is unbearable. Candle running quickly stops being whimsical and turns into a daily chore. Progression is locked behind repetitive farming rather than meaningful play.\r\n\r\nThe game advertises itself as non-competitive, yet players are punished harshly for anything that even brushes against its vague Terms of Service. Instead of fixing underlying issues (like grind or bugs), the developers clamp down on community-made solutions.\r\n\r\nMonetization feels suffocating. Seasonal passes, cosmetics, and IAPs pile on top of already grindy mechanics. For a game that thrives on sharing joy and connection, it leans too heavily on FOMO and limited-time exclusives.\r\n\r\nThe devs say Sky is about kindness and light, but their support system is rigid and dismissive, often leaving paying players feeling unheard.\r\n\r\nIn the end, Sky is a game I’d still recommend trying—for the socialising aspect alone. Meeting other players in this world can be magical, and those interactions make the game feel alive in a way few others can. But if you’re looking for a fair, sustainable, and player-friendly experience, Sky will likely break your heart as much as it moves it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Microtransaction filled grind fest don't waste your time. The developers will do the bare minimum and charge you $25 for it and not fix game breaking bugs for years. Every update is made to make the grind worse and to force you into buying their in game currency. The lack of polish would be intolerable if it was any other game but the fanbase is too kind to ever complain about it. Incredibly predatory FOMO game and the only people left playing are children and those trapped by the sunk cost fallacy.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a decent game. Fun to hang out with friends, and dress up. But I cannot in good conscience recommend this game to anyone. There are so many problems, that I and others I know, experience regularly:\nThe customer support is practically nonexistent. If you have a problem, you would have better luck googling it, than hoping the support team ever gets back to you.\nYou can get muted for the dumbest of things. I got muted for an hour for claiming gods can't get cancer. My friend got muted for talking about cutting their hair.\nFor a social game, the social aspects are severely lacking. Making friends is difficult, as most shadows seem more interested in the friendships they already have. Once you get friends, it is difficult to hang out with them when the servers are constantly shuffling players around like a bizarre cup game.\nConstant errors and bugs that the company seems loathe to fix, no matter how much it may inconvenience the player. However, if something were to be bugged with the shop, or players getting more wax/candles than they should, or anything else that could perceivably cost the company even a single dollar, then it gets fixed in an hour or less.\nThe cost of cosmetics is egregious at best, and they are constantly cycling events to better sell more cosmetics to players with at least a little cash on hand.\nAs I said, it's a decent game, and I do enjoy hanging out with the friends I've made on there. But every decision by TGC just feels like a slap in the face to the players. It feels cruel, it feels like bullying. It feels like getting your lunch money stolen in school, but the thief leaves you with a pretty bow and expects that to make up for it. So no, I do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Beautiful game, had loads of fun when I did play it - but it's virtually impossible to complete anything with how long it takes to get currency and the sheer price of some of the special cosmetics. Not joking, almost $20AUD just for one cape.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Absolutely absurd grind, zero work arounds, and the micro transaction are abyssmal. First playthrough is cool, introduces a sort of rebirth system, which is cool cause the story is great. But if you wanna have any kind of flair or unlock cool decorations you have to either drop dozens of hours grinding (not even close to kidding) or pay 10-20 USD for a SINGULAR cosmetic item. Even Fortnite has better prices bro. \r\n\r\nSound design, story and setting are incredible though. But regardless this game is made for your wallet. The developers intentionally designed the game so there are no ways to gain your items any faster than the speed of smell. Very wholesome game, very corrupt developement.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Far too many microtransactions with absurd prices for a game that demands that you wait 2 weeks after you buy a season pass until you can do all of the quests within to get your items. Combine that with buggy controls and buggy camera with stiff controls that fight you ever step of the way. 4/10 needs a lot more care and adjustments to fix the weird problems like repeat cutsccenes for quests that can't be skipped.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the game's visuals is what made me check it out. i went into it thinking i'd just play for an hour or two. interesting as the atmosphere and gameplay was, it wasn't enough to hook me in so i was ready to call it after a couple hours. i then got to chat with a couple of players right before signing out which actually made me stick with the game for a bit. 16 hours later, i've finished the 'main story', explored a decent amount of the world, and also collected a bit of in-game currency. \n\ncosmetics are a big part of the game and it was one of the main reasons i stuck through it. the designs, along with the game's unique art style, are gorgeous. but even after 16 hours, i still didn't have a single piece of cosmetic. no mask, no cape, no shirt, no pants, no boots. got it, it's a f2p game, mtx are pretty much the norm these days. understandable. i open the shop to see what's for sale. and boy, you might as well be paying your taxes with how much they're robbing you with the prices. sky: children of the daylight robbery more like. but there must be a way to earn some by playing. it's a f2p game after all, you usually just pay with your time. and pay with your time you will. you want some cosmetics? you better be prepared to grind for that sh1t. players have no choice but to do daily quests and go on farm runs to save up for currency. farm runs like in typical mmo's where you follow a route to go farm xp in an optimal amount of time. but in this case, you go farm currency in an optimal amount of time. farm runs in typical mmo's are usually done through combat. the farm runs here aren't nearly as engaging since you're basically just running around places you've been to over and over again. but here's the kicker, after all the grinding you only get to [i] maybe [/i] buy a piece of cosmetic you like. that's because most of the worthwhile cosmetics are only around for a limited amount of time. ain't that something.\n\neven after all these, [b] even though i have it as not recommended, i still think it's worth experiencing. [/b] the flying, the player interactions, the small and interesting gameplay features, the exploration, the sound design, the storytelling, the atmosphere, the visuals. after you finish the 'main story' though, i just can't recommend the game anymore.\n\n[b] what a shame. such a chill and wholesome game buried under weaponized fomo and tedious grinding [/b]",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "EDIT: Now that I've played Sky for upwards of 80 hours (it was 19 when I first reviewed it), I thought I should update my review. It's more or less the same as before, but now with comments about their progression and \"macro\"transactions.\n\nI don't think I've ever felt so much frustration with a game that tries to evoke a feeling of peace and tranquility. I want to like Sky because the premise is nice as a light, social MMO. The visuals are pleasant (if buggy) and the sounds are lovely. But the game itself feels so poorly made.\n\nThe new player experience is needlessly obscure. I had to look up their help guides online to understand the currencies and mechanics. Quests' reminder messages are too vague. Control is taken from you regularly by an inordinate amount of cutscenes, some of them triggered by other people halfway across the region, and they all last twice as long as they need to.\n\nThe camera may be the worst camera I've seen in gaming. It fights you at every turn. Even when I leave the thumbstick alone to let the camera do its own thing, it snaps in random directions for no apparent reason. It clips into walls. It focuses on random areas at times, filling your screen with a nearby boulder instead of the open plain that you're standing in. It moves away from your character to prioritize a cutscene even though you're in immediate danger of being attacked. Sky's been out since 2019 (almost seven years now) and they haven't been able to smooth it out in all that time.\n\nThe controls are poor and unpredictable. While trying to slowly walk, your character will suddenly sprint ahead or jump onto some nearby ledge that you weren't even walking toward. Your bursts of flight get ignored and consumed when trying to fly from ledges. When burning plants or lighting candles, your flame will regularly just not work. When flying you might get yanked around by a wind tunnel or forced into an odd direction for flying too deeply into clouds.\n\nYou're regularly transitioned between varying degrees of control. Sometimes you have full control of your flight and it feels great, but sometimes you're railroaded and can only coast slightly in each direction. Sometimes the game bugs out in some weird in-between because it can't decide whether you should be free or railroaded and you'll get stuck looping in a tunnel of clouds that you can't even see through because they block your screen. In most areas you start in hover mode, but in some areas you inexplicably start in glide mode. Your flight mode will arbitrarily be toggled, wrestling away your freedom of movement. When the game is 90% movement, you better make sure the movement is buttery smooth and actually enjoyable.\n\nThere are so many visual bugs. Awkward, jarring transitions between areas. Eyes falling out of characters' heads. Your character swapping between holding their left or right hand in the air when holding something above them. NPCs standing still for 5 seconds before you can interact (this happens with every single spirit you free). Something with their lighting, or maybe a lack of shadows, makes it difficult to perceive depth and distance. It looks like the game is still in development.\n\nThe final area is the worst frustration of all. The sound design is either buggy or intentionally poor, making it difficult to tell when shards are falling down on you from the storm. After going through multiple times, I now know that the shards aren't synced up with the \"whooshing\" sound of the storm. You just watch the explosions on the ground to time your movement. Shards will hit you despite clearly being behind cover. A single shard will randomly hit you when there's nothing else falling.\n\nNow keep in mind, this was all about the gameplay. I haven't even gotten to the in-app purchases. It isn't readily apparent to a new player because of how vague everything is, but you are extremely limited in your progression as a F2P player.\n\nPlayers are capped to a limit of roughly 20 candles (currency) per day and about 20 ascended candles (rare currency) per week. Realistically depending on your time investment, you'll get anywhere from 5 to 15 regular candles each day. This isn't too bad for the base game spirits.\n\nItems and cosmetics from past seasons are no longer available. But for a limited time every two weeks, some spirits from the past seasons visit, making those items purchaseable once again (albeit for a steeper price than if you had played during that season). With these spirits, one cosmetic costs 40-60 candles. So if you earn 10 candles a day, you can buy a cosmetic in 5 days' time. Candles are also sold for money. The best value deal gets you 190 candles for $50. That can buy you 3-5 cosmetics.\n\nMore than that though, you have to unlock things at the bottom of the tree before you can get to the juicy cosmetics near the top. And you can't even see what's higher up the tree until you buy from the rows below. You get two blessings (one-use consumables) and an upgrade to that spirit's emote. So if you don't want those items, then for each spirit you're wasting about 10 candles and 3 hearts (9 candles) just to get to the top of their tree. But the \"best\" part about these spirits is that you can't even preview any of the cosmetics on your character. The in-game closet only lets you preview the current season's items. So if you buy something and don't like how it looks on you, you're out of luck (and 50 candles).\n\nSpeaking of the closet, this game has the worst interface when you're trying to buy something. You can't preview an item from the menu you're buying it from. You have to leave the spirit and find a closet, preview it there, and then go back to the spirit to actually buy it. Some things you can't preview at all, like props and spells. It's asinine.\n\nTo top it all off, the devs have made the most ironic system for socializing with others by making the friendship tree cost candles. Adding a friend costs 1 candle and unlocking the high five emote costs 1 candle. Only after that can you give them a gift of a heart for 3 candles (the typical price). But the problem is, you don't know how long this person is going to stick around for. They might quit the game next week. I've met so many fun players that I've gifted hearts to, but it costs me 5 candles every time I meet someone new. I want to befriend people, chat, and give gifts, but it leaves me broke so I can't buy anything myself. When veteran players help me and I try to gift them a heart, they decline and tell me to keep my candles because I'm going to need them. When vets are saying that, you know the game is a grind.\n\nClimbing up the friendship tree, it costs another 2 + 3 candles to unlock the ability to freely chat with your friend. Further up it costs 3 candles and 1 ascended candle for the privelege of being allowed to buy microtransactions for your friend (lol). Most of the rest of the tree is emotes, but if you're interested in them it'll cost you 364 candles and 26 ascended candles for all of them.\n\nIt just doesn't make sense for a game that is (ostensibly) about socialization and connection. Make the tree progression based on how much time you spend with a friend or something. It's just a way to drain you of candles so you keep coming back to the daily grind.\n\nIf you've gotten this far, thanks for enduring my rant. The game is actually fun and unique in its premise, but the devs are predatory scumbags who don't deserve your money. They prioritize overpriced cosmetics and merch over actually fixing their game.\n\n[h1]My Rating: 1/5[/h1]",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I play this game on and off and every time I'm reminded of why I stopped playing as soon as I start the game. \n\nWhile the gameplay is enjoyable, it's repetitive and littered with unskippable cutscenes that last too long. The amount of micro transactions is insane to say the least and purely cosmetic. \n\nI recommend this game if you're looking for something chill and free to play with a friend, but overall not the best.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I used to love Sky: Children of the Light. I played constantly. But over time, it became impossible to ignore just how overpriced, stagnant, and lazy the game has become.\nA single digital shirt for your character costs anywhere from $19.99 up to $40. As a designer, I can confidently tell you these cosmetics are nearly pure profit. Most aren’t even new creations - they’re basic color swaps of existing outfits, pushed out again for fans to throw their hard-earned money at.\nPeople defend this with, “Well, the game is free.” Sure, technically. But buy just two or three of these overpriced cosmetics, and you’ve essentially bought the game several times over - without ever getting actual new content to match.\nAnd speaking of content… when was the last time they gave us a truly new realm? Aviary Village in October 2023. That’s it. After that? Nothing but recycled designs, seasonal fluff, and overpriced recolors. “Oh, you bought that $25 outfit in pink? Well now, for only another $25, you can have it in black!” It’s embarrassing.\nThe grind hasn’t evolved either - same repetitive daily loops, same stale areas. It’s mind-numbing.\nThe final straw for me was the Season of the Two Embers - Part 1, where the devs released behind-the-scenes footage showing how they built the game. And yes - credit where it’s due - the world they created is striking and beautiful. But that’s the problem. It feels like they built something incredible and then just… got bored. Or maybe the profit margins were good enough to kick their feet up. Either way, the lack of passion shows.\nPeople like to say Sky is “about socializing,” but let’s be honest: you can’t actually talk to anyone. There’s no mic. You can’t just approach someone and chat like in Palia or World of Warcraft. You have to spend candles - a resource you grind daily - just to unlock basic communication. For socially awkward players, this is a nightmare. You’re forced to follow someone around, hope they accept, and spend precious candles to talk… only to find out they might be awful. And candles are hard-earned: you’re lucky to get ~20 a day. Why do we need this convoluted ritual when a simple block button would solve unwanted interactions?I can tell you my idea, because the candle grind is something awful, tedious, time consuming, and boring after doing the same repetitive thing over and over and over. People get sick of doing it, so *shocker* there's candles that you can pay for with real money. Couple clicks and 10 to 50 bucks later, you have candles. Go make some friends now with that 50 bucks you just spent, pal. We are all about love, community, creativity and inclusivity here.\n\nLet’s talk real money and expectations:\n\nHere’s where it gets interesting: Palia and similar live-service games are pulling in serious revenue, which makes the stagnation of Sky even more frustrating.\n• In Q2 2025, EG7 reported net revenue of SEK 378.8 million.  \n• SEK to USD conversion is currently about 1 SEK ≈ $0.105 (so roughly 10.5 cents).  \n• That means SEK 378.8 million is approximately USD $39.8 million for that quarter alone.\n• Their adjusted EBITDA for the same quarter was SEK 37.5 million, so about USD $3.9-4.0 million in earnings before interest, taxes, depreciation, and amortization.  \n\nSo let me repeat that: Nearly $40 million in net revenue in one quarter, and some millions in pure profit margin. That’s not chump change. And that’s just one quarter - over a full year, this easily becomes a hundreds-of-millions-of-dollars scale business, depending on growth and other quarters.\nSo… with that kind of money flowing in, what exactly is Sky doing with its revenue? Because it’s certainly not being funneled into new realms, compelling gameplay improvements, or bold new mechanics. Instead, the cosmetic shop flourishes, design updates inch forward, and players like me walk away disappointed.\n\nThis game could have been timeless. Instead, it’s become a stagnant cash machine - prioritizing profit over creativity, gameplay, and community. If this is the direction they’re sticking with, it’s only a matter of time before more players walk away. I already did.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was able to play this game few months ago now I cant, Im are required to use a youtube, instagram, facebook or tiktok account to play the game, but I dont want to link any of these. I cant make ingame account or use my steam account for some bizzare dumb reason.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "as a long time mobile player not moved to pc from storage+lag issues on phone, while i enjoy the game and would recommend half of it (+its free anyways).\r\n\r\nim quite disappointed that the forced camera movements are still present, and i gave great disstain for things like that moving light puzzle thing (the player gets a light that has a circular area which they shouldnt leave, and needs to transport said light to the target spot). as a concept that sounds fun potentially, but skys controls are just so bad and clunky that its just frustrating. overall jumping is just wonk, deadass, jumping from a platform? good luck. autojumping? also there at times. bruh why make a game that requires dodging and careful movements at times. . .when the controls are wonky\r\n\r\nand why i would only recommend *half* of it: because it, at least to me, gets advertised as a chill relaxing game, but the amount of control issues that still presist throughout the years but also just in genereal later appearing quicktime-ish events and there being a weekly grind of said more hectic gameplay to me is rather clashing. sure a chill game can have some tense moments, but i feel like its just kinda shoehorned to be here. like yea it makes some plot sense, but the controls and sometimes unforgiving events is rather frustrating to deal with (one of the said unforgiving things i dislike is that if an enemy spots you, youre kinda cooked. in the past there was a bug to confuse the enemy into un-targettign you, but for some dumb reason that got patched out)\r\n\r\nalso i was in the game time where there were no words used for the story, but in recent-ish times they dropped that and now there are some decriptions and everything. its not a big negative but i also feel like that kinda made the game lose its charm even when it can lead to potenially more interesting storytelling (which i dont really play attention since i just in general dont like reading cutscene text. but thats just a personal thing of me being rather easily bored when im forced to sit through slow cutscenes just to progress events)\r\n\r\nwhile its a coop game, im really not found of how quite a few things require you to be in groups of up to 6 people. which. . .well isnt so easy if you play alone or only have one friend to play and then would need to wait potentially an hour plus just so that you can progress an event :sob:\r\n\r\noverall id recommend it as a chill game to play alone or with friends if one sticks to the first few areas(isle, prairie, hidden forest(which is a bit less chill, but not that bad relatively to another area), valley) and some event areas, then its a chill game, but id recommend having someone knowledgable around when playing the latter stages (wasteland, vault isnt stressful but its frustrating with how many coop interactions are needed, eden to just is completely out of place in this game. while i personally am rather used to it, i do feel like it doesnt fit the idea of the game in my opinion\r\n\r\nso yea, complicated and while i kinda recommend it, but only if one doesnt play it to main-content-completion or is ready for a complete vibe clash at least once.\r\n- if someone wants to play a chill game that looks pretty(the graphics were what drew me in, and the cosmetics also give freedome if one gets enough from the neverending grind), then yea, not the full game.\r\n- if someone wants a game, just any game, then sure lmao why not, its free and there are daily quests if one has 30mins-2hours to spare",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[b]played for a month and stopped.[/b]\nstarted playing for the good graphics, promised chill atmosphere and because a friend who played since 2020 promised to teach me the basics; stopped when i realised the only thing that kept me playing was the cosmetics (which i can never obtain since im casual f2p).\n\neven if you play every day for a couple of hours, the amount of \"progress\" (if you can call it that) you can get done is stupidly slow, and it becomes even more infuriating when most players you encounter have cosmetics from the newest season not even A WEEK after it starts.\n\ni never ran into toxic players, but i also never ran into especially helpful players either, everyone was doing their own thing; [b]communication is restricted to specific areas of the game and you need to spend in-game currency[/b] to light a candle and chat. the candle eventually runs out, and considering how slowly you obtain in-game currency it's just not worth it.\nin every other area of the game you gotta use minecraft communication: bow, emote, and hope that the message gets through.\n\nfunny thing is, my friend who told me to play this had stopped playing in 2022 or something, and only came back for a few days so we could play together. they stopped enjoying the game for the same reasons i did:\n[b]- the \"social\" aspect of the game is you playing on a videocall with friends\n- events only add cosmetics, said cosmetics need you to PAY for them, because farming ingame currency doesn't give you nearly enough to buy them\n- everyone is doing their own thing. want to solve a puzzle in the world that needs 8 players? emote like crazy and hope someone stops by. also, hope they do so in an acceptable time window, or else they'll leave. you cant talk to them btw, if you post something in the chat it will appear as \"...\" to players that aren't your friends.\n- playing as f2p is wasting your time. you'll farm for hours and days and months to be able to get the most cheap cosmetic of the season.\n- once you do the \"story\", that's it. well, not really, you can repeat it, the world is \"infinite\". but there's nothing new. apparently there's a \"lore\" but i haven't played in months and i cant be bothered to get into it, the game doesnt tell you anything and the important NPCs just \"thank\" you for freeing them. i dare to say that each event has more \"lore\" to them than the game itself, or at least require more time (money) to finish.[/b]\n\n\n\ntry this game if you:\n- want to explore an open world\n- like cute graphics and atmospheric music\n- like flying around\n- have free time to spare\n- want to spend money somewhere\n\ndon't try this game if you:\n- expect to make friends inside the game, and expect other players to be helpful INSIDE the game (fandom forums were incredibly nice, the problem is that the game is marketed as a \"social adventure\" when the social aspects are so capped)\n- just want to play a social game. you'll be playing alone unless you bring friends, dont expect to make new ones, especially dont expect them to have the same objectives as you\n- are casual or f2p\n- want rich lore that is fun to piece together\n- want to create and customise your own character. cosmetics obtained from the \"story\" pale in comparison to cosmetics obtained from events\n\n\n[b]overall sky is a letdown, it's fun to play until you realise it only becomes worth it when you spend money on it[/b]",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A great game untill after the first couple ascensions, after which you'll realise it is a grind and mictotransaction simulator. Laughable. And sad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game wants your money. And if it can't have that, it'll gladly take your time.\r\n\r\nFor those that are familiar with That Game Company (TGC) and their original creation, Journey, Sky Children of the Light ironically betrays that games core value's in favor of commercial pursuit. Whereas Journey prioritized a contemplative experience of traveling at your own pace and enjoying the world around you, Sky immediately drops new players into the neverending rat race, your existence becoming a relentless grind that's driven by the fear of falling behind.\r\n\r\nIn 2022, one of the creators had criticized IAPs (in app purchases) for preying on negative emotions, stating that \"...they appeal to our greed or fear of missing out...\" And while I did not play during the time of this interview to verify the integrity of such a statement, the departure from it now in 2025 is laughable. It still wears the deceptively ethereal aesthetic that was also present in Journey, but it holds none of its sincerity.\r\n\r\nWhile new players are free to roam at their own pace, this game is essentially an open world chatbox that encourages meeting and helping new people. Befriending others isn't free, however. That will cost you your in-game resources. And if you'd like the ability to talk to someone, that will cost you even more. These resources are the crux of the issue with this game, as not only is the amount you are able to collect capped out daily, they are also needed to purchase the other (and in my opinion, main) driving force of this game, cosmetics.\r\n\r\nIf you play for any amount of time in this game you will notice the cosmetics. Whether from other players, seasonal events, traveling spirits, or IAPs, the game is constantly showcasing what's available. They will make it known to you how much time is left on certain events, what's available, and of course, they will lock the best looking cosmetics to IAPs. In no time, you'll find yourself planning months in advance for seasonal events, release cycles for potential returning cosmetics and rationing your resources so that you don't miss out on something you really want. The events are constantly following each other immediately after one ends, so there is little to no time to recuperate your losses when another one comes bounding up that trail.\r\n\r\nBut what does that leave you with? The desire to share is accompanied by caution and frugality. There is no longer time to connect, no time to chat, and for a game that is supposedly built around making connections, generosity becomes a luxury.\r\n\r\nAn average spirit's cosmetics costs about 140 candles, the game's primary resource. The daily cap for earning candles is 20, which if you like to play less hyper-optimized like me, you can earn with about 2 hours of playtime. This meaning you'd have to play for a minimum of 14 hours if you wanted to buy all of this spirit's items. That does NOT INCLUDE the time it takes to establish a routine in which you learn to gather all of said candles. Now you may not necessarily want all of a spirit's items, but in a worst case scenario I had a spirit where I bought out most everything of for 200 candles. Which is 20 hours of my time. Sometimes singular items cost 140 candles. There's one in game right now for 120. That's 12 hours split across 6 days of your time, for one, singular item. For the majority of the time I played this game, I was unemployed which is how I was able to make this feasible. But for anyone with school, work, or a busy home life, how is this sustainable? Only now after 9 months of unbroken playtime do I feel comfortable because the next spirit isn't going to break my candle bank. If this all sounds tiring to you though, you can always use your real life dollars to buy more candles!\r\n\r\nWhen you are not actively grinding, the game will find other ways to waste your time. There's long, unskippable cutscenes such as one door animation that takes a staggering 50 seconds, camera pulls that another player activated that lasts 10 seconds, flights between areas. These scenes or moments aren't especially interesting either and you'll likely be experiencing them daily. The repetitive delays are constant.\r\n\r\nTo combat the time it takes to go from area to area whilst collecting candles, certain community efforts were made to help ease the grind. And every time the community has banded together to support one another, TCG has made their best efforts to shut it down. One method beloved by everyone allowed players to afk for a measly 10 minutes whilst you could simultaneously passively gather candles. It was a small mercy amongst the daily repetitive grind. TCG made sure to nip that in the bud. Another allowed you to cut 3-5 minutes of travel time between areas at a time. Since no fast travel methods exist, this was a lifesaver within a game that has constant long, uninteresting stretches of travel. TCG made sure to do away with that as well, not just once but several times! As it was harmless, what is the purpose for this other than to enforce some arbitrary rule they've created? TCG allows other unintended uses of traversal, such as chibi falling, so do they not realize their own hypocrisy? To me, the intention is clear. They want their players tired. They want fatigue, they want you burnt out from grinding, because when you are tired, you're more likely to buy. And that is the issue of it all really. This is not a game about connection. It doesn't encourage positive emotions like it claims, but preys on your burnout whilst the kind, patient players who continue to uplift each other in a system designed to wear them down carry its name.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game with a lot of fun gameplay... but it's incredibly grindy, there's a lot of disgusting FOMO, and there's a lot of greatly overpriced cosmetics. I find myself disappointed in the developers despite the game being Free to Play - I expected better from them after Journey. The greed is real and very obvious, and it saddens me greatly.\n\nI don't recommend you start playing this game if you don't have friends to play it with, because without friends to properly enjoy the game with the game's many flaws just ruin the experience too much in my opinion. Yes, the game is an MMO and there are many other players playing it, and a lot of systems in place to help you communicate with those other players without need of any text or voice communication, but I still recommend you only consider playing this game if you have friends to play it with.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "it is pretty repetitive. at first it was very fun but at some point it just felt like a choir and I lost the joy and whimsy that I use to feel.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Omno is a great game of level exploration and travel, a journey through exotic landscapes, filled with animals and riddles and ancient temples. A game I love and love to replay.\r\n\r\nThis is not Omno. This is boring and empty, vacant of life and sense. its dull and clunky. moving around feels like youre dreading water. theres no point in any of this and its frustrating and boring.\r\neverytime theres something new, the camera yankes around and interrupts your game. it doesnt know if it wants to be a game or a short movie.\r\nif i had bought this, i would refund it.\r\nin a sense its even more annoying than journey.\r\nsave yourself the time. play Omno instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fomo simulator. just play with friends and family a few time appart from that its just bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is fun and free but just the AMOUNT of CUT SCEENS it's TO MUCH and takes so long were not in the 2000's any more we don't need to see everything just let me do my thing and let me be free and be able to skip. EVEN more in the last but having to watch for about 20 min for trash. You would get SO many more people if u got rid of all the fluffy and trash it's just to much and not needed. The worst part is I just want to fly but you lose EVERYTHING and restart again. This game was fun at the start but I just don't think I will ever do it more than once twice at most. Also when you beat the game u get ONE WING life NOT EVEN 2 for beating the game like COME ON! \n\nAlso the talking doesn't even work and if u want to be friend with ANYONE u have to give a CANDLE like WHAT WHY? AND EVEN MORE FOR EMOTES LIKE HUH? you can't even say most words like come on this isn't roblox",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really enjoyed Journey so I thought why not give this a go. But it's just annoying in the end. Trying to control the character is like dog fighting in an A10. Everything is cumbersome and imprecise. Add in the random, you're flying, no you're gliding oh no you're flying again and have used up all your magic juju.\n\nProgress in some areas requires a bunch of randoms to be available. Nightmare for us soloists.\n\nVisually interesting but it doesn't have the magic of Journey and seems like a focus group speced the sequel.  Disappointing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it's more fun to draw art for this game than to actually play it, I wish this game was more like it was in 2021. also don't take your friendships on there outside of the game I promise it's not gonna end well 💀",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sky, Removed Message of the Day. With that stole my happiness >:((( \nRETURN BACK MESSAGE OF THE DAY!!!!!!\nreturn it back plsssssssssss ;-;",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "sniffle. whimper. this game is super fun and relaxing but good god the controls have a mind of their own. the camera movement is SO obsessive about wrenching control from you at any possible moment, and will quickly undo just about any adjustments when possible. i get motion sickness when i have little control over my own movements and hoooolyyyy does this game hate giving you full control.\n\ni wish it was just a bit easier on my body to play, i do genuinely want to get into the game, but it's difficult to want to continue playing a game that is so obsessive in moving the camera. i want it centered, i want it to sit still, it shouldnt be moving so extremely without player input. i understand it's likely for mobile players and a more cinematic experience, but there should be a reduced motion option",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sorry, i think i get the \"artsy\" idea of the game and the graphics, and sposed \"friend/community\" play thingy... ...but to me personally this is just bad (and seems to drain resources on my pc?). I get annoyed more then anything else. Since u can test it for free you can try it and see what u think.\r\nBut i just cant stand it...\r\nIt is a functioning \"game\" so i have to give it a 2/5.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Super game if u want a depression!!!!!!!!!! i asked for help is the discord how i can join my little cute friend and then they instant bannend me as like i cant ask any questions. They are all pedo's either so dont download this game it makes u depressed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is fun at first-- the visuals are adorable and endearing, the sounds are beautiful and add to the atmosphere, and it genuinely seems like a good game... Until you actually get past the tutorial and play for the first time.\r\n\r\nFirst off, the flight mechanics are extremely janky and finiky, and tend to send you the exact opposite direction you intend to go. It takes some time to half-master it, and even after that it still bugs out on you.\r\n\r\nSecond, the demand for multiplayer. I myself don't have a lot of friends who play video games, so I usually play games alone. The fact that in order to have a chance to get a cosmetic (I'll talk about that situation next) I have to have 2-8 people is outrageous. Maybe it sounded like a good concept, but it's genuinely so annoying because there are hardly enough people to make collecting all of the souls possible without spending immense time just waiting.\r\n\r\nThird, the god awful way the cosmetics system is set up. What do you mean I have to not only jump through hoops to get the soul for the cosmetic, then I have to spend candles (the main currency) in order to increase the friendship tree, then after that I get to find out that the hair I want costs 48 candles. Then they shove it into your face that \"well, if you don't have enough, just buy some!\" Yeah right. I'm not spending real money on a game like this that wastes its potential.\r\n\r\nFourth, the Eye of Eden segment. Lord, how they need to work on this. It's the most unfinished part of the game. If you make the accident of moving slightly and clipping a small edge, you get flung up by the wind and slammed by a rock. Not to mention, the barriers meant to protect you from getting hit don't work. You can get hit from behind the barriers if you're unlucky, then get knocked straight down... And then you can't get up... And then you get hit again... And you can't get up. If you are unlucky and hit in a downpour of rocks, you end up stunlocked and your light gets eaten up... then you die. But wait, you get to experience the whole end segment over and over and over every time you subject yourself to the Eye of Eden torture, and you get to wait a good twenty minutes until you get a few special little candles! Like, you couldn't even let us skip that after quite literally beating us? Okay.\r\n\r\nFifth, the skip cutscene option is a lie. You can't skip them. They are all gonna happen over and over and you can't do anything about it.\r\nTotally not because they're trying to increase your playtime... Right? Right?\r\n\r\n\r\nTLDR: Pay-to-even-slightly-enjoy game with unfinished mechanics. Don't bother investing time like I made the mistake doing-- this game shouldn't be released yet even with the Early Access title, because it is very obviously not close to finished.\r\nGames like Outlast Trials (who are made by an indie company, mind you) have released in much better quality in Early Access and don't fail to appease their fanbase as much as this game has. Not only is the dev team of Sky unwelcoming and refuse to listen, but they make almost everything locked behind a paywall. So unfortunate.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is cute. A nice idea with co-operative puzzles and a really nice community (a genuinely redeeming feature) BUT, and I can't stress this enough, it is so bland, SO poorly optimized, basic and boring.\nDecidedly not for me, though my younger siblings are enjoying the stress-free nature of the early game so far. I, however, am doing most of the actual quest-work, which fails to meet my standards of gameplay.\nIF this EVER comes out of Early access, which I doubt it will, it's not worth a gold piece in it's current state",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "More cutscenes than gameplay, absolutely tiring stuff. Only boring, no soaring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They were right when they said the music was half the game, the other half is un-skippable cutscenes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Could be fun if the friends list worked and if it wasn't just cutscenes. They just need to make it more accessible because the friends UI is really bad. Also add something besides cutscenes and flying with birds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "endless death, endless grind, repeated events and seasonal events where some shit cost money where the only way to get hearts in the dam game is to make fucking accounts cause no one wants to add random people to spare candles you can earn in game yet people add people for no fucking reason yet some just don't want to add you cause they want to be greedy mother fuckers with there candles",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not even the IRS is this greedy when it comes to cosmetics and rewards",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "its free so i cant complain, but it felt a bit boring sometimes, some rooms required 2 people to open and no one was around to open them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only reason why i play this is because seasonal depression is getting to me and i like to dissociate while playing a seemingly cosy game that just wants to grab your money.\r\nstill havent paid a single cent staying strong kids",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cutscene simulator.\nI start the game and float around, seems nice, good visuals.\nAfter about five minutes of being in a huge cloud It gets boring.\nHowever once an npc takes my hand and follows me around like a lost child I start feeling my testosterone dropping, after the 20th cutscene where it spawns in yet another but bigger npc to ask things of me with gestures I can't help but altf4 sorry.\n\nI tried playing again after some deliberation and thought of maybe this game is an MMO so it's social with text or voice chat, But I THINK I got to find a single other player but i'm not so sure, either way after reviews it seems game's kinda cringe tbh.\n\nIf there's voice chat to meet the girls and upset them with my foul mouth i'm down to play but idk, I'm out.\nAfter reading a dudes review of \"Unban me\" is what made me run it up for round two to see if I could mess around, got bored again though.\nAlso, game's buggy somehow lmfao. Visual screen tearing and blackout issues upon pressing the Enter key and writing to chat? Glitching into walls and collision kinda odd, Not like it matters.\n\nVisuals are great but upon the first 10 septoseconds of viewing the artwork on the steam store page yep it's \"Journey\" alright, nothing bad about that one seems precious, But if it's an MMO I 100% know it's geared to \"nostalgia\" filled 25-30y lgbtq escapism enjoyers.\n\nI'm reviewing as negative because I cannot spam the ESC key to leave the THIRTY SECOND cutscenes every ten seconds.\n\nIf anybody actually plays this game please tell me if it has voice chat and how to get to other real individuals, I wish to cause some chaos. Thanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not sure how to get multiplayer to work. But it’s just one of those environmental games. Barely a game yeah.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "everything is p2w and getting candles alone is such a hassle, i hate That Money Company. ignore my 90+ hours.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "S**t game community, mental problem kids everywhere.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i am not the the person for this game\nif you like chill game idk i played 19 minutes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played it a bit and it just feels low quality all over the place.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is literally unplayable if there isn't anyone guiding you",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "sky: friendship of the gay triangles",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WAY tooo many cut scenes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "gooner game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unban me",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "greedy",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "add tap strafng",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game wants your money. And if it can't have that, it'll gladly take your time.\n\nFor those that are familiar with That Game Company (TGC) and their original creation, Journey, Sky Children of the Light ironically betrays that games core value's in favor of commercial pursuit. Whereas Journey prioritized a contemplative experience of traveling at your own pace and enjoying the world around you, Sky immediately drops new players into the neverending rat race, your existence becoming a relentless grind that's driven by the fear of falling behind. \n\nIn 2022, one of the creators  had criticized IAPs (in app purchases) for preying on negative emotions, stating that \"...they appeal to our greed or fear of missing out...\" And while I did not play during the time of this interview to verify the integrity of such a statement, the departure from it now in 2025 is laughable. It still wears the deceptively ethereal aesthetic that was also present in Journey, but it holds none of its sincerity. \n\nWhile new players are free to roam at their own pace, this game is essentially an open world chatbox that encourages meeting and helping new people. Befriending others isn't free, however. That will cost you your in-game resources. And if you'd like the ability to talk to someone, that will cost you even more. These resources are the crux of the issue with this game, as not only is the amount you are able to collect capped out daily, they are also needed to purchase the other (and in my opinion, main) driving force of this game, cosmetics. \n\nIf you play for any amount of time in this game you will notice the cosmetics. Whether from other players, seasonal events, traveling spirits, or IAPs, the game is constantly showcasing  what's available. They will make it known to you how much time is left on certain events, what's available, and of course, they will lock the best looking cosmetics to IAPs. In no time, you'll find yourself planning months in advance for seasonal events, release cycles for potential returning cosmetics and rationing your resources so that you don't miss out on something you really want. The events are constantly following each other immediately after one ends, so there is little to no time to recuperate your losses when another one comes bounding up that trail.\n\nBut what does that leave you with? The desire to share is accompanied by caution and frugality. There is no longer time to connect, no time to chat, and for a game that is supposedly built around making connections, generosity becomes a luxury. \n\nAn average spirit's cosmetics costs about 140 candles, the game's primary resource. The daily cap for earning candles is 20, which if you like to play less hyper-optimized like me, you can earn with about 2 hours of playtime. This meaning you'd have to play for a minimum of 14 hours if you wanted to buy all of this spirit's items. That does NOT INCLUDE the time it takes to establish a routine in which you learn to gather all of said candles. Now you  may not necessarily want all of a spirit's items, but in a worst case scenario I had a spirit where I bought out most everything of for 200 candles. Which is 20 hours of my time. Sometimes singular items cost 140 candles. There's one in game right now for 120. That's 12 hours split across 6 days of your time, for one, singular item. For the majority of the time I played this game, I was unemployed which is how I was able to make this feasible. But for anyone with school, work, or a busy home life, how is this sustainable? Only now after 9 months of unbroken playtime do I feel comfortable because the next spirit isn't going to break my candle bank. If this all sounds tiring to you though, you can always use your real life dollars to buy more candles!\n\nWhen you are not actively grinding, the game will find other ways to waste your time. There's long, unskippable cutscenes such as one door animation that takes a staggering 50 seconds, camera pulls that another player activated that lasts 10 seconds, flights between areas. These scenes or moments aren't especially interesting either and you'll likely be experiencing them daily. The repetitive delays are constant.\n\nTo combat the time it takes to go from area to area whilst collecting candles, certain community efforts were made to help ease the grind. And every time the community has banded together to support one another, TCG has made their best efforts to shut it down. One method beloved by everyone allowed players to afk for a measly 10 minutes whilst you could simultaneously passively gather candles. It was a small mercy amongst the daily repetitive grind. TCG made sure to nip that in the bud. Another allowed you to cut 3-5 minutes of travel time between areas at a time. Since no fast travel methods exist, this was a lifesaver within a game that has constant long, uninteresting stretches of travel. TCG made sure to do away with that as well, not just once but several times! As it was harmless, what is the purpose for this other than to enforce some arbitrary rule they've created? TCG allows other unintended uses of traversal, such as chibi falling, so do they not realize their own hypocrisy? To me, the intention is clear. They want their players tired. They want fatigue, they want you burnt out from grinding, because when you are tired, you're more likely to buy. And that is the issue of it all really. This is not a game about connection. It doesn't encourage positive emotions like it claims, but preys on your burnout whilst the kind, patient players who continue to uplift each other in a system designed to wear them down carry its name.",
      "voted_up": false,
      "votes_helpful": 235
    },
    {
      "review": "Some reviews say to play it once, and never again. I personally wouldn't recommend you play it at all, if only for the fact that adding to the player count will give TGC a continued incentive to keep doing what they're currently doing, and have apparently [i] been [/i] doing way before I've joined.\n\nIt does genuinely hurt me to say this, too. At the core of the experience, it's a lighthearted and absolutely [i] gorgeous [/i] experience to go through. Flying feels absolutely phenomenal in Sky, and it's home to probably one of the most unique social systems I've ever seen in a game. Going from faceless strangers unable to communicate past gestures, all the way up to full-fledged friendships with unrestricted communication is honestly one of the most heartwarming experiences I could ever ask for. I do, with all my heart, love this game, even for what little I've played of it.\n\nBut the fact is that under the surface, past your first playthrough, that facade of a pristine utopian world, where everyone's happy and nothing goes wrong, quickly diminishes away once you realize that the game is so hyper-focused on draining your wallet on overpriced cosmetics, battle passes, FOMO, and even it's own core systems. It's a game that, despite it's charm, will always have one hand in your pocket while it regales you with it's bright, sunny atmosphere, and friendly playerbase.\n\nCandles are Sky's main currency, and already it's being torn in two by being the both the money you use to buy cosmetics to express yourself, and also the currency you use to make and develop friendships. With your candle grind being hard-capped at a measly 20 candles a day, assuming you do a *full candle run* without burning out midway through, (With [i] single cosmetics [/i] costing up to 100+ candles each????) that means that you are stuck with the ultimatum of \"Ignoring the grind, and focusing on making friends\" or \"Saving up your money to slowly chip away at that cape you want\". [b] It's a system that cannibalizes itself in order to coerce you into buying candle packs. [/b]\n\nDoing one will dip into the progress of another. Making friends and unlocking unrestricted chat between them will make your cosmetic grind even harder, on a game that's already being so heavily bogged down by its insane grind.\n\nThey are selling candle packs for actual money. There is a tangible value to these candles. [b] Friendships, in this social game, cost money. [/b] You can't even so much as [b] hug [/b] or even [b] chat [/b] outside of designated chatting areas, without it being tied to it's main form of monetization. You either make friends, become antisocial with other players for weeks on end in an attempt to save up candles, or fork up money in a vain attempt to have both.\n\nThis is depressing beyond belief. If someone like EA, Ubisoft, or any big corporation pulled this type of thing in one of their games there would be public outcry about it, and it blows my mind that the community is being so soft with TGC about this. I don't care if they're a \"Small indie company\" who \"Needs to keep the lights on\", this level of greed should be condemned. Not encouraged, not hand-waved away. It's a bad look for everyone involved, and has actively pushed me away from ever spending money on this game.\n\nThis type of monetization affects already paying players too. The price of candles is so clearly inflated, that you'll fork up an arm and a leg just to get even a fucking haircut. Since there's no regional pricing either, sometimes that outfit you want can cost an entire weeks worth of groceries. New players are already slaving away trying to get base game stuff, much less some of the cosmetics from the traveling spirits or events, and old players are having the value of candles diminishing after every event.\n\nIt doesn't help that even the main loop of going through \"Friendship trees\" with the spirits can have you doing memories that are either not challenging enough to be engaging, or too frustrating to be relaxing. You play tag with still holograms and escort purple lights at a snail's pace, only to watch a buggy cutscene drag it's feet across the floor, and for what? So you can reach the top of the tree, only to have the so-called \"privilege\" to pay for a [b] 190 CANDLE SHIRT? [/b]\n\nDon't even bother. Save yourself the heartbreak, Sky is nothing more than a PC port of a mobile game designed to prey on your relationships with others. It doesn't deserve to have the community that it has right now.\n\n\n[b] - Edit - [/b]\nI should probably address the complaints in the comments saying that you're not forced to buy cosmetics, or that they're simply \"Optional\". From an objective standpoint, yeah, TGC doesn't actively paywall the player or *force* them to purchase cosmetics. I still don't think simply saying that \"It's optional!\" is a good enough reason to simply let things stay the way they are.\n\nPart of the reason I'm so harsh on the monetization is because, as it stands, the game is pretty anorexic in terms of gameplay. It's clear that the game's main focus is on socializing and storytelling, but Sky is so incredibly thin on things for players to actually *do* together. There's maybe two races in the game, (One flying, one sliding) a handful of doors that require multiple people, and only a couple of multiplayer-focused side activities that players *have to go out of their way* to find. (Or even use candles to buy, like the soccer minigames found occasionally on the map, which alleviates the issue about as well as pouring salt on an open wound.)\n\nThere's hardly any challenges that require cooperation, no stories that involve you and another player, and candle runs seem to be the only thing that consistently has players bunching up together and doing. It feels like cosmetic grinds is *all* you can do, and the game reinforces that mindset, since sitting down and going through memories will only reward you with a gesture at best, (Your main form of communicating to strangers anyways.) and at worse, the ability to purchase cosmetics after doing a grind (Candle runs) that's completely separate from the main form of content: Memories.\n\nAnd self-expression is *a core part* of the social experience. The social aspect is, what I believe, one of Sky's strongest features, and part of what makes me love the game, so it frustrates me to see that the simple act of *making friends* has to get in the way of such a vital part of the experience, just so it can push people into dropping money on clothing that is WAY overpriced for what you get. \n\nSo even though the cosmetics are \"Optional\", the pricing, the hard cap on candles, the lack of \nmeaningful content, the split between socialization and the grind, it all severely hurts the game, and pushes away people who'd otherwise be willing to buy in for some of the cooler outfits-- or even just to support the devs, who have clearly worked hard on making Sky as beautiful as it is. But as it stands right now, Sky's monetization is incredibly predatory, and I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 108
    },
    {
      "review": "on the surface, it's sweet and good and is intended to be really calming. it has a nice soundtrack and the graphics are pretty. sadly, it goes downhill from there - the majority of content revolves around FOMO about exclusive cosmetics for real money, the majority of which never return or do not return for potentially years on end.\r\n\r\nit wont run well on lower end devices - my laptop really struggles at certain points with loading, severe stuttering, and even overheating (bearing in mind my laptop can typically run big name games easily on the highest graphics settings).\r\n\r\ntrying to play with specific people REALLY does not work well - i played with my partner for the majority of the time and we were constantly getting kicked away from each other/unable to join each other for unknown reasons. the amount of leaving and joining we had to do to fix it was ridiculous and got very frustrating at points.\r\n\r\nthe gameplay loop is entirely fundamentally based in repetition and doing the same thing over and over daily - after youve completed the main questline (and even during) it really is just running the same route over and over to get candles which are again just for cosmetics. additionally some of the quests from certain seasons are almost not possible to complete nowadays because they require multiple people and there simply are not enough people trying to run the quests anymore so you end up waiting hours for people to join.\r\n\r\ntldr: if youre not into it already i wouldnt really recommend getting into it or doing much more than maybe running through the game once and then not touching it again - it's very pretty and soothing on the surface but the seasons and blatant money grabbing are exhausting and im sure there are other games that are also pretty and soothing without the constant undertones of \"give us money! give us money NOW!!! pleeaaasee we want ur money soooo bad give us ur money or youll miss out 😈\"",
      "voted_up": false,
      "votes_helpful": 137
    },
    {
      "review": "I'm still playing this game but there's really nothing to do except grinding to get the limited timed items.\n\nAt the beginning it's great, you explore, discover new places, routes, but once you saw every zone (which takes maybe 20h? maybe less, unsure) there's nothing much to do.\nThe game is beautiful, and so is the music. The ambience is great but it's FOMO the game. \nThere's constant timed events with a season pass for each of them. And the grinding consists of going and collecting things in different places. And that's it, that's all there is to do.\nThere's \"quests\" and all but the gameplay doesn't change (it's just fetch quests or bring spirit here).\nThere's a lore I guess but personally it didn't manage to interest me.\n(Also there's too many cutscenes at times, it's cool the first time you see them but becomes annoying by the 15th time)\n\nFeels like it could be something great if it wasn't so greedy and the only thing the team seems to add to the game is making the grinding longer and more tedious.\nI'm still playing but only from time to time, just to see what's new, do a bit of the current event, get bored, and leave for months.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I have tried this game when it was released. So I wanted to play it again on pc. Althought it was an interesting experience I realized how horrible they are in terms of progress. It has been 5 years that this game has been released and there is no progress in terms of main story. It is just a loop. You learn lore of the game from event stories. Events are good but the game is grindy as hell. Everybody mustn't invest that amount of time in a game like this.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "I cannot recommend this game in good faith. It's kind of like going to an art museum. Everything is very fun to look at, and the first time going through is a wonderful experience, but there's not much else to do but talk to your friends and go to the overpriced gift shop when you're done.",
      "voted_up": false,
      "votes_helpful": 10
    }
  ]
}