{
  "positive": [
    {
      "review": "Great game with awesome graphics and character design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just started playing saw you could get the ninja turtles downloaded it but i had already missed the michealangelo i was mad im gone keep playing tho any way to still get him?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So badly loving this game, I'm playing 2 other accounts on other devices.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall I like almost everything about this game. The mythology and the familiar crossovers are specifically cool. I like the randomness less. It makes it difficult to build a specific or 'complete' team even after spending a notable amount of time and money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first I was very skeptical, the youtube ads didn't really make for the best encouragement to play it, but one day I started. It's been 4 years I've been playing this game. I love the fact it's multi-platform, I like very often updates, this game changed so much throughout the years due to the fact more complicated and interested mechanics and COOL champions were introduced. But most of all - I made friends along the way. I've been in 3 clans including the one I'm in now. Each one had the best leadership and other folk were there to always help, not necessarily only about the game. This game has, I think still, bad rep - of course, it is at the end of the day in the very very highest endgame a pay 2 win title - fact is, that most of the players don't aim for the highest ranks in the leaderboards, most of my clanmates are f2p and this game is totally playable this way. It's a one of a kind game - I truly recommend trying it out, multiplatform makes it easier, and getting into a clan is, in my experience, the most fun addition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game, but the downside is that my previous account was not valid and I had to create a new one, but I like everything anyway :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Mobile Game To Steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its alright",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Join my clan DeMonArchs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Baum👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "like",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "gjhgj",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nobody reads my reviews anyway.\nI'll throw in a recipe for Varenyky.\n\nRecipe for Potato Dumplings (Varenyky)\nIngredients:\nFor the dough:\nWheat flour – 500 g\nWater – 200 ml\nEgg – 1\nSalt – 1 tsp\nFor the filling:\nPotatoes – 1 kg\nOnions – 2\nLard or butter – 50 g\nSalt – to taste\nGround black pepper – to taste\nPreparation steps:\nMaking the dough:\nSifting the flour: Sift the flour into a large bowl.\nMaking the dough: Add salt and the egg to the flour. Gradually pour in the water, constantly stirring. Knead the dough until it becomes smooth and elastic.\nResting the dough: Wrap the dough in plastic wrap or cover it with a towel and let it rest for 30 minutes.\nPreparing the filling:\nBoiling the potatoes: Peel the potatoes, cut them into large pieces, and boil until tender in salted water.\nPreparing the onions: While the potatoes are boiling, finely chop the onions. Sauté the onions in lard or butter until golden brown.\nMaking the potato puree: Drain the potatoes and mash them. Add the sautéed onions, salt, and pepper to taste, and mix well.\nForming the dumplings:\nRolling out the dough: Roll out the dough into a thin sheet about 2-3 mm thick. Use a glass or cutter to cut out circles approximately 7-8 cm in diameter.\nForming the dumplings: Place a spoonful of potato filling on each circle of dough. Fold the dough in half and pinch the edges tightly to seal the dumplings.\nCooking the dumplings:\nBoiling water: Bring a large pot of water to a boil, add salt.\nCooking the dumplings: Gently drop the dumplings into the boiling water, stirring carefully to prevent sticking. Cook until done (approximately 5-7 minutes after they float to the surface).\nServing:\nRemoving the dumplings: Remove the dumplings with a slotted spoon and place them on a plate.\nServing: Serve the dumplings hot, optionally drizzling with melted butter, sour cream, or sautéed onions.\nEnjoy your meal!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Its raid shadow legends,\r\nfew things:\r\nmake sure you start with a referral link. gives you free stuff.\r\ncode monkeyking for a free legendary to help\r\nI'd look up a starter guide on youtube since theres so much youd want to know.\r\nRSL is a very deep game surprisingly. Beneath all the gatcha and cash grabbing, its a very good game, with very deep mechanics. There is always an event going, so you can gain free stuff all the time. \r\n\r\nI've been playing on steam deck, its good. Does well. On pc it lags a lot, but i only go there to check tournaments because they dont load on deck for some reason. \r\n\r\nTLDR: returning players enjoy, new players look up the starter guide on youtube before playing. Youll thank me later.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "[Gameplay] 🕹️\r\n\r\nOriginally a mobile game, RAID's gameplay is a blend of champion collection and turn-based combat. The strategic depth comes from building synergistic teams for various battles in dungeons, campaigns, and PvP arenas. And you collect sets of gear, artifacts to empower your champions. The game is mostly PvE.\r\n\r\n[Graphics] 🖼️\r\n\r\nThe game's visuals are a highlight, featuring a dark fantasy art style. Since RAID is originally a mobile game, it won’t look good on PC graphic-wise.\r\n\r\n[Audio] 👂\r\n\r\nThe sound design is OK, with good sound effects and a few cinematic score. I generally play it on mute while doing other stuff.\r\n\r\n[Storytelling] ✒️\r\n\r\nThe narrative is a classic dark fantasy tale: you are a resurrected warrior fighting to save the realm of Teleria. The lore is expanded through individual character backstories and a cinematic series. Other than that, there is nothing for storytelling.\r\n\r\n[Difficulty] 💪\r\n\r\nRAID is a gacha game known for its aggressive monetization and a massive grind. While free-to-play is possible, progression can be very slow, and competing at a high level often requires significant spending to acquire top-tier champions. You will spend hours in this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Overall I like almost everything about this game. The mythology and the familiar crossovers are specifically cool. I like the randomness less. It makes it difficult to build a specific or 'complete' team even after spending a notable amount of time and money.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall, RAID: Shadow Legends is a solid pick if you enjoy turn-based RPGs with large character pools, team building, and strategic battles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In general a very solid game for free, both available modes are really good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RAID: Shadow Legends – A Deep RPG Experience with Strategic Depth\n\nRAID: Shadow Legends offers a rich, turn-based RPG experience set in the dark fantasy world of Teleria. Developed by Plarium, the game boasts over 800 Champions from 15 factions, each with unique abilities and backstories .\n\nGameplay & Mechanics\nThe game features a variety of modes including a story-driven campaign, dungeons, faction wars, and PvP arenas. Players can customize their Champions with gear, masteries, and artifacts, allowing for millions of possible builds . The strategic depth is evident as players must consider team compositions, synergy, and tactics to succeed.\n\nGraphics & Performance\nRAID impresses with its high-quality 3D graphics and detailed character models, setting a high standard for mobile RPGs. The fantasy-themed art style adds to the immersive experience .\n\nMonetization & Progression\nWhile the game is free-to-play, it includes microtransactions for summoning Champions and acquiring resources. Some players may find the progression system grindy, especially when aiming for top-tier Champions or gear .\n\nCommunity & Longevity\nThe game has a dedicated player base and an active esports scene, with tournaments and competitions held regularly. The community is generally welcoming, and the developers continue to support the game with updates, new content, and balance changes .\n\nFinal Verdict\nRAID: Shadow Legends offers a deep and engaging RPG experience with extensive customization and strategic gameplay. While the monetization model may not appeal to everyone, the game's content and community make it a worthwhile endeavor for RPG enthusiasts.\n\nRating: 8/10",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "great game. yes its gacha. yes you can spend heaps of money. or you can be like other people and do the whole content free without spending a dime for years.\none of the top players in the game is a ftp player.\n\nand no this is not your other gacha games type. you do have to think and understand the mechanics of the game.\n\nps. if you played under 100h and have an opinion its not worth listening too. (in this game)",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Its not bad, but it gets quite difficult early on and you get stuck at certain points. If you’re a beginner, you might feel lost and not know what to do.\nAlso, its clearly p2w, which kind of ruins the experience.\nI dont like the ranking system and would prefer something different.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cill to play, challenging, u can play it anytime, SWEET",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is extremely repetitive with very complicated systems that I don't all ways understand yet I do come back to play it over and over again, just focus on speed speed speed that's all you really need to do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a relaxing, strategy, fantasy, turn based game, that is kind of addicting and very enjoyable. Would very much recommend. All the advertising that they have done everywhere is so worth it. No memes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RAID: Shadow Legends is an impressively polished game that delivers a high-quality RPG experience on both mobile and PC. The graphics are outstanding — character models are incredibly detailed, and the animations feel fluid and impactful. The variety of champions is one of the game’s strongest points, allowing players to build teams that fit any playstyle.\n\nThe balance between PvE and PvP modes keeps the gameplay engaging, and there’s always something to do, whether it’s progressing through the campaign, tackling dungeons, or competing in the arena. The progression system is rewarding, consistently giving you a sense of growth as you upgrade your champions. Overall, RAID is a great choice for fans of tactical RPGs who enjoy beautiful visuals, strategic combat, and deep hero collection mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Make sure you look up new player promo codes before letting too much time pass. Also, some online folks may have some promo link codes available.  Here's one that may have one?\n\nhttps://www.youtube.com/@raids-guides",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with awesome graphics and character design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The battles are enjoyable, the graphics are impressive, and it’s easy to spend hours building the perfect team. It’s great to see the game still getting updates and support after all these years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just started playing saw you could get the ninja turtles downloaded it but i had already missed the michealangelo i was mad im gone keep playing tho any way to still get him?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So badly loving this game, I'm playing 2 other accounts on other devices.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8/10 fun could use a little diffaculity change with the levelng system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun has alot of bad ass stuff to do",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At first I was very skeptical, the youtube ads didn't really make for the best encouragement to play it, but one day I started. It's been 4 years I've been playing this game. I love the fact it's multi-platform, I like very often updates, this game changed so much throughout the years due to the fact more complicated and interested mechanics and COOL champions were introduced. But most of all - I made friends along the way. I've been in 3 clans including the one I'm in now. Each one had the best leadership and other folk were there to always help, not necessarily only about the game. This game has, I think still, bad rep - of course, it is at the end of the day in the very very highest endgame a pay 2 win title - fact is, that most of the players don't aim for the highest ranks in the leaderboards, most of my clanmates are f2p and this game is totally playable this way. It's a one of a kind game - I truly recommend trying it out, multiplatform makes it easier, and getting into a clan is, in my experience, the most fun addition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Would recommend this game to veteran gamers! Gets too much hate for being pay 2 win which it is but overall the game play and game design is good.\n\nI dont think this game is good for newer gamers as its very predatory and could end up falling victim and emptying your bank account on this game.\n\nThis game is time based like farmville, vampire wars .etc - you can only make so much progress in a day. There is no \"beating\" this game, you can get to the end game entirely free to play but it takes a lot longer than a player who is spending. Spending in this game will get you to the end faster but can be done entirely free to play as well. There is pvp mode and free to play players cannot compete in the end game against spenders but can pretty much do everything else.\n\nI have been playing this game for months and have been enjoying it. If there were better more novel games out i would",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Raid: Shadow Legends impresses with stunning visuals and a huge roster of champions, but the repetitive grind and heavy reliance on microtransactions hold it back. Still, it’s a fun option if you enjoy collecting and building characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game, but the downside is that my previous account was not valid and I had to create a new one, but I like everything anyway :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, kinda addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its just a game that you can play when you are looking for something midles",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's fun and absorbing",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "good game , only it take to much time to go up lvl.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always new  stuff coming and  i love building my champions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is fun and eats up time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love scratchy lizard men chins",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's a reason why you only need one hand to play this game...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "play is good but rewards need improving",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you can handle pop ups every two minutes while playing then this game is cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is very fun to play thankyou",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game love leveling up my heroes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun game rpg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Mobile Game To Steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best Game in History of Gaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its alright",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A GREAT GAME TO PLAY WHEN YOU NEED TO GET YOUR HEAD OFF SOMETHING AND JUST RELAX",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Join my clan DeMonArchs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS AWESOME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for mobile tbf",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME EVER",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like it little now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Baum👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "like",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "yo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gjhgj",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its raid shadow legends,\r\nfew things:\r\nmake sure you start with a referral link. gives you free stuff.\r\ncode monkeyking for a free legendary to help\r\nI'd look up a starter guide on youtube since theres so much youd want to know.\r\nRSL is a very deep game surprisingly. Beneath all the gatcha and cash grabbing, its a very good game, with very deep mechanics. There is always an event going, so you can gain free stuff all the time. \r\n\r\nI've been playing on steam deck, its good. Does well. On pc it lags a lot, but i only go there to check tournaments because they dont load on deck for some reason. \r\n\r\nTLDR: returning players enjoy, new players look up the starter guide on youtube before playing. Youll thank me later.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "[Gameplay] 🕹️\r\n\r\nOriginally a mobile game, RAID's gameplay is a blend of champion collection and turn-based combat. The strategic depth comes from building synergistic teams for various battles in dungeons, campaigns, and PvP arenas. And you collect sets of gear, artifacts to empower your champions. The game is mostly PvE.\r\n\r\n[Graphics] 🖼️\r\n\r\nThe game's visuals are a highlight, featuring a dark fantasy art style. Since RAID is originally a mobile game, it won’t look good on PC graphic-wise.\r\n\r\n[Audio] 👂\r\n\r\nThe sound design is OK, with good sound effects and a few cinematic score. I generally play it on mute while doing other stuff.\r\n\r\n[Storytelling] ✒️\r\n\r\nThe narrative is a classic dark fantasy tale: you are a resurrected warrior fighting to save the realm of Teleria. The lore is expanded through individual character backstories and a cinematic series. Other than that, there is nothing for storytelling.\r\n\r\n[Difficulty] 💪\r\n\r\nRAID is a gacha game known for its aggressive monetization and a massive grind. While free-to-play is possible, progression can be very slow, and competing at a high level often requires significant spending to acquire top-tier champions. You will spend hours in this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Overall I like almost everything about this game. The mythology and the familiar crossovers are specifically cool. I like the randomness less. It makes it difficult to build a specific or 'complete' team even after spending a notable amount of time and money.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall, RAID: Shadow Legends is a solid pick if you enjoy turn-based RPGs with large character pools, team building, and strategic battles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In general a very solid game for free, both available modes are really good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RAID: Shadow Legends – A Deep RPG Experience with Strategic Depth\n\nRAID: Shadow Legends offers a rich, turn-based RPG experience set in the dark fantasy world of Teleria. Developed by Plarium, the game boasts over 800 Champions from 15 factions, each with unique abilities and backstories .\n\nGameplay & Mechanics\nThe game features a variety of modes including a story-driven campaign, dungeons, faction wars, and PvP arenas. Players can customize their Champions with gear, masteries, and artifacts, allowing for millions of possible builds . The strategic depth is evident as players must consider team compositions, synergy, and tactics to succeed.\n\nGraphics & Performance\nRAID impresses with its high-quality 3D graphics and detailed character models, setting a high standard for mobile RPGs. The fantasy-themed art style adds to the immersive experience .\n\nMonetization & Progression\nWhile the game is free-to-play, it includes microtransactions for summoning Champions and acquiring resources. Some players may find the progression system grindy, especially when aiming for top-tier Champions or gear .\n\nCommunity & Longevity\nThe game has a dedicated player base and an active esports scene, with tournaments and competitions held regularly. The community is generally welcoming, and the developers continue to support the game with updates, new content, and balance changes .\n\nFinal Verdict\nRAID: Shadow Legends offers a deep and engaging RPG experience with extensive customization and strategic gameplay. While the monetization model may not appeal to everyone, the game's content and community make it a worthwhile endeavor for RPG enthusiasts.\n\nRating: 8/10",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "great game. yes its gacha. yes you can spend heaps of money. or you can be like other people and do the whole content free without spending a dime for years.\none of the top players in the game is a ftp player.\n\nand no this is not your other gacha games type. you do have to think and understand the mechanics of the game.\n\nps. if you played under 100h and have an opinion its not worth listening too. (in this game)",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Its not bad, but it gets quite difficult early on and you get stuck at certain points. If you’re a beginner, you might feel lost and not know what to do.\nAlso, its clearly p2w, which kind of ruins the experience.\nI dont like the ranking system and would prefer something different.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cill to play, challenging, u can play it anytime, SWEET",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is extremely repetitive with very complicated systems that I don't all ways understand yet I do come back to play it over and over again, just focus on speed speed speed that's all you really need to do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a relaxing, strategy, fantasy, turn based game, that is kind of addicting and very enjoyable. Would very much recommend. All the advertising that they have done everywhere is so worth it. No memes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RAID: Shadow Legends is an impressively polished game that delivers a high-quality RPG experience on both mobile and PC. The graphics are outstanding — character models are incredibly detailed, and the animations feel fluid and impactful. The variety of champions is one of the game’s strongest points, allowing players to build teams that fit any playstyle.\n\nThe balance between PvE and PvP modes keeps the gameplay engaging, and there’s always something to do, whether it’s progressing through the campaign, tackling dungeons, or competing in the arena. The progression system is rewarding, consistently giving you a sense of growth as you upgrade your champions. Overall, RAID is a great choice for fans of tactical RPGs who enjoy beautiful visuals, strategic combat, and deep hero collection mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Make sure you look up new player promo codes before letting too much time pass. Also, some online folks may have some promo link codes available.  Here's one that may have one?\n\nhttps://www.youtube.com/@raids-guides",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with awesome graphics and character design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The battles are enjoyable, the graphics are impressive, and it’s easy to spend hours building the perfect team. It’s great to see the game still getting updates and support after all these years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just started playing saw you could get the ninja turtles downloaded it but i had already missed the michealangelo i was mad im gone keep playing tho any way to still get him?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So badly loving this game, I'm playing 2 other accounts on other devices.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "RAID: Shadow Bullshit is digital cancer. Uninspired, unoriginal, pay-to-win trash. The game everybody heard of (because of its atrocious ad campaigns and shills on YouTube), but nobody likes.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "gameplay is very lacking, as it is just clicking buttons and seeing SFX, not to mention the AUTOPLAY BUTTON. \r\nthe monetisation is worse, with payment screens and limited time purchases being thrown at you every time you beat a level. \r\nbeating a level does not feel rewarding in the slightest, only used to pad out playtime.\r\n\r\ni purely installed this game to see what it was like, and i did not have high expectations. i was still disappointed.\r\n\r\nonly good thing is DEATH KNIGHT LETS FUCKING GOOOOOOOO",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Thought I'd give this game a try because I'm a fan of Alien and Predator and saw they had a crossover event happening. Thought maybe it'd be like $20 or something crazy for an event pass.\n\nIt's $60. \n\nLmao.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "RAID: Shadow Legends feels less like a game and more like a grind disguised as RPG. The repetitive missions, heavy reliance on micro‑transactions, and predictable “pay‑to‑win” progression make it hard to stay invested, fun only if you don’t mind shelling out or repeating the same loops over and over.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The developers Plarium Global Ltd have been exposed for paying obscene amounts of money to Chinese bot farms to flood their Steam page with positive reviews.\n\nTerrible game, and Youtubers that take sponsorships for this are part of the problem. Great for people with the attention span of a goldfish, absolutely boring and underwhelming for everyone else.\n\nFull of microtransactions that will burn a hole in your wallet if you're dumb enough to actually buy them for this low effort Chinese mobile game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool pop up ads simulator with gameplay in the background",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just seems like a glop autobattler. Plus it has the atrocious mobile homescreen UI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "how stupid some developers are today, making game without simple sign up\\login.....maybe there is after that bullshit part you need to play every time you install game on new device.\n\nJust avoid, its p2w anyway",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the worst casino you can imagine, run from this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "wont link game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "P2W",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "p2w but good game. \n\nRaid: Shadow Legends is still one of the best-looking gacha RPGs out there. The Champion designs and battle animations are top-notch, and the game keeps getting updates that add more content and quality-of-life improvements. The new mechanics in 2025, like the “Activate” effect and Faction Wars Hard mode, definitely make the gameplay deeper and more strategic.\n\nThat said, the difficulty curve has become very steep, and progressing without spending money can feel slow and grindy. Some of the new content is tuned for highly invested players, which might be frustrating if you prefer a more casual pace.\n\nOverall, Raid is a game that rewards patience and strategy. If you enjoy collecting heroes, optimizing teams, and tackling tough challenges, it’s worth playing. Just be ready for a grind—and a lot of offers trying to get you to spend.",
      "voted_up": false,
      "votes_helpful": 428
    },
    {
      "review": "DO NOT PLAY THIS GAME. At every turn, at every screen, this game wants your money. Constant pop-up's for extreme MACROtransactions. You will NEVER advance, NEVER get any good rewards without giving hundreds of dollars. For the price of just one of their scam deals, you can buy and own so, so, many good games here on Steam. You have been warned. Don't waste your life on this \"game\"",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "RAID: Shadow Bullshit is digital cancer. Uninspired, unoriginal, pay-to-win trash. The game everybody heard of (because of its atrocious ad campaigns and shills on YouTube), but nobody likes.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Games fun but DO NOT SPEND MONEY. The worst rates and worst bang for buck I've seen in a gacha. I don't recommend spending a dime because you are likely to be disappointed (like me).\n\nI started for the TMNT event and dropped some cash before realizing how much worse this one is than some of the gacha's I've played in the past. It's very, very predatory... you're constantly saying no to offers. That said, the underlying game if you can get past the marketing is really fun.\n\nAlso- if you want to have fun, you really have to spend. There's about a week of decent energy for new players, but once you go to full on free to play... you have to be very efficient. Every resource has a \"right\" time to spend it, otherwise it's a trap... same goes for deals in the shop if you spend- these are almost ALL traps. Especially for new players.\n\nThis is a product first, and a game second.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "gameplay is very lacking, as it is just clicking buttons and seeing SFX, not to mention the AUTOPLAY BUTTON. \r\nthe monetisation is worse, with payment screens and limited time purchases being thrown at you every time you beat a level. \r\nbeating a level does not feel rewarding in the slightest, only used to pad out playtime.\r\n\r\ni purely installed this game to see what it was like, and i did not have high expectations. i was still disappointed.\r\n\r\nonly good thing is DEATH KNIGHT LETS FUCKING GOOOOOOOO",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "LMAO raid shadow legends is literally botting a bunch of positive ratings.  There's a row of positive reviews that sound like ai written PR speak, all from private accounts with bans and generic profile pics, all with EXACTLY the same 14.2 hours of playtime.  They aren't even trying to hide it.  This mobile trash should be removed from steam.  Utterly ridiculous they allow games to do this kind of thing.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "A money pit buy buy buy pop ups 3 or 4 times in a row if you can put up with that it is playable if you play it long enough you learn to close them without even looking at them.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Graphics 8\r\nSound 6\r\nMechanics 7\r\nInterface 9\r\nVariety 10\r\nReplay 7\r\nSpend money:  Only if you are rich!\r\nNot a bad game and I do somewhat enjoy it but the RNG and F2P monetization is brutal.  I wanted something to play, not a second job that wanted me to pay them to work.\r\nWhile it's graphics are nice, you can see where they get lazy and just reskin the same old models.  Ever notice their hair, how it hovers over their back.  It's a lazy short cut so they can spend more time squeezing more from their cash shop.  That lazy reskin mind set pervades the game.  I don't mind F2P pop up here and there, a game has to make money, but good lord you will get a few dozen by the time you get to the 3 hour daily game expectation their rewards systems sets for you.\r\n\r\nIf you have a ton of spare time to waste or a fat wallet give the game a try.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "MAYBE ask me to link an account in the beginning so i can play with my mobile account. i had to log into a new one that you created on startup and delete the link to steam and connect to my opl account. If it doesnt work now, ill just delete again. horrible first impression",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This is a classic game of beating people up with your wallet.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Thought I'd give this game a try because I'm a fan of Alien and Predator and saw they had a crossover event happening. Thought maybe it'd be like $20 or something crazy for an event pass.\n\nIt's $60. \n\nLmao.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Obviously just a pay to win timesink game. It will do it's best to lure you in with deals, and promises while managing to try to pull the rug out from under you. See an add for Alice, get told to enter GETALICE, oh no, it's just for new players though the ad never mentions. Oh you joined a lil' late on a tournament? no dice, you can't get it. You are new to the game, but not new enough to earn rewards? you won't be able to summon the heroes you want. You will be forced to buy something to get even slightly anywhere and even then, you are likely to not get what you want. This game is only as good as the money or time you spend on it. Your time will be far better used on something else, and your money, well that's up to you. They certainly want it all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "RAID: Shadow Legends feels less like a game and more like a grind disguised as RPG. The repetitive missions, heavy reliance on micro‑transactions, and predictable “pay‑to‑win” progression make it hard to stay invested, fun only if you don’t mind shelling out or repeating the same loops over and over.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "pay to win game, if you have no money in you're bank account, good luck getting at least 2 Legendary champions without having to spend $19.99 or 44.99 to get at least one Sacred shard. the only way to get one champion is being a new new player, or an event we're you HAVE TO PLAY FOR 7 DAYS STRAIGHT to get one legendary.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The developers Plarium Global Ltd have been exposed for paying obscene amounts of money to Chinese bot farms to flood their Steam page with positive reviews.\n\nTerrible game, and Youtubers that take sponsorships for this are part of the problem. Great for people with the attention span of a goldfish, absolutely boring and underwhelming for everyone else.\n\nFull of microtransactions that will burn a hole in your wallet if you're dumb enough to actually buy them for this low effort Chinese mobile game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Take me back to when they made original cool champions instead of swamping the game with promotional junk.\r\nThe whole game is just a sad pool of purely meta builds and of course, the biggest gacha mobile game of all time with more \"Pay for this, maybe!?\" popups than anything else in existence.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "well i cannot do a positive review because there are a paywall terrible, also very hard to summon legendaries, the only legendaries i got was by event, so i dont encourage to spend money in this game, game is good but i care about where other people spend or waste their money so NO....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seemed alright for 5ish minutes, but soon discovered to get best stage rewards, had to let the game play it's self. I don't like auto battlers.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just seems like a glop autobattler. Plus it has the atrocious mobile homescreen UI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game was just too overwhelming for me.  Too many things to try and do and I couldn't find any fun in it.  The battles were all too easy.  I couldn't find any reason to make a strategy.  I'm just smashing through everything and it got boring real quick.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THE DEV OF THIS GAME LIES TO YOU, THEY MAKE ADS WHERE YOU CAN ENTER THIS PROMO CODE, AND WHEN YOU DO IT, IT SAYS ONLY FOR NEW PLAYERS, AND THEY HAVE A 24 HOUR COOLDOWN ON PROMO CODES \n\nYES I KNOW IT ONLY SAY 0.1 HOURS BUT I USED TO PLAY IN ON THERE OWN CLIENT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "got lured in with a redeem code - (getalice) cant redeem it so I uninstalled",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool pop up ads simulator with gameplay in the background",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "how stupid some developers are today, making game without simple sign up\\login.....maybe there is after that bullshit part you need to play every time you install game on new device.\n\nJust avoid, its p2w anyway",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is not F2P friendly. As a F2P it will take you a while to get anywhere in the game. If you really want to achieve high rewards and returns then you will either need to spend weeks or months of grinding to max each characters as a F2P or P2W and get there instantly after a few MTX transactions. As a F2P you'll be instantly at a disadvantage against those who P2W and even more so against streamers who spend big money.\n\nBe careful about any of the promos that you take advantage of, you're only limited to 1 hero promo code per account. Any future promos that offer a hero as part of the bundle, you'll be instantly disqualified from redeeming said promo. It's sad because this is a missed opportunity for the devs to bring in more players and to also retain F2P players or hero collectors. Sure, you could argue that there is the merge feature but as a F2P, you'll only be able to complete half of the required merge and that would only be Rare and Epic hero merges, you can forget any higher rarity merges. The remainder is either P2W or down to chance which unfortunately, you would have better odds of being struck by lightning than obtaining the heroes you would need to complete the merge.\n\nOnce you've completed the main campaign, unless you're a P2W, the game becomes repetitive and boring because the game doesn't expand on the story whilst you complete the exact same campaign on a slightly higher difficulty - It simply ends and makes you repeat it all over again at a slightly higher difficulty than the last, with nothing to add. You can only get so far in dungeons before you hit a difficulty wall. You are then forced to either P2W or grind again to obtain the materials to forge Legendary weaponry/equipment, max each to 16, then obtain the necessary materials to add enchantments, ascend and improve your weaponry to max to progress - There are 9 slots that need to be taken into consideration. Then on top of that, you'll need to spend additional days/weeks grinding to get the applicable summoning crystals. If you're looking for a specific hero for your team/line-up to aid or improve synergy, you'll spend months or years trying to get it due to the randomness and poor rates from said crystals, making you have to repeat the whole process of obtaining crystal once again. Once you've got your chosen hero, you then need to max it, ascend it and add hero perks via scrolls - We're not talking grinding for a couple of days straight, the way the energy recharge is set up, it could take you weeks even months as a F2P just to get past the difficulty wall only to discover you hit the same wall at the next stage or a few stages later. This game really sets you up to be a P2W player -  By the time you've finished your grind, the dungeon has closed and you've lost all will to continue playing the game. Of course, you can P2W and skip all of this BS.\n\nAs a P2W it isn't all roses either, from the moment you open the game you have MTX offers rammed down your throat, trying to get more and more money from you and they're not cheap either. To get the line-up/team, equipment, hero perks and ascensions you'd need in the game to even compete with the ranking vs. other players, you'll need to spend a considerable amount of money. Honestly, it would be cheaper to save your money, hire freelancers and develop a competitor game than it would be to pour money into this game.\n\nVisually, the character models aren't great either - Sure, they're better than most games out there but you can tell that this is a port from mobile. There is no option to refine and scale up the graphics for the character models, the Ultra settings only affect the environment models and backgrounds if you're playing on PC. The female characters are hyper-sexualized, not to the scale of other games, so if you're sensitive to that kind of thing, then I wouldn't recommend it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A love/hate, abusive relationship (it adicts you)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont accept free gifts from this game, drainer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the worst casino you can imagine, run from this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "People still playing this pile of browser crap?",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "wont link game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "сидоростическая суета",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst Game in History of Gaming",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "credit card",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "why cant i just login through steam?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "TERRIBLE PSW",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "pay to play",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "garbage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "P2W",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "p2w but good game. \n\nRaid: Shadow Legends is still one of the best-looking gacha RPGs out there. The Champion designs and battle animations are top-notch, and the game keeps getting updates that add more content and quality-of-life improvements. The new mechanics in 2025, like the “Activate” effect and Faction Wars Hard mode, definitely make the gameplay deeper and more strategic.\n\nThat said, the difficulty curve has become very steep, and progressing without spending money can feel slow and grindy. Some of the new content is tuned for highly invested players, which might be frustrating if you prefer a more casual pace.\n\nOverall, Raid is a game that rewards patience and strategy. If you enjoy collecting heroes, optimizing teams, and tackling tough challenges, it’s worth playing. Just be ready for a grind—and a lot of offers trying to get you to spend.",
      "voted_up": false,
      "votes_helpful": 428
    },
    {
      "review": "DO NOT PLAY THIS GAME. At every turn, at every screen, this game wants your money. Constant pop-up's for extreme MACROtransactions. You will NEVER advance, NEVER get any good rewards without giving hundreds of dollars. For the price of just one of their scam deals, you can buy and own so, so, many good games here on Steam. You have been warned. Don't waste your life on this \"game\"",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "RAID: Shadow Bullshit is digital cancer. Uninspired, unoriginal, pay-to-win trash. The game everybody heard of (because of its atrocious ad campaigns and shills on YouTube), but nobody likes.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Games fun but DO NOT SPEND MONEY. The worst rates and worst bang for buck I've seen in a gacha. I don't recommend spending a dime because you are likely to be disappointed (like me).\n\nI started for the TMNT event and dropped some cash before realizing how much worse this one is than some of the gacha's I've played in the past. It's very, very predatory... you're constantly saying no to offers. That said, the underlying game if you can get past the marketing is really fun.\n\nAlso- if you want to have fun, you really have to spend. There's about a week of decent energy for new players, but once you go to full on free to play... you have to be very efficient. Every resource has a \"right\" time to spend it, otherwise it's a trap... same goes for deals in the shop if you spend- these are almost ALL traps. Especially for new players.\n\nThis is a product first, and a game second.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "gameplay is very lacking, as it is just clicking buttons and seeing SFX, not to mention the AUTOPLAY BUTTON. \r\nthe monetisation is worse, with payment screens and limited time purchases being thrown at you every time you beat a level. \r\nbeating a level does not feel rewarding in the slightest, only used to pad out playtime.\r\n\r\ni purely installed this game to see what it was like, and i did not have high expectations. i was still disappointed.\r\n\r\nonly good thing is DEATH KNIGHT LETS FUCKING GOOOOOOOO",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "LMAO raid shadow legends is literally botting a bunch of positive ratings.  There's a row of positive reviews that sound like ai written PR speak, all from private accounts with bans and generic profile pics, all with EXACTLY the same 14.2 hours of playtime.  They aren't even trying to hide it.  This mobile trash should be removed from steam.  Utterly ridiculous they allow games to do this kind of thing.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "A money pit buy buy buy pop ups 3 or 4 times in a row if you can put up with that it is playable if you play it long enough you learn to close them without even looking at them.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Graphics 8\r\nSound 6\r\nMechanics 7\r\nInterface 9\r\nVariety 10\r\nReplay 7\r\nSpend money:  Only if you are rich!\r\nNot a bad game and I do somewhat enjoy it but the RNG and F2P monetization is brutal.  I wanted something to play, not a second job that wanted me to pay them to work.\r\nWhile it's graphics are nice, you can see where they get lazy and just reskin the same old models.  Ever notice their hair, how it hovers over their back.  It's a lazy short cut so they can spend more time squeezing more from their cash shop.  That lazy reskin mind set pervades the game.  I don't mind F2P pop up here and there, a game has to make money, but good lord you will get a few dozen by the time you get to the 3 hour daily game expectation their rewards systems sets for you.\r\n\r\nIf you have a ton of spare time to waste or a fat wallet give the game a try.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "MAYBE ask me to link an account in the beginning so i can play with my mobile account. i had to log into a new one that you created on startup and delete the link to steam and connect to my opl account. If it doesnt work now, ill just delete again. horrible first impression",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This is a classic game of beating people up with your wallet.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Thought I'd give this game a try because I'm a fan of Alien and Predator and saw they had a crossover event happening. Thought maybe it'd be like $20 or something crazy for an event pass.\n\nIt's $60. \n\nLmao.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Obviously just a pay to win timesink game. It will do it's best to lure you in with deals, and promises while managing to try to pull the rug out from under you. See an add for Alice, get told to enter GETALICE, oh no, it's just for new players though the ad never mentions. Oh you joined a lil' late on a tournament? no dice, you can't get it. You are new to the game, but not new enough to earn rewards? you won't be able to summon the heroes you want. You will be forced to buy something to get even slightly anywhere and even then, you are likely to not get what you want. This game is only as good as the money or time you spend on it. Your time will be far better used on something else, and your money, well that's up to you. They certainly want it all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "RAID: Shadow Legends feels less like a game and more like a grind disguised as RPG. The repetitive missions, heavy reliance on micro‑transactions, and predictable “pay‑to‑win” progression make it hard to stay invested, fun only if you don’t mind shelling out or repeating the same loops over and over.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "pay to win game, if you have no money in you're bank account, good luck getting at least 2 Legendary champions without having to spend $19.99 or 44.99 to get at least one Sacred shard. the only way to get one champion is being a new new player, or an event we're you HAVE TO PLAY FOR 7 DAYS STRAIGHT to get one legendary.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The developers Plarium Global Ltd have been exposed for paying obscene amounts of money to Chinese bot farms to flood their Steam page with positive reviews.\n\nTerrible game, and Youtubers that take sponsorships for this are part of the problem. Great for people with the attention span of a goldfish, absolutely boring and underwhelming for everyone else.\n\nFull of microtransactions that will burn a hole in your wallet if you're dumb enough to actually buy them for this low effort Chinese mobile game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Take me back to when they made original cool champions instead of swamping the game with promotional junk.\r\nThe whole game is just a sad pool of purely meta builds and of course, the biggest gacha mobile game of all time with more \"Pay for this, maybe!?\" popups than anything else in existence.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "well i cannot do a positive review because there are a paywall terrible, also very hard to summon legendaries, the only legendaries i got was by event, so i dont encourage to spend money in this game, game is good but i care about where other people spend or waste their money so NO....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seemed alright for 5ish minutes, but soon discovered to get best stage rewards, had to let the game play it's self. I don't like auto battlers.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just seems like a glop autobattler. Plus it has the atrocious mobile homescreen UI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game was just too overwhelming for me.  Too many things to try and do and I couldn't find any fun in it.  The battles were all too easy.  I couldn't find any reason to make a strategy.  I'm just smashing through everything and it got boring real quick.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THE DEV OF THIS GAME LIES TO YOU, THEY MAKE ADS WHERE YOU CAN ENTER THIS PROMO CODE, AND WHEN YOU DO IT, IT SAYS ONLY FOR NEW PLAYERS, AND THEY HAVE A 24 HOUR COOLDOWN ON PROMO CODES \n\nYES I KNOW IT ONLY SAY 0.1 HOURS BUT I USED TO PLAY IN ON THERE OWN CLIENT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "got lured in with a redeem code - (getalice) cant redeem it so I uninstalled",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool pop up ads simulator with gameplay in the background",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "how stupid some developers are today, making game without simple sign up\\login.....maybe there is after that bullshit part you need to play every time you install game on new device.\n\nJust avoid, its p2w anyway",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is not F2P friendly. As a F2P it will take you a while to get anywhere in the game. If you really want to achieve high rewards and returns then you will either need to spend weeks or months of grinding to max each characters as a F2P or P2W and get there instantly after a few MTX transactions. As a F2P you'll be instantly at a disadvantage against those who P2W and even more so against streamers who spend big money.\n\nBe careful about any of the promos that you take advantage of, you're only limited to 1 hero promo code per account. Any future promos that offer a hero as part of the bundle, you'll be instantly disqualified from redeeming said promo. It's sad because this is a missed opportunity for the devs to bring in more players and to also retain F2P players or hero collectors. Sure, you could argue that there is the merge feature but as a F2P, you'll only be able to complete half of the required merge and that would only be Rare and Epic hero merges, you can forget any higher rarity merges. The remainder is either P2W or down to chance which unfortunately, you would have better odds of being struck by lightning than obtaining the heroes you would need to complete the merge.\n\nOnce you've completed the main campaign, unless you're a P2W, the game becomes repetitive and boring because the game doesn't expand on the story whilst you complete the exact same campaign on a slightly higher difficulty - It simply ends and makes you repeat it all over again at a slightly higher difficulty than the last, with nothing to add. You can only get so far in dungeons before you hit a difficulty wall. You are then forced to either P2W or grind again to obtain the materials to forge Legendary weaponry/equipment, max each to 16, then obtain the necessary materials to add enchantments, ascend and improve your weaponry to max to progress - There are 9 slots that need to be taken into consideration. Then on top of that, you'll need to spend additional days/weeks grinding to get the applicable summoning crystals. If you're looking for a specific hero for your team/line-up to aid or improve synergy, you'll spend months or years trying to get it due to the randomness and poor rates from said crystals, making you have to repeat the whole process of obtaining crystal once again. Once you've got your chosen hero, you then need to max it, ascend it and add hero perks via scrolls - We're not talking grinding for a couple of days straight, the way the energy recharge is set up, it could take you weeks even months as a F2P just to get past the difficulty wall only to discover you hit the same wall at the next stage or a few stages later. This game really sets you up to be a P2W player -  By the time you've finished your grind, the dungeon has closed and you've lost all will to continue playing the game. Of course, you can P2W and skip all of this BS.\n\nAs a P2W it isn't all roses either, from the moment you open the game you have MTX offers rammed down your throat, trying to get more and more money from you and they're not cheap either. To get the line-up/team, equipment, hero perks and ascensions you'd need in the game to even compete with the ranking vs. other players, you'll need to spend a considerable amount of money. Honestly, it would be cheaper to save your money, hire freelancers and develop a competitor game than it would be to pour money into this game.\n\nVisually, the character models aren't great either - Sure, they're better than most games out there but you can tell that this is a port from mobile. There is no option to refine and scale up the graphics for the character models, the Ultra settings only affect the environment models and backgrounds if you're playing on PC. The female characters are hyper-sexualized, not to the scale of other games, so if you're sensitive to that kind of thing, then I wouldn't recommend it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A love/hate, abusive relationship (it adicts you)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont accept free gifts from this game, drainer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the worst casino you can imagine, run from this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "People still playing this pile of browser crap?",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "wont link game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "сидоростическая суета",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst Game in History of Gaming",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "credit card",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "why cant i just login through steam?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "TERRIBLE PSW",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "pay to play",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "garbage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "P2W",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "p2w but good game. \n\nRaid: Shadow Legends is still one of the best-looking gacha RPGs out there. The Champion designs and battle animations are top-notch, and the game keeps getting updates that add more content and quality-of-life improvements. The new mechanics in 2025, like the “Activate” effect and Faction Wars Hard mode, definitely make the gameplay deeper and more strategic.\n\nThat said, the difficulty curve has become very steep, and progressing without spending money can feel slow and grindy. Some of the new content is tuned for highly invested players, which might be frustrating if you prefer a more casual pace.\n\nOverall, Raid is a game that rewards patience and strategy. If you enjoy collecting heroes, optimizing teams, and tackling tough challenges, it’s worth playing. Just be ready for a grind—and a lot of offers trying to get you to spend.",
      "voted_up": false,
      "votes_helpful": 428
    },
    {
      "review": "DO NOT PLAY THIS GAME. At every turn, at every screen, this game wants your money. Constant pop-up's for extreme MACROtransactions. You will NEVER advance, NEVER get any good rewards without giving hundreds of dollars. For the price of just one of their scam deals, you can buy and own so, so, many good games here on Steam. You have been warned. Don't waste your life on this \"game\"",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "RAID: Shadow Bullshit is digital cancer. Uninspired, unoriginal, pay-to-win trash. The game everybody heard of (because of its atrocious ad campaigns and shills on YouTube), but nobody likes.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Games fun but DO NOT SPEND MONEY. The worst rates and worst bang for buck I've seen in a gacha. I don't recommend spending a dime because you are likely to be disappointed (like me).\n\nI started for the TMNT event and dropped some cash before realizing how much worse this one is than some of the gacha's I've played in the past. It's very, very predatory... you're constantly saying no to offers. That said, the underlying game if you can get past the marketing is really fun.\n\nAlso- if you want to have fun, you really have to spend. There's about a week of decent energy for new players, but once you go to full on free to play... you have to be very efficient. Every resource has a \"right\" time to spend it, otherwise it's a trap... same goes for deals in the shop if you spend- these are almost ALL traps. Especially for new players.\n\nThis is a product first, and a game second.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "gameplay is very lacking, as it is just clicking buttons and seeing SFX, not to mention the AUTOPLAY BUTTON. \r\nthe monetisation is worse, with payment screens and limited time purchases being thrown at you every time you beat a level. \r\nbeating a level does not feel rewarding in the slightest, only used to pad out playtime.\r\n\r\ni purely installed this game to see what it was like, and i did not have high expectations. i was still disappointed.\r\n\r\nonly good thing is DEATH KNIGHT LETS FUCKING GOOOOOOOO",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "LMAO raid shadow legends is literally botting a bunch of positive ratings.  There's a row of positive reviews that sound like ai written PR speak, all from private accounts with bans and generic profile pics, all with EXACTLY the same 14.2 hours of playtime.  They aren't even trying to hide it.  This mobile trash should be removed from steam.  Utterly ridiculous they allow games to do this kind of thing.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "A money pit buy buy buy pop ups 3 or 4 times in a row if you can put up with that it is playable if you play it long enough you learn to close them without even looking at them.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Graphics 8\r\nSound 6\r\nMechanics 7\r\nInterface 9\r\nVariety 10\r\nReplay 7\r\nSpend money:  Only if you are rich!\r\nNot a bad game and I do somewhat enjoy it but the RNG and F2P monetization is brutal.  I wanted something to play, not a second job that wanted me to pay them to work.\r\nWhile it's graphics are nice, you can see where they get lazy and just reskin the same old models.  Ever notice their hair, how it hovers over their back.  It's a lazy short cut so they can spend more time squeezing more from their cash shop.  That lazy reskin mind set pervades the game.  I don't mind F2P pop up here and there, a game has to make money, but good lord you will get a few dozen by the time you get to the 3 hour daily game expectation their rewards systems sets for you.\r\n\r\nIf you have a ton of spare time to waste or a fat wallet give the game a try.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "MAYBE ask me to link an account in the beginning so i can play with my mobile account. i had to log into a new one that you created on startup and delete the link to steam and connect to my opl account. If it doesnt work now, ill just delete again. horrible first impression",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This is a classic game of beating people up with your wallet.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Thought I'd give this game a try because I'm a fan of Alien and Predator and saw they had a crossover event happening. Thought maybe it'd be like $20 or something crazy for an event pass.\n\nIt's $60. \n\nLmao.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Obviously just a pay to win timesink game. It will do it's best to lure you in with deals, and promises while managing to try to pull the rug out from under you. See an add for Alice, get told to enter GETALICE, oh no, it's just for new players though the ad never mentions. Oh you joined a lil' late on a tournament? no dice, you can't get it. You are new to the game, but not new enough to earn rewards? you won't be able to summon the heroes you want. You will be forced to buy something to get even slightly anywhere and even then, you are likely to not get what you want. This game is only as good as the money or time you spend on it. Your time will be far better used on something else, and your money, well that's up to you. They certainly want it all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "RAID: Shadow Legends feels less like a game and more like a grind disguised as RPG. The repetitive missions, heavy reliance on micro‑transactions, and predictable “pay‑to‑win” progression make it hard to stay invested, fun only if you don’t mind shelling out or repeating the same loops over and over.",
      "voted_up": false,
      "votes_helpful": 8
    }
  ]
}