{
  "positive": [
    {
      "review": "Start new game.\r\n>running for life from bandits\r\n>run into dinosaur\r\n>eaten alive\r\n\r\nStart new game.\r\n>ooh, I might be able to hide in this foggy area\r\n>oh god, there's so many of them\r\n>tied to stake\r\n>eaten alive\r\n\r\nStart new game.\r\n>me and doggy pal find town\r\n>guards search my empty pockets\r\n>everyone insults me\r\n>can't afford food\r\n>so hungry\r\n>try to steal\r\n>caught, beaten up, jailed\r\n>serve my sentence then starve to death in the desert\r\n\r\nStart new game.\r\n>spawn in desert\r\n>beaten unconscious by starving bandits\r\n>almost immediately enslaved\r\n>slowly get stronger in slave camp\r\n>finally escape\r\n>anti-slaver camp helps me\r\n>never stop training\r\n>beat down, but always get back up\r\n>eventually return to slavers\r\n> kill their emperor\r\n\r\nBest. Game. Ever.\r\n\r\nGame is a little janky sometimes, but I've never found anything like it. I'm in love. Tends to be grouped with Project Zomboid and Rimworld.",
      "voted_up": true,
      "votes_helpful": 124
    },
    {
      "review": "bought the game and woke up a month later with 250 hours in game time",
      "voted_up": true,
      "votes_helpful": 100
    },
    {
      "review": "The Early Game: Also Known As “Your Villain Origin Story”\r\n\r\nYou start as a guy who looks like he hasn’t eaten since the tutorial, wearing clothes that protect you from absolutely nothing.\r\nYour first fight? You lose it.\r\nYour second fight? You lose it harder.\r\nYour third fight? You’re unconscious before the enemies even reach you.\r\n\r\nAnd the game just stands there, watching, whispering:\r\n“Get up, loser. We’re not done.”\r\n\r\nLearning Skills by Suffering\r\n\r\nIn any normal RPG, you level up by doing cool things.\r\nIn Kenshi, you level up by:\r\n\r\nRunning away from every living creature → Athletics +3\r\n\r\nGetting punched in the throat → Toughness +5\r\n\r\nCarrying your unconscious friends around like gym bags → Strength +10\r\n\r\nSneaking → Actually no, you got caught, get up idiot\r\n\r\nIt’s a game that genuinely believes in character development through trauma.\r\n\r\nCompanions: The Real Burden of Leadership\r\n\r\nYou can recruit people!\r\nBut be warned: they are just as stupid as you.\r\n\r\nTell someone to guard the base? They’ll wander off to punch a gorilla.\r\nTell someone to stay inside? They’ll open the door to say hi to the bandits.\r\n\r\nNothing in this world fears death, and it shows.\r\n\r\nBase Building: Where Hope Goes to Die\r\n\r\nYou dream of building a thriving settlement.\r\nWhat you actually build is:\r\n\r\nA crooked wall\r\n\r\nA door that opens backwards\r\n\r\nFarms that produce depression instead of food\r\n\r\nA graveyard you add to every 45 minutes\r\n\r\nAnd just when you’re feeling proud, 40 bandits show up demanding “all your money and maybe a kidney.”\r\n\r\nCombat: The Floor Is Your Best Friend\r\n\r\nCombat in Kenshi is deep. Tactical. Complex.\r\nBut most of the time, you’re lying on the ground watching your teammates get folded like laundry.\r\n\r\nIt’s fine, though. Being unconscious is basically the game’s version of a coffee break.\r\n\r\nThe Kenshi Experience in One Line\r\n\r\nYou start the game as prey, and after 80 hours, you finally become… slightly less edible.\r\n\r\nFinal Verdict\r\n\r\nKenshi is hard. It’s brutal. It’s unfair.\r\nBut once you accept that the world hates you and everything wants to kill you, it becomes one of the most strangely peaceful games ever made.\r\n\r\n10/10.\r\nWould get enslaved again.",
      "voted_up": true,
      "votes_helpful": 69
    },
    {
      "review": "Great game, still no idea what i should be doing but honestly I'm making my way and that's all that matters",
      "voted_up": true,
      "votes_helpful": 41
    },
    {
      "review": "I don't have to say much. If you are someone that would get into a game like Kenshi, then you know why this game rules your face so hard. I would recommend this game full price or on sale.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "In my first 40 hours I got beaten up by hungry bandits, chased by cannibals, and almost gotten eaten alive. After some exploring I then ran into a new faction city. I then looked at a holy priest seductively and was charged with assault and terrorism by the holy nation. also I got kicked out of the bar because of my skin color. \n\nfun game.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "70% of my runs have consisted of spawning in, at least 5 slave traders bee-lining to me, spending about one hour in a slave camp, escape, just to go back for the next two. 10/10 experience.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "One of the greatest games of all time. Nothing comes remotely close to Kenshi. This game is pure gas. When Kenshi 2 comes out in 2080, you'll never see me again.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Not enough content for the price, barely even played it.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Run Forrest! RUN! Well, that pretty much resumes the game main focus.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "One of the most unique games I've ever played, there's really nothing to even compare it to.\nBut I will for the sake of people who read the \"open world sandbox survival RPG\" tags in the store page and go on with their day skipping this.\n\n[h3]Elder Scrolls?[/h3]\nSo imagine playing Morrowind, but the combat is not buttcheeks.\nOkay now change the perspective to top down and movement to point & click.\nFights are hard? How about recruiting another person? Now you control two \"protagonists\", each with their own inventory to manage.\n\n[h3]Hunger[/h3]\nOh shoot they need to eat? Yes, hunger is a game mechanic here.\nIt's up to you how you go about acquiring food - you can hunt, buy or steal it.\nWant to add a hunter/thief to the team to deal with that? You can.\nWant to just build a farm that grows the food? You can, but now the game is an RTS.\nwait what\n\n[h3]RTS?[/h3]\nYes, building a base attracts all sorts of bandits that want your food too.\nAnd any enemies you make along the way will send attacks as well.\n[i]\"What if I don't care about this food and base thing, I just wanna run around and kill some dudes\"[/i]\nBelieve it or not, you can.\nSimply pick a robot as the starting race and now you can focus on fighting and exploring. \nRobots (skeleton race) don't need food to survive.\nBut be aware that some towns really don't like robots.\n\n[h3]Freedom[/h3]\n[i]\"Oh yeah? I'm gonna wipe those towns off the map\"[/i]\nHere's the thing... you can.\nThere are no \"essential\" NPCs and every character can be killed.\nNot without consequences of course, be ready for bounty hunters.\n\n[h3]Leveling up & Skills[/h3]\nYour skills get better based on what you do, there is no assigning points after leveling up.\nWant higher movement speed? Run a lot.\nBe more stealthy? Sneak around.\nWant to be tougher? Fight stronger enemies, lose fights.\nUnsure which weapon to use? Just use your fists and you'll become Bruce Lee eventually.\n[spoiler]I'm not even kidding, you can take down entire armored platoons with a high martial arts level\n[/spoiler]\n\n[h3]Pace[/h3]\nI say eventually because progressing and becoming stronger is... not fast.\nIt's a slow game, so make sure you're in the right mindset before playing. \nThere is an option to crank the game speed to x3 for the more boring tasks like mining/crafting & travelling long distances.\n\n[h3]Jank[/h3]\nAnother potential hurdle is jank. The game, to put plainly, is not polished. \nIt was developed by one guy and it shows - characters get stuck, visual glitches and stutters.\nPersonally I enjoyed the gameplay loop enough to overlook those issues.\nI recommend capping the game at 60 FPS and applying some form of frame gen for smoothness.\n\n[h3]Conclusion[/h3]\nTo sum up, the amount of freedom Kenshi gives you simply cannot be compared to the sandbox \"freedom\" of your Skyrims, your GTAs, your Minecrafts, your Witchers or your Elden Rings.\nOnly Rimworld comes to mind as the closest example to a game that lets you do what you want.\nThere is lore, there are characters you meet that have interesting stories to tell.\nBut there are no credits at the end because you're the one deciding the goal.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best way to describe Kenshi is to say it feels like the child of a toxic marriage between The Sims and Dark Souls. You control one (or several) characters who have absolutely no combat skill in a vast sandbox world filled with interesting stories and a world that clearly doesn’t love you. Half the time, you feel great about the progress you’re making; the other half, you’re lying unconscious on the ground after losing a fight, waiting for your character to recover.\n\nThe game also has a spectacular modding community that greatly enhances the experience. Combat animations are surprisingly satisfying, and the world itself is genuinely interesting to explore and interact with - every character can be defeated, kidnapped, or killed, including yours.\n\nFor example, I once created a character who started as a slave. I learned how to sneak, knock out guards, steal their clothes, and escape the mines. After a long struggle, I found a small shack with food and basic supplies, which i found pretty immersive. It’s also worth mentioning that the building system is deeper and more enjoyable than it first appears, even if it can be a bit frustrating at times.\n\nPersonally, I had a lot of fun with the game, but I have to admit it involves a heavy amount of grind - leveling skills takes time and often requires tedious repetition. The game also suffers from performance issues, including occasional crashes.\n\nMy biggest disappointment came when I tried playing with a party of four characters. They just stand next to each other doing nothing unless you manually assign every task. I think the game would be far more immersive if it relied more confidently on AI to help manage (or at least give life to) your characters. I’d love to set up a camp at night and see them interact naturally.\n\nOverall, it’s a great game, and I’m excited to see what Kenshi 2 will bring.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of my favorite games of all time. Its difficult but it feels so rewarding to make progress. Your characters get tougher by getting their asses kick. As long as your guy can get back up you make progress, so if you take risks you are rewarded. I start new playthroughs all the time just for the early game. I love the feeling of transitioning from playing an RPG to a RTS so seamlessly. You can go from a starving jobber into a fortress of demigods who produce their own food and gear, even making a profit with trading goods. I will warn you that it is extremely janky. It WILL crash(if the crash log says OGRE EXCEPTION you're just cooked, save often). Guys WILL somehow be on top of your walls killing your gunners even if they physically shouldn't be able to, if they don't phase past your walls altogether. It is the worst feeling in the world when you have built this great citadel with a kill corridor manned by dozens of gunners, only for you to see an army of racists materialize in the center of town because their AI tells them to stand at the gate, but the gate isn't rendered if your looking at your expeditionary squad across the map, so they go to the center of your build. By the way, you WILL be raided constantly if  you make a lot of enemies or if you settle in the wrong place, which could be an opportunity if they didn't bypass your defenses, but you can make alliances with most factions. Allied factions will come to help, but if they happen to not like each-other they'll both fight. Worst of all, regardless of anything, if you have people behind your gate or that want to come in because the trading caravan's leader teleported inside and their coded to follow them, they'll keep attacking your gate, AND THEY WON'T STOP UNLESS YOU OPEN THE GATE, which could let in a HERD OF ANIMALS THAT CAN RUN 32MPH, and whatever hostiles that happen to be nearby. So your stuck between forgoing allies and fighting against wall-phasing bullshit alone, or gate-smashing bullshit that will last forever. The worst part is I don't think you can really do anything to stop any of it you can only lessen it. Some mods help but not really. Don't make your base too big. if anyone has some way to deal with this dear god please help me. Anyway this is definitely the best game of all time sincerely. Its not even close you really should try it there's nothing like it. Looking forward to Kenshi 2. To end on a positive note, the IMPORT GAME option is cool it resets the world and you can choose to keep your stuff so if you add mods mid-save you don't have to lose anything. It even lets you undo the deaths of important NPCs like faction leaders or Beep. He tends to get devoured by fogmen.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "HIGHLY Recommend using the tutorial for first time players and though i would encourage avoiding looking things up online, there's no shame in doing that with this game.\r\n\r\nyou will die very quickly if not careful, but that makes it all the more satisfying when you figure things out a pull through.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Into immersive RPGs or open worlds or emergent storytelling? then yea buy it now without hesitation. Kenshi is a great mystery: why aren't there myriad games out there just like it? why no copycats? you will play this and then you will then search for games like it and find none... zero, zilch, and it will boggle your mind. Make no mistake this is a work of art. Buy it and mod the heck out of it and you will fall deeply into a world you won't be able to pull yourself away from. There are multiple systems here wrapped up into one, almost entirely different games at different moments and so I will offer some advice to new players - You will want to start a settlement, you will want to recruit an entire army and turn your settlement into a self sufficient and bussling city (all of which are entirely possible.) WAIT. Once you cross that threshold the game itself changes, your priority changes, and by the nature of it all you will miss out on a large chunk of what the game actually has on offer. Start small, stay small, adventure and travel and roleplay. Go to each corner of the map and see every city and struggle small, maybe even solo; Maybe just you and an animal or companion. Experience all you can that way first and when you have rung that sponge dry THEN settle and build and it will be like an entirely new game and it will have allowed you to experience Kenshi for ALL that is.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Got it a while back, tried it and my adhd brain was like nah major overload. Opened it up recently on a whim and immediately got lost in it for 8 hours without realising. Can't stop, don't wanna stop and all I've been doing is mining copper with one arm in the desert while periodically running away from lovely folks that want my supple flesh and big crab things. 11/10 would recommend, this game is off it's head!! and now I hate myself that litle bit more for letting it waste away with the others in my library for a while. :(",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "absolute peak, have patience and your in for one of the best games ever made",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game found a special place in my heart. From the moment I started playing, I knew it was going to be my go-to game on rainy days. Kenshi has everything you could want in a great RPG: intriguing world-building and history, interesting characters with unique personalities, and the freedom to create whoever or whatever you'd like. The map is full of places to explore, and the best part is that nothing stops you from going anywhere or doing anything. Want to start a prospering colony? You can. Want to become a treasure or bounty hunter? Go for it.\n\nFor me personally, the atmosphere of the game gives me Dune/Fallout vibes, both of which I greatly love. So I would highly recommend it to anyone with similar interests.\n\nWith all that said, there's one particular thing I've come to value very much and haven't seen in many other games: the incredible amount of freedom to adjust the game to your liking. To name a few examples, there's a built-in world editor that lets you change anything you don't like, the FCS modding tool, which allows you to create your own mods or even merge characters from two different saves and play with both of them at the same time. The last one is something I've especially grown fond of.\n\nIf I had to mention one downside, it would be the amount of time I've spent playing it. But I don't regret a single minute.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "this is the only game i will ever spend money on merch its so peak\r\n\r\nhard 8/10\r\nfun 10/10\r\ngameplay loop 10/10\r\nhardware requirements 6/10 you need a pretty good computer after playing one save for 20+ hours\r\n(not a big deal)\r\ncommunity 8/10 the gooning is the only bad part about the community\r\n(once again not a big deal)\r\n\r\nover all 9.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Without doubt, one of my absolute favourite games, especially with some mods thrown in.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game I have ever played. It is intense, it requires persistence and a very long time to comprehend the mechanics. You should definitely try this game out and do your best to persist with it over time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In most RPGs, you are the chosen one. A hero of destiny. The Dragonborn. The world revolves around you, not in Kenshi. In Kenshi, you are a malnourished, illiterate amnesiac with one arm, no pants, and a 500 cat bounty on your head for simply existing. You are not the hero. You are not the chosen one. You are, at best, a free meal for a pack of cannibals.\n\nKenshi is not a video game. It's a Getting Kicked in the Groin simulator. The character creator lets you spend an hour designing your perfect martial artist, who will then spawn into the world and be immediately beaten into a coma by a hungry bandit who wants your single, stale bread roll.\n\n\nThe core gameplay loop of Kenshi is failing upward. You get stronger by getting your ass kicked. You learn to fight by losing fights. You learn to be a doctor by frantically trying to bandage a teammate who is bleeding from 14 different wounds at once. You learn to be a thief by getting caught, thrown in jail, and then spending three days picking the lock on your own cage while a guard periodically clubs you for fun.\n\n\n\nLet's talk about the Beak Things. They look like a blind giraffe was cross-bred with a velociraptor and a wood chipper. They run faster than an Olympic sprinter, they hit like a freight train, and they will, without exception, eat your entire squad alive, starting with the legs.\n\n\n\nOh, the limb system! This is the best part. Losing a leg in Kenshi isn't a Game Over. It's an opportunity. Why keep that useless, fleshy leg when you can replace it with a high-grade, industrial-strength  robot leg that lets you run at 50 mph and kick a slaver's head clean off his shoulders? This is the only game in history where you will actively cheer when your main character's arm gets lopped off, because you've been saving up for a sweet new robot one.\n\nThe game is ugly. Let's be honest. It looks like a PlayStation 2 game that was microwaved. The UI was designed by a madman. But it doesn't matter.\n\nYou're not here for the graphics. You're here for the stories. You're here to build a fortress in the middle of nowhere, crewed entirely by one-armed skeletons who grow cactus rum, just to spite the Holy Nation. You're here to find a weird, screaming robot named Beep who thinks he's a human and train him into the single greatest swordsman the wasteland has ever known. You're here to fail, to suffer, to lose, and to eventually, after 300 hours, become a slightly-less-pathetic-than-average warlord.\n\nIt's not a game. It's an anecdote generator. An engine for hilarious, brutal, and unforgettable failure.\n\n10/10. Would spend 8 hours enslaved just to become a parapaligic again.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Kenshi is a sandbox RPG that delivers a demanding and systems-driven experience with minimal guidance. The game drops you into an indifferent world where survival depends on observation, planning, and slow skill growth. This structure creates a steady sense of earned progress rather than scripted advancement.\n\nIts visual style is sparse but functional. Environments feel harsh and open, which matches the tone of the setting. The interface is utilitarian and prioritizes information density over aesthetics, keeping the focus on management and positioning.\n\nGameplay centers on squad control, long-term progression, and logistical planning. Characters improve through use rather than levels, which makes every task a long investment. Combat is slow and punishing. Success comes from preparation and smart retreat rather than direct confrontation.\n\nThe world simulation is the core strength. Factions operate independently, towns shift over time, and events unfold without player intervention. This creates a sense of persistence and scale uncommon in similar titles.\n\nStorytelling is emergent. There is no central narrative; instead, player actions generate personal stories through survival, defeat, and rebuilding. This structure demands patience but offers unusual freedom.\n\nPerformance varies by location and squad size, yet remains stable enough for long sessions. Load times and pathfinding are imperfect but manageable given the scope of simulation.\n\nOverall Kenshi is a methodical and unforgiving sandbox for players who value autonomy and systemic depth. It avoids cinematic design and instead provides a world that reacts, resists, and occasionally rewards persistence.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very nuanced but very interesting, it's certainly hard to get into but not hard to enjoy for sure putting this on my backlog.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ABSOLUTE CINEMA! 10 out of 10 game. \n\nStarted game - Got attacked by starving bandits. Beat the bandits arses. Then met a shek woman who wanted to join me. So i let her join me ... She got jumped by swamp gangs in the swamps when i went to get drugs ... Lost 2 million cats worth of drugs. \n\nEventually set up a drug lab in the marshes. Befriended the hounds gang, Got attacked by Red Sabers, Hounds came to my rescue. Love the hounds absolute units. Started selling hella amount of goods to the hounds at a discount so they can secure my \"shipments\" too other cities. Made millions and millions and used the money to fund a drug peddler army. Took over the swamps and placed all the swamp gang leaders in jail cells. \n\nFast forward some time now and i have ran into the united cities, Hated them from the get-go for their \"no drugs\" law ... Kinda lame bruh Kush is good for you. Give it a try ( in game of course ) ... Met Rebel farmers leader and sided with rebel farmers, Used the farmers to overthrow the united cities. Handed each city ONE BY ONE too the rebel farmers ... Now United Cities allow me to sell my drugs freely in their land. Rebel farmers are the goats Love the rebel farmers. \n\nThat is all ... Just a fun sandbox game. Can't wait for Kenshi 2. Going to be a better experience for sure.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Kenshi is one of those games that sticks with you long after you stop playing. You don’t start as a hero, you don’t get a safety net, and the game doesn’t pretend to care about your plans. You just wake up in this strange, broken world and try to make sense of it with whatever you can scrape together.\r\n\r\nMost of the best moments aren’t scripted at all. You might build a tiny outpost that barely holds together, drag an unconscious friend across half the desert, or get chased by creatures you didn’t even know existed. Half the time you’re improvising, the other half you’re laughing at the mess you’ve created.\r\n\r\nIt’s rough, unfair, and absolutely unforgettable. Kenshi doesn’t guide you, and that’s exactly why the stories you end up with feel genuinely yours.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely LOVE this game, but I know people who don't. I think if you watch a few videos on youtube, you'll very quickly be able to determine which camp you belong in.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After a battle, limbs tend to roll around. Folks' limbs make good dog food.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly very good game, But for me who dont like building base and mostly explore,\r\nit get boring after a while.\r\ni hope there were some quests. but still good game and i like it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I dont think ive written a review before; doubtful. I have over 3000 logged hours of games played and thats just on steam. If there is anything i can say, its buy kenshi.\n\nGraduation, college, A marriage, a child, a new life, a new beginning. All this and kenshi still brings me home. A literally massive world. Not just large, but living. I dont care about the advancements of ai, i dont care about graphics or bullshit systems. This isnt a damn game its an ecosystem. From cannibal plains to mysterious wastelands full of oil and tar. Fishmen warriors hungry to impress or skeleton cultists hoping for a purpose. There will never be a moment in this life that you dont feel. I dont compare this to another game but to life. When was the last time you felt your blood pump? When did you last eat well? Find the strength within yourself to get past the gruel. Staunch the bleeding and wake the fuck up samurai. You wont regret this purchase. I would challenge that you would only find it unenjoyable if you were truly of the simplest quality. Have some complexity to your life. This isnt an add i bought this shit full price when i was 19 and im 26 now. GET IT please litearlly dm me if i havent convinced you",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think this is one of those games that really just feels unique. It's crazy that an indy developer made such a massive open world game so well. With the sales these days I think it's definitely worth trying even if you're just on the fence since it's such a different experience than any other game you've probably played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Kenshi is indeed a phenomenal game, It WILL chew you up and spit you out... multiple times... and you will love it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great way of portraying \"hey, your a homeless man living in an outhouse, go try and beat a several thousand year old empire-creator with a pipe and a brick of coke\"\r\n\r\nseriously though, very interesting dynamics in the armor & weapons, and really interesting lore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so i coulda bought and played the best game ever made at any point for cheap and just decided not to because...?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is the richest, deepest, most engaging RPG ever made if you're patient enough to both figure it out and look past some of the (admittedly charming at times) clunkiness.\r\n\r\nmods fix that latter part if it bothers you, many of them officially endorsed.\r\n\r\nif Kenshi is the prototype, Kenshi 2 will be a masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vast, beautiful, intriguing, rewarding... but most of all, punishing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Janky game, dogdick pathfinding but I still really like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bad graphism but damn one of the best game, if not the best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best top-down survival games I've ever played. I love that you are just another character, nobody special, until you make your character(s) special. I am on my 5th playthrough, and starting at Rock Bottom this time; I think I have made the most progress on this playthrough. I managed to build a trade outpost in the middle of the desert that's constantly attacked by slavers, ninjas, and skimmers; it is a peaceful existence...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Onw of the best sandboxes out there. You can roleplay virtually anything, from a company of settlers to a deadly stealth assassin / bounty hunter. With mods like Reactive World you can even have actual impact of the complex world out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once rambled about it being the best game ever to a woman for 45 minutes, she now fears hearing the word Kenshi in my presence. Great game, mod friendly, easy to lose too many hours in 10/10\nChris Hunt I hope development is going well XOXO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is hard at start i had to die like 100 times before learning how to play after learning how to play it becomes fun it might not seem fun at the start but after you learn how to play and do stuff it is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Que decirte...es complicada la relacion con Kenshi...tengo 300 horas en el juego pero es dificil...muy dificil...tenes que tener ganas de verdad de jugar un juego de superviviencia...lo de armar una \"base\" nunca me funciono, siempre terminas siendo un nomada y fajando gente. Igual, lo recomiendo al juego...y cuando salga kenshi dos...seguro lo termino jugando tambien :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Used to play this on my dads sh#tty computer way back in 2019. Still the same odd citybuilder/rpg that I remember falling in love with way back then. This game is not forgiving, you will lose numerous times, but each time you learn something new and learn how to go about things. You are not special, you aren't some overpowered hero that slays their way through the post apocalyptic wasteland. You are a normal person, scrappy, starving, and trying to survive. I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Endless possibilities..... Unlike any other game, work of art.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been hatecrimed, eaten alive, had all my food stolen, or entirely ignored by practically every savage tribe in existence, most major factions, and 36+ hours in I am STILL having a ball.\r\n\r\n10/10, would get eaten by Fogmen swarms again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the best (if not the best) games I've ever played. After playing Kenshi I realised how overrated were some of the more fameous titles I've been playing. Gameplay is difficult and the game itself is unlike any other but that's what makes it so good and unique. At first glance I was a bit sceptical because the game seemed to be \"not for everyone\" type but after understanding the mechanics and basics of gameplay I had fell in love with it so badly it almost cost me two failed semesters lol. The massive amount of mods is also a big plus but beside that the devs are constantly in touch with the community and they are people who actually have some respect for those who play their game unlike some other folks who would just grab your money and run away with it leaving you with a buggy and half-finished product. In other words it's a great game for those who are ready for a challange and adventure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, never played anything like this. If you are in a game hole I cannot recommend Kenshi enough. I have no clue how I have not heard of this game or what hole I've been in until 2025 but thanks Gabe for putting it on sale and recommending me this. Kenshi is worth the full price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, get the shit beat out of you for 20 hours then crawl across the desert",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "god i love this game so much. please, if you WANT to play this game, GET IT! You have SO MUCH POTENTIAL HERE!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very steep on the learning curve but it's a heck of a story generator",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What I Liked:\n⦁\ta truly unique experience\n⦁\tlearning that losing, can indeed be fun\n⦁\ta true open-world sandbox, even after all the characters under your control are lost, the \"world\" still continues\n⦁\tso much to discover whether through exploration, mechanics, or lore\n⦁\tmods and the game editor can shape the game in so many different ways\n\nWhat I Didn’t Like:\n⦁\toccasionally buggy\n⦁\tcan be directionless, the impetus is on the player to decide what to do next",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is incredible, the perfect podcast companion game, true sandbox\r\nloving it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A world that spits you up and eats you again. You don't play the hero, or the villain; You're just trying to get by. Maybe lose a limb or two.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has been out since 2018, i was unaware it was just in wait for me, its perfect for any off the cuff, strategy rpg enjoyers. This game is unique, feeling like a mix of warzone 2100 and bladurs gate. i know thats a weird description. but its what i got.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game brings me back in no matter what. I searched for a journey like this for a while and no game scratches the itch. Freedom like no other in a world that doesn't care.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest games ever. Brutal and unforgiving, a game with consequences.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ive played, i have one squad who im making build their own dug empire, and my other squad is enslaved in rebirth and im gathering men to plan an escape from slavery to enjoy their new lives in my drug empire;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best survival and sandbox games i've ever played. Many times exceeds the quality. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Быть в рабстве иногда прекрасней, чем быть свободным, там хотя бы кормят и лечат, и если дядю слушать, то даже впятером не поколотят",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "starting from the bottom simulator couldn't be more fun!\n\nplus tons of mod support makes me want to leave my job, wife, and kids behind to play more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kenshi is my favorite game.\n\nIt is a large prebuilt explorable sandbox world where you create your own story through your adventure. The game has a one of a kind atmosphere, and a large amount of freedom. You can be a trader, bandit, war band, explorer, shop, settlement, rebellion, thief, drug smuggler, hunter, bounty hunter, liberator, and more. You train your characters by doing the actions you want them to be good at, even getting beaten up you can train to get good at. You can automate jobs and actions of your squad members to keep them productive even when you aren't micromanaging. \n\nThe game has a very unique world (Moon?) with hidden lore, ancient history, unique races, feuds and more, half of it lost and more for you to find. The game world itself is chock full of unique and wonderous fantastical locations, some even completely uninhabitable or horrifying, to say without spoiling the adventure.\n\nThere are unique bosses, characters and factions, some you can recruit, ally with or destroy, with unique world states to account for these actions.\n\nFor gameplay, you control the camera and often will zoom out quite far to select actions and jobs for your squad members, you do not directly control a character's actions movement, instead selecting where they move, who they follow or what jobs they do. Or, who they attack or steal from. You spectate your squad in battle, or you can select and micromanage specific members/squads to position.\n\nThe game is buggy, feels poorly optimized, pauses to load often, is janky as all hell, and looks 'ugly' in the way games of the past did. \n\nThe game, in Vanilla, is janky as hell, people get stuck in walls, can't path correctly, buildings and saves can get corrupted, it is poorly optimized to use your CPU... If your people are stuck, try picking them up in game, then drop them. As long as you can reach them, that is an easy fix. \n\nIf you can't reach them? When you reload your save, select a character of yours in an open space, then select 'reload squad positions' and it will teleport all of your squad to that location and fix that. \n\nPathing errors and general bugginess? Press \"Shift\" + \"F11\" and it will do a general in-game fix and let you know which parts of the save it fixed.\n\nIf your world feels corrupted, keeps crashing, or something is just ruined? Try Importing your save to a new world. If that world crashes, import less parts of your save to try to save what you can.\n\nAll of those are in-game solutions to help deal with the jankiness, which I wish so many other jankier games of the past I've played would have! Here, you have these options.\n\nKenshi is not the perfect, do anything game. It is a diamond in the rough, and if you are willing to engage with it's systems and learn, you have so many hours of unique experiences to find. I have never found a game with the same level of freedom. \n\nAlso? The game has a flourishing mod scene. It's great unmodded, but if you want to spice things up down the line? I can say there are loads of great additions to customize your experience right here in the Steam Workshop, easy to Subscribe and play with. Now, if you aren't careful you can make your game a lot less stable doing this, but if you know what you are doing, have at it!\n\nAll in all? Kenshi, to me is a one of a kind unique, diamond in the rough sandbox and squad management game where you can experience unique stories of your own creation through gameplay, as long as you are willing to work through the jankiness of the game. It has a bit of a learning curve, due to an excessive amount of freedom of options in game, but you are not required to interact with all of the game's systems, you are only given a world to play in as you see fit!\n\nThe art style and OST are beautiful, the graphics are quite dated. I highly recommend giving the game a try, of course because it is my favorite game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Steep initial learning curve but once you understand the mechanics it's an absolute blast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got beaten up again and again to get strong until i can kidnap faction leaders to store them in my \"collection\"\n100% would recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't know why i never wrote a review for this game. \n\nIt's one of my favorite games of all time\n\nPros\n- Characters level up individual skills as they practice them\n- Interesting mix of strategy, simulation, and role-playing game(the combat is sorta turn-based, where the units have their own \"cooldowns\" before they attack, though you don't pick who they attack)\n- Lots to discover, very unique settlements and creatures throughout the world, the world is very interesting and unique as well\n- Quite challenging, especially when you're just learning how to play. \n- Various ways to play, you can go it solo, recruit a few guys, recruit a whole big camp, you can stealth it, or go straight up tank. You can be a nomad, wandering throughout the world, or establish a base and fortify it. The game essentially has some minor \"tower defense\" aspects to it, you can even make paths that enemies have to run through with towers that shoot down on them. Also WHERE you build you base can change a lot of aspects of the game, though finding that out is part of the fun of the game. \n- Several different weapons with their ups and downs, you can even go unarmed and become a martial arts master, or crossbow\n.This might be an up or a down to some people, but i consider it a pro... No tutorials, no hand holding, but fun to figure out everything as you go. \n-I like how the health system works. People don't have \"health\" bars, but rather, each individual part of their body has it's own HP, and if  your head chest, or stomach get down to 0 HP, you get knocked out. If they get to -100(or you run out of blood) you die. If your limbs get to 0 they break, if they get to -100 they sever. \n-Several different \"starts\", for example, you can start with 5 people right off the bat, or a solo traveller. You can even start as a guy who's near death or enslaved if you want a challenge. I actually got enslaved by accident on my first game lol\n-Strong modding community, lots of minor mods that add fun features to the game\n\nCons\n-While i do like the variety of biomes and creatures, the game almost feels too dark. The only biome that SEEMS kinda peaceful... well, without spoilers, lets just say it has a very big downside to it lol\n-Sometimes recovery can be a bit too challenging. If your guy gets knocked out in a dangerous area, he's probably dead, unless you have someone save him. VERY rarely an NPC might save him, but most just ignore you... might be an up if you like the challenge, but it can be frustrating if you're just hanging on by a thread and you barely recover, only to get knocked out again because your guy's leg's broken and he can't run away lol\n-Honestly, i feel like the ceiling is a bit too low. While there's a lot to go for, once you get to like, END game, the game feels like there's nothing left to do. No last boss, no goal... Once you've established a colony that can survive any assault, it feels like there's nothing left to do. I've tried massacreing every bandit outpost and evil city lol, that's fun for a bit. But it does not feel like there is any sort of \"end game\". \n\nOverall it's a fantastic game. Anyone who's considering getting into it should watch Ambiguous Amphibian, while i found his videos after i had already played the game quite a bit, his videos made me wanna try again. \n\nI will say, while i love the game, lack of an end game is what made me lose interest. I've played it to death and cannot enjoy it anymore haha, but, regardless, i would say it's definitely worth it, especially for people who love games with a stronge survival aspect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I sit here in my bucket chair quivering with joy and despair for i have finally found a game that allows me to play my deepest truest desire, to be a homeless paraplegic meandering through the desert as i get beat to death by skeletons. Truly a must have for the insane and mad for any sane person will be rendered paralyzed by all the needles to the cranium",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Took awhile for it to click, but when it did holy crap what a game\r\n\r\nweirdly its kinda like the space sim x series, x4 foundations etc. Just instead of in space you're fellas on a fallout type planet. Sounds like a strange comparison I know",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best open world survival games ever made, although it might not look like it from the screenshots, and even then, it's not for everyone. \n\nThe Sandbox elements each on their own are incredibly shallow. There are no complicated systems for agriculture or industry, only a basic fighting system and a small loot pool, placed in tiny dungeons. The dialouges are mostly funny one liners or small bits of worldbuilding and the faction system is based on how many people you've killed and stolen from vs. healed and traded with. The difficulty is straight up bullshit sometimes, with boring and annoying grind sections in almost every part of the game.\n\nNo single aspect is really incredible or even desireable on it's own but holy fucking shit does it come together to make a whole, that is more than the sum of it's parts. Every element works in such a way and you're paced just fast enough, that things feel like they're moving forward, while giving you enough time to really take in the enviromental design and the atmosphere of the game, which are simply in a league of their own. I have played very few games that truly manage to capture what Kenshi effortlessly blasts down every sensory organ you dare to percieve this game with. Maybe something like Hollow Knight or Rainworld, \n\nThe beauty and depth of this world are really hard to describe and really don't show themselves in screenshots or videos or even within the first couple hours of playing. You should really give this a try, watch a couple toutorials on YouTube and keep experimenting with party size, leveling and the various systems in your disposal, until it clicks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The thing i love most about this game, is the fact that you get to build your characters story as you play. its such a good base for making stories that could last a lifetime.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who never really enjoyed classic RPGs, Kenshi is like a breath of fresh air. It takes all the GOOD aspects of the open-world, story-less genre and mixes them with RPG elements to create a unique experience that is difficult to compare. If you enjoy base building, slow progression, and a world that feels like you are a part of it, rather than the center of it, then you will love Kenshi.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Why is Kenshi so special?[/h1]\n[h2]Freedom in Gameplay[/h2]\nKenshi is the epitome of freedom in gaming. There’s no rigid story or set objectives. You’re free to choose your path: become a trader, a mercenary, a thief, or even a ruler. The world responds dynamically to your choices, making every playthrough unique. The lack of hand-holding allows for true emergent gameplay, where your actions shape the world.\n\n[h2]A Massive, Diverse World[/h2]\nThe world of Kenshi is enormous and varied, spanning hundreds of square kilometers filled with different landscapes like deserts, swamps, and ruined cities. Each region has its own atmosphere, and factions are constantly battling or trading, creating a living, evolving world. Unlike many games, Kenshi doesn’t have scripted events — the world runs its own course, regardless of what you do.\n\n[h2]Survival and Difficulty[/h2]\nThis is not an easy game. Injuries, starvation, and hostile factions are just a few of the many dangers you face. There’s a heavy emphasis on survival mechanics, and losing a limb or a squad member has real consequences. The difficulty can be overwhelming at first, but it’s deeply satisfying to overcome these challenges. Progression feels earned, not handed to you.\n\n[h2]Base-Building and Squad Management[/h2]\nYou can establish your own base, manage production, and recruit NPCs to help you with tasks or defend your home. The game doesn’t hold your hand in this aspect — your base and squad’s success depend on how well you manage them. It adds a great strategic layer to the game, where planning ahead is crucial for survival.\n\n[h2]Dynamic Factions and Politics[/h2]\nKenshi features a rich tapestry of factions that each have their own goals and values. Whether it's the religious zealots of the Holy Nation or the opportunistic United Cities, each faction has its own agenda. These factions are independent of your actions, so their conflicts and relationships with each other keep the world feeling alive. You can even influence these factions, but they’ll always have their own plans.\n\n[h2]An Indie Gem with a Rough Edge[/h2]\nKenshi was developed by a small team, with much of the work done by one man over the course of 12 years. It’s clear the game was made with a lot of passion, and its rough edges show that it wasn’t made with mainstream appeal in mind. The graphics are functional, the interface is a little clunky, and the learning curve is steep, but the depth and originality more than make up for it.\n\n[h1]What about the modding community?[/h1]\nKenshi’s modding community is incredibly active, with a wide range of mods that enhance or completely overhaul the game. These mods can make everything from improving performance to adding new factions, locations, and game mechanics.\n[list]\n[*][b]Content Mods:[/b] Some mods add new items, weapons, and factions to the game, enhancing the world and gameplay. Examples include the Universal Wasteland Expansion and the Reactive World mod, which makes the world react more meaningfully to your actions.\n[*][b]Visual & UI Mods:[/b] Mods like City Architecture Total Overhaul improve the look and feel of the world, while UI mods make the interface more user-friendly.\n[*][b]Performance Mods:[/b] The game’s engine isn’t perfect, so mods like the Particle System Override help with performance, especially in larger, more populated areas.\n[*][b]Community Tools:[/b] The developers provide modding tools like the Forgotten Construction Set, which allows modders to create their own custom content and share it with the community.\n[/list]\nThese mods keep Kenshi fresh, even after hundreds of hours of gameplay. Whether you’re looking to enhance the visuals, tweak gameplay mechanics, or overhaul the entire experience, there’s a mod for that. Plus, it’s clear that the modding community has a deep love for the game, making Kenshi feel like an ever-evolving experience.\n\n[h1]Why It’s Worth Playing[/h1]\nIn the end, Kenshi stands out because of its depth, freedom, and the feeling of being part of a chaotic world. It's not a game that guides you, but instead gives you the tools to create your own story. The modding community ensures that the game remains exciting long after the main experience ends, providing new ways to enjoy it. If you’re looking for a hardcore survival game with an immense, open world and plenty of challenges, Kenshi delivers in spades.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of THE BEST open world RPG games EVER made\nyes it does look like it was made on PS2 and optimization is not the best, but everything else is up there with the best RPG games, steam workshop and mod support is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like open world with open objectives, this is the game for you. If you like base-building while the world goes on around you, this is the game for you. If you want to go into it blind and struggle to survive, hit play right now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Let me start by saying that Kenshi is not a game for everyone.  It especially is not a game for people who want their hand held with purpose.  Kenshi is a game about life and overcoming the struggle, which is often.  The good, building bases, managing units and supply lines.  The great, wandering a desert with nothing - praying a skimmer doesn't get you before the slavers do.  The masterpiece, getting broken down, and finding your way.  This is the Kenshi way.\n\nThe bad, elder beak things.  But even bad is good in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictively great game. Feel myself pulled into continue playing near daily.\nNot sure how you'd categorize this game, but no other game I've played is like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you know this feeling? There is this one incredible game. It is so darn good, you just have to leave a review. But at the same time you realize your review will always be inadequate to describe how awesome the game is. \n\nKenshi is this game for me. Kenshi is the best game I ever played in my whole gamer life. Even at full price, it's a steal for every fan of sandbox and/or survival games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. Perharps the only issue is its performance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is how open world games should be. the start was brutal and boy was it fun. can be improved with more polished features but this is a solid foundation for rpg modern games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game doesnt care about you.. dont expect your hand to be held! but its so rewarding once your get the hang of it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down the best game ever made. One primary dev for the longest time, a tiny dev team now, and somehow they made one of the most addictive, storied, and re-playable games ever. To top it all off the game feels fair. every consequence is natural and every reward is earned. If you only buy one game in your life buy this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kenshi is a great game , and to illustrate here is my first hour of gameplay:\r\n-i created a cool human warrior i called soup \r\n-i was peacefully farming iron when all of a sudden i was attacked by raiders\r\n-i got sold into slavery\r\n-managed to escape(was very proud about it)\r\n-then i died of starvation in the desert \r\noverall a great game would 100% recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I noticed I haven't made a review for Kenshi yet.\r\nWith over 250h played, I think it's only fair to say I really liked it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like a no lube footjob from a lady you dont know whos feet are as cold as ice, at first its real rough and had to sit still during but after a while you find that its actually still as painful as when u started but now...you cant stop much like a meth induced fever dream once you start it... you cant stop nor do you want to. Yopu dont even relize it has you in its grasp.... i got a little off topic there.. buy the game its fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I initially did not understand this game and found it super frustrating and overall unpleasant.  However, after doing some research and watching some videos and getting good, this has proven to be a surprisingly enjoyable very unique world to explore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool idea they worked hard to make a good game but can feel a little dry some times. looking forward to the second game tho. 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "oh kenshi, i love this game. and after watchin the two devs in an interview i love it even more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has no equal, it is one of a kind, it scratches an itch I never knew I had.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute BANGER. One of the most unique experiences out there and it's so much fun. Just get used to losing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nothing like it, good games stand the test of time and this is a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a long time, I was looking for a game worth buying, one that would remind me why I love video games. I stumbled across this game and started watching and reading gameplay videos and reviews on Steam. I couldn't believe the funny and entertaining stories people were sharing, so I decided to buy the game and experience the amazing Kenshi game.\r\n\r\nWith only 50 hours of gameplay, I experienced the unfortunate events the game offers—don't misunderstand me, because that's what intrigued me and made me want to play more and become stronger.\r\n\r\nMy first playthrough started with learning the controls and mechanics of the game, but like the stubborn player I am, I decided to learn without reading the tutorial. That was a big mistake. I started exploring the outskirts of the city where I spawned. I saw a bar not far from where I was and decided to go in to satisfy my curiosity. Suddenly, a group of NPCs approached me and started beating me senseless. I was speechless, wondering what I had done to deserve being treated like dirt. Just then, another group arrived and began attacking those bandits. I thought they were coming to help me, but I noticed they were doing something very strange with the bandits' bodies. I realized they were putting handcuffs on their feet, necks, and both arms. I realized they were slavers and that they weren't helping me; they just wanted me as another one for their collection. But... even though they handcuffed me too, they left me there at the very entrance of the bar, and no one helped me. They just left me lying there, starving and beaten. I didn't know what to do. I tried everything, but in the end, it was all in vain... because the great warrior I had created... perished.\r\n\r\nThus concludes my first game of Kenshi. It's very good and very addictive. Many will get frustrated, but they'll see that with each game you'll learn from your mistakes and start being more careful. Like me, who has played about 17 games, I'm preparing to exterminate the bandits and the slavers. Just wait, you'll see.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kenshi is the only game where you can start your adventure as a starving nobody, get beaten up by goats, sold into slavery, escape by crawling at 0.2 mph because your legs are broken, and still feel like you made progress. And honestly? It’s fantastic.\n\nThis game does not hold your hand. In fact, it probably breaks your legs, steals your lunch money, and then congratulates you for surviving. But that’s exactly what makes it so good. Every tiny achievement from managing to cook edible food to not immediately dying when leaving town feels like a heroic victory.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazingly good if you give it a chance and learn the system. Mod support is great and allows for tons of campaigns. Cant wait for Kenshi 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've ever played\r\nHard harsh and punishing\r\nAlso satsfying when u can overcome challanges",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game, its not a typical fantasy world, it's hard, its punishing. Your going to go through a few charicters before you get the hang of it, but when you do it is an adventure. It makes you want to rise up to the challenge, and I love it for that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "games about as addictive as black tar heroin. i loved every second of this game.  i fear for the day kenshi 2 comes, for i will not leave my home.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "they dont make em like that anymore. i had to give this game 3 tries before it clicked. but when it does, there really is nothing even remotely comparable to it. the only real gripe i have with this game is its jankiness at times, probably a result of it being solo developed if i understood that correctly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beep is the best thing about this game.\n\nMy average run normally involves kidnapping, slavery and selling drugs to make money.\nVery free form RPG, reminds me of when RPGs used to be good and actually about character and stories unique to the player and the experience they have.\n\n9 Beeps out of 11 Beak Things, must buy whenever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kenshi is without a doubt, the greatest sandbox ever created. I highly recommend this game to anyone, and everyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hit the thumbs up because its not a bad game and has a huge support by the fan community. Kenshi requires patience and the will to except failure as a progress. The game literally punishes you for being weak and the only way to get stronger is trial and error. You will spend hours grinding on a simple task just to make money. You will be robbed and mauled to death by bandits. You be slaved away. You will be hunted by the hateful. Its a brutal game that requires your time and a test of your patience. If you got the time to spend and no real life, then Kenshi might just be up your ally because I feel like a vegetable after putting 40 hours into dying and watching my dude mine for ore and then become buzzard food. Its simply just not a game for me and I wish the best to anyone else who is crazy enough to play it. Otherwise, the vast apocalyptic desert with a classic fallout vibe is interesting. It may look old but the devs put a lot of work and heart into it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's one of the best games, if you like (literal) sandbox RPGs - You get to do so many things in a brutal, unforgiving and unique world. Playing this game for like 20 hours, watched so many runs, and I still had to look up the lore to figure out why everything is so f'ed",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Kenshi — Impressive in Scope, But Not My Cup of Tea\n\nKenshi is one of those games I want to love — and in many ways, I genuinely admire it. The freedom it offers is unmatched: you can be anyone, do anything, and carve out your own path in a harsh, unforgiving world. It’s a true sandbox in every sense of the word.\n\nBut despite its ambition and depth, I just couldn’t find the fun in it. The systems are dense, the learning curve is brutal, and the pacing can feel like work rather than play. I respect what the developers built — it’s clearly a passion project with incredible scale — but it’s simply not for me.\n\nFor players who thrive on complexity, experimentation, and self-made stories, Kenshi might be a dream come true. For me, though, it’s a game I admire from afar rather than one I’ll return to.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "EDITED REVIEW NOW THAT I HAVE MORE HOURS:\n\nI changed the review to a negative because though the game is good in concept, the execution was done terribly.\n\nIts a buggy mess.\n\nI couldnt get units to stop following me when I needed them to sleep to heal, i tried everything i could find online.  During my searches I saw countless posts from others saying that they were having similar bug issues.\n\nGame breaking, immersion breaking bugs.  \n\nKenshi 2 has a chance to be something great, but if they dont fix the jank, it will suffer the same fate of this game.  Just a good concept, poorly executed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is exhausting to play this game. You get overwhelmed by looters every few mins without giving you a chance to understand the logistics. After you build a decent base, you realize you can't have both mining and food resources on most spots so your units starve, you get looted at the same time and can't build enough defenses to steer off the looters. Even though you build walls and decent gates, those are easily destroyed by a few looters, which makes them a bit pointless. Even though you make your camp better it is still not enough to overcome all hazards and the accomplishment effect feels hollow since it is all like being showered crumbs to a starved player. \r\nGame construction mechanics:Great\r\nVisual:Good\r\nGame default difficulty:Bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is unplayable. You need to micro everything, the auto orders just don't work. If I tell a guy to move to a new city there is a 50/50 chance he will move to the middle of bum f*ck nowhere and just stay there. Also on default settings the raids are just ridiculous. Starving bandits in the acid rain biome? Are you fr? There is just too much grinding and no fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can understand why people enjoy this game, but everything this game offers, is better in other games and worse in Kenshi\n\nRP? Play Dwarf Fortress. You don't have many choices in Kenshi to do what you want, since the game forces you a certain playstyle early into the game. You don't have many options to play the way you want.\n\nSurvival? Play Project Zomboid. Survival mechanics is extremely simple in Kenshi. You don't have many choices for combat and survival. You just right click on an enemy and the combat plays out itself and the survival mechanics are laughable. \n\nSettlement/Npc management? Play Rimworld. Doesn't even come close to Rimworld in terms of freedom in what you can do. NPC's/followers can be placed somewhere to guard, follow/fight with you or send them on trade routes. That's it. Very limited. \n\nThe mod support is also lacking compared to the other games.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's a great game but the optimization is fucking terrible and it needs a *lot* more work before I'd consider recommending to anyone at full price. It's ambitious - which is cool - but it's *too* ambitious for the price point.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "was fun at first but became very boring and upsetting when I realized you cant kill people when they are unconscious and cant sleep in owned beds. Not fun game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to like the game so bad, but the controls are wack, hard to get into, and lots of sitting around doing nothing in a cage, knocked out, or just wandering around.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible optimisation, crit error / loading screen / ctrl shift+f11 / shif+f12 simulator.\nLove it at first, now just hate it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so poorly balanced its not even funny. You cant win any fight, not even 1v1 with NPC's every NPC army has an insane amount that are always hostile. As soon as you start building you get raided The raid armies are horribly over powered just like every enemy in this shit-show of a game. The \"get up and get stronger after every fight\" is straight up a lie, you get into a fight, lose and as soon as you get up, you get attacked again, and again, and again, until you're dead. It is unbelivable that this counts as a survival game.\n\n\nYou have a better chance at winning a fight in Dark Souls",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The tutorial is non-existent. The game is 7 years old at this point and still looks/feels like it's in beta. Will give it another try and see if it's any more bearable, but not thrilled and character creation ate up the refund time frame.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I was told this game was on the same level as Rimworld. Not even close. Feels like a (bad) tech demo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very cool concept with just too many problems and way too poor of optimization. Characters will gladly run off and do whatever they want and there isn't anything you can do to stop them, regardless of turning their jobs on or off, taunt, or literally anything. It doesn't matter how many hours you spend trying to understand the system because something will inevitably not work right and ruin your game. Literally so many other better games to put time in on because I have lost about 200 hours that I can't get back just trying to figure out how to make this game fun. There is literally always something getting in the way of whatever goal you have. It's one thing to be hard, it's another to be straight up unplayable because you can't do literally anything you even want to do, lest the game bugs out in the meantime while trying to fuck you in the ass for being something simple like a trader or farmer. I'm glad this game will die an obscure nothing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is one of those Stockholm Syndrome games, where it masks the tedium and lack of fun or depth with an interesting conceit and this vague glimmer of promise that it COULD be good if you just keep at it enough.\n\nThe game throws you into the hardest version of itself from the start, but it's also not something you really \"get good\" at; you just grind enough that you can actually start interacting with systems in the game by choice rather than necessity, until realizing all of those systems are just the same grind with a different coat of paint.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "spend 60 hours makin a team and traveling an spending so much time mining and selling and buying animals only to leave the game for a bit WITH MULTIPLE GAME SAVES MIND YOU an i come back to absolutely nothing saved.........that really makes me wanna come back and play it more",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I’ve played around 24 hours of this game, and I think it’s technically a great game. All the different places you can explore have their own specific vibe, colors, fauna, and flora. However, in my current state of gameplay, after countless hours of grinding, the game starts to crash whenever I go far from my current town — it just closes on its own. It’s very frustrating, especially coming from such a good game, to feel like all my invested hours went to waste. I don’t know what to do — if I start a new game, it might happen again after some time.\nPlease, fix your game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The only way to have fun at this game is to either mod it and make it something else or already have dedicated your soul to it.\r\n\r\nIf you know people that will hold your hand or you enjoy reading hundreds of wiki.game pages, you might find fun in this game.\r\n\r\nIt's not fun.  It might facilitate fun between people, but it's not fun in the way that games are fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd consider Kenshi early beta, not a full release.\nThere's a lot of good things, but also - full of bugs, crashes, freezes, constant loading, lack of any optimisation, pathetic pathfinding, zero balance etc.\n\nThe game was very promising, but after 1.5 years of zero updates this is just overpriced beta of a promising game - unfortunately. It's sad such a gem is rotting unfinished.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cannot comprehend the draw. The graphics are hideous, the interface and controls are absolute trash, combat is like watching paint watch paint dry...This is a game for people who enjoy sandpaper in their eyes. Yes, there is freedom and leveling system is cool...that is about it. \n\nQueue the fanboys commenting on my playtime...yeah...I couldn't even bear to play this game for an hour that is how utterly trash it is.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is ass, I hate it, and if you are someone who enjoys it enough to put over a 139.9 hours you probably are an idiot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "My experience was not particularly great, I guess I just didn't get it, wish there was something that introduces you the the game mechanics, however extensive they may be. It could even be as a separate thing to a game, as I understand that sort of thing breaks immersion for some players--or they find joy in figuring them out.\n\nI kind of just wanted to play, so its a negative review from me granted I didn't play it enough to truly say if the game is good or not--this only reflects my initial experience and I've lost interest in what I thought might be a cool post-apocalyptic rpg game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "- grind, grind, grind -> there is NO WAY to effectively level your heroes through normal playing past certain certain level\n-constant crashing\n-you spend half of the game in loading screen\n- you get pushed through walls on daily basis\n\nand other annoying things\n-if you want to play martial arts dodge makes it unplayable\n-if you uwant to play crossbow - micromanagemant of bolts makes it unplayable\n\nit reminds me custom rpg maps from warcraft 3, but this game is really really poor craftmanship\n\n870 square kilometers of which 90% is empty",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "very overrated, the trailer and concept of the game drew me in, yet upon loading in it was just extremely plain. You supposedly need mods to make this game more lively, but I honestly just spent like 20 minutes wondering around outside the town i spawned in looking around the map with my mouse until I could find something, anything that wasn't just a rock you could mine.. can't be bothered to install mods on a game that didn't even entertain me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very boring to start with, not sure I can be bothered with the grind necessary to actually start to do cool stuff",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This was an easy refund. Watching character mine a node for most of my playtime. Whatever this game offers, it is behind a punishing grind wall.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Convoluted slop to waste your time. Find a better game. People keep recommending this and are masochist for liking it. Save your money.\n\nThis game is digital punishment for gamers. Nothing more, nothing less. I know - people will say I didn't 'figure it out'.. Well it's a game bro, I want to play not be digitally violated. I get it, start off in your underwear with a twig, and make your play on the world. If you find that appealing, go for it but for most people it's just punishment.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Only buy this game if you want to spend 99% of your playtime reloading the game because 200 enemies materialized in front of you no matter where you go.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I honestly don't understand the overwhelming positive rating. I couldn't get over the clunky controls, aimless wandering and 2008 indie style graphics.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Ai is just to limited and boring for any real immersion.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I got this for 60% off but i STILL would refund this if i could. Potato graphics, game stutters when saving, you cant look very far ahead and it's boring so you'll wanna do something else in the background but since you cant look ahead you will just die to a group of random warriors and then get locked into a cage for a few hours and lose your stuff over and over and over again... games not worth 2$ in my opinion. midmidmidmidmidmidmidmid",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This sucks. How am I supposed to play if everything keeps freezing and takes 5 minutes to load? I mean, I have an RTX 5070…",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "quickly understood that i don't have the time for this game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game devs shutdown an amazing Co-op mod.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is good but why does it still crash unexpectedly?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so addictive not recommend for employed dudes",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "fell asleep playing this game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Running simulator",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I love it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "buggy garbage...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "SHITTY CONCEPT OF A GAME\r\nQ",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"Another man's trash is another man's treasure\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mandatory Review",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wa",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kenshi is most likely worth the asking price for the time you'll spend. However, after spending almost 170 hours playing, I won't ever play it again, nor any sequel.\n\nI'd describe Kenshi and a continent size pool a millimetre deep and filled with glass. It's a great mix of genres and the world itself along with the lore is fantastic. \n\nThe biggest problem is the lack of reliable path finding. Groups need to be babied as they'll reliably; separate, aggro Beak Things, stop to fight random enemies, just stop for no reason, swim through acid, get stuck on terrain or go in the weirdest direction. This makes it annoying to control multiple groups that are running around the map to explore, sell loot or resupply as you end up constantly loading the map over and over again between the groups. Even the OG Starcraft had better group control. Hey Devs, I rebuild the nav mesh, again, why are my characters still arse backwards or taking a wide berth into Venge or b-lining for Beak Thing nests? \n\nLevelling is the second biggest problem. I love the \"use it to level it\" design. But, it is painfully boring to level basic things like strength or toughness, let alone combat skills. Once you have more than one character, it gets exponential. Just having to level up athletics just so we can move through the world. If you think, \"I'll just power level!\" The game seems to track how quickly you gain skills and gimps itself, preventing power levelling. Hey, Devs, if someone goes out of their way to learn how to power level, they've done so for a multitude of reasons. Making that harder is toxic to your players. \n\nBase building is also broken. Enemies glitch through walls and the benefits of a base are only just worth it over buying houses in a city. In the end, I felt like I built a base so I could have built a base. It wasn't rewarding and only added chores. \n\nThe fact that mods fix a lot of this is damning. Especially the fact that Compressed Textures is the top mod. Hey, Devs, the top mods are shouting what about the game is most broken and should be fixed. If the top mods aren't total conversions, you've not finished making you're game. \n\nHey, Devs, I REALLY liked my time with Kenshi. I was obsessed for a month, 170 hours obsessed. But the lows, man the lows. It feels like the game is actively trying to fight me from playing. Please, I can imagin how much time and effort you've put into Kenshi and it was worth it but, it isn't finished.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I can't recommend this game, but please read on. \n\nThe gameplay and the concept is brilliant. Do you like looting dead bodies? Do you like looting dead bodies of people you didn't kill because you are too lame and weak to win a fight? Do you like then selling that loot so you can buy food so you don't die? Do you like being attacked? Do you like building pallisades full of turrets only for an enemy to invade and kill you with your own turrets? Do you like passing out from blood loss? Losing limbs? Being a slave? Being pecked to death and then eaten? These are some of the things you will experience in Kenshi. And it's amazing!\n\nBut if you are not willing to suffer in order to enjoy all that suffering, you will have to make peace with how broken it is. Here are some of the things that are deeply unfortunate:\n- The game crashes every now and then. The quick save shortcut is your friend.\n- Path finding is broken\n- If someone mans a turret, they won't leave to eat and just stand there starving unless you micro manage their food\n- Enemies clipping right through your fortified gates\n- A building system that functions only worse than it looks. For instance, you can build something there now, but in a while it will show up as being too close to a town. Or you build a wall on a slope and gaps underneath allow enemies to just stroll in\n- Sometimes an animal won't eat. It will just stand there, starve and die. The game does not notify you when one of your faction is starving.\n- There is a lot of ground to cover, and loading screens cause bad stuttering\n- There is a lot of topography, but the building system only really works well on flat ground\n- Game is pretty ugly \n- The pathfinding has lots of issues. You might see that some work is not being done because someone can't find a path to the work or they are stuck in a patch where the pathfinding can't get them out.\n- Clipping and getting stuck in walls\n- A trader comes to town. They will leave while you are busy trading with them.\n\nDespite all of this, it is a great game in my opinion. But if you aren't willing to take it warts and all I would recommend waiting for Kenshi 2. If you do decide to take the pain, mods are essential and not as likely to break as in some other games.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Kenshi — Impressive in Scope, But Not My Cup of Tea\n\nKenshi is one of those games I want to love — and in many ways, I genuinely admire it. The freedom it offers is unmatched: you can be anyone, do anything, and carve out your own path in a harsh, unforgiving world. It’s a true sandbox in every sense of the word.\n\nBut despite its ambition and depth, I just couldn’t find the fun in it. The systems are dense, the learning curve is brutal, and the pacing can feel like work rather than play. I respect what the developers built — it’s clearly a passion project with incredible scale — but it’s simply not for me.\n\nFor players who thrive on complexity, experimentation, and self-made stories, Kenshi might be a dream come true. For me, though, it’s a game I admire from afar rather than one I’ll return to.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I can see why people liked this game so much, but It wasn't my cup of tea tbh. \neverything is just too slow for me even with fastforward button always on. \nI often fall a sleep while playing this game since everything requires time consuming.\nalso this game overheated my PC like hell.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "World's first Watch-alator game, because you will be doing nothing but watch your moron of a character fail at the simplest tasks. Whatever mechanics you can interact with are scarcely that deep to justify the RTS game play, instead you must \"Use your imagination\" in order to have any semblance of fun.\n\nThis game is hardly an RPG neither, as there are barely any mechanics that allows you to role play, let alone feel like you're constructing an actual character.  The differently allocated stats you can individually level up is about as RPG as this game gets. \n\nThe only real difficulty this game offers is the fact that you will always start as the world's biggest loser, with all 1's in your stats. The only way to get any footing with your abilities, from your running speed to your combat ability, is by grinding for hours. \nThis also means that no matter who you start as, be it a slave or a wanderer or a fucknugget, you will always start with the exact same stats. Why are you a slave with no skill in laboring? I hope you have an imaginative enough mind to come up with an excuse for that. Or perhaps you can instead roleplay being a slave, and watch your character turn big rocks into little rocks, all day everyday, until your laboring skill is at an immersive level before you plan an escape.\n\nExploration is kinda fun at least, most probably because this is the one aspect of the game you interact with its mechanics the least, therefor you're not constantly reminded of how shallow they are. Some of the biomes and its inhabitants/lore-pieces are pretty cool to gawk at.\n\nBase-building aside, this game has this simple gameplay loop: Run, Loot, Fight. You will run as you explore and run away from hostiles that may kill you. You will loot ruins for cash money or whatever else you could use it for. And you will fight in battles you think you will either win or at least not die in. It sounds like a fun gameplay loop if it wasnt a click and watch, and furthermore if your player character wasnt the biggest idiot in town.\n\nAll-in-all a solid 5/10, the other remaining 5 points you just have to imagine it's there. Hopefully the second game is better.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I don't get how this game has overwhelmingly positive score.\nIt's a walking/get ganked simulator.\n\nMaybe if you set aside multiple hours/days you could care to figure out \"what this game is about\".  \n\nI bought this game thinking it would be a story generator like Rimworld, but man, this is a lifeless and barren world.\n\nFirst playthrough: Spawn, Walk around for 10 minutes, barren landscape, nothing but rocks around,  Find robots, they chase you down, all of a sudden 50 robots spawn in. Run from 100+ robots for another 10 minutes, robots infinitely chase, get 2 shot by robot. \"game is like losing makes you tougher\", okay take the L. PSYCH robots stick you in machine, get chopped up into pieces. \"can't get tough if you are dead.\", no game over/ restart screen, game says your unconscious even though you are dead...\n\nsecond playthrough: spawn, see first non-hostile npc, talk to them, wants to group, okay lets group, PSYCH charges more money than you have for party, leave area, barren landscape... WTF this place is boring, start running to find more npcs, PSYCH here are 20+ bandits, get ganked, get stuff stolen. need to heal arm and legs, oh, need splits, can't get splints cause no money, even with money can't get splints cause NO NPC'S...\n\nWherever the \"game\" is, it's probably buried hours deep.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "How do I explain that this game has potential with a better tutorial without ripping it apart? It's an amazing concept, it just doesn't have good explanations on how to do basic stuff so you can advance. not to mention it takes FOREVER to be good enough to not get killed by a goat...",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is... something. \n\nUsually, I write reviews as a way to summarize my experience, from the beginning to the end, after I'm either finished or decided that I'm done with a game.\n\nBut with Kenshi, I'm a bit at a loss for words. I don't know where to start or finish, and I guess that's a pretty good analogy for the game itself.\n\nIt's an open sandbox that pretends to be RPG, while having no real story, quests, meaningful interactions with NPCs (other than imprisoning them) or even proper ability to build your character with feats, perks and the like, rather you just level up your skills by doing stuff. And it's a grind. Terrible, slow, boring grind where you can simply leave your characters AFK running circles to level up movement speed & STR.\n\nSo it's not a proper RPG, similar to Dragon Age Origins, Mass Effect, Gothic, Elder Scrolls, SWKOTOR and the like.\n\nIt's not an RTS either, though you could be fooled by the way the game presents itself. But Kenshi has rather small limit of NPC you can control and a pretty low limit on how many attackers can attack at a time, so any character gets time to parry all the attacks NPCs land on them. Most attacks also have AoE dmg, which is unavoidable - you can't dodge or block, if you're not the main target of the attack. \n\nYou can't exactly make them to walk in formations. Pathfinding couldn't find its path to the game, so you have to do a lot of micro. \n\nBasebuilding is also bad - from bad slopping and problems with placing objects (or weird angles) to terrible optimization, and small character limit, which - all combined - makes building a big base inpractical at best.  \n\nWhat's worse, no NPCs will ever try to settle/join your base. You also can't sell stuff by creating your own shops, because NPCs don't have enough money to buy anything slightlty expensvie - hell, you can even see that in bars, when NPCs just come in, say \"it's too expensive\" and leave. \n\nOn a side note, you can't build anything too close to cities. But I once build a wall on a neutral territory, and a small part of it became property of a faction. Which also lead to them trying to get me to pay the tribute, because the game also won't tell you if you're buidling within factions' borders or not.\n\nSo yeah, lots of bugs. Lackluster RPG and RTS elements, terrible grind.\n\nHow much time did I spend in the game? 172 hours. Why? Honestly, I don't know. \n\nIt's a new type of game for me with an interesting concept. The one, where failure doesn't mean that the game ends.\nMost NPCs can't kill you (other than cannibal-type and some robots, which will either eat you alive, or skin you alive to make a human-skin clothing), and neither can you. \n\nThere are work-arounds and expections (for animals), but generally you can't execute anyone.\n\nWhich leads to a main sellling point of the game (in my opinion):\n\nThere's always a way to turn things around without reloading save, which was kind of counter-intuitive for me, but lead to a lot of interesting situations due to random generation of various stuff.\n\nThe game also has a nice concept of world states, where killing or imprisoning NPCs leads to actual changes in the world.\n\nAnd a ton of cool mods that make it way more interesting, enjoyable and over all add worldstates and other stuff.\n\nThe only problem is, once you go through the gring and start winning, the game kind of doesn't have a lot to offer.\n\nThe main point of the game and its gameplay loop is overcoming the odds - which are not in your favor - through suffering(grind) and various shennenigans. Once you've leveled up several characters and got good equipement, the game is basically over. Without the challenge and difficulties, the game is empty and can't offer anything, other than lackluster base buidling.\n\nYou can \"paint\" the map, see all the world states and etc, but it felt more like going through check list, rather than actually playing and/or enjoying the game.\n\nBy the time you properly level up, the game is over. And it kind of sucks there are no really big events for end game.\nCome to think of it, it's actually the theme of the game - it throws interesting concepts at you, but never bothers to properly and fully develop them.\n\nSo, is Kenshi a bad or a good game? Do I recommend it or not?\n\nAn answer to the former would be \"it's a niche\". If you like the \"failure is not the end\" mindset and ok with your bad choices mixed with RNG creating your own story, then you'll probably like this game. Just do yourself a favor and istall mod collection from a guy, who made it for himself and his wife. It's one of the top mod collections (if not the top-one) in the workshop, has Vanilla+ feeling and fixes a lot of bugs and exploits. Do not do Vanilla run, you won't miss on anything.\n\nIf that doesn't sound fun to you, then avoid it like a fire. The game will feel too grindy, unpolished and buggy, which it actually is.\n\nAs for the latter, I'm on the fence. I enjoyed my time (to a point) with the game, and the price is quite low even without the discount. But I mostly did so, because I played with mods.  \n\nIf I'd have to play the Vanilla game - or mod it by hand, as opposed to using collections and copy-pasting mod order - I wouldn't have enjoyed it as much as I did.\n\nAnd if the game is no fun without mods, I have to go with a \"no\", I don't recommend the game.\n\nBut if some of the concepts I mentioned sounded fun to you, and you don't mind the mods, buy it at a discount, install top-rated collection and give it a try. You might suprise yourself, just as I did.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I actually really like this game. But I'm forced to give a negative review. \r\n\r\nI have had multiple crashes to desktop. I've also lost progress multiple times due to weird lag in game, mainly characters taking 5-10 seconds to follow a move command. I just lost progress like the 10th time because instead of crossbow kiting, my character just stands there and dies instead of moving. The minimum system requirements are as follows per the steam page - \r\n\r\nMINIMUM:\r\nOS:64-bit Windows\r\nProcessor:Dual-core 64-bit\r\nMemory:6 GB RAM\r\nGraphics:Pixel shader 5.0 capable card\r\nDirectX®:11\r\nHard Drive:14GB HD space\r\n\r\nI have a GTX1070, 8 core cpu. It isn't good enough for this game. If the minimum requirements were more honest on the store page, I wouldn't be giving this game a negative review. I personally think you need a 20 series card minimum, though I'm sure there are others with similar specs to mine that run the game fine. This is just my experience. I haven't had this problem in any other game in my steam library, which I think are quite a few at this point.\r\n\r\nI see no reason to keep putting time in a game when I just have to redo progress over and over again. Honestly, just the crashes to desktop with a C++ error message are enough for me to give this game a negative review, though maybe I'm too harsh.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "EDITED REVIEW NOW THAT I HAVE MORE HOURS:\n\nI changed the review to a negative because though the game is good in concept, the execution was done terribly.\n\nIts a buggy mess.\n\nI couldnt get units to stop following me when I needed them to sleep to heal, i tried everything i could find online.  During my searches I saw countless posts from others saying that they were having similar bug issues.\n\nGame breaking, immersion breaking bugs.  \n\nKenshi 2 has a chance to be something great, but if they dont fix the jank, it will suffer the same fate of this game.  Just a good concept, poorly executed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is exhausting to play this game. You get overwhelmed by looters every few mins without giving you a chance to understand the logistics. After you build a decent base, you realize you can't have both mining and food resources on most spots so your units starve, you get looted at the same time and can't build enough defenses to steer off the looters. Even though you build walls and decent gates, those are easily destroyed by a few looters, which makes them a bit pointless. Even though you make your camp better it is still not enough to overcome all hazards and the accomplishment effect feels hollow since it is all like being showered crumbs to a starved player. \r\nGame construction mechanics:Great\r\nVisual:Good\r\nGame default difficulty:Bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is unplayable. You need to micro everything, the auto orders just don't work. If I tell a guy to move to a new city there is a 50/50 chance he will move to the middle of bum f*ck nowhere and just stay there. Also on default settings the raids are just ridiculous. Starving bandits in the acid rain biome? Are you fr? There is just too much grinding and no fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can understand why people enjoy this game, but everything this game offers, is better in other games and worse in Kenshi\n\nRP? Play Dwarf Fortress. You don't have many choices in Kenshi to do what you want, since the game forces you a certain playstyle early into the game. You don't have many options to play the way you want.\n\nSurvival? Play Project Zomboid. Survival mechanics is extremely simple in Kenshi. You don't have many choices for combat and survival. You just right click on an enemy and the combat plays out itself and the survival mechanics are laughable. \n\nSettlement/Npc management? Play Rimworld. Doesn't even come close to Rimworld in terms of freedom in what you can do. NPC's/followers can be placed somewhere to guard, follow/fight with you or send them on trade routes. That's it. Very limited. \n\nThe mod support is also lacking compared to the other games.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's a great game but the optimization is fucking terrible and it needs a *lot* more work before I'd consider recommending to anyone at full price. It's ambitious - which is cool - but it's *too* ambitious for the price point.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "was fun at first but became very boring and upsetting when I realized you cant kill people when they are unconscious and cant sleep in owned beds. Not fun game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to like the game so bad, but the controls are wack, hard to get into, and lots of sitting around doing nothing in a cage, knocked out, or just wandering around.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible optimisation, crit error / loading screen / ctrl shift+f11 / shif+f12 simulator.\nLove it at first, now just hate it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so poorly balanced its not even funny. You cant win any fight, not even 1v1 with NPC's every NPC army has an insane amount that are always hostile. As soon as you start building you get raided The raid armies are horribly over powered just like every enemy in this shit-show of a game. The \"get up and get stronger after every fight\" is straight up a lie, you get into a fight, lose and as soon as you get up, you get attacked again, and again, and again, until you're dead. It is unbelivable that this counts as a survival game.\n\n\nYou have a better chance at winning a fight in Dark Souls",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The tutorial is non-existent. The game is 7 years old at this point and still looks/feels like it's in beta. Will give it another try and see if it's any more bearable, but not thrilled and character creation ate up the refund time frame.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I was told this game was on the same level as Rimworld. Not even close. Feels like a (bad) tech demo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very cool concept with just too many problems and way too poor of optimization. Characters will gladly run off and do whatever they want and there isn't anything you can do to stop them, regardless of turning their jobs on or off, taunt, or literally anything. It doesn't matter how many hours you spend trying to understand the system because something will inevitably not work right and ruin your game. Literally so many other better games to put time in on because I have lost about 200 hours that I can't get back just trying to figure out how to make this game fun. There is literally always something getting in the way of whatever goal you have. It's one thing to be hard, it's another to be straight up unplayable because you can't do literally anything you even want to do, lest the game bugs out in the meantime while trying to fuck you in the ass for being something simple like a trader or farmer. I'm glad this game will die an obscure nothing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is one of those Stockholm Syndrome games, where it masks the tedium and lack of fun or depth with an interesting conceit and this vague glimmer of promise that it COULD be good if you just keep at it enough.\n\nThe game throws you into the hardest version of itself from the start, but it's also not something you really \"get good\" at; you just grind enough that you can actually start interacting with systems in the game by choice rather than necessity, until realizing all of those systems are just the same grind with a different coat of paint.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "spend 60 hours makin a team and traveling an spending so much time mining and selling and buying animals only to leave the game for a bit WITH MULTIPLE GAME SAVES MIND YOU an i come back to absolutely nothing saved.........that really makes me wanna come back and play it more",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I’ve played around 24 hours of this game, and I think it’s technically a great game. All the different places you can explore have their own specific vibe, colors, fauna, and flora. However, in my current state of gameplay, after countless hours of grinding, the game starts to crash whenever I go far from my current town — it just closes on its own. It’s very frustrating, especially coming from such a good game, to feel like all my invested hours went to waste. I don’t know what to do — if I start a new game, it might happen again after some time.\nPlease, fix your game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The only way to have fun at this game is to either mod it and make it something else or already have dedicated your soul to it.\r\n\r\nIf you know people that will hold your hand or you enjoy reading hundreds of wiki.game pages, you might find fun in this game.\r\n\r\nIt's not fun.  It might facilitate fun between people, but it's not fun in the way that games are fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd consider Kenshi early beta, not a full release.\nThere's a lot of good things, but also - full of bugs, crashes, freezes, constant loading, lack of any optimisation, pathetic pathfinding, zero balance etc.\n\nThe game was very promising, but after 1.5 years of zero updates this is just overpriced beta of a promising game - unfortunately. It's sad such a gem is rotting unfinished.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cannot comprehend the draw. The graphics are hideous, the interface and controls are absolute trash, combat is like watching paint watch paint dry...This is a game for people who enjoy sandpaper in their eyes. Yes, there is freedom and leveling system is cool...that is about it. \n\nQueue the fanboys commenting on my playtime...yeah...I couldn't even bear to play this game for an hour that is how utterly trash it is.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is ass, I hate it, and if you are someone who enjoys it enough to put over a 139.9 hours you probably are an idiot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "My experience was not particularly great, I guess I just didn't get it, wish there was something that introduces you the the game mechanics, however extensive they may be. It could even be as a separate thing to a game, as I understand that sort of thing breaks immersion for some players--or they find joy in figuring them out.\n\nI kind of just wanted to play, so its a negative review from me granted I didn't play it enough to truly say if the game is good or not--this only reflects my initial experience and I've lost interest in what I thought might be a cool post-apocalyptic rpg game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "- grind, grind, grind -> there is NO WAY to effectively level your heroes through normal playing past certain certain level\n-constant crashing\n-you spend half of the game in loading screen\n- you get pushed through walls on daily basis\n\nand other annoying things\n-if you want to play martial arts dodge makes it unplayable\n-if you uwant to play crossbow - micromanagemant of bolts makes it unplayable\n\nit reminds me custom rpg maps from warcraft 3, but this game is really really poor craftmanship\n\n870 square kilometers of which 90% is empty",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "very overrated, the trailer and concept of the game drew me in, yet upon loading in it was just extremely plain. You supposedly need mods to make this game more lively, but I honestly just spent like 20 minutes wondering around outside the town i spawned in looking around the map with my mouse until I could find something, anything that wasn't just a rock you could mine.. can't be bothered to install mods on a game that didn't even entertain me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very boring to start with, not sure I can be bothered with the grind necessary to actually start to do cool stuff",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This was an easy refund. Watching character mine a node for most of my playtime. Whatever this game offers, it is behind a punishing grind wall.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Convoluted slop to waste your time. Find a better game. People keep recommending this and are masochist for liking it. Save your money.\n\nThis game is digital punishment for gamers. Nothing more, nothing less. I know - people will say I didn't 'figure it out'.. Well it's a game bro, I want to play not be digitally violated. I get it, start off in your underwear with a twig, and make your play on the world. If you find that appealing, go for it but for most people it's just punishment.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Only buy this game if you want to spend 99% of your playtime reloading the game because 200 enemies materialized in front of you no matter where you go.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I honestly don't understand the overwhelming positive rating. I couldn't get over the clunky controls, aimless wandering and 2008 indie style graphics.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Ai is just to limited and boring for any real immersion.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I got this for 60% off but i STILL would refund this if i could. Potato graphics, game stutters when saving, you cant look very far ahead and it's boring so you'll wanna do something else in the background but since you cant look ahead you will just die to a group of random warriors and then get locked into a cage for a few hours and lose your stuff over and over and over again... games not worth 2$ in my opinion. midmidmidmidmidmidmidmid",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This sucks. How am I supposed to play if everything keeps freezing and takes 5 minutes to load? I mean, I have an RTX 5070…",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "quickly understood that i don't have the time for this game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game devs shutdown an amazing Co-op mod.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is good but why does it still crash unexpectedly?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so addictive not recommend for employed dudes",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "fell asleep playing this game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Running simulator",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I love it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "buggy garbage...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "SHITTY CONCEPT OF A GAME\r\nQ",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"Another man's trash is another man's treasure\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mandatory Review",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wa",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kenshi is most likely worth the asking price for the time you'll spend. However, after spending almost 170 hours playing, I won't ever play it again, nor any sequel.\n\nI'd describe Kenshi and a continent size pool a millimetre deep and filled with glass. It's a great mix of genres and the world itself along with the lore is fantastic. \n\nThe biggest problem is the lack of reliable path finding. Groups need to be babied as they'll reliably; separate, aggro Beak Things, stop to fight random enemies, just stop for no reason, swim through acid, get stuck on terrain or go in the weirdest direction. This makes it annoying to control multiple groups that are running around the map to explore, sell loot or resupply as you end up constantly loading the map over and over again between the groups. Even the OG Starcraft had better group control. Hey Devs, I rebuild the nav mesh, again, why are my characters still arse backwards or taking a wide berth into Venge or b-lining for Beak Thing nests? \n\nLevelling is the second biggest problem. I love the \"use it to level it\" design. But, it is painfully boring to level basic things like strength or toughness, let alone combat skills. Once you have more than one character, it gets exponential. Just having to level up athletics just so we can move through the world. If you think, \"I'll just power level!\" The game seems to track how quickly you gain skills and gimps itself, preventing power levelling. Hey, Devs, if someone goes out of their way to learn how to power level, they've done so for a multitude of reasons. Making that harder is toxic to your players. \n\nBase building is also broken. Enemies glitch through walls and the benefits of a base are only just worth it over buying houses in a city. In the end, I felt like I built a base so I could have built a base. It wasn't rewarding and only added chores. \n\nThe fact that mods fix a lot of this is damning. Especially the fact that Compressed Textures is the top mod. Hey, Devs, the top mods are shouting what about the game is most broken and should be fixed. If the top mods aren't total conversions, you've not finished making you're game. \n\nHey, Devs, I REALLY liked my time with Kenshi. I was obsessed for a month, 170 hours obsessed. But the lows, man the lows. It feels like the game is actively trying to fight me from playing. Please, I can imagin how much time and effort you've put into Kenshi and it was worth it but, it isn't finished.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I can't recommend this game, but please read on. \n\nThe gameplay and the concept is brilliant. Do you like looting dead bodies? Do you like looting dead bodies of people you didn't kill because you are too lame and weak to win a fight? Do you like then selling that loot so you can buy food so you don't die? Do you like being attacked? Do you like building pallisades full of turrets only for an enemy to invade and kill you with your own turrets? Do you like passing out from blood loss? Losing limbs? Being a slave? Being pecked to death and then eaten? These are some of the things you will experience in Kenshi. And it's amazing!\n\nBut if you are not willing to suffer in order to enjoy all that suffering, you will have to make peace with how broken it is. Here are some of the things that are deeply unfortunate:\n- The game crashes every now and then. The quick save shortcut is your friend.\n- Path finding is broken\n- If someone mans a turret, they won't leave to eat and just stand there starving unless you micro manage their food\n- Enemies clipping right through your fortified gates\n- A building system that functions only worse than it looks. For instance, you can build something there now, but in a while it will show up as being too close to a town. Or you build a wall on a slope and gaps underneath allow enemies to just stroll in\n- Sometimes an animal won't eat. It will just stand there, starve and die. The game does not notify you when one of your faction is starving.\n- There is a lot of ground to cover, and loading screens cause bad stuttering\n- There is a lot of topography, but the building system only really works well on flat ground\n- Game is pretty ugly \n- The pathfinding has lots of issues. You might see that some work is not being done because someone can't find a path to the work or they are stuck in a patch where the pathfinding can't get them out.\n- Clipping and getting stuck in walls\n- A trader comes to town. They will leave while you are busy trading with them.\n\nDespite all of this, it is a great game in my opinion. But if you aren't willing to take it warts and all I would recommend waiting for Kenshi 2. If you do decide to take the pain, mods are essential and not as likely to break as in some other games.",
      "voted_up": false,
      "votes_helpful": 11
    }
  ]
}