{
  "positive": [
    {
      "review": "having the best time playing this with friends. might be the main thing keeping me up during depression. the characters are interesting and diverse, the gameplay is fun, the lore runs deep. i love the concept of omnics, androids with a soul that are trying to find their place and meaning in the vast and chaotic world. i love so many characters! ramattra, ana, mercy, moira, reaper, illari. moira and ramattra are my favorite lore-wise. i love all the cinematics and comics that dive into the story and characterization :) just overall i am in love with the world of the game.",
      "voted_up": true,
      "votes_helpful": 85
    },
    {
      "review": "TBH it's not as bad as everyone makes it out to be. The dev team has actually stepped up their game now that Marvel Rivals came out and dominated them. Even though I kinda suck at this game, I still do love this game, along with TF2.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "I first played Overwatch 1 back in 2019 on Battlenet so all of my hours in this game are on that platform (1500+). The launch of Overwatch 2 was rough, and the canceled PvE has left Overwatch with a tarnished reputation. Despite this, the developers have remained extremely passionate for this game and have worked so hard to rebuild and improve it. Overwatch 2 is in the best state it has ever been in. Perks, Stadium, 6v6 back in the game, hero bans, map voting, competitive drives, a reasonable hero release schedule, mythic skins and weapons, lootboxes (you can't even buy them, they are not predatory in any way), a revamp of the progression system, better and more consistent balance, lore back in the game, and Overwatch classic (which in some cases proves OW2 is in its best state because some of the OW1 patches are miserable to play with insta kill dps doomfist, poor balance, and tons of stuns and CC abilities) have all made Overwatch 2 an incredible game. Do not hesitate to give it a try. The game is in a great state and has many fun heroes, modes, rewards, and so much more to offer.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "For all the hate that it received, I honestly feel that the game is in a great state with constant events, changes and collabs. I haven't put a single dollar into it yet I have bunch of cosmetics and emotes. Overall balance is mostly good too, it's rare nowadays to see a TRULY broken hero. \nI have fun with it, and when I'm not it's purely due to the multiplayer aspect of it, but everything else I feel is in a pretty good state :) ngl I wish that the sour taste that launch OW2 left disappeared, but it's hard to change public opinion by now.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "As bad as the reviews make it, it’s actually pretty good. I’m coming up on 700 hours in this game and I don’t regret it because even with its flaws, it gave me way more fun and value than most games",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game has been on an insane come back recently with it's new characters, and new game modes. It's awful to see what they call a \"story\" now and for them to completely drop omnic crisis story line , but everything else is getting better",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Cool characters and mostly a nice community",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It was shit on release but its okay now, i hope they keep making it better again.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best hero shooter for sure. The problems at launch were fixed long ago.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Honestly the game is in a great state right now, if you haven't played in a while or feel like giving it a try, now is definitely a good time !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best things Overwatch2 can offer is the guaranteed brief escape from the worries and problems in your real life.\nAchieving that, in many cases it just comes up with overwhelmingly annoying and devastating scenarios where your new stress, distrust, and anger just overcome all your possible feelings.\nIt is fun when you are lucky. You are lucky if you can have fun.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Gameplay loop is fine. The microtransactions are not in your face all the time. I don't understand why you would release the same game and slap the number 2 on it, only to add the feature that was the original reason for releasing it like a year later and then have it locked behind a paywall.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Overwatch 2 has had some serious downs, but it’s currently in one of the best states it’s been in for quite a while. There aren’t any majorly game-breaking heroes right now, and recent updates like hero bans, map voting, a new game mode, the return of loot boxes, the perk system, and Hero Mastery have helped make the game feel fun again.\r\n\r\nThe only real downside is that queue times can still be a bit long, though that’s somewhat expected given the criticism the game still receives over the canceled PvE plans. Even so, the game has improved a lot since launch, and some of that negativity feels outdated at this point.\r\n\r\nOverall, Overwatch 2 is in a great spot, and since it’s free to play, it’s definitely worth giving a try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gotta give it credit for being probably the most all around solid online competitive multiplayer game to work on Linux.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game! love that it is free to play. i really enjoy playing it with my husband, sister and brother. The representation of different countries in maps and characters is really cool. The matchmaking sucks sometimes making you go  on a winning or losing streak with toxic chat sometimes. The POTG system is great to preview but is broken and shows bad moments of undeserving players sometimes. Overall fun game, worth playing :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i luv overwatch. I play tank and my team plays blind, dies after we break through then says \"tank diff\" at the end of the game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "ive never experienced the kind of rage a pacifist zenyatta brought me that fateful day. please never play this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have thousands of hours and played since day 1 of OW1. The negative reviews for this are absolutely ridiculous. Mostly complaining about the lack of PvE in a PvP centric game and monetization. I bought this game years ago for $30 and haven't given blizzard a dime since. It's now free to play without any pay to win. Stop complaining. Don't buy cosmetics. The game plays great, cheaters are extremely rare, and they regularly add new heroes and maps. How many games can you say this about? Shut up and queue up. If you want PvE there are plenty of other options.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's got a lot of flaws, but still fun. Doesn't get boring as quickly as other FPS games imo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its fun and lwk better than rivals, as someone whos put a lot of hours into both I can say rivals is more casual and people only play meta team comps so it gets really repetitive and boeing, also in rivals you either  wash the other team bc their buns or you get rolled.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've wasted my time on this game . Countless hours wasted , my life ruined . \n\n\nCan not recommend it more if you're autistic . This game is art to me .",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am so late to this game, but I am really enjoying it. I feel like I am one of few people who played Marvel Rivals before Overwatch so my view of the game is much different than the typical player. After 25 hours with the game, Overwatch definitely feels a bit harder than Rivals. I have yet to find my main hero, but I have a few I gravitate towards. It is probably related to my skill, but I find myself dying way faster than in Rivals. The wait times can be long at times, but I would rather wait and play with real people over dominating a match against bots. Overall, I really enjoy this game and I am eager to get to know more characters. Hopefully I will have a main fighter soon!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The hate brigade mass review bombs because they \"killed overwatch 1 for this\", even though the game was dead.\nThe game is fine. It's still overwatch just like it was before, except better in many aspects.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game But you have to have a STRONG mental if you wish to play a support role. I personally play a lot of support roles so its very tiring after a while but overall a great game to get addicted to.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "was mid after the change in 2022, but the big 25 turned it into a game worthy of being called Overwatch 2",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is my favorite game, I really like to play it daily. A lot of skins coming all the time, the perks system is great and fun, I wish we had more new maps but I am enjoying a lot this one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love how inclusive the roster is, and I think representation in video games is super important, especially in today's political climate. As someone with over 1000+ hours on console OW1, the game still feels great to play to this day. I just wish the community was a bit nicer to each other.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Marvel Rivals is the best thing to ever happen to Overwatch. Blizzard actually has competition now and they've shown that they are trying. With the new banning in ranked, map voting, and rank forgiveness when teammates leave. I say the game isn't perfect still, but it is headed in the right direction. Keep up the great work guys!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, cool heroes, fun game modes, and pretty bad monetization but it's all cosmetic. devs have improved communication which has been really helpful",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h2]First week thoughts[/h2]\n[list]\n    [*]Runs well.\n    [*]Hit reg feels good.\n    [*]If you are hard stuck its a you problem.\n    [*]Pretty nice community.\n    [*]Not being able to get old/ previous skins pisses me off.\n    [*]Not being able to set a matchmaking ping cap is annoying sometimes.\n    [*]Nerf Vendetta please.\n    [*]Custom maps are super sick and have immense capabilities.\n[/list]\n\n[i]Will edit and add more when I think of them[/i] :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game literally changed my life. Ever since this game came out, all I can do is play Overwatch 2 from the moment I wake up to the moment I fall asleep.\n\nOriginally, I purchased this game to play with my friends, but after forcing them to play about five games in a row, they all decided they’d had enough for the day. My intense desire for Overwatch 2 wasn’t satisfied, so I moved on to playing against a full room of AI. After my tenth game against five hard AI, I was still not satisfied, but my urge had to wait as I passed out before I could start a new game.\n\nWhen I woke up, I plugged it in and went straight back to playing Overwatch 2. I played one round with five hard AI, but my urge simply got worse. I figured I wasn’t getting my fill since it took too long between my turns. I decided to change it to one hard AI, but after about three games I started to get impatient — to the point that I was screaming at the top of my lungs, telling the AI to hurry up so I could play.\n\nIt was around this time that my mother came into my room, telling me I had woken her up and that she was taking my PC away so she could get some sleep. Rage filled my body and, without even thinking, I punched her directly in the face and started screaming again as her body dropped to the ground.\n\nI took her body, tied it to the bed, and gagged her so that when she woke up she wouldn’t be able to open her stupid mouth and tell me to stop playing the most amazing game known as Overwatch 2 for the PC.\n\nWhen I finally got back to my game, my urge was so intense that I decided to start up a local multiplayer game with two players so I would always be playing. After about five games with myself, I started to calm down and realized that life would be okay — because I had Overwatch 2, and I never had to stop playing.\n\nIn the middle of the sixth game, my mom woke up and I started to hear her muffled screams. I told her she’d better shut up or I’d never let her go. After that, she quieted down — but little did she know, I would never let her go. I couldn’t risk letting her, or anyone for that matter, stop me from playing my game.\n\nIt’s now been ten days and I haven’t stopped playing since that morning. I’ve lost track of how many games I’ve played. I haven’t left my house, and my friends seem to be worried about me because they’ve called my phone multiple times in the past hour. But I don’t have time to talk to people who don’t love Overwatch 2 the way I do.\n\nMy mother stopped moving two days ago and is starting to smell — but I don’t care, because I have everything I need: Overwatch 2.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "NOTE: I played significantly on battle net before I started playing on steam. check my achievement to get a feel for just how much time i've put into it.\n\nwithin the last few months, it's felt like the OW devs have started getting their act together. despite the whole history of betrayal and disappointments, the game in its current state is simply good. proper competition for Marvel Rivals. the \"Mostly Negative\" reviews are primarily a hold-over from that nearly decade long history of BS after BS.\n\nOW2 no longer carries that \"Steve Jobs with the iPhone\" spark that it felt like it had back in 2016, and yes you can feel that it's gone. you have a basic battle pass but compared to other games, even compared to marvel rivals, the battle pass in OW is very well implemented and reasonably player-friendly. some mild sadge moments when you discover a great skin was season locked but ultimately their monetization is not bad, especially when you compare it to other games. \n\nThe gameplay is still as good as you probably remember it, there will always be some heroes over-tuned slightly but again, it's not anything new if you've played other kinds of games. 5v5 is a bit simpler, feels like team-based sumo wrestling where you're just smashing your team against theirs. 6v6 is chaotic enough with enough stuff going on that you rely on teamwork way more no matter what role you play, and it is very noticeable. both modes are available and accessible, and in the 80 hours i've played at the time of release, the devs have already put out 2 separate unique event modes with wacky rules and fun experiments. the custom games browser is also a great source of fun and trying how new things.\n\nTL;DR Overwatch 2 is currently a worthy competitor to Marvel Rivals. the monetization is not bad compared to the rest of the industry, just less generous than OW1's \"here's everything all the time for free\" model. the balance is decent, again not any worse than other games. plenty of fun to be had here, it is definitely worth the $0.00 it takes to start playing.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's good, it's free, a lot of people are salty about the direction the game went but if you're a newcomer you won't even know what's changed",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I've spent over 1,500 hours playing this game on Blizzard and I have to say it's the best hero shooter ever made. I'm absolutely in love with this game and it just keeps getting better with every update.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the most fun game I’ve ever played. You know why? Because it’s 5v5 and it’s all about the team. It’s even more fun if you have friends, but even when you play solo it can still be fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, i always thought Overwatch was some game that only sweaty, 30 year old's would play but, as of right now, only nice and caring people are playing. The game is getting updates, the story MIGHT be coming back, and its getting better because of the competition from Rivals. I hope for the best in this game. Its honestly amazing right now",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "good game dont let the reviews sway you, its old reviews from launch they fixed most complaints of the fanbase",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the kind of game that no one actually likes but you just can not stop playing it\n\nps. delete Zarya from the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm in love with this game ,but it's dying because no one playing arcade anymore only quick match and competitve",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a abusive relationship I haven't loved a playing a game so much but then hated playing it after a gaming session but the adreline and over stimulation when everyone pops ult is thrilling and makes you want to chase that dopamine even more especially when your going against a enemy who is talking rubbish or t-bagging you after a kill it feels very satisfying",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I lost hope for Overwatch about 3 years ago. But seeing how the game got to \"mixed\" on Steam Reviews, Ij ust had to try it again and I have to say that the new game mode is buzzing. Maybe there are some disgusting meta comps I haven't seen yet, but playing with friends gives me the same fun I had all those years back in Overwatch 1. But the new champ definitely needs some balancing before making it into ranked play. That dmg is crazy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A super fun game to grind and get good at. Plenty of characters to choose from!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Yep, the release was a catastrophe. Yep, we never got the promised PvE. Yep, the whole switch from 1 to 2 was really tough on the game. But now, after stabilizing and sorting out most of the problems of this game, I can confidently say that this is the best state this game has been in EVER. \nI miss OW1 dearly, it holds so many warm memories in my heart. It's mostly nostalgia tho, nostalgia that consumed most people and they don't realize that what they really want from the game is all the good few memories they experienced, while totally ignoring the bad ones, where we would sit multiple months with OP characters and Metas. \nNow we have a team who is constantly working on this game. Multiple balance patches every couple of weeks, devs who aren't afraid to experiment with wild patches like the Stadium and talents, while still having attention to small details in the visual design of maps and heroes, still showing charm in new voice lines and beatufil skins. Even tho it is kinda bogus that skins cost too much, which would be one of my only critisicms of the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Recipe for my Caramel-Vanilla Ice Coffee\n-A Mug/Bigger Cup\n-Caramel Coffee Powder (2-3 Teaspoons)\n-Add 2/3 or 3/4 Cold Water\n-Fill the rest with boiling Water (To disolve the powder easier)\n-Add 2 Balls of Vanilla Ice Cream (One is also enough)\n-Add some ice to it and top it of with a straw and maybe some cream if you want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a horrible game to play with friends who use a controller to play this game as a dps and constantly make you lose matches.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite games of all time overwatch 2 is peak gaming and yes maybe it's not like the overwatch we all know in love but it still brings in the character and it can still be enjoyable if you don't look at the negatives overwatch 2 is peak and will forever be peak period. Do i recommend this game? Hell yeah!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you need an escape from marvel rivals this game is more tame. Still many sweats in quickplay, but what game doesn't have sweats in casual game modes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I figured out the social credit system and now I get good matchmaking. I can't stand the voices of half the heroes and there's too few good maps, but Blizzard is kinda really good at making addictive games, so not gonna act like I don't enjoy it when I've been playing intermittently since 2016.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Titlu: Eroi, Haos și Nerf-uri Infinite – Overwatch 2\n\n★★★★☆ Recomand (dar cu capul pe umeri)\n\nOverwatch 2 este încercarea Blizzard de a reinventa cel mai popular hero-shooter al deceniului. Rezultatul? Un joc energic, frumos, rapid, dar și un pic controversat. Dacă-l privești strict ca shooter competitiv pe echipe, e clar că încă are magia aia care te prinde. Dacă-l privești ca pe promisiunea „Overwatch 2” inițială… ei bine, acolo e altă discuție.\n\nAtmosferă & Prezentare\n\nOverwatch 2 rămâne unul dintre cele mai colorate și stilizate shootere existente. Eroii sunt carismatici, animațiile impecabile, efectele spectaculoase, iar designul hărților arată ca un mix de artă futuristă și detalii care fac lumea să pară vie.\nE un joc care se simte “pozitiv”, luminos și vibrant, chiar dacă în interior e un haos total.\n\nGameplay\n\nAici strălucește.\nTrecerea la formatul 5v5 face luptele mai rapide și mai personale. Fiecare erou chiar contează, iar rolurile sunt clare: tank, damage, suport. Abilitățile sunt unice, mecanicile sunt fluide, iar fiecare meci e o explozie de adrenalină.\n\nCoordonarea echipei poate transforma o partidă într-o operă de artă. Lipsa coordonării… într-un coșmar care te face să închizi jocul pentru „5 minute” (care devin 2 ore).\n\nPuncte Tari\n\nGameplay extrem de fluid, distractiv și bine calibrat.\n\nE gratuit — intri rapid, fără investiții.\n\nEroi diverși, fiecare cu vibe și mecanici unice.\n\nStil vizual fenomenal și animații de top.\n\nRitm alert, lupte spectaculoase și meciuri intense.\n\nPuncte Slabe\n\nPromisiunile legate de modurile PvE și campanie… au dispărut în fum.\n\nMonetizare agresivă — skin-urile sunt frumoase, dar scumpe rău.\n\nBalansul eroilor sare uneori dintr-o extremă în alta.\n\nExperiența depinde TOTAL de echipă; fără coordonare, te enervezi instant.\n\nComunitatea poate fi… intensă, ca să zicem frumos.\n\nConcluzie\n\nOverwatch 2 nu e revoluția promisă, dar este un shooter excelent atunci când totul se aliniază. Are un „fun factor” uriaș, un stil vizual superb și un gameplay rafinat ani la rând. E o experiență ideală pentru cei care iubesc luptele pe echipe, eroii cu abilități speciale și adrenalina la fiecare colț.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its still a fun game but they nerfed all fun characters to run and tanks are overpowered.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played Overwatch from launch day but stopped playing when Overwatch 2 came out. When I picked it up again in 2025, however, I was surprised to find it vastly improved. Maybe the best it has ever been.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love hate relatrionships\nthis game has pretty much nothing to do with ow1 btw",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally the best it's ever been. Quick play is fun and always brings me back for more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do not let steam hours make my time on this game seem less than what it is. I've played for hundreds of hours and this game still has a core foundational experience that makes it the hero shooter it always has been, but it is hard to ignore they are running out of ideas to keep the game fresh and interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Games was bad during release, but got better overtime.\r\nStill can't match OW1, but i think it's still worth it for some people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its still a great game, i dont regret coming back (i have 300 hours off steam don't mind the low playtime)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down, one of the best and funniest games I've ever played. Great time and bonding with friends and homie time.\r\n\r\n1,111 hours as of the writing of this review.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, its pretty fun, community is nice outside of competitive, just don't use vc and you'll avoid the cringe people who's looking for women in vc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overwatch 2 is great and all, but let’s be honest—this game is basically Kiriko & Her 4 Random Strangers Who Never Touch the Objective. Playing Kiriko feels like being everyone’s magical fox-powered babysitter. Your Genji jumps into the enemy backline? Of course you have to save him—again. Your tank thinks he’s immortal? Perfect time to throw a talisman and pray to all available spirits. Her Protection Suzu is basically “Nope.exe,” her teleport is “Uber Eats but for healing,” and her Kunai are scientifically engineered to crit exactly one millimeter next to the enemy head. But when you finally hit that crispy headshot and your whole team survives a fight thanks to your clutch Suzu… you feel like the coolest anime healer-ninja ever created.\n\nOverall, 10/10 for Kiriko.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game and good for long sessions just might take too long to get in a game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Since I’ve been playing Marvel Rivals almost all the time lately, every time I come back to Overwatch 2 the difference is immediately noticeable. Matches here — especially in quick play — feel much more relaxed. Not everyone is tryharding all the time, and the community, while not perfect, isn’t nearly as toxic as I expected.\n-\nOW2 has definitely had its ups and downs, but it’s always been a fun game at its core. Personally, I still enjoy it more than other hero shooters: the gameplay is fluid, the heroes have a lot of personality, and even though there are still issues to fix, that’s normal for a live-service title of this scale.\n-\nAll in all, Overwatch 2 isn’t perfect, but it still manages to deliver genuine fun, and it’s always nice to return to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not a huge Fan of this game. i  think it were better when they had Levels rather than character levels.. uhhhhhhhhhhh yeah !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly they've started doing better nowadays, matchmaking is still kinda ass on occasion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thought it was going to be ablsoutely garbage but its fun if you have friends so get friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a bad game but lowk isnt THAT good but its the only video game with illari so i have to play </3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played overwatch 1 when it first cae out but stopped right around when they introduced brigette. After some time and being largely personally disconnected to the game, coming back and paying is surprisingly good fun. It's monetization methods are still atrocious but overall its still fun to play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do I play the game or do I buy skin bundles worth more than a modern AAA game? Tough choice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SImply put its fun again and they went back on allot of the dumb decisions they did starting overwatch2. You can play everyone. You can earn skins. new modes and characters are fun.\r\n\r\nBeen having a good time with the homies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't play it, very shit game, any hope of ranking up will get crushed the next game. Still gonna play it though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tell me why so many negative reviews I mean this game keeps up on updates and the overall game is mid \nnow u can't just do a negative review just because of the players being too trash or what not",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the worst games i have ever played. Blizzard fails me at every corner no matter what they try. \r\n\r\nI love this game so much. If it didnt exist i would be happy. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Obviously the steam playerbase ran this game into the ground when it was launched on here but I genuinely think the game is worth a chance. love the characters to death even if my matches make me want to rip my hair out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i cant believe im saying this... OW2 is actually in a really good state. It is fun, esp at lower ranks (where most ppl are) \r\n\r\nI played OW mostly during the pandemic (2020) and this is more fun than OW1 was during that time. Try it.\r\n\r\n(Powercreep is pretty real though)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for a reason to come back to this game, Stadium mode is it. It's like a MOBA style where you level up and pick perks between rounds. It's so much fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's gotten better they've been cooking and trying. And I do have fun sometimessss.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST state its ever been including ow1. the people making the game bad are greed and his 6v6 followers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its very fun and replayable, people who don't like it can't work with a team",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "We get it, Blizzard sucks.\r\nOverwatch as a game however, if we rewiev it seperately, is actually pretty good.\r\nIt is very polished, which is to be expected of a life service game after 3 (9) years sure, but a positive thing either way.\r\n There are over thirty maps, combined with a fairly repectable roster of playable heroes the game continues to feel quite fresh.\r\nThe gameplay is fun with a high skill ceiling with every playable hero playing differently than the last.\r\nHowever what has drawn me in the most is probably the lore and character design, which sadly felt a little less prioritised with the latest hero additions, but I am not talking about the for lack of better word \"goon designs\", I am talking about characters like Ana, beeing a well written badass grandma or Wrecking Ball cuz you know, it's a giant hampster in a ball. Overwatch has managed to create an intriguing world full of lore and stories which connect to the game(play) via voicelines, maps and the heroes themselves and makes the experience feel a lot less hollow if especially if you take yourself some time to actually get yourself involved with the lore drops, comics and cinematics.\r\n\r\nOn a side note, if you decide to pick the game up, you might wanna consider turning off text chat if you let yourself get tilted easily, cuz unfortunately there will be people who love to just be salty and annoying while making sure everyone else in the lobby  knows about their feelings towards certain players every now and then. So especially while still getting the hang of the game it might save you a lot of stress and annoyance to just not beeing able to see whatever creative words other players might come up with.\r\nHowever at the same time, I've been lucky enough to meet quite a few friends via text chat, so if you are looking for people to play with, it might not be stupid to keep the chat feature active after all or turn on again after you feel comfortable enough. (or you try your luck on the overwatch subreddits or discord server)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have hundreds of hours in this game and I can't escape... save yourself",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a really fun game you will enjoy it 100% take it from me i played many games but didnt have the same fun as in overwatch2.thank me later after playing it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After many hundreds of hours in OW1, I quit a short while after OW2 launched, after seeing the insane monetization decisions they made back then. You had to grind like crazy to get a skin, which is fine I guess, it's a skin, just cosmetic, but what bothered me even more was that you actually had to grind to unlock new heroes too, which was a wild decision, since you didn't have all heroes unlocked going into competitive, which ruined the balance completely. \r\n\r\nAnyway, Blizzard surprisingly learned from its mistakes and made a ton of positive changes to everything in the game, after checking it out again this year for the first time since 2022, it really feels like a great and fun game again, and the perk system keeps the competitive mode very fresh. They're a lot more generous with free loot boxes as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thank you marvel rivals for giving blizzard a reason to make this game great again, though its not perfect it still is amazing and fills the hole where OW1 and paladins used to live",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overwatch 2 é um jogo multiplayer que depende totalmente de trabalho em equipe. Os personagens são extremamente carismáticos, a lore é interessante, os gráficos são lindos e os mapas muito bem feitos. O novo modo Stadium deu uma vida nova ao jogo, deixando ele com uma vibe de MOBA competitivo que ficou realmente divertida. Ainda assim, falta aquela sensação de recompensa e todos os personagens estão sendo adicionados aos poucos no modo novo, ajudando no equilíbrio.\r\n\r\nMas, claro, nem tudo é perfeito — ou quase. Com o lançamento de Overwatch 2, o jogo ficou extremamente ganancioso com skins. A graça de colecionar tudo de graça nas lootboxes em Overwatch 1 simplesmente sumiu, substituída por moedas douradas que quase não aparecem pra quem joga sem gastar dinheiro. Isso desanima demais, porque antes era tudo mais acessível e recompensador.\r\n\r\nMesmo assim, eu amo Overwatch. Enjoei lá em 2020, parei, mas voltei em 2025 e já tô viciado de novo. O jogo ainda tem algo que prende, apesar dos tropeços.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very good but gets repetive but i would try it and if you find its good then your welcome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been having a ton of fun with OW2! I played rivals for around 6 months and needed a break, and OW has scratched the itch that Rivals wasn't able to satisfy. If you were previously burned by OW2 like I was you should give this game another shot. The perk system really breathed life into it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "needs 3v3 and less microtransactions, was at its peak at the start due to its innovation of character design and abilities",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have 100s of hours on this game on the Blizzard Client, I've played since 2016. You can tell from my achievements that I am not lying about that fact. This game would not be worth the 60 dollars it was back in the day due to all of the microtransactions, but because it's free I'd say go for it. You'll probably end up spending money on skins but that's just a given.\nAs for the gameplay, as of writing this review, it's the best it's been in years balance-wise. That is to say, it's nothing like it used to be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great rpg style game with amazing lore and voice lines. character personalisation/skins and a way to communicate with your teammates via voice chat or simply through the games built in voice lines. all characters are detailed and have great animation styles making the game feel more immersive and real. 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing since I downloaded the Beta on Xbox in 2017 or whatever. \r\n\r\nIt's the reason I bought a PC and though it went though ups and downs, it's finally getting back on the right track. \r\n\r\nAlso it's one of very few games that run perfectly on Linux with proton.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "良い所\n・競技性が高くゲームに綿密な戦略がある\n・キャラが可愛くスキンも豊富にある\n\n悪い所\n・やってるいる人の質が著しく低い",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good casual fps with a cast of mostly well-designed characters, though the recent trend of only releasing new characters with crazy movement is slowly removing the primary part of the game that i enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recently got into this game from my bf playing it. It's been pretty fun and i enjoy playing with him together, not sure why there's so many negative reviews but I've had fun playing this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even tho this game gives me incurable brain cancer and pushes me to get a lobotomy, I always somehoe find a way back to this game. It's good when your teammates don't suck each others dick's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "baktınız bugün aim iniz kötü ama fps oyunları oynamak istiyorsunuz, açın bunu oynayınç arkadaşlarla çok zevkli ve kombo yapabılıyor olmak da çok güzel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is like a toxic relationship that you always come back to. I'm really enjoying the Stadium mode, and I hope they improve all the other modes as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mostly play turn based jrpgs. I think this is fun because it feels like what would happen if you made a traditional turn based rpg into a real time multiplayer game. It has debuffs, buffs, ultimate attacks, and the same strategy of prioritizing eliminating the buffer/support first, just like how you would in a turn based game. But now since it's real time, you also have to consider positioning and synchronizing with your team. I understand that overwatch gets a lot of hate but I think it still deserves aleast a try with your friends or something.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good well rounded game. your skill accually matters when playing any char.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i dont really watch a lot of \"news\" about developers and stuff especially not ow2 so thats why this review is positive, because i think that the actual gameplay loop of this game is super fun (and i usually play with friends)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone with 2000 hours across PC  and PS devices, I can say that if you enjoy arena shooters you will probably enjoy this, even with it's occasioally god-awful matchmaking and sometimes busted abilities or silly managerial decisions by Blizzard.  I recommend playing with people you know, though, if possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "needs more ass ngl... its alright ig tho. still good n fun but if they add a caked up ana skin i think the game would really take off. i cant blame the small groups of devs tho its just personal preference at the end of the day. i would just like to see more ass in the game especially when i crouch down as lucio. i need to see more of caked up ana and more caked up juno. like make that shit really jiggle it would make the game 100X better!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Honest long review by me.\n\nI’ve been playing Overwatch since December 2016. Back then, the game actually meant something. Matches took skill, teamwork, and timing. Pulling off a clutch felt earned. Heroes had identity, fights had weight, and every win was yours. Fast forward to 2025 and I barely recognize what I’m playing. The soul is gone. It’s a hollow, frustrating shell of what once was one of the best games ever made.\n\nMatchmaking has been trash for YEARS. I don’t know if it’s EOMM, SBMM, hidden throttling, or just pure incompetence, but matches feel predetermined. One game you stomp, the next you get thrown into a blender. It never feels like you win because you played well — it feels like the system decided the outcome the moment you queued. It’s exhausting, and it’s been this way since I first touched the game.\n\nSeason 9 was the point where Blizzard completely killed skill expression. Every patch since then is built around flattening the game and making precision irrelevant. Tanks are raid bosses, supports are basically DPS with insane sustain, and DPS is just… cosmetic. You can land every shot and it still doesn’t matter because the sustain loop is busted. They call it “accessibility,” but it’s really the death of competitive integrity. Years of learning mechanics, tracking, positioning — all of that means nothing now.\n\nThe devs keep insisting 5v5 is “better,” but all it did was destroy the role ecosystem. Tanks feel awful unless they’re overtuned, supports only shine by turning into mini-tanks, and DPS is irrelevant unless something is accidentally broken. Every balance patch feels like it was designed by developers who’ve never played above Bronze. Instead of fixing meaningful issues, they buff easy heroes, nerf depth, and pretend they’re saving the game.\n\nThen we have the company behind all this. Blizzard isn’t Blizzard anymore. The harassment scandals, the studio culture issues, the PR nonsense — everything behind the scenes mirrors the state of the game. Hollow, directionless, and full of ego. They talk about “trusting the vision,” but the vision is a dumpster fire.\n\nAnd the hero identity? Completely gone. They’ve abandoned edgy, skill-heavy heroes like Hanzo, Sombra, and Reaper. Permanent underdogs now. In their place, we get shiny, safe, streamer-friendly characters. And speaking of new characters — Vendetta is literally a knock-off Magik from Marvel Rivals. Same look, same vibe, same glowing magic-sword aesthetic. It’s embarrassing. They really thought their copy could compete with the actual Queen of Limbo? Be serious.\n\nTo make it even funnier, Blizzard emailed me saying I “qualified for a free Premium Battle Pass due to login issues.” I never had any. They’re just handing out passes like apology coupons now. What a joke.\n\nThe community is another disaster. Somehow people think Overwatch 2 is at its “peak.” They cheer for pointless modes like Stadium — something nobody asked for — while the actual competitive experience is falling apart. It’s Fortnite with ultimates now. Casual hype drowns out any real feedback, and anyone who points out the game’s decline gets treated like the problem.\n\nI’ve actually had to force myself to play other games just to feel skill matter again. Need for Speed — a racing game — gives me more satisfaction because your mistakes are yours. Meanwhile, Overwatch feels rigged or random. Wins and losses feel like matchmaking dice rolls, not performance.\n\nCustom games used to be a place to escape the chaos. Now they’re ruined too. Fake-friendly lobbies full of creeps, drama, harassment, and weirdos. Blizzard does absolutely nothing. They never have. Moderation is cosmetic — just like half the game mechanics now.\n\nThen there’s the monetization. Every new season is “BUY MORE KIRIKO SKINS,” “Check out the new bundle,” “Look at the new crossover event.” Everything feels like a commercial. Even hero buffs feel like marketing pushes. The game’s direction is driven by engagement metrics, not gameplay health. They don’t balance for fun or fairness — they balance for attention spans.\n\nIt’s been a slow, painful decline. I kept hoping the game would recover, that Blizzard would fix matchmaking, revive skill-based play, bring back hero identity. But every patch proves they’re going the opposite direction. The game gets more chaotic, more casual-focused, more empty.\n\nOverwatch now feels like watching a corpse move. The animations are pretty, the maps are nice, the heroes look cool — but the soul is missing. There’s no tension, no clutch value, no sense that your input matters. Winning rarely feels earned. Losing feels predetermined. Everything that made it special has been replaced by noise, spam, sustain, and monetization.\n\nThe casual community celebrates meaningless skins and overhyped updates while ignoring the actual problems. They cheer for fluff while the core rots. It’s painful to watch a game you loved slowly sink while people clap at the fireworks on the deck.\n\nI’ve held on for too long. I kept telling myself it could get better. But it hasn’t. Every patch reminds me:\nthe devs don’t care about skill, don’t care about veterans, and don’t care about the identity this game once had.\n\nOverwatch used to be a masterpiece.\nNow it’s a flashy, hollow shell propped up by marketing, casual hype, and nostalgia.\n\nI wish it wasn’t this way.",
      "voted_up": false,
      "votes_helpful": 150
    },
    {
      "review": "please teach the players how to actually play the game. ts is exausting everyone thinks they know everything and a loss can never be their fault. literally the most ignorant player-base iv'e ever seen.",
      "voted_up": false,
      "votes_helpful": 137
    },
    {
      "review": "Only play this game if you’ve got a full stack of friends, seriously. Playing solo in Overwatch 2 feels like punishment. The playerbase swings between people who \"ragebait\" you and people who look like they installed the game five minutes ago. When you queue alone, you’re basically praying the matchmaking gives you at least one teammate who actually knows what’s going on.\n\nAnd speaking of matchmaking… it’s awful. You’ll get teammates who throw, afk, leave mid-match, or blame everyone but themselves. While the enemy team somehow looks like they were hand-picked from the Top 500 leaderboard.. It never feels even or fair.\n\nThen there’s the whole EOMM thing.  You’ll win a few matches, feel like you’re finally on a roll… and then boom, the game slams you into a long losing streak that feels completely manufactured. It’s like the game is trying to keep you on this emotional rollercoaster so you keep playing “just for one good match.”",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "Stupid ahh developer for asking my number and when I put it with the CORRECT country and CORRECT number it wont accept saying the ‘post-paid number’ shii. DO YOU ALSO NEED MY FREAKING BLOOD SAMPLE?!",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "Juego de mierda, servers de mierda, ni aunque me pagaran vale la pena. Cuando juego estadio me tira en servers de OREGON! Y no solo eso si no que me desconectó 3 VECES en una partida, y cuando termine la partida (de pedo), me salgo y me dan cooldown. JUEGO DE MIERDA, COMPAÑÍA DE MIERDA, SERVERS DE MIERDA, EN RESUMEN UNA MIERDA.\n\nShitty game, shitty servers, not worth it at all. When I play satdium I get connected to OREGON servers wtf. I also get disconnected multiple times even though my net is just fine. SHITTY GAME, SHITTY CORPORATION, SHITTY SERVERS.\n\nEDIT: FUCK YOU BLIZZARD.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "Blizzard, I swear you’ve achieved the impossible: you made my friend who’s rich, handsome, and theoretically irresistible even more of a virgin than before. This game turned him into a full-time Mei main and a part-time social catastrophe. The man desperately needs to explore a deep cave somewhere that isn’t on your minimap. 0/10, please give me my friend back.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "It's not really Overwatch 2. It's just Overwatch 1.5, but with a worse economy and less fun.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Top 5 worst games i've ever played in my entire life, it is one of the most consistently unfun games you can play and the ranked game-mode has queues so atrocious that you basically cant play and you literally cant in a four stack.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Very draining game that is not fair to solo queue at low ranks, no matter how hard you try it's mostly RNG and very unconsistent. You get steamrolled or steamroll. Lots of balance issues.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Trash game, but widowmaker have a good ass",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Overwatch 1: \"Oh that's a cool skin, I can't wait to grind some games to earn it!\"\n\nOverwatch 2: \"Oh that's a cool skin, too bad it costs more than a video game does...\"\n\nThis is probably O2's biggest ongoing problem, it's just kills all fun when every cool thing in the game is locked behind credit cards. I want to play the game, not pay the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game is ran by a bunch of pdf files that like children preferably under the age of 11. I also paid $60 for the OG game and they barely gave me half a bj in return",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Hazards & Vendettas abs are great - other than that, playing this game is borderline mental torture. With every minute passing my brain is getting smoother and smoother just thinking about playing this game.\r\n\r\nEver since release it's evolving backwards...\r\n\r\nHazard is juicy tho ngl",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Bad game, toxic community\n\nevery game i go in it's the same characters just constantly chasing me. \n\nWhen i say something in chat i get barraged by the enemy team saying \"ez\" or \"get good\".\nAll these people care about is skill and not fun, which i don't get why they bother queueing quick play.\n\nThe porn was always better than this game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I thought the game was good but if you have anything else than a stellar connection don't touch it. 8 hour cooldown because I lost internet for less than 2 minutes is awful. Terrible design",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is painful, go with it with friends to make it a bit less painful/spread the pain.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The community is awful. Nobody is using voice comms. Just rage in text chat all day.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Wasted time downloading this game only to be locked out of playing it. \nYOU CANNOT PLAY WITHOUT GIVING YOUR PHONE NUMBER, AN INCREDIBLY PRIVATE PIECE OF DATA.\nHaving to make a Blizzard account for a game I'm trying to play through Steam was already moronic, but I did that, but it is impossible to play without adding a phone number. Despicable and dangerous.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Awful balance, community, monetization, company, and reception. It is a joke this game is on a \"redemption arc\" when most of the problems from OW1->2 are still present, like tank being the most miserable experience possible - yes, I love the match being dictated around one player and winning or losing based on the tank. 6s are also back but it doesn't mean much, considering the tanks are bloated due to the balance changes they received to function as solo tanks in 5v5. Stadium is another problem, isn't it wonderful to run into a hard counter and just feel useless for the whole match?\n\nThis is a continuation on the balance problems, but stadium's shop and the perk system in both also suck, the changes are of wildly different quality, some characters get really good horizontal progression and new abilities, some just get a slight vertical improvement, and some (Lifeweaver lifegrip minor perk) get what should be base kit. The balance is also factoring these in too, balancing the perks and base kits around them, which is dumb. The \"choice\" doesn't amount to much when one perk is significantly better than the other, and Stadium suffers a similar fate. Why try experimenting if you can just play the meta?\n\nOW1 died for this garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yes I have over 1-2k hours across multiple platforms, and yes I do enjoy playing the game. But I can't in good faith recommend this game as Blizzard has taken a massive dump on the chests of every single OW1 player who has:\n1). Bought the game\n2). Expected the promised story content\n3). DPS Doom enjoyers.\nThe game has a pretty nasty community and you will for sure experience toxic behaviour if you're not an already good player who carries every game you've been in. The game has a very unbalanced roster with blatant counters, which isn't a bad thing unless you're solo queueing or have a lack of coms. \n\nThere's more I can say about this game, but I fail to find the words for it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "my original account got banned cause i was hacked. when i changed all my passwords, i thought i was gonna get a suspension but no i got perma ban from my MAIN blizzard account. i played back on playstation and had alot of damn skins and i had LEGO bastion which i think is rare (correct me if im wrong pls) when they banned me, they DELETED my entire profile so that account i used to have during the launch of OW1 is all gone to the fucking shadow realm. game is garbage and now i play rivals which is better (i dont care what anyone else says about rivals)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Some of the character designs in this game are so gross it's unplayable",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Would much rather devour an airplane bolt by bolt than play this toxic and awful game ever again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do NOT recommend, wasted 500 hours of my life on nothing.\r\nGreat memories tho, just not worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the only issues i have with the game is the servers, gameplay, the community, ana, ashe, baptiste, bastion, brigitte, cassidy, dva, doomfist, echo, freja, genji, hanzo, hazard, illari, junker queen, junkrat, juno, kiriko, lifeweaver, sigma, mei, tracer, mercy, pharah, vendetta, moria, reaper, widow, rein, torb, winston, zen, sym, zarya, soldier, roadhog, sombra, wreaking ball, sojourn,  ramattra, mauga, venture, wuyang, and the maps, amd everything else with this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game fucking sucks, i play because i have norhing better to do",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Noah's Ark couldn't even carry these animals in this dumb game, Even if we were to remove all the animals off of it, The people in this game lack a frontal lobe and seem to have been lobotomized and they are lacking chromosomes, They all behave like they were coded by someone who got bored halfway through writing the instructions for \"basic intelligence\". My teammates in this game do the dumbest things ever where it makes you think that their entire personality was assembled from rejected tutorial prompts. \n\nDon't play this game, you get mean ass teammates and get blamed for everything. People smurfing,\nBad matchmaking, Money hungry devs that don't even care about the game anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you spend money on skins, battle pass, or any monetization practice in this game, you should be sent to a labor camp to work the land and read poetry.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As terrible as a company can get. I heard so many negative things about the gameplay but i still wanted to give it a try for a long time. So i finally installed it, and after a horrendous process of creating an account, i can't even launch the game because it requires some \"post-paid\" phone number!? it's like they're actively trying for new players to not play their game. It's so strange. No wonder they get so much hate! Save your time and stay away from ts.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Welcome to the democratic world of Overwatch, where the game director is a politician. He starts every blog post and update with \"We are listening to the players\".\n\nNot gonna hold my breath waiting for the day he actually does some directing instead of mindlessly taking feedback from everyone and trying to be a people pleaser. Guy is literally 2 blog posts away from asking the public for ideas to make up for his lack of plans for this formerly great franchise.\n\nThe game is a hollow shell of its former glory since Jeff Kaplan left. Jeff left and took the whole world of Overwatch with him. What's left here is a skin shop disguised as a game, with newer characters literally built from the Sims 4 Create-A-Sim. And flavor text that tries to pass for lore. \n\nGame Director doesn't care about any of the characters. He only cares about pleasing the people, and sadly, all the people want are skins. Well done us, and well done sir game director for not having a backbone to do right by Overwatch. \n\nAt the state the current world of Overwatch is, I wish I never knew Overwatch so I didn't have to grief for more than a whole ass year. Blizzard used to be a company that built stories and worlds. Now all they build are cosmetics to sell.\n\nWe traded the lore and the world of Overwatch for skins. We built a cinematic engine in game just so we can use it for skin trailers, we recycle PvE content into brain dead game modes that nobody plays. \n\nBalancing and design for the game is also completely stat driven, so if you love seeing balancing done based on the statboard that is the source of all toxicity, do join us. Used to be heroes were able to do more than just dmg and heals, but now most heroes particularly the DPS lineup has been homogenized to feed the statboard. \n\nAll that aside, the core gameplay is good and mostly polished, as it has always been since OW1. So basically nothing changed but everything changed.\n\nIf you like skins, come play. We've got plenty at the best prices in the industry. \n\n\"Overwatch was shutdown for a reason\" - (Vivian Chase, back when there was lore) Now we know why she said this.\n\n\"The Overwatch I joined was about raising the world up\" - (Also Vivian Chase, back when she wasn't just a mannequin for skins) Yeah this ain't the Overwatch I joined.\n\nThis world used to be somewhere I felt home. Now its just a dead game to me. Sorry I meant skin shop disguised as a game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The community is awful. Nobody likes new players. Being a new player is not enjoyable at all. It's a pointless, souless, stupid, awful game. Everything is unfair. I'm writing this in a fit of rage at how tired I am of this game. Truly don't even try it. If you do, you will wish nothing but an end to the suffering.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is for doo-doo dunder heads who eat their own caca and enjoy walking on hot coals all day.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have been playing this game consistently for 5+ years. I have played this game like its a part time job. I'm talking 20+ hours a week. I've taken small breaks at times for my own sanity, but today, I am fed up. I have put so much time and money into this game that doesn't give an F about balancing. When you think of games, you think that they're supposed to be fun. I have been chasing the sparkly feeling I had when I first played Overwatch 1 and its gone forever. 5v5, Tank-Doomfist, never ending support nerfs, unbalanced lobbies, smurfing, boosting, and the unapologetic cash grabs have ruined this game. The launch of Overwatch 2 absolutely obliterated any trust between the developers and the players. And they've really never earned that trust back. Blizzard cares about money, they don't care about you or your experience playing this game. If I can stop even one person from playing this game then leaving this review will be worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "honestly, with all of the negative reviews and bad rep this game gets when i first tried it out it honestly wasn't terrible. the heros feel unique for the most part and it has nice maps, but the community is so unfathomably rude and obnoxious to new players and anyone who is simply playing for fun or learning a character it makes me hate the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst game when it comes to voicechat, communication and teammates.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "widow's assets are too distracting, only a good playable game if you like men",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I like to creep around my home and act like a goblin\r\n\r\nI don’t know why but I just enjoy doing this. Maybe it’s my way of dealing with stress or something but I just do it about once every week. Generally I’ll carry around a sack and creep around in a sort of crouch-walking position making goblin noises, then I’ll walk around my house and pick up various different “trinkets” and put them in my bag while saying stuff like “I’ll be having that” and laughing maniacally in my goblin voice (“trinkets” can include anything from shit I find on the ground to cutlery or other utensils). The other day I was talking with my neighbours and they mentioned hearing weird noises like what I wrote about and I was just internally screaming the entire conversation. I’m 99% sure they don’t know it’s me but god that 1% chance is seriously weighing on my mind.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Forced to play this game, so ass I couldn't even get in, spent 2 and a half hours literally just trying to get battlenet to work, only to learn this is a recurring issue that's been going on for 2 years. Multibillion dollar company btw.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "ranked is pain. fun game. it's like a souls game, except instead of overcoming great adversity, you're FORCED to overcome the URGE to END YOURSELF after a 6 game loss streak. great with friends :)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "first you make me create a battle.net account and then you want me to link my PHONE NUMBER to it? it's like this game doesn't WANT to be played by anyone self-respecting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I shouldn't need to give Actiblizz my phone number to play a free-to-play game. Only discovered this after downloading it because I didn't see the tiny, grey writing at the bottom of the store page saying so, my mistake I guess.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "In the recent months (second half of 2025) there's been a huge SPIKE of:\n1) Cheaters. Aimbot users obviously visible in PotG and in replay.\n2) Smurfs. People create new accounts over and over to play against weaker players in lower rating games. In quick play too (there's a hidden rating for balancing).\n3) Boosters.\n4) Trolls.\n\n5) A bit an off-topic but many old players coming back - matchmaker doesn't know how to balance them: with the 4 previous points this 5th adds to the mess.\n\nBans don't work - those players just create new accounts and continue doing the same.\n\nBlizzard has done something horribly wrong, making new account creation waaaaay too easy.\nI'd rather prefer phone verification along with other stricter measures. Makes less comfortable, but it's worth it.\n\n\nNot changing this review till they fix this huge issue.\nIn other aspects I love this game. I came directly to OW2 without prior nostalgia about OW1, and from what I've seen in classic modes and other sources (including videos), OW2 is significantly better than OW1.\nThere are some issues here and there but nothing critical, EXCEPT the above points.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate that I have to not recommend the game but Blizzard did this to themselves :((\n- No story mode, if it was made right this would have broken records but for them it was better to micro transaction the shii out of this game.\n- One of the worst ranked/competitive matchmaking up there with Apex Legends and Rocket League, I am in no way a pro player, but at least I have the decency to not play like a vegetable on wheels or have the survival sense of a bottle cap, while I am trying my best with 10-20+ players saved per game or out-damaging dps or out-healing the other supports in the game.\nMaybe someday they'll wake up, but that day might never come or I'll be too old or dead to witness it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hi, someone whose been playing Overwatch since it first came out... Oh boy has it been a ride and nor a good one. My hubby and I originally paid for Overwatch when it first came out. Let's just say I'm the only who plays it now and my hubby use to be diamond (which used to be top 500) when we played. We were pretty f*ing pissed when we heard Overwatch 2 was going out and it was going to be free. Like okay sure, but you're gonna at least give us our money back right... Yeah nope... Never saw that money back... And they got rid of lootboxes...\nBlizzard as a company is garbage. We already know this, don't give them your money. It's not worth it. The store is incredibly overpriced, it's ridiculous. Like an actual joke. Good and amazing skins are usually behind a paywall when it comes to any game but Blizzard is just frickin greedy. Sometimes the Battle Pass is worth it and as someone whose tried to play enough so I don't have the buy the battlepass, yeah no... You can buy the battle pass one season and save enough overwatch coins to buy it again but they just want you to pour more money to this game and its not worth. Competitive... To put it lightly is a f*kin sh*t show. It's actually terrible and most of the time your whole team is going to leave and it can be brutal. OW2 community is also garbage. They are incredibly toxic and ppl will literally tell you to off yourself in quickplay. Don't even get me started on how many times they have re-worked heroes. \n\nI would like to give this game a positive review amongst tons of bad and it's difficult. There aren't many redeeming qualities about this game. Sometimes I do come back to it, usually to play a new hero, then I remember how bad it is.\nSome redeeming qualities are that they added lootboxes back but that's not enough to fix a community that is so heartbroken. They abandoned Overwatch lore and to make up for it they keep doing collabs that again are behind a huge paywall. \n\nThe game is free so yeah, why not give it a try but honestly. There are far better games out there to spend your time and money on.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's ruining my life, but I still play it. I like Sigma's, Winton's, Doomfist's, Roadhog's feet",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible and trash game. I have been playing since Overwatch 1 and I have wasted so much time and money on this game. \n\nOverwatch 2 is supposed to have better matchmaking yet I’m being grouped with Silvers in a Plat game. People refuse to admit they are being diffed and instalock the same hero anyway! And somehow it’s never their fault!!\n\nOverwatch players are also so toxic. How do you manage to create such a hateful community?? I can’t even play my favourite hero without someone throwing the game if I don’t swap the moment they demand that I do. \n\nThere should also be some kind of restriction on grouping. Teamers are the worst to play with; they refuse to tell their feeding friends off and instead gang up on others. \n\nMaking this game free has turned it into hell on earth. I haven’t received a single dime back from when I bought this stupid game, when it was still good. Not even any in-game perks. Blizzard doesn’t care about loyalty to the players who have stuck around since Overwatch  1. \n\nHonestly, I can’t even remember the last time I was happy playing Overwatch. Do better Blizzard.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR: avoid!! for new players.\r\n\r\nThis is a incredibly unwelcoming game for new players, such as myself who wants to enjoy my time off with gaming. Being new means quite literally unfamiliar with the game play and the game mechanics, and will be in-experienced in comparison to those who have played the game longer. Overwatch 2 has been out for so many years now that the landscape for this game has become incredibly toxic to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "this game adds stupid heroes for little babies who cry for mommies milk and need to have their hand held when going to the restroom",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I rather play Dead By Daylight with permanent broken status than this trash heap of a game. Only going up against the same \"core\" characters over and over and over. The rest of the roster shouldn't exist because they don't even get used.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is just a shell of what it used to be, balance is AWFUL, broken promises, monetization is as bad as it gets. recycled gamemodes constantly, the list goes on dont play this game its honestly one of the worst shooters ever made it lost everything that made it unique i played for years and years and years all the way from launch to early 2024 and theres just nothing redeemable about the game CONCORD was better than this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is the worst fucking game ive touched in my life, id rather get fisted by hazard than play another game on this dog ass game. fuck you blizzard, fuck you sombra, and most of all FUCK you Jackson Alexander Joy",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I preordered this shit. Why the fuck do I gotta pay 15 fucking dollars for campaign? I just got scammed.\n\nI came back to this after years of hiatus. I don’t dislike it. But I’m far away from liking it as well. It’s fun if you’re playing with friends, I didn’t not have a good moment other than losing. But everyone hates losing, because you’ll just be a loser. \n\nFrankly, the amount of in game token and shit can be ignored. Is it sad to see? Yeah, back then it was just loot boxes. Making the game free wasn’t a mistake, but making the game make you pay $100 for a nice looking skin is fucking ridiculous to see.\n\nIf I want to fuck around, maybe win some matches, have a decent time with friends. The game isn’t terrible. However the state that it’s in compared to overwatch 1 breaks my heart. Overwatch falloff needs to be studied.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Decided to try this out again after a while, but turns out its gotten even worse than ever. This new perks thing is probably the worse thing they could've done.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is the worst fucking game i have ever had the displeasure of playing in my entire life save yourself the time and just shove a sandpaper dildo up your ass instead, it produces the same experience",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "ban system is terrible. How are you gonna ban people for a month+ for calling someone shit? How are you gonna have any competitive game and not allow for ANY trash talk at all",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Why You Should Not Play Overwatch 2: A Critical Examination\nThe world of video games is constantly evolving, with new titles promising fresh experiences and improved gameplay. However, not every sequel lives up to its potential, and in some cases, it even detracts from the legacy of its predecessor. Overwatch 2 is, unfortunately, a prime example of this phenomenon. Once hailed as a promising evolution of Blizzard’s beloved team-based shooter, Overwatch 2 has instead become a cautionary tale in the gaming industry—a game riddled with design missteps, corporate greed, and community disappointment. This essay explores the many reasons why Overwatch 2 is a horrible game and why gamers should think twice before investing their time, money, and hope in it.\n\n1. The Illusion of Innovation\nWhen Blizzard announced Overwatch 2, fans expected a meaningful sequel with significant improvements and new content. Instead, what they received was an incremental update masquerading as a new game. The much-touted shift from 6v6 to 5v5 gameplay did little to fundamentally alter the core experience. Maps, heroes, and game modes were slightly tweaked, but the changes felt superficial at best. Many players noted that Overwatch 2 played almost identically to the original, with only a handful of new heroes and maps that could have easily been introduced as updates to the first game.\n\nPerhaps the most egregious example of this lack of innovation is the handling of the promised PvE (Player vs. Environment) mode. This feature was heavily marketed as the cornerstone of Overwatch 2, setting it apart from its predecessor and justifying its existence as a sequel. However, Blizzard eventually scrapped the ambitious PvE campaign, leaving players with a glorified patch rather than a true sequel. This broken promise eroded trust and demonstrated a fundamental disregard for the community’s expectations.\n\n2. Monetization and Corporate Greed\nIf there is one aspect where Overwatch 2 stands out, it is in its aggressive monetization strategies. The original Overwatch adopted a “buy once, play forever” model, with cosmetic items available through loot boxes that could be earned through gameplay. While loot boxes are controversial, they at least allowed dedicated players to unlock content without spending additional money.\n\nOverwatch 2, on the other hand, is free-to-play—but at a significant cost. The introduction of battle passes, expensive cosmetics, and paywalls for new heroes has transformed the game into a cash grab. Players now have to pay real money or grind for dozens of hours to access new content, and the prices for skins and bundles are exorbitant. This shift in philosophy prioritizes profits over player enjoyment, creating an environment where those who pay are often rewarded more than those who play.\n\nMoreover, the decision to lock new heroes behind the battle pass undermines the competitive integrity of the game. In a title where team composition and hero selection are crucial, forcing players to unlock heroes through progression or payment creates an uneven playing field. This pay-to-win perception has alienated both new and returning players, further damaging the game’s reputation.\n\n3. Disregard for the Community\nA successful multiplayer game thrives on its community, but Blizzard’s handling of Overwatch 2 demonstrates a striking lack of respect for its player base. Communication has been inconsistent, with frequent delays and vague updates about the game’s direction. The scrapping of the PvE mode, as previously mentioned, was not only a broken promise but also a blatant disregard for the excitement and anticipation of long-time fans.\n\nAdditionally, the forced migration from Overwatch to Overwatch 2, which included the shutdown of the original game’s servers, left many players feeling betrayed. Those who preferred the original’s mechanics, balance, or business model were given no choice but to adapt or quit. This move eliminated player agency and erased years of gaming history, all for the sake of pushing a lackluster sequel.\n\nToxicity and cheating have also become more prevalent in Overwatch 2. Despite promises of better moderation and anti-cheat systems, many players report that these issues are worse than ever. The lack of meaningful community tools, such as robust reporting and matchmaking improvements, has only exacerbated these problems.\n\n4. Gameplay and Balance Issues\nOn a fundamental level, Overwatch 2 suffers from numerous gameplay and balance issues. The shift to 5v5 has not been universally well-received. Many players feel that the loss of a second tank has made matches more chaotic, less strategic, and more punishing for solo players. The meta is often dominated by a handful of overpowered heroes, while others languish in obscurity due to poor balancing.\n\nFrequent balance patches and hero reworks have not resolved these problems; in some cases, they have made things worse by introducing new bugs or unintended consequences. The game now feels less like a carefully crafted competitive experience and more like an experimental testbed, where players are subjected to constant changes and disruptions. This instability is frustrating for both casual and competitive players, who crave consistency and fairness.\n\n5. Technical and Quality-of-Life Failures\nBeyond its design flaws, Overwatch 2 is plagued by technical issues and a lack of quality-of-life improvements. Server problems, long queue times, and frequent disconnections are common complaints. Despite being marketed as a next-generation upgrade, the game still suffers from outdated graphics, clunky user interfaces, and limited accessibility options.\n\nBasic features that are standard in other competitive games—such as robust stat tracking, replay systems, and customizable controls—are either missing or poorly implemented. These oversights further contribute to the sense that Overwatch 2 is a rushed and incomplete product.\n\n6. The Decline of Blizzard’s Reputation\nBlizzard was once a name synonymous with quality and innovation. The company’s decline has been well-documented, from controversies over workplace culture to questionable business decisions. Overwatch 2 represents the culmination of this downward spiral—a game designed more by committee and corporate mandate than by passion and creativity.\n\nBy supporting Overwatch 2, players are not only endorsing a mediocre game but also enabling the practices that have led to Blizzard’s fall from grace. There are countless other games, both old and new, that deserve your time and money more than this disappointing sequel.\n\nConclusion: Choose Better\nIn summary, Overwatch 2 is a deeply flawed game that fails to justify its existence as a sequel. It offers little innovation, prioritizes monetization over enjoyment, disrespects its community, and suffers from numerous gameplay and technical issues. The forced migration from Overwatch to its inferior successor is a stark reminder of how far Blizzard has strayed from its roots.\n\nIf you value your time, your money, and your love for gaming, do not play Overwatch 2. There are far better alternatives that respect their players, foster positive communities, and deliver genuinely innovative experiences. Let Overwatch 2 serve as a warning: demand more from the games you play, and never settle for less.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Overwatch 2 is what happens when a good game gets kidnapped, held hostage, and forced to work in the cosmetics department. Blizzard didn’t make a sequel - they made a mobile cash shop wearing an FPS costume. They shut down OW1, replaced it with less content, slapped price tags on everything, and acted like they did us a favor.\n\nEvery “update” feels like Blizzard sprinting to the bank with a suitcase full of legendary skins. Real gameplay changes? Slow. New modes with actual effort? Rare. PvE campaign they hyped for YEARS? Scrapped—because apparently selling recolors is more “cost effective.” I guess story mode development got outbid by another Kiriko or Mercy Skin.\n\nThe shop gets more updates than the GAME. How is that normal? Hero balance can sit broken for months, but the second they can charge $29.99 for an angel with wings or a robot in a hoodie, they’ll push it out like they’re saving lives. Blizzard didn’t upgrade Overwatch - they downgraded it and monetized the downgrade.\n\nYou know it’s bad when the main progression system is your credit card.\n\nThey removed loot boxes so they could charge you directly. They removed OW1 so they could lock heroes behind paywalls. They removed PvE so they could sell skin packs. They basically removed everything except the one thing players don’t actually play for: the SHOP.\n\nOverwatch 2 is literally a fashion simulator with occasional shooting breaks.\n\nIf you enjoy overpriced outfits more than actual new content, go wild. But if you’re here for a real sequel, do yourself a favor and don’t bother. Blizzard’s main game mode isn’t Competitive or Quickplay - it’s Cash Grab: Legendary Edition.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unjustified ban, my account just got suddenly banned for violating in game code of conduct. I rarely chat in game or never use in game voice chat(I have social anxiety btw, only use discord with my lil brother), never use cheats, I played the game the way in meant to be played(I usually play support most of the time) and never throw. They don't even give you a warning or suspension, just straight up banning you. Now I feel like the money I spent in the game, especially this season, got wasted and my little brother is upset by this too, since we play this game together most of the time together. He told me that it was unfair that I got ban, and that it should be him because he chats more often in game and sometimes argue with someone. He also stop playing the game after that. And, this is the first time I got banned in a game too.\n\nI appealed once and explain everything, after a couple of hours they just sent me another email saying a game master resolved the ticket or appeal. It didn't really mention if my account got unban or they rejected it. Well, it turns out they rejected it, because the ban is still there. I tried to appeal again and ask for proof or evidence day after day but never got a response until now.\n\nEdited: I just received their response today and I got accused of using third party software and they didn't clarify what software(I only use discord with my little brother when playing.)\nYeah, I'm not getting my account back. They won't let me appeal anymore. This sucks, I quit Overwatch now. My money and time just got wasted for an unjustified ban.\n\nLast Update: Surprisingly, I got my account back this morning which I'm really glad at and in relief. I received an email that says that my account closure has been an error. They compensate with the premium battle pass next season. I still hope that they will improve their reporting system so this kind of incident will be avoided.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Match making is horrible. Too many toxic players. Blizzard needs to plae stricter restriction on bad behaviour. But they never listen to their players anyways. Time to go back to marvel rivals <3",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is so shit now, this game was so good and everyones favorite game, game of the year btw. Ngl i liked it after overwatch 2 and it was kind of a revive for the game but they lied and promised so much but didnt even give half of what they promised. This game couldve been amazing but they made it so shit that no one wants to play anymore. Got outdone by a fucking marvel game. terrible.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If u wanna break 5 keyboards and lost all hope in life play this game, 101% recommend",
      "voted_up": false,
      "votes_helpful": 59
    },
    {
      "review": "only fun part of the game now is stadium and they're slowly lubricating the dildo of despair and misery to thrust it into stadium next.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game makes me wanna kill myself or other innocent people, you should just not consider playing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Putting an arbitration agreement into your terms and conditions is a real dick move especially if you have a below subpar game. I did previously played the game on a different platform and it was ok, only with friends, if you were solo it was misriable. And if I was going to take a gander of the other reviews looks like marvel rivals is curb stommping this game. Gotta pick it up blizzard.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Every time I reinstall this game it's an immediate uninstall. The game just feels horrible to play as a hitscan clicking player. None of the hero designs make any sense (Cassidy shouldn't even exist since Ashe does everything better with less skill and more range).\n\nSave yourself some headache and just play marvel rivals. At least DPS can do things and carry in that game. In Overwatch it's just whichever team gets the shield tank and mercy pocket that wins the DPS duel. I have hundreds of hours on Battle.net.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the devs took a good game and threw it into a trash compactor. abandoned PvE mode (which was the main reason for that big ol 2), lack of skins for any hero that wont make them money, \"fixing\" mechanics that didnt need touching and consequently breaking said mechanics, and now going the same way as fortnite by adding trash brainrot meme stuff that NOBODY ASKED FOR! never coming back to this game. thanks for nothing, Blizzard.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Match making is so unfair LOL no wonder the game is dead",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "why the fuck does 6v6 not have role queue.\ny'all really want everyone playing the shitty 5v5 mode.\n\n\n\nedit: after playing for a bit, 5v5 sucks ass. and in almost all my 6v6 matches, all my teammates keep picking dps heros. i keep being the only one who plays tank/support.\n\nrole queue for 6v6 would be so much better than open queue, but blizzard wont do it because then there would have been no point in rebranding this game as overwatch2.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "You need a paid phone number for a battle net account to even get into the game.. Please just let me play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Blizzard games are shameless, fuck you! I hope your game company dies soon, you're hypocritical!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game needs to change the way it handles penalty and report systems, i got banned for 2 weeks literally interacting with enemies and typing memes in chat, the playerbase is so entitled and insufferable. if you want a solid fps title, try it out but its not a \"fun\" experience 50% of the time due to the players",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game was fun again for a bit. then they added eomm like rivals. genius idea. dont play the game theres no point anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dog dog dog dog game. Wtf are u supposed to do as a tiny little tiwnk dps when the gigachad steroid user tank deals more damage than u anyways. And wtf is this healing? 1 second the target is 1hp, the next its full hp. Played this game actively from release to like 2020, but god all mighty has it fallen from its grace. This is not worth your time at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Riddled with script kiddies and aimhacks, even in quick play. You'll be doing great, then the bots get turned on and the table run, AI bots filling holes that will literally just feed the opposing team for clips, I'm suspecting dual-boxing/logging and deranking/ranking a lot as well. Blizzard doesn't give 2 shits about the game anymore. 2/10, play to burn some time maybe.. but don't look at it being anything past irritation after a round or 2. Horrible ass game now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game isn't balanced half the time. It pairs you with people who aren't on par with you; either too good for your team or too underdeveloped at the game. So you find yourself getting either completely demolished by the enemy team, or carrying for the team and completely dominating the other. Not to mention the toxic player base that consistently discourage you from wanting to play when there are balanced games. When there are balanced games you get entitled players who constantly whine or say the game was easy despite the stats and way the game turned out. 10/10 game, -10/10 player base. If the devs took the time to remove the toxicity and not playfulness of the game i'd be on it more. I really wanted to enjoy the game more, but that player base just i'm tired. The next few times i play, i will mute the chat, which honestly i used to enjoy for the friendliness and jokes, but not anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Came back against my better judgement -- a form of emotional/psychological cutting, if you will. The new hero, Vendetta, actually makes the game unplayable. Can't emphasize how much this game sucks ass now. Play if you hate yourself.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I fucking hate this game so much but can't stop playing it. Do yourself a favor and never download this piece of shit garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has to be the single worst thing that could've happened to society as a whole. Anyways I can't stop playing it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has just been declining ever since it came out with \"Overwatch 2\". Monetization is through the skies. Promised PvE doesn't exist.\n\nBut the actual gameplay does feel nice and fun. Use to be better however. \n\nAt least the game is free, right? ..........",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game has taken 1600 hours of my life i played on console and i hate myself for ever asking my parents for this god forsaken game in 2016",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yeah because why not add a character in game where she can bypass all shields, have a shield herself where the hurtbox is on her so you can't even damage her from behind, and have a crazy ult where the charge up is fast as frick and next thing you know, asta from black clover with his big ass black divider is looking down on you. Try to block it with any shield? Nah, frick that I guess. What a way to keep killing the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The player base is awful and the competitive system is garbage. I am an OG ow fan, got the game the month it released and now I can't even enjoy an hour on the game, it makes me sad to know that a game that hold such a big place in my heart became like this.\r\nAnyway try it for yourself maybe you'll like the toxic environment",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Once great game ruined by an awful developer that took the most drastic approaches to every issue with the game that ruined all of its original charm. dive is to strong? lets release one of the most busted characters to ever be in a game to the point we literally cant balance her. Goats is too strong? lets add a hard role lock so theres no such thing as flexing. fights go on too long and stuff never dies? lets remove a tank killing any tank duo queues and go completely the other way that the ttk is way too fast. OW 1 was the game that got me into competitive fps and its so unrecognizable its sad and then they gave all the loyal fans one last kick in the balls promising this grand pve mode just to cancel it cause activision blizzard is a piece of shit company that ruins everything it touches",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Garbage game full of garbage people. I played thousands of hours of OW1. Amazing game, loots boxes no battle pass. OW2 being free just speaks to the garbage it brings in. I randomly re download this game every few months like a toxic ex. It's always bad for me... and not in a way that I can justify. Don't do it. Unless you are ok with dealing with the absolute worse humans possible.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "worst game ever to exist in mankind history i got a perm ban for nothing i will admit i did do bad in the last match i played but i wasnt afk sitting in spawn and kept up with the tank and mei in dps and had my fair amount of kills the only other reason they might have banned me was bc my name it was \"death\" but that doesnt make sense to me ive seen way worst and they couldnt even give me a chance or warning to change my name just a straight perm ban and no i wasnt typing or talk in game chat what so ever. i dont even play marvel rivals but they are 10 times better than this dog water",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is still terrible, i really do hope blizzard shuts down, old blizz is long gone. buncha interns tryna make a name for themselves as the worst gen of devs in history",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After you spend a lot of time downloading the game it will ask you for a lot of security details, it asks for your phone number and it has to be postpaid and you have to show documentation for utilities and electricity bill to verify your country region. This game is a joke you cant even get in like normal human beings, do not waste your time downloading over 70 gigabites only to discover you cant get in",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't like it... its kind of fun but too team and strategy based for not having a system of teaching players how to play\n\nFurthermore they rebalanced the game to make a majority of the heroes unplayable unless you manage to get 4-5 other players to play off of your choice rather than play what they want.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played for only 10 hours with friends that convinced me to play with them and randomly one day I got on again with them but I guess i got banned and I couldnt find a way to get it unbanned lolol",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant even log in, old ow2 acc got deleted by blizzard for no reason aswell, tried playing this again to see what stadium was like but atp i dont even care anymore, genuinely just twisted by ballsack every second of getting an account and making it verified which i cant even do due to my phone plan. 10/10 verification system",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game gotta be like top 5 worst game ever, blizzard hope every one in ur team got burnt and a tips for the new player dont play this game and idk like go play fortnite or valo or another game its like 100 times better than trashwatch 2",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "most toxic and challenging community to be around, every game feels like babysitting among gimmicky game mechanics",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game sucks! I played it when it was GREAT! so like OW1. Its ass, Shouldn't be played and isn't worth your time. Every time I try to play it I just dont have fun and it such a toxic game! Believe the negative reviews!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played back in overwatch 1 and I will say do not install this game. Bugs, players, new heroes being busted off rip, nothing truly works in this game unless you get a god send team after 20 defeats or you have 5 friends somehow who also play this atrocity. I have reinstalled this game here and there and I have also uninstalled it the same day if not same hour and I play with my friend. The game is HORID stay away and if you are apart of the community I am sorry for you and I also dislike you. Get better @a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Current try to play who gets kicked from games and banned for 10 minutes because the game kick me; trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont play this game if you want bitches. they wont come no matter how many good reaper ults you hit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game made me question if Jeffy really is that bad of a person because he isn't as awful as the directors are for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game sucks ass, i cant believe they went full fornite and added a battlepass and do some shit collabs to milk this game, also the woke shit is annoying",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its not running when i click play and i have all the requirements",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrible monetization, flat ugly and boring artstyle, most of the characters are boring, and Blizzard fucking sucks as a company with its awful workplace. I hope it succumbs to the Persona 5 Collab Curse.\n\nJust play Marvel Rivals instead.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}