{
  "positive": [
    {
      "review": "As I write this review, the next title (EU5) is slated to release tomorrow and I felt compelled to write a review and pay homage to the greatest strategy game of all time before I must say goodbye. \n\nThis game is so much more than just a map painter, it's a an escape to a different world, a glimpse from a time long gone, a strategy sandbox where you can write history in so many different ways. For many of us, the year 1444 has become as familiar as our own birthdays, the borders and rulers of that frozen moment etched into memory like a second language. This game has taught me more about history and geography than any college class or textbook ever could. \n\nThere’s such a simple joy in choosing a nation and immersing yourself in its story, roleplaying its triumphs and disasters, navigating diplomacy, warfare, and economics in a living, reactive world. \n\nSure, it has a significant learning curve, but it incorporates the best systems and ideas about economics, warfare, and diplomacy from similar games into one massive sandbox. Even after 4000+ hours, every campaign is different, a unique story told through the lens of ambition, power, and chance.  A single decision can ripple through centuries. Truly a game with a unlimited replayability. \n\nThe multiplayer is another aspect entirely. I could write pages more on that, but to keep brief, they were the fondest gaming memories I'll have. \n\nNo other game has continued to captivate me 10 years later.\n\nIt's truly a masterpiece in its genre. \n\n10/10",
      "voted_up": true,
      "votes_helpful": 111
    },
    {
      "review": "Still on baby hours, and still quite bad at it, but i do love it.\r\n\r\nThe DLC practice is a bit shit though.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "This was the first computer game I ever owned for myself, let alone the first game I ever got on Steam. \r\n\r\nI just graduated high school when I first got this game in 2013 and I can't describe what essence drew me to this game. I didn't know it yet but I had discovered I love this game genre, Grand Strategy. From then on I would play this game whenever I had the chance. From my first run as a Brandenburg attempt, to my more serious runs as the Ottomans, to the achievements hunting runs I do now, I adore this game.\r\n\r\nThe controls are simple enough that a young person can take it up easily. It makes you think and strategize every time, even though you know certain events are coming up. It is always a unique game every time and even with the release of its successor, I would likely find myself still coming to this game. I say all this as I migrate this game over to a $4k Linux build.\r\n\r\nI will always treasure EU4 for getting me into the world of not just steam and PC gaming, but computers in general. I only wish I could get my hands on a physical copy as a piece of memorabilia.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Words alone are not enough to describe what this game has meant to the community. Life long friendships have come out of this game. I have a feeling that many future statesman, generals, and world leader will have grown up playing this game. I just want to thank the developers and more importantly the EU4/ EU5 community for making this series so enjoyable. I have played EU5 and I truly think it is the most advanced historical strategy game yet. With the integration of Populations and the great thematic elements of that time period in the rise of the Bourgeoisie and the centralization of power. These two things are what lead to the enlightenment, the industrial revolution and the modern world in which we live today. EU4 began this journey and I truly think EU5 has the potential to be the most in depth game ever created thus far.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The ultimate grand strategy experience, at least until the fifth installment is a little more mature, so it's still a good bet for scratching that itch.\n\nIt's not just a map painter, but one of the few that manages to combine economic, military, diplomatic, and cultural management without being a mess. It can be a little overwhelming at first, but you can always pick a relatively easy country to get the hang of it, the only downside is that this game has been a constantly evolving project for many years, which means you need to buy several DLCs to experience the game in its entirety.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "EU4 is hard to learn at first, but once it clicks, hours disappear without you noticing and becomes very fun 😊. Top 5 games definitely.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was initially attracted to this game by its immersive music and realistic art style. I have spent over 3,000 hours playing EU4 online and offline over 12 years, carrying a lot of memories. Thank you for the companionship!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "genuinely the best ever board game video game to ever do it. deep, clear, absolutely consumingly good. \n\nshoutout anbennar.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Now dont get me wrong i like this game. I mean whats not to love making your nation full of pirates raiding a smaller nation. While you debase your currency because you have 50,000 duckets in loans. The only thing holding me back from a 5/5 game is that it is not VR compatible. I mean its 2025, why no VR????????? 4/5 game",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A truly incredible game, nothing is like it. EUV takes a new approach as compared to EUIV, but this game will remain among one of the best games I've ever played. It is well worth the hours spent learning and losing to come out on top in the end. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a beginner with barely more than 2000 hours who never ever completed a single campaign to the end date of the game, it is the best strategy game of all time, in my humble opinion. \n\nThe game gets plus points if you like history and staring at maps for a couple hundred hours while clicking on buttons in the 100+ different interfaces that surely must be very easy to understand for new players. \n\nPro tip before playing: dedicate at least 5+ years to learning the game, watch at least 100+ tutorial videos, and I can also recommend getting a PHD in the game if plausible. \n\n9/10 - if you can handle learning it and have most of the DLCs, it is a masterpiece with few flaws. The biggest flaw is how boring and repetetive the late game can be post 1600s, but an easy solution is just to start new campaigns by then.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game (specifically multiplayer mode) made me gay for someone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like the grand strategy game this is the one for you. The game mechanics make it challenging and difficult to win.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite game ever. It's fantastic. You can immerse yourself in so many great countries, highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best played in multiplayer, but fun in singleplayer nonetheless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game consumed me entirely.\n\nYes, I like intricately designed games that allow me to micromanage my country's military, economy, diplomacy, dynasty, colonization, religion, and fate.\n\nYes, I am autistic.\n\n10/10, would sink in a thousand hours more, and more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wish I could rate this 1-5 instead of a plain yes or no.  It is a yes, but barely.  For a 4x game it is fairly good, but it lacks a quality late game.  One of the things that separates paradox grand strategy from traditional 4x games is the ability to create new challenged as the game goes on so the end game is just as engaging as the early game.  Most people don't play past 150 years with any given playthrough and the reasons are obvious, the late game is boring and unfulfilling.\nAnother issue I have is that this game more than any other paradox title attempts to disguise obscurity as complexity.  The game is marketed as deep and complex, but in truth the mechanics are not all the complicated, they are simply hidden in multiple nested sub menus and obscure decisions.  Once you learn where everything is hidden the supposed complexity is reduced to nothing more than a standard recruit, conquer, consolidate loop.\nOver all it was fun, but I put over 1000 hours into crusader kings and stellaris even more.  This game I played for two months and never plan to play again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite game ever, unlimited replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "complex but really rewarding, really gives the feeling of rewriting history!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is perfect when you want to relax with a beer while trying to rule the world.Thank you, it really is my favorite game. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent addition to the EU family. Good DLC's and re-playability. Yes, they have the DLC's you have to pay for, but just wait until a Steam sale and get them cheap.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really like this game i like fooling around with the cheats and making maps with it tis a fun game. but the dlcs cost alot of money though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my wife left me , my son 'suleiman' no longer recognises me as his father , my daugther spends time with people who have lifes and careers and dont understand the trade system of a niche video game. i regret nothing. 10/10 would become addicted again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game very much. It brought me into the RTS genre when it was free on the epic games store and I liked it so much that I bought it when it was bundled with Victoria 3. Overall I love all the options for historical and non-historical play. I also just like the game as a whole.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sad to see the Sequel my advice buy this one its better wait on the next one for a year or two while it gets its feet under it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Siendo ex-jugador de Victoria 2 y de Hearts of Iron 4, este juego es fácil y mejor para jugar con seres de carne y hueso",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Now that it is done it is time. EUIV is the Grand Strategy of the past decade; the flagship of paradox interactive. The game is fun and with my 3000 hours on record I can only recommend all the long nights I spent expanding as Byzantium or Russia for nteenth time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best EU so far! no bugs, lots of free-DLCs, play it for 2-3 years first before buying EU V ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I did like the game at first but eventually I got fed up with the constant stream of dlc and updates to game mechanics. Finally uninstalling it was like getting rid of a regular nuisance, something I've never experienced in this way with other games. My review is still positive because of the good time I initially had playing this, but if Steam had given us an option for a neutral review that's probably what I'd have gone for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kinda cool, not the best economic simulator but still a good map game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game since launch. When all I had was a crappy laptop, EU 4 was there for me. Paradox GSGs have a huge entrance hurdle but once you cross them, all you need is a goal and the world literally is your oyster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "exel spreadsheet at its finest, 10/10 would conquer the world again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game on the day of release and I have played it for many hours up until the release of EU5. This is probably my favorite grand strategy game of all time, and while all PDX games have a high learning curve, this is probably one of the easier ones to get into. Now that it won't be updated anymore, it would be worth it to get it when its on a steep sale with all DLC or something, if you don't know if you like these kinds of games. Or maybe play online with a friend who has the DLC, since in PDX games, only the host has to own the DLC for it to be active (which might be the best DLC practice in games, considering, despite PDX's love for too much DLC, probably.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a Game. One of the best Strategy Games so far. 5 Stars from me. Only lacks good Charts and Statistics where you can track your progress compared to other Nations. I hope they bring it with EU5. Paradox is one of the Companies where you pray that they dont get greedy and keep up the good Work and Spirit of the former developers. Thank you Paradox so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm insanely bad at this game but it's very fun to color the map nevertheless. As usual Paradox is cutting content and selling it as DLC but the base game feels more complete than HOI4 for example, so it's acceptable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "eats time in a fun way, is very unreliable on MacOs though, crashes constantly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect timekiller game. Spent all my prestige and stability in community. Now I'm waiting for EU5, heard I could ruin my ecomonic drastically compare to EU4.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While in typical Paradox fashion, there is a ton of DLC, the core game is still pretty amazing and worth a pickup today. You can usually find it on sale while you wait for EU5.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1000 hours and I'm still not out of the tutorial. \n10/10 - Would lose too much sleep to funni map game again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Educational map painting game for the whole family. Box set includes: sweat, tears and plenty of save reloads. Base game 5/10, Base game + major DLC (21/25 carrots)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Europa Universalis IV, i hate Europa Universalis IV and i love to hate Europa Universalis IV",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only play it if you're into grand strategy games.\r\nIf you like grand strategy games, you'll love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Goodbye to one of the goats, and 42 entire days of my life. Pending a sudden and absolute failure of the follow up, EU5 (which has been great thus far) than I will likely never play this installment again... Which I've referred to many times in the last few years as my all time favorite game. This game offered me a depth in strategy games that 5 years ago I had no idea existed or that I needed. This game is not really for casual or infrequent gamers. However your tenacity will be rewarded ten times over if you stick with it. History or strategy game nerds already know, this is a must own. \n\nBuying the base game of EU4 in 2025 seems unwise. If this looks interesting to you, buy the new game. I only recommend EU4 if you get the full package either on sale or through their DLC subscription after purchasing the base game on sale. its hard to justify the full price cost of this game and all of its DLC's even at over 1000 hrs of gameplay. The thing is, when you experience games with depth and detail of mechanics on this scale, you can almost make sense of the cost.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "About to finish the tutorial of the game, I'm getting it, it's fun, good for casual runs, accessible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really good game that allows you to colonise all over the globe as any nation in Europe, however DLC's exist, so be ready to spend a lot of time and possibly and eventually money on this game, however it is a good game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very re-playable Can play any country in the world. Even play the same country and have totally different games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, lots of fun.\r\n\r\nIt has a steep learning curve but once you get past that its truly very fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game to imerge yourself in. It's like going back in time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very complicated, but if you're feeling smart and are willing to take the risk that this game might me TOO complex for your little brain to understand, (jk, ik ur very smart) and if u play it for longer than 2 hours u won't get a refund and might lose your money. ... then try ur luck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a masterpiece of a game that made me fall in love with grand startegy all those years ago",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Maybe I'm not the best person to review this game, as I've spent my thousands of hours on other games. Maybe I just suck at dedicating all of my time on one game in general, so my hours are low. But, nonetheless, I found the game to be thoroughly enjoyable.\n\nMaybe the game by itself at launch was as bare bones as it was when other Paradox games came out. But, it had one thing going, and it was consistency. It was fun, and painting a map and strategically picking your battles is absolutely great. Although it all boils down to the numbers game, it was a game I could only keep returning back to. And just a few days ago, I had a \"farewell\" game to celebrate all those years of time.\n\nThank you Paradox for all the fun. Maybe if Europa Universalis V blows, I might come back to this. Though that by itself is very much unlikely. You keep on trucking :)\n\n9/10 Paint the map any colour you like, and rule the world :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games to date. It's challenging, frustrating, yet ultimately satisfying. \nIt's not easy to learn, knowing someone who knows the game would be super helpful but this community is quick to help. \n\nContent is plentiful through mods and I think the $8.00/month subscription for DLC is great for its price coming from a WoW player at $15.00",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Eu4 for me has been a game that no matter what was going on in life or how I felt I could always come back to and enjoy to its fullest. Now that we're moving onto EU5 today it makes me sad to be leaving this game behind, but the memories made here were some of the best. I would highly recommend picking up EU4 if you haven't already. o7 to a wonderful game and to great memories",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the steeper learning curves (as far as paradox games go LOL) but incredibly rewarding once it all clicks, definitely one of my favorite games of all time and probably the most enjoyable game out of the paradox line up (for me personally). Here is hoping that EU5 can live up to the expectations set by such a phenomenal showing, and if it can't at least this game isn't going anywhere.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a quality game, if incredibly convoluted to a newcomer. It's not worth playing without at least some dlcs though, so that is a downside. I have spent countless hours in this game and will continue to do so as the years go by.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "O'yin juda zo'r, faqat Paradoxning soqqa qilish sistemasini s*k*m, 100 ta DLC sotib olsam 100$+ bo'ladimi? O'yin uchun bu katta summa, lekin buni hisobga olmasa O'yin daxshat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "costs tons of money when buying DLC's, which is a must, But worth every cent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "had the ottomans cross all of asia to curb stomp me when I was playing korea once 10/10 experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for some levels of historical roleplay and alternate history simulation",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After all these years, there were good times for EU IV and there where bad times. In end the EU IV is one of the first and best grand strategy games I have played. O7",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Before I uninstall this, I figured I'd give my review.\n\nThank you for years and years and years of fun and warm memories.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game main issue is losing the time while playing it, do recomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a good game just very fucking hard , cant survive if you small or mid country",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Games good, had a good time. Love bringing Byzantium back from the dead",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I summon Lord of D. in attack position then I use The Flute of Summoning Dragon spell card and special summon two Blue Eyes White Dragons from my hand in attack position",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The greatest grand strategy game of all time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't need to buy EU5, I could play this game for another 3000 hours and never get bored",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love this game and improve my historic knowlegde",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At least make me a tributary state, before you demand Subsidies from me...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice 300 hour tutorial to make you ready to attempt Europa Universalis V",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I stare at the map and it changes in the ways I like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "By far one of the GREATEST and most difficult grand strategy games EVER made, and since I've been playing it for over a decade it deserves a very positive review from a veteran player of it as EU5 just came out and I'm going to move on from EU4. I've been playing this game since I was a teenager and played thousands of hours of it. This was mostly on a crappy pc because I loved it and because my pc couldn't run many games at the time, EU4 is pretty easy to run except for 5 speed.\n\nEU4 is an RNG based grand strategy sandbox game from 2013 that allows you to play as any country from every continent (except Antarctica) from 1444-1821. Your goal is to become the most powerful nation on Earth by conquering as much as you can before 1821. You have three types of powers that you spend on a multitude of things to strengthen your country, administrative, diplomatic, and military power. Admin is spent primarily on stability and administrative tech, diplo is spent on reducing war exhaustion, admirals, and diplomatic tech, and military is spent on generals and military tech.\n\nEvery country has one currency called ducats. Ducats can be attained from subsidies from other countries, through base trade, base tax, base production, war reparations in peace deals, and through demanding ducats in peace deals. Ducats are extremely important for buying a lot of things and if you run out of ducats and take too many loans you can go into bankruptcy for 10 years which plunges your country into -3 stability, wipes out all three powers to leave you at -100 for each one, gives your armies and navies -50% morale (basically hp modifier), and wipes out all of your loans. Bankruptcy is one of the worst things that can happen in EU4 besides stackwipes (your entire army getting destroyed after one battle) but is usually easily avoidable if you're skilled/experienced at the game. \n\nI could go on about all the mechanics but I just wanted to go over the big basic core parts of the game. The ONLY negative is the ridiculous amount of DLCs over the span of 12 years, much of it having a big impact on core mechanics of the game like developing provinces. \n\nOverall this game deserves a 9.5/10, if on sale I highly recommend buying and paying the monthly subscription to see if you want to buy any of the DLCs or not.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well the new game is out. If you like simple map painting, this one will keep you busy for a couple hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thanks to EUIV devteams, Thanks to the Modders, Thanks to the EU's Community.\nClassic GSG Game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "love this game, even though a new generation has been released, still love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DESTROYING MY LIFE, but great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Takes some time to learn but worthwile if you can invest the time necessary.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its ok, haven't played that much of it. Really hard to get achievements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best RTS game I have ever had the pleasure of playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it has mission trees so its automatically better than eu5",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Spread sheets the game.  But in a good way.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I haven't seen the sun since I acquired this game.\r\nGood game :y: would recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Loved for years, now it wont fricking work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fakirligin gozu kör olsun hala 4 oynuyoz",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it takes a while to learn but is very rewarding when you get good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i never review anything ever but this is literally my favorite game of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best strategy game in our history",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This satisfied all my map painting desires, but it's time to move forward",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tutorial is over, is dollarts tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good launch, good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game if you pirate the DLC, bad otherwise",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is more addictive than cocaine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game, still a newbie after 700h of played time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing grand strategy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was a good run, rest easy now.. o7",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game will keep me occupied until Eu4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Alright, finally finished the tutorial, just in time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it would be silly not to recommend with 500 hours in it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "haha me great leader (I have literally no idea what I am doing)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good but suffer.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Let me get this straight, if i want Art of War I now have to rebuy the game because its considered so neccessary its included in the game now, but not the version i bought years ago.  This company hates its long time customers.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Like all paradox games, they made it better from release and then made it worse over time by adding more short-sighted updates, unnecessary content, and untested mechanics to milk more money out of the game. Features and AI that once worked well become overburdened and broken as Paradox doesn't play test how new features focusing on new areas cooperate with old features.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Fixed trade routes are the most idiotic thing I've ever seen in a grand strategy game like this.. The trade flows only in one predefined direction and the directions CANNOT be changed.. \n\nLet's say you are playing as Australia and you develop your country a LOT. But you still can't make any money in Australia because the only trade route present leaves Australia to Europe. ALL trade routes move from rest of the world to Europe (which is historically accurate but the whole point of playing such a game is to be able to rewrite the history by making different choices)\n\nAnd money is the main limiting factor in this game if you're not in Europe which has all the end trade nodes. You can't have a large standing army outside Europe/India because you're broke af always...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "When I first started Europa Universalis IV, I realized this is one of the most complicated games I’ve ever played — period. The number of buttons, menus, and systems thrown at you from the start is overwhelming. Managing everything feels like trying to play on ten different chess boards at once, each with its own rules and objectives.\n\nThat said, the level of detail in this game is absolutely incredible. Every province, nation, and historical event feels handcrafted, and once you understand what’s going on, it’s actually very rewarding. The balance between nations and mechanics is surprisingly well done for a game of this scope.\n\nUnfortunately, Paradox’s DLC model ruins what could have been one of the greatest strategy games ever made. Half of what should be the full experience is locked behind dozens of paid expansions, most costing over $20 each. To get the “complete” version of this game, you’d have to spend a few hundred dollars, which is absurd and unfair to players and consumers.\n\nOverall, Europa Universalis IV is a deep, fascinating grand strategy experience buried under one of the most predatory DLC systems in gaming. Enjoy it if you can, but do not buy Europa Universalis V unless Paradox changes its practices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Paradox:\n1. ruined VTM\n2. has to start releasing finished games\n3. has to stop draining people's money with no-content dlcs.\n\nAs for VTM, just sell the franchise to someone competent, none of that \"on a licence from us\" crap. Cannot believe I am saying this but literally worse than EA.\n\nOtherwise, would be a decent game if all the dlcs content was in base game for the price that its sold at.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Already forgot they made this and won't put it on sale :I\nGame is fun but typical Paradox overcharge",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the UI in this game is utter dogshit, play a better game instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I dont know what it is with Paradox and being able to just change religions willy nilly but mechanically its so bad and the constant fighting of rebels makes the game just boring. Victoria 2 is the better game here, even though it to has the problem with the rebels, mechanically its much simpler and thus a lot more fun than EU4. Paradox has a habit of making their games worse as time goes on where they add and change too much, Victoria 2 has the benefit of it only got 2 dlcs so structurally the game retained much of its enjoyable simplicity. EU4 is just a mess, its too complex and none of that complexity is any fun as it mostly just ends up being \"here's things to spend your mana points on\". This has ensured I won't be playing EU5 any time soon either as apparently its even worse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its too complicated, even on very easy mode you cannot just chill and have a campaign.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Now that Paradox has stopped extorting EU4 players it might be worth buying, but their business model is inherently predatory and they do not deserve your business.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very Random Very Chaotic the Tutorial Hardly explains everything and you need 10 dlcs to have fun do not recomend for anyone i only bought this in a 2 pack deal cause i wanted victoria 3  and thats somehow a more fun and better game then this i dont know why would anyone want another version of a shitty game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Paradox Interactive have one thing driving what they do. It is your pocket. They keep repackaging  old games and selling them again and again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "they broke the game with a new update, now it wont even run.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most rng heavy games i have ever played, you can get one bad random event and have to restart your entire playthrough, ie getting a comet event during the spanish civil war",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "map game make my head hurt",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Shah ruk has died the RNG has decided you will not have fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "> just git gud\r\n> looks inside\r\n> rng",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't. It's not worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I guess its okay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hate this game poo poo poo poo honest feeling",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Menu simulator",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "haram prices and DLC",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "$500 of DLC. Give me a break!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Paradox = negative.\r\n\r\nEnough said.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "BAD GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck Paradox",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Paradox Bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "👎",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "njlxt",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic grand strategy game at its core, but the experience is completely marred by Paradox’s absurd DLC policy.",
      "voted_up": false,
      "votes_helpful": 85
    },
    {
      "review": "Love the game, cannot recommend with current dlc policy this game and every other paradox game, in addition there are many things that should be fixed before they move on but now just wont. Dont care enough to write more",
      "voted_up": false,
      "votes_helpful": 69
    },
    {
      "review": "Let me get this straight, if i want Art of War I now have to rebuy the game because its considered so neccessary its included in the game now, but not the version i bought years ago.  This company hates its long time customers.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Great game. Not worth 184$. Do not plan on buying this game unless you are going to buy either the subscription or the ultimate edition with all DLCs. Really great strategy game if you kind find a full cheap copy somewhere though.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Like all paradox games, they made it better from release and then made it worse over time by adding more short-sighted updates, unnecessary content, and untested mechanics to milk more money out of the game. Features and AI that once worked well become overburdened and broken as Paradox doesn't play test how new features focusing on new areas cooperate with old features.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Fixed trade routes are the most idiotic thing I've ever seen in a grand strategy game like this.. The trade flows only in one predefined direction and the directions CANNOT be changed.. \n\nLet's say you are playing as Australia and you develop your country a LOT. But you still can't make any money in Australia because the only trade route present leaves Australia to Europe. ALL trade routes move from rest of the world to Europe (which is historically accurate but the whole point of playing such a game is to be able to rewrite the history by making different choices)\n\nAnd money is the main limiting factor in this game if you're not in Europe which has all the end trade nodes. You can't have a large standing army outside Europe/India because you're broke af always...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's a Paradox game, so you can expect: \n- heavily overpriced DLC\n- changing the gameplay so that you can't play it properly without the mentioned DLC\n- stealing the ideas of modders without acknowledging them\n- minimal bug fixing until the game is suddenly dropped. \nWith a bit of luck, it will be relaunched in 5-8 years and you can buy it again. Of course, without bugs being fixed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fun game and all but I'm sick and tired of saves disappearing or becoming incompatible. It is a longstanding unresolved issue with this game (I'm 2400 hours in) and its disheartening. I'm also sick of the infinite DLC model. It's a shame Paradox makes such amazing games because I should not be tempted to buy a game releasing with two DLCs, especially knowing 100 more will follow (looking at you EU5). Thanks again btw Paradox for ruining another ironman save that spanned multiple weekends",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love this game, it's been incredibly fun, I've enjoyed being able to share it with my friends. Would never play again, 3,000+ hours could've been another language. Save yourself",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "When I first started Europa Universalis IV, I realized this is one of the most complicated games I’ve ever played — period. The number of buttons, menus, and systems thrown at you from the start is overwhelming. Managing everything feels like trying to play on ten different chess boards at once, each with its own rules and objectives.\n\nThat said, the level of detail in this game is absolutely incredible. Every province, nation, and historical event feels handcrafted, and once you understand what’s going on, it’s actually very rewarding. The balance between nations and mechanics is surprisingly well done for a game of this scope.\n\nUnfortunately, Paradox’s DLC model ruins what could have been one of the greatest strategy games ever made. Half of what should be the full experience is locked behind dozens of paid expansions, most costing over $20 each. To get the “complete” version of this game, you’d have to spend a few hundred dollars, which is absurd and unfair to players and consumers.\n\nOverall, Europa Universalis IV is a deep, fascinating grand strategy experience buried under one of the most predatory DLC systems in gaming. Enjoy it if you can, but do not buy Europa Universalis V unless Paradox changes its practices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you don't buy the DLC there is 0 point playing the base game. Any tutorial you view online uses the mechanics of the DLC. Pathetic that you have a pay wall for stuff like concentrate development. Tried playing this to get ahead for EU 5, but I guess I'll just wait and learn the gameplay loop when it comes out.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great game. Have been playing since 2014. However....\n\nThe Mac port (which i am now forced to play) is absolute shit. Game-breaking crashes ruin runs constantly. \n\nYou can play for 8/9 hours over several sessions and not see a single one. And then.. the game crashes... you reload... it crashes again... on the same date... you reload... it crashes again... on the same date... again and again... every fucking time... and there's nothing you can do to get around it... all those hours... completely wasted... \n\nIt might happen in the 1400s when you are just getting started. It might happen in the 1800s when you are about to complete a world conquest. There is no consistency, so you cannot mitigate it. \n\nParadox, fix your game, please.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stopped working on Steam Deck so I installed it on my PC where it also doesn't work. Needing to use yet another launcher just to play a game you already bought on Steam is already atrocious, but it's even worse when the \"Play\" button is disabled with no explanation.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Way too dependent on DLCs, love the game seriously, but goddamn does paradox love to strap you down and milk you for money, Paradox couldn't give a shit about their audience, great game, fuck paradox, DLCs are way too expensive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've won literally 16 naval battles in a row without sinking a single enemy ship. The game is simply broken.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "after more than 1.5 k hours i finally give up. there are still too many bugs in this game and other stuff which don't make ANY sense at all, where i'm left scratching my head and wondering how on earth that hasn't been fixed in the 12 years of this game's existance. one example: i colonised panama and have a connection with the pacific ocean. BUT i CANNOT colonise california because for some reason the colonial range counts all the way around south america...??? another example: i became the emperor of the hre as denmark. i converted to german culture to get rid of the -5 is not germanic penalty. but now i have a -5 penalty for not being french. huhhhh????\nfor the horrendeous sum of 400.- with all dlcs this is in no way recommendable. and without the dlcs it's just a hollow shell",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played until 1800 to figure out the timelapse viewer thing is DLC lmao. Actually criminal.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Paradox:\n1. ruined VTM\n2. has to start releasing finished games\n3. has to stop draining people's money with no-content dlcs.\n\nAs for VTM, just sell the franchise to someone competent, none of that \"on a licence from us\" crap. Cannot believe I am saying this but literally worse than EA.\n\nOtherwise, would be a decent game if all the dlcs content was in base game for the price that its sold at.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Already forgot they made this and won't put it on sale :I\nGame is fun but typical Paradox overcharge",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only buy if heavily discounted.\nIf you end up having just the base game try playing with others that have DLCs, since you will have DLCs that they have.\nIf you have just the base game your experience will be much worst than others that have all.\nThis game can be enjoyable, if you can, get a cheap bundle with many DLCs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the UI in this game is utter dogshit, play a better game instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I dont know what it is with Paradox and being able to just change religions willy nilly but mechanically its so bad and the constant fighting of rebels makes the game just boring. Victoria 2 is the better game here, even though it to has the problem with the rebels, mechanically its much simpler and thus a lot more fun than EU4. Paradox has a habit of making their games worse as time goes on where they add and change too much, Victoria 2 has the benefit of it only got 2 dlcs so structurally the game retained much of its enjoyable simplicity. EU4 is just a mess, its too complex and none of that complexity is any fun as it mostly just ends up being \"here's things to spend your mana points on\". This has ensured I won't be playing EU5 any time soon either as apparently its even worse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its too complicated, even on very easy mode you cannot just chill and have a campaign.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Now that Paradox has stopped extorting EU4 players it might be worth buying, but their business model is inherently predatory and they do not deserve your business.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very Random Very Chaotic the Tutorial Hardly explains everything and you need 10 dlcs to have fun do not recomend for anyone i only bought this in a 2 pack deal cause i wanted victoria 3  and thats somehow a more fun and better game then this i dont know why would anyone want another version of a shitty game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Paradox Interactive have one thing driving what they do. It is your pocket. They keep repackaging  old games and selling them again and again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "they broke the game with a new update, now it wont even run.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most rng heavy games i have ever played, you can get one bad random event and have to restart your entire playthrough, ie getting a comet event during the spanish civil war",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "map game make my head hurt",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Shah ruk has died the RNG has decided you will not have fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "> just git gud\r\n> looks inside\r\n> rng",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't. It's not worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I guess its okay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hate this game poo poo poo poo honest feeling",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Menu simulator",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "haram prices and DLC",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "$500 of DLC. Give me a break!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Paradox = negative.\r\n\r\nEnough said.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "BAD GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck Paradox",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Paradox Bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "👎",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "njlxt",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic grand strategy game at its core, but the experience is completely marred by Paradox’s absurd DLC policy.",
      "voted_up": false,
      "votes_helpful": 85
    },
    {
      "review": "Love the game, cannot recommend with current dlc policy this game and every other paradox game, in addition there are many things that should be fixed before they move on but now just wont. Dont care enough to write more",
      "voted_up": false,
      "votes_helpful": 69
    },
    {
      "review": "Let me get this straight, if i want Art of War I now have to rebuy the game because its considered so neccessary its included in the game now, but not the version i bought years ago.  This company hates its long time customers.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Great game. Not worth 184$. Do not plan on buying this game unless you are going to buy either the subscription or the ultimate edition with all DLCs. Really great strategy game if you kind find a full cheap copy somewhere though.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Like all paradox games, they made it better from release and then made it worse over time by adding more short-sighted updates, unnecessary content, and untested mechanics to milk more money out of the game. Features and AI that once worked well become overburdened and broken as Paradox doesn't play test how new features focusing on new areas cooperate with old features.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Fixed trade routes are the most idiotic thing I've ever seen in a grand strategy game like this.. The trade flows only in one predefined direction and the directions CANNOT be changed.. \n\nLet's say you are playing as Australia and you develop your country a LOT. But you still can't make any money in Australia because the only trade route present leaves Australia to Europe. ALL trade routes move from rest of the world to Europe (which is historically accurate but the whole point of playing such a game is to be able to rewrite the history by making different choices)\n\nAnd money is the main limiting factor in this game if you're not in Europe which has all the end trade nodes. You can't have a large standing army outside Europe/India because you're broke af always...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's a Paradox game, so you can expect: \n- heavily overpriced DLC\n- changing the gameplay so that you can't play it properly without the mentioned DLC\n- stealing the ideas of modders without acknowledging them\n- minimal bug fixing until the game is suddenly dropped. \nWith a bit of luck, it will be relaunched in 5-8 years and you can buy it again. Of course, without bugs being fixed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fun game and all but I'm sick and tired of saves disappearing or becoming incompatible. It is a longstanding unresolved issue with this game (I'm 2400 hours in) and its disheartening. I'm also sick of the infinite DLC model. It's a shame Paradox makes such amazing games because I should not be tempted to buy a game releasing with two DLCs, especially knowing 100 more will follow (looking at you EU5). Thanks again btw Paradox for ruining another ironman save that spanned multiple weekends",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love this game, it's been incredibly fun, I've enjoyed being able to share it with my friends. Would never play again, 3,000+ hours could've been another language. Save yourself",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "When I first started Europa Universalis IV, I realized this is one of the most complicated games I’ve ever played — period. The number of buttons, menus, and systems thrown at you from the start is overwhelming. Managing everything feels like trying to play on ten different chess boards at once, each with its own rules and objectives.\n\nThat said, the level of detail in this game is absolutely incredible. Every province, nation, and historical event feels handcrafted, and once you understand what’s going on, it’s actually very rewarding. The balance between nations and mechanics is surprisingly well done for a game of this scope.\n\nUnfortunately, Paradox’s DLC model ruins what could have been one of the greatest strategy games ever made. Half of what should be the full experience is locked behind dozens of paid expansions, most costing over $20 each. To get the “complete” version of this game, you’d have to spend a few hundred dollars, which is absurd and unfair to players and consumers.\n\nOverall, Europa Universalis IV is a deep, fascinating grand strategy experience buried under one of the most predatory DLC systems in gaming. Enjoy it if you can, but do not buy Europa Universalis V unless Paradox changes its practices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you don't buy the DLC there is 0 point playing the base game. Any tutorial you view online uses the mechanics of the DLC. Pathetic that you have a pay wall for stuff like concentrate development. Tried playing this to get ahead for EU 5, but I guess I'll just wait and learn the gameplay loop when it comes out.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great game. Have been playing since 2014. However....\n\nThe Mac port (which i am now forced to play) is absolute shit. Game-breaking crashes ruin runs constantly. \n\nYou can play for 8/9 hours over several sessions and not see a single one. And then.. the game crashes... you reload... it crashes again... on the same date... you reload... it crashes again... on the same date... again and again... every fucking time... and there's nothing you can do to get around it... all those hours... completely wasted... \n\nIt might happen in the 1400s when you are just getting started. It might happen in the 1800s when you are about to complete a world conquest. There is no consistency, so you cannot mitigate it. \n\nParadox, fix your game, please.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stopped working on Steam Deck so I installed it on my PC where it also doesn't work. Needing to use yet another launcher just to play a game you already bought on Steam is already atrocious, but it's even worse when the \"Play\" button is disabled with no explanation.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Way too dependent on DLCs, love the game seriously, but goddamn does paradox love to strap you down and milk you for money, Paradox couldn't give a shit about their audience, great game, fuck paradox, DLCs are way too expensive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've won literally 16 naval battles in a row without sinking a single enemy ship. The game is simply broken.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "after more than 1.5 k hours i finally give up. there are still too many bugs in this game and other stuff which don't make ANY sense at all, where i'm left scratching my head and wondering how on earth that hasn't been fixed in the 12 years of this game's existance. one example: i colonised panama and have a connection with the pacific ocean. BUT i CANNOT colonise california because for some reason the colonial range counts all the way around south america...??? another example: i became the emperor of the hre as denmark. i converted to german culture to get rid of the -5 is not germanic penalty. but now i have a -5 penalty for not being french. huhhhh????\nfor the horrendeous sum of 400.- with all dlcs this is in no way recommendable. and without the dlcs it's just a hollow shell",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played until 1800 to figure out the timelapse viewer thing is DLC lmao. Actually criminal.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Paradox:\n1. ruined VTM\n2. has to start releasing finished games\n3. has to stop draining people's money with no-content dlcs.\n\nAs for VTM, just sell the franchise to someone competent, none of that \"on a licence from us\" crap. Cannot believe I am saying this but literally worse than EA.\n\nOtherwise, would be a decent game if all the dlcs content was in base game for the price that its sold at.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Already forgot they made this and won't put it on sale :I\nGame is fun but typical Paradox overcharge",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only buy if heavily discounted.\nIf you end up having just the base game try playing with others that have DLCs, since you will have DLCs that they have.\nIf you have just the base game your experience will be much worst than others that have all.\nThis game can be enjoyable, if you can, get a cheap bundle with many DLCs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the UI in this game is utter dogshit, play a better game instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I dont know what it is with Paradox and being able to just change religions willy nilly but mechanically its so bad and the constant fighting of rebels makes the game just boring. Victoria 2 is the better game here, even though it to has the problem with the rebels, mechanically its much simpler and thus a lot more fun than EU4. Paradox has a habit of making their games worse as time goes on where they add and change too much, Victoria 2 has the benefit of it only got 2 dlcs so structurally the game retained much of its enjoyable simplicity. EU4 is just a mess, its too complex and none of that complexity is any fun as it mostly just ends up being \"here's things to spend your mana points on\". This has ensured I won't be playing EU5 any time soon either as apparently its even worse.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}