{
  "positive": [
    {
      "review": "It's a much better game than most people give it credit for. It has the usual arduous collectathons that Ubisoft is known for, but while I was playing, I found that the game was a million times more enjoyable when I started ignoring that part of it. This was the only thing I didn't like.\r\n\r\nThe story is nothing to write home about, but Far Cry has never been about that. Far Cry has always been about cool villains and settings. I believe Far Cry 6 hit the mark in that regard. Anton Castillo is a super cool and badass villain, and all of the lesser villains are interesting as well.  Bembe was a cool antihero that just kind of disappeared for no reason, though. I wonder what happened to him?\r\n\r\nThe allies you get are more or less forgettable, except Clara and Juan; The supremo weapons are an interesting addition to the game but I didn't use them too much and the addition of fishing was also kind of needless, but none of that lowers my opinion of the game. \r\n\r\nNot the best game ever, but I think it's a real Far Cry experience and it's certainly worth playing.",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "I ONLY RECOMMEND IF THE GAME IS DISCOUNTED!\n\nIf you played Far Cry 4 or Far Cry 5 you practical played Far Cry 6. Pretty much a copy paste game with a new map and different story. Half the cut scenes aren't even worth watching. If you played other Far Cry games and want something new look else where. If you are new to the Far Cry series you will have fun, just know other Far Cry games are better.",
      "voted_up": true,
      "votes_helpful": 57
    },
    {
      "review": "amazing graphic and environment. guns feel good. however, the villains aren't as iconic as the previous far cry games and the ending is kinda anticlimactic.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game but far from the best I've played this year . Looking forward to the next farcry.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gets a bad rap for no reason, i like the skill trees but the clothes arent that bad people overreacting for real. \nStory:4-6/10 its meh but the side missions make up \nGunplay: 6-7/10 far less linear than farcry 5, however give us back melees!!! Also Supressors shouldnt overheat thats dumb, the bottle ones sure but regular suppressors? no!\nNew Game + : 0/10 Guerilla Mode is not good and thats the main reason to NG+ Farcry always does this its depressing. I shouldnt be sniped by a bot whilst im in a plane smh\n\nVehicles: 11/10 WWWW BOATS AND PLANESSSS?!! CAR GO FLY?!!!!\n\nCockfighting and Ops are cool \n\nPrepper stashes are a w per usual!!!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Far Cry 6 is an excellent title that often receives unwarranted criticism. It delivers a highly engaging experience, and I would strongly recommend giving it a try—you may end up enjoying it far more than expected.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I have postponed playing it since purchase till now, Received alot of negative hype about it from \"independent reviewers\"....And man I got to say WHAT A LOAD OF HUMAN FESCES!!! I just finished the first \"orientation area\" and man the gameplay is a BLAST!!!!  The gameplay loop is an improvement over Farcry 5 -which was addictive itself!- and the new area is rlly fun! The story is just Just cause 5 -also from Ubisoft- and the characters u meet are not strong BUT....  ITS A GREAT GAME TO \"PLAAAAY\" not to WATCH!!! Rlly glad am playing it this late!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game franchise is always up to expectation..... All that I wanted in 2025 .... just roam around and get into the character......and keeps me engaged....NICE JOB TEAM.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was surprised at how much this game was very similiar to all the other far cry games but still retains a new bit of this and that. Fun so far!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game and a must have for any fans of the FPS genre.  The graphics and sound are excellent and the story is great.  You will need at least 80 hours to get through the story and pick up most of the collectibles/ \nGuns:  There is a very good selection of guns, pistols, auto pistols, sub machine guns, rifles, sniper rifles, some LMGs can hold up to 150 rounds.  Also the are  grenade and rocket launchers, a small selection of bows and eight or so \"custom\" weapons.  Most weapons can be upgraded with various scopes and sights, different ammunition and there are custom upgrades for most weapons.  \nMap: The map is very big and the graphics are excellent.\nVehicles, there are a lot of vehicles from cars and trucks to boats and jetskis also planes and helicopters however the planes handle like they do in every other ubisoft game and the helicopters handle like they do in every other far cry game which is to say that they do not handle at all like a helicopter and are quite annoying to fly, basically a waste of time.\nI personally rate this game at 94%.  I think this is a very likeable game and definitely the best in the Far Cry series so far.  :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall okay/good.\nDoing the 100% took some time but it was fun, but also grindy.\n\nPluses:\n-The story was okay. (at least when played after previously completing every other activities possible)\n-The weapon and armor acquisition, upgrades, and gunplay were good but would need some more polish.\n-The wingsuit finally works better than it worked in most previous titles.\n-The DLC's were cool to play, especially the \"Lost Between Worlds\" one.\n\nMinuses:\n-The FOV in vehicles is a total bullshit, also the fact that most cars have the same max speed is just shit.\n-The map is just weird, the amount of bigger inhabitated areas is too small. Most fun I've had was in the cities or in environments with more buildings, which there is a very little number of.\n-Flying a plane is very not intuitive, the overall steering and feel is very weird.\n-Some content was scrapped from the game since launch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good graphics and the story is quite interesting as well. Liked the game mechanics as well and the different supremos and the utility system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WAY better than 5. I feel alot more effot was put into the player character *Danni* as opposed to ye ol \"John Farcry\"\r\n\r\nStill uses the same forumula but overall i had alot more fun playing this than 5",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is actually my absolutely favorite game after years of gaming and never really having a 'favorite'. The movement is so fun, the topic of the story is amazing, Dani is such a wonderful character, I love her.\r\nYes, just yes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good but not great. Engaging gameplay but it seems pretty much same and missing gameplay dynamics. Stroryline is not well presented as well. But overall its a fine game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're a fan of singleplayer shooters like I am, then this game is a must-play. Yes, Far cry 5 was bettter, but that doesn't mean this one is bad at all. The ending was a bit underwhelming tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Look, I actually enjoyed this game. I think it was mostly from aesthetics from yara but I enjoyed this game. Sure it's not like other fc games, but that doesn't mean this one was TOO bad (key word: too). Antagonists did not feel as involved in the story as they should typically be, the story is high-mid at best, I just played this to have fun with mindless violence. Also ubisoft makes me wanna kill myself\n6.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, a different style compared to older farcry's but that doesn't make it bad. 4 years later no bugs or glitches on pc so I will say its 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun game where you even have a crocodile as a pet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played it on xbox then i got it for dead cheap on pc its mid like the npc AI is retarded but the gun play mad good the story is shit but the tank is fun so very low 6/10 just play it on the hardest to make it kind of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Being a far cry franchise fan, FAR CRY 6 brings nothing new to the table but also an experience of good story line. Also the finale of the game feels bit off because of the antagonist action and also no scenic involvement of Dani's gang member into fight. It felt like it got over soon, although after 50+ hrs of game play I would definitely say that taking over the towers and killing feels cool. At last, if you are a FAR CRY fan, then definitely give it a go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry 6 is a game full of mixed feelings. The open world is huge, vibrant, and a joy to explore—tropical islands, detailed cities, and wild areas all look fantastic. There’s no shortage of collectibles and side activities, and the game offers plenty to keep you busy for hours. In terms of scale and variety, it succeeds.\r\n\r\nUnfortunately, the story and main missions are underwhelming. The villain and his son had real potential, but it feels wasted. Missions are often repetitive and fail to evoke strong emotions, and the story leans heavily on political correctness, which undermines the darker tone the series usually thrives on.\r\n\r\nGameplay remains enjoyable thanks to a wide variety of weapons and the freedom to tackle missions in multiple ways. Experimenting with tactics and gadgets can create fun moments, but the series’ formula is starting to feel stale and predictable.\r\n\r\nOverall, Far Cry 6 is worth playing for its world and gameplay freedom, but it lacks the strong story and character moments that make a Far Cry game truly memorable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has good graphics, has very good optimization (runs like a butter on my system). This game is a good example how to make a game with great visuals and at the same time how to optimize it well. This island where game takes the place is also very beautiful with beaches and sunny weather. However game is ruined by \na few things: Shitty hip-hop music or some latino music which I hate. Horrible latino accent which I also hate and most importantly game is ruined by woke propaganda. It's probably the same woke devs who made Watch_Dogs 2. Their signature is very obvious - LGBT propaganda, commie propaganda, diversity propaganda. It's hard to decide to give this game positive or negative review because of its cons and pros, but I think I'll still give it positive review because of awesome gameplay, good graphics and optimization.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this on my xbox via gamepass... ABSOLUTE MEDIA\nHad to buy it again on steam just to play it again!!!\nW dani!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really don't understand what is all the hate with this game. Probably because I haven't played other FC titles. Even so, comparing it to other open world games such as GTA V, Watchdogs 1 and 2, this isn't a bad game at all!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent FPS, can be played through stealth or just going in shooting everything. It's a little bit easy but decent overall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h2]Hola... Soy Dani, Dani Rojas. And this.. is my confession.[/h2]\r\n\r\nI was one of the leaders of the new revolución in Yara. In case you didn't hear about it, it's a huge, beautiful country, mostly comparable to Cuba. Country which suffered under violent dictatorship of el presidente - Anton Castillo. I was just a citizen, living under his hard rule with no intention to do anything.. I was no hero. But then, one night, Antóns military forces pushed into the main city with intention to find and execute everyone, who was against the regime... my friends died and I was lost alone, barely survived. I managed to meet Clara Garcia, who was a head of guerrillas back then and I agreed to help her with her cause for a promise of a boat, that would take me to exile to USA. But as legendary guerrilla Juan Cortez always says - [b]\"Once a guerrilla, always a guerrilla.\"[/b] I stayed and we managed to partner up with revolutionary legends like La Moral, Legends of 67´ and Maximas Matanzas (Coňo, those were crazy cabrónes) and we took our country back and put Castillo in the ground! ... well, it didn't go as planned and many died for the cause.. but hey, that's revolution, right?...\r\n\r\nNow you, dear player, can go in my steps, stand where I stood and reconstruct all those events by yourself! Don't hesitate, don't believe those reviewers who don't have the cojones to grow up and stop being stuck in \"good old times\" in Far Cry 3. This game is f-in worth it and I promise you, you'll have fun!\r\n\r\n[h1]VIVA REVOLUCIÓN!! VIVA LIBERTAD!![/h1]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h3][i]When you go to war as a young boy, you have a great illusion of immortality. Other people get killed; not you.[/i][/h3]\n[b]\"You were the lucky one.\"[/b]\n\nThis game took me a little over 50 hours to fully complete. If you are familiar with the previous entries, this might feel a little bit like Thor: Ragnarok felt after the first two Thor movies.\n\nFirst off, the story starts very strong. It is intense and interesting. It quickly falls off after the prologue to make space for [i]your[/i] gameplay. You can play stealth or loud, you can make sick homemade weapons or stick to the classics. Great customization options, too. A bit tiring to run around the map to collect stuff for upgrades, but I get the point of it.\n\nThe map is [b]huge[/b]. And vibrant and colorful. Some animals, too. A lot to do, a lot to collect. Environment is destructible on a scale I haven't seen before in the Far Cry series.\n\nBack to story – it quickly falls off and has problems getting up again. It feels like there's too many [b]comic relief[/b] characters and it takes down the classical serious tone of FC. It's sometimes cringe, sometimes it feels woke-forced (not too much, but still odd). And then you are introduced to [i]another[/i] pile of cheerful companions, so unfit for the Far Cry world.\n\nAt that point, you play only for the [b]gameplay[/b], which is [i]extremely[/i] enjoyable.\n\nFinally, you finish the three main sections of the story, the game gets to its epilogue. According to the Steam Achievements, only [i][b]11% of players[/b] (!)[/i] made it to the endgame.\n\n[h3]But here it goes [i]nuts[/i].[/h3]\nThere is no plot armor in this game, some characters undergo deep transformation, and things happen. All in all, in the last two missions, along with the epilogue, the story grasps you once again and does not let go. Until you hear a very familiar voice in the aftercredits. And that's when you decide to get the DLCs and jump into that.\n\n[h2]8.5/10[/h2]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once Antón Castillo said: \"There are lions, and there are lambs. Rule, or be ruled. A Castillo must be a lion... for Yara is full of lambs.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can see how this game is in many ways a step back from previous entries to the series, but it's more Far Cry, it's great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible realism and Graphics. Storyline is awesome and really gets you hooked.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This of the mainline series is probably my second favorite, that doesn't make it second best but i do think its really fun if your willing to not have a stick up your butt about what \"far cry should be\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Review by [url=https://store.steampowered.com/curator/33369540-Abrix/]Abrix\n Gaming[/url] – 4K quality gameplay reviews and recommendations.[/b]\n\n[b]Far Cry 6 – Explosive, Emotional, and Full of Charisma[/b]\n\n[i]Far Cry 6[/i] is a powerful and high-octane open-world shooter that delivers everything fans of the series love — and then some. From its lush Caribbean-inspired setting to its deeply personal story, the game strikes a satisfying balance between wild action and genuine emotional stakes.\n\nYara is a rich, vibrant, and brutal island. Ruled by a ruthless dictator, it creates a sharp contrast between tropical beauty and political oppression. Exploring Yara—whether on foot, in vehicles, or using improvised guerilla gear—is constantly rewarding, with rebellion simmering beneath every mission and region.\n\nGameplay-wise, [i]Far Cry 6[/i] excels through freedom and creativity. Whether you're sneaking through enemy checkpoints, launching explosive assaults, or crafting DIY “resolver” weapons, the game empowers you to play your way. The resolver system adds personality to every encounter, making combat feel uniquely yours.\n\nGiancarlo Esposito delivers an unforgettable performance as Anton Castillo. His cold intensity, presence, and emotional tension with his son make him one of the strongest villains in the franchise. As Dani Rojas, your journey from reluctant fighter to revolutionary hero feels personal and compelling.\n\nSide missions, hidden secrets, and guerilla tasks keep the world feeling alive. Liberating towns, rescuing civilians, hunting VIP targets, and helping locals all build a sense of active rebellion. The Amigo system—with its quirky and often hilarious animal companions—adds charm and tactical variety to combat.\n\nVisually, the game is stunning. Lush landscapes, detailed environments, and great weather effects make Yara incredibly immersive. The sound design—gunfire, wildlife, music—perfectly captures the intensity and atmosphere of a guerilla uprising.\n\n[i]Far Cry 6[/i] is explosive, emotional, stylish, and full of personality. For fans of open-world shooters and story-driven chaos, it is absolutely worth playing.\n\nYou can check my gameplay video [b][url=https://www.youtube.com/playlist?list=PLxvWbrDkSJsB7MWh79fT1gqy_e77Ep82k]here[/url][/b]\n\nSubscribe To My Youtube - https://www.youtube.com/channel/UC1ZOvQERjGtRkl7ImTcDzdw?sub_confirmation=1\nJoin My Discord - https://discord.gg/uM94ehT7hv",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game has details that i never expected off ubisoft. Amazing game. Great animations, and opppp pets. Not to mention the bigg mapp",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just what every gamer is asking for; more (mandatory) fishing mini games.\r\n\r\nAside from that, the game has some Cyberpunk gameplay vibes with far less interesting environment and characters... no offense to the voice/acting which is top notch, but the game just doesn't quite come together as a whole despite all the parts being there.  For this reason obviously don't buy at full price, but the weapons/gunplay decent enough to play the main story missions through in spare time, if you have it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its okish\r\nthe older games kinda do what far cry 6 does but better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Неплохая игра, хз почему многим не нравится игра",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like fps, open world games then this is the game for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD GAME. MANY BOOMS. GOOD STORY. ALSO, LOTS OF CHICKENS. Thanks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's ok minus the annoying micro transaction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there is a JoJo reference. Its a skin for the P226 called Purple Haze.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun iv,e played it over 3 times and keep play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy play. Good story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I dont remember this episode of breaking bad ?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "could've done better but still i enjoyed it dawg 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game. lots of shooting!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "everyone needs some therapeutic revolucion in their lives these days",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gus was acting sus.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Everything is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly pretty cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah, it's alright.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're a fan of Far Cry, this is a fun game that's certainly worth playing. However, I would not value this game above $30, so get it on sale. \r\n\r\nNote: I have not yet played any of the DLC. I will update my review once I have. \r\n\r\nIf you're new to Far Cry, I'd recommend Far Cry 5 as your starting point. I'd value Far Cry 5 at $45 today. If you enjoy Far Cry 5, you'll enjoy Far Cry 6. This game is good for dumb fun with a decent story. I loved Giancarlo Esposito's portrayal of the villain and he really brought the role to life. Others complained that the story was weird, and I think they may be in reference to the DLC. I thought the experience was overall good writing, fun gameplay, and worth the time. \r\n\r\nPoints taken off for being Ubisoft and needing their external launcher. \r\n\r\n7.5/10 game. Didn't regret my purchase.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good value on sale to play co op",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game in the series a must have when on sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my fav game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "crazy good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ура вылетело на этапе загрузки",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like a modern Far Cry 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "doesn't deserve the hate",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "NICE FAR CRY BIT REPETATIVE BUT NICE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rebuild Paradise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FIRE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "3ruy3[oi ehpuiueuiii]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "idk",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "rah",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "░░░░░░░░░░░░░░░░░░░░░░█████████\r\n░░███████░░░░░░░░░░███▒▒▒▒▒▒▒▒███\r\n░░█▒▒▒▒▒▒█░░░░░░░███▒▒▒▒▒▒▒▒▒▒▒▒▒███\r\n░░░█▒▒▒▒▒▒█░░░░██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██\r\n░░░░█▒▒▒▒▒█░░░██▒▒▒▒▒██▒▒▒▒▒▒██▒▒▒▒▒███\r\n░░░░░█▒▒▒█░░░█▒▒▒▒▒▒████▒▒▒▒████▒▒▒▒▒▒██\r\n░░░█████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██\r\n░░░█▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒▒▒▒▒▒██\r\n░██▒▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒██▒▒▒▒▒▒▒▒▒▒██▒▒▒▒██\r\n██▒▒▒███████████▒▒▒▒▒██▒▒▒▒▒▒▒▒██▒▒▒▒▒██\r\n█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒████████▒▒▒▒▒▒▒██\r\n██▒▒▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██\r\n░█▒▒▒███████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██\r\n░██▒▒▒▒▒▒▒▒▒▒████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█\r\n░░████████████░░░█████████████████",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I ONLY RECOMMEND IF THE GAME IS DISCOUNTED!\n\nIf you played Far Cry 4 or Far Cry 5 you practical played Far Cry 6. Pretty much a copy paste game with a new map and different story. Half the cut scenes aren't even worth watching. If you played other Far Cry games and want something new look else where. If you are new to the Far Cry series you will have fun, just know other Far Cry games are better.",
      "voted_up": true,
      "votes_helpful": 57
    },
    {
      "review": "It's a much better game than most people give it credit for. It has the usual arduous collectathons that Ubisoft is known for, but while I was playing, I found that the game was a million times more enjoyable when I started ignoring that part of it. This was the only thing I didn't like.\r\n\r\nThe story is nothing to write home about, but Far Cry has never been about that. Far Cry has always been about cool villains and settings. I believe Far Cry 6 hit the mark in that regard. Anton Castillo is a super cool and badass villain, and all of the lesser villains are interesting as well.  Bembe was a cool antihero that just kind of disappeared for no reason, though. I wonder what happened to him?\r\n\r\nThe allies you get are more or less forgettable, except Clara and Juan; The supremo weapons are an interesting addition to the game but I didn't use them too much and the addition of fishing was also kind of needless, but none of that lowers my opinion of the game. \r\n\r\nNot the best game ever, but I think it's a real Far Cry experience and it's certainly worth playing.",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "[b] Far Cry 6 [/b] is a game full of mixed feelings. On one side, it offers a huge and beautiful open world that is a joy to explore. The tropical islands, detailed cities, and wild areas look great, and there is always something new to discover. There are many collectibles and side activities, which can keep you busy for hours. In terms of size and variety, the game does very well.\r\n\r\nOn the other side, the story and main missions are weak. The idea of the villain and his son had a lot of potential, but in the end it feels wasted. The missions are average, often repetitive, and do not bring strong emotions. The whole story also feels heavy with political correctness, which kills the darker and more serious mood that should be here.\r\n\r\nGameplay is still fun thanks to a big choice of weapons and the freedom to finish missions in many ways. Trying different tactics and using gadgets gives some good moments, but it is also clear that the series is stuck in the same formula and does not surprise anymore.\r\n\r\nFar Cry 6 is a game to enjoy for its world and freedom, but it misses the spirit, character, and strong story. For me, it is good for exploration and action, but not a game I will remember for its story.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "I put about 150 hours in this game on ps5.  I bought it on sale on steam and it runs amazingly.\n\nLooking forward to another playthrough.\n\nI am in the minority that enjoys Ubisoft games I guess.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "Do you want to enjoy this game? I've found most of the fun from this game comes from getting sidetracked so have some tips:\n\nTake a long drive with the mc instead of teleporting; sometimes they will sing along to the songs on the radio. Change the radio station and they will continue singing for a bit. I know this sounds weird but it feels sooooo good in a game hahaha\nFind an animal called a hutia; you can stop a moment in your bloodthirsty chase to feed it some crackers \nAsk your crocodile to help you attack that cute dog that's barking at you. (most violent thing I've seen no cap)\nThank your horse for the safe travel by shooting them in the head as you're mounted (anti-brony energy)\nI once heard the enemy soldier say \"We can win this! We have WOMEN!!\" (Tell me that wasn't on purpose)\n\nRemember, games are the funnest when you search out the fun yourself :)",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "I was doubting I’d like the game, but I unexpectedly enjoyed it even more than Far Cry 5 in terms of gameplay. The story isn’t that great though, there’s one villain, and I haven’t even seen his face yet. The main character and their group keep hating on this villain I don’t even know. Unlike FC 5, all villains feels like final bosses lmao.\n\nPersonally, I really like the gun-collecting mechanic. In previous Far Cry games, I always used the same few guns and never felt like trying new ones. This one actually encourages me to experiment with different weapons. Although, I don’t like the bullet type system, why the hell do armor piercing rounds do less damage to enemies who are literally just wearing shirts?",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "[h1] Fun Gameplay, But Drowned in Flaws [/h1]\r\n[hr] [/hr]\r\n[i] Far Cry 6 carries the same addictive gameplay DNA the series is known for - chaotic shootouts, exploration, and plenty of toys to mess around with. That part’s still fun. But, everything else struggles to keep up. [/i]\r\n\r\n[b]\r\nStory: The narrative suffers from an identity crisis — unsure if it wants to be about escape, liberation, compassion, or rebellion. It jumps between tones with no clear direction or emotional payoff. The serious themes of Castillo’s dictatorship clash awkwardly with goofy side missions and party cutscenes. The writing almost entirely felt inconsistent.\r\n\r\nCharacters: The world is bloated with forgettable faces and shallow arcs. There’s little attachment or weight to the cast, and the game’s attempt at emotional depth (a single late flashback and a forced “leader” moment) falls flat.\r\n\r\nCo-op Experience: Playing co-op feels like a punishment — many unlockables, tools, and achievements are tied to solo progression. I missed out on the wingsuit, several weapons, and amigos because I played entirely in my friend’s world.\r\n[/b]\r\n\r\n[hr] [/hr]\r\n[i] Despite all this, the core gameplay loop is still solid - fun but familiar. If you’re in the mood for some brainless chaos, grab it on a deep sale. Otherwise, it’s hard to recommend. [/i]\r\n\r\n[b] Verdict: Great fun, wasted potential = 5.5/10 [/b]",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "its a far cry game. not a good one but not a bad one either. not worth full price but i had fun with it.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "42 hours in so far...it's another FarCry game...hate it or love it.\r\nThis game caters to different types of playstyles and is very very big so you can sink a lot of hours into it",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Found the game and story to be not bad.  Preferred some of the older mechanics for levelling and skills from older far cry games, but overall not bad",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "[h2] Short version of my review - [/h2]\n7/10 game. Beautiful visuals, okay-ish open-world, satisfying gunplay, and a very good lore with a somewhat weak execution. Good for your first playthrough, but not for replaying. Buy it if you get it on sale, and you are not a huge fan of dense open-worlds and would be content with driving around empty roads, and you love some gunplay action.\n\nBut compared to other Far Cry games, like FC3 and 4, this is not even close. But if you're a first timer, you'd enjoy it tho. And there's nothing this game has what other FC games haven't. This is just some sorta copy-paste from previous titles with a new lore.\n\n[h2]Long Version:[/h2]\n\n1. Graphics and Sound - [b]9/10[/b].\nSound design is very good, and it really creates the sense of revolution that the lore seems to portray. Graphics are really good, colours are saturates, in a good way, of course, and the whole world feels colourful, which creates the lore even more chilling. The devs have put color science to a good use!\n\n2. Gameplay and mechanics - [b]8.5/10[/b]\nGunplay is awesome, every shot feels satisfying. Driving is very good, responsive and asthetically realistic. First person animations are also good, but they could have been better, especially those animations in which Dani is holding a gun. In terms of combat, melee is limited to machatte kills and basic slash. Guns have variety, but you get limited ammo, and hence ammo conservation is important in large-scale combat scenarios, which also feels good and amusing. The weapon and ride upgrades are also good, and I enjoyed upgrading my guns and supremos very much. But almost all mechanics were also present in the previous FC games, so nothing new here.\n\n3. Environment and Open world - [b]7.5/10[/b]\nThe environment is mostly forests with roads all over. You'd enjoy driving for a few hours, but then you'd slowly lose interest. The open world feels very empty, with some Castillo's soldiers here and there, some prisoners, and some trucks. If you are a fan of open worlds, this isn't for you. The destructible environments, like trees, bushes and other stuff look good, and overall ambience is good. But you'd miss the open-world feeling, as there is nothing in it.\n\n4. Story and lore - [b]6/10[/b]\nAs I said earlier, the base lore is quite good - A dictator taking control of a country, and revolutionaries trying to overthrow him (this is just the basic, if you wanna know about the lore, search it up on the internet). The game writer did a good job, but the narrative structure doesn't do it much justice. I mean, this lore could have made some really great stories, but the overall narrative execution was perhaps the weakest part of this game. The cutscenes are somewhat good, they look cinematic. But I do think they might have been made better. But overall, you'd enjoy the story if you are not going for a truly real experience. The main antagonist doesn't care even if you capture every single checkpost and base, and there are quite a few such things which can break immersion, but still, it's manageable.\n\n[h3]VERDICT:[/h3]\nThe game has its share of flaws, but the overall lore, mechanics and the ambience of the game hooked me till the end. But is the game worth its full price? I'd say no. Buy it in sales, when the price drops by more than 60%. I also purchased the game for ~$7 in a sale (INR 599), thanks to regional pricing in India. And what I got was an immense value for my money.\n\n[b]A respectable 7/10.[/b]",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Far Cry 6 is a big, loud, chaotic open-world shooter with fun gunplay, crazy gadgets, and great co-op. The map can feel cluttered and the gameplay gets repetitive, but if you enjoy “sandbox chaos” and don’t mind some grind, it’s an easy game to recommend.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I have postponed playing it since purchase till now, Received alot of negative hype about it from \"independent reviewers\"....And man I got to say WHAT A LOAD OF HUMAN FESCES!!! I just finished the first \"orientation area\" and man the gameplay is a BLAST!!!!  The gameplay loop is an improvement over Farcry 5 -which was addictive itself!- and the new area is rlly fun! The story is just Just cause 5 -also from Ubisoft- and the characters u meet are not strong BUT....  ITS A GREAT GAME TO \"PLAAAAY\" not to WATCH!!! Rlly glad am playing it this late!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "great story great game play and great coop with friends loads of fun",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Gets a bad rap for no reason, i like the skill trees but the clothes arent that bad people overreacting for real. \nStory:4-6/10 its meh but the side missions make up \nGunplay: 6-7/10 far less linear than farcry 5, however give us back melees!!! Also Supressors shouldnt overheat thats dumb, the bottle ones sure but regular suppressors? no!\nNew Game + : 0/10 Guerilla Mode is not good and thats the main reason to NG+ Farcry always does this its depressing. I shouldnt be sniped by a bot whilst im in a plane smh\n\nVehicles: 11/10 WWWW BOATS AND PLANESSSS?!! CAR GO FLY?!!!!\n\nCockfighting and Ops are cool \n\nPrepper stashes are a w per usual!!!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Honestly it's not a very good game in terms of graphics, story, length (bloated open world as usual). The writing is awful, every single dialogue is almost like a battle of who can sound cooler than the other, if I was Gen Z I'd say \"cringe\". The driving is atrocious, FOV in vehicles is completely FUBAR.\r\n\r\nBut I'd be lying if I said I wasn't having a lot of fun while playing. Gunplay is good, weapon upgrades are kinda fun. The armor system allows for some more personalized gameplay.\r\n\r\nAlso beware, coop progression is for the host only. When will devs learn?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can only recommend getting this if you're a fan of the FC series in general.\n\nThe story is bland with shallow characters; doesn't have the same charm as FC3/4. Quite a number of quests are bugged and take multiple resets for them to work properly. Co-op is fun but only for the host; the joiner makes 0 progression on their own game. The map is too huge for how little actual content there is and travelling it at first is a pain - your character is really slow and driving anything locks you in a jarring 50 FOV view. The gunplay is the only decent thing with the game, It is quite fun if you enjoy exploring and shooting things, which I personally enjoy and hence the mild recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game itself is \"meh\". You go there, destroy this and that and so on. Repetition after repetition. Once you find a tank, the game becomes significantly easier—you don't need to put in any effort to succeed. A plus for the game is that it's entertaining for that momentary dopamine rush. Would I recommend buying it? Probably not. Better to buy Far Cry 3 instead.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game engine is pretty weak, can easily soft-lock, drop frames, or crash if you play the game too aggressively, especially on New Game +. Otherwise, it's a far cry game I guess, usual bells and whistles. FC3 still the best by far, but I enjoyed it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☑ Fast\r\n☑ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☑ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ 9.5 / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☐ 9\r\n☑ 10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "yeah i acually like it, it is kinda surface deep but the gameplay is pretty good and having \r\nGustavo \"Gus\" Fring in a game is good",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Welp I wrote a couple of paragraphs and accidentally closed Steam. So the TLDR;\n\nThe main villain does not care if you take out his key people, NPCs are brainless, game is buggy at times, and I beat the whole game with my first gun (MS16). Slap a suppressor and armor piercing rounds on it and you're good to go.\n\nCompared to Far Cry 3 and 4, this game is trash.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "One of the worse games I've ever played, but playing co-op with a mate makes for some funny moments. \r\n\r\nFC3 is the king of the franchise, buy that instead.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Pretty Boring even with co-op. The game takes too long to get you of the first island. The armor system isn't as fun as Far Cry 5's skill tree. The super attack feels tacked on to be like other looter shooters and doesn't fit.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "“If this is your first Far Cry, ignore the reviews and enjoy it\" \n fuxk u ubisoft change this fuxking game and  game structure enough its been 5 games since far cry3. change this game already. Same engine, same structure, same repetitive missions for like five games straight.\nI’m tired of ‘Dani, pick up that truck,’ ‘Dani, seize that outpost.’ Just give us something fresh.”",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "40 hours of boredom.\r\n\r\nThis is the least Far Cry of the series and the story is all on rails with no player agency or choice. They keep trying to recapture 4 but just dig that hole deeper every time. Lots of \"moral\" high roading and preaching about whatever the liberal arts dev team thought was important in that microsecond before they got bored and started a new sermon.\r\n\r\nThe ending is as tragic as the lack of talent and the gameplay is full of persistent bugs like super auto aim that tries to get you killed, texture glitches galore, and enemies getting either stuck or spawning way too far outside the mission area. There's also a lot of Nu Saints Row humor that just feels awkward and out of place with most characters being caricatures of someone's buddy from \"that one party.\"\r\n\r\nAll in all I'd say skip it and just replay Far Cry 4.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h1] Far cry fatigue is real [/h1]\n\nAgain the same problem as any recent Ubisoft franchise. The game is just a 11/20 and become less than 8 if you played any other entry in the franchise recently.\nIt plays and feels like any other damn game of the franchise since the third one, game is good looking enough but nothing incredible (yeah it has Far cry 3 vibe but the world doesn't feel as interesting), finally they patched for performance since the launch so that's a good thing, but this game doesn't have anything more than just being a new skin for Far Cry.\nAnd the biggest problem is AI and difficulty, the enemies in this game are even dumber than before and because many camps in this game are small you feel this even more, even in the highest difficult you can just sprint inside and full auto everyone without even caring about alarm and stealth. Not even mentioning the new gadget mechanic that makes the game even more a joke where you can blow a full squad for a mission by just pressing a button. \n\n[h3]Overall an soulless game where you're going to walk and shoot for 2 hours before just uninstalling the game by boredness of playing it and will not even remember it's existence after a day. [/h3]",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is just cheeks. There are so many other games doing it better. I think I got this on a major sale and still refunded it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "At just under 30 hours of playtime, I've completed 1 of the 3 main zones of the main game. But I feel like I've seen all the game is really going to offer.\n\nThe map is huge, there are tons of things to do in typical Ubisoft open-world checklist fashion, but these side activities and objectives get bland extremely quickly, with minimal variety:\n[list]\n[*] \"Races\" that are just driving/flying through some rings and are practically impossible to lose \n[*] Checkpoints that you can capture for fast travel points are laid out identical to each other and take no thinking to complete (3 braindead enemies at most, the AI in general are absolute pushovers)\n[*] Collect-a-thon of random items that you can either painstakingly walk around trying to find, or you can pay real money in the Ubi store to show them all on the map\n[/list]\n\nUbisoft is SO CLOSE to making a great Far Cry game, they just focus too much on QUANTITY of things to do instead of focusing on handmade QUALITY missions and activities.\n\nAlso, it's insane that this game takes up 170GB of space on disk, just because Ubisoft forces you to download game audio for all supported languages, instead of those being selective optional downloads.  If you go in and remove all those extra files, the game goes from 170GB to 65GB. Crazy.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's not the best and i didn't like it to much but game play was fun. story was meh. over all wasn't for me but you might feel different",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After playing the game for 100+ hours. It's a slog. I waited for a long time before I made a verdict. \n\nDon't even bother buying the DLCs, those doesn't matter anyway.\n\nGame is campy, the world expansive but dull. The only good thing that came out of this was Giancarlo Esposito's acting but that's it. Nada\n\nOnly buy this game on a discount.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Far cry 6 is so trash. Many bug and the dualsense have a bad delay. Worst game ever.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feels like playing just case 3. Game lags to a crawl every 20 minutes and has to be restarted. Missions feel pointless. Areas feel random. Ammo and stats all tied to gear is really really awful - having to change your gear to do specific things like not being able to carry grenades unless you change your pants... At first it was cool but then just started dragging down with the gearing. The lag issues are horrible and widely reported on.  No skill trees - you put on a shirt so you can stealth, put on pants so you can do more armor damage, put on shoes so you don't get knocked down... Constant gear changing. Exploring is pointless because you'll end up coming back and clearing the same place out during a mission. Enemies really don't have much AI to them, they randomly appear in groups. It's just, awful, straight up awful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would recommend anyone to play this game please play it with mods, it so much better.\nIt fixes every dumb stuff they've done to this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the worst made games I've ever played.  You can't even use a tank to run over a lightpole.  You don't even wanna know what else you can't simply do with the horribly done physics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry 6 is a disgrace to the series\r\n\r\nI have played almost 20 hours, and I can say it with confidence: this game is a disgrace to the entire Far Cry series.\r\nI have met people who loved Far Cry 3, some who preferred 4, others who enjoyed 5. Each had its own charm and atmosphere. But Far Cry 6 is simply a failure.\r\n\r\nThe game is full of bugs. My \"favorite\" one happens when after loading you cannot even move your character. During one of the launches, the minimap did not work at all. And there are dozens more like that. The game feels unfinished even two years after release. It is obvious that Ubisoft just abandoned it.\r\n\r\nBut bugs are not the only issue. The story is dull and uninspired, the characters are flat, and the side quests are completely meaningless.\r\nThe worst part is the feeling that the game forces you to play it. You do not spend time in Far Cry 6 because it is fun, you do it because the game makes you waste time.\r\n\r\nYou are constantly looting junk, missions are artificially stretched just to keep you busy.\r\nHere are two examples that perfectly describe the experience:\r\n\r\n1)Treasure Hunt.\r\nIt starts off interesting: you have to feed a pelican so it takes you to the next location. Sounds fun, right? Until you realize you have to feed it five times after every step of the way: climbing down a hill, sailing, riding, climbing again. It is not challenging, it is exhausting.\r\n2)Waiting for an NPC.\r\nIn another mission, you literally wait for an NPC to walk across the island for about five real minutes just so you can pick up an item. That is the whole mission. Completely pointless.\r\n\r\nAnd that is the entire game: a massive map filled with meaningless loot. You will explore a cave for five minutes only to get a weapon charm, something you can hang on a fishing rod.\r\nThanks Ubisoft. You have officially killed the franchise.\r\n\r\nVerdict: I strongly do not recommend this game. It is a waste of both money and time. If you want a real Far Cry experience, play the earlier titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Every once in a while i open the game as i remember the good acting, music and atmosphere. Then 5 minutes later i close the game as i remember the extremely poor damage system, where a regular bullet is great for a body shot and an armour piersing is great for helmet penetration BUT for some reason is shit against bodyshots and takes 10 shots in the chest to kill a guy without body armor?  I am supposed to switch weapons or magazines depending on whether i want to shoot a person in the head or in the body to get realistic damage??? Super sloppy design with 0 thought in this game. A complete waste of talent that went into the other aspects of the game. Far cary has never been super realistic in that regard, but this is just too much for me. This will be the first far cry game I wont finish.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honesty, feels a bit more sloppish. The fact that we get a pet gator named guapo within 15 mins just feels too silly and quirky. I like the more serious tone matter of past entries in the games. But within my first impression? The worst is such shallow characters. It's all such basic, oh i dont like this guy that is comedically evil. The start was not as strong as other titles and seems like purely quirky gimmicks. I'd rather spend my time with farcry 3-5. 4 being my nostalgic blast, and 5 being the most fun ive had with a very intriguing story. New dawn completely sucked and I believe is the worst one and should've never existed. Ubisoft falling off.\n\nEdit: Nah, even after offf bearing my teeth and continuing it, it was poor quality compared to other titles. The AI suck, as helicopters seemed broken, the driving doesnt feel right and again, the characters felt so shallow to me. The other games are of higher quality and feel like less of quantity over quality. There is so much cut QOL content compared to the other games. I used to be a HUGE ubisoft fan, but they have truly fallen off poorly. This game sucks compared to the rest of the franchise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's like eating McDonalds... I like Mcdonels! But when your franchise has the habit of serving me steak... Serving me Mcdonals feels like a slap in the face.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Яка ж це залупа після шедевральної 4 і класного коопа в 5!\nНЕ КУПУЙТЕ!!! \n1/10 - 0.5 за Джанкарло Еспозіто і 0.5 за Livin’ la vida loca",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "worst FarCry ever, dont waste your money, 0-10 cant even force myself to finish it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Launcher kayak babi, tai lu Ubisoft error2 mulu.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Only fun part was the combat. I want half my time back. The travel dialog was PAINFUL. I don't care your papa never took you fishing. I don't care how much you miss  your mama's kisses. I'm here to shoot things and make them dead! The end. Good lord the ending. Save your money. Save your time. youtube this!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Piece of sh*t, budget animations, budget graphic & trash story",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Spent the whole fucking budget on Giancarlo Esposito being the villain. thanks ubisoft you've created another buggy pile of shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "- Buggy missions\n- slow follow NPC missions \n- NPC stop walking you you get too far ahead  \n- NPCS walk slow\n- annoying voice actors, so much so that I had to mute dialog",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Easily the worst installment of this series, after FC1 that is",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Far Cry 6 Review[/h1]\n\n[hr]\n[h1]In One Word - Average[/h1]\nLooks great and plays fine, but it is the definition of average. Core game is serviceable, story misses, ending flops, and the DLCs are rough. Maybe grab on sale if you are new to Far Cry. Veterans will feel the déjà vu.\n\n[hr]\n[h1]What Works[/h1]\n\nGraphics are gorgeous and the world is nice to look at\n\nVoice acting is solid and companions are likable\n\nBig map with plenty to poke at\n\nPerformance is better now than at launch and I ran into very few bugs\n\n[hr]\n[h1]What Does Not[/h1]\n\nStory is mediocre and the ending is a letdown\n\nMissions and side content blend together and rarely surprise\n\nExploration often feels empty and unrewarding\n\nCollectibles feel like padding for achievement hunters more than meaningful content\n\n[hr]\n[h1]World and Exploration[/h1]\nYara is pretty and fun to roam at first. After a while it feels wide but thin. You will clear icons, loot things, and move on without many memorable moments.\n\n[hr]\n[h1]DLCs[/h1]\nThe villain DLCs sound great on paper, but each one is basically the same loop with a different coat of paint. Repetitive and not worth the price. Lost Between Worlds is an odd fit that does not add much and is not included in the season pass, which is frustrating. Paying extra for something that feels disconnected is a bad look.\n\n[hr]\n[h1]Combat and Gameplay[/h1]\nShoots well enough and the toys are flashy, but it rarely evolves. If you have played any recent Far Cry, you have basically played this one.\n\n[hr]\n[h1]Achievements[/h1]\nMostly grindy but doable. The standout pain is “Oh No You Don’t,” which requires killing three insurgent leaders and is gated weekly. No quick workaround anymore, so it becomes a waiting game in a single player title. Not fun.\n\n[hr]\n[h1]Who Should Play[/h1]\nIf this is your first Far Cry or you only dabbled in one of the older ones, you may enjoy the spectacle and the map checklist. If you have history with the series and expect the next step up, you will probably be disappointed.\n\n[hr]\n[h1]Verdict[/h1]\nFar Cry 6 is fine, just not exciting. Pretty visuals and decent performances carry it, but the story, mission design, and DLCs drag it down. Newcomers on a discount might have a good time. Everyone else can skip or wait for a deep sale.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "No just no. It becomes boring and disappointing very very quickly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry 6 – A Beautiful but Broken Revolution\n\nI’ve played every Far Cry game since the beginning, and to me, Far Cry 2 and 3 are still the best in the series. They had a raw intensity and sense of freedom that made the franchise what it is. Sadly, Far Cry 6 feels like a big step backward a flashy open world that looks amazing but plays terribly.\n\nThe Good\n\nLet’s start with what works. The world of Yara is visually stunning easily one of the best-looking environments Ubisoft has ever created. The lighting, detail, and atmosphere make the island feel alive at first glance.\nThe soundtrack is solid, and Giancarlo Esposito’s performance as Antón Castillo brings some much-needed personality to the story. When the game actually works, chaotic firefights and explosions still deliver that signature Far Cry energy.\n\nThe Problems\n\nUnfortunately, almost everything else falls apart fast.\n\n1. Dumb and Broken AI\nNPCs and enemies act like they’ve never been tested. Enemies ignore you in plain sight, react late, or glitch into walls. Civilians just wander aimlessly with no life to them. For a game set in a supposed revolution, it feels surprisingly empty and soulless.\n\n2. Outposts and Red Zones Are a Disaster\nOne of my biggest frustrations  and many players agree  is how inconsistent the control zones are. Some red areas on the map can’t even be cleared properly. Others stay red even after you’ve fought everyone there. And disabling alarms sometimes triggers bugs that break the area entirely.\nIn an open world game built on freedom and territory control, this completely kills the motivation to explore.\n\n3. Terrible Flying and Vehicle Controls\nFlying planes and helicopters should be exciting  instead, it feels like a fight against the controls. The handling is stiff, unresponsive, and ruins any sense of fun. Even driving doesn’t feel smooth, which is shocking for a game this large.\n\n4. Weapons Feel Weak and Unrewarding\nThe guns sound and feel like toys. There’s no impact when shooting  headshots or body shots, it all feels the same. Enemies drop with no weight or reaction, making combat dull and repetitive.\nAnd the weapon upgrade system? Overcomplicated and unrewarding. I spent more time in menus trying to understand attachments than actually enjoying the firefights.\n\n5. Full of Bugs and Technical Issues\nFrom outpost alarms bugging out to enemies spawning inside objects, Far Cry 6 constantly breaks immersion. It’s hard to enjoy when you’re never sure whether something’s a feature or just another glitch.\n\nCompared to the Classics\n\nFar Cry 3 and 4 had something this game doesn’t soul. They gave players tension, choice, and that gritty sense of survival. Far Cry 6 looks bigger and louder, but it’s missing the essence that made the older games unforgettable. It’s overdesigned, underpolished, and far less satisfying.\n\nFinal Verdict\n\nFar Cry 6 could have been a great evolution of the series, but instead, it’s a beautiful shell filled with bugs, broken systems, and lifeless design.\nIf you loved Far Cry 3 or 4.you’ll likely find this one disappointing. It’s a game that wants to give you freedom but ends up restricting it at every turn.\n\nRating: ★★☆☆☆ (2/5)\nVerdict: A stunning island, but a broken experience. The heart of Far Cry is lost here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BORING doing same shit, you want to get a car? well wait for  a damn NPC to come the fuck out of it. WOKE shit at the same time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i put 60 hours in this game with a friend and i can confidently say..the writing for the story is terrible and the addition of two characters who are stereotypes and one of them actually being TWO stereotypes at once is laughable and insulting. The game play itself is the only redeeming part of the game and even that is lack luster. this game is fun to play-but HORRIBLE to experience. 4/10 fck Ubisoft",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "farcry 6 is worst game in farcry franchise in my opinion .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game at least twice before. They were called Far Cry 4 and Far Cry 5. Complete and utter shit, exactly the same game in new packaging. Far Cry is dead. Do not waste money on this game, at full retail or at a discount.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Despite the great voice acting cast this game does not live up to the Far Cry name.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nope. The best part of this title was Giancarlo and they managed to fumble that too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Another bad game for Far Cry, I'm done with this..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too long and boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pure Communist propaganda Garbage worst in the series by FAR",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "takes what far cry does best and then did none of it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a farcry from what the series use to be",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i get 10 fps on 720p with a 1660 super",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WTF, what happened to the FC series",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Castillo had more flavour back when he served chicken.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ubisoft Connect is a trashfire",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "how get activation code",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate vegan pizza,.,,..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just get FC 5",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hot garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mid",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "UbiTrash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I understand why people dislike this game. I liked it for a short while (thanks to mods making it a bearable experience) but it gets shockingly repetitive and the story fails to drag you in as much as it wants to. The health bars suck and every bullet type besides armor penetrating is literally obsolete. Stupid ending, stupid game. Played Far Cry 5 for six minutes after finishing this one and I was already much more hooked into the game. Don't bother with this game, even if its on a sale. The experience will drain you.",
      "voted_up": false,
      "votes_helpful": 134
    },
    {
      "review": "Welp I wrote a couple of paragraphs and accidentally closed Steam. So the TLDR;\n\nThe main villain does not care if you take out his key people, NPCs are brainless, game is buggy at times, and I beat the whole game with my first gun (MS16). Slap a suppressor and armor piercing rounds on it and you're good to go.\n\nCompared to Far Cry 3 and 4, this game is trash.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "“If this is your first Far Cry, ignore the reviews and enjoy it\" \n fuxk u ubisoft change this fuxking game and  game structure enough its been 5 games since far cry3. change this game already. Same engine, same structure, same repetitive missions for like five games straight.\nI’m tired of ‘Dani, pick up that truck,’ ‘Dani, seize that outpost.’ Just give us something fresh.”",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "got it for 10 bucks and it was still not worth it. it just feels so dumb when enemies are spawning out of nowhere, EVEN TANKS! like wth im driving through a jungle road, shoot one bad guy and then all of a sudden a TANK APPEARS?! hell nah stay away from this game friends",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "i put a couple hundred hours into 5. \n\nive tried to play 6 on 3 occasions over 4 years.  it is a God awful game and truly a hunk of garbage",
      "voted_up": false,
      "votes_helpful": 80
    },
    {
      "review": "I never knew the Danny Trejo & Stranger Things collabs were taken out of this game. It's a singleplayer game. Why the fuck was it a timed license?????? Why have it at all? I played through the entire game hoping to play that content again since I played it once on game pass. What a joke\n\nRambo too and I didn't even know that was a thing lmao",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Pretty Boring even with co-op. The game takes too long to get you of the first island. The armor system isn't as fun as Far Cry 5's skill tree. The super attack feels tacked on to be like other looter shooters and doesn't fit.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "something you play just to be able to be playing something. As with any far cry game, my brain tricked itself into enjoying it by equipping a full stealth loadout, usually a silenced sniper, except in this game the MS16 is the most overpowered weapon in the game and function as a sniper when you put armour piercing on it. Giancarlo shows up for about an hour total, and it’s not his best work but he’s still enjoyable as Castillo, but he doesn’t even hold a candle to Vaas or Pagan Min. Yara is a very large island with the same copy paste stuff you get in any far cry game. I usually think if it ain’t broke don’t fix it, but this is the first time in the series doing any of this stuff felt like a chore. The technical leap they took to build esperanza was a complete waste too. \n\nAlthough credit where credit is due, this is the only video game with Chorizo, so that’s a huge plus.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "One of the worse games I've ever played, but playing co-op with a mate makes for some funny moments. \r\n\r\nFC3 is the king of the franchise, buy that instead.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "40 hours of boredom.\r\n\r\nThis is the least Far Cry of the series and the story is all on rails with no player agency or choice. They keep trying to recapture 4 but just dig that hole deeper every time. Lots of \"moral\" high roading and preaching about whatever the liberal arts dev team thought was important in that microsecond before they got bored and started a new sermon.\r\n\r\nThe ending is as tragic as the lack of talent and the gameplay is full of persistent bugs like super auto aim that tries to get you killed, texture glitches galore, and enemies getting either stuck or spawning way too far outside the mission area. There's also a lot of Nu Saints Row humor that just feels awkward and out of place with most characters being caricatures of someone's buddy from \"that one party.\"\r\n\r\nAll in all I'd say skip it and just replay Far Cry 4.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Far Cry 6 tries to distinguish itself from its usual formula with some minimal changes, but somehow ends up making it worse. Gameplay aside, there are some really cringeworthy moments in the story — like the whole thing with that rap group — that are extremely hard to watch. I couldn’t even force myself to finish the DLCs; the main game is somewhat bearable, but the DLCs are a really boring mess.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "mid gameplay, mid story, mid guerilla freedom-fighter storyline, but OK terrain and game world. Don't buy unless its on sale",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h1] Far cry fatigue is real [/h1]\n\nAgain the same problem as any recent Ubisoft franchise. The game is just a 11/20 and become less than 8 if you played any other entry in the franchise recently.\nIt plays and feels like any other damn game of the franchise since the third one, game is good looking enough but nothing incredible (yeah it has Far cry 3 vibe but the world doesn't feel as interesting), finally they patched for performance since the launch so that's a good thing, but this game doesn't have anything more than just being a new skin for Far Cry.\nAnd the biggest problem is AI and difficulty, the enemies in this game are even dumber than before and because many camps in this game are small you feel this even more, even in the highest difficult you can just sprint inside and full auto everyone without even caring about alarm and stealth. Not even mentioning the new gadget mechanic that makes the game even more a joke where you can blow a full squad for a mission by just pressing a button. \n\n[h3]Overall an soulless game where you're going to walk and shoot for 2 hours before just uninstalling the game by boredness of playing it and will not even remember it's existence after a day. [/h3]",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Having absolutely loved Farcry 5 I was super excited to try farcry 6 out. It was enjoyable for perhaps the first missions until it started feeling like a chore list. This game struggles to make you care about the characters in the same way as Farcry 5 and I just found myself not really caring about them at all. On top of that all of the missions became super repetitive as it was just \"go to this base, blow it up\" over and over. The mechanics itself were pretty enjoyable for fighting and driving (with exception to the planes). I ended up uninstalling the game before I could finish as it couldn't keep my attention. I was really disappointed but hope there's another Farcry to make up for it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Removed Stranger things special mission from the game.\n\nI dont care it's a license thing, Game Content should NEVER be temporary.\nUbisoft has a great history of adding special cross over content in their game just for some times to get new players and boosts sales just to remove it later since they choose to get a temporary license for those.\n\nWe all know that Ubisoft sucks as a game developper for many reasons, but removing content from a game cant be acceptable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Extremly boring game, bought it for 10 Euro on sale and still feels like wastet money. \nEnemys AI is stupid, story is a mix of completly over cliche and so boring i litteraly switched to the second monitor to escape the meaningles babelling of the NPC´s and you cant even skip prerendert cutscenes, which is weird because i think the game should take every chance not to force the player to look at the goddamn ugly spawns that pass as charackters in this game. \n\nAll in all, dont buy it, only expeption i would spent money on this game again is to gift it to someone so they know how little i value there time. \n\nAlso, why the hell is in a game with stealth element the first companion you get a crocodile that can AND WILL blow your stealth whenever it can.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Not worth unless its 5£ or less. Worse in every way compared to previous entries.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TL;DR - this game is bad. It is, in fact, very, very not good.\n\nThere is a Steam achievement for beating the game - not to any level of completion, but just to reach the final cutscene of the story - and it has an 11.1% achievement rate. I am 0% surprised. That should really tell you all you need to know. I didn't even encounter most of the bugs that people are talking about, and I have no questions as to why so few people are reaching the end credits.\n\nFor starters, the game design is nonsensical and inconsistent. A little microcosm of an example: in the western and central sections of the main map, your missions are pretty standard fare \"follow the golden diamond on your map\" types of quests. Go to a place, kill some dudes, hit E on a computer, etc. Quest marker on everything. But in the eastern section, there are several quests where you don't get a diamond, and have to hunt and find your objective. They reference landmarks on the map to tell you where to look, which would be fine... except those landmarks' names don't appear until you reach the absolute most zoomed in level, and have to pan around searching for the stupid things. One of the missions even gives you an image on your character's phone. Of a map. With your quest targets marked. But you still don't get an in-game quest marker. Uh, okay then. It really makes it feel arbitrary when it does or does not give you these quest markers until you realize it's probably because it was a different team working on that section of the game, and they didn't check back enough with the other teams. Sloppy, sloppy design.\n\nThe design would be excusable if the story was great. Unfortunately, the writing is bland and generic. You are a guerilla. There is a dictator, and he has some generals. That's literally all you need to know. Whatever storyline you drew up in your head? Yeah, that's the exact storyline of Far Cry 6. This could maybe be redeemed if the characters were interesting enough to make up for it. Except... they're actually somehow [i]worse[/i] than the plot itself. Most of the allied characters are bland caricatures of some one to three word cliche. \"Badass woman\" is present and accounted for. \"Eccentric engineer\"? Check. \"Gay drag queen\"? You betcha! The villains are flatter still. There's absolute ZERO villain nuance. The bad guys are just completely, comically evil. Picture any bad thing a person can do. Yep! At least one of the main bad guys are doing that! Previous Far Cry games tossed in some moral quandaries as well. Far Cry 3 had you asking, \"What is all this killing doing to me?\" Far Cry 4 asked, \"Am I really picking the lesser of two (or I guess three) evils?\" Far Cry 5 even had the stones to ask, \"What if this guy is actually right? Do the ends justify the means?\" \"Nah,\" says some Ubisoft writer somewhere, \"no time for that here! Your allies are always in the right, and your enemies are always in the wrong. Nice, neat, moral black and white, just how you and your simple gamer mind like it, right? Now quick, let's use that to push an agenda!\"\n\nWhich... listen, I'm all for games making a statement. If you've built a platform and you want to use it to speak about something that's important to you, then I say go for it. But holy hell, has Far Cry 6 done it in a profoundly jarring and disingenuous way. To start, the game is set in \"I Can't Believe It's Not Cuba!\" No part of the story takes place in America (unless you count a single cutscene in the secret ending). Yet, we've still found a way to call Americans racist two separate times in the span of the main questline alone? Come on, now. Well, okay. It's annoying, but it's two lines of dialogue in a big game. The big problem is the ENTIRE THIRD OF THE GAME that is just... wall to wall bad, because they wrote around trying to shoehorn trans representation in. Look, I get it. You want to address current issues, and make people feel seen. But, this guy is in the middle of a war, where people are being killed, abducted, tortured, and subjected to human experimentation (remember, no villain nuance). So why the hell is his main concern how hard it is to be trans? Don't even get me started on the showdown with the general of that section. (spoiler describes the contents of that scene) [spoiler]She misgenders the trans character, so said character's girlfriend [i]brutally guns her down on live TV[/i]. Not to mention that disdain for LGBT is not a character trait the villain has ever shown at this point. It just happens out of nowhere for this scene, because they want to make the statement with their one-dimensional villains that evil = misgendering, and want to brutalize a character who does it.[/spoiler] It plays out like it was written by a frustrated middle-schooler, not a triple A game studio. Now don't get me wrong - representation can absolutely be done right. Kim Kitsuragi from Disco Elysium is an awesome character, and is far more concerned with being a good detective than being a homosexual (in a game about being a detective, imagine!) despite being both of those things. Even when matters of a character's sexuality/identity take center-stage, it can be done well when that's important to the plot - see Kanji Tatsumi, my literal favorite character from the Persona series. Far Cry 6, though, misses this mark HARD.\n\nOkay... so the game design is sloppy and inconsistent. The story and characters are flat at best, and the picture of abject cringeworthiness at worst. Surely the gameplay makes up for some of it, right? ...right? Well, a little... maybe. The gameplay is... fine, I guess, at least at first. It's still a step below other Far Cry titles, but it's not unplayable. There's an extra incentive when clearing out bases for stealth and picking enemies off like the guerilla you are. On paper, there's also an emphasis on picking \"the right tool for the right job\", which comes in the form of different ammo types for different enemies. However. The first ammo type you unlock is armor piercing, and you learn pretty quickly that you'll never need nor want to use anything else, except for maybe blast rounds to fight vehicles. Why? Because even the weakest guns in the game with armor piercing rounds are perfectly capable of killing any enemy in the game with one shot to the head, at any range that will ever matter. In fact, it's the only real way to kill enemies - if you hit them in the body, it can take up to 20 shots instead, depending on what gun and ammo type you're using. Slap a suppressor on that thing, and you can take down entire squads of the absolute lobotomy survivors they added to this game as enemy combatants before any of them ever notice you're ten feet from them. This is compounded by the fact that unless you're in a restricted area, you can just holster your gun and run right next to the soldiers without them doing anything, to make this game very, very, very unchallenging. Oh, also you get an ultimate ability in the form of a superpower backpack. You'll almost never need to use it, but you've got it. If you put the medical one on, you'll completely trivialize the game, since whenever you go down you can just pop your ult and get right back up. The silver lining to all this is that, because the game isn't really much of a challenge, you do feel like a total badass, clearing through hordes of soldiers without any trouble at all... at least at first. But after achieving your full potential in the first 15% of the game and with no real character progression outside of gear, it quickly descends into a boring slog for the rest. Also - how the hell did they make the TANKS in this game so clunky and impotent that they're just not worth the effort to drive? Tanks in a shooter are supposed to be awesome!\n\nAll in all - this game is just not in any way worth the time, effort, or money you'd be sinking into it. If you really want to run the gauntlet to be part of the 11.1%, I can't stop you. But now, you can never say I didn't warn you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "More money went to the voice actors then actual game-play and it shows",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "FarCry 4 was the last good game in the series. 6 is a shameless cash grab with decent gun-play and nothing to do.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Same general gameplay as the last ~4, plenty of entertainment to be had. I like the story and the characters enough. However,\n\nTons of totally unnecessary collectibles that don't even have an achievement tied to them makes it feel like worse-than-busywork, you'll get stuck in combat and unable to fast travel fairly often, hunting isn't even remotely needed nor is crafting a thing (as previous games had you making bigger bandoliers, wallets, etc). No more skill tree, it's pared down to your outfit where each slot can give you a perk and it kinda just winds up being forgotten after you get a few that you like. Supremos (backpack) are neat but I usually wound up forgetting they existed and only unlocked 80%+ of them for completion rather than even being interested in using them.\n\nSo the feel of progression is just.. not there, and there are things to unlock/do but not enough reason to bother.\n\n50+ hours in it, good podcast game, but it's a stumble for the series.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Okay, this is the first time I’m leaving a bad review on Steam for a game and I’m so so sorry but there’s very few things this game gets right.\n\nFar Cry 6 is one of the worst games I ever played. Like, the story had potential to be great, the game obviously had potential since Far Cry 5 was awesome, but it just sucks. The story progression makes absolutely no sense at all, characters just switch sides with no story (redemption/evil-ing) arc at all, the mechanics that were great in Far Cry 5 feel rushedly implemented here, what the fuck?\n\nA game about overthrowing a fascist government. Great idea, fits the Far Cry style quite well (tho some stealth/spying stuff is also lacking here), but wow this was so awfully implemented.\n\nAt this point ubisoft should just leave game developing to Massive Entertainment, who actually knows what they’re doing. They’re literally the same company, how can one make awesome games and the other one ruin perfectly great ideas?\n\n[SPOILER ALERT FROM NOW ON]\n\nThe only good thing about this game is Jonrón, and well they just fucking killed her. I might as well just abandon this game now.\n\nOf course the one game that has a cute girl with strong abs and navel piercing has to fucking kill her. Yes of course I’m salty about them killing the hot lesbian in the game. She was supposed to DATE DANI, not to BE KILLED.\n\nStill, even before this the only reason I didn’t refund this game is that I left it open while having lunch and when I thought about refunding it was already 1 hour past Steam’s 2h limit\n\nLike, from the very start of the game you’re told to “uncover the code” of the guerrilla and then “the code” is literally a fucking huge blue arrow. I’m all for making things clearly visible, but at this point just use quest markers and don’t call it a “code”? How did the soldiers not find them from all those arrows, are they stupid?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is just cheeks. There are so many other games doing it better. I think I got this on a major sale and still refunded it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "gameplay is great, as is can be expected from far cry\n\nbut its way too long, and almost all characters are terrible. makes the story very painful. libertad (the alliance you are fighting with) in its entirety is so bad it makes most of the game miserable\n\nvillain is great and every cutscene he participates in is what keeps this game alive\ni really enjoyed the map and it felt like a big upgrade over far cry 5 too\n\nseriously wasted potential, felt very close to striking gold - a lot closer than fc5 did - but ended up missing the mark by a lot more",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At just under 30 hours of playtime, I've completed 1 of the 3 main zones of the main game. But I feel like I've seen all the game is really going to offer.\n\nThe map is huge, there are tons of things to do in typical Ubisoft open-world checklist fashion, but these side activities and objectives get bland extremely quickly, with minimal variety:\n[list]\n[*] \"Races\" that are just driving/flying through some rings and are practically impossible to lose \n[*] Checkpoints that you can capture for fast travel points are laid out identical to each other and take no thinking to complete (3 braindead enemies at most, the AI in general are absolute pushovers)\n[*] Collect-a-thon of random items that you can either painstakingly walk around trying to find, or you can pay real money in the Ubi store to show them all on the map\n[/list]\n\nUbisoft is SO CLOSE to making a great Far Cry game, they just focus too much on QUANTITY of things to do instead of focusing on handmade QUALITY missions and activities.\n\nAlso, it's insane that this game takes up 170GB of space on disk, just because Ubisoft forces you to download game audio for all supported languages, instead of those being selective optional downloads.  If you go in and remove all those extra files, the game goes from 170GB to 65GB. Crazy.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It feels like you're shooting bad guys with bb pellets. The early game optics are covered in red sharpie and this guy dresses like he's going to a music festival. incompetent insurgents are absolutely repulsive. 0/10 story too.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Fire dont spread like it did in Farcry 3,4,5 \nFire turn grass black instantly and thats it.\nLAZY GAME",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The hoe that orders you around (clara) is just insufferable. \"MuRiCA eViL sO yOu cAn'T fLEe tHEre\" is her entire personality. The game is worth $3.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I can't say I have ever played a game where I wanted to aid the antagonist more than playing this.  The story was incredibly lackluster, the mechanics were incredibly annoying, but nothing was as bad as the tokenism played out by that \"Rap Group\".  That was, without a doubt, the most insufferable aspect of the game.  Compared to other titles, this is DEI slop garbage.  Not worth $5..... Play 3, 4, or 5.  Those are actually worth something.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As a person who managed to get 100% in this title I will share my opinion on this title and will try to be as objective as I can.\n\nThis year I had the pleasure of replaying Far Cry Franchise as Ubisoft is sinking due to pushing subjects nobody can related to and because they are doing poorly, they added achievements to these titles to boost traffic and try to push some sales with games that were actually published before this ''Modern audience'' Became the target audience. \n\nUnfortunately playing these games, I realized that even despite the years between the titles being released, it's the same engine and in this title, I have noticed some really lazy work from Ubisoft. \n\nIn order to judge this I will separate this to 3 parts \n\n1) Base Game \nSince they have introduced a voiced protagonist male/female this recreated the Fallout 4 paradox where I kind of did not think as if I my self was the Guerilla and I always heard my character talk to someone which I did not like too much in an FPS. \n\nUbisoft also introduced this weird thing where the avatar of the character who gives you missions speaks to you with like a window with mission description which kept breaking the emersion for me and you are no longer in the world... it's the first time I have seen them do this. And I hope if they ever survive long enough to make Far Cry 7 that they won't repeat this. Previous titles had cutscenes or characters talking to you directly!\n\nTextures were not rendering in and worst of all, some bugs prevented me from finishing a mission or run in some of the DLC and thus having to replay a whole segment which just made me mad as hell...\n\n2) Vass/Ming/Seed DLC is just definition of insanity, where you have to do busy work and repeat some activities and fight of waves of enemies... really not entertaining and worst of all, it does not kind of deepen the lore.\nIt just gives you busy work and on Mind level 5 hell of a spongy enemies so you have to mess with the difficulty to even finish these runs. The reward are like pieces of outfit and these things will be hours of time wasted especially if you want those achievements. \n\n3) The Lost Worlds honestly looks like someone from Ubisoft fell asleep while his/her PC was running the Fire strike benchmark from 3D mark GPU test then they woke up and were like hey I will turn that into some tech demo for the Far Cry Engine and mix in colors from Blood Dragon... \nIt's just some more busy work, it's not entertaining at all and if forces you again if you want achievements to run through the missions multiple times.\n\nOverall if you want to experience this title, you will have just different map compared to 3, 4, 5 but the main Villain and the story is just so forgettable I cannot recommend to anyone to buy this at full price. \n\nIf you want to add this to your library and you do not care about achievements just go for the base game, forget the DLC it's not worth the money and try to have some fun, but with the previous titles you will experience \nbetter quality villains and story.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I got this game on release because I had just finished my FUN playthrough of Far Cry 5 at that time and I 100% regret this purchase of Far Cry 6 Deluxe at FULL price because as we see I have 2.2hrs on this game because..... it ain't fun. That's it. Buy it if it's like $9.99 .. even then that's a strong maybe.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game sucks\n\nflying helicopters with infinite ammo machine gun defeats the purpose of the game.\nStory is garbage and illicits an unforgivable amount of cringe.\nAs they say as wide as an ocean, but as deep as a puddle.\nJust watch it you aren't missing anything from playing it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Far Cry 6 felt very underwhelming compared to the previous installments. Even when I was on the hardest difficulty in the game, there wasn't really much challenge during the game. \n\nThe ending was probably the most disappointing. I thought there would be some challenge, but I just kind of effortlessly sprinted through the whole thing. There wasn't really a requirement to stand and fight or to push the line for each checkpoint. You can just rush to the end where Aton is [spoiler]and he just kills himself without any final fight[/spoiler]. It's really disappointing. \n\nMy other gripe with Far Cry 6 is that there are not many characters you get attached to and the ones who do die are just nobodies to you. I forgot the guy's the name who dies at the start of the game. The death of Jason Brody's brother Grant surprised me more than this random guy Dani was friends with. You weren't expecting Grant to die, but you could easily expect this random guy to die immediately. No build up, no suspense. \n\nThe only character I actually liked from Far Cry 6 was El Tigre. I really liked El Tigre. \n\nI know there's New Game+ and content after the game finishes, but I probably won't play again unless I have a friend to play with. I bought the game when it was on sale and I finished the game. Now I'm done with it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "play for an hour it gets laggy , restart game , play another hour fine it gets laggy ... trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So I did finish the game finally after 62 hours of bloated mess. It had just enough \"fun\" parts to keep me going to the end, but I really can not recommend this one to anyone else, unless like me you have played all the other Far Cry games and wanted to see what this was about.  \r\n\r\nI don't think I've played another game that was so obviously cobbled together from the output of different teams with no central core direction focused on fun. More like a huge checklist of items with nobody seeming telling the others \"no\".\r\n\r\nYou end up collecting random garbage that soon becomes pointless as I seemed to have gotten the \"best\" equipment early on and there was nothing left to buy or spend it all on. The whole point of upgrading and gaining experience points seemed to have been left on the cutting room floor.\r\n\r\nI don't even remember the bulk of the characters, they all seemed to same to me.\r\n\r\nAlso as someone who has been playing the Far Cry series since the beginning, this one really seemed a major step down in how it looks, acts, and interesting things to do.\r\n\r\nIn summary, a hard pass unless like me you want to see what its about out of morbid curiosity.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is too slow of a pace and they are just trying to squeeze game time out of it. Most far cry games can be boiled down to take down a medium sized base and then drive to the next one. This game doesn't need boiling down. It is simply that, drive on open roads between bases and take out the very easy to kill bots. Giving players armor piercing rounds within the first 30 min defeats the entire purpose of the game. When my friends see me farming achievements for it(99 is insane for such a boring game) they ask if they should get it and I give them a hard NO.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really tried to like it but I just can't. It's far too bland & lifeless.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Far Cry 6, Is by far, wayyyyyyy WORSE than far cry 5, it is a complete and utter DOWNGRADE, in every aspect. Gunplay, Graphics, story. just dont bother",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While this game relies on crappy Ubisoft Connect deciding to work I can't recommend this.\nIs it the best Far Cry game? No\nIs it worth playing? Yes but only from a \"switch your brain off and go bang bang\" perspective\nAm I glad I bought it on sale? Good god yes",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this is not far cry, you can just see that corners have been cut, the fun details that are in every far cry game have been cut out of this one, do not get this game at full price i suggest getting this game when its on sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fine game but has bullet sponge enemies, take 20 30 bullets just to kill one. Better use sniper with armour piercing rounds, still sometimes it takes 2 fucking headshots to kill one person with no helmet or any protection. Best graphics but worst tin garbage enemy AI ever. They can’t drive, they can’t coordinate, nothing. If you use a sniper it’s easy peasy, but close range fights are a no joke hard to kill, and dodge like crazy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i bought it at 80% off but i still feel like it's bland and boring. i tried doing co-op with a friend and it wasn't anymore interesting. a far cry from how good 3 was. i think they tried a lot to make it interesting especially with the main character and stuff",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "December 2025, the game is still broken. Tried fixes on the internet but still having a fps drop. Note: those fixes are not from UBISOFT! They also don't have any plans on fixing it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EEEHHH for a first time play its fun but after you played the main story more than once its got flaws lots of them ONLY BUY ON A DISCOUNT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The visual quality is less impressive than Far Cry 4.\nThe gameplay is inferior to Far Cry 5.\nThe story is weaker than Far Cry 3.\n\nSummary: This is a very poor entry in the series and is not worth buying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "have played far cry since the first released , but far cry 6 has no soul the game feels so lifeless boring dead what a shame thanks ubisoft for killing this franchise",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't fucking work! Got crashed on startup. End up searching on Google, and thousands of people encounter the same problem, with no fix. Fuck Ubisoft scam!",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}