{
  "positive": [
    {
      "review": "Game taught me how to play Poker. Never actually learned. Didn't have a father growing up. Went to the casino after playing Balatro and made a bunch of money. Donated said money to orphanage for kids without fathers—hopefully they'll learn how to play Poker some day too.",
      "voted_up": true,
      "votes_helpful": 387
    },
    {
      "review": "[b]Balatro[/b] is a roguelite deckbuilder pretending to be a pixel-art poker game.  I know everyone's at least heard of it at this point, [i]but[/i] I've 100%'d it 2.5 times on mobile and wrote this to figure out where my life went wrong.  \n\n[h3]Gameplay[/h3]\n[b]Balatro[/b] eases you into madness: You start with a basic deck of 54 cards, score points on traditional poker hands, and earn money.   Spend that money on upgrades: joker cards that alter scoring, \"tarot cards\" that upgrade your deck, and \"celestial\" cards that increase point yields.  It seems so simple.  \n\nAnd then it goes off the rails.\n\nYou're constantly unlocking new decks that behave in unique ways, new jokers that add crazy nuance and multipliers, new ways to score, etc.  \"Spectral\" cards tempt you to risk everything in exchange for massive gains.  New difficulties force you to level up faster.  Before you know it, you've spent an entire overnight flight trying to score a hand with five gold sevens of clubs, and have yet to sleep a wink.\n\n[h3]What Works For Me[/h3]\n✅ I actually love the artwork.  It's so dumb and so simple, but some of the jokers are just… the best.\n\n✅ I did not understand poker or poker hands before [b]Balatro[/b], but \"Run Info\" includes a simple visual guide that makes more sense than any video I've ever watched.\n\n✅ The card synergies!  The absolute insanity you can create with some Magicians and a Lucky Cat, or a King, a Mime, and a lot of chariots, red seals, and demonic deer!  \n\n✅ Players that stumble across particularly cool combinations can share \"seeds\" for others to enjoy too, or use their own seeds to conduct post-mortems on rounds that didn't quite work.   Seeded games do not count toward victories or achievements.  If you're still in relatively early game, this was in my most recent play-through and is hilariously OP; I have never hit the billions so quickly: DWDV2JTN\n\n[h3]What Doesn't Work For Me[/h3]\n🟥 The Steam version is less intuitive than the mobile app (but does work well on Steamdeck).  On mobile, you drag and drop cards to buy, sell, use, etc.  On desktop, the cards sprout little tabs that you have to click to buy, sell, use, etc.  It's less tactile and a little more… fiddly.\n\n🟥 The mobile version is a battery vampire.  I recently flew from the USA to Italy and back again, and despite having my Switch and a half-dozen reports to write, played [b]Balatro[/b] the entire time.  The battery pack that powered my husband's and my phones through a week-long blackout last year was fully depleted by the time I returned home. \n\n🟥 Endless mode ramps up too quickly, especially on lower stakes.  You want to refine an interesting deck, but the game gives you a few extra antes before saying, \"Okay, now score 300 million.\"   Well, fuck you too. \n\n🟥 No one will read this review because this little indie game that the dev reportedly made for his friends has taken off like [i]Stardew Valley[/i].   I am so late to this party that it isn't even fashionable. \n\n[h3]Final Thoughts + Recommendation[/h3]\nIf you haven't played [b]Balatro[/b], or if you have but don't understand the hype (like me at first):  it starts off pretending to be poker, but it's not poker.  It is a tricky, RNG-driven roguelike with some [i]insanely[/i] cool engine-building and so much variety that you will never play the same game twice.  \n\nIn a weird way, I think it reminds me more of engine-building board games like [i]Terraforming Mars[/i], [i]Race for the Galaxy[/i], and [i]Splendor[/i] than any particular card game.  I love a good puzzle and building a good foundation, and that's what [b]Balatro[/b] is about.  It's also super easy to play in waiting rooms, lounges, in front of the TV, and so on.\n\nIf you enjoy [b]Balatro[/b], then I'd suggest checking out [i][url=https://store.steampowered.com/app/1404850/Luck_be_a_Landlord/?curator_clanid=45365863]Luck Be A Landlord[/url][/i], [i][url=https://store.steampowered.com/app/646570/Slay_the_Spire/]Slay the Spire[/url][/i], and [i][url=https://store.steampowered.com/app/3211750/Neongarten/?curator_clanid=45365863]Neongarten[/url][/i] for similar-but-different games. \n\n[quote][b]Follow [u][url=https://store.steampowered.com/curator/45365863/]Eekz Today[/url][/u] for more crafting, life sim, management, strategy, and story-rich recommendations.[/b][/quote]",
      "voted_up": true,
      "votes_helpful": 92
    },
    {
      "review": "A banana and a blueprint made me create more poker chips than there are atoms in the universe, and for all that I still was only paid 3 dollars.",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "You said to yourself \"Lets play 2 -3 rounds before I go to work\", you start to play and guess what? You defaulted today's timesheet of your job as you realised you spent the 9 hour time of your shift instead of going to work. But yeah, this game is great for short play sessions provided you can bound yourself. \r\n\r\nPsst, my Gwent addiction is transferred to Balatro. Yay, i guess!",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "After playing for 300 hours and completing every achievement I can recommend this game to everyone\r\n\r\nIt can feel simple and random at first\r\nbut then you see the number get higher and higher and you get hooked on it\r\nI'll probably spend another hundreds of hours playing this game and trying to get an even higher number",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Okay, I've yet to Fully Complete this game, or tackle its remaining challenges but very few games have topped my most played in my library. Balatro was the second game from 2024 to get me into roguelikes with the first being Side Order (Not a steam game BTW) But very rarely has a game made me triple dip, getting a console and mobile version of this game. This game just pulls you in and before you know it you've spent hours of the day on this game, possibly more. Sometimes you'll be dealt bad runs until you can break right through with a new strategy that works. You'll spend hours making new discoveries unlocking everything, and sometimes a game like this will have you running on auto pilot. I haven't even scratch the surface of this game and how I've spent hours of the day trying to win runs but im not sure if I have to time for explaining all of it.\n\nThough if Local Thunk is listening, I personally wouldn't mind the steam version getting a workshop page for all the mods that exist out there. Its funny how a simple game with playing cards can set the world and your chips and mult on fire",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Very fun. lots of cards in the floaty void. numbers go up. MUST HAVE BIGGER NUMBER!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Never expected to like a game with such idea.\n\nI never knew the rules of poker or anything close to it, but Balatro makes it all simple",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I love this game, i bought it on my other devices and i think at this point ive accumulated around 100 or more hours in total.\nAlways wondered what the appeal was since it looked like a very complex cards game, but once i tried it and got the hang of it I became addicted really fast. seeing that multiplier going up is really fun and the amount of synergies you can make is insane!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Incredibly addictive game, perfect to play if you are splitting your attention or if you are killing some time, but still some interesting depth for experimentation. Wasn't playing for a long while (for no particular reason) and jumped right back and got stuck in again in with no trouble, like riding a bike.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I told my boss I was sick but in reality I played balatro 3 days straight\nWhen I got back to work the theme music was all I could hear in my ears",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My wife and kids left me, but big number go up and my gambling addiction worsens.\r\n1000/10 game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm just here because of the Stupendium Song:\nNUMBER GO UP | Balatro Song!\n\nSo I do my part in making the number go up!\n_________\nHad one run so far and I now understand the appeal of the game, it has the right mix of RNG and strategy / adaptation to changing circumstances that make each run unique, challenging and satisfactory if won by playing your odds right and building strong synergies. I never expected my first run to turn into a \"highest odd card\" is always the best choice run but hey you roll with the punches. :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "lots of fun, despair, joy, fury, and ecstasy\r\nall in all, very addictive and will keep me coming back for years",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you buy this game .. know what you're getting into.\r\n- Bought it on PC\r\n- Got hooked\r\n- Bought it on mobile\r\n- Addicted\r\n- Went to bed at 3 last night.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is challenging and offers great replay value. The visuals and sounds make it even more addictive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Crazy addictive but never gets too repetitive, one of the best games of all time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game and I are like a couple that has been married for 50 years.\n\nIt can irritate me so much and knows how to get under my skin, yet I love it so much.\nIt can surprise me even when I'm not expecting it.\nI have strong opinions about what I'd rather it not do, yet it does it anyway.\n\n10/10 would recommend to anyone that has a crippling gambling addiction.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, absolute banger with lots of different ways to play and lots of different deck styles. \r\nYou can play this 'in between' other games too, because there's no timers or anything like that and it's heaps of fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Oh. My. God. I have always shunned \"casual\" games as they weren't for me. I decided to see what the fuss was about with this and I'm nearing 7 hours of playtime since I bought it a day and a half ago. \r\n\r\nI'm new to \"deck builders\" but Balatro is so insanely fun, challenging, addictive and relaxing at the same time I cannot explain it. It's actually made me realise my PS5 Pro is a waste of money as I have had more fun with this gem than I have with my PS5 over the last couple of months.\r\n\r\nAs a game dev, it's also got me thinking about all kinds of cool stuff that could be done with the deck builder genre.\r\n\r\nTL;DR - BUY THIS GAME AS IT IS FRIGGIN' AMAZING",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The day I downloaded this game, I stayed up until 4:51am. It will probably happen again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I started playing this game around noon on friday and stopped playing after midnight on sunday, only taking as brief as possible breaks to piss and bring food and water to my room. This game is more addictive than crack, it's ridiculous. Nothing has ever gotten me to no-life like that before, and I hope nothing else ever does again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great game that is easy to get in to and complex enough at higher levels for more serious players.\r\n\r\nDefinitely recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "phenomenal game that I was not expecting to get addicted to. Own it on PC and mobile.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Small numbers go big. Noises make brain go brrrrr 10/10 should of won game of the year",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The only thing this game has taught me is that ONE in FOUR\nDOES NOT MEAN ONE IN FUCKING FOUR\n.\n.\n.\n.\n.\nNope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope! Nope!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's such an addictive game. Just like gambling, you simply can't stop",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is timeless, essential, and has infinite replayability. It's in the ranks of Chess or Solitaire. Recommended to everyone and their dog.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Классная игрушка, помогает вечером отвлечься от суеты и погрузиться в процесс составления комбинаций и просчетов. Очень затягивает. Рекомендую!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Top 2 rogue likes ever made. The game gets harder and harder and the possibility of combos is infinite. The challenges are fun too but for god sake, the achievement completionist++ is a pain in the ass to do in conventional ways",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Balatro is a deckbuilding roguelike where you score points by playing poker hands. Each round requires a higher score to pass, but you can improve your odds by gathering jokers with special abilities, changing and upgrading the cards in your deck, and leveling up your hands.\n\nEach round basically has the same rules, although there are some minor variations depending on your deck and stake. Each deck has a bonus or variation on the regular rule set. You have to pass eight different bosses to win each deck. After each win, you unlock the next stake. There are nine different stakes, and each stake makes the game a little harder. Aside from playing regular rounds with normal decks, you can also play a number of challenge modes. Each challenge mode has a different set of starting conditions, and to pass it, you have to beat eight bosses just like in the regular mode.\n\nUnlocking all of the different cards, completing all the challenges, earning all the achievements, and winning on gold stake (the highest difficulty) at least once with every deck is very difficult. Luck will affect every round you play, and that can be frustrating, especially when a really strong run ends early after some really abysmal luck. However, there is a lot of strategy to the game as well, and you can use it to manage your luck to make your chances of winning even better. It's also a lot of fun to try to come up with unusual combinations and strategies. \n\nI really enjoyed the pixelated, psychedelic art style and the hypnotic music. It gives the perfect atmosphere for sitting down to play one round of the game and accidentally getting up five hours later. \n\nFor a game that's basically just a lot of math, Balatro is super addictive and fun. It's easy to pick up and offers a lot of challenges to keep you playing. I liked it so much I bought it a second time to play on the Switch. 10/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Balatro is an extremely solid rougelike. I like it. Number go up. But with that said why did this take the internet by storm? Don't get me wrong, it's easy to play and it's fun, but I don't get why people lost their minds over it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "you can sometimes get really unlucky which can end the run and it kinda sucks but aside from that it is a fun game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "unfortuneately , the only downside to this game is it doesnt sync with iphone progress and hours on record. \ni have roughly 500 Hrs. in this game.\n\n10/10 JUST FOR THE SOUNDTRACK ALONE.\nits intoxicating.\n\ngreat game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It arrives to a point where its impossible to win  but its really adictive, I dont think it deserved the Game Of The Year but its a really good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's the video game equivalent of sniffing a line of cocaine off a french girl's ass",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun creative card game in which you need to think and live off of luck at the same time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I liked it, but as a deck building game, I feel it lacks variety. Even with all the decks the game provides, I feel like I can always use the same strategy to win, even on the harder difficulties.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Belatro is not so much of a game as it is a life-ruining addiction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Balatro is an absolutely fantastic game and quickly became one of my go-to titles for everyday downtime.\r\nIt strikes the perfect balance between strategy and relaxation, making it ideal to play on the side whether you're at school, at work, or just looking for something to fill a few minutes throughout the day.\r\n\r\nThe gameplay is engaging without being stressful, and every run feels fresh thanks to its clever mechanics and satisfying progression. It’s easy to pick up, hard to put down, and perfect for anyone who enjoys a mix of luck, strategy, and creativity.\r\n\r\nOverall, Balatro is a brilliant, addictive experience that fits perfectly into any busy schedule. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game very fun very addicting 10/10. very accessible, started playing without even knowing how to play poker",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Balatro is really addictive, but in a good way. Be prepared for hours of fun, without having to spend one extra cent after buying the game. I'm in love!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've enjoyed the game quite a bit, it has allowed me to grind out my gambling without any real consequences yippee, yippee!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Number goes up, makes me smile.\r\n\r\nIf you like math even a little bit, this makes it fun.\r\n\r\nGo for that high score!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ruined my life over this game.\n10/10 experience, I understand why people get addicted to gambling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good, slightly addicting, a lot like cocaine. play at your own risk",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The level of depth created by the roguelike elements is crazy. I took a while to try this since I'm not a big poker fan, but it isn't actually too much like poker. Super addictive game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolutely phenomenal game. I love how gaining skill in the game is almost entirely to do with learning the mechanics unique to it, and there is very little \"gameplay\" on top. Once you learn the hands (which you may already know if you've played poker before), you're now just playing and learning Balatro. \n\nOther very good roguelikes (e.g. Hades) have plenty of things unique to them, but often are based on some other gameplay-heavy thing (e.g. isometric action fighting in the case of Hades). These are fun enough, and can certainly add to the game, but it makes the experience as a roguelike less... let's say \"pure\". Balatro is the most pure roguelike I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Deceivingly simple at first, delightfully complex later.\nAlso a perfect game to play while relaxing and watching something on the 2nd monitor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool roguelike poker ass game \nencourages you to gamble irl, i love it <3 fun to play on steamdeck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun game. Very well done. I've played and bought it on steam and the switch and every time I play it I love it! Lots of replayability!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like poker on crack, the perfect way to fuel my gambling addiction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Underrated game, not recommended for brainlets. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't use SEEDS. I don't optimize my run. I don't use Reddit to tell me the best play style, I GAMBLE, and if I can't win it big that way then I DON'T WIN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just get this game. Its worth the money. Hands down the best card game you will play. Zero deceptive poker bullshit that you're assuming this game is about. The best chill out and sip a beer game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s addictive and the game play loop has yet to ever feel boring. SO WORTH IT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unreasonably addictive. Fun to play and with unlockables that add to the game making for recursive replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The visuals make it seems like I'm actually in another world. The more I like into it the more I get this feeling of being transported in between worlds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the thrill of gambling and winning mathletes, except it only costs you 14ish euros. great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never have I played poker before and Balatro has me hooked, I totally recommend this game if you wanna gamble with no consequences and get addicted to it. I would rate it a 9/10 for the overall experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is really fun and addicting. I have lost countless hours zoned out playing run after run.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Balatro is one of those once in a generation type games. This will be a game I play for the rest of my life and for that I recommend everyone play it. It's good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is super fun and addictiong, It involevs skill and creativity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Funny number go up with poker card and funny jimbo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun roguelike game with alot of gambling and different joker combos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best indie games ive played in a while its very addictive and has unlimited challenges to try and lose over and over again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive and brain stimulating \"one more run\" game play with enough deck types, challenges, and difficulty modes to keep you entertained for a long while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First, I was clueless as how to play this game then I understood the basics. Then came the countless hours of losses and borderline going insane. I won my first game and was absolutely over the moon and now I'm addicted. Such a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "addictive gameplay and challenging",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I know it looks like it's poker. It's not poker. \n\nI can't really describe what it is other than to say that Balatro is a crazy blend of strategy, chance, jokes, jokers, and music that legitimately slaps. It is the only game I religiously recommend to every single person in the hopes that eventually I will get a friend hooked. There is truly nothing quite like the brain-brrrr of hearing the chip counter ramping up, and up and up, only to have Jimbo mock you when you fall short. Absolute masterpiece that will give you hours of gameplay and will break you in all the right ways.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good. My autism enjoys this. Much good. Much fun. I have it downloaded on mobile jut to play all the time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is very satisfying to play, even more satisfying to win! Great for unwinding and good on mobile or controller.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LET'S GO GAMBLING!\r\n\r\nIf this game had real gambling, i'd be in generational debt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is not poker, or any card game, or even a game at all.\n\nBalatro is straight up [b]NUMERICAL HYPNOTISM[/b].\n\nClick button, numbers go up, brain happy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Expectation: silly card game with funny joker\r\nReality: use pants trust me pants are broken in this game you *will* loose without pants",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun to play and if you enjoy card games like poker and stuff this game won't let you down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game removed my ability to have dopamine except when I was playing balatro. I think this game is very A S S.\n\n\n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fantastic great for long play sessions where would put something on in the back ground and chill. The music is very entrancing and the shifts of the core song throughout the game is a very nice touch and makes the game very immersive. The level of depth in gameplay is very good, the many mechanics in Balatro is what makes every run feel unique even if it's the 100'th photochad build in a row. In conclusion if you have extra time you want use for productivity this game may not be for you. (also I have put 100 hours on the playstation version of this game)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun, laid back and replayable. Anyone saying they learned poker from Balatro: No, you didn't. Hands aren't played against hands, there's no betting cycle, it's much more like yahtzee as it has the same hands (full house, straight, etc.) and individual played cards score points. \r\nBalatro is its own game. It's easy to learn and feels casual and progressive. 8 hours in at the time of this review, and I'm still unlocking things every playthrough. Balatro deserves its overwhelmingly positive status.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing. I have it on Desktop and Mobile versions, it's incredibly addictive and the challenge is well scaled.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun card game you see lot of numbers go up so its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When playing Balatro, players discover the 'Throwback' joker. There are many words that describe this little fellow, such as dashing, charming, enchanting, wonderful, beautiful, awesome, amazing, handsome, perfect, dazzling, precious, adorable, cute, pretty, spectacular, admirable, brilliant, bubbly, benevolent, auspicious, lucky, just, fair, lovable and positive. Throwback is a game-changing joker, giving .25x mult per blind skipped, giving players a unique choice. This, paired with the unique aesthetic of the card makes it not only appealing for the eyes but for the mind. This joker may become a powerful player in a game of Balatro, just like it is a beloved joker for many Balatro players everywhere. Watching a little Throwback grow into a beast of xmult is like watching  a creation come into fruition, or like discovering fire.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "extremely helped me with my gambling addiction made it better as all i do is hop that i dont get a random ass planet card i dont want",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game I like it a lot. !WARNING! The fat clown known as \"Jimbo\" will brutally roast you if you loose.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun little game. Saw this from some youtubers, would recommend, plays well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "holy peak gamble, i couldnt stop for hours. Even my eyes fell out after i played this. Gambled my whole family heritage just to buy this wonderfully crafted masterpiece and to say im unpleased is a lie,i feel like my life is  being sucked away from each joker yet something  compells me to play, this one's sanity must've already crumbled is  a understatement, got my first win today and  i  am so excited to continue playing this  peak masterpiece of a gambling game, poker is one of the best games to play to spend time, as a huge roguelike/roguelite games  fan I AM loving this one. RESPECT!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lord knows I am not this big \"RogueLike/RogueLite\" guy, but wow. This is genuinely such an addicting gameplay loop that I know full well that I will probably be playing this game every month/every few months if I ever have nothing else to do. I put about 17 hours in before unlocking the Challenge Run mode and I still feel like I'm barely scratching the surface of strategies and techs that can take this game to its fullest extent. All said and done, easily one of the greatest indie titles I've played in a long while, I can only imagine the level of fine tuning that went into making this feel as good as it does. Romaine seal of approval!\n\n(written October 2024)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This gam is one of the funnest mathematical puzzle games I've ever played. The amount of strategy and variety in what you can pull off is truly incredible. 100% recommend the experience. I will say to be careful though. I've lost soo many runs from not reading the boss blind@",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The King of roguelike deck builders, and I feel like it'll be that way for a long, long time.  Hell, writing this is pointless, you're probably too busy playing this game to read this. 10/10 Jokers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "do not get this game, you will be unable to stop playing it. you wont be gambling money but you will be losing hours upon hours of time. but goddamn number go up feels good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Balatro is such an amazing game, one that has been one of the fastest in my collection to reach 100 hours. Its gameplay, while seemingly simple, is so creative and fresh, and each game is vastly different from the last since there are so many possibilities, cards, jokers, and ways to play. As someone who sometimes finds it hard to get into new games, Balatro is one that I found easy to understand and rewarding to play, and I would highly recommend it to anyone looking for a new game to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game. Compared to other Roguelikes i've played (Nethack, Noita, and Don't Starve), it is much more luck-based, as there are no guaranteed resources. Not to say that winning is RNG though, as there's always some viable game plan in every seed, as long as you can piece it together.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is endlessly creative, scarily addictive, and definitely worth your time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an amazing game without a doubt. I have never played a card game that conveys every aspect of it's system so well. It's a masterclass in visual feedback.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute UNIT of a game. \nWanna relax play Balatro.\nWanna have the sweatiest game of your life play Balatro.\nWanna have fun with friends play Balatro.\nBalatro is so full of content I PROMISE you you will not be capable of 100% this game in less then 150hrs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely insufferable community but overall a fun and replayable game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive already loved this game from the xbox version to the mobile version, while ive only gold staked every deck (mobile ver) i havent gold stickered everything, but that (in my opinion) gives me enough experience to say, \r\n\r\nthis is the best thing ive ever had the pleasure of playing, and i will continue to play it even modded.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "seeing the cards make a perfect flush made my dopamine rush into my brain, i dont even know if dopamine works like that but it felt like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Balatro is a great game, with tons of great challenges and a fun learning curve - if you love RNG and Roguelikes, this is the game for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i started playing this game a couple months ago, and ever since then there hasn't been a day where i haven't put in under 2 hours in the game (on my phone/pc). absolutely fantastic and addictive game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Mfs when the roguelike gambling game is a roguelike gambling game:\r\n\r\nanyways stop looking at the negative reviews, the game is actually good, just buy it already",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "I don't get it. \r\n\r\nI like it when I hit high multipliers, but often times the R. N. G. will shut down your run when you least expect it. I'm actually surprised that I couldn't get into it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I love gambling and take every chance I get in any game to gamble... but this just doesn't feel like gambling oddly enough, which I thought was the entire point. \r\n\r\nThe game is slow and kinda boring ngl. Maybe it works for most people but not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Below average rogue-like luck-based slop. regret paying for it and don't recommend buying it.\r\n\r\nI get the mechanics, I get how it is meant to be played, yet I don't get how there are 10 out of 150+ jokers that actually matter and the rest are hot garbage and bloat the shop and your Econ. Balatro is Repetitive, overwhelmingly boring and frustrating, and uninteresting after a while. Sure, it has addictive qualities like all rogue-likes, but they're not even entertaining after a short while.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "MORE ADDICTING THAN COCAINE PLS DONT BUY THIS UNLESS YOU WANT 2000 HOURS ON THIS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[b]KAMGUSTA's MINI REVIEW[/b]\n\nThe card rogue-lite everyone talks about. I understand why it's so popular, as almost everybody knows how to play cards and make a \"double\", a \"three of a kind\" or a \"flush\". Runs are also quite short and the high randomness makes all of them quite different. As a roguelike and/or deck-building game, it has big flaws: you aren't in full control of your deck (uncertainty and randomness are unavoidable) and the stacking of bonuses ([b]+[/b]chip, [b]+[/b]multi, [b]x[/b]multi) should have been clearer and better balanced. You can get to the point where a single card (a \"high\") scores more than a \"royal flush\", erasing all the fun of a card game. Game also lacks meta-progression, you just unlock more bonuses to be find on your runs. Runs are too short to build your deck or create long-term strategies - you are forced to just hope for good cards and push your luck. Best strategies focus only on gaining a lot of money to be able to reroll and trying to get (pray the RNG God) that couple uber bonuses.\nFor all those reasons, it's not the masterpiece some people talks about and I only recommend it for casual players (in that case, add +2 to the score). It is what it is: a casual, short-lenght, mobile game.\n\n[b]Best played with mouse\nRecommended buy price: 5$\nScore: 5,5/10[/b]",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "bug been in game for years, sometimes you will complete a stake and it won't register as completed\r\n\r\nwhy would i invest further time in a game that won't even register achievements that takes hours upon hours to grind out and unlock",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its too rng dependent. I get RNG fucked too fucking often. Its not even that im miss playing but I just draw the WORST cards possible FOR 3 FUCKING HOURS STRAIGHT and get FUCKIGN CRAP in the store.\r\n\r\nI can take being a pad player. I cant take bad rng over and over and over",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No real way to play casually. You must be right and lucky or else your entire run is instantly over.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is good for like an hour until you realise there is no player input and runs are decided by rng before they start. Gambling is boring, actually. Some of y'all are way too proud of your gambling addictions.\nDev is based at least though, I respect this dev unlike the vampire survivors ones 🤢",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While I cannot deny that this is a phenomenal game, it's also the only roguelike I've ever played that's actively mocked me. I've had multiple runs in a row where the cards I needed to win the previous run show up in the next run... Minus a few components of my build. I cannot even begin to tell you how frustrating it is to lose because RNG decided to just make fun of you. \n\nIn conclusion: great game with a lot of fun builds! However, it will just make fun of you by denying you of that one card you need to win, and then add insult to injury by giving you that card immediately on your next run.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "too much rng, i don't like sitting for 30+ minutes to instantly die to ante 7/8\n\ni really wanna love this game but it requires too much thinking, strategizing and future prediction to be enjoyable and effortless-ish to play",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Infuriating RNG. Becomes unfun to play after a while and progress gets stuck.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The gameplay can be fun but the RNG and lack of meta progression make the experience too inconsistent for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Balatro is stupidly addictive. I cannot in good conscious suggest that more people play, and get entrapped by it's drug laced deck-building poker roguelike nature.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game genuinely sucks ass and I can't stop playing it. \r\nIf you want to challenge yourself even the slightest, then the entire game is RNG. You NEED to get a cohesive build within the first two Antes or else you're entirely screwed. \r\nIt's okay if you want to play the easiest difficulty. You could get past White Stake with the worst possible build in the world if you play the right hands.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has the depth of a puddle and is profoundly unsatisfying to play. Power based unlock systems are also a terrible way to approach player power.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too addictive, dont play it. I could have finished multiple great games in the time I've put into this one. It is a good one tho\n\nEdit: My friends forced me to add that this is a joke review and I actually like the game, I hope I didn't cause LocalThunk to lose too many sales based on this. Excited for the DLC, whenever it comes out!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly? I don't think it's that great.\n\nIt's a fun concept, but by the time you get to the 5th ante or so you have to be scoring 15k chips consistently to actually progress any further. Which is just insane and is reliant on pure luck on what sorts of jokers you picked up along the way. \n\nIt's even hard to talk about what is frustrating about this because in order to understand the criticism, you have to have played it. After 6 hours of playing, I'm not even half way to beating a single run just because of the mechanics of it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "eh. fun but would be way more interesting as a multiplayer experience for me. little reason to come back to this one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've never played poker before and now I understand why.\nMaybe I don't understand the strategy, but discarding a bunch of cards and hoping to draw face cards to win isn't fun, engaging or exciting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why do i have to launch this mini game mobile port from the file explorer? Why does this game not launch by pressing 'play' in steam? Thousands of games manage to launch when started, but alas, this one does not. Guess all the hurra reviews are from gambling addicts...\n\nDo your homework, dev(s). I'm sick of half-baked shit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Whoever came up with the idea for the Abandoned Deck is a horrible person. It’s been three weeks of me trying to get a win with this thing, and my life has been nothing but misery. I swear I graduated college, got married, and started a family all before I managed to beat this deck. Do not buy this game for the sake of your own sanity. The Abandoned Deck is always watching.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Here's something the devs can do to turn this into an actual game:\n- introduce a proper power fantasy like \"my brother shat* himself after financial ruin caused by gambling so I'm going to become the best gambler in the world, infiltrate the casino, and once I'm at the golden table with the casino owner, I punch them in the face\", instead of \"I'm a degenerate gambler and I want to play a cute version of poker\" ...because fuck gambling.\n- meta progression much?\n- Hey, RNGeezus, take it easy, OK? And make it more fun to reach the goals set out by my suggested power fantasy\n- where is the skill? Is it \"where\" you put your joker in the top slots? Is it \"which\" vouchers your buy? RNGeezus says no.\n\nI dunno, man, there's just no \"game\" here. BAFTA awards are supposed to go to works of art. Maybe Solitaire can win next year.\n\nThis is the equivalent of sports betting and online casino companies calling themselves \"gaming\". No, it's not a fucking game. It's gambling, pure and simple.\n\n*shat = offed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This isn't as much a game as it is a time sink. It's ok, but I wouldn't say it was fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Black Screen Bug is hindering this game. Very sad that there absolutely no permanent fix!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "right listen up ye the fuckin game is ahh ye cos like ye i tried gamble n it didnt work gm ye",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you are going to do any schedule based activities that require most of your day, DONT i repeat DONT BUY THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know what 81 * 4 is now (great game for those looking in the dislikes)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mindnumbingly boring rougelike trash. How does this have 97% positive reviews?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gets boring really quickly",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just not that interesting or fun",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "no tutorial button",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I HATE YOU JIMBO YOU KILLED MY FAMILY",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not fun, even when you're doing well",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was expecting more from the hype.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "beat the game in 2.1 hour. too easy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "misprint fucking sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ">looks inside\n>wheel of fortune\n>\"Nope!\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dear god get this thing away from me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What the fuck do i do",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was to easy to beat",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Clown keeps laughing at me :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "load error 126?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The plant.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just terrible",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "kinda mid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]TLDR but longer down vote explanation at the bottom[/h1]\nCrack rock gaming at its finest, with endless gameplay. Basically Poker/deck builder meets Vampire Survivors is the best way I can describe it. It sounds weird but hear me the fuck out. You first start the game with a regular poker hand, each round allows only so many played hands and redraws, if you dont beat the targeted score before your hand runs out you lose. The “rouge lite” here is when you beat a round, you get money that you can spend on packs that can boost your cards or overall deck, and jokers which can modify/boost your entire build. The different type of builds you can set up each game is ridiculous and never gets old, as each run youre learning something new. Examples of builds are like a flush build, full house, 2 pair (typical poker), you try and build your entire deck so that you can support and boost these builds to be as powerful and dish out as much points as possible.\n\nThere are 8 antes to beat (endless after you beat it). Each ante has 3 rounds with the 3rd one being a boss with a random modifier, such as “all face cards are disabled”. The higher you go up in rounds and antes the harder the game becomes bc the points to beat keeps increasing.....\n\n[h1]Explanation[/h1]\nNot gonna lie, Ive been sitting on the positive review above for awhile with plans to finish it later....just gonna stop here. This down vote hits me harder than an abusive stepdad. Had a hard crash in the game 120 hours in that completely wiped all my progress with no way of getting it all back. From what ive read this is something super rare, but has been going on since day 1. The game is fucking stupid addictive. It's like any other rouge lite, the more you play the more you build, the better your outcomes as you get better at the game. I still have all my jokers Ive unlocked, but that's it, all stats and progress, gone. I simply cant recommend it after this shit happening to me after 120 hours of gameplay. The feeling is defeating. Ill still go back and play it later but this instance will always be in the back of my mind that as I progress my shit can crash and wipe. Consistently going and creating a back up aint it. Odds are youre probably not going to experience this. Like I said, super rare occurrence it seems, but the shit did happened to me and 120 hours are down the drain. I fell victim and if it weren't for that I would highly recommend this game.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Mfs when the roguelike gambling game is a roguelike gambling game:\r\n\r\nanyways stop looking at the negative reviews, the game is actually good, just buy it already",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "I don't get it. \r\n\r\nI like it when I hit high multipliers, but often times the R. N. G. will shut down your run when you least expect it. I'm actually surprised that I couldn't get into it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I love gambling and take every chance I get in any game to gamble... but this just doesn't feel like gambling oddly enough, which I thought was the entire point. \r\n\r\nThe game is slow and kinda boring ngl. Maybe it works for most people but not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Below average rogue-like luck-based slop. regret paying for it and don't recommend buying it.\r\n\r\nI get the mechanics, I get how it is meant to be played, yet I don't get how there are 10 out of 150+ jokers that actually matter and the rest are hot garbage and bloat the shop and your Econ. Balatro is Repetitive, overwhelmingly boring and frustrating, and uninteresting after a while. Sure, it has addictive qualities like all rogue-likes, but they're not even entertaining after a short while.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "MORE ADDICTING THAN COCAINE PLS DONT BUY THIS UNLESS YOU WANT 2000 HOURS ON THIS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[b]KAMGUSTA's MINI REVIEW[/b]\n\nThe card rogue-lite everyone talks about. I understand why it's so popular, as almost everybody knows how to play cards and make a \"double\", a \"three of a kind\" or a \"flush\". Runs are also quite short and the high randomness makes all of them quite different. As a roguelike and/or deck-building game, it has big flaws: you aren't in full control of your deck (uncertainty and randomness are unavoidable) and the stacking of bonuses ([b]+[/b]chip, [b]+[/b]multi, [b]x[/b]multi) should have been clearer and better balanced. You can get to the point where a single card (a \"high\") scores more than a \"royal flush\", erasing all the fun of a card game. Game also lacks meta-progression, you just unlock more bonuses to be find on your runs. Runs are too short to build your deck or create long-term strategies - you are forced to just hope for good cards and push your luck. Best strategies focus only on gaining a lot of money to be able to reroll and trying to get (pray the RNG God) that couple uber bonuses.\nFor all those reasons, it's not the masterpiece some people talks about and I only recommend it for casual players (in that case, add +2 to the score). It is what it is: a casual, short-lenght, mobile game.\n\n[b]Best played with mouse\nRecommended buy price: 5$\nScore: 5,5/10[/b]",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "bug been in game for years, sometimes you will complete a stake and it won't register as completed\r\n\r\nwhy would i invest further time in a game that won't even register achievements that takes hours upon hours to grind out and unlock",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its too rng dependent. I get RNG fucked too fucking often. Its not even that im miss playing but I just draw the WORST cards possible FOR 3 FUCKING HOURS STRAIGHT and get FUCKIGN CRAP in the store.\r\n\r\nI can take being a pad player. I cant take bad rng over and over and over",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No real way to play casually. You must be right and lucky or else your entire run is instantly over.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is good for like an hour until you realise there is no player input and runs are decided by rng before they start. Gambling is boring, actually. Some of y'all are way too proud of your gambling addictions.\nDev is based at least though, I respect this dev unlike the vampire survivors ones 🤢",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While I cannot deny that this is a phenomenal game, it's also the only roguelike I've ever played that's actively mocked me. I've had multiple runs in a row where the cards I needed to win the previous run show up in the next run... Minus a few components of my build. I cannot even begin to tell you how frustrating it is to lose because RNG decided to just make fun of you. \n\nIn conclusion: great game with a lot of fun builds! However, it will just make fun of you by denying you of that one card you need to win, and then add insult to injury by giving you that card immediately on your next run.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "too much rng, i don't like sitting for 30+ minutes to instantly die to ante 7/8\n\ni really wanna love this game but it requires too much thinking, strategizing and future prediction to be enjoyable and effortless-ish to play",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Infuriating RNG. Becomes unfun to play after a while and progress gets stuck.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The gameplay can be fun but the RNG and lack of meta progression make the experience too inconsistent for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Balatro is stupidly addictive. I cannot in good conscious suggest that more people play, and get entrapped by it's drug laced deck-building poker roguelike nature.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game genuinely sucks ass and I can't stop playing it. \r\nIf you want to challenge yourself even the slightest, then the entire game is RNG. You NEED to get a cohesive build within the first two Antes or else you're entirely screwed. \r\nIt's okay if you want to play the easiest difficulty. You could get past White Stake with the worst possible build in the world if you play the right hands.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has the depth of a puddle and is profoundly unsatisfying to play. Power based unlock systems are also a terrible way to approach player power.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too addictive, dont play it. I could have finished multiple great games in the time I've put into this one. It is a good one tho\n\nEdit: My friends forced me to add that this is a joke review and I actually like the game, I hope I didn't cause LocalThunk to lose too many sales based on this. Excited for the DLC, whenever it comes out!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly? I don't think it's that great.\n\nIt's a fun concept, but by the time you get to the 5th ante or so you have to be scoring 15k chips consistently to actually progress any further. Which is just insane and is reliant on pure luck on what sorts of jokers you picked up along the way. \n\nIt's even hard to talk about what is frustrating about this because in order to understand the criticism, you have to have played it. After 6 hours of playing, I'm not even half way to beating a single run just because of the mechanics of it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "eh. fun but would be way more interesting as a multiplayer experience for me. little reason to come back to this one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've never played poker before and now I understand why.\nMaybe I don't understand the strategy, but discarding a bunch of cards and hoping to draw face cards to win isn't fun, engaging or exciting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why do i have to launch this mini game mobile port from the file explorer? Why does this game not launch by pressing 'play' in steam? Thousands of games manage to launch when started, but alas, this one does not. Guess all the hurra reviews are from gambling addicts...\n\nDo your homework, dev(s). I'm sick of half-baked shit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Whoever came up with the idea for the Abandoned Deck is a horrible person. It’s been three weeks of me trying to get a win with this thing, and my life has been nothing but misery. I swear I graduated college, got married, and started a family all before I managed to beat this deck. Do not buy this game for the sake of your own sanity. The Abandoned Deck is always watching.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Here's something the devs can do to turn this into an actual game:\n- introduce a proper power fantasy like \"my brother shat* himself after financial ruin caused by gambling so I'm going to become the best gambler in the world, infiltrate the casino, and once I'm at the golden table with the casino owner, I punch them in the face\", instead of \"I'm a degenerate gambler and I want to play a cute version of poker\" ...because fuck gambling.\n- meta progression much?\n- Hey, RNGeezus, take it easy, OK? And make it more fun to reach the goals set out by my suggested power fantasy\n- where is the skill? Is it \"where\" you put your joker in the top slots? Is it \"which\" vouchers your buy? RNGeezus says no.\n\nI dunno, man, there's just no \"game\" here. BAFTA awards are supposed to go to works of art. Maybe Solitaire can win next year.\n\nThis is the equivalent of sports betting and online casino companies calling themselves \"gaming\". No, it's not a fucking game. It's gambling, pure and simple.\n\n*shat = offed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This isn't as much a game as it is a time sink. It's ok, but I wouldn't say it was fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Black Screen Bug is hindering this game. Very sad that there absolutely no permanent fix!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "right listen up ye the fuckin game is ahh ye cos like ye i tried gamble n it didnt work gm ye",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you are going to do any schedule based activities that require most of your day, DONT i repeat DONT BUY THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know what 81 * 4 is now (great game for those looking in the dislikes)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mindnumbingly boring rougelike trash. How does this have 97% positive reviews?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gets boring really quickly",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just not that interesting or fun",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "no tutorial button",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I HATE YOU JIMBO YOU KILLED MY FAMILY",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not fun, even when you're doing well",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was expecting more from the hype.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "beat the game in 2.1 hour. too easy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "misprint fucking sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ">looks inside\n>wheel of fortune\n>\"Nope!\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dear god get this thing away from me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why is anyone looking in the negative reviews?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What the fuck do i do",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was to easy to beat",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Clown keeps laughing at me :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "load error 126?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The plant.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just terrible",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "kinda mid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}