{
  "positive": [
    {
      "review": "I've played every Dynasty Warriors since DW6 (including Empires and the spin-offs like Samurai Warriors 2 - 4 and Warriors Orochi), and I genuinely believe this is the single best game in the franchise so far. This is the very best the series has ever felt mechanically, and I look forwards to DW10 and any continuation of this game.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "As someone who’s been riding with the Dynasty Warriors franchise since DW2, I’ve seen it all—the highs, the lows, the spin-offs, and the experiments. I’ve owned nearly every title in the series, and I can confidently say that Dynasty Warriors: Origins is a massive step in the right direction.\r\nFrom the moment I picked up the controller, I felt something different. The immersion is on another level—whether it’s the cinematic presentation, the dynamic battlefield flow, or the way the game pulls you into the chaos of the Three Kingdoms era. For the first time in years, I felt like I was truly in the battle, not just playing it.\r\nThe combat feels tighter and more responsive, with just the right balance between classic Musou mayhem and modern action sensibilities. The scale of the battles is impressive, and the new mechanics add depth without overcomplicating the core fun. It’s clear the devs listened to longtime fans while also pushing the series forward.\r\nIf you’ve ever loved a Dynasty Warriors game—or even if you drifted away after the earlier entries—Origins is the one to come back for. It’s not just nostalgia; it’s evolution.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "I've played DW3 - 5 in the past and then played this. I also just started DW8 after this and I can say the mechanics in this game is a huge upgrade. I'm hoping for a new future title in this direction with co-op campaign.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "What a great return of the Dynasty Warriors series! Love the more detailed storytelling and the combat is evolved a lot to stlll have the satisfaction of wiping the battlefield while also having the challenge of battling the strong generals. The scale of battle is also a lot bigger in this entry. Love the game a lot and looking forward to the DLC and future entries!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is how I imagined gameplay felt like when playing Dynasty Warriors as a kid. Its a mix of nostalgia and just pure fun. Combat is fresh yet familiar, in battle events like charging are just fun, story is in depth, weapons are vastly different and offer a variety of combat styles, and the way new mechanics are introduced is paced well. \r\n\r\nNot a perfect game, but an excellent Dynasty Warriors game. I hope we can get the same type of treatment for the Samurai Warriors series.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Purely gameplay wise, this is easily the best musou game I've played. This is a better attempt to refresh this genre than dw6 dw9 and sw5.\nThat said, it is nowhere near flawless. Many weapons really need to be improved and more new weapons to be introduced.\nStory wise, the presentation was cool at times but the less said about the story the better. \nMaps are amazingly done.\nMusics are still bangers.\nNot playing as one of the officers doesn't do my head in as much as it did other people but I'd rather play my own OC. No character creation hurts even when there's a reason for that.\nOptimization wise, no complaints from me. Ran perfectly fine.\nAll in all, must try if you enjoy DW.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Delighted to witness my very childhood series rise up from the grave, shining brighter than suns and stars themselves.\n\nA very good opportunity for newer and returning players to experience the rich story of the three kingdom once again.\n\nI pray that we see more out of this series, like how water never stops as it flows through the rivers endlessly.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Better then dynasty warriors 9 but that not high bar. I did like map of the 3 kingdom you get ride around on the campaign map in this game. It was nice how changed some earlier battle in old game into phases like yellow T and hulo gate but i do think that some early  could been cut to add more later story if they didn't add because it be to long. English Voice actor are better this time to. i like how train with weapon get get better at it but i did not like how few weapons there were. \n\nThe biggest disappointment to me is[spoiler] wei and cao cao is only 1 who really get true victory shu and lei bei victory after chibi is make the 3 kingdoms which right where story start get good for him and wu and sun clan get hold of emperor and make 2 or 3 way spilt don't really say[/spoiler]. If add dlc for this really hope and more story or something because end for shu before anything other good officers join i mean 4 officer for shu come on.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Reviewing for the Steam Awards but this game is unironically great. Base price is a bit high but absolutely worth it on a discount.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A wonderful update to DW and a fresh new take on the formula. My only gripe with this game is I want more content. It already has plenty of content but as a lifelong musou fan I am missing certain characters, such as Lu Xun and the Qiaos, and I also don't understand where the Zhou Yu / Sun Ce sex scene is in this game. Maybe I haven't unlocked it yet? I have also heard that there are other playable routes apart from Wu but that's just fake news spread by Liu Bei I'm quite sure. 10/10 game, would call Sun Jian \"daddy\" unironically",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great comeback for the Dynasty warriors series. A great story that describes it in great detail. mechanics feel very nice and smooth, & as a fan that's played since DW3 i am excited for this large scale DLC.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A bit of a different take on the Dynasty Warriors series, and it does its job pretty damn good. Soundtrack goes hard, story is refreshing and new (a bit weird with the non-canon character), but the most well done thing is the combat system, man, fighting enemy officiers is actually a lot of fun. \nNow the only thing we need is a free mode where we can play as any character and this game would be a really strong title in the Dynasty Warriors series.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Repetitive gameplay carried by the addictive combat and over the top presentation. Combat mechanic is simple but serviceable. Lots of missions but they all plays the same. Variety of weapon selection with their own unique mechanic but limited to surface-level combo.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have been a fan of dynasty warriors since I grew up playing 4 and have fond memories. My last entry was 8 Xtreme Legends which I loved dearly but can no longer play since I don't have a PS4 anymore. This entry has scratched my itch for warriors and increased my love for it even further. It is fantastic and I have thoroughly enjoyed it as I did as a child. It is not perfect, the cut scenes are cringey and so are some of the voice actors, but the story overall and the way it is portrayed is some of the best the warriors franchise has ever seen. Love this game and it is worth the price on sale or not.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A little different from the originals, but once you get into the weapons and new combat mechanics the game is amazing!\r\n\r\nIf you're and old school fan or new to the series, this is a great game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is a non-stop fun with a refined, engaging combat system. The colossal scale of the battles, featuring hundred of enemies, makes for an incredibly satisfying and epic gameplay experience",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, the gameplay is vastly improved and it's a really fun game but I think the story is very weak when compared to previous entries like Dynasty Warriors 7 which had the best story out of all of them.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i love this game, story, the cut scene the intro and the fighting style. 100/100",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Highly recommend this game to any fan of the Three Kingdoms history, or if you like fighting-action with vast battlefields.\nHowever, I'm a little(hugely) upset that main character becomes \"invisible\" after choosing to join one of the three main forces. I get the point of keeping the original story untouched and true, but it removes the purpose of your efforts you put into bonds, fightings, choices, observing the impact of your actions in general. For an instance, no one mentions anything like \"second best warriors under the heaven\" after defeating Lu Bu more than once, which is no small feat- it's only mentioned as an unhinged praise by some of the characters during the actual battle and never ever after. I'm a very huge fan of the original story, but I would sell my soul to be able to witness the impact of my actions in the GAME if I get to play no one but some fictional never-existed character who needs to make choices. \nThe game itself is incredible and would attract lots, but it misses the point of main character and simply makes you \"a reader\", but not \"participant\"- where in first, you are EXCLUDED from the story. Y'all be prepared to be ghosted in the story because you are insignificant. 8/10 in general\nbut 6/10 for being ghosted if you are a fan of this game series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the greatest game play . So much fun battling wave after wave  of people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you played the original Dynasty Warriors (ignoring 9), this game absolutely revitalizes the franchise. The devs finally took a more quality over quantity approach to their newest entry and it's absolutely incredible to have these one on one duels that actually feel like duels. You can't just spam X to win anymore, you have to actively dodge, block, and adapt to the situations your character finds themselves in to survive. Whether they do the sequel route or a ton of dlcs like the Sims, I hope more of the characters like Yueying and Gan Ning appear. That's my only complaint honestly, just wishing for more characters from their previous games. Otherwise if you only care for gameplay, this game is amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The battles here are exactly how you saw them as a kid, the worst problem this game has is your officers require constant attention you can't leave them alone for more than 2 minutes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]A return to form with a new approach.[/h1]\nAfter Koei-Tecmo released Dynasty Warriors 9, it was received with most mixed reactions - due to bold, new game mechanics like all gameplay taking place in an open-world. The results felt lackluster when I tried the game, but I understood that this is a unique concept that is hard polish on the first outing. Questions rose whether KT would learn from the gameplay shortcomings and focus on their old winning formula, or take risks on incorporating the game's bold mechanics for either an improvement or a slippery slope of delusion.\n\n4 years later after DW9: Empires came out, mainline Dynasty Warriors returns to the old formula but approaches on several new directions with Origin. While previous titles have gone bigger by the numbers and quality, Origin repacks the Dynasty Warriors to a relatively smaller scale, with a shorter but more condensed timeline. You primarily play as a fictional, silent protagonist - The Guardian of Peace - who carves his path in within China's long turmoil that marked the final period of the Han dynasty, while searching for the truth about his own past, the origin of course.\n\nAs I mentioned how condensed the timeline was presented in the game, it's worth mentioning that telling deep stories aren't something the Dynasty Warriors games have strived to pursue. Yet in Origin, the KT crew has invested more in the writing and fleshing out all the key characters involved. Some familiar characters even get overhauled in their looks and personalities, as if their exaggerated antics have been toned down to varying degrees - some have their quirks, but act more natural in their consistency. Much is brought out of them when you talk to grow the relationships. And as a long-time DW fan, I get the impression that some of them were written to be grounded and talk to me like I've been around them for a long time (as an observing fan). Also, be ready to be flattered (or weirded out) momentarily, because some characters that warm to you can give suggestive nods at most.\n\nBetween missions and interactions, I get the freedom of walking the 3D map to determine my next plan, including visiting both shops and inns in a city. The map does an excellent job depicting China's geography, helping me get better familiar with the country and the provinces dividing it.\n\nThe battle stages have got quite a facelift, with the fields looking expansive and rendering hordes of army soldiers into view from vantage points. I love the immersion, for what the game is about, and powerful attacks I get to unleash is unyieldingly satisfying. While playing as other officers is limited only through their companion roles, you get a window to be in their shoes briefly and go crazy with their powerful moves.\n\nDynasty Warriors: Origins marks a promising comeback through a familiar concept, with some major twists to refresh its running formula. The storytelling is quite strong by DW standards, the world building has a pretty overhaul, and the battles are kept engaging through both their tactical elements and the signature fight spectacle. \n\nIf you're going to binge-play through Origin, be mindful that the story scenes weigh more than previous titles and it may feel like it disrupts the flow between story and action. I would recommend to play the game in max 2 hour chunks and come back later with a fresh mind. All in all, I really like the direction KT was going with this and I look forward to play the next major DLC that expands the story choices.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Long time DW fan, DW3 is my jam. I stuck my nose up at this game for the longest time because of how much of a departure it was from previous titles and I regret waiting so long to get into it.\n\nI tried the demo and was immediately overwhelmed. They definitely throw too many mechanics at you off the bat. I still felt there was a fun game to be played, and got it. The normal game paces out everything much neater and makes sure you don't get left behind.\n\nThe gameplay is polished and smooth. Landing parries feels great each time, and there is a good bit of nuance to the gameplay over the button mashing the series has become known for. The soundtrack is great, though could use a bit more variety in the filler stages. I thought playing as just Ziluan would bug me, but he kind of grew on me so I don't even mind that.\n\nI am a huge fan of the direction they took this one overall, can't wait for the dlc coming out in January.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a fan of Dynasty Warriors franchise, this game brough back the intense and slow-pace fighting, which made this franchise special in my heart, while also innovating the gameplay and truly bringing battlefield experience come to life. \nTry this game and trust me you gonna like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Origins is the best Dynasty Warriors game released in years",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A new different combat mechanic which makes this one of best of Dynasty Warriors series. At least, it brings back to proper hack and slash game after previous open world version made. Very happily looking further for the incoming DLC boosts the game great again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is insane how far this game has come.\r\nThe gameplay is great i wish the overmap view had more immersion with the structures instead of a giant running over the map, but it made me laugh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of, If not the best Dynasty warrriors games of all time. It ranks up there with 5, warriors orochi 1-3 and above 8 IMO. Great game, and I can't wait for the DLC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A breath of fresh air to the Dynasty Warriors Franchise. The combat here is fantastic, and the flow of battles is epic and grand. I completed the hell out of this game with extreme pleasure, and am eagerly waiting for the DLC to drop so I can continue to play the crap out of this game. Extremely fun and highly recommended, especially for Dynasty Warriors fans. Even if you're not, I still recommend it. Pick up the demo if you are unsure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Massive improvement for the franchise as a whole. hoping to see a samurai warriors done just like this in the coming years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game and almost have all base game achievements. Would recommend for anyone that wants to play in battles and also have a boss style fight... Lu Bu isn't the greatest warrior tho, it's clearly Guan Yu... just saying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pure gameplay and vibe wise its insane. feels like an actual next gen game. dozens of enemies on screen, all the while having 100+ fps in 1440p on my pc, no framegen (for comparison, i have trouble hitting 60fps in mhwilds). the spectacle is awesome. and combat is awesome too. fights with officers feel the most engaging they have ever been. parrying is great. weapon movesets highly reworked. its very engaging. \"strategy\" wise its great too, the way the game presents u information and how army mechanics work make u feel like u have a clear and understandable impact on the whole battle. easy to see hp of all ur officers and helping them is intuitive. the game demands a brain. decisions feel more impactful than dw7-8. maybe 4/5 too cuz these were edging towards the easier side of things too (not sure tho).\n\nthe game focuses on one playable character, which is a departure for the series but the weapon movesets seem so good that they sorta make up for it, for me.  but yea thats a thing. its a different game content wise. but at the same time, it feels like a natural and amazing evolution with its large scale battles and combat. the story is pretty damn engaging and kinda coolest in the whole series to me.\n\nthis game is such a big step up, im awestruck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it so far, its different enough to be entertaining. The overworld map is a little annoying but they at least tried something.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the most fun Dynasty Warriors games I have ever played. The combat is so smooth, while retaining the familiar feeling that Dynasty Warriors is known for. While I do think the main protagonist is rather generic and silent. I think the benefits of being able to lock down such a smooth combat system is a fair trade off for this game specifically. Hoping future titles bring more characters for us to play as.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the game and everything and how the new combat look but my only down side is the horse combat still the same its simple ugly and hard to watch i realy hope for the next game to have horse combat and thx for this great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After the abysmal game called Dynasty Warriors 9, I thought Koei-Tecmo / W-Omega Force was unredeemable but they blew me away with this game, 10/10 add more to this game with expansions that is free content and you'll have a masterpiece of your hands!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoying this game. The story is different this time out with a central protagonist weaving through the normal storyline. It works surprisingly well. Certainly different than past games.\n\nBonus points, it runs pretty well on my steam deck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is unlike any other Dynasty warriors I've played. Definitely a good way to reboot the franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a nice twist to the original DW game, very fun and good concepts. Enjoy it and looking forward to more development",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my top 3 favourite Warriors games. Great blend of musou gameplay and RPG elements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This still feels like a 60$ game, not a an 80$ one.\nThere's not much of a reason to give this a propper review, but I will say is the general gameplay is the same, while virtually all the details have been reworked in some way, most in positive direction.\n\nThe refined combat and a new format gives this game more of a reason to be sold at a premium price than the stale comfort slop they've been releasing that hasn't changed in almost 20 years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dynasty Warriors: Origins in the latest entry to the long-running Dynasty Warriors series. While the series has experiences its up and downs, I am glad their experimentation has turned out to be a great success for this title.\n\nSetting: Like the previous entries, you are going to be reliving a lot of battles that happened in late second to early third century AD of China, in which you get to live out your power fantasy of becoming a one-man-army. However, the focus of this game is not on the various historical figures of this era, but an original character. This has caused quite a discussion among the playerbase, as many liked this game for the opportunities to play as those historical figures, and relive their moments.\nI personally don't mind as much, since this is not billed as a mainline entry, and I am a huge sucker for the wandering swordsman type. The idea of me mingling with those historical figures, and fighting alongside them is enough to compensate any feeling of loss of actually playing as those characters. 8/10\n\nGameplay: The game does not deviate much from its formula, it just introduced some new mechanics for the players. Aside from blocking enemy attacks, the player can now evade those attacks, and gain resources that lets you use skills. Skills are either locked to a certain weapon, or can be used regardless of your weapon of choice. Skills are all well-designed, with a nice blend of flair and practicality. Your character is also given a small squad of soldiers to command, and you can issue various order to them to influence the flow of the battle. Combat flows well, and consatnt changing tide of battle keeps you on your toes. I think the gameplay has a good balance of modern addition without losing its own character. 9/10\n\nVisual: This is definitely the prettiest Dynasty Warriors game to date. Character models are visually appealing, texture works are reasonably detailed, and the special effects grabs your attenion without being overwhelming. being able to see hundres of units on the screen at once, and how you, or other powerful officers, send hundreds of them flying across the screen is a very satifying feeling. 10/10.\n\nOverall: If you love Dynasty Warriors, this is a great buy. If you have never played, and want a starting point, this is also a great buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what a change up for the DW series. i mean they pretty much nailed it. Now its not perfect, you can only really play the nameless protagonist and for a short burst you can play a classic character (Zhou Yun, Guan Yu ect.) and i think it a bit disappointing, I get that for the story but once you beat the game once you should be able to play any stage as a classic character. Also the reduction for the character list is understandable (in my opinion) as the character roster was big in the last few games which is good and bad (Good for variety of choice but bad for bloat) but how much they reduced it too was a little excessive. anyways the rest of the game is awesome and fun as hell, and the DLC looks \"chefs kiss\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DYNASTY WARRIORS is so back\nGameplay 10/10, OST 10/10, Story 10/10. (Additional content and the grind is kinda meh)\nSuch a great way to start in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the peak of this long series, gameplay is better than ever and is accompanied by an as always phenomenal soundtrack. The only thing I dont care for is the lack of player customization.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay and story make this one of the best Dynasty Warriors game to date.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What's to say; Its more Dynasty Warriors. The greatest thing it has going for it is the large scale battles if they do not bug out. It has an overworld where you can choose what battles/ story you wish to continue.  Single player becomes routine after a few hours of play so a multiplayer mode would do a lot in prolonging the life of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dynasty Warriors Origins – A Classic Fan’s Honest (and Slightly Nostalgic) Review ⚔️😄\r\n\r\nMy Dynasty Warriors journey began back on the PS2 with Dynasty Warriors 5, the game I played more than anything else in my childhood. I didn’t even have a memory card, so every time I wanted to play, I had to start from the beginning… again… and again… and again. At this point, I’m convinced DW5 secretly trained my patience more than school ever did 😂.\r\n\r\nToday, I still replay DW5 through an emulator because the nostalgia hits hard — and yes, saving my progress now feels like luxury.\r\n\r\nOn PSP, I played Dynasty Warriors Vol. 2, which I enjoyed for its branching routes and the fun bodyguard system. Depending on your decisions, you’d unlock different maps and paths. Simple, old-school, charming — and still holding the DW5 spirit. The grid-style movement felt like “Musou Chess,” and honestly, I kinda loved it.\r\n\r\n⸻\r\n\r\nWhy I Didn’t Touch DW7, DW8, DW9 (And Never Will) 😬\r\n\r\nI never actually played DW7, 8, or 9 — I only watched the gameplay.\r\nAnd that was enough.\r\nToo many characters, too much flashy superpower anime-style nonsense, and gameplay that lost the grounded, human-vs-army feeling I grew up loving.\r\n\r\nAnd DW9… oh boy.\r\nJust watching it felt like torture.\r\nEmpty open world. Slow pacing. Boring fights.\r\nIt didn’t just drift away from the series — it disappeared into another dimension.\r\n\r\nIf someone gave me DW9 for free, I wouldn’t just uninstall it…\r\nI’d launch it once, close it immediately, and delete it like an embarrassing browser history.\r\nTrash-tier for me 💀.\r\n\r\n⸻\r\n\r\nWhy I Chose Dynasty Warriors Origins 🐉\r\n\r\nOrigins caught my attention because it feels like the franchise remembering its roots again.\r\nThe combat is grounded.\r\nThe skills aren’t too fancy.\r\nThe feeling is closer to the classic DW I love.\r\n\r\nYou don’t need to play 100 characters — instead, you explore multiple endings. Some players might find the repetition boring, but for me it’s fine. It gives me that old-school drive to grind for all routes.\r\n\r\nThe map is big, and some areas (like Liang Province) clearly look like “DLC homes waiting to be filled.”\r\nAnd honestly…\r\n\r\n👉 Dear developers, please fill them. Please. I beg you. 🙏\r\n\r\n⸻\r\n\r\nWhat Needs Improvement (My Honest Wishlist) 📜\r\n\r\nEven though I enjoy Origins a lot, I won’t lie — there are things that need some love:\r\n\t•\tGrinding becomes repetitive because objectives are too similar.\r\n\t•\tGameplay loops need more variety so players don’t fall asleep grinding.\r\n\t•\tMore stories and POV routes would make the game feel alive longer.\r\n\t•\tMore clothing/costumes that match factions or groups would be amazing.\r\n\t•\tSome areas on the map feel unfinished — add more content and events there!\r\n\r\n⸻\r\n\r\nPlease Don’t Let This Game Die 😭🔥\r\n\r\nThis part is important.\r\n\r\nDon’t let this game go dead after players finish all endings.\r\nThere’s so much potential here — please keep expanding it with DLC, new stories, new POV routes, unique missions, and extra challenges.\r\n\r\nNot the old “play X character route” style…\r\nbut the new, narrative-focused style that DW Origins already does well.\r\n\r\nI genuinely believe this game can grow into something much bigger.\r\n\r\n⸻\r\n\r\nMy Progress (and a Little Flex 😏)\r\n\r\nAnd uh, don’t mind my played hours.\r\nI’ve played this before on my cousin’s account (I was basically a “guest account speedrunner” 😂).\r\nBut I already completed one ending — Liu Bei’s TRUE ending — before buying it on my own account.\r\n\r\nNow I’m here to collect EVERY ending\r\nAND TO GET LÜ BU’S HORSE\r\n😤🔥🐎 YOU KNOW WHY I’M HERE.\r\n\r\n⸻\r\n\r\nFinal Thoughts\r\n\r\nDynasty Warriors Origins brings back a feeling I thought the series had lost forever.\r\nEven with its flaws — the repetitive grinding, the limited objective types, and the unfinished-feeling areas — the game still delivers something special.\r\n\r\nFor fans of the classic style, especially those who grew up with DW5, this is the closest the series has been to its golden age in years.\r\n\r\n⭐ Rating: 8/10 — Fun, nostalgic, and promising. With more updates, it can become legendary.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lot of fun, and a nice take on DW games. I know it would've been harder, but I do miss multiplayer. So many good memeories playing with friends on DW games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the story and gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ran perfectly, gameplay was fun, story was good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "solid game with weird date them all simulator side quests",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly? I was positively surprised. I've been a fan of the Dynasty Warriors franchise ever since it hit PC with Dynasty Warriors 4 Hyper. This might actually be the best of the series, and if not, it's a close second to 8, probably.\r\n\r\nDo I miss being able to play the huge cast of characters and their personal stories? Yes, the stories more than playing the characters. Most characters are still there and pretty well done.\r\nIs there something to be said about which period this game depicts, with it ending basically half-way through the story most DW games depict? Yes, it feels like it ends half-way through, in a way.\r\n\r\nBut the \"neutral\" player character is very well realized, it does provide opportunity for the companion characters to be immediately powerful allies - unlike in most older games where even Guan Yu starts as a pretty normal fighter. There's also a fun little reveal at the end that is worth looking up.\r\n\r\nPlus, while the amount of weapons is somewhat limited - there's still almost a dozen weapons, mind you - they actually FEEL DIFFERENT. It's so refreshing.\r\n\r\nBut it's still Dynasty Warriors, it looks amazing, the large scale fights are absolutely amazing, the story is super well realized, and I like the way the story mode and progression systems work. Really happy with this one, and just writing this makes me want to play again. There's still some stuff to do before the DLC hits in January.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great game wish i bought it sooner. the yoai bait is cool to for the people that love that stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely this is one of the better games of the Dynasty Warriors series. Unlike Dynasty Warriors 9 (which we all expected it to spiral down even worse but thankfully mistaken), Dynasty Warriors Origin provides a slightly similar storytelling towards Dynasty Warriors 8 Xtreme Legends, opening hypothetical and historic routes for player to explore. \n\nVisual is not too bright (Dynasty Warriors 9 cough cough) but I suppose that is why I like the game however it is. Music I can tell its theme and medley, and where they took inspiration from so that is also well thought off.\n\nCombo is a bit hard to adapt if you started from Dynasty Warriors 8 but it is still fine. You'll start to adapt eventually especially with its timing attacks.\n\nPlus, from the upcoming DLC, it can be noted that additional pathways are also going to be added such as for the very expected Lu Bu path and the underrated Zhang Jiao path. This is probably the many main highlights of my comment given that I am a Dynasty Warriors 8 XL junkie. Finally I get to play as Chen Gong for trolls again (even if the weapon is not a scroll lol).\n\nHopefully, the developers do not make the branched path like Zhang Jiao, Dong Zhuo and Yuan Shao path to be 3-battles or less-kind of thing. If anything, I am hoping if the main character do die regardless, the successors have separate paths(Yuan Shao children story path; Li Jue/Guo Si story path from Dong Zhuo; or Lu Bu + Lu Lingqi story path).\n\nI understand some characters like Huang Zhong, Ma Chao, Sima Yi, and Zhu Ran are not available since they appear after the battle of Chibi and during the Subjugation of Guan Yu so I do not expect them to appear anytime soon. But it would be a bonus if they do somehow return.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely a top contender for BEST Dynasty Warriors game!\r\n\r\nAlso the Lu Bu fight SLAPS!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great change of pace for Dynasty Warriors game however the endings is a bit lacking",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "庄知彦还是有实力的制作人，他对游戏的理解是可以的，希望能继续做真三国无双",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I 100% recommend if you all love the warriors series and this game is by far 10 times better than Dynasty Warriors 9 after being too much crashing report and lagging from every bit of details. The story was phenomenal of how you are trying to choose a hero from 3 nations (Wei, Wu, and Shu). The character that you are playing is a protagonist with multiple weapons and lots of skills. If you want to give dynasty warriors a chance, please do play this game. this game won't disappoint you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a real good one. If you're intrigued by the idea of Warriors/Musou games, this is an excellent place to start",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it was so great to finally have like a complete for the full story with a lot to do and choices that change the story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Starting as a fictional character and fight alongside with your favorite warriors is definitely a brand new experience. I'm looking forward to what the next dlc will bring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having been in love with Dynasty Warriors since the dawn of the franchise as a hack n' slash on PlayStation 2 through DW2 on a demo disc... I'm no stranger to this franchise and its evolutions, spin-offs, and spiritual successors.  Over the years the formula and it's iterations became a guilty pleasure.  I had my doubts in the shift towards a singular unknown playable character, but they proved my doubts wrong and with my first play through found myself screaming \"I...I... It's... Lu Bu!\" Just like I did as a kid!  Dynasty Warriors felt new again and the scales of battle brought with it a fresh gravitas I hadn't felt in years!  No longer JUST a hack n' slash or a guilty pleasure!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played a lot of Dynasty Warriors games and this is by far the best 1 vs 1000 game I've played. They really nailed the huge army's, it actually feels like a true battlefield now. The old games look like jokes compared to this. the old games you might get a a hundred onscreen, this i'd easily say 1000. \n\nits also challenging too. the story is cool and being able to pick a side really makes this a blast to play. All the choices actually seem correct and there is no real \"bad guy\" Cao Cao always felt like the evil \"big bad\" and this game doesn't portray him in that light at all.\n\nReally amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not the kind of dynasty warriors i use to play but its realy refreshing. cant wait for the new dlc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very fun game. Arguably one of the best to come out this year. Its both an RPG and Dynasty Warriors. What more could you want? Well worth the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great feeling in the new series, they are trying a lot new and I feel that it works on a lot of good levels. Solid gameplay and I hope they can keep making more like this!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was really worried about this series after 7,8 and 9 but i can honestly say they really saved this game, everything is awesome, they preserved the main soul of the series and polished it perfectly. amazing recovery love this game will buy the DLC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game that reallllly makes up for the failure of 9. Pretty much everything is improved and fun. Only complaint is that, even though the game is a good length , and it has the three routes for the three kingdoms, it doesnt go very far into the book/history like previous games did. Ends at about the halfway point of 7/8/9",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Give Players freedom to zoom out camera during battle! Game will sell more copies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h3]Goodness gracious, this is the greatest video game I've played in the past decade. In fact, it's one of the best I've ever played!![/h3]\n\nWhere do I even begin on this work of art?\n\nLet's start with the story. It takes place in a tumultuous period of ancient Chinese history. Based on the Romance of the Three Kingdoms, there's so much to experience here. To know that all the events of the game are about real historical moments made it exceptionally interesting. Other than the protagonist and some other people being fictional, the story's been quite educational as it gave me a good starting point to learn more about ancient China. The story's pacing is also shockingly perfect. I was never rushed nor slowed down by the story, which is rare among games. For the story's length, it will be about 30 to 40 hours long. Completing the additional story paths will take another 20-30 hours each. All together, it's maybe an 80+ hour game.\n\nWith the characters, they all look fantastic and have personalities/traits that you normally don't find outside of Asia. The artists of the game outdid themselves with the everyone's appearances (except Xu Zhu). I wish more games had characters as pretty as Dynasty Warriors's ;(\n\nThe game's audio is phenomenal. Every battle has its own theme music to hype you up hard and even each faction has its own theme music. There is not a single dull piece of music in the entire soundtrack. Weapons sound authentic and hearing war drums beating with everyone cheering is immersive in battles. Frankly, all the sound effects are enjoyable. The Japanese voice acting is superb. The English voices sound lame and I haven't tried the Chinese ones yet.\n\nAs for the gameplay, it's utterly addictive. This is not a mindless button-mashing game. You have ten weapons with noticeably different fighting styles. Each weapon has numerous combo attacks and swappable special abilities. As you play, weapons automatically get upgraded with new moves, which can positively transform how they feel. Additionally, grinding in this game isn't necessary. However the game designers came up with a clever way to \"grind\", that is to do fun optional training missions to master each weapon's moves. As a bonus, all the combat animations are cinematic to watch.\n\nThe battles are surprisingly open-ended. They all take place in large, thoughtfully designed spaces and the objectives are pretty simple. So there's always multiple ways to win a battle. As the story progresses, the scale of the battles become truly [i]epic[/i]. That's a word I never use, so it means a lot. The enemies are balanced in ability, they can sometimes be tough or overwhelming but never unfair. Furthermore, you're given a small army, equipped with their own abilities, to control. You also have your own horse to ride around, it's just all too fun.\n\nWhat about the small details? They've all been accounted for. You can read about all the characters you meet, replay any battle, review any cutscene, listen the soundtrack, etc. Even in cutscenes you can reread any dialogue you missed or accidentally skipped. Travelling around the map between battles is a joy. The photo mode is feature rich as well. The developers have covered pretty much anything you can think of.\n\nRegarding performance, it's been smooth with max settings on an RTX 4070. There are some minor issues outside of battles but that's the only thing I can complain about. What I'll say is: use DLSS or FSR instead of TAA. The game is also only 50GB in size. Loading times are near instant on an SSD.\n\nFor years, I've been looking for a game that lets you fight monumental battles not purely as a strategist, but as a warrior on the ground. The closest was a mini-game in Like a Dragon Gaiden (which is fun to play). So to finally play this game has been an unexpected dream come true! This is the only video game I wouldn't mind paying the high price for. Although, I bought it at a discount, which made it a crazy bargain for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most fun I’ve had in a Dynasty Warriors game in a very long time. A blast to play on the Steam Deck as well (though required some tinkering). Combat is satisfying and fluid, and the music as usual is killer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll start by saying I really hope they make an Empires expansion for Origins. The main character even has an outfit that looks almost exactly like one i used on DW8 Empires.\r\n\r\nI actually had never thought about getting this game until it was gifted to me by a friend. With that said I actually really enjoyed it. Even after having about 3 game crashes... I kept at it. All three were at the end of the big story maps which only rubbed salt in the wound. Two of them on the Battle of Chibi, which have multiple cut-scenes and probably a ton of scripting with the changing of the level. \r\n\r\nMuch could be built upon this game with the new engine, which is the reason why I think they called it Origins. The combat is by far a much needed improvement. Honestly I don't care for the RPG style world map as I'm now just sitting at the Inn clicking the Story tab to replay battles to farm weapons for reforging. The bonds was nice to add challenges and followers, though it felt as most characters wanted to sleep with me with how some of their lines were written. In DW8 Empires the Oaths definitely had a more brothers in arms feeling to it.\r\n\r\nThe 8 Gates Formation map was by far my favorite. Wall formation of soldiers, It looked very realistic in the aspects of a war strategy. I never played DW9 but I did look up footage of the same 8 Gates to get an idea of what they were going for and it was a little sad to watch. DW8 went with a more fantasy iteration of the 8 Gates being massive walls. \r\n\r\nThis game is what I always wanted out of the Extreme Legends expansions which I haven't played since DW5 and since then I have never played any mainline title. However I've played all Empires expansion besides 9.\r\n\r\nThis game while still good now I just want to play DW8 Empires because I enjoyed all my created characters running around in the battles and seeing them talk trash, hell imagine plugging AI voices into them too and it would be funny to see the random sheet they'd say.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely the best entry in the series in a long time. My only negatives is that 1. Let us customize our character. 2. Why.... does every officer in the 3 kingdoms flirt with me? I can only assume Koei used a new company to translate/localize. Because every max affinity conversation is creepy/awkward.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a new player to this franchise, this game got me completely hooked.\n\nGranted, I am a fan of the Three Kingdoms period. However, while retaining most iconic figures of the timeframe it covers, the game gives its own interpretations and portrayals of them, making it recognisable yet interesting.\n\nBut most of all it simply feels good to play, whether fighting through the battlefield with well animated attacks that are chosen from a large moveset, or the dopamine hit of clearing out hundreds of soldiers with a single cinematic blow.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm still mid chapter 3, but this is already my favorite DW, it's the only one I can say rivals Sengoku Basara in the gameplay aspect\n\nThe only, and I mean ONLY thing that I dislike are the romance in the bonding events... Theyre it's so out of place... \n\n(Edit: I met Yueying, it's not only the men apparently, sure, Diao Chan had some \"romance\" dialogue as well but that one was well written since it's in the story... That said, I'll change it from \"gay dialogues\" to \"romance dialogues\")\n\nKind of feels like I'm playing a dating browser game, where characters are always super close and saying suggestive stuff to make you edge mentally thinking of the romance, but really never go for it... Pretty much every bonding event is like that, and some are weird enough that make you uncomfortable at times, like Lu Bu out of nowhere saying he's going to make you his, and \"as if I would let you go, chasing down my target is my specialty\". It's quite rapey\n\nOther examples of these dialogues are Guo Jia saying he wants to find a \"new kind of fun with you\", and that doing something new always requires a bit of courage, Guan Yu wanting to \"etch the features of your face and the sound of your voice\" into his mind tonight or Yueying wanting to make a life-size doll of you because you literally just met her and helped break some machines, even saying she's gonna \"take all of your measurements\" and make the \"greatest replica you've ever seen\"...\n\nExcept for a few characters who have reasons to like Ziluan, pretty much everyone seem to want to go to bed with you because you defeated them in battle, and some show up really out of nowhere and want to fuck you because they've heard from someone of your deeds... \n\nI know even the producer said it was way too much in that game, and I really hope they tone it down on the next ones... But outside of that, I have nothing to complain about this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute return to form, best entry in the series for a long while.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good Hack and Slash like the old times. Easy to play, no hassle, pretty relaxing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First Dynasty Warriors I've played in years, still a blast to play and grind!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Breath od new life into a already great franchise in which plays the same but also different to the rest with  both new tracks and remixed classic tracks for those of us who love the older games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is exactly my child brain imagined when I play Dynasty Warriors 4 Hyper back in the 2000s.\nThank you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's wonderful to run into the enemy headquarters with 200 men and watch your allies complete the mission without me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If your  a fan of the series you know what to expect, but if your not it's a generic hack and slash. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "2025年末，這款大概是我今年最意想不到的驚喜，夢回黑暗中偷玩無雙的日子。",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Brilliant game I 100% recommend to anyone who is a fan of warriors games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A solid game and a gem for fans old and new of the game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "why is there fighting and temporal interference in my yaoi dating sim?\n\nscandalous.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome step forward in the franchise, i look forward to seeing what they will produce in the future\r\n\r\nbludy gud stuff koei",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When you get your first zerg rush with all those troops the goosebumps are real. However I don't care for the main character or most of the new characters at all. Was falling asleep.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After how divisive 9 was, it's so nice to see Dynasty Warriors return to greatness.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is it lads, lasses and everyone in-between or outside of the gender binary, we're Chinese now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I grew up on DW3 and 4, and played each title since. The series had gotten a little stale and while I was apprehensive about the new direction Origins was taking, this has ended up being the breath of fresh air the franchise needed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend the game, but this mainly for the badge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brand new experience with a hint of nostalgia, what else could we Musou fans ask? THIS IS THE BEST Sangoku Musou SO FAR among the series. You can enjoy the fictional-historical three kingdoms history together with exciting battle experience seamlessly, raid opponents directly from front or secretly from back for some SURPRISED MFs. Strengthen the bonds between historical characters and you as the story progress, learn more about the reasons and struggles behind their intention, understand their decisions. This is a successful masterpiece which proves that even Musou series has potential for revolution.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked the classic Dynasty Warrior this is an amazing throw back.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First Dynasty Warriors game and I love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My review is 32 hours after completing Shu story with the true ending:\r\n\r\nThis is a good warriors game and a perfect entry point for new fans. Plenty of content, progression, and lovable characters. The only downside of this game is that they didn't let us play a full roster like the old games but that's fine as this is a spin off game in the franchise not a mainline entry after 9. \r\n\r\nThe future looks bright now for Warriors games with a big DLC for this game and DW3 Remaster coming here's hoping future games will be good as well",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have a very sporadic history with Dynasty Warriors, starting with the PS1 fighter, followed by the first battlefield \"musou\" title on the PS2, and then a LONG hiatus where I'd dabble with Xtreme Legends 8 on the Vita, and then XL 7 on PC about a decade after that. I was never a huge fan of this genre: the games always felt like good fun for about twenty minutes before the repetitiveness set in. And despite my love for Three Kingdoms lore, that wasn't enough to keep me playing.\r\n\r\nOrigins is... different from those memories. Maybe it's because I never spent serious time on any of the prior titles, or even touched any of the more recent iterations, but Origins manages to keep my attention in ways that the rest of the franchise could not. Other DW titles always felt a little floaty and loose to me, but the action in Origins feels tight, responsive, and substantial. Everything from parries to field-annihilating Musou attacks feel satisfying in all the right ways. The various weapons feel unique, with bespoke special attacks that serve meaningful purposes, a \"bravery\" meter that balances out the carnage, and a variety of other mechanics that make battles feel like a test of tactics and skill, rather than just a game of plowing into the thickest crowd and mashing buttons until complete (though that can definitely happen and still work). \r\n\r\nSurprisingly, one-on-one fights are pretty decent. While the combat obviously isn't \"Rise of the Ronin\" deep, Omega Force still does a good job of condensing interesting duels within a framework built for large-scale conflict. Boss fights are legitimately fun.\r\n\r\nThe game is VERY story and cutscene heavy, but fortunately the story is reliably Three Kingdoms fare. The real-time cutscenes look great, and pre-rendered cutscenes look fantastic (30 fps notwithstanding). That said, I'm a bit torn on some of the character models. Big guys like Guan Yu and Dong Zhuo look... wrong. Like, Guan Yu's head is three sizes too small for his gigantic torso, and everyone's arms/hands seem too damn short/small compared to their gigantic, rippling muscles. It seems like only the female characters have human proportions, and as expected, all the ladies look exceedingly pretty... though they still pale in comparison to the sheer bishounen powers of young Liu Bei and Cao Cao. \r\n\r\nThe default difficulty is a bit low; anyone familiar with action games should really start on the Hero difficulty level. Also, from what I've seen so far, this game could have probably gotten away with a character creator (like Nioh 2, Wo Long, or Rise of the Ronin), because the self-insert protagonist is so incredibly blank, androgenous, and soulless (by design) that I don't think it would matter if they're male, female, attractive, or grotesque. That said, I'm still relatively early in the game, so I'd understand if something in the narrative ultimately precludes those notions. Plus, those character creators seem more up Team Ninja's alley, so I'm probably asking for too much.\r\n\r\nAside from that, I have very few complaints and a lot of praise yet to give as I continue with this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really enjoying the latest franchise of Dynasty Warriors installment.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The game is fun, but beware, there is a bug where the menu will endlessly scroll and you will not be able to restart from a saved point or select anything. Despite every attempt to resolve the issue, there has been no success. Be prepared to play a 1-2 hour match and lose all progress due to this bug. I have personally lost maybe 20 hours due to it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's nothing like the other Dynasty Warrior Games at all. It's a solo story driven game, with the same hack and slash mechanics. I personally never played the DW games for the story. I never minded the bad character-acting because I liked being able to play with lots of different characters with their own personalities. The only mode in the game 10 hours in the solo linear story mode where you can only play as one character (although you can change their weapons / fighting style).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So I got this game as a gift, just as an heads up.\r\n\r\nSo DW Origins. As a life long DW enjoeyer (DW2 was one of the first games I ever played), I must say I am quite dissapointed with this one. \r\n\r\nSo let's start with the positive aspects of this game:\r\n1.) The ability to lock your camera on officier (like in a MH game or Souls like) is a great improvement to previous games and improves QoL drastly\r\n2.) The revised combat system is honestly great. Yeah it has some kinks still and I guess they went too hard from the original combat, the overall change is nice.\r\n3.) Soundtrack, while not as hype as older titles, is still very good.\r\n4.) The graphics is quite good. \r\n5.) First game since DW5 where I like the weapons designs again, albeit a bitr bland\r\n\r\nNegatives:\r\n1.) Once again a DW game, where the soldiers are basically just canon fodder and you just kill them because you have to. Still big donwgrade from games like DW2/3\r\n2.) No modes. Like literally none. What the fuck Koei\r\n3.) No weapons. There are 10 weapons and they all feel kinda weird. DW5 had more different swords than this game weapons overall\r\n4.) The model design is worse than probably every other game. The graphic is nice, but damn I don't like the style for most of them\r\n5.) The story is lame. I wanna slay foes on the battlefield and not waste time on an \"open\" world map and useless cutscenes. It feels like I have to sit through 20 minutes of \"story\" for 10 minutes of gameplay\r\n6.) The open world is one very poorly. It's one of those games where you only kinda have an open world, but acutally there is no choice in what you do. It's on railroads\r\n7.) Even thoguh the combat system is nice, the fights feel really samey and boring after a time. You just exhaust the officier to smash a button, rinse and repeat. Despite being more refined, they somehow mmaned to make it more boring then the old more simple style.\r\n8.) The boss fights feel like the temu version of a souls boss. Pretty cringe, I don't want that in my DW.\r\n9.)  Obviously the Non-canon, non customizable player character is thw worst change overall. \r\n10.) Your choices are meaningless, like talk about lazy game design\r\n11.) Giving chaff soldiers hyper armor is such an bad way to make them annoying, instead of fixing the real porblem with the soldiers in the newer games. Just make them like DW2-3 again. \r\n12.) The maps are utter shit, especially the yellow turban ones. Give me a break.\r\n13.) Never were the officiers on your team more useless than in this game. You basically have to babysit them to make it through a match. \r\n14.) The essence mechanic is so bad and frustrating. Just remove this gay shit, makes gameplay tedious and unfun (yes I am talking about the fucking shadow soldiers and the other shit they pull)\r\n15.) Getting KO's doesn't feel satisfiying anymore. I don't feel like a epic hero, but more like Mary Sue\r\n16.) I dislike the new gear system. It's worse than previous games.\r\n17.) There are definitly more things that really bug me about this game, but I can't be arsed to think and write about them but imagine there is more (Like broken and unskippable cutscenes, ....)\r\n\r\n\r\nAll in all the content in this game is miniscule, while the price is high. So it's just not worth it imho. They have to add all the weapons back, make all hereos playable again, add more DW modes and then we might talk about a decent game again. It has potential, but right now it feels more like a very drawn out demo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EVERYTHING loved about previous DW games was stripped away. filled with silly new features like player roaming a map picking up rss and over the top button combos.  so dissapointed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly I cannot believe how good the review is for this game, 91% of dumb ass gamers. It does not even allow you to play as so many other characters and this sucks really really much.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Every other Dynasty Warriors game is straightforward. This game expects you to learn far too many mechanics. If you like playing minigames every battle, then this is the game for you (derogatory).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really overpriced for what it is. \nThe actual combat is great and graphics look nice.\nEverything else? Awful.\nIts locked to one original character they made. This character is mute, has amnesia, and uses meaningless dialogue options to make choices that effect nothing as its all on rails.\nNo quick play / level select to mess around with.\nWeapons are unlocked in a set order. The last weapon type is unlocked by completing the game and there is 10 types total this installment.\nYou increase your characters strength by \"ranking\" up weapon categories. So you're forced to swap type constantly or else you stagnate.\nAs a big middle finger from the developers you can temporarily control a few named characters from the series if they are your officer / support but no way to actually permanently play as someone else. Im sure this will be sold back as DLC",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "Game is great but the random crashes during large battles are just not for me.\nAfter 10 months this issues still persist because devs are too lazy to actually fix their game",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "After a few hours I can say that, whilst the main story battles can be fun, the rest of the game is dull.\n\nMain story missions are often huge battles, and though it's marketed as 1 vs 1000, your allies also have huge armies and can hold their own; they actually advance on the battlefield if their morale is high. This incentivises you to capture bases and aid in battles, which are marked on the minimap, in which allies are struggling; once their morale is high you can leave them to it. Only downside is these battles feel far too quick and too chaotic, each being over not long after starting.\n\nThe rest of the game? The open world nonsense? The side content? Utter trash. Side content involves being tasked to use garbage weapons you don't like and, with them, spam certain attacks and stuff. That's it. To help fulfil these dull as hell side quests, the map is constantly populated with boring minor battles that have nothing to do with anything. I stopped engaging with all side content very, very quickly. It's not fun, it's a chore. Only, I then found myself under levelled for some main story battles, so the game has clearly been designed to force you into doing this crap. \n\nYou also play as a generic young boy, some nameless nobody who is, apparently, someone very special. You can't change how you look outside of replacing one drab robe with another drab robe, which is such a bizarre decision on Koei's part; if you're going to force us to play some generic, fictional hero, at least allow us to decide how they look. The design is very uninspired. This character doesn't speak, and just stands around with a blank expression at all times. Along the way he bumps into equally uninteresting fictional characters, like some young woman, an innkeeper, and some sort of doctor\\herbalist; all poorly made characters with uninspired designs. \n\nThe main battles feel like Dynasty Warriors, and I love how you need to help your allies or risk defeat. Outside of those main battles it feels like the world's worst RPG. \n\nIt's better than Dynasty Warriors 9, but that's not saying much.\n\nDon't buy it at full price, it's really not worth £65; seriously, at £65 it feels less like a Dynasty Warriors epic and more like Koei mugging me in broad daylight.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The Story: You join a party, you win, you leave that party perhaps never to see them again, and then seconds later you rejoin them, win, leaving them to perhaps never see them again.... only to join them again seconds later... so many cut scenes... so many!!! I ended up hitting the skip button and lost interest. \r\n\r\nGameplay: I played the game for nostalgia... and yeah, I enjoyed it... but It's no \"Dynasty Warriors 4\" (Or was it 3?).\r\n\r\nGrind: Having to grind with weapons I do not enjoy was not really enjoyable. I enjoyed trying them out but a prolonged \"Weapon XP grind\" was not great! \r\n\r\nPleasure: The \"mini-missions\" are Tiny!!! It's like \"kill 1 elite and 20 soldiers\" and then you're done, with 5xp (You need 25,000xp)... I'd like to just enter an epic battle at will.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’ve grown up with this series, and Dynasty Warriors: Origins honestly broke my heart a little. It looks great, runs smoothly, but it’s lost what made Dynasty Warriors feel special.\n\n**Bodyguards & Unit Command – The Missing Heart of the Series**\n\nThere’s still no return of bodyguards, one of the best features from the classic games. Even with a full reboot, they didn’t try anything new. No companions, no unit command, no squad mechanics — just your lone fighter cutting through endless crowds.\n\nImagine leading a small squad of archers, infantry, or cavalry that actually fought beside you. That kind of evolution would’ve been perfect for this reboot. Instead, it feels like a step backward into isolation.\n\n**Map Chaos & Busywork – The Headless Chicken Simulator**\n\nAlmost every mission turns into a mad dash to save weak allies. You spend half your time sprinting across massive maps while objectives collapse on the other side. It’s exhausting and repetitive.\n\nWhere’s the strategy? A proper battle map or command system would’ve added real depth — give orders, call in a volley or charge, launch an ambush or fire attack, even trigger mystical weather effects inspired by Romance of the Three Kingdoms. Anything to make the chaos feel smart instead of messy.\n\nInstead, you just chase icons. Over and over.\n\n**Main Character – Too Powerful for His Own Good**\n\nThe main character feels more like a demigod than a soldier. There’s no fear of dying, no thrill in surviving a tough fight. Earlier games made you feel like a warrior in the thick of a war — fragile, desperate, pushing your limits. That tension is gone here, and with it, the excitement.\n\n**Character Variety – From Hundreds to One**\n\nOne of the biggest letdowns is the lack of character choice. No roster, no variety, not even a female option. For a series famous for dozens of playable officers, this is a huge downgrade. A simple character creator would’ve gone a long way to fix it, but they didn’t bother.\n\n**Lost Potential – The Strategy That Never Returned**\n\nWhat hurts most is the wasted potential. I always hoped Dynasty Warriors would blend the tactical depth of Romance of the Three Kingdoms and DW Tactics with the signature action. Instead, they’ve stripped away more strategy with each new game.\n\nI’m still hoping for a Dynasty Warriors 3 remaster to bring back that old magic, but even then, no online co-op for PC feels like another missed chance.\n\n**Final Thoughts:**\nDynasty Warriors: Origins isn’t terrible, it’s just empty. It plays fine and looks fine, but it’s lost its heart and its soul. For veterans of the series, it feels like watching an old friend forget who they are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing the demo when it was released earlier this year, I was skeptical towards this game: combat isn't really that good/ smooth, and KOEI was never really good at storytelling in any previous title. Anyway, I decided to try it since it is on a 25% discount now.\n\nWith 1.5 hours into the game, this are my thoughts as a long time DW & musou fan. It is a fairly weak game despite all the hype and promises. This game is quite a lot weaker than what the demo showed. Playing as a fictional character, the story unfolding so slowly, battles making yellow turban lackeys sidekicks as the main boss of the battle/ map, are not immersive nor interesting at all especially for me who is well-versed in the history/ story. It feels like these relatively minor battles are here to drag on and provide length for game content since the game only covered until Chibi - which is not even half way in the three kingdoms story if we consider Jin as the end so it has relatively few famous events/ battles compared to the whole story.\n\nThe \"world map\" is quite underwhelming, with glitters laying on ground randomly, and a straight forward path I needed to walk, I cant say it is better than DW9's vast and empty map. Combat is also clunky by design, especially the defend/ parry motion - in my opinion as a long time fan the combat for me is way worse than the older dynasty warriors series or musou games.\n\nMaybe it is because I only got the first 1.5 hours down, but the story so far is very disappointing and I am not seeing the \"polish\" this game gives to the roster's character as some reviews say it has. Refunding it before I hit 2 hours mark, for me the game doesn't worth the price even at a 25% discount, and I did not see any sign within that 1.5 hours that things will improve. I might reconsider when it drops further to say, 60% discount or more in future to show support for the series.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is fun, but beware, there is a bug where the menu will endlessly scroll and you will not be able to restart from a saved point or select anything. Despite every attempt to resolve the issue, there has been no success. Be prepared to play a 1-2 hour match and lose all progress due to this bug. I have personally lost maybe 20 hours due to it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just constantly crashes every game.  Cant get past the start of the story.  No patches or anything that can fix.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's just not great. It's okay. The combat is fine but it's a far cry from DW3, DW4, DW5 or even DW7 or DW8. The game is slowed down horribly just by the overworld, having to gather small resources on the map, upkeep relationships and tasks. Older games where that is done quickly in a text menu or a very small map was much more engaging.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So I launch Dynasty Warriors: Origins, and right off the bat, the only thing worth a damn is the mass battles. Yeah, watching hundreds of soldiers clash at once? That’s cool. The NPCs actually hold their own for once in this franchise—you just need to swoop in once in a while like some discount babysitter. That’s fine.\n\nBut then… everything else? Holy shit.\n\nI start on the hardest difficulty thinking, “Okay, this’ll be a challenge.” Except no—it’s a joke. Half the time I’m swinging at enemies and they just stand there like lobotomized mannequins. Or they’re frozen in a state of eternal constipation while I button mash them into the dirt. Great combat system, huh? People keep saying it’s revolutionary, but I guess my copy came with “Stupid AI Mode” toggled on.\n\nAnd don’t even get me started on the main character. You’re stuck with Mr. Blandy McBlanderson—a mute, amnesiac, blank slate. Ooooh, real original! You get to name him yourself, but guess what? Nobody ever says it out loud. So you’re just “Insert Default Protagonist Here” for the entire game. Customization? Forget it. You can pick from a couple of generic outfits. That’s it. Want to feel like the hero of your own saga? Too bad, pal—this guy’s got less personality than a wet sock.\n\nOh, and the dialogue? Holy hell. Every time some side character shows up to dribble a nugget of backstory, it’s the cheesiest, most cringe-worthy crap I’ve ever heard. I’m talking straight-to-VHS anime dub levels of bad. It’s like the writers got paid in coupons for bad fanfiction.\n\nSide quests? More like side slogs. You either kill random mobs that have NOTHING to do with the story, or you skip them and suddenly the main story stomps you flat ‘cause you’re underleveled. So either way, you’re screwed.\n\nAnd then there’s the controls. The game shows Xbox prompts—fine if you’re on Xbox. But if you’re using a Switch controller like me? Congratulations, you’ve just entered button hell. “Press X!” Except X isn’t X. X is Y. Y is A. A is B. And B is your ass slamming the desk in frustration.\n\nTo make things worse, they tease you with dialogue choices—except they don’t mean jack squat. They don’t affect the story, they don’t change outcomes, they don’t even give you a different line of VOICE. Your mute dumbass doesn’t even speak them. What’s the point? It’s like roleplaying as a mime.\n\nAnd the cherry on this shit sundae? It’s not even open world. People keep saying it is, but nope. It’s just an overhead map, like Total War but on diet pills. You pick an objective, run down a straight path, and that’s it. Exploration? Freedom? Forget it. You’re on rails, baby. Might as well be playing Dynasty Warriors: The Hallway Simulator.\n\nIn short? Dynasty Warriors: Origins takes all the potential of a mass battle system and chains it to the most lifeless protagonist, shallowest quests, and dumbest fake choices imaginable. It’s a war all right—a war on fun.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's nothing like the other Dynasty Warrior Games at all. It's a solo story driven game, with the same hack and slash mechanics. I personally never played the DW games for the story. I never minded the bad character-acting because I liked being able to play with lots of different characters with their own personalities. The only mode in the game 10 hours in the solo linear story mode where you can only play as one character (although you can change their weapons / fighting style).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game crashes a lot, starting with first battle and is not completable by final Yellow Turban Rebellion battle:\r\n- smaller skirmishes against bandits worked fine with default settings (I also initially had 240 Hz, 2k res set).  \r\n- have 2k monitor 480Hz (also tried a 1080p 120Hz monitor without success), 4090,  i9-14900K, 32GB, cpu & gpu temps are good/cool during gameplay, confirmed game is up to date, have latest windows & gpu drivers, and confirmed game files are not corrupted.  Also tried setting monitors themselves to 30 fps, 60 fps, 1080p, 720p res etc, nothing helped get past last Yellow Turban Rebellion battle w/o crash.\r\n- in order to get through early battles without crashing i had to set fps to thirty (30) fps and resolution to 720p and all graphics settings to low. with or without v-sync didn't make a difference. \r\n- after a few battles that wasn't enough and it kept crashing when large numbers of enemies appeared, usually towards the end of battles, so I also disabled anti-aliasing (only thing that wasn't disabled) and I was eventually able to get to the final Yellow Turban Rebellion battle.  \r\n- However, the above settings aren't enough to get past that level, and that's as low as they go, so I'm stuck.  \r\n- Requested refund, but it was rejected as I had exceeded 2 hour minimum.  \r\n- Considering this is very early game, I don't think I can complete the game on my system - it has more than enough resources, but it's just too buggy.  \r\n- Most of my time spent on the game was spent replaying battles I had nearly completed when the game crashed and experimenting with different settings in an attempt to stop the game from crashing.\r\n\r\nFor what it's worth: If I could do this gain, I would play the game on the easiest difficulty to start and go through as much of the main story line as possible before two (2) hours of game play.  If you end up having similar issues to mine, I highly recommend immediately requesting a refund, rather than giving the game a shot.  This was my first time asking for a refund on a game and was not aware of the 2 hour minimum prior to this.  Hope this helps someone else not flush $70 down the toilet.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game just gets repetitive after a while, and the story is bad. The only thing this game has going for it is gameplay and soundtrack, but it isn't enough to carry the game for me to recommend it. The dynasty  warriors spinoffs are more enjoyable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I left DW at DW4 the game was mainly nostalgia purchase (plus was in English finally)  but  found the actual game play and story is solid, we got the drama from the background big battles + the usual Musou fun. If the hack and slash is  all you care about, you’ll probably have a good time but find the social stuff irritating. For me Lubu still comes charging out of Hulao gate and destroys everyone so that was a massive positive to re live that.\n\nBut the save system is rough. I was at the Battle of Chibi, quit out, and when I came back it threw me all the way back to the start of the chapter, lost like 10 levels. This may have been Steam Cloud fault by syncing an older save. but frustrating enough for me to put the game down, I don't think I will pick up again.\n\nThen there’s the fondness meter system. It goes from 1\"lets be friends\" to 10“let’s romance” way too fast. One minute you’re bros, next minute Gan Ning is like “How about I send the men to bed and we have one on one time, just you and me.” 😂 \n\nIt’s a bit of a meme but also super awkward. Dialogue choices don’t help they don’t change much, I feel like I selected \"......\" and the NPC will acted like you just said the most insightful thing on this green earth. Wish it could be more like Baldurs Gate 3 and focus more on improving the social aspect of the game.\n\nHoping Koei fixes this up in this game or the next game because the game could be great if those parts were fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "EVERYTHING loved about previous DW games was stripped away. filled with silly new features like player roaming a map picking up rss and over the top button combos.  so dissapointed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly I cannot believe how good the review is for this game, 91% of dumb ass gamers. It does not even allow you to play as so many other characters and this sucks really really much.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Every other Dynasty Warriors game is straightforward. This game expects you to learn far too many mechanics. If you like playing minigames every battle, then this is the game for you (derogatory).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really overpriced for what it is. \nThe actual combat is great and graphics look nice.\nEverything else? Awful.\nIts locked to one original character they made. This character is mute, has amnesia, and uses meaningless dialogue options to make choices that effect nothing as its all on rails.\nNo quick play / level select to mess around with.\nWeapons are unlocked in a set order. The last weapon type is unlocked by completing the game and there is 10 types total this installment.\nYou increase your characters strength by \"ranking\" up weapon categories. So you're forced to swap type constantly or else you stagnate.\nAs a big middle finger from the developers you can temporarily control a few named characters from the series if they are your officer / support but no way to actually permanently play as someone else. Im sure this will be sold back as DLC",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "The game is fun, but beware, there is a bug where the menu will endlessly scroll and you will not be able to restart from a saved point or select anything. Despite every attempt to resolve the issue, there has been no success. Be prepared to play a 1-2 hour match and lose all progress due to this bug. I have personally lost maybe 20 hours due to it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is great but the random crashes during large battles are just not for me.\nAfter 10 months this issues still persist because devs are too lazy to actually fix their game",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "After a few hours I can say that, whilst the main story battles can be fun, the rest of the game is dull.\n\nMain story missions are often huge battles, and though it's marketed as 1 vs 1000, your allies also have huge armies and can hold their own; they actually advance on the battlefield if their morale is high. This incentivises you to capture bases and aid in battles, which are marked on the minimap, in which allies are struggling; once their morale is high you can leave them to it. Only downside is these battles feel far too quick and too chaotic, each being over not long after starting.\n\nThe rest of the game? The open world nonsense? The side content? Utter trash. Side content involves being tasked to use garbage weapons you don't like and, with them, spam certain attacks and stuff. That's it. To help fulfil these dull as hell side quests, the map is constantly populated with boring minor battles that have nothing to do with anything. I stopped engaging with all side content very, very quickly. It's not fun, it's a chore. Only, I then found myself under levelled for some main story battles, so the game has clearly been designed to force you into doing this crap. \n\nYou also play as a generic young boy, some nameless nobody who is, apparently, someone very special. You can't change how you look outside of replacing one drab robe with another drab robe, which is such a bizarre decision on Koei's part; if you're going to force us to play some generic, fictional hero, at least allow us to decide how they look. The design is very uninspired. This character doesn't speak, and just stands around with a blank expression at all times. Along the way he bumps into equally uninteresting fictional characters, like some young woman, an innkeeper, and some sort of doctor\\herbalist; all poorly made characters with uninspired designs. \n\nThe main battles feel like Dynasty Warriors, and I love how you need to help your allies or risk defeat. Outside of those main battles it feels like the world's worst RPG. \n\nIt's better than Dynasty Warriors 9, but that's not saying much.\n\nDon't buy it at full price, it's really not worth £65; seriously, at £65 it feels less like a Dynasty Warriors epic and more like Koei mugging me in broad daylight.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The Story: You join a party, you win, you leave that party perhaps never to see them again, and then seconds later you rejoin them, win, leaving them to perhaps never see them again.... only to join them again seconds later... so many cut scenes... so many!!! I ended up hitting the skip button and lost interest. \r\n\r\nGameplay: I played the game for nostalgia... and yeah, I enjoyed it... but It's no \"Dynasty Warriors 4\" (Or was it 3?).\r\n\r\nGrind: Having to grind with weapons I do not enjoy was not really enjoyable. I enjoyed trying them out but a prolonged \"Weapon XP grind\" was not great! \r\n\r\nPleasure: The \"mini-missions\" are Tiny!!! It's like \"kill 1 elite and 20 soldiers\" and then you're done, with 5xp (You need 25,000xp)... I'd like to just enter an epic battle at will.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’ve grown up with this series, and Dynasty Warriors: Origins honestly broke my heart a little. It looks great, runs smoothly, but it’s lost what made Dynasty Warriors feel special.\n\n**Bodyguards & Unit Command – The Missing Heart of the Series**\n\nThere’s still no return of bodyguards, one of the best features from the classic games. Even with a full reboot, they didn’t try anything new. No companions, no unit command, no squad mechanics — just your lone fighter cutting through endless crowds.\n\nImagine leading a small squad of archers, infantry, or cavalry that actually fought beside you. That kind of evolution would’ve been perfect for this reboot. Instead, it feels like a step backward into isolation.\n\n**Map Chaos & Busywork – The Headless Chicken Simulator**\n\nAlmost every mission turns into a mad dash to save weak allies. You spend half your time sprinting across massive maps while objectives collapse on the other side. It’s exhausting and repetitive.\n\nWhere’s the strategy? A proper battle map or command system would’ve added real depth — give orders, call in a volley or charge, launch an ambush or fire attack, even trigger mystical weather effects inspired by Romance of the Three Kingdoms. Anything to make the chaos feel smart instead of messy.\n\nInstead, you just chase icons. Over and over.\n\n**Main Character – Too Powerful for His Own Good**\n\nThe main character feels more like a demigod than a soldier. There’s no fear of dying, no thrill in surviving a tough fight. Earlier games made you feel like a warrior in the thick of a war — fragile, desperate, pushing your limits. That tension is gone here, and with it, the excitement.\n\n**Character Variety – From Hundreds to One**\n\nOne of the biggest letdowns is the lack of character choice. No roster, no variety, not even a female option. For a series famous for dozens of playable officers, this is a huge downgrade. A simple character creator would’ve gone a long way to fix it, but they didn’t bother.\n\n**Lost Potential – The Strategy That Never Returned**\n\nWhat hurts most is the wasted potential. I always hoped Dynasty Warriors would blend the tactical depth of Romance of the Three Kingdoms and DW Tactics with the signature action. Instead, they’ve stripped away more strategy with each new game.\n\nI’m still hoping for a Dynasty Warriors 3 remaster to bring back that old magic, but even then, no online co-op for PC feels like another missed chance.\n\n**Final Thoughts:**\nDynasty Warriors: Origins isn’t terrible, it’s just empty. It plays fine and looks fine, but it’s lost its heart and its soul. For veterans of the series, it feels like watching an old friend forget who they are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing the demo when it was released earlier this year, I was skeptical towards this game: combat isn't really that good/ smooth, and KOEI was never really good at storytelling in any previous title. Anyway, I decided to try it since it is on a 25% discount now.\n\nWith 1.5 hours into the game, this are my thoughts as a long time DW & musou fan. It is a fairly weak game despite all the hype and promises. This game is quite a lot weaker than what the demo showed. Playing as a fictional character, the story unfolding so slowly, battles making yellow turban lackeys sidekicks as the main boss of the battle/ map, are not immersive nor interesting at all especially for me who is well-versed in the history/ story. It feels like these relatively minor battles are here to drag on and provide length for game content since the game only covered until Chibi - which is not even half way in the three kingdoms story if we consider Jin as the end so it has relatively few famous events/ battles compared to the whole story.\n\nThe \"world map\" is quite underwhelming, with glitters laying on ground randomly, and a straight forward path I needed to walk, I cant say it is better than DW9's vast and empty map. Combat is also clunky by design, especially the defend/ parry motion - in my opinion as a long time fan the combat for me is way worse than the older dynasty warriors series or musou games.\n\nMaybe it is because I only got the first 1.5 hours down, but the story so far is very disappointing and I am not seeing the \"polish\" this game gives to the roster's character as some reviews say it has. Refunding it before I hit 2 hours mark, for me the game doesn't worth the price even at a 25% discount, and I did not see any sign within that 1.5 hours that things will improve. I might reconsider when it drops further to say, 60% discount or more in future to show support for the series.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just constantly crashes every game.  Cant get past the start of the story.  No patches or anything that can fix.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's just not great. It's okay. The combat is fine but it's a far cry from DW3, DW4, DW5 or even DW7 or DW8. The game is slowed down horribly just by the overworld, having to gather small resources on the map, upkeep relationships and tasks. Older games where that is done quickly in a text menu or a very small map was much more engaging.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's nothing like the other Dynasty Warrior Games at all. It's a solo story driven game, with the same hack and slash mechanics. I personally never played the DW games for the story. I never minded the bad character-acting because I liked being able to play with lots of different characters with their own personalities. The only mode in the game 10 hours in the solo linear story mode where you can only play as one character (although you can change their weapons / fighting style).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So I got this game as a gift, just as an heads up.\r\n\r\nSo DW Origins. As a life long DW enjoeyer (DW2 was one of the first games I ever played), I must say I am quite dissapointed with this one. \r\n\r\nSo let's start with the positive aspects of this game:\r\n1.) The ability to lock your camera on officier (like in a MH game or Souls like) is a great improvement to previous games and improves QoL drastly\r\n2.) The revised combat system is honestly great. Yeah it has some kinks still and I guess they went too hard from the original combat, the overall change is nice.\r\n3.) Soundtrack, while not as hype as older titles, is still very good.\r\n4.) The graphics is quite good. \r\n5.) First game since DW5 where I like the weapons designs again, albeit a bitr bland\r\n\r\nNegatives:\r\n1.) Once again a DW game, where the soldiers are basically just canon fodder and you just kill them because you have to. Still big donwgrade from games like DW2/3\r\n2.) No modes. Like literally none. What the fuck Koei\r\n3.) No weapons. There are 10 weapons and they all feel kinda weird. DW5 had more different swords than this game weapons overall\r\n4.) The model design is worse than probably every other game. The graphic is nice, but damn I don't like the style for most of them\r\n5.) The story is lame. I wanna slay foes on the battlefield and not waste time on an \"open\" world map and useless cutscenes. It feels like I have to sit through 20 minutes of \"story\" for 10 minutes of gameplay\r\n6.) The open world is one very poorly. It's one of those games where you only kinda have an open world, but acutally there is no choice in what you do. It's on railroads\r\n7.) Even thoguh the combat system is nice, the fights feel really samey and boring after a time. You just exhaust the officier to smash a button, rinse and repeat. Despite being more refined, they somehow mmaned to make it more boring then the old more simple style.\r\n8.) The boss fights feel like the temu version of a souls boss. Pretty cringe, I don't want that in my DW.\r\n9.)  Obviously the Non-canon, non customizable player character is thw worst change overall. \r\n10.) Your choices are meaningless, like talk about lazy game design\r\n11.) Giving chaff soldiers hyper armor is such an bad way to make them annoying, instead of fixing the real porblem with the soldiers in the newer games. Just make them like DW2-3 again. \r\n12.) The maps are utter shit, especially the yellow turban ones. Give me a break.\r\n13.) Never were the officiers on your team more useless than in this game. You basically have to babysit them to make it through a match. \r\n14.) The essence mechanic is so bad and frustrating. Just remove this gay shit, makes gameplay tedious and unfun (yes I am talking about the fucking shadow soldiers and the other shit they pull)\r\n15.) Getting KO's doesn't feel satisfiying anymore. I don't feel like a epic hero, but more like Mary Sue\r\n16.) I dislike the new gear system. It's worse than previous games.\r\n17.) There are definitly more things that really bug me about this game, but I can't be arsed to think and write about them but imagine there is more (Like broken and unskippable cutscenes, ....)\r\n\r\n\r\nAll in all the content in this game is miniscule, while the price is high. So it's just not worth it imho. They have to add all the weapons back, make all hereos playable again, add more DW modes and then we might talk about a decent game again. It has potential, but right now it feels more like a very drawn out demo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EVERYTHING loved about previous DW games was stripped away. filled with silly new features like player roaming a map picking up rss and over the top button combos.  so dissapointed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly I cannot believe how good the review is for this game, 91% of dumb ass gamers. It does not even allow you to play as so many other characters and this sucks really really much.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Every other Dynasty Warriors game is straightforward. This game expects you to learn far too many mechanics. If you like playing minigames every battle, then this is the game for you (derogatory).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really overpriced for what it is. \nThe actual combat is great and graphics look nice.\nEverything else? Awful.\nIts locked to one original character they made. This character is mute, has amnesia, and uses meaningless dialogue options to make choices that effect nothing as its all on rails.\nNo quick play / level select to mess around with.\nWeapons are unlocked in a set order. The last weapon type is unlocked by completing the game and there is 10 types total this installment.\nYou increase your characters strength by \"ranking\" up weapon categories. So you're forced to swap type constantly or else you stagnate.\nAs a big middle finger from the developers you can temporarily control a few named characters from the series if they are your officer / support but no way to actually permanently play as someone else. Im sure this will be sold back as DLC",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "The game is fun, but beware, there is a bug where the menu will endlessly scroll and you will not be able to restart from a saved point or select anything. Despite every attempt to resolve the issue, there has been no success. Be prepared to play a 1-2 hour match and lose all progress due to this bug. I have personally lost maybe 20 hours due to it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is great but the random crashes during large battles are just not for me.\nAfter 10 months this issues still persist because devs are too lazy to actually fix their game",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "After a few hours I can say that, whilst the main story battles can be fun, the rest of the game is dull.\n\nMain story missions are often huge battles, and though it's marketed as 1 vs 1000, your allies also have huge armies and can hold their own; they actually advance on the battlefield if their morale is high. This incentivises you to capture bases and aid in battles, which are marked on the minimap, in which allies are struggling; once their morale is high you can leave them to it. Only downside is these battles feel far too quick and too chaotic, each being over not long after starting.\n\nThe rest of the game? The open world nonsense? The side content? Utter trash. Side content involves being tasked to use garbage weapons you don't like and, with them, spam certain attacks and stuff. That's it. To help fulfil these dull as hell side quests, the map is constantly populated with boring minor battles that have nothing to do with anything. I stopped engaging with all side content very, very quickly. It's not fun, it's a chore. Only, I then found myself under levelled for some main story battles, so the game has clearly been designed to force you into doing this crap. \n\nYou also play as a generic young boy, some nameless nobody who is, apparently, someone very special. You can't change how you look outside of replacing one drab robe with another drab robe, which is such a bizarre decision on Koei's part; if you're going to force us to play some generic, fictional hero, at least allow us to decide how they look. The design is very uninspired. This character doesn't speak, and just stands around with a blank expression at all times. Along the way he bumps into equally uninteresting fictional characters, like some young woman, an innkeeper, and some sort of doctor\\herbalist; all poorly made characters with uninspired designs. \n\nThe main battles feel like Dynasty Warriors, and I love how you need to help your allies or risk defeat. Outside of those main battles it feels like the world's worst RPG. \n\nIt's better than Dynasty Warriors 9, but that's not saying much.\n\nDon't buy it at full price, it's really not worth £65; seriously, at £65 it feels less like a Dynasty Warriors epic and more like Koei mugging me in broad daylight.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The Story: You join a party, you win, you leave that party perhaps never to see them again, and then seconds later you rejoin them, win, leaving them to perhaps never see them again.... only to join them again seconds later... so many cut scenes... so many!!! I ended up hitting the skip button and lost interest. \r\n\r\nGameplay: I played the game for nostalgia... and yeah, I enjoyed it... but It's no \"Dynasty Warriors 4\" (Or was it 3?).\r\n\r\nGrind: Having to grind with weapons I do not enjoy was not really enjoyable. I enjoyed trying them out but a prolonged \"Weapon XP grind\" was not great! \r\n\r\nPleasure: The \"mini-missions\" are Tiny!!! It's like \"kill 1 elite and 20 soldiers\" and then you're done, with 5xp (You need 25,000xp)... I'd like to just enter an epic battle at will.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’ve grown up with this series, and Dynasty Warriors: Origins honestly broke my heart a little. It looks great, runs smoothly, but it’s lost what made Dynasty Warriors feel special.\n\n**Bodyguards & Unit Command – The Missing Heart of the Series**\n\nThere’s still no return of bodyguards, one of the best features from the classic games. Even with a full reboot, they didn’t try anything new. No companions, no unit command, no squad mechanics — just your lone fighter cutting through endless crowds.\n\nImagine leading a small squad of archers, infantry, or cavalry that actually fought beside you. That kind of evolution would’ve been perfect for this reboot. Instead, it feels like a step backward into isolation.\n\n**Map Chaos & Busywork – The Headless Chicken Simulator**\n\nAlmost every mission turns into a mad dash to save weak allies. You spend half your time sprinting across massive maps while objectives collapse on the other side. It’s exhausting and repetitive.\n\nWhere’s the strategy? A proper battle map or command system would’ve added real depth — give orders, call in a volley or charge, launch an ambush or fire attack, even trigger mystical weather effects inspired by Romance of the Three Kingdoms. Anything to make the chaos feel smart instead of messy.\n\nInstead, you just chase icons. Over and over.\n\n**Main Character – Too Powerful for His Own Good**\n\nThe main character feels more like a demigod than a soldier. There’s no fear of dying, no thrill in surviving a tough fight. Earlier games made you feel like a warrior in the thick of a war — fragile, desperate, pushing your limits. That tension is gone here, and with it, the excitement.\n\n**Character Variety – From Hundreds to One**\n\nOne of the biggest letdowns is the lack of character choice. No roster, no variety, not even a female option. For a series famous for dozens of playable officers, this is a huge downgrade. A simple character creator would’ve gone a long way to fix it, but they didn’t bother.\n\n**Lost Potential – The Strategy That Never Returned**\n\nWhat hurts most is the wasted potential. I always hoped Dynasty Warriors would blend the tactical depth of Romance of the Three Kingdoms and DW Tactics with the signature action. Instead, they’ve stripped away more strategy with each new game.\n\nI’m still hoping for a Dynasty Warriors 3 remaster to bring back that old magic, but even then, no online co-op for PC feels like another missed chance.\n\n**Final Thoughts:**\nDynasty Warriors: Origins isn’t terrible, it’s just empty. It plays fine and looks fine, but it’s lost its heart and its soul. For veterans of the series, it feels like watching an old friend forget who they are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing the demo when it was released earlier this year, I was skeptical towards this game: combat isn't really that good/ smooth, and KOEI was never really good at storytelling in any previous title. Anyway, I decided to try it since it is on a 25% discount now.\n\nWith 1.5 hours into the game, this are my thoughts as a long time DW & musou fan. It is a fairly weak game despite all the hype and promises. This game is quite a lot weaker than what the demo showed. Playing as a fictional character, the story unfolding so slowly, battles making yellow turban lackeys sidekicks as the main boss of the battle/ map, are not immersive nor interesting at all especially for me who is well-versed in the history/ story. It feels like these relatively minor battles are here to drag on and provide length for game content since the game only covered until Chibi - which is not even half way in the three kingdoms story if we consider Jin as the end so it has relatively few famous events/ battles compared to the whole story.\n\nThe \"world map\" is quite underwhelming, with glitters laying on ground randomly, and a straight forward path I needed to walk, I cant say it is better than DW9's vast and empty map. Combat is also clunky by design, especially the defend/ parry motion - in my opinion as a long time fan the combat for me is way worse than the older dynasty warriors series or musou games.\n\nMaybe it is because I only got the first 1.5 hours down, but the story so far is very disappointing and I am not seeing the \"polish\" this game gives to the roster's character as some reviews say it has. Refunding it before I hit 2 hours mark, for me the game doesn't worth the price even at a 25% discount, and I did not see any sign within that 1.5 hours that things will improve. I might reconsider when it drops further to say, 60% discount or more in future to show support for the series.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just constantly crashes every game.  Cant get past the start of the story.  No patches or anything that can fix.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's just not great. It's okay. The combat is fine but it's a far cry from DW3, DW4, DW5 or even DW7 or DW8. The game is slowed down horribly just by the overworld, having to gather small resources on the map, upkeep relationships and tasks. Older games where that is done quickly in a text menu or a very small map was much more engaging.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's nothing like the other Dynasty Warrior Games at all. It's a solo story driven game, with the same hack and slash mechanics. I personally never played the DW games for the story. I never minded the bad character-acting because I liked being able to play with lots of different characters with their own personalities. The only mode in the game 10 hours in the solo linear story mode where you can only play as one character (although you can change their weapons / fighting style).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So I got this game as a gift, just as an heads up.\r\n\r\nSo DW Origins. As a life long DW enjoeyer (DW2 was one of the first games I ever played), I must say I am quite dissapointed with this one. \r\n\r\nSo let's start with the positive aspects of this game:\r\n1.) The ability to lock your camera on officier (like in a MH game or Souls like) is a great improvement to previous games and improves QoL drastly\r\n2.) The revised combat system is honestly great. Yeah it has some kinks still and I guess they went too hard from the original combat, the overall change is nice.\r\n3.) Soundtrack, while not as hype as older titles, is still very good.\r\n4.) The graphics is quite good. \r\n5.) First game since DW5 where I like the weapons designs again, albeit a bitr bland\r\n\r\nNegatives:\r\n1.) Once again a DW game, where the soldiers are basically just canon fodder and you just kill them because you have to. Still big donwgrade from games like DW2/3\r\n2.) No modes. Like literally none. What the fuck Koei\r\n3.) No weapons. There are 10 weapons and they all feel kinda weird. DW5 had more different swords than this game weapons overall\r\n4.) The model design is worse than probably every other game. The graphic is nice, but damn I don't like the style for most of them\r\n5.) The story is lame. I wanna slay foes on the battlefield and not waste time on an \"open\" world map and useless cutscenes. It feels like I have to sit through 20 minutes of \"story\" for 10 minutes of gameplay\r\n6.) The open world is one very poorly. It's one of those games where you only kinda have an open world, but acutally there is no choice in what you do. It's on railroads\r\n7.) Even thoguh the combat system is nice, the fights feel really samey and boring after a time. You just exhaust the officier to smash a button, rinse and repeat. Despite being more refined, they somehow mmaned to make it more boring then the old more simple style.\r\n8.) The boss fights feel like the temu version of a souls boss. Pretty cringe, I don't want that in my DW.\r\n9.)  Obviously the Non-canon, non customizable player character is thw worst change overall. \r\n10.) Your choices are meaningless, like talk about lazy game design\r\n11.) Giving chaff soldiers hyper armor is such an bad way to make them annoying, instead of fixing the real porblem with the soldiers in the newer games. Just make them like DW2-3 again. \r\n12.) The maps are utter shit, especially the yellow turban ones. Give me a break.\r\n13.) Never were the officiers on your team more useless than in this game. You basically have to babysit them to make it through a match. \r\n14.) The essence mechanic is so bad and frustrating. Just remove this gay shit, makes gameplay tedious and unfun (yes I am talking about the fucking shadow soldiers and the other shit they pull)\r\n15.) Getting KO's doesn't feel satisfiying anymore. I don't feel like a epic hero, but more like Mary Sue\r\n16.) I dislike the new gear system. It's worse than previous games.\r\n17.) There are definitly more things that really bug me about this game, but I can't be arsed to think and write about them but imagine there is more (Like broken and unskippable cutscenes, ....)\r\n\r\n\r\nAll in all the content in this game is miniscule, while the price is high. So it's just not worth it imho. They have to add all the weapons back, make all hereos playable again, add more DW modes and then we might talk about a decent game again. It has potential, but right now it feels more like a very drawn out demo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EVERYTHING loved about previous DW games was stripped away. filled with silly new features like player roaming a map picking up rss and over the top button combos.  so dissapointed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly I cannot believe how good the review is for this game, 91% of dumb ass gamers. It does not even allow you to play as so many other characters and this sucks really really much.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Every other Dynasty Warriors game is straightforward. This game expects you to learn far too many mechanics. If you like playing minigames every battle, then this is the game for you (derogatory).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really overpriced for what it is. \nThe actual combat is great and graphics look nice.\nEverything else? Awful.\nIts locked to one original character they made. This character is mute, has amnesia, and uses meaningless dialogue options to make choices that effect nothing as its all on rails.\nNo quick play / level select to mess around with.\nWeapons are unlocked in a set order. The last weapon type is unlocked by completing the game and there is 10 types total this installment.\nYou increase your characters strength by \"ranking\" up weapon categories. So you're forced to swap type constantly or else you stagnate.\nAs a big middle finger from the developers you can temporarily control a few named characters from the series if they are your officer / support but no way to actually permanently play as someone else. Im sure this will be sold back as DLC",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "The game is fun, but beware, there is a bug where the menu will endlessly scroll and you will not be able to restart from a saved point or select anything. Despite every attempt to resolve the issue, there has been no success. Be prepared to play a 1-2 hour match and lose all progress due to this bug. I have personally lost maybe 20 hours due to it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is great but the random crashes during large battles are just not for me.\nAfter 10 months this issues still persist because devs are too lazy to actually fix their game",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "After a few hours I can say that, whilst the main story battles can be fun, the rest of the game is dull.\n\nMain story missions are often huge battles, and though it's marketed as 1 vs 1000, your allies also have huge armies and can hold their own; they actually advance on the battlefield if their morale is high. This incentivises you to capture bases and aid in battles, which are marked on the minimap, in which allies are struggling; once their morale is high you can leave them to it. Only downside is these battles feel far too quick and too chaotic, each being over not long after starting.\n\nThe rest of the game? The open world nonsense? The side content? Utter trash. Side content involves being tasked to use garbage weapons you don't like and, with them, spam certain attacks and stuff. That's it. To help fulfil these dull as hell side quests, the map is constantly populated with boring minor battles that have nothing to do with anything. I stopped engaging with all side content very, very quickly. It's not fun, it's a chore. Only, I then found myself under levelled for some main story battles, so the game has clearly been designed to force you into doing this crap. \n\nYou also play as a generic young boy, some nameless nobody who is, apparently, someone very special. You can't change how you look outside of replacing one drab robe with another drab robe, which is such a bizarre decision on Koei's part; if you're going to force us to play some generic, fictional hero, at least allow us to decide how they look. The design is very uninspired. This character doesn't speak, and just stands around with a blank expression at all times. Along the way he bumps into equally uninteresting fictional characters, like some young woman, an innkeeper, and some sort of doctor\\herbalist; all poorly made characters with uninspired designs. \n\nThe main battles feel like Dynasty Warriors, and I love how you need to help your allies or risk defeat. Outside of those main battles it feels like the world's worst RPG. \n\nIt's better than Dynasty Warriors 9, but that's not saying much.\n\nDon't buy it at full price, it's really not worth £65; seriously, at £65 it feels less like a Dynasty Warriors epic and more like Koei mugging me in broad daylight.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The Story: You join a party, you win, you leave that party perhaps never to see them again, and then seconds later you rejoin them, win, leaving them to perhaps never see them again.... only to join them again seconds later... so many cut scenes... so many!!! I ended up hitting the skip button and lost interest. \r\n\r\nGameplay: I played the game for nostalgia... and yeah, I enjoyed it... but It's no \"Dynasty Warriors 4\" (Or was it 3?).\r\n\r\nGrind: Having to grind with weapons I do not enjoy was not really enjoyable. I enjoyed trying them out but a prolonged \"Weapon XP grind\" was not great! \r\n\r\nPleasure: The \"mini-missions\" are Tiny!!! It's like \"kill 1 elite and 20 soldiers\" and then you're done, with 5xp (You need 25,000xp)... I'd like to just enter an epic battle at will.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’ve grown up with this series, and Dynasty Warriors: Origins honestly broke my heart a little. It looks great, runs smoothly, but it’s lost what made Dynasty Warriors feel special.\n\n**Bodyguards & Unit Command – The Missing Heart of the Series**\n\nThere’s still no return of bodyguards, one of the best features from the classic games. Even with a full reboot, they didn’t try anything new. No companions, no unit command, no squad mechanics — just your lone fighter cutting through endless crowds.\n\nImagine leading a small squad of archers, infantry, or cavalry that actually fought beside you. That kind of evolution would’ve been perfect for this reboot. Instead, it feels like a step backward into isolation.\n\n**Map Chaos & Busywork – The Headless Chicken Simulator**\n\nAlmost every mission turns into a mad dash to save weak allies. You spend half your time sprinting across massive maps while objectives collapse on the other side. It’s exhausting and repetitive.\n\nWhere’s the strategy? A proper battle map or command system would’ve added real depth — give orders, call in a volley or charge, launch an ambush or fire attack, even trigger mystical weather effects inspired by Romance of the Three Kingdoms. Anything to make the chaos feel smart instead of messy.\n\nInstead, you just chase icons. Over and over.\n\n**Main Character – Too Powerful for His Own Good**\n\nThe main character feels more like a demigod than a soldier. There’s no fear of dying, no thrill in surviving a tough fight. Earlier games made you feel like a warrior in the thick of a war — fragile, desperate, pushing your limits. That tension is gone here, and with it, the excitement.\n\n**Character Variety – From Hundreds to One**\n\nOne of the biggest letdowns is the lack of character choice. No roster, no variety, not even a female option. For a series famous for dozens of playable officers, this is a huge downgrade. A simple character creator would’ve gone a long way to fix it, but they didn’t bother.\n\n**Lost Potential – The Strategy That Never Returned**\n\nWhat hurts most is the wasted potential. I always hoped Dynasty Warriors would blend the tactical depth of Romance of the Three Kingdoms and DW Tactics with the signature action. Instead, they’ve stripped away more strategy with each new game.\n\nI’m still hoping for a Dynasty Warriors 3 remaster to bring back that old magic, but even then, no online co-op for PC feels like another missed chance.\n\n**Final Thoughts:**\nDynasty Warriors: Origins isn’t terrible, it’s just empty. It plays fine and looks fine, but it’s lost its heart and its soul. For veterans of the series, it feels like watching an old friend forget who they are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing the demo when it was released earlier this year, I was skeptical towards this game: combat isn't really that good/ smooth, and KOEI was never really good at storytelling in any previous title. Anyway, I decided to try it since it is on a 25% discount now.\n\nWith 1.5 hours into the game, this are my thoughts as a long time DW & musou fan. It is a fairly weak game despite all the hype and promises. This game is quite a lot weaker than what the demo showed. Playing as a fictional character, the story unfolding so slowly, battles making yellow turban lackeys sidekicks as the main boss of the battle/ map, are not immersive nor interesting at all especially for me who is well-versed in the history/ story. It feels like these relatively minor battles are here to drag on and provide length for game content since the game only covered until Chibi - which is not even half way in the three kingdoms story if we consider Jin as the end so it has relatively few famous events/ battles compared to the whole story.\n\nThe \"world map\" is quite underwhelming, with glitters laying on ground randomly, and a straight forward path I needed to walk, I cant say it is better than DW9's vast and empty map. Combat is also clunky by design, especially the defend/ parry motion - in my opinion as a long time fan the combat for me is way worse than the older dynasty warriors series or musou games.\n\nMaybe it is because I only got the first 1.5 hours down, but the story so far is very disappointing and I am not seeing the \"polish\" this game gives to the roster's character as some reviews say it has. Refunding it before I hit 2 hours mark, for me the game doesn't worth the price even at a 25% discount, and I did not see any sign within that 1.5 hours that things will improve. I might reconsider when it drops further to say, 60% discount or more in future to show support for the series.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just constantly crashes every game.  Cant get past the start of the story.  No patches or anything that can fix.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's just not great. It's okay. The combat is fine but it's a far cry from DW3, DW4, DW5 or even DW7 or DW8. The game is slowed down horribly just by the overworld, having to gather small resources on the map, upkeep relationships and tasks. Older games where that is done quickly in a text menu or a very small map was much more engaging.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's nothing like the other Dynasty Warrior Games at all. It's a solo story driven game, with the same hack and slash mechanics. I personally never played the DW games for the story. I never minded the bad character-acting because I liked being able to play with lots of different characters with their own personalities. The only mode in the game 10 hours in the solo linear story mode where you can only play as one character (although you can change their weapons / fighting style).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So I got this game as a gift, just as an heads up.\r\n\r\nSo DW Origins. As a life long DW enjoeyer (DW2 was one of the first games I ever played), I must say I am quite dissapointed with this one. \r\n\r\nSo let's start with the positive aspects of this game:\r\n1.) The ability to lock your camera on officier (like in a MH game or Souls like) is a great improvement to previous games and improves QoL drastly\r\n2.) The revised combat system is honestly great. Yeah it has some kinks still and I guess they went too hard from the original combat, the overall change is nice.\r\n3.) Soundtrack, while not as hype as older titles, is still very good.\r\n4.) The graphics is quite good. \r\n5.) First game since DW5 where I like the weapons designs again, albeit a bitr bland\r\n\r\nNegatives:\r\n1.) Once again a DW game, where the soldiers are basically just canon fodder and you just kill them because you have to. Still big donwgrade from games like DW2/3\r\n2.) No modes. Like literally none. What the fuck Koei\r\n3.) No weapons. There are 10 weapons and they all feel kinda weird. DW5 had more different swords than this game weapons overall\r\n4.) The model design is worse than probably every other game. The graphic is nice, but damn I don't like the style for most of them\r\n5.) The story is lame. I wanna slay foes on the battlefield and not waste time on an \"open\" world map and useless cutscenes. It feels like I have to sit through 20 minutes of \"story\" for 10 minutes of gameplay\r\n6.) The open world is one very poorly. It's one of those games where you only kinda have an open world, but acutally there is no choice in what you do. It's on railroads\r\n7.) Even thoguh the combat system is nice, the fights feel really samey and boring after a time. You just exhaust the officier to smash a button, rinse and repeat. Despite being more refined, they somehow mmaned to make it more boring then the old more simple style.\r\n8.) The boss fights feel like the temu version of a souls boss. Pretty cringe, I don't want that in my DW.\r\n9.)  Obviously the Non-canon, non customizable player character is thw worst change overall. \r\n10.) Your choices are meaningless, like talk about lazy game design\r\n11.) Giving chaff soldiers hyper armor is such an bad way to make them annoying, instead of fixing the real porblem with the soldiers in the newer games. Just make them like DW2-3 again. \r\n12.) The maps are utter shit, especially the yellow turban ones. Give me a break.\r\n13.) Never were the officiers on your team more useless than in this game. You basically have to babysit them to make it through a match. \r\n14.) The essence mechanic is so bad and frustrating. Just remove this gay shit, makes gameplay tedious and unfun (yes I am talking about the fucking shadow soldiers and the other shit they pull)\r\n15.) Getting KO's doesn't feel satisfiying anymore. I don't feel like a epic hero, but more like Mary Sue\r\n16.) I dislike the new gear system. It's worse than previous games.\r\n17.) There are definitly more things that really bug me about this game, but I can't be arsed to think and write about them but imagine there is more (Like broken and unskippable cutscenes, ....)\r\n\r\n\r\nAll in all the content in this game is miniscule, while the price is high. So it's just not worth it imho. They have to add all the weapons back, make all hereos playable again, add more DW modes and then we might talk about a decent game again. It has potential, but right now it feels more like a very drawn out demo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EVERYTHING loved about previous DW games was stripped away. filled with silly new features like player roaming a map picking up rss and over the top button combos.  so dissapointed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly I cannot believe how good the review is for this game, 91% of dumb ass gamers. It does not even allow you to play as so many other characters and this sucks really really much.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Every other Dynasty Warriors game is straightforward. This game expects you to learn far too many mechanics. If you like playing minigames every battle, then this is the game for you (derogatory).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really overpriced for what it is. \nThe actual combat is great and graphics look nice.\nEverything else? Awful.\nIts locked to one original character they made. This character is mute, has amnesia, and uses meaningless dialogue options to make choices that effect nothing as its all on rails.\nNo quick play / level select to mess around with.\nWeapons are unlocked in a set order. The last weapon type is unlocked by completing the game and there is 10 types total this installment.\nYou increase your characters strength by \"ranking\" up weapon categories. So you're forced to swap type constantly or else you stagnate.\nAs a big middle finger from the developers you can temporarily control a few named characters from the series if they are your officer / support but no way to actually permanently play as someone else. Im sure this will be sold back as DLC",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "The game is fun, but beware, there is a bug where the menu will endlessly scroll and you will not be able to restart from a saved point or select anything. Despite every attempt to resolve the issue, there has been no success. Be prepared to play a 1-2 hour match and lose all progress due to this bug. I have personally lost maybe 20 hours due to it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is great but the random crashes during large battles are just not for me.\nAfter 10 months this issues still persist because devs are too lazy to actually fix their game",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "After a few hours I can say that, whilst the main story battles can be fun, the rest of the game is dull.\n\nMain story missions are often huge battles, and though it's marketed as 1 vs 1000, your allies also have huge armies and can hold their own; they actually advance on the battlefield if their morale is high. This incentivises you to capture bases and aid in battles, which are marked on the minimap, in which allies are struggling; once their morale is high you can leave them to it. Only downside is these battles feel far too quick and too chaotic, each being over not long after starting.\n\nThe rest of the game? The open world nonsense? The side content? Utter trash. Side content involves being tasked to use garbage weapons you don't like and, with them, spam certain attacks and stuff. That's it. To help fulfil these dull as hell side quests, the map is constantly populated with boring minor battles that have nothing to do with anything. I stopped engaging with all side content very, very quickly. It's not fun, it's a chore. Only, I then found myself under levelled for some main story battles, so the game has clearly been designed to force you into doing this crap. \n\nYou also play as a generic young boy, some nameless nobody who is, apparently, someone very special. You can't change how you look outside of replacing one drab robe with another drab robe, which is such a bizarre decision on Koei's part; if you're going to force us to play some generic, fictional hero, at least allow us to decide how they look. The design is very uninspired. This character doesn't speak, and just stands around with a blank expression at all times. Along the way he bumps into equally uninteresting fictional characters, like some young woman, an innkeeper, and some sort of doctor\\herbalist; all poorly made characters with uninspired designs. \n\nThe main battles feel like Dynasty Warriors, and I love how you need to help your allies or risk defeat. Outside of those main battles it feels like the world's worst RPG. \n\nIt's better than Dynasty Warriors 9, but that's not saying much.\n\nDon't buy it at full price, it's really not worth £65; seriously, at £65 it feels less like a Dynasty Warriors epic and more like Koei mugging me in broad daylight.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The Story: You join a party, you win, you leave that party perhaps never to see them again, and then seconds later you rejoin them, win, leaving them to perhaps never see them again.... only to join them again seconds later... so many cut scenes... so many!!! I ended up hitting the skip button and lost interest. \r\n\r\nGameplay: I played the game for nostalgia... and yeah, I enjoyed it... but It's no \"Dynasty Warriors 4\" (Or was it 3?).\r\n\r\nGrind: Having to grind with weapons I do not enjoy was not really enjoyable. I enjoyed trying them out but a prolonged \"Weapon XP grind\" was not great! \r\n\r\nPleasure: The \"mini-missions\" are Tiny!!! It's like \"kill 1 elite and 20 soldiers\" and then you're done, with 5xp (You need 25,000xp)... I'd like to just enter an epic battle at will.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’ve grown up with this series, and Dynasty Warriors: Origins honestly broke my heart a little. It looks great, runs smoothly, but it’s lost what made Dynasty Warriors feel special.\n\n**Bodyguards & Unit Command – The Missing Heart of the Series**\n\nThere’s still no return of bodyguards, one of the best features from the classic games. Even with a full reboot, they didn’t try anything new. No companions, no unit command, no squad mechanics — just your lone fighter cutting through endless crowds.\n\nImagine leading a small squad of archers, infantry, or cavalry that actually fought beside you. That kind of evolution would’ve been perfect for this reboot. Instead, it feels like a step backward into isolation.\n\n**Map Chaos & Busywork – The Headless Chicken Simulator**\n\nAlmost every mission turns into a mad dash to save weak allies. You spend half your time sprinting across massive maps while objectives collapse on the other side. It’s exhausting and repetitive.\n\nWhere’s the strategy? A proper battle map or command system would’ve added real depth — give orders, call in a volley or charge, launch an ambush or fire attack, even trigger mystical weather effects inspired by Romance of the Three Kingdoms. Anything to make the chaos feel smart instead of messy.\n\nInstead, you just chase icons. Over and over.\n\n**Main Character – Too Powerful for His Own Good**\n\nThe main character feels more like a demigod than a soldier. There’s no fear of dying, no thrill in surviving a tough fight. Earlier games made you feel like a warrior in the thick of a war — fragile, desperate, pushing your limits. That tension is gone here, and with it, the excitement.\n\n**Character Variety – From Hundreds to One**\n\nOne of the biggest letdowns is the lack of character choice. No roster, no variety, not even a female option. For a series famous for dozens of playable officers, this is a huge downgrade. A simple character creator would’ve gone a long way to fix it, but they didn’t bother.\n\n**Lost Potential – The Strategy That Never Returned**\n\nWhat hurts most is the wasted potential. I always hoped Dynasty Warriors would blend the tactical depth of Romance of the Three Kingdoms and DW Tactics with the signature action. Instead, they’ve stripped away more strategy with each new game.\n\nI’m still hoping for a Dynasty Warriors 3 remaster to bring back that old magic, but even then, no online co-op for PC feels like another missed chance.\n\n**Final Thoughts:**\nDynasty Warriors: Origins isn’t terrible, it’s just empty. It plays fine and looks fine, but it’s lost its heart and its soul. For veterans of the series, it feels like watching an old friend forget who they are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing the demo when it was released earlier this year, I was skeptical towards this game: combat isn't really that good/ smooth, and KOEI was never really good at storytelling in any previous title. Anyway, I decided to try it since it is on a 25% discount now.\n\nWith 1.5 hours into the game, this are my thoughts as a long time DW & musou fan. It is a fairly weak game despite all the hype and promises. This game is quite a lot weaker than what the demo showed. Playing as a fictional character, the story unfolding so slowly, battles making yellow turban lackeys sidekicks as the main boss of the battle/ map, are not immersive nor interesting at all especially for me who is well-versed in the history/ story. It feels like these relatively minor battles are here to drag on and provide length for game content since the game only covered until Chibi - which is not even half way in the three kingdoms story if we consider Jin as the end so it has relatively few famous events/ battles compared to the whole story.\n\nThe \"world map\" is quite underwhelming, with glitters laying on ground randomly, and a straight forward path I needed to walk, I cant say it is better than DW9's vast and empty map. Combat is also clunky by design, especially the defend/ parry motion - in my opinion as a long time fan the combat for me is way worse than the older dynasty warriors series or musou games.\n\nMaybe it is because I only got the first 1.5 hours down, but the story so far is very disappointing and I am not seeing the \"polish\" this game gives to the roster's character as some reviews say it has. Refunding it before I hit 2 hours mark, for me the game doesn't worth the price even at a 25% discount, and I did not see any sign within that 1.5 hours that things will improve. I might reconsider when it drops further to say, 60% discount or more in future to show support for the series.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just constantly crashes every game.  Cant get past the start of the story.  No patches or anything that can fix.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's just not great. It's okay. The combat is fine but it's a far cry from DW3, DW4, DW5 or even DW7 or DW8. The game is slowed down horribly just by the overworld, having to gather small resources on the map, upkeep relationships and tasks. Older games where that is done quickly in a text menu or a very small map was much more engaging.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's nothing like the other Dynasty Warrior Games at all. It's a solo story driven game, with the same hack and slash mechanics. I personally never played the DW games for the story. I never minded the bad character-acting because I liked being able to play with lots of different characters with their own personalities. The only mode in the game 10 hours in the solo linear story mode where you can only play as one character (although you can change their weapons / fighting style).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So I got this game as a gift, just as an heads up.\r\n\r\nSo DW Origins. As a life long DW enjoeyer (DW2 was one of the first games I ever played), I must say I am quite dissapointed with this one. \r\n\r\nSo let's start with the positive aspects of this game:\r\n1.) The ability to lock your camera on officier (like in a MH game or Souls like) is a great improvement to previous games and improves QoL drastly\r\n2.) The revised combat system is honestly great. Yeah it has some kinks still and I guess they went too hard from the original combat, the overall change is nice.\r\n3.) Soundtrack, while not as hype as older titles, is still very good.\r\n4.) The graphics is quite good. \r\n5.) First game since DW5 where I like the weapons designs again, albeit a bitr bland\r\n\r\nNegatives:\r\n1.) Once again a DW game, where the soldiers are basically just canon fodder and you just kill them because you have to. Still big donwgrade from games like DW2/3\r\n2.) No modes. Like literally none. What the fuck Koei\r\n3.) No weapons. There are 10 weapons and they all feel kinda weird. DW5 had more different swords than this game weapons overall\r\n4.) The model design is worse than probably every other game. The graphic is nice, but damn I don't like the style for most of them\r\n5.) The story is lame. I wanna slay foes on the battlefield and not waste time on an \"open\" world map and useless cutscenes. It feels like I have to sit through 20 minutes of \"story\" for 10 minutes of gameplay\r\n6.) The open world is one very poorly. It's one of those games where you only kinda have an open world, but acutally there is no choice in what you do. It's on railroads\r\n7.) Even thoguh the combat system is nice, the fights feel really samey and boring after a time. You just exhaust the officier to smash a button, rinse and repeat. Despite being more refined, they somehow mmaned to make it more boring then the old more simple style.\r\n8.) The boss fights feel like the temu version of a souls boss. Pretty cringe, I don't want that in my DW.\r\n9.)  Obviously the Non-canon, non customizable player character is thw worst change overall. \r\n10.) Your choices are meaningless, like talk about lazy game design\r\n11.) Giving chaff soldiers hyper armor is such an bad way to make them annoying, instead of fixing the real porblem with the soldiers in the newer games. Just make them like DW2-3 again. \r\n12.) The maps are utter shit, especially the yellow turban ones. Give me a break.\r\n13.) Never were the officiers on your team more useless than in this game. You basically have to babysit them to make it through a match. \r\n14.) The essence mechanic is so bad and frustrating. Just remove this gay shit, makes gameplay tedious and unfun (yes I am talking about the fucking shadow soldiers and the other shit they pull)\r\n15.) Getting KO's doesn't feel satisfiying anymore. I don't feel like a epic hero, but more like Mary Sue\r\n16.) I dislike the new gear system. It's worse than previous games.\r\n17.) There are definitly more things that really bug me about this game, but I can't be arsed to think and write about them but imagine there is more (Like broken and unskippable cutscenes, ....)\r\n\r\n\r\nAll in all the content in this game is miniscule, while the price is high. So it's just not worth it imho. They have to add all the weapons back, make all hereos playable again, add more DW modes and then we might talk about a decent game again. It has potential, but right now it feels more like a very drawn out demo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EVERYTHING loved about previous DW games was stripped away. filled with silly new features like player roaming a map picking up rss and over the top button combos.  so dissapointed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly I cannot believe how good the review is for this game, 91% of dumb ass gamers. It does not even allow you to play as so many other characters and this sucks really really much.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Every other Dynasty Warriors game is straightforward. This game expects you to learn far too many mechanics. If you like playing minigames every battle, then this is the game for you (derogatory).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really overpriced for what it is. \nThe actual combat is great and graphics look nice.\nEverything else? Awful.\nIts locked to one original character they made. This character is mute, has amnesia, and uses meaningless dialogue options to make choices that effect nothing as its all on rails.\nNo quick play / level select to mess around with.\nWeapons are unlocked in a set order. The last weapon type is unlocked by completing the game and there is 10 types total this installment.\nYou increase your characters strength by \"ranking\" up weapon categories. So you're forced to swap type constantly or else you stagnate.\nAs a big middle finger from the developers you can temporarily control a few named characters from the series if they are your officer / support but no way to actually permanently play as someone else. Im sure this will be sold back as DLC",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "The game is fun, but beware, there is a bug where the menu will endlessly scroll and you will not be able to restart from a saved point or select anything. Despite every attempt to resolve the issue, there has been no success. Be prepared to play a 1-2 hour match and lose all progress due to this bug. I have personally lost maybe 20 hours due to it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is great but the random crashes during large battles are just not for me.\nAfter 10 months this issues still persist because devs are too lazy to actually fix their game",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "After a few hours I can say that, whilst the main story battles can be fun, the rest of the game is dull.\n\nMain story missions are often huge battles, and though it's marketed as 1 vs 1000, your allies also have huge armies and can hold their own; they actually advance on the battlefield if their morale is high. This incentivises you to capture bases and aid in battles, which are marked on the minimap, in which allies are struggling; once their morale is high you can leave them to it. Only downside is these battles feel far too quick and too chaotic, each being over not long after starting.\n\nThe rest of the game? The open world nonsense? The side content? Utter trash. Side content involves being tasked to use garbage weapons you don't like and, with them, spam certain attacks and stuff. That's it. To help fulfil these dull as hell side quests, the map is constantly populated with boring minor battles that have nothing to do with anything. I stopped engaging with all side content very, very quickly. It's not fun, it's a chore. Only, I then found myself under levelled for some main story battles, so the game has clearly been designed to force you into doing this crap. \n\nYou also play as a generic young boy, some nameless nobody who is, apparently, someone very special. You can't change how you look outside of replacing one drab robe with another drab robe, which is such a bizarre decision on Koei's part; if you're going to force us to play some generic, fictional hero, at least allow us to decide how they look. The design is very uninspired. This character doesn't speak, and just stands around with a blank expression at all times. Along the way he bumps into equally uninteresting fictional characters, like some young woman, an innkeeper, and some sort of doctor\\herbalist; all poorly made characters with uninspired designs. \n\nThe main battles feel like Dynasty Warriors, and I love how you need to help your allies or risk defeat. Outside of those main battles it feels like the world's worst RPG. \n\nIt's better than Dynasty Warriors 9, but that's not saying much.\n\nDon't buy it at full price, it's really not worth £65; seriously, at £65 it feels less like a Dynasty Warriors epic and more like Koei mugging me in broad daylight.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The Story: You join a party, you win, you leave that party perhaps never to see them again, and then seconds later you rejoin them, win, leaving them to perhaps never see them again.... only to join them again seconds later... so many cut scenes... so many!!! I ended up hitting the skip button and lost interest. \r\n\r\nGameplay: I played the game for nostalgia... and yeah, I enjoyed it... but It's no \"Dynasty Warriors 4\" (Or was it 3?).\r\n\r\nGrind: Having to grind with weapons I do not enjoy was not really enjoyable. I enjoyed trying them out but a prolonged \"Weapon XP grind\" was not great! \r\n\r\nPleasure: The \"mini-missions\" are Tiny!!! It's like \"kill 1 elite and 20 soldiers\" and then you're done, with 5xp (You need 25,000xp)... I'd like to just enter an epic battle at will.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’ve grown up with this series, and Dynasty Warriors: Origins honestly broke my heart a little. It looks great, runs smoothly, but it’s lost what made Dynasty Warriors feel special.\n\n**Bodyguards & Unit Command – The Missing Heart of the Series**\n\nThere’s still no return of bodyguards, one of the best features from the classic games. Even with a full reboot, they didn’t try anything new. No companions, no unit command, no squad mechanics — just your lone fighter cutting through endless crowds.\n\nImagine leading a small squad of archers, infantry, or cavalry that actually fought beside you. That kind of evolution would’ve been perfect for this reboot. Instead, it feels like a step backward into isolation.\n\n**Map Chaos & Busywork – The Headless Chicken Simulator**\n\nAlmost every mission turns into a mad dash to save weak allies. You spend half your time sprinting across massive maps while objectives collapse on the other side. It’s exhausting and repetitive.\n\nWhere’s the strategy? A proper battle map or command system would’ve added real depth — give orders, call in a volley or charge, launch an ambush or fire attack, even trigger mystical weather effects inspired by Romance of the Three Kingdoms. Anything to make the chaos feel smart instead of messy.\n\nInstead, you just chase icons. Over and over.\n\n**Main Character – Too Powerful for His Own Good**\n\nThe main character feels more like a demigod than a soldier. There’s no fear of dying, no thrill in surviving a tough fight. Earlier games made you feel like a warrior in the thick of a war — fragile, desperate, pushing your limits. That tension is gone here, and with it, the excitement.\n\n**Character Variety – From Hundreds to One**\n\nOne of the biggest letdowns is the lack of character choice. No roster, no variety, not even a female option. For a series famous for dozens of playable officers, this is a huge downgrade. A simple character creator would’ve gone a long way to fix it, but they didn’t bother.\n\n**Lost Potential – The Strategy That Never Returned**\n\nWhat hurts most is the wasted potential. I always hoped Dynasty Warriors would blend the tactical depth of Romance of the Three Kingdoms and DW Tactics with the signature action. Instead, they’ve stripped away more strategy with each new game.\n\nI’m still hoping for a Dynasty Warriors 3 remaster to bring back that old magic, but even then, no online co-op for PC feels like another missed chance.\n\n**Final Thoughts:**\nDynasty Warriors: Origins isn’t terrible, it’s just empty. It plays fine and looks fine, but it’s lost its heart and its soul. For veterans of the series, it feels like watching an old friend forget who they are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing the demo when it was released earlier this year, I was skeptical towards this game: combat isn't really that good/ smooth, and KOEI was never really good at storytelling in any previous title. Anyway, I decided to try it since it is on a 25% discount now.\n\nWith 1.5 hours into the game, this are my thoughts as a long time DW & musou fan. It is a fairly weak game despite all the hype and promises. This game is quite a lot weaker than what the demo showed. Playing as a fictional character, the story unfolding so slowly, battles making yellow turban lackeys sidekicks as the main boss of the battle/ map, are not immersive nor interesting at all especially for me who is well-versed in the history/ story. It feels like these relatively minor battles are here to drag on and provide length for game content since the game only covered until Chibi - which is not even half way in the three kingdoms story if we consider Jin as the end so it has relatively few famous events/ battles compared to the whole story.\n\nThe \"world map\" is quite underwhelming, with glitters laying on ground randomly, and a straight forward path I needed to walk, I cant say it is better than DW9's vast and empty map. Combat is also clunky by design, especially the defend/ parry motion - in my opinion as a long time fan the combat for me is way worse than the older dynasty warriors series or musou games.\n\nMaybe it is because I only got the first 1.5 hours down, but the story so far is very disappointing and I am not seeing the \"polish\" this game gives to the roster's character as some reviews say it has. Refunding it before I hit 2 hours mark, for me the game doesn't worth the price even at a 25% discount, and I did not see any sign within that 1.5 hours that things will improve. I might reconsider when it drops further to say, 60% discount or more in future to show support for the series.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just constantly crashes every game.  Cant get past the start of the story.  No patches or anything that can fix.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's just not great. It's okay. The combat is fine but it's a far cry from DW3, DW4, DW5 or even DW7 or DW8. The game is slowed down horribly just by the overworld, having to gather small resources on the map, upkeep relationships and tasks. Older games where that is done quickly in a text menu or a very small map was much more engaging.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's nothing like the other Dynasty Warrior Games at all. It's a solo story driven game, with the same hack and slash mechanics. I personally never played the DW games for the story. I never minded the bad character-acting because I liked being able to play with lots of different characters with their own personalities. The only mode in the game 10 hours in the solo linear story mode where you can only play as one character (although you can change their weapons / fighting style).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So I got this game as a gift, just as an heads up.\r\n\r\nSo DW Origins. As a life long DW enjoeyer (DW2 was one of the first games I ever played), I must say I am quite dissapointed with this one. \r\n\r\nSo let's start with the positive aspects of this game:\r\n1.) The ability to lock your camera on officier (like in a MH game or Souls like) is a great improvement to previous games and improves QoL drastly\r\n2.) The revised combat system is honestly great. Yeah it has some kinks still and I guess they went too hard from the original combat, the overall change is nice.\r\n3.) Soundtrack, while not as hype as older titles, is still very good.\r\n4.) The graphics is quite good. \r\n5.) First game since DW5 where I like the weapons designs again, albeit a bitr bland\r\n\r\nNegatives:\r\n1.) Once again a DW game, where the soldiers are basically just canon fodder and you just kill them because you have to. Still big donwgrade from games like DW2/3\r\n2.) No modes. Like literally none. What the fuck Koei\r\n3.) No weapons. There are 10 weapons and they all feel kinda weird. DW5 had more different swords than this game weapons overall\r\n4.) The model design is worse than probably every other game. The graphic is nice, but damn I don't like the style for most of them\r\n5.) The story is lame. I wanna slay foes on the battlefield and not waste time on an \"open\" world map and useless cutscenes. It feels like I have to sit through 20 minutes of \"story\" for 10 minutes of gameplay\r\n6.) The open world is one very poorly. It's one of those games where you only kinda have an open world, but acutally there is no choice in what you do. It's on railroads\r\n7.) Even thoguh the combat system is nice, the fights feel really samey and boring after a time. You just exhaust the officier to smash a button, rinse and repeat. Despite being more refined, they somehow mmaned to make it more boring then the old more simple style.\r\n8.) The boss fights feel like the temu version of a souls boss. Pretty cringe, I don't want that in my DW.\r\n9.)  Obviously the Non-canon, non customizable player character is thw worst change overall. \r\n10.) Your choices are meaningless, like talk about lazy game design\r\n11.) Giving chaff soldiers hyper armor is such an bad way to make them annoying, instead of fixing the real porblem with the soldiers in the newer games. Just make them like DW2-3 again. \r\n12.) The maps are utter shit, especially the yellow turban ones. Give me a break.\r\n13.) Never were the officiers on your team more useless than in this game. You basically have to babysit them to make it through a match. \r\n14.) The essence mechanic is so bad and frustrating. Just remove this gay shit, makes gameplay tedious and unfun (yes I am talking about the fucking shadow soldiers and the other shit they pull)\r\n15.) Getting KO's doesn't feel satisfiying anymore. I don't feel like a epic hero, but more like Mary Sue\r\n16.) I dislike the new gear system. It's worse than previous games.\r\n17.) There are definitly more things that really bug me about this game, but I can't be arsed to think and write about them but imagine there is more (Like broken and unskippable cutscenes, ....)\r\n\r\n\r\nAll in all the content in this game is miniscule, while the price is high. So it's just not worth it imho. They have to add all the weapons back, make all hereos playable again, add more DW modes and then we might talk about a decent game again. It has potential, but right now it feels more like a very drawn out demo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EVERYTHING loved about previous DW games was stripped away. filled with silly new features like player roaming a map picking up rss and over the top button combos.  so dissapointed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly I cannot believe how good the review is for this game, 91% of dumb ass gamers. It does not even allow you to play as so many other characters and this sucks really really much.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Every other Dynasty Warriors game is straightforward. This game expects you to learn far too many mechanics. If you like playing minigames every battle, then this is the game for you (derogatory).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really overpriced for what it is. \nThe actual combat is great and graphics look nice.\nEverything else? Awful.\nIts locked to one original character they made. This character is mute, has amnesia, and uses meaningless dialogue options to make choices that effect nothing as its all on rails.\nNo quick play / level select to mess around with.\nWeapons are unlocked in a set order. The last weapon type is unlocked by completing the game and there is 10 types total this installment.\nYou increase your characters strength by \"ranking\" up weapon categories. So you're forced to swap type constantly or else you stagnate.\nAs a big middle finger from the developers you can temporarily control a few named characters from the series if they are your officer / support but no way to actually permanently play as someone else. Im sure this will be sold back as DLC",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "The game is fun, but beware, there is a bug where the menu will endlessly scroll and you will not be able to restart from a saved point or select anything. Despite every attempt to resolve the issue, there has been no success. Be prepared to play a 1-2 hour match and lose all progress due to this bug. I have personally lost maybe 20 hours due to it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is great but the random crashes during large battles are just not for me.\nAfter 10 months this issues still persist because devs are too lazy to actually fix their game",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "After a few hours I can say that, whilst the main story battles can be fun, the rest of the game is dull.\n\nMain story missions are often huge battles, and though it's marketed as 1 vs 1000, your allies also have huge armies and can hold their own; they actually advance on the battlefield if their morale is high. This incentivises you to capture bases and aid in battles, which are marked on the minimap, in which allies are struggling; once their morale is high you can leave them to it. Only downside is these battles feel far too quick and too chaotic, each being over not long after starting.\n\nThe rest of the game? The open world nonsense? The side content? Utter trash. Side content involves being tasked to use garbage weapons you don't like and, with them, spam certain attacks and stuff. That's it. To help fulfil these dull as hell side quests, the map is constantly populated with boring minor battles that have nothing to do with anything. I stopped engaging with all side content very, very quickly. It's not fun, it's a chore. Only, I then found myself under levelled for some main story battles, so the game has clearly been designed to force you into doing this crap. \n\nYou also play as a generic young boy, some nameless nobody who is, apparently, someone very special. You can't change how you look outside of replacing one drab robe with another drab robe, which is such a bizarre decision on Koei's part; if you're going to force us to play some generic, fictional hero, at least allow us to decide how they look. The design is very uninspired. This character doesn't speak, and just stands around with a blank expression at all times. Along the way he bumps into equally uninteresting fictional characters, like some young woman, an innkeeper, and some sort of doctor\\herbalist; all poorly made characters with uninspired designs. \n\nThe main battles feel like Dynasty Warriors, and I love how you need to help your allies or risk defeat. Outside of those main battles it feels like the world's worst RPG. \n\nIt's better than Dynasty Warriors 9, but that's not saying much.\n\nDon't buy it at full price, it's really not worth £65; seriously, at £65 it feels less like a Dynasty Warriors epic and more like Koei mugging me in broad daylight.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The Story: You join a party, you win, you leave that party perhaps never to see them again, and then seconds later you rejoin them, win, leaving them to perhaps never see them again.... only to join them again seconds later... so many cut scenes... so many!!! I ended up hitting the skip button and lost interest. \r\n\r\nGameplay: I played the game for nostalgia... and yeah, I enjoyed it... but It's no \"Dynasty Warriors 4\" (Or was it 3?).\r\n\r\nGrind: Having to grind with weapons I do not enjoy was not really enjoyable. I enjoyed trying them out but a prolonged \"Weapon XP grind\" was not great! \r\n\r\nPleasure: The \"mini-missions\" are Tiny!!! It's like \"kill 1 elite and 20 soldiers\" and then you're done, with 5xp (You need 25,000xp)... I'd like to just enter an epic battle at will.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’ve grown up with this series, and Dynasty Warriors: Origins honestly broke my heart a little. It looks great, runs smoothly, but it’s lost what made Dynasty Warriors feel special.\n\n**Bodyguards & Unit Command – The Missing Heart of the Series**\n\nThere’s still no return of bodyguards, one of the best features from the classic games. Even with a full reboot, they didn’t try anything new. No companions, no unit command, no squad mechanics — just your lone fighter cutting through endless crowds.\n\nImagine leading a small squad of archers, infantry, or cavalry that actually fought beside you. That kind of evolution would’ve been perfect for this reboot. Instead, it feels like a step backward into isolation.\n\n**Map Chaos & Busywork – The Headless Chicken Simulator**\n\nAlmost every mission turns into a mad dash to save weak allies. You spend half your time sprinting across massive maps while objectives collapse on the other side. It’s exhausting and repetitive.\n\nWhere’s the strategy? A proper battle map or command system would’ve added real depth — give orders, call in a volley or charge, launch an ambush or fire attack, even trigger mystical weather effects inspired by Romance of the Three Kingdoms. Anything to make the chaos feel smart instead of messy.\n\nInstead, you just chase icons. Over and over.\n\n**Main Character – Too Powerful for His Own Good**\n\nThe main character feels more like a demigod than a soldier. There’s no fear of dying, no thrill in surviving a tough fight. Earlier games made you feel like a warrior in the thick of a war — fragile, desperate, pushing your limits. That tension is gone here, and with it, the excitement.\n\n**Character Variety – From Hundreds to One**\n\nOne of the biggest letdowns is the lack of character choice. No roster, no variety, not even a female option. For a series famous for dozens of playable officers, this is a huge downgrade. A simple character creator would’ve gone a long way to fix it, but they didn’t bother.\n\n**Lost Potential – The Strategy That Never Returned**\n\nWhat hurts most is the wasted potential. I always hoped Dynasty Warriors would blend the tactical depth of Romance of the Three Kingdoms and DW Tactics with the signature action. Instead, they’ve stripped away more strategy with each new game.\n\nI’m still hoping for a Dynasty Warriors 3 remaster to bring back that old magic, but even then, no online co-op for PC feels like another missed chance.\n\n**Final Thoughts:**\nDynasty Warriors: Origins isn’t terrible, it’s just empty. It plays fine and looks fine, but it’s lost its heart and its soul. For veterans of the series, it feels like watching an old friend forget who they are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing the demo when it was released earlier this year, I was skeptical towards this game: combat isn't really that good/ smooth, and KOEI was never really good at storytelling in any previous title. Anyway, I decided to try it since it is on a 25% discount now.\n\nWith 1.5 hours into the game, this are my thoughts as a long time DW & musou fan. It is a fairly weak game despite all the hype and promises. This game is quite a lot weaker than what the demo showed. Playing as a fictional character, the story unfolding so slowly, battles making yellow turban lackeys sidekicks as the main boss of the battle/ map, are not immersive nor interesting at all especially for me who is well-versed in the history/ story. It feels like these relatively minor battles are here to drag on and provide length for game content since the game only covered until Chibi - which is not even half way in the three kingdoms story if we consider Jin as the end so it has relatively few famous events/ battles compared to the whole story.\n\nThe \"world map\" is quite underwhelming, with glitters laying on ground randomly, and a straight forward path I needed to walk, I cant say it is better than DW9's vast and empty map. Combat is also clunky by design, especially the defend/ parry motion - in my opinion as a long time fan the combat for me is way worse than the older dynasty warriors series or musou games.\n\nMaybe it is because I only got the first 1.5 hours down, but the story so far is very disappointing and I am not seeing the \"polish\" this game gives to the roster's character as some reviews say it has. Refunding it before I hit 2 hours mark, for me the game doesn't worth the price even at a 25% discount, and I did not see any sign within that 1.5 hours that things will improve. I might reconsider when it drops further to say, 60% discount or more in future to show support for the series.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}