{
  "positive": [
    {
      "review": "This is still one of the best zombie games you could ever play. The story isn't anything amazing, but there's enough to keep you invested. The gameplay is where Dying Light still holds up pretty well, besides a few janky moments. Mowing down zombies with crafted elemental weapons and parkouring anywhere you want is so damn fun and never gets old. I've played this game 4 times on different platforms and I come back to it every few years. I absolutely recommend it.\n\n𝗛𝗼𝘄𝗲𝘃𝗲𝗿:\n\nI can't recommend playing any of the DLC or expansion pack. HellRaid and The Bozak Horde are incredibly boring and repetitive. It takes the worst aspects of the base game and multiples it by 10. \n\nThe Following is a mixed bag. I want to like it, the story was interesting, but forcing players to drive in a parkour game was an incredibly stupid idea. It's like the map was made for a Halo Warthog, but instead, you're driving a bumper car. The car gets stuck on everything and can't even outrun annoying Virals. The missions are \"Go here, now go there\". The worst kind of padding.\n\nPlay and enjoy the base game.\nSkip the other stuff.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Dying Light is a zombie apocalypse game that completely immerses you in its world. The story is surprisingly strong, pulling you deeper into Harran as you fight to survive. The gameplay shines the brightest, especially the parkour. The world itself has an incredible vibe, from the rooftops to the tense nights\nAnd once you jump into The Following DLC, everything levels up even more.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Dying light has always been a kind of white whale for me. I always liked it, a vast improvement from the deeply flawed but spirited Dead Island, the games core parkour-fight-loot-run system is just a delight and it does a lot perfectly as an open world game. However before I always fell off of it, either feeling like I was falling deeply behind on the economy or just not feeling confident with the game-play late in the slums section. This time however I’m older, braver, and got a lot of dlc.\n\nNow while I have issues with the dlc I will talk about but it really provides a nice boost early game, giving you access to some crafting tools that can really help you get just ahead enough of the economy to feel confident. Speaking of the economy an aspect I loved is that all the looting and scrounging up gear is both fairly quick, and is always rewarding. There will be no point in the game where you will suddenly not need metal parts, so it never ends up feeling like a waste no matter what you find. \n\nAlong with that the base campaign is blessed with a genuinely wonderful pair of maps and side quests. While the main story is pretty vapidly written with both an utterly boring main character combined with an antagonist so evil its impossible to take any scene with him as remotely serious, the side quests often feel charming and even sometimes genuinely compelling. What especially hits with the base game is how hand crafted everything feels. Random encounters usually have unique stories attach to them.  Side quests usually have if not well acted energetically acted scenes to them. The map itself is full of clearly hand crafted touches with its dynamic layout and trap placement. \n\nThis is even more improved as you get more tools like grappling hooks and move onto the absolutely delightful old town map. This massive urban sprawl is a delight to move through and fight through and I genuinely wished I had more to do in it.\n\nWhich moves onto the dlc, frankly, all but the following are massive wastes of time to dig into. Hellraid at least has a bit of story, but the prison almost felt insultingly devoid of purpose. \n\nThen there is the following, an interesting expansion pack in the classic since this time putting you in a massive rural map that is similarly richly designed, but much weaker in terms of mechanics. The buggy is pretty fun, however it can not compare to the parkour now largely relegated to the backseat. Added to that the main story actually takes on a bigger better role, however in turn the side stories suffer dramatically. While the game starts strong, with Ezgi’s side quests being multiple parts (also being low key queer) however ending suddenly with some plot threads just dropped. Other side quests become clear time wasters asking me to gather nails, before then asking to gather fuel, stacking fetch quests on top of each other. \n\nSeveral quests have you dropping things off being told to go away, only to get called to go back and drop more stuff off later. People are weirdly plastic and reverential to the player to in a way that feels so gamey, when in the main campaign you often felt like you were being played as often as you were being a hero.  By the end of the Fallowing I wanted it over, which was not how I felt at the end of the base game, despite that I love both of the games endings in the following, especially the one now made canon where your certainty that you, the action man that can do anything, can just make things happen the way you want. Despite the story of dying light being fully about how rarely things will go the way you hoped.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "great game and very amazing graphics for it's time. The game is very basic you kill zombies and help people throughout  the story",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "jogasso da porra e a experiencia melhora em 100% quando se joga com um irmãozinho que tambem bate punheta",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing game. Well-made mechanics centered around both combat and parkour. Fun story that's is very action-packed (although lacks more emotion in places) and an incredible world to traverse through. I adore this game, and I am happy to have completed it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Nice game, great story but the mechanic of weapon durability couldve been better. I hate when my favorite weapon just broke and i can do nothing but throw that in my stash. Best parkour game ive ever played. Overall 9/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Filled with a bit of OP and weird glitches, but drop kicking covers it all 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing game, Old but Gold.. Played this a few years ago and got back to it again. Still the best",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is such a lovely game, easy to run, nice grapics, the movment is great, 10/10. Would reccomend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is fire, when I mean that I mean this game is the epitome of greatness. Literally this game I've only been playing for maybe only TWENTY SIXE HOURS, but I yet think I haven't reach any point of boredom, although maybe after the story ended. Even then if you get bored, get some mods trust me when you do, you will be having more fun then you can imagine. In conclusion, if I had to rate it out of 100 I would rate it a maybe 90, this game or at least in my opinion is the most funnest game I have played by far on steam, so get it at you own risk when it's not on sale because it's pretty pricey usually, but even if its pricey it will be worth your time and money ECPECIALLY if you get this game on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As tends to be the case with Polish creators whose work becomes a cult classic (be it in the category of music, games or art), the devs themselves probably were not fully aware of what they were cooking until their main effort was concluded.\n\nAnd the final result was quite outstanding. Game holds up well even nowadays and is plenty of fun.\n\nVoice acting is neat, story interesting to a degree, though mostly carried by the characters (Crane in particular), or so I think.\n\nGame is worth picking up on sale without shadow of a doubt, and its mods are quite splendid too. Personally for me, the fan content that makes the game feel harder and nail the survival aspect of the genre, makes the experience all the more rewarding.\n\nI am certain other people have discussed the DLC content, so I shall not comment further.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fast. addicting and thrilling. Reminds me of Far Cry but with parkour.. and zombies.. and without Ubisoft's  greed factor.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely adore the parkour and combat in this game. It is all so satisfying to play and the story, along with the side quests, are fun to play too. Although, I still wish my weapons were tad more durable but I still give it a 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best multiplayer zombie game, with great story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10 years later and the game still got event updates. Peak zombie game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. 10/10 experience with friends. Story could have been a bit better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "S TIER MULTIPLAYER. \n\nOne of the best games for playing with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun game especially with the parkour stuff it's especially fun with multiplayer",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Tall lanky roided up men,arabs,homeless people,small children and such have decided that my non zombified booty is up for grabs, and its open season\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Dead Island + Parkour = Frickin awesome![/h1]\nThis game has everything I liked about the Dead Island franchise (co-op / guns / zombies / exp leveling system) but with parkour added. You can use a GRAPPLING HOOK and it is awesome! There's also free dlc that gives you overpowered weapon recipes. I like that different actions give you exp in different talent trees.\n\nMy only complaint is that the lockpicking is frickin annoying. It functions like Skyrim but the wiggle space is harder to find.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dying Light is one that has been on my list for a very long time. Finally setting some time aside to properly go through it, I had a good time and so I can recommend it. Especially if you like survival horror and want to get into the Dying Light series. Plenty of ways to take on the undead of Harran while you try to make sense of it all.\r\n\r\nIt's a great place to start and remember, the nights are dangerous and full of terrors 😊\r\n\r\nDying Light 2 here we go!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What an amazing ride of a game. It does have some problems and I did suffer for daring to choose Hard for my first playthrough, but it didn't diminish the fun I had with the sprawling worlds, unique zombie encounters and overall experience. Played through it in coop primarily but the time I had alone was almost equally as fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "“Light in the Darkness: How Dying Light Redefined a Genre and Changed My Life”\r\n\r\nThere are moments in every gamer’s life when a game transcends entertainment. It becomes a mirror, a lesson, a refuge — something far greater than a pastime. For me, Dying Light was that revelation. When Techland released this game in 2015, few could have predicted the cultural ripple it would leave behind. What seemed at first like another entry in the oversaturated zombie genre evolved into something that redefined not just open-world survival horror, but also the emotional connection a player could have with a virtual world. To me, Dying Light wasn’t just a game — it was a chapter of my life that illuminated what it means to survive, adapt, and find meaning in a world that feels broken.\r\n\r\nA New Dawn for the Zombie Genre\r\n\r\nBefore Dying Light, zombie games had fallen into a predictable rhythm — hordes of the undead, resource management, and maybe a moral choice or two scattered between waves of chaos. The genre had stagnated. But Dying Light shattered that mold by introducing an element that was both literal and poetic: movement. For the first time, survival wasn’t about standing your ground — it was about flowing, climbing, leaping, and escaping. Parkour became the language of resistance, a way to turn fear into freedom.\r\n\r\nRunning across the rooftops of Harran, with the sun dipping below the horizon and the haunting call of the night falling over the city, I felt a kind of urgency I had never felt in a game before. The day-night cycle wasn’t just a mechanic — it was a psychological transformation. Daytime gave me courage; nighttime tested my soul. When the Volatiles came out, I wasn’t just afraid of losing a mission — I was afraid of dying. Every sprint, every jump, every heartbeat was a small story of defiance against the inevitable.\r\n\r\nIn that way, Dying Light redefined what a survival game could be. It wasn’t about overpowering the world — it was about living within it, respecting its dangers, and learning to dance on the edge between terror and triumph.\r\n\r\nThe City That Breathed\r\n\r\nHarran was unlike any open-world city before it. It wasn’t just a backdrop; it was a living organism. The cracks in the walls, the flicker of neon lights, the cries of survivors echoing down empty streets — all of it created a kind of melancholy beauty. It was a world in ruin, but not without hope.\r\n\r\nEvery corner of Harran told a story — the graffiti scrawled on a rooftop, the half-finished notes left behind by desperate families, the hauntingly quiet interiors of homes once filled with laughter. Techland managed to make decay beautiful, and in doing so, they turned exploration into emotional archaeology.\r\n\r\nWhen I first scaled the antenna tower and looked out over the city, a quiet realization hit me: this wasn’t just about surviving the apocalypse — it was about bearing witness to it. Harran’s tragedy was my own, because in that desolate city, I saw reflections of real life — the moments when everything feels like it’s collapsing, when the world outside feels hostile, and when the only thing you can do is keep moving forward.\r\n\r\nA Story About Humanity, Not Just Survival\r\n\r\nAt its core, Dying Light wasn’t a story about zombies. It was a story about people — flawed, frightened, and fiercely hopeful. Kyle Crane, the protagonist, wasn’t a superhuman savior. He was a man torn between duty and conscience, between following orders and doing what’s right. His journey mirrored the moral grayness of the world itself.\r\n\r\nThe game asked questions that lingered long after I turned off the screen. How far would you go to survive? What do you owe others when survival becomes personal? Is redemption possible when the world has already burned?\r\n\r\nRais, the charismatic and ruthless antagonist, embodied the seductive pull of control in a world where control is a fantasy. Meanwhile, characters like Jade, Brecken, and Rahim reminded me that heroism often hides in everyday acts of courage. When Rahim’s fate unfolded — one of the game’s most gut-wrenching moments — I felt something that few games ever evoke: grief. Not because I had lost a quest-giver or ally, but because I had lost a friend.\r\n\r\nHow It Changed Me\r\n\r\nI played Dying Light during a time when I felt trapped in my own version of Harran. My life was filled with uncertainty — personal struggles, anxiety about the future, and a sense that I was constantly running from something I couldn’t name. But as strange as it sounds, Dying Light became a kind of therapy.\r\n\r\nWhen I sprinted through the streets of Harran, chased by monsters, my fear mirrored my own life’s chaos — but unlike in reality, I had control. I could fight, run, climb, and survive. The game reminded me that even when everything feels lost, movement is power. As Crane fought for hope in a collapsing world, I found the courage to do the same in mine.\r\n\r\nEvery rooftop leap was a small victory, every sunrise in-game a reminder that darkness never lasts forever. I began to see my challenges differently — not as obstacles, but as parkour routes, things to climb over, not surrender to.\r\n\r\nDying Light taught me resilience. It taught me that fear isn’t a signal to stop — it’s a signal to move. It showed me that even in a world that seems beyond saving, there’s still beauty, still connection, still something worth fighting for.\r\n\r\nLegacy of a Classic\r\n\r\nTen years later, Dying Light still stands tall, not just as a game, but as a cultural landmark. Its DNA can be seen in countless successors — from open-world parkour systems to dynamic night mechanics — yet none have captured its unique balance of terror, freedom, and humanity.\r\n\r\nThe community it built remains fiercely loyal. Even after Dying Light 2 and years of new titles, players still return to Harran, to the sound of its wind, the pulse of its chase music, and the thrill of surviving another night. Techland didn’t just make a game — they created a world that refuses to die, a fitting irony for a game about the undead.\r\n\r\nAnd for me, Dying Light remains a symbol — a reminder that even when the world feels overrun by darkness, there’s always a way forward. You just have to keep running.\r\n\r\nConclusion: Finding the Light\r\n\r\nLooking back, I realize that Dying Light changed my life because it gave meaning to struggle. It made fear something beautiful, something to be respected rather than avoided. It taught me to value every sunrise, every fleeting moment of peace, because I had fought through the night to reach it.\r\n\r\nGames come and go, but some leave scars — the good kind, the kind that remind you you’ve lived. Dying Light is one of those rare creations that blurs the line between game and life, between digital survival and emotional rebirth.\r\n\r\nIt is, and always will be, more than a game to me. It’s a story about learning to run toward the light, even when everything around you is falling apart. And every time I hear that haunting chase music, every time I see the skyline of Harran in my mind, I remember: I survived.\r\n\r\nBecause that’s what Dying Light taught me — that survival is not just about escaping the dark. It’s about finding your light within it.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "s tier coop c. one of the most addictive games to play with your friends",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun to play, especially with your friends, or at least I guess so cause my friends don't play on Steam t(T -T)t FUCK THEM!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Crafting and fighting mechanics is great. story and characters are mid af.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "> Runs exceptionally well on old hardware. \n> Open world\n> Grindy skill tree\n> Co-Op Campaign (when's the last time you saw that in a game?)\n> LAN and Steam multiplayer compatibility\n\nYep, I'd say we're in business for a good long while.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly a perfect game. The most unique zombie game I've ever played and possibly the most fun zombie game I've ever played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Never thought I'd be playing this game on the bus. Runs great at 18 watts on Asus ROG ally z1x",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played on Nintendo switch and it was still so goated for the time so much to do fun parkour and fun combat guns be op but nice dlc is awesome and made me play both dl2 (Xbox) and dltb (pc) when they came out this game is a masterpiece",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "el mejor juego de steam lejos como carajo salio hace 10 años inentendible o no memon??????\nmejor que toda la reverendisima mierda que hay en steam ex plataforma\ntormenteando un hall\nque entras a mi perfil pa?\nte puse una?\n[ARG] t1nch0TAPZin⭐⭐⭐\ncupp",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun game, there's lots of garbage mission-system for multiplayer that should be reworked. For instance, why are my teams not getting points for doing the story line? This is truly stupid as one person climbs the ladder, nobody wants to sit there and go back and forth climbing the ranks. This is a stupid move on the devs part and they're retarded if they don't fix it.\n\nOther than that the game is fun, but also filled with cheaters when it comes to the \"be the zombie\" mode. That's all these lowlifes have to look forward to is a pathetic round of cheating like basement dwelling losers.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of the most iconic, influential and fun zombie games to every be made. It's an excellent game with friends and solo. The crafting system is also extremely good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it was a preatty good game but i cant play it now cuz some ass error showin up. hope it doesnt happen to u",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10 years old game that still holds up to today's standards. \r\n\r\nDying Light was truely ahead of its time. So much better than the sequel in every way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing and great game, Much better that DYING LIGHT 2, that game was a real crap, I hope u fix it giving the combat system of this dying light.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game took me a long time to play it but love it so far playing on normal next playthrough will be nightmare then I will be playing Dying Light 2 and The Beast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story mode, nothing but fun and challenge!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most old games age like a phone battery, poorly. But Dying Light? No way. This game has aged like an expensive wine I definitely can’t afford. The graphics and lighting are so good that sometimes I stop playing just to ask myself, “Is this really from 2015 or is Steam lying to me?” The parkour is so smooth it makes me want to climb buildings too… but the closest I get is missing a step on the stairs. Gameplay? Amazing. Zombies? They scream louder than my neighbors when I vacuum at 7 AM. Experience? Worth every second. Conclusion: Dying Light has aged better than most people I know. I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 game I always wanted to play this as a kid and now years later this game did not disappointed my expectations",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A simple, fun, and slightly scary game. It’s much more enjoyable when played with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is worth the $25 to be honest i thought it should have been $40. The game has amazing graphics, good story and every character has there own backstory and personality. i played for 9 hours straight and didn't get bored but also only progressed 19%, so there is plenty to do. i like that there is crafting, a looting aspect, and open world. This game is a MUST PLAY. This game is a 10/10 and i never make a review on a game if it is really good or really bad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kyle Crane is stupid for jumping off the wall when i want to do some parkour. This game is peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very fun and cool game. I can recommend to enybody who love to play horror, story and adventure games. It has a cool storyline. For me, this game is a 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far the second best open world game ive played and I didnt even started the dlc yet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This Game is really good I like the Haiden and the combat as well the music slaps the main menu music Is the best IMO and the story is really good great game from 2017 would recommend this to people that like games like the Last Of Us (FYI Haiden means the thing where you hop from building to building doing tricks and climbing i put Haiden Because i don't remember how to spell the world)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you ever need a zombie game that has good gore and combat, as well as a good sense of horror Dying Light is your game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Very Good\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm  \n☐ Very good\n☐ Good\n☐Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☑ Long if you count DLC\n☐To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☑ If it's on sale easily by the whole game and DLC for 75% off\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10\n\nDying Light 1 is one of the best zombie games of all time. Its parkour is amazing and adds a unique feel to the gameplay that its successor Dead Island lacked. Lobby music is so amazing and nostalgic. Main game was a blast while the Following DLC was good but lacked the parkour aspect of the main game. Buggy is nice and after playing Dying Light the Beast it is way better than the truck. DLC is good but not worth the $49.99 price tag, so I recommend buying it when its on sale. Characters are mostly bland besides Crane and a few main side characters. Overall this game is great game to play alone or with friends. Highly recommend picking it up when it goes on sale and buying the bundle that includes the DLC. Good night and good luck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "primeiro jogo que eu baixei pirata na vida, lendario, zumbis burros, zumbis fortes, zumbis inteligentes, zumbis, uns cabra doido, e umas conversas nada ve, e um final de batalha epico, é foda, pena que as dlc e os adicionais do game cagaram ele, mas a base e a historia é foda",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best zombie game i ever played it gave ma a bit of a spook but if you want a good horror game this is the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dying Light is absolutely one of my favorite games. The gameplay, environmental storytelling, and atmosphere are top notch. The main story is fine enough, but what you're really there for is the parkour and combat. There is nothing more satisfying than drop kicking a zombie off a building. The parkour mechanics can be a little janky. Sometimes Crane will climb through a solid wall. Other times, he can't even grab a simple rock ledge. But overall, climbing and jumping on every surface you see is fun as heck. It's also a great game to co-op with.\n\nAnd, you know, Roger Craig Smith is in it.  🪨 👊",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dying Light is straight up a blast, especially with friends. The parkour feels smooth, the combat hits hard, and running around at night keeps the tension high. Co op makes everything 10 times better, from messing around on rooftops to taking down hordes. If you want a zombie game that actually feels alive and fun to replay, this is it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best open world games of all time. \r\nBest parkour game\r\nBest zombie game\r\nBest melee combat hit reactions in a game\r\n\r\nDying Light really overperformed in a ton of ways. The sequel stumbled but is decent. The OG here is really one of the best games from its generation. If you don't have this is your library but like the genre, you're missing out on a great one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect zombie game. litterly in my top 3 of all games ive ever played. worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great in 2025!\r\n\r\n10/10 across the board.\r\n\r\nPurchased it here because I finally moved to PC from console. Graphics are so much better on console in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dying light is a great game with a good mix of parkour and zombies but compared to dying the environment in this game does not feel good also the addition of guns kinda downgraded the experience for new players atleast in the beginning of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after 10 long years, this game can still compete with titans of the gaming industry",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hate screamers, I fear volatiles, and am traumatized from a goon turning into a viral. But I still love this game. 100% worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came back 9 years after my first playthrough to play with friends, game is still as good as I remember.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's parkour and zombies so the idea off the bat is fun.  Some of the epic moments are pretty damn epic, and other times...not so much.  Now there are a LOT more cons vs pros here, but it's a game you hate to love.  Sidenote, this was played on the Hard difficulty\r\n\r\n[h3]Pros[/h3]\r\n--You can really feel the progress as you lvl up.  There are break points were things get easier, more stamina, run smoother and faster\r\n--The tools you get are very useful, even if you need to stay on top of looting to continue making them\r\n--Not many games actually stick with me in world design.  Once you know the area a bit, running around and being a general menace becomes a lot easier.\r\n--Having enemies that can clearly kick your ass, but you can kill is a good design choice for any game.  Though I wish it was more of a skill thing and not a cheese thing cause these guys can one to two tap you easy.\r\n\r\n[h3]Cons[/h3]\r\n--Oh boy, where to start.  So you have to farm a bit to actually get a few lvls to be able to actually fight.  There are insta kill stuff, namely spikes early, that you just need to kick zombies into to farm exp.  Once you get the stun kill and drop kick, you should be good to start the actual game\r\n--I might just be dumb in some areas, but damn man, you do get a basic info dump as you get new things to do, but it honestly did not help me.  Go watch one of those '10 things I wish I knew' youtube vids on this.\r\n--The sound design needs a bit of a rework.  If anything is behind you, you don't hear shit.  There are runners that do nothing but SCREAM and run to do a dick waffling ton of damage.  You do hear a distant scream as they are attracted to loud sounds as a que to let you know they are coming, but unless you are facing their general direction, they will get free damage on you.  \r\n--There are 4 areas to lvl up in.  Strength is killin shit, Agility is parkour and some exp on kills like using traps, Survival is helping npcs in the game in various ways, and Legend is max lvl stuff.  Once a stat is maxed at 25, all exp from it goes to Legend which is just the player picking a dmg bonus to a weapon type.  You lose survival exp and legend exp if you die, and there are cheap deaths aplenty.  I swear some of these bastards get a random dmg buff and just two tap you.\r\n--Fighting other humans sucks.  I can swing my weapon, sidestep, and flinch to a stiff breeze.  These [b]motherf#($ers[/b] can block, power through your attacks like nothing, and much like the zombies, are just tanks.  You do get a shield as a tool later, but still, a parry would have been nice.  Not even a dropkick ruffles these guys much.  Just set them on fire and move on.\r\n--Later on, once you have reached badasshood and have some weapons doing like 1500 dmg at max lvl, you still cannot carve through a horde.  Other then the weaker zombies and runners, they will be the only things you can oneshot with a weapon, and the heavy zombies just flinch into your attack to try and shield their head and get a hit on you.  That felt a little disappointing.  I'm aware that if I just grinded exp and say put my Legend points into one weapon, I likely could go horde clearing, but at that point it feels like a missed opportunity. \r\n-----And my biggest and actual disappointments with this game are two boss fights later in the game.  One guy is just a tank and you have to fight him at a handicap.  Then the last one [spoiler] is the big bad.  It's not a boss fight, but a quick time event fight they I cant even really enjoy due to it being both shit, and you know, having to hit the right buttons [/spoiler]\r\n--I never did co op, but it was probably crap.  Def has a lot of achievements in with it so good luck making this a 100% game\r\n\r\nOverall, play it, but go in with a grain of salt and for real, watch one of those 'I wish I knew before I started' vids on this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Might genuinely be one of my most favorite zombie games ever. From the smooth parkour, to the satisfying physics, brutal gore, impressive graphics, and fun mechanics, I consider this to be a game worth your time. Especially since this game goes on sale sometimes down to like 5 bucks. The only thing I'm really iffy about is the story, it's not the greatest but the fun gameplay really overshadows it for me. Definitely a must buy for anyone who hasn't tried it out yet!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is peak!!! Dying light has peak gameplay that will keep you playing for hours and it gets better when you're playing coop with a friend. The definitive 10th anniversary edition has so many great DLC's and weapons, designs etc etc! I recommend buying the definitive edition for the full content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ABSOLUTE CINEMA. Ok maybe that might just be me, but this game has aged like a fine wine. That's all I can say. If you like parkour, dropkicking zombies into different dimensions, and slicing zombies' heads off, then this is the game for you. The game is just overall really good, and has gotten so much content and still does to this day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pesar de los años, sigue siendo un juegazo, recomendable en dificultades altas para que aprietes el culo y sientas un buen susto",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly i love Dying Light more than any other game and will keep trying to hit 5000 hours until i cant no more. the game is amazing and the parkour is fun also smashing zombies with a modified baseball bat that causes eletricity is amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the games parkour is very good and fun, the combat is very good harder on hard or nightmare mode but also easy if you know what your doing and playing smart. I've played this game longer than 4 hours an can easily say yes to buy this game if it's right up your alley",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man this game has the most unique eerie, creepy, nostalgic vibe. And the zombie killing is really realistic and satisfying. Sometimes I just ran from rooftop to rooftop doing nothing just killing zombies. Night time gets really creepy sometimes. Just pure black sky. The most vicious zombies at night (can't remember the exact in-game name) have a really tiny field of view so you can dodge them easily. \r\nAnd the soundtrack is just the best of them all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First-person action survival game set in a post-apocalyptic open world overrun by flesh-hungry zombies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Creative brutality indeed. Wow, what an experience!\n\nFriends of mine recommended this game to me (and with good reason) some years ago, and the experience did not disappoint. Dying Light has brilliant elements of parkour, zombies, first person action, horror, suspense and a great storyline to match.\n\nThere's also an infinite number of weapons you can find (and later customise and improve) to have fun chopping up the undead.  Not to mention if you obtain the \"The Following\" expansion, you can go even farther with vehicular action which adds even more fun to this already fantastic game.\n\nIf you find it on sale, I'd highly recommend adding it to your Steam library!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, good parkour nice fighting overall experience 9/10 i would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with alot of zombies and doing diffrent quests and running at night while bing hunted ny the zombies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best game if u want a game with story and battle and adrenaline i reccomend 10000%",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game since a couple years ago (yeah I cracked it LMAO) and honestly its still pretty good. u should give it a try, especially if its on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever you should 100% download this the story is very good and graphics are the best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Zombie Game ever made. Revolutionary first person perspective parkour and ragdoll physics. Has also aged really well, still looks great 10 years later.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A 10 year old game (at this point in 2025) that is better than most current releases. If you like the idea of parkour running and dead island style crafting with 4 friends..... this game wins.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AWESOME game, kyle crane is awesome and I love fist fighting zombies!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like if edgerunner cyberpunk projectzomboid all fucked the same girl and this was the baby",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm playing this for the first time, and only have 36 hours in it. So far, the story and the world are decent and it runs smooth on a 4070 Super @ 4k. In game vsync doesn't work, had to force it in vNvidia control panel.\n\nActual gameplay... The combat is not very good. All they give you are melee weapons at the start, and they're all ineffective. The enemies take multiple hits to take down. It's doesn't start as an action zombie game, it's an avoid the zombies game for hours until you get something useful that can actually kill them. You'll need to stay on rooftops hoping to actually find something useful. Side missions are extremely important, as you'll never level up enough to get enough good equipment to be effective without them. The game does get better, if you have the patience. Get the crossbow as soon as you can. It's extremely accurate and takes out most low level zombies with a head shot. Makes short work of the human enemies too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐  Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☐ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Bad story\r\n☐ Average\r\n☑ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑  If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑  Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best zombie games I've ever played, Great story, Great Combat, and art style.\nThe multiplayer is great too. Have yet to play both Dying light 2 and the beast but cant wait to play them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the murder and zombies and i mean its a good game its fun to play with friends if your playing alone just know its fun with other people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, great graphics for its time, fluid gameplay, plus I love the ragdoll physics. Its by far one of my favorite games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game with a friend and had a blast dropkicking zombies. Can't wait to play the newest game when I get the money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was amazing, and is even more fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game with a unique skill tree, good story and movement.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my favorite game...... i have a lot fun memory with this game and my best friend side by side",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Parkour, zombies, and night‑time terror blend seamlessly in this open-world action game. Fluid movement, satisfying combat, and a dynamic world make every playthrough a thrill.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buy far one of the best zombie games out there and it's been over ten years and still this games dominates the zombie genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dying Light — Review by JesterVince\n\nStory: 9/10\nGameplay: 11/10\nGraphics: 9/10\nSound & Atmosphere: 10/10\nDifficulty: Challenging\n\nOverall Thoughts:\nDying Light is one of the most enjoyable open-world zombie games I’ve played. The story keeps you interested, but the gameplay is the real star. The parkour and combat are smooth, intense, and satisfying, especially once you get used to movement and timing.\n\nThe world looks great, and the atmosphere completely shifts at night — that’s when the real challenge hits. The sound design adds even more tension, especially when Volatiles start hunting you. It all creates a fun but challenging experience that always keeps you alert.\n\nFinal Verdict:\nOne of the best zombie action games out there — definitely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best zombie games of 2015 still lives up to the hype nowadays \n\n7.0/10 makes u scared of the zombies unlike other titles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DYING LIGHT\nI remember the first time I was playing Dying Light. I could see that this game was made with heart and soul. Dying Light is truly \"unique\"; there is no other game that offers what DL offers. An unbelievable mix of parkour and survival horror. We'll start at the beginning. Dying Light is a first-person survival horror game. And on top of that, it is also an open-world and a zombie game. Reading that, you might think it's a dream, but it's a real game.\n\nSTORY\nThe main character is Kyle Crane. He is a special agent of the Global Relief Effort (GRE) with the mission to retrieve a file from our antagonist: Kadir Suleiman, better known as Rais.\n\nRais is located in Harran, the city where the game takes place. He stole the file, which is very important for stopping the virus, from the GRE. Meanwhile, Harran is under quarantine because of a virus that was synthesized in a GRE laboratory.\n\nThe GRE wants to retrieve all these files before Rais uploads them to the internet and makes the situation even worse.\n\nMaking of the masterpiece\nBy playing the game further, we see deeply developed characters with their own personalities and their views on the protagonist, Kyle Crane. For example, if we help some people by finding someone's glasses, they will tell others about it and say how good Kyle Crane is.\n\nThis is remarkable for a game made in 2014 by the Polish game studio Techland, with a budget of $40 to $70 million. You might say, \"Wow, that's a lot,\" but to make such a large and open game entirely from scratch, as DL did, it's little. After all, you have to consider writers and voice actors.\n\nSpeaking of voice actors: Roger Craig Smith absolutely performed a miracle with his voice acting. You truly feel that Kyle Crane is a real person with emotions.\n\nDid I mention how good the parkour is in that game? It's so good because they used Motion Capture (MoCap) for the parkour. This involved placing special markers on a real person, tracking this, and inputting it into the PC. Now, this might not be surprising, but in 2014, it was genuinely surprising. The person who performed all the tricks in the game is David Belle, a parkour legend.\n\nThe director of Dying Light, Adrian Ciszewski, absolutely did his best to assemble such a team for such a project.\n\nThe atmosphere the game has received is also incredible. By just listening to the soundtrack for 5 seconds, you realize it's the end of the world. My favorite track is 'Horizon', made by Paweł Błaszczak, a beautiful musician.\n\nThe environment also contributes to the atmosphere. Dying Light does that very well. You see how the apocalypse took place: clothing on the floor in rooms because people were in a hurry, blockades on the roads. It is a real apocalypse; it is fantastic.\n\nDying Light is available on Steam, PlayStation Store, Nintendo eShop, Xbox, and other platforms.\n\nGAMEPLAY\nYou can do several things in DL, but there are two main elements: 1) parkour and 2) fighting, especially with zombies. To do this better, you must learn various skills, such as the 'drop kick' and other abilities.\n\nThere are also a lot of weapons. If you count every unique combination of a weapon type and rarity, you quickly reach over 300 different weapons in the game. From a radiator pipe to a professional machete. There are also firearms like pistols and rifles, and even bows and crossbows. You might say: why would you need that against ordinary, dumb zombies? But in DL, there are also mutants, a completely different type of zombie that are very difficult to kill. The strongest are the Volatiles. They are truly almost unbeatable, especially on the Nightmare difficulty. Additionally, the open world is very large.\n\nWhat is also very important is that it is not just large, but also filled. In DL, the world is filled to the maximum with all sorts of incidents. For example, you have to protect people from zombies or look for plants for medicine. You can end up in all kinds of situations: an ambush on the road or bandits who have captured people. You have the choice: help or not. You can genuinely do a lot in that game. Dying Light's calling card is the night. At night, everything gets ten times worse. You can barely see anything because it's dark, and the zombies are MUCH stronger. At night, they start running faster than the player. And coincidentally, Volatiles only come out at night. Of course, that's no coincidence! Volatiles are afraid of UV light, so the player carries a UV flashlight, or must survive until the sun comes up. So you can understand what that means for the player.\n\nThat is genuinely a challenge.\n\nCONCLUSION\nDying Light is my favorite game, and I think it's the best I've ever played. I have truly played many games; I have a total of 210 hours in Dying Light on console and on PC.\n\nIn Dying Light, I did everything you could possibly do. I bought all the games in the series, and they are not worse than the first, but DL1 remains the classic for me.\n\nAnd I strongly recommend playing it.\n\nAnd after that, I can safely say that it is certainly:\n\n10/10\n\nAmbient 10/10\n\nGameplay 10/10\n\nStory 10/10\n\nSoundtrack 10/10\n\nAtmosphere 10/10\n\nGOOD LUCK AND GOOD NIGHT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best zombie game I have ever played (I played on xbox so I have low hours on steam as of writing) and I have only heard that the beast is better then it. this game is a masterpiece and I cant wait to experience Dying Light the Beast. This is a must play for horror and zombie fans.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is actual peak I run it at 4k around 100fps at high settings visually it holds up really well and as my 1st time playing through the game and the story is insane so far....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "will always be a open world classic. they took what was great about dead island but made it better and made a hell of story. as a bonus has everyones fav voice actor Roger Craig Smith from such roles as sonic/chris redfield/the MC of this game and more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dying Light has always been a classic for me and to still see this game get love is amazing to see. Always would recommend this to anyone I know that loves parkour, killing zombies in fun/unique ways, enjoying stealth mechanics or adrenaline rushing chases, or even teaming up with friends in CO-OP or going against friends as the Night Hunter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best zombie games ever made. It's 10 years old and still gets occasional updates. Every weapon type is fun to use except a couple. The blood and gore are satisfying. The main story is not the greatest but it serves it's purpose, and the side missions are interesting. The Following dlc has a great deal of content added and the buggy is good fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it didnn't take even a day to beat it but it was super fun and the story is peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, really.\r\ndifficult at times. quick tip, DONT USE ANY GUNS. you WILL get attention, and you do NOT have enough ammo to take them all down. only use it if you have no other choice and running is an option. if you've gotta use a gun, make sure it's one per zombie.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I was absolutley loving this game, was gonna give it a great reveiw until i realized you are forced to rebuy all other dlcs and bundles just for ONE (the main) DLC campaign, Instead of being able to buy it sepretly like everything else. \n\nVery scummy thing to do. \n\nThese are all i own yet still forces me to rebuy all of them just to accsess dlc - \nDying Light - Cuisine & Cargo\nDying Light - The Bozak Horde\nDying Light - Ultimate Survivor Bundle\nDying Light - Harran Ranger Bundle\nDying Light - Gun Psycho Bundle\nDying Light - Volatile Hunter Bundle\nDying Light - Retrowave Bundle\nDying Light - Shu Warrior Bundle\nDying Light - 5th Anniversary Bundle\nDying Light - Snow Ops Bundle\nDying Light - 10th Anniversary Bundle",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Decent game but with a lot of horrible screen effects, blurring when running, way too much post processing and other ugly annoyances.\n\nMain reason for the downvote though is the absolute gall of Techland forcing updates that advertise their new Dying Light Beast game at you, force a video with the extremely average voice actor from the first game, make you click through a bunch of ‘buy now’ screens just to get back to the game you bought ten years ago.\n\nSeriously, this sort of crap makes me never want to give them another cent. It’s so obnoxious and shows how much contempt they have for their customers.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Look, I've just bought the game.  I'm sure it's going to be great, comes highly recommended, etc. etc. but that's no excuse for sticking me into a bunch of adverts for your latest game the first time I launch it.  I definitely don't need a video from one of the developers talking about how \"we've all been waiting for this\".  I haven't - I'm still waiting to play the bloody game I just paid for.  More importantly, you immediately start talking about specific characters.  Opening right up with a spoiler for there being no risk for this character then?  Thanks for that.\n\nBad practice gets bad review.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great visual, great city. But melee system sucks - no damage, no durability and yet the most amount of customization on those weapons and cool designs that you hate not to enjoy for at least 10 minutes of using them because weapon can last from minute to maybe 5 minutes with few repairs that you can't buy or expand anyhow and you get limited to the amount you get when you either craft, loot from very few zombies that cary any weapon in the first place or buy the weapon with money you have nothing to spend on anyway. There are systems inside the game that could make parkour more enjoyable outside parkour challenges but instead the most enjoyable part of the game is locked. You hear about yourself being absolute legend of runner before you even know how to climb a single roof.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really tried to give this game a chance, but it's just incredibly boring. It doesn’t meet my expectations at all.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Dying Light is an awesome game. Extraction though... \n\nThe last mission is headache inducing and when you die, you respawn. You DO NOT reload/restart. That means that you will use all your ammo, items, consumables etc. \n\nA simple reload from the start would have been nice. Once I ran out of flares after falling to my death as my arms and legs graphically sailed past a grabbable platform... I uninstalled and am working to prevent this game from getting Overwhelmingly Positive instead.\n\nWhy in the @#$! does it not restart from the a checkpoint but instead respawn you, minus the items you used in that attempt. A massively irritating, shitty thing to do to an otherwise super fun game. I refuse to beat the game and will take pleasure in the down vote as my win instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this games fun with friend and i had a great time,  the end you go solo and it sucks balls ruins the co-op experience. only fun part was running and fighting zombies with my homie.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "5/10. It's not bad, it's just not good. Some terrible control mechanics with the parkour stuff and combat. Also, I finally got a good weapon, which was killing zombies good...for about 5 minutes. Then, I got a vasty superior golden weapon, while also maxing out my stats, yet I am getting killed more than I was at the start of the game. \r\n\r\nI've been playing on Nightmare from the start. It'd be nice for my slog to be worthwhile, to go from zombie fodder to zombie slayer, but the zombies seem to have been working out and taking steriods while the game progressed, and are now they are tougher than at the start of the game (talking the bog standard zombie, here). Make it make sense. Could be a good game, if it wasn't for these bogus flaws.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the story is boring, the quests are repetitive, the open world is empty, the achievements are tedious. the only good thing is the parkouring, but for that i even prefer mirror's edge, which is a more streamlined experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not install game. It’s a piece of trash. Literally corrupted my pc and I had to reinstall windows to fix in order to fix.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What a terrible waste. This POS game spawns you wherever the hell it wants when you die, so you will end up running across the map just to freaking die again. I die because of explosions, not the zombies. The parkour challenges are crap and I can't even change the jump button scheme to a freaking normal one. It's just a crap single player experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not a game, this is the developers' excrement.\nI wanted to describe all the problems and nuances in detail at first, but I realized that this game is not worth a single letter, so everything written above is just a Gift.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dying Light 1 это игра, которая обещает адреналин и свободу, а на деле превращает тебя в профессионального падальщика с высот. Ты вроде бы мастер паркура, но персонаж то хватает невидимый воздух, то игнорирует огромный выступ прямо перед лицом. В итоге ты летишь головой вниз в толпу зомби, а игра смотрит на тебя с довольной ухмылкой.\r\n\r\nСюжет выглядит как найденная в шкафу школьная тетрадь с клишированным фанфиком о зомби апокалипсисе. Персонажи либо орут, либо драматизируют, либо орут что драматизируют. Каждый диалог звучит так, будто актерам платили за количество пафоса, а не за смысл.\r\n\r\nЗомби днем ведут себя как мебель с глазами, а ночью внезапно становятся чемпионами мира по бегу. Они несутся за тобой так, будто ты украл их семейный ужин. Самое смешное, что игра любит спавнить их прямо у тебя перед носом просто чтобы напомнить кто здесь главный.\r\n\r\nЛут это отдельная боль. Ты открываешь контейнер с надеждой, а там очередная ржавая железяка, которой стыдно махать даже в воздухе. Проходит десять часов, а уровень оружия до сих пор ощущается как будто ты дерешься кухонной ложкой.\r\n\r\nВ итоге получается красивый, атмосферный и абсолютно раздражающий хаос. Игра могла быть шедевром, но вместо этого превращается в марафон по граблям. После нескольких часов начинаешь понимать зомби, они тоже, наверное, устали от всего этого ужаса.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is unnecessarily difficult.  I love a good challenge, but after 41 hours, I have barely made any progress on the easiest mode.  Not fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "even when starting out with good craftable gear due to the dlc stuff, i keep dying in some missions, even normal zombies take too long to kill and are in mass, and this is usually during night or missions be night, so virals come around and are everywhere and i cant deal with the masses of regular zombies unless i take a long time avoiding volitiles, but evn then itll become night time before i even make any permanent progress. maybe im playing it wrong, but its not for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay in this game was amazing and very fun but the story on the other hand lacks a lot of depth and was very underwhelming, I'm not normally a guy that needs a great story to enjoy a game but when you want to dive into the story and it under delivers it makes the whole experience less enjoyable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cool idea for a game, but it just feels like it never got polished, there are lots of confusing things. And random moments where they introduce new mechanics for no reason. Long cut scenes you can't skip, some of which don't feel like they really add anything for the story. I regret playing and wouldn't recommend it, even though it was at its heart a great game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a great zombie game with parkour elements  that feel intuitive. There are lots of side mission and unique story elements that change depending on when you find them. This is one of those games where you can spend hours in the beginning to grind all your levels to the maximum but the game doesn't become extremely easy as the world subtly levels up with you so that there will always be a little bit of a challenge, plus there are difficult areas and challenges that you can choose to do that are always there and repeatable if you feel like it. the way weapons degrade slightly bums me out do to losing weapons that I really liked though the looting mechanic means that I'm always finding new ones that I like just as much. I love the fact that I can play with friends or strangers but can also simply play it on my own without losing out on parts of the game.\nThis is one of my favourite games but then again I've wanted it since it came out because I could dropkick zombies so I might've been destined to love it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought the game after many years of eyeing it, and I'm disappointed to say that I just can't stand it. It does so many things wrong:\n\n- Graphics and style: the piss filter, combined with the fact that the whole city seems built from the same 20 copy-pasted assets, results in muted, boring environments. There isn't a single significant stylistic difference across the whole map.\n\n- Level design: parkour is supposed to be the game’s selling point, yet the maps are often clunky to navigate and regularly require detours to reach objectives. Frustratingly, this also happens in confined quest areas that should have received more polish.\n\n- Story, writing and characters: the story is extremely generic. It tries to be serious, but the implausible plot and poorly written, cartoonish characters make it fall flat. Some side-quest characters attempt to be funny but end up being annoying instead.\n\n- Gameplay: here’s where the biggest problems lie. Parkour works most of the time, but grows stale quickly, as does randomly looting houses. Quests are mostly boring fetch quests, where you spend more time running around than doing anything interesting. The melee-focused combat is outright bad. Every move you'd expect in a game like this (stealth kills, executions for downed or stunned enemies, charged attacks, throwing melee weapons, blocks, slides, dropkicks...) is locked behind the skill tree. Until you unlock them, and it takes a while, you're limited to smashing the left mouse button and spamming the few throwables you get. Add to that the fact that every enemy, even on normal difficulty, is a massive damage sponge and you can imagine that you are in for a lot of fun /s. Basic zombies take multiple hits even when downed. Human enemies can take around a dozen hits from a non-basic melee weapon, shrug off fire, block most melee and ranged attacks and kick you in the nuts whenever possible. Aiming at the head seems to make no difference, and it doesn't help that the game is bad at giving feedback for the efficacy of your hits.\nBefore some fanboy comments \"git gud\" (as I've seen in other negative reviews) I must say that the game is not hard, just extremely annoying. Ten hours in, combat is just a repetitive cycle of: hit, dodge, hit, (blocked?), dodge... rinse and repeat ad nauseam. If \"getting good\" means camping in unreachable spots and spamming molotovs and shurikens, then it's more an exercise in exploiting bad mechanics than improving skill.\nBut, in a game focused on parkour all of this should be irrelevant, you'd think you could just run and sneak around, right? Nope. The game constantly forces you to fight in enclosed areas, against multiple enemies, and/or clear every zombie in a zone. Stealth is undercooked, unreliable, and lacks meaningful skill tree upgrades. Weapons break far too quickly considering how many hits it takes to kill an enemy. Something that baffles me is that you can keep using broken weapons: nothing changes in the animations; they simply deal far less damage.\nThe developers seemed aware of all of this as well, because at a certain point the game simply gives up and hands the player a large supply of firearms and easy access to ammunition, effectively sidelining melee combat. I wish this had happened much earlier (not 10+ hours into the game), though it still doesn’t solve the issues completely. Firearms are not fun to use as they lack punch yet are still too strong, pushing the balance in the opposite direction of melee. It's further evidence that the game struggles to find nuance in the way its systems are balanced.\nAnd there are other frustrating situations: like how you take fall damage even from relatively low drops (again, the “less fall damage” upgrade must be unlocked), one-hit-deaths from exploding enemies and the overly aggressive running enemies chasing you for way too long.\n\nThis game is really bad, maybe a 5/10 on my scale. I'm genuinely surprised it has such a strong reputation. I guess the combination of Dead Island's zombie survival and Mirror's Edge parkour (the same things that attracted me and made me buy the game) built up so much hype that people gaslit themselves into believing that this is a good game. It's simply not. I played Dead Island 2, it's a highly flawed game and rightly got a lot of flak, but it feels like a masterpiece compared to this one. And no, it's not just because Dying Light is older.\n\nI guess the game is more fun if played in co-op... like every other game in existence, being more fun if played with friends.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There is a certain charm to Dying Light, and I imagine at the time of its release the parkour and open world zombie setting was enough. But playing it now with its janky combat, terrrrible campaign and boss fights, I am pretty dissapointed. I kept on playing waiting for it to be fun, but it wasn't...for me. Maybe it is more fun co-op, and perhaps I shouldn't have played it on hard during my first playthrough, but dispite this I cannot recommend. Time is precious and there are much better games to be played. Happy gaming!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played this for about 11 hours on \"normal\", but just can't get into it.  The parkour'ing around is more frustrating than interesting, what little story there is comes after MUCH grinding to get to the next tidbit of it, and it's hard to overlook the unrealistic wear on weapons.  The way the game saves your progress is clunky, as are the use of all the menus and general UI.  It seems to try and be something like L4D2 and the Metro series combined, but fails to be good in any of the way those games were.\r\n\r\nI got this game as a gift, and honestly am going to offer to refund the money the person paid for it. :/  Definitely don't recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After a while, the missions started to feel like repetitive errands, and although the map is very large, there aren't any really interesting areas. Maybe it's my fault and AAA games aren't for me anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "spoiler warning. your grapple hook gets disabled for the finale because \"ExhUaSTEd\". literally don't want to play anymore. especially as the game warns you are locked into the finale. you took away a fun thing, instead of crafting the finale with the grapple in mind, you took it away. that is such a bad choice that i have lost interest in the entire series.\r\ndon't\r\ntake\r\nfun\r\naway",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i mean the game really isnt that great tbh. the story blows and i could call out plotholes, my friend would predict shit before it happened 70% of the time. Didnt really feel an incentive to do anything outside of just story missions. Melee combat sucked so much ass, the mili-second i got access to firearms i used only that. i loved the bow even though it sucked ass range wise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wasted first time around 5 hours on this game. I exit and waiting for saving. Now i enter again and all campaign started from 0 and i using on ssd, not hdd. Thanks !!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is buns Pajeets of EU (aka Croatian hillbilly) set me to sit on my ass for 9 hours a day to parkour to Agartha to meet soyboys from Reddit (no this isnt funny.)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not as good as the my hero acadamia battle royale but its ok for a free game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idiotic game design combine with no-level gated DLC.\n\nEnjoy losing xp, items and even environmental hazards like explosives because you talked to an NPC who then became hostile because the Main Character acted as braindead as the designers of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I paid for and downloaded this game, but it doesn't recognize my dualshock 4 controllers. I have tried every controller setup, enable/disable steam input, etc. Nothing works. It has been a waste of both time and money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i really hate this game.....\r\ni was enjoying it until 25% of the story now i was trying to see what is be the zombie and baaaaammm,,,,\r\nall of my progress in story campaign was gone im really sorry for the developers for no auto save and nothing in story mode , no saving just a button named continue that will change when ever you try somthing else",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dropped the game in the half of the story with zero intention to ever come back.\nThis game tries to take itself very seriously, mainly with the story and atmosphere, but for me fails and becomes very basic.\nThe main villain is a sadistic simpleton creating chaos because he likes it... that's it. There are some characters that the moment you start to be intrigued by and interested in, they just die for pretty much stupid reasons that could have been easily avoided.\nParkour is nice, but for me gets boring quite fast. Combat is decent, although nothing too special.\nSide quests forgettable, repetitive.\nExpected much more from a game popular and high rated as this one is.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfrontunately I'd played this past the 2 hour mark, based on positive reviews, otherwise I would have returned this stinking pile of crap.\n\nThe game is unnecessarily hard and difficult for the illusion of depth. Free-running and combat, the two biggest selling points of this game, have been terribly implemented. Frequently you'll fall to your death because the game's shiddy parkour system doesn't register you trying to climb up a ledge or you'll fall five feet and instantly lose half your health. I died so many times on the Gazi mission because the game devs force you to make a jump which only connects 25% of the time. \nCombat is horrible because everything is expensive and your weapons will break after 20 swings. That's about 4-5 zombies which you can kill, which may net you $20 if you are really lucky. A new weapon costs at least $200. You can find shiddy pipes and nailboards around the map but you have to search every where just to find a couple. That's maybe $100 you can earn if you find a good amount of weapons.\nThe missions are annoying as they frequently force you to navigate through the central HQ apartment hub - which is an absolute nightmare to navigate. All I did was stare at the minimap to find my way. Why do I need to traverse through so many different floors just to find the quest giver? Why can't I just call them? The cut scenes are painfully long as well and some of them you can't even skip. I died twice to volatiles during the daytime during the realtime cut scenes as I had to climb up some random roof and make an un-skippable phone call, meanwhile the zombies were free to climb up and swing at me whilst I just stood there rooted on the spot having a good chin-wag. Why do they spend so much time on these crappy cut scenes when they know everyone'll just skip them? \n\nThere's several points where you have to fight humans and it's a nightmare. They're faster than you, do more damage than you, and have ranged attacks which can take out a third of your health. It's a stupid system. Yet they'll just stand there whilst you line up headshots directly at them.\n\nThe night time sections were frustrating because the main character is so slow and the enemies are so much faster than you. I kept dying to these fuggers and the game devs block you from sleeping in safe zones, even after a pursuit has been evaded. It's night time. It's dangerous outside. I am in a safe area. There are no zombies here. Why can't I sleep til day time? Who designed this game?\n\nI recall feeling terribly down whilst playing this, not because I was fighting and living through the depraved end of humanity whilst fighting off hordes of undead, but more so because the game is so bad and they force you to play within some ugly slum of middle-eastern origin. Everything is so bland and yellow and washed out. At least with Dead Island 2 the game devs tried to make the game look interesting and were smart with their colour choice. Here, I'm forced to listen to Gazi or Ahmed or Yussef or Whaleed talk about Iran whilst my eyes glaze over from all the yellow and brown. \n\nDead Rising wasn't the best game in the world, but at least they made that fun to play.\n\nWhat's worse is that even with all the DLC they made little to no effort to improve the base game. They just introduced a few cosmetic skins. \n\nLevelling up is badly done as well because you have to do more of a skill in order to get the perks. Except in order to get exp whilst fighting you need to have a working weapon. Even when you upgrade a weapon to do more damage it doesn't fix the durability issue or repair the item. So chicken and the egg, in order to slow down the player's rate of progression, the game devs brilliant idea is to shoot them in the foot so that they can enjoy the rich environment of slums, with garbage thrown around everywhere and piles of decaying corpses. Lovely.\nIt's made even worse because in order to progress your actual level, called 'survival skill', you need to complete missions. But every time you die you lose a good chunk of experience points from this. Each mission has multiple points where you'll easily die and you'll often beat it through trial and error. You'll be stuck at the low levels for a while due to the unnatural difficulty. \nSometimes zombies will teleport on top of you inside of an enclosed room with one door you've cleared, or a volatile will materialize behind you despite making no noise and end you, or you'll just die from a small fall because the game doesn't provide you enough items to find or purchase to heal yourself and the player doesn't regenerate more than 10% of their total health. \n\nIt's actually a garbage game to be honest and even though I got it in a sale, the max I'd actually want to spend on it would be $5. \n\nDefinitely am not going to bother with the sequels now because of this crapshow.\n\nEDIT: I've played alot more now, probably another 40 hours (nothing else to play). First off, the difficulty setting sucks ASS. Playing on hard was stupid and the devs never fixed it. There's a harder difficulty (Nightmare) and it's made so much easier than Hard mode by the fact that you can buy guns and ammo (which you can't in hard). Even with all the DLC added in it still feels somewhat light, like it's still missing more. The story mode can be completed pretty quickly (especially if you have guns), and there's nothing much to do afterward. The side quests are fairly basic but limited and the DLCs only really added a few extra maps and challengesm nothing amazing. The Following was pretty fun though and added better characters and gameplay in a smaller, more condensed play area. More challenge, but it's okay once you've levelled up - which brings me to my next point. There is ALOT of grind. I managed to cheese gaining higher levels by finding a couple of developer items and using a few farming tricks. Ultimately, even after all this time, I'm still not at max survivor rank. The rewards for levelling up just peter out after a while and there's no major challenge to test your skills once your at a high level, you'll still be fighting the ordinary hordes of shambling zombies that you were at the beginning. I never really got to a WOW moment where I was really tested and felt rewarded for reaching the higher levels. I'll often be spamming cheese attacks to beat hordes of runners or humans with rifles because they can still kill me in three hits. Even against the night hunter mutliplayer mode I just spam DLC weapons as you're still sto weak by the end and your skill doesn't really make a difference. The story was crap and some of the boss fights were so shite because they take all of your weapons away and force you to fight 5 guys at once. It's alla bit stupid and camp at times and completing the story ended so flaccidly. I completed it and now have no reason to keep playing. Once you hit max levels and complete the story there's nothing to come back to. It's great that I was able to buy this for $15 with all the DLC, but I've had to wait a decade just to achieve this. Ultimately not worth the full price and was more of just a time grinder if you're bored and got nothing more engaging to do. Definitely a better experience than something like Skyrim, which constantly crashed and had billions of loading screens, but without something like mods or anything fresh to spice up the gameplay it just repeats itself after 10 hours. \n7/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Parkour simulator aah game , I thought it was a zombie game but you walk around jumping roofs with a pipe , the useless people at the shelter don’t even give you a gun and send you to do chores for them and treat you like crap",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THE CONTROLS SUCK THE STORY IS RETARDED AND TO FUCKING LONG AND YOUR LOCKED OUT OF THE FUN STUFF UNTIL YOU DO. ITS DOG SHIT BAD",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay kinda boring, dialogue was annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought a videogame not an ads billboard for you to use as you please.\nI don't care if you want to inflate views on your videos.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bullshit story !! 70% of game is ok but last 30 its nonesense",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wanted to like it, but I can't. Boring gameplay, stupid story, constantly induced motion sickness. It can be fun with friends, between the breaks it makes me do. Not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "laptop performance peace of shit, many years of updates, zero fixes.\n30-50 fps on rtx 4070 laptop in 1080p it's f***ing joke,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The more i play it, the more i hate it. Easily one of my least favorite games i ever tried to finish.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fix your damn game ,too many stuttering in rtx 4050m",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit combat against humans and fast zombies",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "死不绝的男\n哈哈这个时长不错",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game caused me problems",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "10 years of release yet still so many fkin bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so zombies have the dodging of a mf mma fighter alr bub",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "why cant i open game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Full of glitches",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tolga a Fatin jsou retardi",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sa-mi bag pula in el joc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "скучная поебота",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no sexy women",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "miriau",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no sex",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dw",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was absolutley loving this game, was gonna give it a great reveiw until i realized you are forced to rebuy all other dlcs and bundles just for ONE (the main) DLC campaign, Instead of being able to buy it sepretly like everything else. \n\nVery scummy thing to do. \n\nThese are all i own yet still forces me to rebuy all of them just to accsess dlc - \nDying Light - Cuisine & Cargo\nDying Light - The Bozak Horde\nDying Light - Ultimate Survivor Bundle\nDying Light - Harran Ranger Bundle\nDying Light - Gun Psycho Bundle\nDying Light - Volatile Hunter Bundle\nDying Light - Retrowave Bundle\nDying Light - Shu Warrior Bundle\nDying Light - 5th Anniversary Bundle\nDying Light - Snow Ops Bundle\nDying Light - 10th Anniversary Bundle",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Decent game but with a lot of horrible screen effects, blurring when running, way too much post processing and other ugly annoyances.\n\nMain reason for the downvote though is the absolute gall of Techland forcing updates that advertise their new Dying Light Beast game at you, force a video with the extremely average voice actor from the first game, make you click through a bunch of ‘buy now’ screens just to get back to the game you bought ten years ago.\n\nSeriously, this sort of crap makes me never want to give them another cent. It’s so obnoxious and shows how much contempt they have for their customers.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Look, I've just bought the game.  I'm sure it's going to be great, comes highly recommended, etc. etc. but that's no excuse for sticking me into a bunch of adverts for your latest game the first time I launch it.  I definitely don't need a video from one of the developers talking about how \"we've all been waiting for this\".  I haven't - I'm still waiting to play the bloody game I just paid for.  More importantly, you immediately start talking about specific characters.  Opening right up with a spoiler for there being no risk for this character then?  Thanks for that.\n\nBad practice gets bad review.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great visual, great city. But melee system sucks - no damage, no durability and yet the most amount of customization on those weapons and cool designs that you hate not to enjoy for at least 10 minutes of using them because weapon can last from minute to maybe 5 minutes with few repairs that you can't buy or expand anyhow and you get limited to the amount you get when you either craft, loot from very few zombies that cary any weapon in the first place or buy the weapon with money you have nothing to spend on anyway. There are systems inside the game that could make parkour more enjoyable outside parkour challenges but instead the most enjoyable part of the game is locked. You hear about yourself being absolute legend of runner before you even know how to climb a single roof.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "In arguments in Steam's message boards, people defending the game say that the combat gets better when you get stronger gear and abilities. That is, when you get the ability to instantly kill enemies. \n\nIn other words, the combat is at its best when you get to not engage with it by instead instantly killing enemies.\n\nThere's so many flaws in the combat that I don't feel like typing it all up. But I will say: Zombies go \"i-frames for me, but not for thee.\"\n\nThis applies to the game's other mechanics, like parkouring, as they also frequently don't work satisfactorily, albeit not nearly as egregiously as the combat. Case in point: People who get the grappling hook never look back.\n\nEnemy health scales with your story progression. It's very extreme. Halfway through the game on Hard, human enemies can survive being doused with flammable liquid and set on fire half a dozen times or survive multiple shotgun blasts. That was the point that I decided to just rush the story and be done with the game. \n\nEnemy spawning feels bad - It's especially bad from the beginning on Hard, but it gets there late-game on Normal. Enemies begin to respawn, only a short distance away from you. \"Virals\", which are fast zombies, continuously spawn and crawl out from underneath the same van. We shouldn't have 2, 4, or 5 virals crawl out from underneath the same van. They're also coded to run directly to your position when they have no convincing reason to.\n\nMultiplayer desync is noticeable even between players in the same geographic area. Since death is punished by losing progression to your next level, this feels particularly egregious. Prepare to get grabbed, or get your healthbar destroyed, without even having a chance to see it coming.\n\nIt's too easy to accidentally craft a modification on a weapon, which is permanent. It's too easy to lose weapons you've thrown due to them clipping through the ground, or because you chased a fleeing enemy 15 meters away causing the weapon to despawn.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I really tried to give this game a chance, but it's just incredibly boring. It doesn’t meet my expectations at all.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Dying Light is an awesome game. Extraction though... \n\nThe last mission is headache inducing and when you die, you respawn. You DO NOT reload/restart. That means that you will use all your ammo, items, consumables etc. \n\nA simple reload from the start would have been nice. Once I ran out of flares after falling to my death as my arms and legs graphically sailed past a grabbable platform... I uninstalled and am working to prevent this game from getting Overwhelmingly Positive instead.\n\nWhy in the @#$! does it not restart from the a checkpoint but instead respawn you, minus the items you used in that attempt. A massively irritating, shitty thing to do to an otherwise super fun game. I refuse to beat the game and will take pleasure in the down vote as my win instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this games fun with friend and i had a great time,  the end you go solo and it sucks balls ruins the co-op experience. only fun part was running and fighting zombies with my homie.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "5/10. It's not bad, it's just not good. Some terrible control mechanics with the parkour stuff and combat. Also, I finally got a good weapon, which was killing zombies good...for about 5 minutes. Then, I got a vasty superior golden weapon, while also maxing out my stats, yet I am getting killed more than I was at the start of the game. \r\n\r\nI've been playing on Nightmare from the start. It'd be nice for my slog to be worthwhile, to go from zombie fodder to zombie slayer, but the zombies seem to have been working out and taking steriods while the game progressed, and are now they are tougher than at the start of the game (talking the bog standard zombie, here). Make it make sense. Could be a good game, if it wasn't for these bogus flaws.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the story is boring, the quests are repetitive, the open world is empty, the achievements are tedious. the only good thing is the parkouring, but for that i even prefer mirror's edge, which is a more streamlined experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not install game. It’s a piece of trash. Literally corrupted my pc and I had to reinstall windows to fix in order to fix.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What a terrible waste. This POS game spawns you wherever the hell it wants when you die, so you will end up running across the map just to freaking die again. I die because of explosions, not the zombies. The parkour challenges are crap and I can't even change the jump button scheme to a freaking normal one. It's just a crap single player experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not a game, this is the developers' excrement.\nI wanted to describe all the problems and nuances in detail at first, but I realized that this game is not worth a single letter, so everything written above is just a Gift.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dying Light 1 это игра, которая обещает адреналин и свободу, а на деле превращает тебя в профессионального падальщика с высот. Ты вроде бы мастер паркура, но персонаж то хватает невидимый воздух, то игнорирует огромный выступ прямо перед лицом. В итоге ты летишь головой вниз в толпу зомби, а игра смотрит на тебя с довольной ухмылкой.\r\n\r\nСюжет выглядит как найденная в шкафу школьная тетрадь с клишированным фанфиком о зомби апокалипсисе. Персонажи либо орут, либо драматизируют, либо орут что драматизируют. Каждый диалог звучит так, будто актерам платили за количество пафоса, а не за смысл.\r\n\r\nЗомби днем ведут себя как мебель с глазами, а ночью внезапно становятся чемпионами мира по бегу. Они несутся за тобой так, будто ты украл их семейный ужин. Самое смешное, что игра любит спавнить их прямо у тебя перед носом просто чтобы напомнить кто здесь главный.\r\n\r\nЛут это отдельная боль. Ты открываешь контейнер с надеждой, а там очередная ржавая железяка, которой стыдно махать даже в воздухе. Проходит десять часов, а уровень оружия до сих пор ощущается как будто ты дерешься кухонной ложкой.\r\n\r\nВ итоге получается красивый, атмосферный и абсолютно раздражающий хаос. Игра могла быть шедевром, но вместо этого превращается в марафон по граблям. После нескольких часов начинаешь понимать зомби, они тоже, наверное, устали от всего этого ужаса.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is unnecessarily difficult.  I love a good challenge, but after 41 hours, I have barely made any progress on the easiest mode.  Not fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "even when starting out with good craftable gear due to the dlc stuff, i keep dying in some missions, even normal zombies take too long to kill and are in mass, and this is usually during night or missions be night, so virals come around and are everywhere and i cant deal with the masses of regular zombies unless i take a long time avoiding volitiles, but evn then itll become night time before i even make any permanent progress. maybe im playing it wrong, but its not for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay in this game was amazing and very fun but the story on the other hand lacks a lot of depth and was very underwhelming, I'm not normally a guy that needs a great story to enjoy a game but when you want to dive into the story and it under delivers it makes the whole experience less enjoyable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cool idea for a game, but it just feels like it never got polished, there are lots of confusing things. And random moments where they introduce new mechanics for no reason. Long cut scenes you can't skip, some of which don't feel like they really add anything for the story. I regret playing and wouldn't recommend it, even though it was at its heart a great game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a great zombie game with parkour elements  that feel intuitive. There are lots of side mission and unique story elements that change depending on when you find them. This is one of those games where you can spend hours in the beginning to grind all your levels to the maximum but the game doesn't become extremely easy as the world subtly levels up with you so that there will always be a little bit of a challenge, plus there are difficult areas and challenges that you can choose to do that are always there and repeatable if you feel like it. the way weapons degrade slightly bums me out do to losing weapons that I really liked though the looting mechanic means that I'm always finding new ones that I like just as much. I love the fact that I can play with friends or strangers but can also simply play it on my own without losing out on parts of the game.\nThis is one of my favourite games but then again I've wanted it since it came out because I could dropkick zombies so I might've been destined to love it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought the game after many years of eyeing it, and I'm disappointed to say that I just can't stand it. It does so many things wrong:\n\n- Graphics and style: the piss filter, combined with the fact that the whole city seems built from the same 20 copy-pasted assets, results in muted, boring environments. There isn't a single significant stylistic difference across the whole map.\n\n- Level design: parkour is supposed to be the game’s selling point, yet the maps are often clunky to navigate and regularly require detours to reach objectives. Frustratingly, this also happens in confined quest areas that should have received more polish.\n\n- Story, writing and characters: the story is extremely generic. It tries to be serious, but the implausible plot and poorly written, cartoonish characters make it fall flat. Some side-quest characters attempt to be funny but end up being annoying instead.\n\n- Gameplay: here’s where the biggest problems lie. Parkour works most of the time, but grows stale quickly, as does randomly looting houses. Quests are mostly boring fetch quests, where you spend more time running around than doing anything interesting. The melee-focused combat is outright bad. Every move you'd expect in a game like this (stealth kills, executions for downed or stunned enemies, charged attacks, throwing melee weapons, blocks, slides, dropkicks...) is locked behind the skill tree. Until you unlock them, and it takes a while, you're limited to smashing the left mouse button and spamming the few throwables you get. Add to that the fact that every enemy, even on normal difficulty, is a massive damage sponge and you can imagine that you are in for a lot of fun /s. Basic zombies take multiple hits even when downed. Human enemies can take around a dozen hits from a non-basic melee weapon, shrug off fire, block most melee and ranged attacks and kick you in the nuts whenever possible. Aiming at the head seems to make no difference, and it doesn't help that the game is bad at giving feedback for the efficacy of your hits.\nBefore some fanboy comments \"git gud\" (as I've seen in other negative reviews) I must say that the game is not hard, just extremely annoying. Ten hours in, combat is just a repetitive cycle of: hit, dodge, hit, (blocked?), dodge... rinse and repeat ad nauseam. If \"getting good\" means camping in unreachable spots and spamming molotovs and shurikens, then it's more an exercise in exploiting bad mechanics than improving skill.\nBut, in a game focused on parkour all of this should be irrelevant, you'd think you could just run and sneak around, right? Nope. The game constantly forces you to fight in enclosed areas, against multiple enemies, and/or clear every zombie in a zone. Stealth is undercooked, unreliable, and lacks meaningful skill tree upgrades. Weapons break far too quickly considering how many hits it takes to kill an enemy. Something that baffles me is that you can keep using broken weapons: nothing changes in the animations; they simply deal far less damage.\nThe developers seemed aware of all of this as well, because at a certain point the game simply gives up and hands the player a large supply of firearms and easy access to ammunition, effectively sidelining melee combat. I wish this had happened much earlier (not 10+ hours into the game), though it still doesn’t solve the issues completely. Firearms are not fun to use as they lack punch yet are still too strong, pushing the balance in the opposite direction of melee. It's further evidence that the game struggles to find nuance in the way its systems are balanced.\nAnd there are other frustrating situations: like how you take fall damage even from relatively low drops (again, the “less fall damage” upgrade must be unlocked), one-hit-deaths from exploding enemies and the overly aggressive running enemies chasing you for way too long.\n\nThis game is really bad, maybe a 5/10 on my scale. I'm genuinely surprised it has such a strong reputation. I guess the combination of Dead Island's zombie survival and Mirror's Edge parkour (the same things that attracted me and made me buy the game) built up so much hype that people gaslit themselves into believing that this is a good game. It's simply not. I played Dead Island 2, it's a highly flawed game and rightly got a lot of flak, but it feels like a masterpiece compared to this one. And no, it's not just because Dying Light is older.\n\nI guess the game is more fun if played in co-op... like every other game in existence, being more fun if played with friends.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There is a certain charm to Dying Light, and I imagine at the time of its release the parkour and open world zombie setting was enough. But playing it now with its janky combat, terrrrible campaign and boss fights, I am pretty dissapointed. I kept on playing waiting for it to be fun, but it wasn't...for me. Maybe it is more fun co-op, and perhaps I shouldn't have played it on hard during my first playthrough, but dispite this I cannot recommend. Time is precious and there are much better games to be played. Happy gaming!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played this for about 11 hours on \"normal\", but just can't get into it.  The parkour'ing around is more frustrating than interesting, what little story there is comes after MUCH grinding to get to the next tidbit of it, and it's hard to overlook the unrealistic wear on weapons.  The way the game saves your progress is clunky, as are the use of all the menus and general UI.  It seems to try and be something like L4D2 and the Metro series combined, but fails to be good in any of the way those games were.\r\n\r\nI got this game as a gift, and honestly am going to offer to refund the money the person paid for it. :/  Definitely don't recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After a while, the missions started to feel like repetitive errands, and although the map is very large, there aren't any really interesting areas. Maybe it's my fault and AAA games aren't for me anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "spoiler warning. your grapple hook gets disabled for the finale because \"ExhUaSTEd\". literally don't want to play anymore. especially as the game warns you are locked into the finale. you took away a fun thing, instead of crafting the finale with the grapple in mind, you took it away. that is such a bad choice that i have lost interest in the entire series.\r\ndon't\r\ntake\r\nfun\r\naway",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i mean the game really isnt that great tbh. the story blows and i could call out plotholes, my friend would predict shit before it happened 70% of the time. Didnt really feel an incentive to do anything outside of just story missions. Melee combat sucked so much ass, the mili-second i got access to firearms i used only that. i loved the bow even though it sucked ass range wise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wasted first time around 5 hours on this game. I exit and waiting for saving. Now i enter again and all campaign started from 0 and i using on ssd, not hdd. Thanks !!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is buns Pajeets of EU (aka Croatian hillbilly) set me to sit on my ass for 9 hours a day to parkour to Agartha to meet soyboys from Reddit (no this isnt funny.)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not as good as the my hero acadamia battle royale but its ok for a free game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idiotic game design combine with no-level gated DLC.\n\nEnjoy losing xp, items and even environmental hazards like explosives because you talked to an NPC who then became hostile because the Main Character acted as braindead as the designers of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I paid for and downloaded this game, but it doesn't recognize my dualshock 4 controllers. I have tried every controller setup, enable/disable steam input, etc. Nothing works. It has been a waste of both time and money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i really hate this game.....\r\ni was enjoying it until 25% of the story now i was trying to see what is be the zombie and baaaaammm,,,,\r\nall of my progress in story campaign was gone im really sorry for the developers for no auto save and nothing in story mode , no saving just a button named continue that will change when ever you try somthing else",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dropped the game in the half of the story with zero intention to ever come back.\nThis game tries to take itself very seriously, mainly with the story and atmosphere, but for me fails and becomes very basic.\nThe main villain is a sadistic simpleton creating chaos because he likes it... that's it. There are some characters that the moment you start to be intrigued by and interested in, they just die for pretty much stupid reasons that could have been easily avoided.\nParkour is nice, but for me gets boring quite fast. Combat is decent, although nothing too special.\nSide quests forgettable, repetitive.\nExpected much more from a game popular and high rated as this one is.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfrontunately I'd played this past the 2 hour mark, based on positive reviews, otherwise I would have returned this stinking pile of crap.\n\nThe game is unnecessarily hard and difficult for the illusion of depth. Free-running and combat, the two biggest selling points of this game, have been terribly implemented. Frequently you'll fall to your death because the game's shiddy parkour system doesn't register you trying to climb up a ledge or you'll fall five feet and instantly lose half your health. I died so many times on the Gazi mission because the game devs force you to make a jump which only connects 25% of the time. \nCombat is horrible because everything is expensive and your weapons will break after 20 swings. That's about 4-5 zombies which you can kill, which may net you $20 if you are really lucky. A new weapon costs at least $200. You can find shiddy pipes and nailboards around the map but you have to search every where just to find a couple. That's maybe $100 you can earn if you find a good amount of weapons.\nThe missions are annoying as they frequently force you to navigate through the central HQ apartment hub - which is an absolute nightmare to navigate. All I did was stare at the minimap to find my way. Why do I need to traverse through so many different floors just to find the quest giver? Why can't I just call them? The cut scenes are painfully long as well and some of them you can't even skip. I died twice to volatiles during the daytime during the realtime cut scenes as I had to climb up some random roof and make an un-skippable phone call, meanwhile the zombies were free to climb up and swing at me whilst I just stood there rooted on the spot having a good chin-wag. Why do they spend so much time on these crappy cut scenes when they know everyone'll just skip them? \n\nThere's several points where you have to fight humans and it's a nightmare. They're faster than you, do more damage than you, and have ranged attacks which can take out a third of your health. It's a stupid system. Yet they'll just stand there whilst you line up headshots directly at them.\n\nThe night time sections were frustrating because the main character is so slow and the enemies are so much faster than you. I kept dying to these fuggers and the game devs block you from sleeping in safe zones, even after a pursuit has been evaded. It's night time. It's dangerous outside. I am in a safe area. There are no zombies here. Why can't I sleep til day time? Who designed this game?\n\nI recall feeling terribly down whilst playing this, not because I was fighting and living through the depraved end of humanity whilst fighting off hordes of undead, but more so because the game is so bad and they force you to play within some ugly slum of middle-eastern origin. Everything is so bland and yellow and washed out. At least with Dead Island 2 the game devs tried to make the game look interesting and were smart with their colour choice. Here, I'm forced to listen to Gazi or Ahmed or Yussef or Whaleed talk about Iran whilst my eyes glaze over from all the yellow and brown. \n\nDead Rising wasn't the best game in the world, but at least they made that fun to play.\n\nWhat's worse is that even with all the DLC they made little to no effort to improve the base game. They just introduced a few cosmetic skins. \n\nLevelling up is badly done as well because you have to do more of a skill in order to get the perks. Except in order to get exp whilst fighting you need to have a working weapon. Even when you upgrade a weapon to do more damage it doesn't fix the durability issue or repair the item. So chicken and the egg, in order to slow down the player's rate of progression, the game devs brilliant idea is to shoot them in the foot so that they can enjoy the rich environment of slums, with garbage thrown around everywhere and piles of decaying corpses. Lovely.\nIt's made even worse because in order to progress your actual level, called 'survival skill', you need to complete missions. But every time you die you lose a good chunk of experience points from this. Each mission has multiple points where you'll easily die and you'll often beat it through trial and error. You'll be stuck at the low levels for a while due to the unnatural difficulty. \nSometimes zombies will teleport on top of you inside of an enclosed room with one door you've cleared, or a volatile will materialize behind you despite making no noise and end you, or you'll just die from a small fall because the game doesn't provide you enough items to find or purchase to heal yourself and the player doesn't regenerate more than 10% of their total health. \n\nIt's actually a garbage game to be honest and even though I got it in a sale, the max I'd actually want to spend on it would be $5. \n\nDefinitely am not going to bother with the sequels now because of this crapshow.\n\nEDIT: I've played alot more now, probably another 40 hours (nothing else to play). First off, the difficulty setting sucks ASS. Playing on hard was stupid and the devs never fixed it. There's a harder difficulty (Nightmare) and it's made so much easier than Hard mode by the fact that you can buy guns and ammo (which you can't in hard). Even with all the DLC added in it still feels somewhat light, like it's still missing more. The story mode can be completed pretty quickly (especially if you have guns), and there's nothing much to do afterward. The side quests are fairly basic but limited and the DLCs only really added a few extra maps and challengesm nothing amazing. The Following was pretty fun though and added better characters and gameplay in a smaller, more condensed play area. More challenge, but it's okay once you've levelled up - which brings me to my next point. There is ALOT of grind. I managed to cheese gaining higher levels by finding a couple of developer items and using a few farming tricks. Ultimately, even after all this time, I'm still not at max survivor rank. The rewards for levelling up just peter out after a while and there's no major challenge to test your skills once your at a high level, you'll still be fighting the ordinary hordes of shambling zombies that you were at the beginning. I never really got to a WOW moment where I was really tested and felt rewarded for reaching the higher levels. I'll often be spamming cheese attacks to beat hordes of runners or humans with rifles because they can still kill me in three hits. Even against the night hunter mutliplayer mode I just spam DLC weapons as you're still sto weak by the end and your skill doesn't really make a difference. The story was crap and some of the boss fights were so shite because they take all of your weapons away and force you to fight 5 guys at once. It's alla bit stupid and camp at times and completing the story ended so flaccidly. I completed it and now have no reason to keep playing. Once you hit max levels and complete the story there's nothing to come back to. It's great that I was able to buy this for $15 with all the DLC, but I've had to wait a decade just to achieve this. Ultimately not worth the full price and was more of just a time grinder if you're bored and got nothing more engaging to do. Definitely a better experience than something like Skyrim, which constantly crashed and had billions of loading screens, but without something like mods or anything fresh to spice up the gameplay it just repeats itself after 10 hours. \n7/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Parkour simulator aah game , I thought it was a zombie game but you walk around jumping roofs with a pipe , the useless people at the shelter don’t even give you a gun and send you to do chores for them and treat you like crap",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THE CONTROLS SUCK THE STORY IS RETARDED AND TO FUCKING LONG AND YOUR LOCKED OUT OF THE FUN STUFF UNTIL YOU DO. ITS DOG SHIT BAD",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay kinda boring, dialogue was annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought a videogame not an ads billboard for you to use as you please.\nI don't care if you want to inflate views on your videos.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bullshit story !! 70% of game is ok but last 30 its nonesense",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wanted to like it, but I can't. Boring gameplay, stupid story, constantly induced motion sickness. It can be fun with friends, between the breaks it makes me do. Not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "laptop performance peace of shit, many years of updates, zero fixes.\n30-50 fps on rtx 4070 laptop in 1080p it's f***ing joke,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The more i play it, the more i hate it. Easily one of my least favorite games i ever tried to finish.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fix your damn game ,too many stuttering in rtx 4050m",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}