{
  "positive": [
    {
      "review": "Great sim, came here from ACC, and the lobbies are more competitive and fun",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "LMU or Le Mans ultimate  \n\n\nAfter playing it for more then 300 hours i really fell in love with the game \nPros: game feels like a actual race in the very long races you have to look after fuel or tires and not hot lapping the whole race \n-ffb is really decent and gives a lot of detail of the car and track (simagic alpha evo 9nm)\n-cars feel nice and predictible \n-servers are nice and stable \n-nice and competitive racing \n-over all nice feel of the game and ui \n-you can have fun even with the free cars with out buying any dlcs\n-dlcs are very well made and tracks feel nice \n-you don't need to buy the subscription to still be racing with other people and have fun \n-the free cars are fast and competitive \n-day to night transition is nice nad smooth\nThe cons:\n-the pricing is wierd but still better then iracing \n-doesn't have dynamic wether system no wet line \n-the hypercars lack a proper cold tire physics \n-hosting servers is little bit expensive and made through a 3 party site and currency \n-single player is little bit bare bones with out any kind of championship \n-the game has a for of potential but it still needs work to be a really good game \n\nMy opinoin: \nGame is over all nice and looks decent, even tho it has some bad things i thhink the good thing out weight it so if you are a wec fan or fan of endurance motorstort i would give it a shot you don't have to buy all the dlcs to enjoy the game remember it's a add on and if you don't like it right now the game has a lot of potential and will hopefully get better with time \n\noverall:\n7.5/10 great but it can defo get better but i still recommend you to try it when it is on sale\n\nLe Le Le Le mans Le Le Le Mans",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "game is good, but they should add that you can creat a lobby so you can play with your Friedns FOR FREE like in other games bc paying for server just to race for a few minutes is really dumb thing",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "[h1][i]Le Mans Ultimate - A Race That Stays With You[/i][/h1]\r\n\r\n[i]Le Mans Ultimate may not be the most realistic or the absolute greatest sim-racing title ever made — but it comes surprisingly close. What truly makes it stand out isn’t just the physics or the cars. It’s the experience. The driver-swap events are, without question, one of its finest features: the simple magic of sharing the same car with friends for hours on end, driving through virtual sunrises and real-world sunsets, sweating over every corner, trying desperately not to make a single mistake whilst pushing hard. It becomes less of a game and more of an endurance test of focus, willpower, and pure stubborn passion.\r\n\r\nAnd when you finally cross that finish line and stand on the podium — whether it’s COTA 6 Hours or Spa 12 Hours — the feeling of achievement is indescribable. It sits somewhere beyond pride, beyond relief, almost beyond anything else you’ve accomplished in life. You look back at the day and night stints, the fatigue, the near-misses, the laps where you drove on instinct alone, and you realize you’ve done something remarkable. But more importantly, you’ve done it together. After a long endurance race, your friendship feels different — deeper. It’s the sort of bond you’d expect from people who’ve fought side by side, not from a racing game. Yet that’s exactly the emotional weight the experience gives you.\r\n\r\nLike life, Le Mans Ultimate is a constant balance of risk and reward. Push too hard and you gain time, but you lose consistency. Play it safe and you might fall behind. Finding that balance teaches you something quietly profound about yourself — patience, judgement, control. The game isn’t perfect, but the way it mirrors the challenges of real life, the way it connects people, and the way it turns hours of driving into a memory you’ll never forget… that’s something truly special.[/i]\r\n\r\n[b]A sim that may not be flawless, but is absolutely unforgettable.[/b]",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Great racing sim. Cars feel great with every one having it's own strengths and weaknesses. With more content on the way it's the go to game for endurance racing fans",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The cars feel great to drive, the handling feels realistic and the tire model feels spot on. The online lobbies are really competitive, and the matchmaking works great. Definitely worth it",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "It is clear even with very little game time, that this game is fun. Coming from iRacing, where you could almost forget that you are supposed to have fun, i am immediately drawn in by the sounds, physics and grapich in LMU.\n\nBut not only that, it actually makes you drive the car, make mistakes, bump into antoher car in a close battle without insta sending you and the other car into a unreversible accident.\n\nMy issue with iRacing is that, for me, it had become this weird Guitar Hero game, where every input has to be perfect, and if you are to make a mistake? Goodbye with zero chance of recovery.\n\nIn LMU in my first 4 hours i had MANY incidents where i would be dead in iRacing, but not here. Here i keept gooing excatly like in real life racing. Sure i got some areo damage that made me a bit slower (realistic) but i was able to finish the race without to much hassel.\n\nGreat game, i could think this will be my main sim from now on.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I'm a newbie at sim racing, out of all the games I've tried so far, this one's the closest to my heart. I'd really like for it have better penalty system in the future, as right now, any collision that happens, regardless it's because of you or not, you get punished. But I still recommend the shit out of this game!!!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a pretty decent sim, has several features that set it apart from the others in its category (i.e. iRacing, ACC). Still needs some extra content related to single player, which I'm sure will come along soon enough.\n\nOnly real complaint is I've found some oddities in the LMP2/Hypercar braking models with tire lock up that I'm not exactly a fan of. Usually I'll end up locking the brakes and no matter how much I lift off the pedal to leave the lock up threshold, the car just won't stop locking. I say this having seen times in the brake trace where I'm at 20% brake in a straight line and the tires are still locked up.\n\nUnfortunately this feeling goes against every bit of me that would press the brake until lockup then back it down slightly in real life, and it makes stopping difficult everywhere except the high speed entries where the downforce enables me to do that. It's strange feeling comfortable being able to stop for Monza T1 but not for Lesmo 2.\n\nOtherwise, is a pretty good game, I personally enjoy the GT class quite a bit because the ABS allows me to get around the odd braking feel (having the wheel shake when in the ABS engagement is nice, gives better feedback for \"lockups\" and I wish there was better lock feedback like that on the LMP2/Hypercars).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good physics, good graphics, good online play. Only complaints are: offline single player portion is pretty lacking. Race weekend is your only option. It would have been nice to have a season or career mode. Online play is great, but mostly only if you have a RaceControl subscription.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Came over from ACC and have not looked back. My fav racing sim that continues to get better.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "At first, I had a massive problem with force feedback and many people still do... especially with Thrustmaster wheels. However, installing old drivers sorted the problem for me, and now everything works perfectly and I can play without constantly unplugging my wheel to get it back.\n\nAs for the game itself, it's brilliant. Obviously quite limited content as game focuses on endurance racing, but that's a good thing - quality over quantity. No other finished game has its cars as well tuned in terms of physics and handling as this one.\n\nOnline shares the same \"quality\" philosophy—there's not a hole lot, and you can't even make your own lobby for free. However, ranked races in this game are the best \"online racing\" I've ever experienced. Almost everyone cares about their safety rating, as loosing it means losing access to more interesting lobbies. That's a great mechanic, although it might seem unfair when you lose points because of someone else's mistake - especially at bronze where all noobies are and comparatively, it still gets messy a lot like in every other sim game. I guess iRacing is even better for competitive online play, but I'm not into subscriptions and LMU is regarded as better sim otherwise.\n\nAs for subscriptions, technically you'd need one here too for championships, but for me, multiple endurance races that are hosted here are completely enough. You have access to them based on your mentioned safety rating, and you're mostly paired with people of similar driver rank/skill, but that varies from game to game.\n\nSingle-player racing is fine, although I'm not very impressed with the AI. For that, as well as variety and private lobbies, I prefer AMS2.\n\nOh, and maybe for some, it's worth adding that the game plays great with a controller too - not much worse than Gran Turismo, so you might do well in more predictable cars. You will never be as consistent as with a wheel, though, and you'll mess up much more often than with a wheel. You'll also have extra controller assists; hence, with some exceptions, controller players are often not very liked in online sim racing :P",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "safety rating system is a little too harsh imo, but the driving + feel of the gt3s are top notch.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Le Mans Ultimate is an outstanding racing title that delivers one of the most immersive endurance-racing experiences available today. The driving physics feel incredibly authentic, the force feedback is detailed and responsive, and every car behaves in a way that rewards precision and consistency. The dynamic weather and day-night transitions add a level of realism that truly elevates each race.\r\n\r\nThe sound design is powerful, the visuals are polished, and the overall atmosphere perfectly captures the intensity of real endurance racing. Whether you race solo or online, the game provides a deep and satisfying experience for both newcomers and experienced sim racers. It is clear the developers are continuously improving the game, and the progress already made is impressive.\r\n\r\nOverall, LMU feels like the future of endurance racing sims: challenging, rewarding, and genuinely thrilling from start to finish.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, although is annoying everything being locked behind a paywall",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the best racing sims availiable right now. Great GT3s and easily the best hypercars",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After 110 hours, I recommend this game. If you like endurance races this game is the way to go. The graphics are good, the community is good (of course there are rammers, but not 100% in all races) and this game is continue to improve in every update.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, still got some bugs and sometimes it crashes but got good graphics, good audio. Oh and the V12 sounds amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Connectivity issues are annoying beyond belief, but, at its core, this game is the best racing simulator for GT3, GTE, Hypers, LMP2 and LMP3 on the market right now. Visuals are great, optimisation is decent and I could sing songs of praise to the FFB for hours - you get insane level of information and feedback from the car, the tire model on Hypers can feel a bit rough at the start of the race/after a stop, but you get used to it quick, and from what I can gather, watching WEC and IMSA, it is still pretty realistic.\r\nNetcode is beautiful, allowing to actually race wheel-to-wheel, unlike iRacing, without sending each other to the shadowrealm instantly.\r\nMonetization can seem daunting, but as long as you get the base game and the Season Pass on a slight discount - its genuienly worth it. Really hope that the developers will resolve their financial issues and continue their work on this project, ensuring its bright future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Very fun and challenging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of those games where hours can feel like nothing, best racing game out, you can feel they actually care about this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FFB and Visuals are amazing, cars feel very different from each other and there is at least 1 event every 20 minutes, my only complaint is some small annoying bugs (FFB might be turned off once when first racing unless you fully stop)  everything else feels great and the DLC brings quality cars and tracks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Theres a lot of bugs in the online part of this game. But on the whole, if you take the online server experience away, the game is great. Cars handle nicely",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game a bit sad that its filled with subscriptions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really great sim for people who like WEC, although the game has lots of dlc's for the GT3 class cars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great racing, still needs some development to make 0x contacts, some off tracks are a little too harsh given the situations and you will get a stop and go or dt for dodging chaos and rejoining, Other then that the cars drive great, just want more, more car like gt4 gt2 fwd etc. more cars more tracks plz love the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sehr gutes game, Pits sind auch gut umgesetzt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are a serious sim racer looking for the ultimate WEC experience, Le Mans Ultimate is a must-have for your Steam library. What will immediately grab you is the sensational feel of the cars, thanks to the game's class-leading physics and fantastic force feedback—you can genuinely feel the tires working underneath you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so fun to play, even with controller. the gt3/gte class is perfect for casual \"sunday morning ride\" meanwhile the hypercar feels like riding a rollercoaster. i'm a casual and offline guy so i hope in the future there will be a career mode :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, good feeling, but needs a championship mode.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "imho this is my favourite sim!, it's far from perfect and online lobbies can feel like you're playing Wreckfest or something, but if you happen to find a good lobby it's the best racing experience you can get.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, multiplayer is a bit weird but overall its a fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good just waiting for things like career mode and free online feature. Could do with an easier way to play with friends online",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Realistic and easily one of the best racing sims I’ve played. I still suck at it, but it’s totally worth it if you’re into proper sim racing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best Titles for simulation racing now they have patched the net code issues and sorted the crashing issues the game suffered from when it came out. constant content and patches keep this game rolling, cars handle amazingly and will punish you if you push them too far. Tyre model feels amazing damage physics can be brutal but forgiving if you dont spin out and smash a wall at 120mph. And with the drop of ELMS this game is just getting better and reaching more into more areas of Endurance racing. \r\n\r\n10/10 I pray for IMSA DLC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far better than iRacing, just switched from it. Hopefully multiplayer gets to the level iRacing is because thats the only thing it lacks but its getting more and more popular!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of best sim racing games in 2020s\nYou need special skills to drive whitout any assist within the game;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Le Mans Ultimate is a game made by people who truly live and breathe racing. It's just you, your car, and a long track. Both the cars and the tracks feel very realistic. I like that there are several racing classes and that you can feel the tires working. The most annoying thing is the strict safety rules. Because there are a lot of noobs in the default lobby, it's very difficult to get high ratings and race with normal people. There is a very good variety of tracks and cars to choose from.Overall, it's a very good game if you like racing in GT3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the best modern Sim Racing game. I just dont like livery being locked behind a paytwall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game doesn't talk about love, just have cars and no picanha e feijoada but i love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game feels surprisingly well on controller and is genuinely fun to race around the tracks with the different gt3, gte and other classes. The only bad thing is the really dirty drivers but any racing game has them so its really really minor negative aspect of the game. Otherwise the game is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great with great phisics, but the comunity is just completely stupid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game don't get me wrong, but the game stop detecing my Wheel when my laptop said it was connected",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great physics but really expensive game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing LMU since the early access launch and have been happy with the progress Studio 397 continue to make. The single player is solid and you can always find competitive races in-game, without needing any 3rd party websites. The driver ranking system is not ground breaking, but its functional. There are a descent number of tracks, and track configurations with more coming (Paul Ricard and Barcelona imminently), a variety of cars and classes and its now in a reasonably stable state. \n\nIf you have been on the fence for a while, the Sim is in a great space. Grab it during the sale for even greater value. You won't regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really like the game, its really funny , it has excellent graphics,and physics, i really recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the better new sims in term of physics. Maybe a bit too much dlc, but the cars you get for free are more then competitive enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Simulador oficial do FIA WEC[/h1]\r\n\r\nLe Mans Ultimate, que utiliza a base do RFactor 2, um dos melhores simuladores, também tem sua própria identidade, com destaque para o sistema de bans para jogadores sujos para o modo online.\r\nPara iniciantes, o jogo não é muito amigável, mas para quem boa experiência em vr, o jogo fornece uma boa opção.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the Best racing games I have I do love the car models and how real they feel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best racing experience that you can buy. The devs has been constantly improving the game from feedback and have the most open communication with the community. It is suited to both experienced and casual sim racers, online and offline (devs announced career coming in early 2026). Majority of my hours have been in VR because it is one of the [b]best running sim title out there for VR[/b].",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coming from ACC\\iRacing, I love it.  Right out of the box the FFB settings on my DD Pro that I used for iRacing worked perfectly.   I did kick up the brake pressure to help with those GTEs.  Great experience so far and don't regret the buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great physics and handling. If you are new, don't like iRacing subscription model but still want a good online racing experience, this is a decent alternative and the ranking system is nice (though it still need some polishing). The community is really nice and helpful as well (You will find douchbag times to times but this can be said for every game)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing the game for a while and I must say I like it more than Assetto Corsa Competizione or RaceRoom. A friend and I made one of the driver swap tests and we had a lot of fun despite the issues we had during the race.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good realistic game love it but its a grind to get out off bronze rating",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with a great tire model but the penalty system sucks imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definetely realistic, could do with some improvements to the license system though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. Obviously you''ll never find a game where everyone is clean, however this one is where I've  managed to participate in more clean lobbys than on other games.\r\nIt also works okay on Linux (and I suppose Steam Deck too) once you install a custom Proton build, note that you may encounter some stuttering and performance issues so I hope there will be improvements in the future. \r\nLooking forward to 2026 with the entrance of Genesis in the Hypercar category, as well as 2027 with McLaren and Ford... I'm sure the team will continue working on this already awesome game.\r\n\r\nIve got one suggestion though, it would be great to have the possibility to mix Hypercars and GT3s of various years, for example having a grid with all HY manufacturers from Glickenhaus, to Isotta to Aston Martin. Thank you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really love this game. The realism is pretty cool and the cars are awesome. Really recommend buying this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly the best sim racer on the market rn, only downside is how lot of the monetisation is handled but even then its vastly more accessable than something like iracing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, just my steering wheel doesn't seem to work perfectly fine (Logitech g923). If anyone could help please do because the ffb seems to weak and doesn't steer correctly always (sometimes delay). Other then that: Wonderfull game , models i'll def use this as my main sim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who recently got into sim racing, Le Mans Ultimate has completely blown me away. I’ve picked up several sim racing games to compare, but this one stands out as the most immersive by far. The force feedback is incredible. Every bump, slip, and weight shift comes through the wheel so clearly that you really feel the car beneath you.\n\nMultiplayer has been great too. Sure, you’ll always run into a few aggressive drivers or the occasional crash, but that’s just part of online racing in any game. Overall, the experience is smooth, competitive, and a lot of fun.\n\nCo-op is where this game really shines for me. Racing with friends, coordinating strategies, and tackling long stints together genuinely brings you together as a team. It adds a whole new layer of excitement.\n\nHonestly, I can’t think of anything bad to say about this game. If you’re into sim racing or even just starting like I am, Le Mans Ultimate is absolutely worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is really good. Cars feel great to drive. The handling feels really realistic and the tire model is spot on. Only minus is that you can't create your own multiplayer lobby.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great, but unfortunately there are a lot of players who totally disregard all racing etiquettes.\nAlso, it is very difficult, one can say next to impossible, to report a guy that intentionally wrecks you. \nRemember guys: Only an i***t goes for a gap that doesn’t exist!\nCheers!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Much better matchmaking then ACC, the GT3s feel more technical and seem to have significantly less downforce. There is alot of content for an early access game, but not so much that its overwhelming for a newer player. Probably one of the best sim titles to start competitive racing in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Real simulation! Great AI. Accurate physics! A++",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing Game, Amazing Graphics, Damage Model Good, Community and drivers iffy, But My favorite racing game so far and had the best experiences and a couple wins. 10/10 game the community could be way better though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great base gameplay but still needs a ton of features to compete with the other big simracing titles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best sim out there without paying for a subscription (like iRacing had). You don’t need Racecontrol Pro and that makes it a really good and affordable game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun multiplayer system, good netcode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool autosim, with very good physics, cool graphic and excellent force feedback. I like this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best looking (graphically) racing games of all time. Fun multiplayer too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Outstanding graphics. Active devs. with multiple endureance races. One thing tho I use g923, probably %80 casual simracer do as well, and force feedback is quite weak compare to iracing, so bad that u forget u are try to tame an hyper car that could go 200 miles on muelseena(what ever xD) straight u have 0 feel. I dont know if game has no support or they are not on point with that so I didnt really enjoy playing that is the only weak I point I had. Would be cool if we have iconic race cars like 69's GT40, vintage racer damn.. that woudl be cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Le Mans Ultimate is an impressive racing simulator that captures the spirit of endurance racing exceptionally well.\nFor me, it's one of the best simulation games on the market, with constant updates that will make it the best car simulator of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a go-to sim for online racing and for multi-class racing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's Nov 22nd, 2025. The game is still not mature yet. Online pings are high, FFB constantly loses feel and require to set a button on steering wheel to reset. Sexondly, the ranking method to filter bad drivers isn't showing progress. Lastly, I still can't find a way to report errant drivers. My advise, nothing to lose if you can hold on to the purchase and buy it in another 12 months or so",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i get a real good work out with the force feedback and i would get this game as it s base off the real thing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good racing sim with great physics and cars feel actually drivable, looks great and is probably the most fun sim racing game n the market atm, it is still new and has a lot of work to be done so more content is added, but for now its great. Only negative is still the sim racing need of having to be really expensive, cars and tracks are almost all DLCs and some features locked behind the sub, not even close to something like iRacing ofc but still needs to be pointed out compared to other games of different genres.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Multiplayer experience in racing atm.\n\nAlso the special Events are realy fun to drive with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but it takes freaking forever!!!!!!!!!!!!!!!!!!!!!!!!!!!! to rank up in online racing. something needs to fixed about that!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Haven't done a race yet, did a few practice laps, was surprised to see other cars in practice.  Very cool, doesn't exist in GT7.  I did have the best lap time, which was exciting.  But i'm still working on the basic workings of the game.  Like the MFD & etc...  I think it's a solid sim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game if it weren't for the SHOCKING instability even post V1.1. 7 hours into an 8 hour race and it had already crashed on me twice and then three times even tho I had set the quality to medium to low, GPU not overclocked, CPU at its advertised 4.2Ghz, 32GB of ram, game on a Sata SSD. I even reinstalled a fresh widows installation just in case prior to the race. We had top five pace within our split and it got absolutely DESTROYED by instability. Not everyone can afford RTX  for crying out loud and we shouldn't cuz it's a simulatior not an arcade, yes do implement top-tier graphics for people who have the horsepower for it, but at the same time I'd love to finish a race on my-still valid GTX 1070.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the way I just had to set up my Logitech G29 Driving Force and just hit the track, I've played other games but this one was the easiest to set up. I have a one problem and it is not being able to find the steering sensibility in the setting filter (I don't know if this game has one or not).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good online racing, cars feel great, game is decently optimised",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Besides the f***** subscription model I really like the game.\n\n- Great Graphics\n- Great Sound\n- Great Physics\n\nJust wish there were more tracks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a great game its just a shame the people you race with in the daily races are brain dead, stuck never levelling up because of other drivers, another thing is not being able play with your friends unless you pay to host a session after buying the game and having to pay the subscription to use the cars and tracks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, physics are very good nothing bad to say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This simracing game is taking the market by storm for a reason. As something that started out as a completely buggy unoptimized mess. It crawled through the bad times and kept on improving. Now we have a great game. as alot of real drivers said. its the most realistic racing sim on the market.\n\nThe one aspect that outshines EVERY other sim on the market. is its netcode. Ive not had a singular piece of contact where ive felt netcode was at play. The netcode is outstanding and allows for some great close racing.\nIve not had this much fun racing random people as on other sims. it just feels so good. \n\nId say the game is only getting better with each update. i really recommend buying it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came here from acc. Needs mouse steering option and a little optimization then the game will be very good, Its still pretty good now. surface and tire physics are amazing. but please quit making subscription system. The game itself isn't cheap, the DLC isn't cheap, and if you want to participate in a championship, you need a subscription. Do not be like iracing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing and insanely good game. Most of the sim games are decades behind the gaming industry and don't realize that what we want from a simracing game are, guess what, RACES, and having guaranteed competitive races really whenever you want, with good matchmaking and a good netcode.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "prior to my old review i decided to change it, this game is great, racing is great but be careful and catious in low splits as alot of drivers fail to leave space, but one you move up its amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really, really like this game. I have been asking to get a game for WEC since November 2022 and 3 years later version 1.0 dropped and it's all I could ask for. The cars feel and sound amazing, it's as immersive as it gets, the racing itself is amazing and I can't wait to see what the devs will add next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I generally like Le Mans Ultimate. The cars, the tracks and the racing feels quite all right. Online can be fun and enjoyable but if race in offline mode it can get a little lame and some of the AI feels a little odd considering a Hyper Car rammed my rear end during a race instead of slowing down but overall great game. Just wish the AI could be improved.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game itself I really like, driving feels great. BUT..... The rating system needs serious work along with the reporting, I'm tiered of having major chunks of my safety rating being lost because people fly into you at mach jesus for qualifying ahead of them or idiots divebombing turn 1 and messing up races for everyone else",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Good Game. Nice Physics but it could be improved in type of rules",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun to play love everything about it only sad part is the extra you basically have to pay for the tracks and cars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Good Physics\nVery Good Handling\nOutstanding graphics (Even better if there was DLSS Support)\nFeels very realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely hate this game. I seem to always get bad luck, and when i don't, i f*ck it up myself. I spend more time shouting and insulting people, then anything else. But I come back almost everyday to play it, so make of that what you will.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VR racing at night becomes a horror game when the Hypercars fly past you in a GT3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Out of the short list of populated racing sims (iRacing, ACE, ACC, AC, AMS2 and RRRE) as it stands now LMU is the best bang for your buck for simulating WEC racing/racing in general. I'm based in North America so hopefully in time participation around the 6pm-10pm picks up even more, but I don't have much issues finding races during the popular EU and NA times. Also, I played from day 1, so seeing where this sim is now is actually impressive and I appreciate all the back and forth communication with the devs and the community. Studio 397 has definitely redeemed their reputation imo. The way that they handled rfactor 2 left a sour taste in my mouth, but their latest installation of LMU is quite a refreshing palate cleanser.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Dogshit game, full of stupid subscriptions and server rentals... YOU CAN'T EVEN PLAY PRIVATE LOBBY WITH A FRIEND??? wtf is this garbage game - don't buy unless you want to be scammed out of your money.\n\nGame in 2025 with no private lobby feature - upselling you on shitty server hosting that you also coincidentally can't self-host either. Nice one. Eat shit.",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "game is in final release state, yet the developer makes \"special events\" naming them tests to avoid taking responsibility when they inevitably mess up.\nmessups include intentional actions such as restarting the servers minutes before a major event is starting. \nthey do NOT communicate any information to the players at all, if you want any information you have to constantly monitor their discord server for random messages written by their \"staff\" (which includes non staff too) in the general chats of which there are multiple, additionally if you ask any questions that put in doubt whether or not the staff has done the right thing you risk getting muted or outright banned.\n\nthis game IS STILL in the first stages of development even though the devs have clearly marked it as being a finished product by taking it out of early access.\n\nwriting this review to inform future potential buyers of this scam is a massive risk, and i would hope that if the staff of the game see fit to ban me for informing others of this that valve will force a refund and hopefully file a lawsuit against studio 397 for the act of illegal information control and vigilantism.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I can’t find a solution. The game keeps crashing in online sessions all the time. It’s a shame — the driving itself is actually pretty good, the FFB feels fine, and it could have been a great addition to iRacing. But right now it’s pretty messed up: driving standards are getting worse, and with all the bugs and crashes it has become unplayable for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is everything wrong with the gaming industry. Looks to be absolutely awesome. Very limited single player, and cannot get into any single lobby online without buying DLCS. I spent most of my time trying to find a lobby i could actually get into without buying a DLC.\n\nFrom everything ive heard LMU is awesome, but ill never know because when you buy the game, you are only buying access for the DLCS you are really going to have to buy, to work. Pathetic.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "safety rating means nothing in this game, report system is not working and every race is literally carnage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good racing game with lacking content and issues that drive me up the wall.\nReal pitty that the game limited itsself to WEC content. Only a couple of good tracks in the game. Having to pay monthly for being allowed to add your own livery or registering to races before their actual timeframe is a joke and cashgrab. I know, compare it to IRacing, but then think of the content you can race in IRacing and what you can race here.\nYou cant register to daily races if the timer to start is below some 30 seconds, which often times you will not make if your current race took a little longer. Properly only done to push you towards their subscription model.\nAlso implements stupid WEC rules that nobody gives a shit about but will cost you a 2 minutes stop and go just because you ran your fuel tank below 1%. Only way to learn that is the hard way, noone will tell you, not even your pit crew.\nWhy you cant set up your first pit stop before the race starts is beyond me. Instead you then have to fiddle with the buttons on your wheel to tell your crew what you want, fuel amount, tires, repairs, etc.\nOnce you are in the session you also cant see the fuel consumption multiplier anymore or any other session settings like tire warmers or required pit stops. So, take your guess on how much fuel you actually need when you click that \"grid\" button.\nSo ya, real shame, racing feels actually great, but I guess we have a good example on how to fk up your game. But its ok, take early access to add content that you charge money for instead of ironing out stupid shit like I mentioned. Its fine, fits the corrupt FIA and WEC. gg",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not get this game if you have an intel gpu , they fail to mention that you cant even load half of the tracks without crashing even if your intel gpu supercedes the recommended requirements. And the developers have done absolutely nothing useful to fix these issues",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't buy this sh*t, support is awful, servers are just patatoes, they can' write or speak anything, just vad excuses, go play Iracing instead, way better community",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "200 reais em um jogo\n\n-Essa pista está bloqueada por DLC\n\n-Esse carro está bloquado por DLC\n\n-O jogo não tem modo vs ia até o momento\n\nComplicado dar uma review boa nessas condições...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Warning only part of a game, purchased what I thought was going to be a whole game not a game with just a couple of tracks still waiting for a full version of the game, early access they call it (i call it a scam). It's funny they have time to make addons for this game but no time to give us people a full game that we paid for, you won't ever get more money from me, I prefer to purchase full games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the sim in general is good, been taking a break from iracing recently, but there are some major issues that need to be addressed. The loading times are soooooooo long, the game freezes sometimes, it gives you a white screen and you can't do anything, sudden FPS drops, force feedback cutting out for a moment and also crashes mid race. For now i'm giving it a negative, maybe those are just performance issues that will be resolved with future updates on which i'll keep an eye out. At this time, if you want to get in a good sim that doesn't have those issues, if you have the money of course, i'd opt for iracing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Graphics sound and feel of the cars is lacking compared to ACC, it almost looks cartoony despite high settings had high hopes but was left feeling let down, lets hope it improves but i will not be buying any additional content in the mean time!\n \nAt the moment this is a no go because there are no single player championships and they are already asking money for season passes. The game is not finished. The ONLY single player mode that exists at the moment are quick races.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let's see , ONLINE needs to let you ban Immediately not after 1 hour of cooldown , game online especially rookies is more of a rollercoaster than a racing game enough is enough , data plugin theres not even an idea, get your shit together or im done...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game \nPros:\n-good for online racing\n-decent physics \n-good handling\n-good graphics\n-proximity sensor\n\nCons\n-most of the content costs more money- you need to buy DLC\n-in silver safety rated races track limits is very bugged \n-you will lose safety rating for collisions that arent your fault\n-no one is punished for dirty racing\n-backmarkers often take out leaders and nothing is done about it\n-damage realism needs work\n-whole rank system is messed up\n-track limits are messed up\n\n\nwould not reccommend buying this game until developers do major work the cons ruin the whole game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "-Updated Review-\nTDLR: If you are a casual \"daily race\" player/sim racer. This is no longer our game. Becoming more like iSkating.\n\nThey’re artificially inflating the splits count (so it feels like there is more players playing) by making daily races hourly. Now need to wait 20 minutes for the next race for the same category. No more back to back races.\n\nI only race GT3s. I got no time to practice and don't care about setups cause they're not even close to realism.\nI just want a sim game to hop on with less than 5 clicks and play when I have the free time at ANY TIME.\n\n(So if I miss the hourly mark...Might as well go back to the GOAT OG AC.)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is great fun, but if you so much as lightly touch anyone online, you get banned for a week.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If there would be a \"maybe\" answer to the question do I recommend this game, that would be it.\n\nThe sim is amazing, drives awesome and racing can be very clean and fun depending on the people you get placed with.\n\nMy biggest concern is how much glitches and bugs there are in the game currently. They make the whole experience really frustrating, unable to join the race i singed up for while everything else works online, pretty common freezes and optimization in general, weird visual glitches I get in menus and on some tracks. Also every single time session ends it freezes to the point I cannot shut down the sim, as well as when I go back to pits and change something in the setup, the game also freezes for about 10-15s every time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Want to use custom liveries? Pay a subscription.\r\nWant to be able to report people that intentionally wreck? Pay a subscription.\r\nWant to take part in any sort of championship? Pay a subscription\r\n\r\nThis is a full price game, and one of the first things you realise is that if you want to do things you can do in other games, for free, is that it's all hidden behind a paywall.\r\n\r\niRacing is a subscription, but that includes everything, and it has served the community well for the monthly subscription. I fail to see why basic things require me to pay more money on top of a full pri.. Oh wait, studio/shareholder greed takes priority over the user experience. Of course it does!\r\n\r\nBuy ACC instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't buy this sh*t, support is awful, servers are just patatoes, they can' write or speak anything, just vad excuses, go play Iracing instead, way better community",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just stick with AC or ACC. All your doing is re buying the same but less. Just another money grab.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Legitimately zero moderation in online play except a flimsy safety rating. The children that can't drive will just pit you and get no punishment. If I'd known, I wouldn't have wasted my money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game constantly gets \"connection lost\" mid race or right near the end since 1.0v update nearly on a daily basis and DEVS say it is a \"connectivity issue\" even though i have 1 Gig download and 1 Gid upload with google fiber lol absolute joke.... im not the only person with this issie many others have made reports to just be ignored by staff in thier discord server.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Huge loading times, ambitious pricing, terrible UI, physics are good but it's a hyper-focused product and if you're not ready to spend £250+ to enjoy 7 tracks then look elsewhere.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't understand the hype around this game. The FFB is awful, you feel absolutely nothing in low speed turns, but then on straights my wheelbase vibrates like crazy. Also, wtf with the ABS system, literally shakes my entire rig when I'm braking because the tires are \"cold\"... so stupid. Lastly, there is a pay wall in front of every car and track in this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "worst rank system i have ever tried in my life u will lost all your rating because someone crash in to u for no reason anddd to get ur rank back u need a whole weak for it to just return ur rank back that some idiot crash u in one game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can they finally fix the audio that disappears when joining a race all the time? Community talks about it for ages!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lets start with the good:\n- Physics are great. I like the FFB on my Simagic Alpha.\n- Close racing is possible without getting killed instantly.\n- The netcode is solid.\n- The cars feel alive and are well made.\n\nNeutral:\n- No modding-support\n- Content is limited, but the content is well executed\n- Why is there no seperat driver rating for each class... It forces people to stay within their class or they get destroyed and drop in rating\n- Singleplayer is solid, but why can't I mix classes and cars from different years???\n\nBad:\n- The pricing structure is bad and feels unnacessary greedy. The value for their subcription is just bad.\n- No possibility to drive with friends on a dedicated server. \n- Custom skins even for singleplayer are behind a paywall.\n\nDue their pricing strategy and no offline MP I can't recommend the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Might as well call this \"Boat Ultimate\" because a boat is exactly how the cars feel while driving in this sim.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont buy if you use a logitech g29 or similar wheel, ffb is awful clips constantly tried tweaking all the settings your better off playing on controller spent 3 and a half hours trying to fix it so can't get refund otherwise I would",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too bug many times cannot control the mouse, and many times my wheel turn off FFB by itself, i need to turn it back again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Random crashes mid race, ffb issues with the Moza R3 Wheel and Pedals. Way too many trolls, expect to have your every 5th race ruined by inconsiderate douchebags. Terrible matchmaking.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Still no proton/linux support it's sad to see that ...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "IF YOU WANT TO RAGEBAIT, MAKE URSELF MORE ANGRY, LOSE YOUR MIND, SIGN UP FOR RACES BUT NOT ALLOWED TO GET IN AT ALL,  AND WHEN U FEEDBACK TO THE DEVS, THEY EMPLOY STALIN ERA,HITLER AHHHH, JOSEPH GOEBELS AHHH TACTICS AND RAGEBAIT YOU, GET THEIR CUCK BOOTLICKING DISCORD MOD WANNABES WHO NEED TO TOUCH GRASS QUITE FRANKLY IN MY OPINION TO SUCK THEM OFF AND MAKE IT SEEM LIKE THEY ARE POOR GAME DEVS DEALING WITH UNREASONABLE REQUESTS, FRANKLY STUDIO397 NEEDS TO LEARN, THERES A REASON WHY AC IS SO ACTIVE BUT RF2 IS DEAD. THEY BASICALLY MADE A NEW SKIN OF RF2 BUT WITH EXTRA ERRORS, FRANKLY ANYONE WHO PLAYS DAILIES IN THIS GAME IS GAY AND DESERVES TO BE SENT TO NORTH SENTINEL ISLAND TO LIVE WITH SAVAGES, I RATHER PLAY ACC FOR THE REST OF MY LIFE THAN THIS SHIT GAME, NOTHING WORKS, AND THE DEVS FOCUS ON BLOCKING THE CONSTRUCTIVE, NOT EVEN CRITICISM, THEN WORK ON THE GAME, THIS GAME SHLD HAVE NEVER LEFT THEIR TEST STATIONS, LET ALONE ENTER INTO EARLY ACCESS, ANYONE WHO TOUCHES THIS GAME SHLD BE PAID TO PLAY, FROM BUTTONS TAKING AGES TO LOAD, TO FFB GOING TO 0 AND EVEN REVERSING, TO COMPLETELY SHIT CRASH PHYSCIS AND GRAVEL WHERE PEOPLE CRASH AND DO FUCKING 720S AND DONUTS, RUINING OTHERS RACES, AND A MESSED UP LOGIC, \"OH WE WANT TO BE REALISTIC, BUT YET ALLOWS 3RD PERSON VIEWS, EXTREMELY FAST REPAIRS, ETC\" PLUS THE DEVS ARE CORRUPT AS FUCK AND TREAT PUBLIC LOBBIES AS THEIR OWN PRIVATE LOBBIES. AND BEING THE GENIUSES THEY ARE, THEY MAKE FIXES FOR THEIR OWN SHIT WORK INSTEAD OF ACTUALLY FIXING THE WORK. IM SURPRISED THE GAME EVEN LAUNCHES, THE DEVS SPEND MORE TIME MODERATING THEIR SHITTY ASS DISCORD THEN UPDATING THE GAME, AND THEY ASK FOR CRASH LOGS,  BUT THEY MUST BE WANKING WITH THEM COS NOTHING FUCKING WORKS STILL,  EVEB IF U RECEIVE IT FREE, AVOID IF U WANNA STAY SANE.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Please fix the sound issue as soon as possible. There's sound in the menu interface when using the DAC, but no sound in the race.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is good and i would recommend it but if you are a livery maker and want to use the livery u make in game u need to sub mothly for 8 quid or 48 a year which is scam just to upload or use a skin in a racing game,this in my opinion a scammey thing to do like why ? i hop this changes as this is a dirty way to getting money out of ur players",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Physics seems great, graphics and sound is amazing, was impressed at first, but...\n\n1. Menu cannot be controlled with the wheel, but only with mouse/keyboard. Even with wireless K400 with touch-pad it is just ridiculous and unpractical. \n\n2. Insane vibrations on Moza DD wheelbase, tried many presets within Moza Pithouse, even importing and editing custom json files found online. Annoying, unrealistic and unplayable. \n\n3. In-game purchases, locked contents and subscriptions. Classic modern greed.\n\nRefunded :)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After purchasing a game prior to release, supporting the devs, the worst thing they could do is release DLC and lock soo much of the game. \r\nIt does have a good feel with a DD wheel, good but poorly optimised graphics, but the content packs are beyond a joke. \r\nWish I never purchased it.\r\nIf you do not mind consistently buying tracks, cars and DLC it will be ok. Its almost as bad as pay to play.\r\nPurchased a season pass thinking I would be able play and join any race, again, I was wrong. \r\nWhy do we allow devs to do this? This is becoming the norm, release half baked game, request support then shaft everyone. People who purchased pre release should get DLC for free, at least for first year or so.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Get taken out and then cant race in another even until the ruined one ends. Just let me fucking drive holy shit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ranking system is good but i moved from ACC and wanted to play hypercars. The problem is that it wont let you unless you have better rank. I finished most of my races in top 5 but still i am nowhere with this fucking ranking system. Give all players hypercars but filter servers with ranks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it is not vr compatible. quite sad (i only play in vr)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I star your vr controls suck would not recommend.  Useless!!! Buy AM2 Instead.\nDevs should take lessons.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Persistent steering base issues with force feedback",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "every one is crashing and you cant even drive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a lot of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As of 15 Nov 2025, the game locks up.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is half decent",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "retard central",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ui sucks in vr",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "useless",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NOT GOOD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a shame, theres so many things that arent great about the game that the things which are good about it are overshadowed, LMU could be a great simracer i could frequent a lot, but i end up growing frustrated every time i play, here's why;\n\n## The Good\nThe online multiplayer works decently well. I’ve only gotten disconnected once in my entire time playing, and I could reconnect immediately. No major lag spikes or other issues to speak of. How your rank and safety rating change is explained in the post-game summary, which makes improving your racing relatively easy.    \n\nThe sounds are good. Cars sound authentic, and while some cars are a lot louder than others in the cockpit, it’s not a dealbreaker. The audio is immersive and well done.   \n\nThe FFB is decent, though maybe a bit overtuned in my experience. Curbs are extremely obvious, and so is locking or sliding. What the car is doing is pretty clear from the feedback alone.   \n\nGraphics are serviceable and look up to date. There are some points I’ll touch on later, but overall, the visuals hold up with other games like LMU.\n\n## The Bad\nThe tyre model is, in my experience, utterly terrible. Grip loss is hard to understand. Overdriving your tyres in any way makes your grip vanish completely. Locking your brakes is a guaranteed spin. Wheel-spinning out of corners usually ends in one too. Even compared to other games on the same engine, I don’t have nearly as many problems with the tyres as in LMU. I hate it, and I really hope that the developers will work on improving these tyres.\n\nFlashing your brights is way too effective. Even with high beams being enabled by default, flashing your lights overpowers all other lights on track. Meaning someone 100 meters back can make the entire track in front of you flash, It’s completely unrealistic.\n\nAlso, flashing lights don’t seem to respect walls. If someone spams their flashers on a track with tight sections, you’ll see the flashes through walls. It’s hugely distracting and very annoying. \n\n## The Ugly\nThe game’s pricing structure is unclear at best and almost deceptive at worst. You end up paying over double the price just to get all the content they offer. Plus, there’s subscription nonsense in the game that isn’t visible on the store page before you buy. The developers basically want to charge you multiple times for content and features.\n\nThe RaceControl Pro and Pro+ subscriptions aren’t clearly explained before purchase. You’re led to believe you’re buying a complete game, but in reality, you’re only getting a fraction of it.\n\n## The Summary\nDespite decent audio, stable online play, and decent visuals, the game’s core systems, especially tire physics and lighting at night, are broken in ways that destroy my enjoyment of the game, combined with a misleading monetization model these issues make it impossible to recommend at full price, or any price, really.",
      "voted_up": false,
      "votes_helpful": 119
    },
    {
      "review": "Pros:\n- Great visuals\n- Clean menus \n- Driving feels fantastic\n- Lots of assistance options to tailor difficulty to skill\n- lots of realistic options mirroring WEC ruleset\n\nCons:\n- Mouse only control in menus, quite painful for anyone in a Sim rig or using a controller for that matter\n- Single player content is bare bones, there is no career mode/championship mode\n- There is no way to locally host private lobbies to play with friends, you can pay for a private server (pay per use) which is absurd being the only option\n- Pricing is exorbitant when you consider the content you get, you need to buy 5 DLC packs at an average of $20 each just to get the game to a level of content comparable to other sims\n\nAll in all the game feels like a money grab, light on content while still at full price (once you add obligatory DLC). Its a shame because the bones of the game are very solid. Hope that it improves over time.",
      "voted_up": false,
      "votes_helpful": 94
    },
    {
      "review": "not a fan of being hit with a DLC pop-up every time i click on a track i don't get in the base game.",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "This is not a game for single players. If you are looking for good single player racing against AI, you need to look elsewhere as there are soooo many others out there who do it better, have career modes, and have all the content given to you up front.  This game is for multiplayer only, and even then, only if you are going to open up your wallet to the current marketing scam.  What they don't tell you about multiplayer (or even single player) is that to do some of the things you would think would be part of the base game, you have to pay a subscription for. Even then, to get certain cars and tracks, you still need to pay more money for those as well. Even now, they are releasing two or 3 cars at a time, maybe 1 track, and counting those as \"DLCs\", and pushing them out each with their own price tag. To play multiplayer, you must own the same tracks as everyone else, of course, and the multiplayer tracks are on a schedule.  Don't own the track?  You can't join the \"Gold Ranked\" race, for instance, going on that night.  By the time you are adding up the subscriptions, and/or the DLC's and eveything else, this game is going to cost your much, much, more than the base game price. I'm not interested in participating in that type of business scam any further.\r\n\r\nThe netcode for LeMans is pretty awesome, but its not awesome enough to keep me paying a sub and more dollars for cars and tracks.  Back to Assetto Corsa and LFM for me.",
      "voted_up": false,
      "votes_helpful": 75
    },
    {
      "review": "Dogshit game, full of stupid subscriptions and server rentals... YOU CAN'T EVEN PLAY PRIVATE LOBBY WITH A FRIEND??? wtf is this garbage game - don't buy unless you want to be scammed out of your money.\n\nGame in 2025 with no private lobby feature - upselling you on shitty server hosting that you also coincidentally can't self-host either. Nice one. Eat shit.",
      "voted_up": false,
      "votes_helpful": 91
    },
    {
      "review": "At the moment this is a no go because there are no single player championships and they are already asking money for season passes. The game is not finished. The ONLY singleplayer mode that exists at the moment are quick races.\n\nThis game has great potential that is ruined by greed. Endurance racing fits eracing perfectly and driving model is actually decent. It is just a shame developed care more about milking the license than delivering a good racing game.",
      "voted_up": false,
      "votes_helpful": 75
    },
    {
      "review": "game is in final release state, yet the developer makes \"special events\" naming them tests to avoid taking responsibility when they inevitably mess up.\nmessups include intentional actions such as restarting the servers minutes before a major event is starting. \nthey do NOT communicate any information to the players at all, if you want any information you have to constantly monitor their discord server for random messages written by their \"staff\" (which includes non staff too) in the general chats of which there are multiple, additionally if you ask any questions that put in doubt whether or not the staff has done the right thing you risk getting muted or outright banned.\n\nthis game IS STILL in the first stages of development even though the devs have clearly marked it as being a finished product by taking it out of early access.\n\nwriting this review to inform future potential buyers of this scam is a massive risk, and i would hope that if the staff of the game see fit to ban me for informing others of this that valve will force a refund and hopefully file a lawsuit against studio 397 for the act of illegal information control and vigilantism.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Driving side of things very good.   The game side of things just utter shite.  Unless you are all MP there is nothing for you and if you think im paying £10 for a car and a track that I get in the base package of any other game, you can kiss my arse.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Coming from iRacing, the graphics run so much better than iRacing. Look so much better on the same PC. However the online side of the game is a like the wild west. Someone who span themselves out then took me out after the race had finished because I went past them whilst they were spinning.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "BETTER PAY FOR AN IRACING SUBSCRIPTION.\nSo....Let's get started.\nAre you a WEC fan and want to play an officially licensed game?\nThat's not it, because your gameplay won't look like a racing simulator, it's more like a pile of bugs and a completely broken netcode\nWould you like to drive the latest prototypes?Follow the hellish path to a Gold Safety Rating\nWhat is the difficulty of your journey? Maybe in strong rivals? Maybe it's the difficulty of driving a car? NO, your main rival in this piece of code is the developer who wrote it.After all, what could be better than sitting for an hour waiting for the race you need and not being able to connect to it?\nLe Mans Ultimate is a $90 lottery game whether you can even join the race or not.\nLe Mans Ultimate is a $90 game in which you will spend most of your time in the menu or software of your base software, because getting telemetry to work is also not an easy task.\nIf you squeeze it dry according to the aspects\n- The game is beautiful\n- Physics is acceptable\n-The sounds in the game are great\nHowever, there is nothing in the game except training and online, and no, this is not bad for the simulator...... If it weren't for one big and bold BUT, the netcode simply won't let you in, and all the developer can offer as a solution is time synchronization in Windows.\nThanks to Studio 387 for the skin on Rfactor2\n10 Unable to Join Server out of $90",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "so no proper single player as of yet cool whatever its still being made but what makes me think nah this game deserves a bad review i had to link my email to play the game like why is that needed it also won't stop anything just seems like they want to sell your data off like most companies",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not worth playing unless you own Direct Drive Wheel. FFB is basically nonexistent and dull on anything non-DD (I have TS-PC)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can’t find a solution. The game keeps crashing in online sessions all the time. It’s a shame — the driving itself is actually pretty good, the FFB feels fine, and it could have been a great addition to iRacing. But right now it’s pretty messed up: driving standards are getting worse, and with all the bugs and crashes it has become unplayable for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The punishment system is very bad, drivers hit your car and you are the one who will take the punishment, even if he makes you spin",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Do no waste you money and nerves, you spend 30 min on a race you try to drive clean, you let players past you and on monza t1 still 7 cars hit me and I have to race retire which then lowers my safety rating. Not to mention that content is behind your SA rating. Is it that hard to implement some sort of ghosting if you detect that ppl will just crush into you and ruin your game ? Garbage game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "great game and very fun to play,\r\nbut it crashes randomly, especially when entering qualifying and that sucks.\r\nIf they fix the crashes, this would easily be a game I could recommend.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is everything wrong with the gaming industry. Looks to be absolutely awesome. Very limited single player, and cannot get into any single lobby online without buying DLCS. I spent most of my time trying to find a lobby i could actually get into without buying a DLC.\n\nFrom everything ive heard LMU is awesome, but ill never know because when you buy the game, you are only buying access for the DLCS you are really going to have to buy, to work. Pathetic.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Pretty poor game. Physics are good.\nThe dev behind the jaring splash screen should have spent some more time on graphics instead.\nSo much content locked behind payment.\nPay for server.\nPay for car.\nForce feedback issues non stop.\nCrashes / lag when loading. Like what is it even loading?\n\nOverall mid-tier. Wish I bought on steam so I could have refunded it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game had so much potential to be great but its absolutely infuriating online. I Built an entire sim racing rig mostly to play this game online but it is unplayable. Mainly due to the punishments that are handed out to players that are not even at fault for a collision.\r\n\r\nFor example...\r\n\r\nYou're having an awesome race when someone cuts a corner across the grass, cuts you off forcing you to hit them... INSTANT DISQUALIFICATION!!! This happens in MOST races as morons frequent the lobbies, but its the innocent and serious racers that pay the price.\r\n\r\nExtremely disappointed. \r\n\r\nBack to iRacing for me",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "safety rating means nothing in this game, report system is not working and every race is literally carnage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good racing game with lacking content and issues that drive me up the wall.\nReal pitty that the game limited itsself to WEC content. Only a couple of good tracks in the game. Having to pay monthly for being allowed to add your own livery or registering to races before their actual timeframe is a joke and cashgrab. I know, compare it to IRacing, but then think of the content you can race in IRacing and what you can race here.\nYou cant register to daily races if the timer to start is below some 30 seconds, which often times you will not make if your current race took a little longer. Properly only done to push you towards their subscription model.\nAlso implements stupid WEC rules that nobody gives a shit about but will cost you a 2 minutes stop and go just because you ran your fuel tank below 1%. Only way to learn that is the hard way, noone will tell you, not even your pit crew.\nWhy you cant set up your first pit stop before the race starts is beyond me. Instead you then have to fiddle with the buttons on your wheel to tell your crew what you want, fuel amount, tires, repairs, etc.\nOnce you are in the session you also cant see the fuel consumption multiplier anymore or any other session settings like tire warmers or required pit stops. So, take your guess on how much fuel you actually need when you click that \"grid\" button.\nSo ya, real shame, racing feels actually great, but I guess we have a good example on how to fk up your game. But its ok, take early access to add content that you charge money for instead of ironing out stupid shit like I mentioned. Its fine, fits the corrupt FIA and WEC. gg",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game's physics are amazing but the drivers are horrible, every race there is someone that drives into you in some way and there is no consequences for their behaviour they drive as if they are playing bumper cars and it is near impossible to get your safety racing up",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game overall and for online racing, absolutely terrible FFB, as noted by pretty much everyone except people living in fantasy worlds.\nIm using a decent setup with simagic alpha evo pro and ffb is just empty half the time or overloaded in an instant...\nSame experience with fanatec clubsport DD. \nAnd other games dont give me that sloppy mess of FFB\nIts just hard to recommend until they fix FFB",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't under stand! it I've tried all the fixes in the world for this games and still runs that poorly and inconsistently that I've finally given up. my hardware is well above the recommended specs, and all i do is get constant game stuttering! Even in offline mode I don't seem to any luck. After 21hrs of swearing and researching over multiple weeks there is no way this game justifies what i paid for it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dogshit ass game that just refuses to work with my Fanatec CSL DD QR2 base for whatever reason. feels like shit, runs like shit, and looks like shit. if i could refund this steaming pile of dogshit i would. sadly ill stick it out on iRacing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Force Feedback breaks between sessions on older Thrustmaster wheels, known, unfixed issue for over a year.\n\nPractically impossible to do online racing or even AI races with training/qualifying sessions like this.\n\nEdit: While as the time played suggests, i have since bought a new Wheel at considerable expense the state of this bug has not changed and i shall leave this review as is until it is fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Like in any other sim, too many Senna wannabe's that are not properly punished by SR system. Wall -100 points, wreck someone -1 point.\n\nEdit: FFB makes even mid tier wheels like CSL DD just a huge vibrator shaking your table apart, too much noise and hardly any sense of what the car is actually doing. \n\nFrequent stutters due to game struggling to save 100MB replay file mid race. \n\nReplay system is whack too, time line bar does not show start of laps.. bars are just random so you spend alot of time just spamming it to find specific section of the race. \nCamera controls in replay is backwards too, each button keeps changing movement angles at random.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this sim is absolutely trash poorly optimized cant run anything in the background while playing crashes here & there,  constantly screen tears, STOP POSTING DLCS & FIX THE FING GAME YOU PROFIT HUNGREY GOOF BALLS.  asides from that it has potential what a shame/ pc cpu 9800x3d gpu 5070ti motherb msi tomahawk x870",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "With the ELMS Pack 1 update they completely shafted the LMGTE class by replacing it with the LMP2 in the lowest rank daily races where the driving standards are at their worst. Don't know what that decision is about so for that alone I'm gonna set my \"review\" as negative until they bring it back. It's my favorite class to drive in this and I will go and say its FAR superior than the overrated GT3 classes. Obviously my opinion. Its a game, we don't need to follow classes absolutely like IRL, i know the GTE's are gone IRL. The point of these games is so normies like us can drive these incredible cars at home.\n\nAnyways, onto the actual review.\nDriving is good, love the .. well LMGTE's and LMP2's the most, the hypercars also feel great but ofc deadlier to drive.\nThere's still some crashes that happen, especially in online practice sessions when the timer runs out, it crashes the game very often.\nI personally don't really have many performance issues other than the occasional rare stutter which can throw you off and mess your FFB. (set a keybind to reset FFB)\nDriving standards are absolutely horrendous is the Bronze SR races, actually worse than iRacing, near Forza level of bad. And even in higher SR's it can be bad, the safety ratings are not harsh enough with car collisions(intent wrecks), you can get away with a lot sadly.\nWhen everything works its absolutely amazing though.\nVR also performs decently at this point and looks stunning with the right settings.\n\nI'll update with more thought at a later date.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Why you should buy it: It comes from the same devs that brought us rFactor 2. Buying this game, you support them. \n\nOtherwise, if you could care less about FIA WEC licensing. You don't want to buy the same cars and tracks as DLC, that you (probably) already own in your other favourite sim. If you rather pay a subscription in iRacing, instead of LMU, to play a quality multiplayer session. Then this game isn't for you, it certainly isn't for me, that is why I don't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bought prior to full release at the end of May and was very impressed with the graphics, forcefeedback and physics model. It felt very intuitive to drive and was pretty clear where the limit was. Also the racing was very fun and 90% of the time clean. Since then its all gone downhill. Since V1 the driving standards have fallen away massively. You can't report drivers for anything other than intentional wrecking which basically means you are a victim to poor racecraft at least once a race, which usually results in you facing the wrong way watching everyone else drive by unless you just swing back out in front of other cars (as unfortunately many do). If you do report anyone that isnt clearly intentionally wrecking you yourself can be subject to a ban for wasting stewards time unless you pay an extra £44 a year and race in online championships. Somehow LFM can provide this for free across a range of games but having myself bought the game plus all dlc im then asked to spend more money just to be able to actually race in a racing game. Bottom line is if you want an offline hotlapping game this is great(although it would be purely hotlapping as they still havent released any form of single player progression system despite being 6 weeks into full release). Oh and also they care more about moderating their discord too than the driving standards, with some very snarky replies from the devs themselves to players with genuine concerns. So as disappointed as i am to say this i would not recommend this game unless you have money to blow on all the extra subscriptions and time to waste by being mangled in public lobbies by clowns who face no retribution. F*ck this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The racing is fun. However, there is no option to host your own server, and you have to pay them to host it for you. I cannot recommend this game because of that. There is no reason that users shouldn't be able to run a server on their pc if they are inclined to.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I got 2k hour on ACC and this game with the poeple playing it is absolute horrific. 50% of the grid intentinal collide with other drivers . The devs want to bring in more cash with game pass and stuff like that then to actually do something about the poor driving standars in the game. Untill they get a decent punishment system I would stay away",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i`d suggest everyone stay away from this one , its more broken than there previous game Rfactor 2 which they`ve abandoned & left it with issues like over inflated tires that cant be adjusted .",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "LMU has the worst online driving standards of any sim. its not worth wasting your time or money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Having sim raced for a long time and being a big Rfactor fan, I thought LMU was going to be my answer to iRacing.\n\nEspecially having raced in the real world for 20 years.\n\nI can't recommend this to anyone not running a top end wheel base, on anything Non-DD, it just feels like mush.\n\nEdit: Removed bit about pace differences, was short sighted considering car differences.\n\nJust a complete lack of feel from the car, the rear is coming round on you trail braking but the wheel isn't providing any feedback that it's happening, until it's far too late and it snaps.\n\nAlso the pricing model, I expected a lot more base content than there is, just 3 GT3 cars for 30 quid and a couple of tracks is a total joke!\n\nCan't say I'll be supporting this until things change.\n\n1. Pricing model is egregious and expensive, you may as well just go all in on iRacing.\n2. FFB has a total lack of feel in lower end wheel bases, I've ran t300s for years as they're cheap and I do not have room for a rig, yet on here it just feels all amalgamated into one, with no feel of what the front or rear of the car is doing.\n3. The cars just feel far too \"dead\". RF2, AC1, cars feel alive you can dance at the limit, here they just feel... like nothing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game keeps crashing and closing, and online is a nightmare. I've only been able to finish a couple of races because when I go from practice to qualifying or the race, the game freezes or doesn't respond. Other times, during the race, I lose connection, or suddenly, the game simply closes or freezes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has a lot to improve, especially in the racing system.\n\nIt’s happened to me several times — I register for a race, click to join, and then it says it’s not possible to connect to the servers. I end up just sitting there for another 30 minutes staring at the screen.\n\nIf the game isn’t going to let me join the server, at least let players register for another event.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its not early access anymore but the menu is so laggy, game keeps crashing, and my rating is keep going down because my game always crash on qualify / race. if you planning on buy full dlc, just dont. wait until the dev fix this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You need high SR to access more interesting races -> Once you reach gold or plat, you can drive vs players that crash every two corners, rejoin like blind people, wreck intentionally without being never banned.\n\nSupport don't ban unless it is insult in chat, you can drive like in mario kart and it's fine.\n\nIn high SR, between a third and half the grid will be DNF - absolute waste of time.\n\nSave your money, don't buy this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, it’s being either in. Devs just dont understand what makes good controllers controls, 7/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not rFactor 2 successor!\nAlthough it is built on top of rFactor 2, they turned it into a simcade game like the F1 games but with the WEC cars.\nThe Alpha phase actually looked promising, it was close to rFactor 2, but it went downhill since then,\n1. FFB is garbage even with one of the best wheelbases on the market (Simucube 2 Pro), but the feedback is similar for people with Fanatec, Moza, VRS, etc., there is no feeling for the tires (it's like the car is floating), no feel for weight transfer, to suspension load, on the other hand you can feel useless things like road texture and sausage kerbs.\n2. Very bad optimization, even with very low graphics, against AI or with a lot of people the fps start high and after a bit it wents to 40fps, maybe some memory leak issue, it makes awful experience to drive with so low fps.\n3. Switching tabs while driving will create ffb peaks that can be dangerous with high torque wheelbases.\n4. Reloading car textures takes almost 10s and the game stops during it, can be very dangerous if you do it while driving.\n5. ffb is not reduced in pitstops, another thing that can be dangerous and the game should never be released without it.\n6. replay sound is a lot higher than in car, there are some volume settings in the file but none seemed to work.\n7. telemetry is very limited, only happens inside the car and it shows all yellow flags, even the ones that are happening on the other side of the track.\n8. Damage is bugged, sometimes you have damage and doesn't show, other time it won't let you repair unless you crash again and you need to damage something else (if it's on the same area it will never show to repair).\n9. Sound is good but it's completely useless, it doesn't translate what the car is doing, pure mimick, also draft doesn't even change the engine sound.\n10. Open practice servers don't have draft.\n11. Very bad Draft to Drag correlation.\n12. No feeling for brake bite (again, it's like the car is floating and brake just slows down the car)\n13. No way to only enable virtual mirror when all mirrors are virtual, they just work as fake mirrors, with terrible fov and requires hidden keybinds to adjust them.\n14. Almost no damage model, besides the rear wing, almost nothing breaks, and even crashing at high speed gives very low damage, there are no visible netcodes because it's built as bumper car effects like Gran Turismo does.\n15. There's no wind or humidity which limits the track condition variability.\n16. Rain is very poorly implemented, purely a traction multiplicator, not even wet lines or kerbs have different traction.\n17. Very limited camera controls, even for replay, also no way to fully disable hud for replay recording.\n18. If you stop the engine cooldowns, which doesn't make any sense, it should overheat because there is no air to the intakes.\n19. There's only one folder of custom setups per track, if you drive different cars, different seasons it's a nightmare to organize.\n20. You can use a mix of wet and dry tires, while mix of tires is allowed in WEC, the rules states it's on or the other, not both.\n21. Flat spots it's bad implemented and it's limited, after a certain point it won't get worse not matter how much you lock or slide the car, also the frequency doesn't match the tire diameter and the recover of the flat spot it's not progressive (maybe to the lack of good ffb).\n22. Even disable music in audio settings, when you start the game it's always playing and it's very loud.\n\nNot even talking about all the issues with the broken splits, latency issues, etc, of the Le Mans 24 race since it was a test.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not get this game if you have an intel gpu , they fail to mention that you cant even load half of the tracks without crashing even if your intel gpu supercedes the recommended requirements. And the developers have done absolutely nothing useful to fix these issues",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "200 reais em um jogo\n\n-Essa pista está bloqueada por DLC\n\n-Esse carro está bloquado por DLC\n\n-O jogo não tem modo vs ia até o momento\n\nComplicado dar uma review boa nessas condições...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Warning only part of a game, purchased what I thought was going to be a whole game not a game with just a couple of tracks still waiting for a full version of the game, early access they call it (i call it a scam). It's funny they have time to make addons for this game but no time to give us people a full game that we paid for, you won't ever get more money from me, I prefer to purchase full games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the sim in general is good, been taking a break from iracing recently, but there are some major issues that need to be addressed. The loading times are soooooooo long, the game freezes sometimes, it gives you a white screen and you can't do anything, sudden FPS drops, force feedback cutting out for a moment and also crashes mid race. For now i'm giving it a negative, maybe those are just performance issues that will be resolved with future updates on which i'll keep an eye out. At this time, if you want to get in a good sim that doesn't have those issues, if you have the money of course, i'd opt for iracing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Graphics sound and feel of the cars is lacking compared to ACC, it almost looks cartoony despite high settings had high hopes but was left feeling let down, lets hope it improves but i will not be buying any additional content in the mean time!\n \nAt the moment this is a no go because there are no single player championships and they are already asking money for season passes. The game is not finished. The ONLY single player mode that exists at the moment are quick races.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let's see , ONLINE needs to let you ban Immediately not after 1 hour of cooldown , game online especially rookies is more of a rollercoaster than a racing game enough is enough , data plugin theres not even an idea, get your shit together or im done...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game \nPros:\n-good for online racing\n-decent physics \n-good handling\n-good graphics\n-proximity sensor\n\nCons\n-most of the content costs more money- you need to buy DLC\n-in silver safety rated races track limits is very bugged \n-you will lose safety rating for collisions that arent your fault\n-no one is punished for dirty racing\n-backmarkers often take out leaders and nothing is done about it\n-damage realism needs work\n-whole rank system is messed up\n-track limits are messed up\n\n\nwould not reccommend buying this game until developers do major work the cons ruin the whole game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "-Updated Review-\nTDLR: If you are a casual \"daily race\" player/sim racer. This is no longer our game. Becoming more like iSkating.\n\nThey’re artificially inflating the splits count (so it feels like there is more players playing) by making daily races hourly. Now need to wait 20 minutes for the next race for the same category. No more back to back races.\n\nI only race GT3s. I got no time to practice and don't care about setups cause they're not even close to realism.\nI just want a sim game to hop on with less than 5 clicks and play when I have the free time at ANY TIME.\n\n(So if I miss the hourly mark...Might as well go back to the GOAT OG AC.)",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}