{
  "positive": [
    {
      "review": "This is a tough one for me as this game creates a lot of love/hate relationships with people.  After years of playing ASE and now almost 2 years of ASA I can tell you I still love this game in single-player or PVE with friends.  It has an addictive game loop that keeps me coming back for every map release and the mod community is awesome despite some crap paid mods.  Alternatively, if you like PVP this game is a pay to win cesspool filled with cheaters that the devs can't or won't address.  The original Wildcard devs are well intentioned despite not being able to hit a release date if their lives depended on it, but Snail Games is the absolute poster-child for greedy, know nothing about gaming publishers that have all but ruined the gaming industry.  So if you like single-player or playing with a few friends then this game is worth full price - but don't buy it unless its on sale so we don't support this publisher on principle.  If you want a PVP dino game then I'd say you should stay far away and save your sanity.",
      "voted_up": true,
      "votes_helpful": 79
    },
    {
      "review": "ARK: Survival Ascended has a lot of potential, but it’s being held back by some frustrating issues. The updates are too frequent, too large, and take too long to download or install. What’s even more disappointing is that many of the same bugs from ARK: Survival Evolved are still here.\n\nYes, the graphics are definitely better — the game looks amazing on a high-end machine. But if you don’t have powerful hardware, the improvement isn’t really worth the performance hit.\n\nAnother big problem is connection stability. Playing on a non-dedicated server often leads to frequent connection losses, which ruins the experience.\n\nOverall, the experience is good, but it could easily be great if the developers focused more on optimization, stability, and fixing old issues instead of just releasing massive updates.",
      "voted_up": true,
      "votes_helpful": 26
    },
    {
      "review": "If your rig can handle it then I recommend getting it while it's on sale. It took a while for me to move over from Evolved but I quickly found that I liked a majority of the changes. \r\nI personally enjoy solo or small private servers* and recommend finding some nice QoL mods to make it even better. (I use Vanilla with sprinkles and Dino depot)\r\n*Disclaimer: I do not, and never will, play on ARK's official servers. They are another world entirely.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "I've been playing Ark: SE since release, and I don't mean full release, I mean way back in June of 2015. For die-hard fans of the lore and story, this is worth your time and money. For those looking for the classic PVP experience, I hate to say it but I'd steer away. I know both PVE and PVP very well for Ark, and towards the end of my journey with ASE i glided towards the PVE end of things, which made the game incredibly enjoyable and significantly less stressful especially with external responsibilities taking priority. I absolutely despise where Snail Games is taking this, and it's another example of \"Absolutely DO NOT sell out for funding\". Things get tight, we all understand that, but with a solid idea and passionate developers the community comes together to make a project happen. Before dragging this out, as a review, if you enjoy slow paced PVE, fun/drunken nights with friends clubbing dinosaurs, it's still the same game it was 10 years ago, just better looking, give it a try. Other than that, official servers are packed with hackers and unemployed people. I'll give it a positive review for nostalgia sake, but do not buy it thinking it is the next survival-crafting PVP arena.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "It’s a great game, but its performance feels unoptimized relative to other Unreal Engine 5 games.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Recommended on a 50% off sale, you actually get more content than buying survival evolved without a bundle. \n\nGood PC is mandatory, game is really good if you find settings you're ok with.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Was part of development in early Beta in 2014 with wild card and it has been a ruf-road\r\nwas a game of frustration with no end \r\nThe game it sould have been and not the game we played back in the day\r\nCan recomend to seasoned players, and new players (much easier now)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is like no other. So much to do that you will never get bored. Sure there is still a few bugs and optimization issues, but the developers are for constantly on improvements and new content. Every map is beautifully designed and comes with it own challenges and unique dinos. Be ready to spend 1000's of hours into this one",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is phenomenal, however, the hits the players have take is far too much. There has never been anything released on time and after the content is finally released it's bugged out. The core game is what kept me going. Surviving the Ark is extremely enjoyable and there's plenty to keep you busy and interested. Just a shame about the countless disappointments to the players.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This isn't a review of the company, or the decisions they make, or how I wish things'd be instead. It's a review of this game in its current form.\nAnd it's excellent. I spent hundreds of hours in the original Ark, and this is a pretty faithful re-imagining of the original. The main draw is the modernized graphics. Ark has always been a beautiful game. Now it is more beautiful. The other new features are also interesting and useful, the build system is much improved, and I'm enjoying playing the game once again.\nYou'll need a powerful enough PC to play a somewhat poorly optimized game, and enough time to pour into it to have a full experience, but on the whole I think this is a worthwhile purchase and play whether you're new to Ark, or a returning player looking to have new adventures in this world.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is SO FUN. I love the mod support and, well, the gameplay. Will have MANY more hours\r\nDon't go to the tundra unless you have fur armor\r\nUpgrade your flyer's health\r\nOfficials = hard (i play on a private unofficial)\r\nhigher graphics are so pretty!!!!\r\ndeserves Labor of Love award :D",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Ark is unforgiving, very addictive I'm driven to play the game, nice views, ummm the gaming itself is complete you got stuff to do forever, incredibly stunning.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Games just so good, has dinosaurs and you survive, all you need. Best with a duo or group",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought Ascended day one it came out. I legit could not play it, I was getting like 3-4 fps and just kept crashing over and over again. I now have almost 1000 hrs played and it has gotten so much better. I stand about 90fps with a few drops here and there. \nI still hate what they did to Aberation, but I am loving the new maps that are coming out. Valguero looks so pretty especially at night time! I do recommend this game and I am looking forward to when Fjordur releases as that is my fave map of all time. I REALLY hope they don't screw it up like they did with abberation...",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Overpriced for an unfinished game.\nThe only thing that made ASE Great was the modders...ASA is all about profiting from the free work they do!\nThey increased graphics.. 100% scam... HaaaaaaHa..no one plays pvp with graphic on! \n\nI reluctantly suggest this game for one and one sole reason Ty to modders and the wide options and setting you can alter this game to fit the game play of any and all open world desires \nAnd to everyone profiting from this game...your the reason why its failing.\n \n..if u want to be greedy my game better not loss any frames even if my comps on fire and if you want to be as glitshy as ASE you better cost the same (FREE)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the game. Many people want to complain but honestly this is an upgrade from the original. I will always love ARK even if it's community is dog water.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "🌴 Ark: Survival Ascended – A Stunning Rebirth of a Survival Classic\n\nRating: ⭐⭐⭐⭐⭐ (9/10)\nPlatform: PC / Console\nPlaytime: 100+ hours\n\nArk: Survival Ascended isn’t just a remaster — it’s a full-blown rebirth of one of the most ambitious survival games ever made. Built in Unreal Engine 5, this new version takes everything that made Ark: Survival Evolved iconic and breathes new life into it with jaw-dropping visuals, smarter AI, and an overall smoother, more immersive experience.\n\n🔥 Graphics & Performance\n\nThe first thing you’ll notice is how gorgeous the game looks. Lush jungles, reflective water, dynamic lighting, and ultra-detailed dinosaurs — every biome feels alive. Watching a T-Rex stomp through a misty forest at sunrise is breathtaking. While early builds had performance hiccups, recent patches have drastically improved optimization, and it now runs much smoother even on mid-tier rigs.\n\n🦖 Gameplay & Mechanics\n\nAll the classic survival elements return: crafting, building, taming, and fighting to stay alive against both the elements and other players. However, Ascended refines these systems. Building is more intuitive thanks to snap-point improvements and UI updates, and the revamped creature AI makes the world feel more dangerous and unpredictable.\n\nThe multiplayer experience is also far more stable than before, with crossplay and dedicated servers making it easier to join friends regardless of platform.\n\n🎮 Quality of Life Improvements\n\nStudio Wildcard has clearly listened to the community. Inventory management is smoother, lighting and weather systems feel more natural, and the new interface feels modern without losing Ark’s distinctive grit.\n\nMod support is already thriving thanks to the new integrated mod browser, which makes installing and managing community creations effortless.\n\n🌍 Final Thoughts\n\nArk: Survival Ascended is everything fans wanted Ark to be — a modern, stable, and visually spectacular version of the survival epic that started it all. It’s still brutal, still unpredictable, and still incredibly rewarding. Whether you’re a returning survivor or brand-new to the island, this is the best way to experience Ark.\n\nPros:\n\nUnreal Engine 5 visuals are breathtaking\n\nImproved building, UI, and AI\n\nStrong mod support and crossplay\n\nMassive potential for future content\n\nCons:\n\nOccasional performance dips\n\nSteep learning curve for newcomers\n\nVerdict:\n\nArk: Survival Ascended isn’t just a remake — it’s a redemption. The island has never felt more alive, dangerous, or beautiful.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I’ve been playing ARK since ASE Early Access, and I fell in love with it right from the start — even more after I discovered its story.\n There have been rough times, but also countless amazing ones.\n\nI’ve seen people say the game is still as buggy and laggy as it used to be, but honestly, that’s not so true anymore. I took a long break a few years ago and recently came back, and yes — ARK still has its share of bugs and crashes — but compared to what it used to be back in the day? It’s like night and day.\n\nSome of you might not remember the times when baby maturation barely moved 1% in 24 hours on official servers, when the lag was so bad you couldn’t even reach your base door after 30 minutes, when cryopods would kill your tames instead of saving them, or when you logged in one morning only to find your dinos scattered all over the map. I lived through all of that — and more.\n\nNow, sure, my game still crashes occasionally and there’s the odd lag spike, but it’s nothing compared to those old days.\n\nAnd to those who’ve spent thousands of hours in ARK but still leave negative reviews — if you really hated it that much, you wouldn’t have played it for so long. 😄 ARK has flaws, but it’s still one of the best games I’ve ever played — and I’ve played a lot.\n\nI see many people complaining about paid DLCs or mods. I get it — it’s not for everyone. But nobody’s forcing you to buy them. There are creatures I like too, but I don’t need to own them. I play without DLCs and mods and still have a great time — and I know I’d enjoy it even if I did buy them.\n\nSure, Ninja Turtles and Power Rangers might be a bit over the top 😅, but again — it’s your choice. Back in the day, ARK had none of this, and people still played it happily. It’s just an extra option now.\n\n(For reference, I play on PvE servers — I know that in PvP, paid creatures and talent trees might cause balance issues.)\n\nSo yeah — I love ARK, even with all its imperfections, because it gives you something no other game can. If you’re a new player, don’t beg others for high-bred dinos. Start from scratch — experience the struggle, the small victories, the full survival journey. That’s what makes ARK special, and you’ll appreciate it so much more.\n\nIt can be both uplifting and frustrating — and that’s exactly the point of a survival game.\n\nThe only thing I miss is the old official trade forums, where people traded in-game rather than for real money. But in the end, it’s always about the community — and that’s what I miss most.\n\nThat’s all. Enjoy life, stay a little less negative — because in the end, that negativity only hurts you. You’ll realize it sooner or later. 🩷",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its good just make sure if your running a low end graphics card turn your settings down and you FSR and be aware this game has the ptw aspect but if your a solo player you dont have to worry about that unless you want to play it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have about 7000 hours in this game on ps5, ASE and ASA combined.  Its a love/hate relationship.  Its a busted ass game that crashes ALOT, and at the same time it is one of the best games ever made, in concept.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I do have hope for this game, its not easy to make perfect games, especially with unreal engine 5. Not many are capable of achieving such feats.\nI am disappointed that seeing as its their 2nd game, they didnt fine tune the game enough. There are glitches that shouldnt be there, among other knick knacks that are what would be known as rookie mistakes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really like the gameplay overall in this but sometimes it is a bit frustrating lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun just like its predecessor except for the fact it runs like absolute Dog Shit.... And my pc should be able to run this game. Maybe Save your money unless you like to fight with this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if the game is compatible with your hardware and doesn't crash, it's one of the best games out there. If not, it's one of the worst. Definitely worth a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Started with Evolved, now i play Ascended. I recommend this game to anyone out there looking for something new and exciting. Thank you Studio Wild Card",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing it has some seriousely good graphics if your pc can run it ofc but it embodies what Ark survival always was meant to be with the basic fundimentals still circling around PvP and overall has improved massivley from its prior version with alot of added content and bug fixes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a very fun game as long as u like to get tortured by dinos and always screem and get mad but other than that the game is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "„Ark: Survival Ascended“ ist das einzige Spiel, in dem du nackt am Strand spawnst, dich umdrehen willst — und sofort von einem Pegomastax jumpscared wirst, der dir dein ganzes Inventar klaut, bevor du überhaupt „Hallo“ sagen kannst.\r\n\r\nT-Rex?\r\nPff. Die echte Bedrohung sind Troodons, die dich anschielen wie kleine grelläugige Psychopathen und dich INSTANT ins Jenseits schicken.\r\nDu siehst sie nicht einmal kommen. Nur das grelle Gelb ihrer Augen und dann… Respawn.\r\n\r\nDie Welt ist wunderschön, ja — deine FPS zwar nicht, aber gut, man kann nicht alles haben.\r\nUnd obwohl die Grafik hypnotisch ist, bleibt mein persönliches Manko bestehen:\r\nViele der wirklich guten DLCs stecken hinter einer Paywall.\r\nMan fühlt sich ein bisschen so, als hätte man ein Buffet gebucht, aber die besten Gerichte stehen hinter einem Vorhang mit Preisschild.\r\n\r\nDoch dann…\r\nDann siehst du ein Shinehorn.\r\nUnd plötzlich ist alles gut.\r\nDie Angst, der Stress, die Troodon-Traumata — alles weg.\r\nEs ist, als würde dieses kleine leuchtende Ziegenwesen sagen: „Ja, du wurdest gerade zum fünften Mal ausgeraubt, gebissen und gefressen… aber schau, ich bin süß.“\r\n\r\nFazit:\r\nGrafisch ein Traum, spielerisch ein Chaos, emotional eine Achterbahn ohne Bremsen.\r\n9/10. Würde wieder vom Pegomastax beklaut, vom Troodon gefressen und vom Shinehorn angeleuchtet werden.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I found the game more playable when they announced the servers are coming down. Now you just come back dead, no gear, dead dino.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rough start but i tink they getting better at it, i loved ase and im loving even more asa.\ngreat game to play solo or whit friends, just cant trust official servers =P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything, minus the lag and stupid stuff other people do, other than that, Love the game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who typically spends their hours debugging algorithms and lecturing on computational complexity, I must confess that ARK: Survival Ascended has captured my attention in ways few recreational pursuits have managed.\n\nWhat truly captivates me is the emotional investment I've developed in my tamed creatures. I've come to treasure them much as I would a beloved pet—they're not merely gameplay mechanics, but companions I genuinely care about.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As an OG with the first game, Ark survival evolved, I would have to say that at the beginning it felt that they took advantage of their player base, which to be honest i still think they did, however if you are a new player or player that played the first game you will feel at home and if not at home you will enjoy your time playing. on the original ark I have 1500 hours of play, so i can say that ark is maybe one of the best games created other then minecraft. The community is really a great one to be a part of and I would definetly reccomend it. \r\nI also thought to mention screw snail games ark deserves a better publisher.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game just not og ark. Nothing can ever beat that hate the pay to play dlc....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was skeptical at first with so many bad reviews and complains, but after more than 100 hours I can say without any regrets, that I love this game. Its pretty much ASE with updated textures, but gosh does it look good.\r\nThe bugginess is minimal, I havent seen any major issues other than loot drops sometimes going under the map. Same as in ASE, optimisation is poor and my 4070 laptop easily hits its max on 1080p medium/high settings, but at least there arent any lag spikes and crashes.\r\nWell working game definitely doesnt make me hate the new WIldcard (SNAIL GAMES) any less for hiding premium creatures and useful items behind a paywall of DLCs with questionable pricing.\r\nIf you want to play the game now, just stick to base game and if you plan on buying ASA with all the DLCs, wait for a sale, otherwise its completely not worth your money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Same old ark with lots of QOL changes and really good graphics. Great game, you just need heavy power to run it, but if you can run it you'll love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game play graphics and in general concept is awesome!! there are bugs from timie to time that are a pain, but the game is worth dealing with some aggrevation. It especially shines in multi player. My personal preference is multi plkayer PVE.  It can be a real time sink so be careful!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game. i use a i7-8700k with 48gb ram , 2060 rtx and can play most maps with ease.\r\nthis game is GPU hungry tho so more vram on video the better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, Solid game for PvE. There is plenty for you to do. PvP is hard to get a group together due to GM's of Ark and how they allow rampant cheating.\n\nWhen it comes to PvP even the P-server owners are leaning in to the cheaters because they are the ones that come to their server buy a V.I.P package and so on. Its actually a joke how far this has gone, The entire Ark community talks cheats like it is the normal way to video game.\n\nHowever the reason it is getting an upvote is undoubtedly because of PvE, The core gameplay loop for Ark is very well suited for a solid survival game and the progression from primitive in to tek is good enough to make the game fun for people who just want to PvE for several 100 hours if not 1000s for some.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the worst optimized game you'll ever play.  But if you love ARK, you love ARK, and you deal with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better then classic ARK, but still buggy sometimes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has really been a decent upgrade with a rocky start, in typical fassion the game was heavy to run and had some issues but it has become my proper replacement for the first one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aside from the bugs with the game, there's so much to do. So many dinos to tame and I haven't even seen them all. I just found the Shinehorns tonight. They're super cute, so I can't wait to tame them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played ASE and ASA both enjoyable titles but really enjoy enhanved visuals of ASA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is still great nothing else like it PVP meta is constantly changing and still learning new things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played evolved for 850 hours before finally making the swap. most things are equal to better some stuff ill miss. not super thrilled to pay another 100$ (base plus dlc) for a game i already essentially own. but the servers start in 2 min instead of 30....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with lots to have fun doing from building to breeding",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "abberation is actually buns but the rest of the game is peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i'd recommend but this game is very unforgiving and hard for new players. fun fighting style, great feats, and an amazing fanbase",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W but the bobs tall tales dlc is a scam. I spent 30 bucks on it and it says I do not own it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, only downside is for undedicated servers are to be hosted at nitrado, which is bad to my opinion.\n\nOverall the game is about taming dino's survival and defeating bosses alone or together. PVP or PVE options on how you prefer to play. I always play PVE with friends due that's what we love. Great respect for the complete overhaul and small taste we get for ARK II.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the PvE part in it. The building, the taming, the breeding part. But for me specialy the building part. Multi playing on a server and the interacting with eachother. Lots of fun. Okay, the game isn't perfect. But what game is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the crap out of ASE and will most likely play the crap out of ASA. It's got the same pros and cons as any other game these days, other reviewers have made you overly aware of them, so not gonna beat a dead horse.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looks amazing and plays smoother than ever. The world feels more alive, the creatures look incredible, and the survival experience is as addictive as always. It’s a great upgrade and definitely worth jumping into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely a better upgrade w/ better controller support than the Evolved version. It’s a demanding game for the PC but with customized settings, my GTX 1080 can play it fine. It’s still early access and there’s pretty frequent patches which is kind of annoying. However, it’s still pretty fun and some intuitive ways to tame different Dino’s.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dies ist mit absoluter Sicherheit mein Lieblingsspiel. Es wird so viel Liebe hier reingesteckt, dass man als Spieler einfach weiter spielen möchte ! \n\nBin froh dass ich dieses Spiel erworben habe.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, and the way it lets me be creative with my base building.  Fair warning to potential players though:  There are a lot of bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely fun and also a challenge! Recomend playing with a friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't understand where the hate is coming from. Switched from ASE to ASA and am enjoying it a lot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My bro and I have collectively, across our Playstation 4's, Playstation 5's, and now our PC's about 7k hours ish each. Probably closer to 10k for a total combined of 20k hours. Great game when you're not getting bent by a bird or tossed by a rat. Do not play solo, if you do... record it whilst drinking. Play with friends, drinking is not mandatory but recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its need little big bug fixes and more fixes in game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I know what people say about this game in all its negative aspects but personally I love this game. I think its worth giving it a shot. There are plenty of Mods/skins/maps that you dont have to pay for. Its really just how you want to play. Every game has bugs/glitches but I havent ran into any that were game breaking. I love the new creatures and the new updated maps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love playing, there are definitly some glitches, like dying and your stuff not showing up but it is still fun. I run a server for a small group and we love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has the potential to be so much better than Evolved. Basically a whole remake of ASE, with better QoL features built in. Saying all this, it still has a LONG way to go before it can be considered polished. \n\nTLDR: Wait for a sale. Buy if you like to get ASE with better graphics, constant mod support and more QoL. Personally, it's well worth the money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and nice graphics i can't stop playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, team based and exciting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best sandbox game that catches you much longer than any other games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have 1600 hours on ASE I didnt buy this until now because i thought it was wildcard fucking us over and trying to sell the same game with minor improvements I was wrong the game feels completely different it feels amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well after 700+ hours of Entertaining gameplay and countless frustrations on performance since launch (Hence the daily Updates), i am still enjoying this improvment on ASA but noticing it still has the same persistant problems from ASE (Loot drops and Dinos not spawning or spawning in the Mesh, floating rocks and foilage, unfinished areas of maps released) to name a few. Overall the look of the game is great (minus some lighting effects that need addressing on some maps) and i have been fortunate to not have many crashes.\n\nMODS:\nThe New way to use Mods is IMO better as Mod creators should get paid for what they create (As long as it is mostly complete and regularly updated), and kudos for those creators for having free Mods for players to experience, Mods bring life into a game when it can become stale.\n\nI don't see myself getting 5000 hours out of this game like ASE but i got my money's worth so far, looking forward for the Next Maps to come and ARK 2 in the distant Future.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good, sad most locked under paid DLC, but I love the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The games a classic, but I do hate the MOD system, it stopped working on my windows install, I ended having to istall it into my Linux system to get it working,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spent allot of hours in ASE will probably spend more on ASA. Every new server I start I play it differently and enjoy it differently definitely a game you just cant walk away from.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played a lot of Ark. The game has definitely had its ups and downs, I do believe the future looks good for the game. The best thing that could happen to this game for the future would be for Snail Games to get if slimy hands off this game and wildcard to go off on its own, and not go public.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had 5000+ hours on the old ark and moving to this game just made and emprovement in evverything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is an amazing upgrade from ase the graphics look awesome the game is a bit more difficult to run and still has a few bugs but i play un-official and experience very little problems would i dont love the fact that some map specific creatures are locked behind a pay wall but i just 100% cant play ase due to what snail games has done with the most recent set of updates it makes the game unplayable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tiene lo mejor delos mejores juegos, construccion, atrapar dinos, caseria, Bosses, historio, y comunidad diversa. Ejmplo tiene de poketmon y minecraft y mucho massssssss",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun! however not for everyone, grindy \"i love it\" but if you don't like grindy games you probably would be more frustrated. If you enjoy messing with setting and getting games to be your specific play style you will love this! after all it is machine gun dinosaurs and idk how it gets better than that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can poop in a toilet and flush it with absolutely zero plumbing, 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its a very fun open world game open to those who want a good pvp fight or more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Alot better performance than I was expecting.\r\n\r\nI assume they've done alot of bug fixing sinnce release",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun. Lots of quality of life updates and improvements on Ark Survival Evolved. Performance issues abound for lower-end machines. I have a 4070 Ti as the bottle-neck for my system and I'm getting 60 FPS with DLSS frame generation on and NVIDIA optimized graphics settings, most of which are Medium-High @ 1440p",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The mod feature is very good and it has good graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for pvp and pve open world and lots of maps to play on",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ARK as a game is the best survival game I have ever played, the mods also helps a lot in the game but they need to fix bugs faster and they should not delay the launch dates of every maps..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good but kind of hard to know what to do after a certain point. Haven't played enough to really see but so far really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun game lots of great modes for you to play with but my laptop had trouble running it even on the lowest settings.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a very good game i love it but the price is a bit too much for my entire family",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just like the reviews, I am so mixed. Ark holds a place in my heart. I have almost 1000 hrs in the original game and took a long time to play the ascended version, because it was basically the same game but with better graphics.\n\nI have to say, it is and it isnt.\n\nFirst, graphics are ok. Can see anything when the fog rolls and and my god the trees...but other then that, its good. (if you take the clouds out).\n\nSecond, I do love they added baby dinos to the game, but I feel it puts you into a different mindset of game play. It makes the dinos sooo much easier to tame and you dont need to know taming specifics anymore. Plus it makes you look like a monster when you kill the mom or dad just to steal there baby.\n\nThird, have to say, the way they handle the building ui was a step up.\n\nThe things i dont like about the game that makes me really not like it, is the dino pathing. Its more fudged then ASE. Like when my dinos go down a ramp and decided that there is a better pathing then the bridge across the water and end up dying after standing in water for 5 min, it just makes me mad. \n\nI hope that the game will be better. Not asking perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a good game, can't go wrong with Ark! always come back to it! loving the mod easy usage and new creatures/maps!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and the upgraded graphics are well worth it.\r\n\r\nGood way to spend countless hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "3/4\n\nOk, I have around 400-500 hours of Ark. Came back some years later to play with my brother, the ASE, I was running 30 fps with a 5090, multiple bugs and on and on...\nThen, I remembered that ASA existed and lucky me it was 50% off. Gave it a try. Instantly better performance, UI, gameplay, everything. I couldn't be more satisfied with this upgrade, honestly.\n\nOf course there are some \"bad\" things like paid DLCs for a single dino, but taking that to the side, this is a HUGE improvement over ASE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After more than two years, I decided to give this game a review.  Firstly, I am a huge fan of the ARK series, with several thousands of hours in ARK: Survival Evolved, and now running up at over 440 hours in Ascended.  Here are my thoughts for pros and cons, and then I'll wrap up with a value summary:\r\n\r\nCons:  At launch, it was a bit of a wreck when it came to crashes and optimization.  Unfortunately, to run the game on high details, you need a beefy system and to get a decent frame rate at those high details, you'll need to run Frame Generation or FSR.  I have a 4090, and another system with a 4080 Super.  Both run the game decently well, but require DLSS and Frame Gen to keep the game consistently above 100 FPS.  The crashes upon release were so frustrating that I wanted to put it on the shelf.  Simple stuff like accessing the inventory of a storage chest while in first person - CRASH!  That has all been resolved and today's ARK: Survival Ascended experience is one that is stable, and seems to be much better optimized.\r\n\r\nPros:  It feels just like ARK, but it looks incredible and no longer outdated like ARK: Survival Ascended.  They implemented a lot of QOL things into the game to make building easier, character models look MUCH better, and the updated sounds are just as impressive as the graphics.  My first experience in a cave was genuinely terrifying just because of the creepy ambient sounds echoing off of the walls of the cave.   Servers are easy to setup, and since they ditched that Nitrado stuff at the launch of the game, I'm very happy with how easy it is to setup and install mods on my own sever, and how easy it is for players to auto-download the mods when they join.  Quite simply, it's a far better experience than Survivor Evolved and the overhaul on mods was long overdue.\r\n\r\nOverall summary:  While I understand that some may feel that this is a \"re-skin\" of an older game.  The reality is that it's not.  There was a ton of work that went into this game, and quite simply, it shows.  It wasn't perfect out of the gate, but I remind myself that sometimes we shouldn't let \"perfect\" be the enemy of \"good\".  It was good out of the gate, but had some issues, almost all of which are resolved.\r\n\r\nIf you are a member of the discord, you see the amount of regular updates the devs are releasing to both clients and servers.  This is not some fly-by-night cash grab push with devs not putting in the work.  They are!  If you don't believe it, go to the discord, run your own server, track all of the updates.  I'm actually very impressed with their dedication.  It shows that they want this to be a good product, and because of their dedication, it IS a good product.\r\n\r\nYes, it seemed at first that you were paying money to just get The Island, and what seemed to be an unfinished release ahead of the \"ARK 2\" pipe dream that we may never see, nor will we know if it's the game that many of us were looking to get as an official sequel.  In my mind, THIS game is the sequel.  It's everything we loved about the original ARK (for the most part - I'm sure some will have some things they loved about the first game that they are not getting here), but it's modernized in QOL, gameplay, graphics, and sound.  Now that most of my favorite maps have been released, I know I'm going to enjoy exploring them all over again in Ascended.  Similar to the orignal ARK, if you enjoy these games, you will easily recognize that the thousands of hours of enjoyment from the game, it easily exceeds the value you get when compared to AAA titles that offer you far less.\r\n\r\nI recommend this game to new players looking for a fun (brutal to new players) sandbox game, old ARK players that have taken a break but want to dive back in, and to the haters that remained stubborn thinking the devs owed them a free game... come join us!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GET THIS, NOT ARK SURVIVAL EVOLVED! If you honestly cannot make up your mind between the two, I highly suggest getting this instead. Ark Survival Ascended is truly an amazing upgrade for Ark Survival Evolved. There are literal BABY DINOSAURS everywhere, and if you kill the parent or tame it, you can also imprint the baby as well. This game also has better quality, graphics, and so much more. This game truly is the best survival game there is on the market, I highly suggest playing it to see for yourself! It is full of dinosaurs, construction, and bosses. Please, if you like survival, building, crafting, dinosaurs, challenges, or just taming random animals, this is the game for you. This game is definitely my favorite game, no hesitation. Worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gane very immersive, performance has been decent for me, but, the amount of updates and patches is insane. And every time there's an update, you have to run through all the files, meaning 1+ hour. And there's almost an update every day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yea it's full of bugs and it is laggy but the game concept has kept me and thousands of others entertained for thousands of hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, only negative is when updating it blocks out the whole install size again so if its a 250 gb install, to upgrade it says 250gb needed, i only have a 500gb drive so i cant upgrade and have to reinstall each time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i never played evolved but i get the aggro they made a new version of same game but it brought me to the game the  problem with the old one is it looked janky old layers or code added upon code and they had to start new,  some will disagree i am sure but as a newer player to Ark more than 1000 hours in game i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ark is like a toxic relationship, no matter how many times this game screws you over with its many bugs, you just never quit even after all the pain it puts you through. 10/10 would torture myself again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its an okay game, I feel like the crafting and build aspects of the came a bit lacking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is NOT for the week, only for people who dont have lives and dedication",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I am posting this review as a LOUD WARNING to all current and potential players: DO NOT SPEND YOUR MONEY ON THIS GAME.\n\nThe CEO of Snail Games USA has a death-grip on this game and on Studio Wildcard in general, and his sole purpose is to squeeze the players dry of any and all money that he can possibly get from them. ASE will eventually die to give way to a pay-to-play version of ASA. The primary reason that they are even calling it \"Early Access\" is because it gives them the legal wiggle-room to avoid proper QA testing and bug-fixing, all while still being able to charge players real actual money.\n\nThe claim for this game was that it was to fund the development of ARK 2... this is a lie. The CEO of Snail Games USA is mismanaging his company into bankruptcy, and the only way that he is able to stave off total collapse is by bleeding ARK and Studio Wildcard dry... things will not get better, they will only get worse. As many have likely seen already, he is already looking into using AI to replace developers, animators, voice-actors, etc. in the hopes that he can leverage the legacy of ARK into a self-generating revenue machine.\n\nThe only hope for the ARK series is if people here start putting their money where their mouth is, and start boycotting the game and the ever-increasing DLC and start demanding more of the developers and specifically the publisher. But I have seen behind the curtain, and I'm not optimistic.",
      "voted_up": false,
      "votes_helpful": 155
    },
    {
      "review": "Can you like.. not put all the things you make behind a paywall? I love this game with all my heart, it was my childhood. Seeing what you guys are doing honestly makes this game and you look greedy. It feels odd to play the game, i mean at least make the mods free this game would go better that way.",
      "voted_up": false,
      "votes_helpful": 203
    },
    {
      "review": "Pros: Very fun core gameplay loop, vibrant maps, and fulfilling progression.\r\n\r\nCons: Terribly optimized, buggy, low server pops, and devs who would rather release new content than to fix the issues in the game.",
      "voted_up": false,
      "votes_helpful": 112
    },
    {
      "review": "This used to be one of my favorite games of all time. But over the years and 4,000 hours in ASE and another chunk of time in ASA the whole game has faded, replaced by changes that feel out of touch with what made ARK special. \n\nThe updates, the direction, the balance… everything feels like it’s drifting further from the game we all heavily got involved with. The community has been begging for fixes and better decisions for years, and it feels like no one’s listening anymore.\n\nI never thought I’d stop recommending ARK, but the game just isn’t the same. It’s heartbreaking to watch something you enjoyed this much fall so far.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "While I am grateful to the friend that bought this for me, I am also really glad I didn't spend my own money. \r\nThe Ark franchise is a perfect example of failing to finish the job but expecting to get paid. The original game was so plagued with problems (snap points and so on) that never got fixed and required third party materials to run in any sort of manageable way. Then, without ever solving all of THOSE problems, the developers said, \"We're done! Not gonna work on it anymore and not support anything anymore but HERE! We made THE SAME GAME AGAIN and expect you to buy it all over again.\"\r\nI would also love to get paid twice to not finish a job. \r\n\r\nI am playing the  second one with a friend and not only did it get more complicated, the fix doesn't work and its still a struggle.\r\n\r\nI no longer buy games from this developer. I accept the gift and I will try to entertain friends but to the devs, fu@# you for the slap in the face and half solved problems.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I’ve been dealing with this game for a while now, and honestly, the update system has become a real problem. Almost every single day, the game requires a 6GB update, and on top of that, it needs more than 180GB of free storage just to install or apply these updates.\n\nEven if the actual update size is small, the game forces you to clear a huge amount of space, which makes it extremely difficult for players with limited storage. I had to delete several other games just to make room — and that’s not acceptable for a title that updates this frequently.\n\nThis constant need for massive space and daily downloads makes the experience frustrating. The developers should optimize the update system, reduce unnecessary file sizes, and stop requiring double the game size just to install a patch.\n\nFor now, I can’t recommend this setup unless you have a very large SSD and unlimited internet bandwidth.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I wanted so badly to like this game. I'll probubly play it a bit more just because I have it but so far this really just isn't wowing me and the microtransactions are just as bad as folks say they are. Right now as I type this club ark has what could be a really fun feature ruined by a pretty sneaky one of these. First of all, club ark itself apparently isn't free and then during a quest that would perminantly unlock some spesific skins a few of the \"power ups\" are creatures from paid DLC that you can not use if you don't have the DLC. \nOn its own this is a small thing that shouldn't ruin a whole game but it bothers me. It bothers me big time because it's just one more irritating paywall and in this case it directly makes it much harder to do the required mission. (A mission that you're suppose to be able to do if you have club ark) I feel like the gamma one is possible without the dreadmare, just not very fun. The alpha though.... if alpha hoard quests are the same in club ark as they have been in the past I kind of doubt it's at all possible to do the alpha without a dreadmare. \nSo recap, they couldn't allow non DLC holders to make use of a temporary powerup in what I assume is a limited time questline since fear ascended event. Said powerup is in a quest you're allowed to play in a mode where the mode itself IS a payed DLC. You'd think given you don't get to keep the tame they might let you at least ride it just for that quest similiar to the way genisis in ASE let you play with space dolphin tek saddles during quests even though you couldn't actually own one without having had to fight the bosses.\n\nOther people have already talked the other paid DLCs to death but I found a new wall and to make matters worse I actually don't find ASA THAT big an upgrade from ASE. Just play ASE. Even with the drama around the aquatica map you get more. Heck, go pre-aquatica branch and you still have more mods.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The main reason I'm even putting a public review is the near-daily 2+ hour 100+gb updates I'm forced to do to even play the game every. Single. Day.\n\nNo game should need daily updates, let alone that huge. I spend more time downloading than actually playing the game.\n\nDevs need to consolidate these huge updates to either once a month, or figure out how to make it so I don't have to re-download the entire game every. Single. Day.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "this game is actually so fucking terrible DO NOT spend any money once so ever the dev team behind this game needs to be trialed for retardation and neglect",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have an RTX 5070, an AMD Ryzen 7 7800X3D, and 32GB of RAM, yet the game still runs horrifically on medium settings. The game's crutch is DLSS, but even that barely helps with its terrible performance, not to mention the 200GB install size.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Runs like shit, has pay to win DLCs, only good mods are paid, non-dedicated servers crash constantly and SO MANY MORE ISSUES.\nJust go play Survival Evolved, it's better (downgrade to preaquatic) and you will have a MUCH better time.\nFuck you Wildcard and Snail Games, you have truly put shame on a IP.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Patching game files takes 20min depending on hardware, i patched it last night played a different game, tried playing today, nope gotta patch it all over again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love watching a rock and seing the full concentrated power of the sun. This game needs heavy and serious optimization.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Don't buy it! Don't buy! This is an advertisement disguised as a game!\nIt's a trojan horse! Well, not a real one. But still! After buying and downloading I'm immediately encouraged to check out and buy bob's whatever. When they can't even afford falling tree physics... In a game. About collecting resources and building... Yeah.\nNot to mention it looks like actual dogwater unless you have an 4070+ series card. Eg. If you have an 30 series. Goodluck finding any frames. I found around 20 fps on MEDIUM settings... \n\nAfter playing a little longer my original review still stands.\nI got better performance using DLAA, DLSS, at 50% resolution, on 720p.\nThough I seem to be getting decent frames on my 3060ti There's still an NOTICEABLE input lag. I mean not enough to be unplayable but just enough to make it extremely annoying.\n\nIf you use a controller it's probably not that bad.\nAlso. You better use headphones or have a thick case, as my PC sounds like it's going to take off for flight at any second while playing this.\n\nSide note, even on the highest settings, everything seems to have... an aura? It looks like some kind of lensing, or like you're looking through really thonky glasses... It's not enough to affect aim, but it's 100% noticeable. ALSO at lower resolutions the crafting gets hard as the text is barely readable and to make matters worse the text obscures the picture, so as far as crafting goes, good luck.\n\nAlso I've seen fringe cases where you can change settings via commands which has worked with some success, though I saw someone literally fried their GPU doing so, so I decided not to touch that with a 50 foot pole.\n\nAS THINGS STAND. STILL DONT BUY! I would wait and see where this goes and how long it takes to come out of early access. Granted if it's like the original, you might die of old age before then, but still. This seems VERY hardware intensive. Until they get their heads out of their butts with optimizations, I'd stick to survival evolved. I'll update this as I run into issues, or if it fries my GPU.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "8 gig update every other day and one of the most unoptimized games I have ever played lol. This is coming from someone who loves the game but hates snail games, they have ruined ark.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Greed\nWildcard split up already from snail games, sure, you will have to pay penalty... but at this point, it would be better than being held hostage by them...\nThe whole \"made from ground up\" ? Kiss my a$$, its not made from ground up, its just copy-pasted source code, look at the same bugs that exist since Survival Evolved...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I should be able to run a private server on a second computer without troubles and allow friends to join, The fact that this is not allowed and I am expected to pay for a private server from someone else is wrong and I will not support this game any longer. Ark has been my favorite game since release and I have thousands of hours in the original.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love ARK! 3K+ hours in ASE  across platforms, and 100+ hours in ASA. Obviously it's a favorite of mine.\n\nBUT...........\n\nBig thumbs down to the developer and parent company, Wildcard and Snail Games. The total installation size is ridiculously huge, and as of Q4 2025 we are seeing 8GB updates multiple times a week. \n\nNo game should need patches that large, on such a frequent basis, and no patch notes from the developer on Steam. You have to go to their discord to try and figure it out.\n\nI'll still play, so I'm part of the problem, but I can't give a thumbs up for any dev that cares so little about the player base. \n\nI'm not entirely surprised because nothing has changed since the ASE days, but the disrespect from this developer doesn't inspire a thumbs up. Lucky for them a middle finger isn't one of the two rating options.\n\nCiao!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Buggy, poorly optimized game that isn't sure of what it wants to become. This game has quickly become a platform for DLC money grabs and the devs refuse to fix some of the most basic issues with the base game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "they had a second chance at this game and still drop the ball. sold us the same game 2 times lol with all the same problems lmao",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Runs like garbage on a 3080. clean up your game. Optimize it. You stopped supporting one product that worked generally and made a worse one. Do better. turning things on medium to get 40 fps is ridiculous.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After hours just trying to find a decent server, came across countless map bugs as if they never even checked it, this isnt the ark i used to enjoy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played the old game for 100s of hours. Enjoyed it a lot with many friends. But this new version is buggy as hell. Not only that, but all extra content is behind a paywall. It's the SAME content. But, now you have to pay for everything. I hate it. So. No, Don't Buy. Don't PLAY IT.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Nope. downloaded this heap to play with my son. played ase years ago with him. wanted to give it a try. saleprice and all. levelled a bit yesterday.  now it wants the enitre hard drive. how big is this update and for what? a dodrex skin that sucks? i uninstalled like 6 games to make room for this trash. im not buying a seperate hardrive for this \"more optimisations to come\" horse hockey. are they still pulling that crap? bottom of every patch it said \"more optimisations to come\" yet the game has quadrupled in size. im getting a refund.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "shit ahh game.. spent 5 hours trying to make it work as no matter what the graphics keeps glitching and stuttering, tried contacting support to either help me make this game playable or refund, wasted another 2 hour\nand nothing worked, neither they solved my problem nor they gave me refund\n\ngraphics looks shit and soul less... ASE looks far much better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is not worth it. Reskinned dinos and they charge for them now. No thanks! You are officially dead WildCard.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "everyday. EVERYDAY! a 1-2 hour patch. goodluck trying to play it. revising my review. game is trash. cant even join my server anymore. what an absolute joke!!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game looks much better in trailers than in game and it is an absolute money grab",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am extremely unsatisfied and disappointed with this game in it's current state, it constantly crashes as well as crashes my computer. I cannot recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its fun to begin with but it gets very boring as you go along. theres no direction besides what your own personal goals are. sure you can tame dinos and do the bosses, explore the map but having a goal or quest the game gives you is more helpful. not to mention all the interesting and good content is locked behind paywalls of more then 30 bucks. id love to play with friends but the server situation is horrible, theres no easy way to do crossplay and non dedicated servers are so janky you cant be away from the owner hardly at all so its even more boring. but ive put too many hours into this game to quit on it now",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love The Game and it has a lot of potential, but it’s being held back by some very frustrating issues. The focus is still on money-grab DLCs instead of optimization and innovation that no one ever asked about and that, for me, ruins the aesthetic of the game.\r\n\r\nWho wakes up one day and asks why Ark doesn't have a collaboration with the Power Rangers or Ninja Turtles? No one! If you want to do collaborations with other franchises to bring more players, why not at least try to start with something related to dinosaurs? Jurassic Park comes to mind??? \r\n\r\nThe update system is absolute garbage; even if the patch changes a line of code, the game needs to download like multiple GB of data and needs hundreds GB of free storage just to install or apply that line of code. I have never seen a game do patching so badly.\r\n\r\nI would love a refresh from scratch on the most basic and outdated things the game has, like tree-falling animations and the AI of the creatures, making them look more like living things and not just walking zombies, something like the food bar matter on wild creatures (herbivores needing to find greens to eat, carnivores behavior changing based on hunger, water drinking needs, etc.).\r\n\r\nAlso would love a revamp on the progression system to make the different eras of progression deeper than the current rush of XP to skip everything until late game.\r\n\r\nBut sadly I don't have any hope of that happening anytime soon.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Runs like doom on a toaster. One of the most laggiest games ive ever played, Atp the loading screen needs a loading screen. If I wanted framerate this low id print out screenshots and flip through them by hand. The game was rushed popped out as a jittery disaster. I want my money back.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love this game and have been playing it since it was Ark Evolved, however I can not recommend buying this game in the state that it is in. For being a game that is two years old it is in terrible state. I get a crash at least once an hour. Go to load up my single player world and all my mods are uninstalled for no reason so I lose dinos, items, and tons of progress. Can't recommend sadly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is unplayable. This is due almost entirely to the graphics engine chosen, followed by the failure to properly optimize the game rendering and include proper graphics settings by the development team. I fought with this game for close to fifteen hours, changing settings and adjusting visual options to try to solve the issues with no success, either the lighting would bug out, the visual quality would become reminiscent of early 2000s, or rocks and shrubbery would begin floating for no reason. During this entire process, the color saturation was so ridiculous the trees glowed in the night, and the only way to get the game to be playable without nuking my graphics card was to disable half the graphical settings such as volumetric clouds, fog, lumen lighting systems, and so on. In a nutshell, don't waste your money on this game. Buy Survival Evolved, and use it. While its graphics are not the greatest, and there are gameplay bugs, the game itself is much more optimized and end-user friendly when it comes to graphic control. Unreal Engine should be discontinued if companies are going to fail to properly utilize it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Never buy this game when u have a job. Everyday i come from work there is an update that takes 5 hours when its only an 8GB update. this game is so bad that updating files takes ages. I hope that they fix this shit. on my mama ima beat they ass.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great game, I love it don't get me wrong but prepare to have a 5gb update every 2 days which can take up to multiple hours because why not.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Complete and absolute dogshit. Its amazing how a huge studio can cut off any and all kind of support for a game that was doing well and built them up just to release a literal copy with better graphics and a few quality of life updates.\n\nWas running it on a Ryzen 7 and a Nvidia 2060 with 12 GB of VRAM, 32 GB of RAM, and installed it on a M.2 Drive. Cant get it past like 60 fps, and within the two hours i had to play (in case of refunding, which i did) i experienced:\n- Crashes (Mid game, Loading into a server...)\n- Freezing every 5 seconds or so, to the point where i genuenly couldnt play.\n- Bugs and similar...\n- Extreme freezing to the point where, not only was i unable to play but it ended up with me being in a cycle of:\nRespawn\nFreeze\nUnfreeze when already dead\nRepeat\n\nIt went from being barely playable on around 40-60 fps (on the fucking lowest graphics, while still having the \"Recomended\" hardware), to freezing and crashing, dont even know what happened, verified files, reverted changes, everything, what a scam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game feels sluggish like theres a 2000ms input delay. movement feels bad, no option to turn off AA which makes the game look blurry and you cant tell shapes from afar. No Nvidia filters help. even with a 5950x and 3080 the game runs poorly. The game is only playable with FSR framegen which is probably why it feels dogshit to play. Add the option to turn off AA and optimize the game cause ts is unplayable dawg.\nASE for the win.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A perfect game, turned into a product of greed..\n\nI absolutely love this game, I really do, the building and taming, the feeling of progressing through levels and stages of engrams. But there's one huge issue, the multiplayer options for this game, or lack of I suppose.\n\nLet's start with tethering- it used to be in the rules menu- miraculously disappears in a shadow patch, no notes, no comments, just completely gone. Not only can you not remove or increase the tethering (max is 800m) but there's also no option for LAN, whereas in it's predecessor this was an option, as was the increase and decrease option for tethering. So self exploration and solo adventures are no more, go too far or spawn on the other side of the map, you'll just end up teleporting your friends to your feet. But hey, online servers are an option yeah?\n\nJust want to play in a duo? A trio? Good luck, unless you'd like to pay $36.86AUD per month for a Nitrado server, which supports 20 players and you're thinking that's a lot, but apparently it's the minimum amount of player slots per server, so even if you chose just to have your duo or trio, you're still paying for those other 17-18 player slots, and get absolutely no option to decrease that amount or claim any sort of discount whatsoever. \n\nBut hey, I'm optimistic, we're still in Early Access right?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love this game but its so poorly optimized and they have no respect for their fans, the original company wildcard got purchased by snail games a while ago and its just been terribly downhill from there. The company favors money over their users and it has and will continue to bite them in the butt as they keep trying to desperately release cashgrabs to save this sorry company. The original vision and game by studio wildcard is incredible its a shame they got consumed by greed (snail games).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game has been ruined by snail games the game frequently crashes, servers are buggy. Me along with all my friends keep having \"small updates\" that say 5 GB but end up taking up more than 500 gb on a 1 tb drive I do not recommend Purchasing this utter monstrosity of a game. Would have been way better with wildcard at the Helm. DO NOT BUY (Also very poorly optimized)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Most of the issues you will have with this game will inevitably be with performance. The new content is great but the performance & crashes aren't",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. Played it on Xbox 1. Lots of fun. It says it is steam deck verified and compatible. I have not been able to play it once on my steam deck. I have spent 5 hours changing settings and trying to change steam deck settings and can not pass character creation before it crashes. My GPU is at constant 95 to 98% with only .9w going to it and the only way I've read to fix that is by over clocking my GPU at my own risk. That's not steam deck verified or compatible if I have to risk potentially destroying my steam deck. Very disappointed would not recommend to any steam deck user",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you want to really experience ark at its finest, play Ark Survival Evolved, ASA is just a cash grab that looks good but it really doesn't have the flare or spark of the original Ark experience \r\n\r\nMight actually try and play ASA when they fix their bugs and optimization and make good unofficial servers with no cryofridge requirement. It really is annoying logging into a spawn point and be surrounder by 50 cryofridges",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unless you like playing Ark Patch Simulator, id suggest waiting for this to go on sale and play once in a blue moon when they arent patching this constantly. Unless you have peak internet, with a beefy computer, their poorly managed patches takes the average person 1-2 hours. It wouldnt be an issue if this was once a week like most games. No, snail games decides to do 8 gig updates every day for days on end. Get with the program and get on a update schedule so the average person can actually play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bugged and glitched to hell. no change from the other game. Not worth the money they want. Great Game tho. I just wish the developers actually gave af. even after a couple hundred hours. No change in opinion. Still a dogshit bugged game the devs truly dont gaf about. Not worth more than 10 bucks, and thats being generous",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game constantly requires long “patches” and “updates” that take about two hours to download. It’s really disappointing because the only time I get to play is during my short breaks after work or university, and even then, I end up waiting instead of playing. My internet speed is 440.6 Mbps download and 611.9 Mbps upload, so the issue clearly isn’t my connection... it’s the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As a Dad that games when he gets the chance, being hit with a 1.5 hr or more patch every single time I log in has left me staring at the download page hoping for a miracle, only to be reminded that I am, in fact a Dad before the patch ever finishes. I'd love to be able to actually play the game, but here we are, stuck in a patch cycle.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is a pretty obvious Cash Grab. \r\nSystem Requirements are fucking nuts and even if you meet them you need to insert 50 fuckass console commands to get 60+ Frames. PvP which imo was the best part of ASE is so fucking pay to win and boring in this Game.  If you have any ounce of respect for the community and the industry go play ASE and dont touch this pos.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game is un fucking playble, need at least a  rtx 5090 to run this piece of crap (update: i've upgraded to a RTX 5080 and it still runs like crap)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "!DO NOT BUY THIS GAME! Terribly optimised, took me 4 and a half hours to install the game, another 3 ish hours to update it and 98% of the update was patching. Apart from that, its the exact same as evolved. The only upside to ascended is better graphics (at a massive cost) and crossplay. EDIT: I had thought that this game at least had crossplay, it basically doesn't. The crossplay is only available on dedicated servers which either have 15k ping, are full of hackers or just shut down within a minute. You also have to buy a server if you want one for yourself to play with your friends on another platform. Plus the server picker doesn't even work, its segregated so that pc players and xbox players see different lists so you cant even play a dedicated server with crossplay even if you wanted to. !DO NOT BUY THIS GAME!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Almost every update requires you to re-download basically the whole game including all DLCs. Really annoying and time-consuming.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Unfortunately, the game's creators are the same ppl running the entire underground operation of selling dinos and selling you hacking cheats. This came could have been a great game, unfortunately, its an underground money grab. Its a perpetual series of attempts to survive. As soon as you log in, they identify all of your renders with the cheats.  My best friend whose placed 6000 hours in the game, bought the cheats one time. I got to see everything. People hide within the \"mesh\" geometry of the game. Cheats allow for the ability to find any item, or tame on the map, with exact precision. I have survived months on this game, especially if its not a new map that the Alphas who sell their \"Base services\" arent targetting. If they decide they want your server to \"rent\" out; bc they sell \"base\" configuration on the discord, then have someone else they know raid it, wash and repeat, charging ppl money the entire time. Its a perpetual money grab. Thank god, I never bought into it. Did everything the old fashioned way. Have survived my longest on a quetzal. I would say this....for anyone new to this genre of game, you'll love it, you'll fall in love with the wonder, but unfortunately, the hacking, lack of oversight will make you miserable and you'll spend tons of time thinking you can get an edge; when to be very honest with you, there is no edge, by design. I recommend Rust over this, but wouldnt be surprised if the same things exist there. I played 1374 hours total, learned from ppl 6000 hours more. was able to see the truth, got what I needed to get from the game, but now its time for closure. if you play anything more than 2000 hours I would say-You're probably too caught up in the game. Remember my words my friends. I warned you, as a true gamer, who gave this game an honest try. The rest you're on your own to find out. And yes everyone thinks they can get an edge, its just a sad illusion. This would have been a phenomonal game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have played 300+ hours of this game and 1200+ hours of ark: survival evolved. This game is a huge disappointment. The biggest issue is the constant updates(game is currently on the 3rd update in 4 days.), and that even small updates take 1hour+ to complete. I have it downloaded in a couple minutes then it takes 50+ min to actually patch. \n\nThe second biggest issue is the cash grab this has become. They are constantly adding content and mechanics to the game that cost money. Creatures are added to the game that can only be tamed once you buy this dlc or that dlc. a skill tree you are repeatedly reminded you acquired points for, but you cant spend them unless you pay. There are things that are annoying in the game, and instead of fixing those things in the game, they make a fix and put it behind a paywall. \n\nlast is the optimization. I have a decent PC that can run high or ultra on almost any game I have, but this game is so poorly optimized I have had to either use console to turn off elements like fog, water response, clouds or i have to turn the graphics to potato settings. So theoretically this game is better graphics than Evolved, but in practice it looks so much worse because you have to turn it down.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After the years Ark has been out its still buggy, glitchy, tends to crash and with all that going on its still over priced with dlc thats over priced. Honestly if my friends did'int have this game ( which is the only reason I got it on steam ) I would not have touched this game again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Same game same issues better graphics\r\nthat being said its still living with dinosaurs and for that i love it...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is sewage... Needs a 4000 $ + pc to run the game smoothly or else you ll puke with low fps. I totaly regret paying every cent for this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have RTX 5090, Ryzen 9950x3D, 64GB ram, SSD. Game runs at less than 40 fps in 4k epic settings without any player made buildings or tames. I literally cant get a better computer right now to run this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unplayable. Daily game updates that never fix any main issues. Lag and rubber-banding across all servers has made PVP laughable. Ive tried to stay strong out of love for this game but I'm putting it down. LISTEN TO YOUR PLAYER!!!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Good game, ruined by ABYSMAL performance.\n\n\nonly reason the number might go up is that my wife likes this game. But she also would say the same:\ngreat game\nruined by poop company\nwhich doesn't care for bugs\ndoesn't keep promises\nreleases buggy, laggy, crappy maps\nreleases stupid fantasy DLCs\ndoesn't listen to fanbase\nand enjoys massive addiction problem of the players\n\nOnly reason ark is succesful is because there are no other games scratching the same itch quite the same way.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Would be very fun and addicting if it wasn't horribly optimized and had random frame drops.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Having both ark: survival evolved and ark: survival ascended... I would HIGHLY recommend against buying this game. As far as I've seen, it's a copy paste of survival evolved with very few, very pathetic additions that don't even make me want to play this game. I only bought the game because I had friends who bought it and they don't have the first one.\n\nSave your hard drive space (and maybe even your money) and stick with survival evolved, if that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "sorry but this games just bad, bad performance, bad people working on it, its overall a mess. remaking old ark is a fun idea but forcing your pvp players to move to this if you wanna play officially is just sad. (not to mention that theire starting to ruin the old game even more)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its not an upgrade. A lot of the time there's terrible lighting effects which I can only turn off by removing the clouds. AA is awful. The sky makes the map be lit up in red for half the time and I can't turn off the sun rays. Spent half my time trying to sort out the graphics but I've given up now. Sick of fiddling around with it. Shouldn't need doing, \r\nAlso, some mods cost money now which is awful. Makes sense why they killed ASE. They're also releasing paid DLC before completing ASA, In the inventory they have a giant button for buying the DLC. \r\nI love the concept. I've been playing since it came out on PS4 and its really sad to see whats happened over the years. We all see the things these publishers have done. Big shame.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game! But this game doesn't love me back. \n\nIt crashes a lot, I had to mess with so many settings to get this game stable-ish a while ago, but it still crashed sometimes. \n\nWith the recent updates I cant play at all. Ark crashes MY COMPUTER when I launch it. I don't have a top spec,but its still a i7 13700, with 32 Gb RAM and a 4070 RTX but the game just freakin crash constantly now! Ugh\n\nThis is ridiculous, I bought ASA when they launched it and had many crashes back then. I tought they'd get their sh!t together after long, but I am proven wrong. I held back on posting a review because I gave them a chance to make it better. Alas they're making it WORSE.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Downloaded game Played 5 hours come back to resume on my gameplay update required 268 gb update Great game :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Look the games graphics are stunning. The play is phenomenal and who doesn't like flying on a pteranadon or riding a triceratops?  Why do I NOT recommend?\r\n\r\nThe game is MASSIVE and the developers haven't figured out how to manage their updates. Each update requires about 200G of SSD disk space or else it's going to take HOURS to download and install. Most people have to just uninstall the game every time an update comes out, then reinstall it from scratch.  NOT TO MENTION that some days, there are MULTIPLE UPDATES!?!\r\n\r\nKUDOS to them for doing regular development and bug fixes - Please keep that happening!  But for the love of GAMING, FIX these insane update times!\r\n\r\nIf you're a normal person with a job and you want to watch your computer update ARK MORE than you get to actually PLAY ARK, if you have anything smaller than a 4TB SSD then you might feel like you've wasted your money on this one.\r\n\r\nI'd wait for them to fix all their updating mess before trying to tame this one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no fucking way you need to download DLC just to play mods. this game is already 175GB, why in the ever loving god are you making me download inflated maps just so i can play modded? what a fucking downfall from grace. fuck you snailgames.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "My roomate made me play it with him and its completley awful i wouldnt recommend it to anyone not even my worst enemy. The gameplay is so choppy and its completely awful and i hate it with every fiber of my being, like maybe make it actually playable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Holy damn this game is ass.  People are complaining about the game being the exact same as Ark Survival Evolved.  I honestly would rather get scammed into buying literally the exact same thing instead of getting scammed into buying this.  This game is so ass.  I hate Studio Wildcard and their associates.  Go bankrupt dumbass.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Prettier version of Evolved. Still same bugs and poor optimization. Pay walls. Poor multiplayer server options.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What is wrong with you? you resold the same game you had but on better PC'[s only to ask 5 hour resintallment on every patch, are you stupid?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if you love game crash and an update EVERYDAY. spend that money! its a joke dont waist your money! its really not worth the money! maybe if it cost $1 then it might be worth it.. At this point we should be paid to play this dumpster fire!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Extremely poorly optimized game, nearly unplayable",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have over 3k hours in Ark Survival Evolved. I'm going to ignore all the false promises and straight up lies that lead to Ark: Survival Ascended and just focus on the game for what it is, right now. \r\n\r\nThe game itself is good, with some quality of life improvements over ASE. None of that matters to me because the game looks awful and runs poorly. You need a very expensive computer just to play this game and have it run moderately well and look halfway decent. All the UE5 stuff is cool but who can even run it?\r\n\r\nI miss A:SE.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How is this better than the original? It is far more buggier. Crashes all the time. Graphics are barely better when they work. Most of the time it is pixelated. Yes my system, can run it. I have ran many other AAA titles without issue.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is fun, though at times the constant updates and enormous disk space required makes it unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it works, that's the only thing snail games care about, then they'll make you pay for p2w things, wildcard are one of the best game devs, but snail games just holds them back and doesn't want to fund a bit to make the game actually better, snail games only pay wildcard to make the bare minimum and then make paid DLC's, the worst part is the game barely works on high end PCs but guess what? snail games doesn't care, they don't want to fund wildcard to make the game better, i hope the best for wildcard, but i can't recommend ark if snail games are doing what they're doing right now",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its is a fun game wish it was optimized better, but it sucks that literally everyday there is a update just about, and for sum reason it is the only game on my PC that take hours at a time to update...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maybe stop updating the game everyday and just do it weekly or something;\nBad Game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst fucking game optimization you will ever see. Even with a new beast of a computer it is impossible to get this game to look good and not have the graphics glitch constantly. This is a game that should be refunded for every buyer, they simply cannot deliver what is expected of them in this deal. Having a look at this remake makes me certain that ARK 2 is a no buy game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love the game and the dynamics... But this game has a huge issue with updates. For example I am updating a 7GB patch that is taking more than 2 hours long. Any other game I update BG3, AoE, and more are about the same size in patches yet update at a reasonable rate. For Example BG3 had a 12GB update that took me 5 - 20 min. I dont understand why the ARK devs feel the need to patch the game 3 - 4 times a week and they are always such big file sizes for some very small fixes. I would be much happier if they did one big patch a week on a scheduled day. Not everyone is living the unemployed life and get to play all hours of the day. Its extremely frustrating when you come home take a shower make dinner and its 7PM and find out you have a patch that takes 2 hours to install. By that time its 9PM and I go to bed at 930 because I wake up at 4am for work. My point is get on a schedule and just do it once a week like most devs. I am at the point that if this isnt resolved ill just play another game that dosnt patch everyday or other day so I can relax before working a 10hr day.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "in base this game cost 45 euros and it doesnt even work properly . I cannot even select on which monitor i wanna play on in this game so u will have to set up windowed and drag it but when i try to change it back to fullscreen after i drag it it just lags in saving every time and u can only use esc but when u do u cannot exit to the menu or go to the setting or use any other features after pressing esc and u are basicly stucked the only thing u can do is alt f4",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game looks awful, Runs even worse, all the servers are dead as dirt with multiple pay to win dlc. Not to mention scooping up major mod developers under contracts and selling mods that were previously free for $10???? I will never purchase another Wild Card Studios game and neither will my friends",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its still ARK, as in all the bugs, but god damn if it works it's so beautiful and fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pros: its a fun game to play with friends\r\nCons: it will drain you of your money, time, and patience",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Im really dissappointed, the game looks so bad, even after countless of reddit posts and youtube videos.\nArk survival EVOLVED LOOKS BETTER, and that says something. I was really hyped to play some ark but fresh, now im just sad. back to evolved i guess since its 100x better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have to purchase DLCs in order to play Tame Dinosaur, and the game's brightness burns my eyes.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game runs like shit even after upgrading my computer more than once. also is an absolutely obscene grind that takes roughly 95 quadrillion hours to complete all maps",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i really doubted that this game could be worse than ASE but i stand amazed. It is a prime example of pay to win.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't waste your money on this game go buy or play Ark Survival Evolved every mod is free! ASA is a cash grab and they don't care about their PVP player base!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wish they would stop desperately adding stuff breaking the game further and making it more and more pay to win and just fix the darn game. Its crazy that they brought it to a new engine just to make it run worse with arguably more bugs. I love this game. just hate to see it be gripped so hard by a parent company and drug to the depths.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "love it or hate it with over 1000 hours in game i got my money's worth at the end of the day why i cant recommend this game is theres VERY poor optimization low frame rates, stuttering, and instability at times even on high-end hardware and its been like this for years i will change my review if they ever do a proper optimization update.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game, this game right here will make you get divorced and order a mail order bride that will emotinally abuse you, all because you had a bee kill you because your ghille armor was not high enough or the insect repellent wore out, or even better you spawn on a beach and 17 raptors from hell will hunt you all game to the end of the map just because you breathed then you proceed to log off drive your car into a wall going 90 because your taming a dino and a random compy came up and bit it so you lose 99% taming effectiveness. I actually love this game but I lost a wheel spin to do this review and I hope it makes you laugh buy ark",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is full of bugs. The view of the game is very hazy and not clear, Things in game disappear never to be seen again. When you die. your inventory is in various places where you can't get it but if lucky you can harvest rocks and find it. This would be a fantastic game in many ways but needs a lot of work. There are many rubber band effects that interfere with the game. If the butgs and issues were fixed this would be the best game on the market!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The policy of the developer and publisher of this game is unbearable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No waste of money and time. Great concept of a game for sure. However, if you like dumping hours of time in a game with constant lag and server crashes, one of the most toxic communities I have ever seen casually dropping racial slurs in text and voice around children, and losing all your progress to constant bugs and glitches then this is most certainly the game for you. Instead of fixing bugs they prioritize AI generated content to fund their servers. Its a business but for me personally I like developers taking the time to fix a game and improve the little things rather than putting everything behind a paywall forcing players to buy an unfinished product. I mean come on 10 years later and this is still in early access with the same issues as the first game. Feels like a copy and paste with some more grass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The update that was made, where there is no longer a column of light on corpses.  makes it near impossible to find your body.  A real shame.  they should call the game \"looking in bushes\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ark survival evolved was an amazing game but i just cant recommend ascended because theres so many micro transactions and its become insanely pay to win. evolved was perfect and didnt need to be improved but they made ascended so they could suck all the money out of us and its just not fun anymore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like pay to win and stare at the creatures you wont be able to tame then this is perfect. The building is janky and doesn't even let you know when its straight or crooked. Half the time i have on this is due to having to redo my builds. only way its tolerable is with mod support but its the same as the first game except you pay for new creatures and get easier mod support but all the good mods they will turn into purchasable ones. It's starting to feel like pokemon where you gotta buy all the dlc games just to beable to compete with others. i would recommend something like conan or icarus instead",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}