{
  "positive": [
    {
      "review": "I watched Real Civil Engineer play this game and really enjoyed watching. Turns out I also really enjoy playing! By day, work a real job that pays money... by night, work a pretend job as a car dealer and get paid in enjoyment instead!",
      "voted_up": true,
      "votes_helpful": 39
    },
    {
      "review": "I think this game is designed wonderfully. The process of the upgrade of the property is a first time experience for me. It's really amazing how it converts as you level up. \n\nI've been playing this game for a little while now. Very addicting. (currently 72.7 hours). I've maxed out most things, but I'm still working on trophies. I only have 1. lol I've been working hard, bringing in new cars. \n\nWhen I search the cars available, I make sure to check some options, like *sort by price*, and I like to show only the cars that need work that I can give it. Early on, it can be a bit tough. I stayed up all night (in-game) working on cars when I first began. When dawn would hit, I would wait for a good time of day (sunlight affects pictures of vehicles), take pictures, post the ad, open business, and wait. \n\nThey start coming in, and you can influence some with treats (cigarettes or gum), but only on the last round of bartering. It doesn't always work for me, but it's okay. I don't really need it now. But, it has helped me sell some cars for nifty prices. :D \n\nWith the sale price, I change the price to something that is in the green, not blue. Blue is too easy to sell. You can sell the ones in green. Just may have to wait for the right buyer. :)\n\nJobs: Sell cars, wash cars (ultimate wash when upgraded), repair body, repair internal parts of car, repair parts, fueling of vehicles, purchasing things (There are hours of operation for these other businesses you can visit, and these places are typically closed on Sunday, unless they devs change it). So, check the time before you head out. They might be closed. You will have many roles at first. With a little time, you can hire help and create an assembly line, so-to-speak. Get a routine going. :D \n\nEase of use is really good. I can perform actions really quickly on keyboard and mouse. I love that! Common keys. :D \n\nI don't recall starting settings, but I do not have any drama, just sales. :) I got a few loans to get started. Can get a loan on the spot. :D So, if you are out and about, and broke,  but want to buy a vehicle, open your tablet and apply. :D It's that easy. \n\nI love driving in here (and in most games). I use the brakes a lot for turns. The weight of the trailer can affect turns so practice a bit. \n\nThe devs have been working hard on this game. Adjusting this, adjusting that. I am impressed! :) Go Garage Monkeys! Very nice job on this game! Very nice.\n\nThanks for reading. For more information, please read other reviews, and if you desire, check Community Hub/Discussions for more comments,  announcements and concerns.\n\nMultiple Save Slots! ♥\n\nHappy Gaming!\n\nEdit: By the way, I think the bar is boring. IDK about others, but I don't really go there.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Im giving the game a recommended rating because I enjoyed it, but I do wish there was more to it. Once I was a level 7(or was it 8?) and was able to hire a mechanic, the game became pretty monotonous. (Find car online, buy it, run it through automated body work/car wash/mechanical repair, sell it.)\n\nI didnt see any use for the underground car storage or even the additional tank for my onsite gas pump.  Leveling up to get more expensive cars, or the second part repair machine, didnt really interest me. At this point, Ill probably sit on the game for a few months to see if the updates stay consistent and the game grows. Im always worried that simulators like this will be abandoned, like so many before it.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "I've really enjoyed this game, 45hrs in. My biggest complaint is having to find time to buy/pick up more cars. \n\nI don't understand how there's 0 trade-ins. you're telling me nobody in town has a car they can trade in for a new (newish) ride?\n\nI'd also enjoy an aspect where you can hire others to tow/pick up cars for you and you can tell them the destination. Whether that's from someones house to the dealership or from a spot at the dealership to a mechanics spot to fix/rebuild. \n\nthere's a lot of good things and i do recommend this game but if they can add some quality of life measures, it would be even better.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game, I enjoyed every second of it, too bad the upcomming games are not released as DLC for Car Dealer Simulator and instead come as each of their own game.\nThe game would be 10x beter when the upcoming games get their own DLC in Car Dealer Simulator, making the gameplay far more enjoyable as I don't need to hop games to wash, rent or steal a car for parts that I can use to fix cars I want to sell legit.\ni hope more updates are coming as I really enjoy playing!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The updates this game keeps getting definitely make it better and better to play. I do wish there was a way to see the total number of repair parts I have available in the storage. Or if it is already there somewhere, I'd love to know where it is.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Отличная игра! Разработчики молодцы- постоянно улучшают и дополняют её!\nДобавьте люксовые автомобили!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "updating all the time..really a enjoyable game..props to the developers.. thank you",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "grate game overall, bit short story. missing a roadmap, bigger map, small bug fixes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game and is only getting better as they release updates. It's one of those chill, mindless fun games you play when you don't feel like playing anything hard and/or competitive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Over 200 hours, and with the updates rolling out almost every day, the game is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to play, and satisfying to restore cars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cozy, fun and satisfying. Great game for the price, and the Devs are consistently adding more to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game always good to load up and play for a chill time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent game overall. Devs are very open and listen to the community updates are quite frequent. Ive made close to 6m at this point with about 60ish hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, i enjoy it alot and love to see the frequent updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "constant updates, fun gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and Relaxing game to just lay back and chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Developer that listens and keeps providing updates and new content 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "**DEVS**Great Job**\n     So far I am having a blast with this game , It has everything! I Love how you go make deals to buy vehicles , And then make deals to sell vehicles , I like how you have to haul purchased vehicles back to your shop manually but my favorite part of the game is all the prep work before listing a vehicle for sale its so cool! Sand it/Grind it/Puddy/Paint/Wash/Foam/Polish/Wax and more! Its so much fun!  The game plays really well too and graphically looks really good , With that said Id like to see a few things added in the future.......Like most importantly More Cars/Trucks! You can never have enough! And I know you cant add the real thing but PLEASE add a car that 'resembles' the look of the '1977 Monte Carlo' or the '1986 Monte Carlo SS! That would be amazing!  Also more customization to the shop would be great! (signage/colors/decor etc.) and to the vehicles! ( rims/tires/exhaust/more colors/ etc.) And even though you have something like it improving on the barn finds and doing complete restorations would put this way over 5 stars!  But Either way the game is great so far , Hope the devs keep adding and improving! And I cant wait to try out there future titles! (cleaner/rental/crime)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice time killer with an amazing dev team always bringing improvements to gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing this game it shows me how some or all dealers do things to their vehicles to make a profit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, super happy the devs are constantly updating and adding new vehicles and things to do. Looking forward to what is to come.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun, looking forward to more updates to this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GREAT GAME, sadly let down by a stupid issue that really shouldnt exist...........putty.\r\nhad i not gone past the 2 hour threshold for returns i think i would have .Hoping its something im doing wrong as the rest of the game is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game to relax and not stress over. I've had a good time playing so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only played small amount of time, don't get to play games like i use too, but the updates and content they keep adding is crazy, great job Devs....Everyone should play this game...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun solo playing game, can’t wait for additional updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun game to play. The support and the roadmap is good. We get new cars in really often. Details of car washing and repairing is really cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game, something new, awesome gameplay, and man the devs are super active. Love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun game, love the body work and mechanic aspect of the game. pretty detailed and is a great game for what it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun and stress free! Kick back and buy a used vehicle, take the truck and dolly and go meet up with the person selling the vehicle. Offer them a terrible low ball offer and they drop their price a bit. Buy the car, take it back to wash it up, remove rust and paint. Post car for sale and hope they buy the car at your asking price. Rinse and repeat. \n\nLeveling up takes a while and the cost of upgrades is a little steep on price especially where you only get a couple thousand out of a vehicle each time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty chill and the devs actually maintain the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't think I would like this game as much as I do. I am NOT mechanically inclined whatsoever, but that doesn't matter for this game. Granted I only have 37 hours invested so far, BUT those hours are often consecutive. Great game, looking forward to the other games the developer will be releasing soon!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game the Devs are constantly updating the game and it shows real passion for their work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable game, worth the money, especially if on sale. Pretty in depth mechanics - fun time over all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, very chill to play and relax.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game provides a very chilled and relaxed \"sales\" environment to what could be an extension of CMS21. props to the dev team. I appreciate the efforts. keep the updates coming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun little time killer. If you're looking for a game to suck your time away this is it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy the game, but the lack of more building upgrades after a point make it a tad bland.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game for a little while now, I really enjoy the fact they are constantly adding new things and updating the game. It also has fun mechanics for upgrading your dealership and adding employees as you level up. It is an all around decent game, and as more updates and additions are added it can only continue to get better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kind of addicting early on, but once you max out the dealership it really slows down. Available cars do not appropriately scale with level so you are stuck with 40 cars under $10k and 5 cars over that (if youre lucky) each day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a great game i love the depth with the cars and would love to see some more depth unless im just not there yet in the game lol if your a fan of counting cars the tv show youll love this game lol i cant wait till im at the point where i come across a car that i just have to have for myself and not just to resale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is going places and I love it. The Dev's are really working hard on this game and it gets several updats weekly. Keep up the good job.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to pick up, easy gameplay loop, not overly grindy. Just kinda satisfying to get cars, clean them up, fix them, and then haggle to sell them. Most polished of the car buy-sell genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The is fun and so easy to play. Has many different layers to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Game to play.  I would love to see more end game things and some additional details worked out.  Can be a bit repetitive, but I'm still enjoying it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game of the year the updates are always so good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, beat the game at 18 hours. Hopefully more cars in the future and maybe a new location in a city.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Fantastic game and i have really enjoyed this game. The Devs really nailed a great game and constantly have been working to improve it over time, with each update its become even better. I highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to chill with. the content is over fairly quickly, but it's fun to go through it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра классаная и щатгивающая, но не хватает контент после 10 уровня заправки",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great, and the Devs are awesome, constantly updating & adding new cars, fixing bugs, and letting everyone know via their Discord server.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can't really explain how or why but i have spent (according to steam) over 80 hours in this game. Never thought i would be soo invested in watching a game grow, when i started playing this was basic but every update brings more to do or manage. recommend to anyone that is interested in this genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve enjoyed Car Dealer Simulator a lot so far. The gameplay is surprisingly addicting, and it’s easy to lose track of time buying, fixing, and flipping cars. I’m really looking forward to future updates — especially more cars and new features that expand the game beyond the current endgame. There’s a solid foundation here, and I can’t wait to see how the developers build on it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game perfect pacing getting to the next objective wasn't too hard and wasn't too easy. It also does give stupid objectives after you complete the story like some games try to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The core gameplay loop and gameplay itself is quite good and enjoyable. Looking forward to furture updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, hotfix #103 made the game unplayable on my laptop, on start up it eats all 16gb of ram and causes failure. Actual gaming pc will be built in 2 weeks so hoping i'll be able to play again. a month long break is really testing my patience. I'd rate 7/10 because of start up issue. Will update once pc is built.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game may be short as once you hit reputation 10 in the game and buy it from your uncle the game is basically done and you just keep buyong and fixing up cars until you get all the achievements. it is still fun. needs more reputation levels",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've always been a huge fan of simulator games and I have played dozens of them. Some of them go unfinished, while others fizzle out after a few updates.\n\nThat cannot be said for this game. Since I have purchased this game, there has been an update just about every single day. These aren't always small bug fix updates. Actually, almost once every week we get a new vehicle and new mechanics/big improvements on others. You can tell that the devs really care about their game and the product they are selling.\n\nOverall performance of the game is great. I've never had any issues running this game. I haven't experienced any bug up to this point.\n\nIf you are on the fence and you love simulator games, this is a must have for your library. I am looking forward to what the devs add next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game for the price. Devs frequently update the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super fun game! If you enjoy cars, running businesses, and simulator-style gameplay, this is definitely the one for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Not a lot you can do at the start, but it slowly picks up. Still had everything done within around 40 hours. Only had a couple minor issues, and those were resolved within a week. Game still constantly being updated, as there is a new vehicle added every week. Some of the achievements are a grind, but still fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game with consisent updates\r\ncould do with some more post game stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun. didn't find any bugs. Did get stuck a few times on a tree or a pole, but it's simple to reset and it just puts you back on the road. Definitely needs more than 10 levels though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is incredibly stupid. And I love it!\n\nIt is nothing special, both the graphics and the economy could be better, but for relaxing, this is a perfect game.\n\n9.9/10, because nothing can be a 10/10, that would be boring",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and not only that but the support it on point. It is very clear to me that these folks care about what we think and welcome our feedback...that aside I enjoy this game a lot and it continues to improve week on week!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game Watch RCE and a few others play it. Its very relaxing plus when the game brakes the cars for no reason its fun to see it glitch out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy playing simulation games and this happens to be one of my top 5 that I have played. There is plenty to do in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oddly addictive game, Love the developers for there commitment to this game. The updates are happening pretty frequently and everytime the game gets even better. When you start out it is a bit grindy but that's probably true to how grindy it probably is to really start up a car business. \r\n\r\nHope they do even more with it. I'd love to see new areas, be able to open up franchises, online auctions, etc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really Enjoying playing this game! a few texture bugs every now and then but that might be my setup who knows!\nyou can get lost in this game for hours if you let it consume you, especially when you are doing the body work on the cars or anything else for that matter! (at least it happens to me! haha).\n\nhave videos up on youtube of me playing this game and ripping off... I mean selling cars to customers....\n\nhttps://youtube.com/@boundlessgaming7?si=cvOnikzGFZBRG68L",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great relaxing game. Hope it keeps expanding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed Car Dealer Simulator.  The most annoying part for me especially toward the end is driving to get the cars.  However, the game play for me was very enjoyable building the car dealership, repairing the cars and selling them.  repairing parts and this was not tiring like some games, you just toss it in a repair machine and presto after some time the parts are like new.  I enjoyed bargaining with sellers and buyers.  Washing and repairing the cars was fun for a while then it was great to hire someone to do it.  Nice relaxing game and I didn't really drive the cars but there are ramps and things to mess with the cars.  Love the game.  Glad I got it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommend, very addictive. \nOnly downside is that when you do max it out there isn’t too much to do other than grind for money. With so many regular updates and additions it does shake the game play up a bit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like cars, dealing cars, reparing cars and washing cars this is a game for you. It's a funny little arcade game that will get you hooked in no time. \r\nFor now there's about 40 hours of gameplay before you reach level 10. Doesn't seem a lot but the dev's keep putting stuff out every week, so it's a game very much alive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Lots of updates since. Devs really care and always delivering. Don't hesitate and start selling vehicles!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty much Facebook Marketplace sim and I'm all for it, you just buy junk clean it up a little and sell it to the next poor soul.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a good sit down to play and not have to think too much, I do enjoy playing to kill time. You can tell in some areas its still in development but any bugs are fixed fast!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though I've played a small amount of hours. I'd say its the most fun I've had playing a game in a long time. 100% recommend if you like getting stuck in!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and relaxing.  Mix of power wash simulator with store management.\nPros:\nChill game, for the most part you move at your own pace. There are some timed missions but they don't appear to be mandatory. \nGives you variety with each reputation level.\nCons:\nThe mid game progress feels slow.\nGets repetitive after a while.\n\nSolid on a sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really have been enjoying the game....When it works. I keep getting complete hard reset of my PC or it resetting and borking my save files to where I have to start over again. Its happens a lot on auto save/save and its inconstant. It happened with the demo and retail. I tried uninstalling, tried different drives every fix that I could find and really haven't gotten a response back from the developer yet. Your milage may very, and I give it a thumbs up, but just note the issues I've had. Hopefully an update will fix it soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, always being updated and sorting bugs out 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For what appears to be a first effort, this is a good sim game. Plenty of stuff to do, systems to manage. I also like that they're continually updating and adding new content, and it's not just new car models, 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill spill, blir litt repettetift etter vært, men bra spill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game if you like working hard to get your business up and running",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game. they seem to be adding to the game which is nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ngl, pretty good game that has potential, but after leveling to lvl 10 theres nothing to do, you can just grind and theres that, ive had fun in 15hours, but after that theres littearly nothing, so ill wait for the dlc and play again then, but for now theres no point in playing \nbtw optimalization is pretty shit, i play games lime bf6, cs2, witcher 3 and so on on my pc and i dont go under 60 fps on high or ultra settings, but in this game if theres alot that happens at once game goes to 20-30fps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very addictive and would recommend this game to just about anyone who enjoys sim games plus a little bit of a grind. i have a little over 90 hours into this game already and they continue to add things to this game every week. i respect the devs and teams behind this game. 100/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! It’s a ton of fun and super easy to get into. I highly recommend it if you’re looking for an enjoyable experience that won’t break the budget.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect blend of grind, moderate progression rate. It's beyond addicting!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend this game. Some play takes some getting used to, learning all the different things you can control or leave to employees over time. Excellent game for the price, and so refreshing to see dev team constantly tweaking the game and adding new content.  It is rare to see a team so involved day to day to perfect this game for the players. Definite 10/10!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game untill you reach level 10 or 11, not much to do after that, but i got a good 24h+ gametime out of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun, very relaxing to play, even when almost everything is automated the game keeps me coming back",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have no interest in cars but I found this game to be excellent. Continually being improved and satisfying, making a naff looking car into a good looking car; then selling it at a profit. Easy to play and at what ever pace the player wants to play at.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To anyone who is reading this, I highly recommend this game as it is fun and entertaining. One thing that I dislike and would improve is that it doesn't have steering wheel support to drive the cars. On the whole though I like the cleaning of cars, the fixing of cars and the buying and selling part is awesome to and I think you should buy this game if you were thinking about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, like how its not all unlocked in one day. Almost seems as there's been an update daily since i purchased weeks ago. Very devoted and hard working devs who listen! great job and cant wait for the DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Car Dealer Simulator delivers! The game itself is straight forward what you would expect from a sim like this.\nIt has an ever expanding library of cars, a progression system that makes sense with some quality of life features that help you avoiding micromanagement of all aspects of the game.\nKudos to that: The NPC hired hands do a fabulous job, much better than in many other games. Updates are frequent and meaningful, far from abandonware.\n\nThings I think need improvement:\n- driving physics: Brakes don't really do anything - you hit them and the vehicles just keep going.\n- impact of broken parts on driving behavior: You can have a suspension with 1% remaining and the car drives just the same as 100%. Same with engine, and the sound of a broken muffler is just the same as a new one.\n- overhaul the assets of buildings, rubble, and other aspects of the map. The map itself is not that big, and for that, you should have a more polished look.\n- the ability to change the game speed and/or ratio of the day/night cycle. Especially for streaming or YT videos, having at least less night or toggle daylight only would be helpful.\n\nWhat I think would be a cool idea, but maybe not feasible to implement:\n- a taxi service back to home.\n- an apartment or house to live in and decorate. This could be combined with unique events driving engagement with the content, e.g. a New Year's 2026 Champagne bottle or such.\n\nNow, overall, these are just minor things - don't get me wrong: The game is fun as it is - it just could be more fun ;-)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, reminds me of Car Mechanic Sim, but it isn't as detailed when repairing engine, suspension, break system but still addictive as hell. Would highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game! The devs are clearly investing time and effort to make it better with each update. Although I've already finished the campaign there's still a lot to be done to complete the game, which makes it still entertaining after quite some time playing! Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love that the developers are super active, adding and adjusting to suit requests and needs from players but man after the 30hr mark to grind out 100% steam achievements was a god damn chore\r\n\r\nRNG on cars for sale is so bad and the amount that are for sale daily is not enough for how many cars they have added to the game since launch.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The game is pretty decent\n\nHOWEVER, on the other hand, i dont know if it can be called a VIDEO game, if there re no challenges whatsoever, no drawbacks no matter what you do, no difficulty settings, no rivals , there is no wrong decision, or mistakes to be done.. just buy and fix and sell and it will always work. There is nothing to set you back or step on your toes .. u just grind to level 10 and ..well..that's it.. it's more like a challenge of how long you can grind for absolutely no reason whatsoever.. \n\nFor what is done already, it's done and polished well.. but feels like main purpose or heading to the game is still missing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Am sure it's a really nice, relaxing & great game though, but clearly doesn't work out well, if u don't own a good system! As it just frequently crashes all the time even in the Lowest of Settings. So yeah, in my personal experience, I won't recommend it though but, u folks can go ahead if u go for something different and try it out. Happy Gaming people !!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "soft locked on like quest 3 and you literally are not allowed to sell cars or do anything to progress because I have not fixed the 0/0 exhaust holes. Great",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to recommend this game but I keep having a fatal error and it crashes my game. It’s the assertion command state error. I am on steam deck and all my software is updated. I either load into a game and I fall through the world upon spawning and the game bugs out. Won’t give me prompts or let me do things. Any help?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game freezes down for the 2nd time after closing it. Only solution to fix it to restart the pc, or open a 2nd desktop, put the \"game\" to there, open the taskbar on the first one and force close the \"game\"...\r\nMaybe fix the bugs before adding new content to it next time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to say yes to this game so badly. But the dang thing crashes and forces me to hard reset so much that it infuriates me. Every time I quit the game I have to hard reset. Every time I'm mid game and go to load a previous save, hard reset. I've legit re-installed this thing five times because of all the times I uninstall from rage haha.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Im absolutely gutted to write a bad review for this game, because it has the world of potential under its feet. I thought it was an early access title, then realised it wasn't and I was playing a final product (Albeit with updates incoming but not the point).\n\nFirst, why its SO GOOD:\n\n- Addictive.\n- Finding a bargain and making money gib dopamine\n- Felt like genuine progression for the first few levels with huge progression on the horizon....\n\n....But its at a few levels in you realise, that what you have been doing, is pretty much it for the entire game. Buy a car, do it up (Or have one of your mechanics do it), sell it for profit. Rinse, repeat. There isn't a game beyond a certain point.\n\nAlso - Fuel Station at home? a 100+ car park? Who the heck needed those? You sell cars the same day you put them on sale, and you are individually responsible for moving them around. Imagine if you had 100 cars to run around to each and every station!?\n\nYou can buy a Tow Truck and its upgrade for $60k which makes picking up cars only 10% easier as you can carry two, but you can't pickup two large ones, so negates the point completely. Furthermore, you can tow large vehicles with the base standard trailer hitch you get.\n\nI found car sales pricing to be extremely patchy. I would buy one \"Porsche\" and make it perfect, sell for £60k, the next for £80k, even though the mileage and year were extremely similar. Sometimes I would get random beaters that fetched in immense cash, and others that weren't worth the hassle, but figuring it out was actually very difficult.\n\nAutomation would be nice here - Create a production line eventually where you can oversee it, what comes in (Quality vs Quantity), oversee pricing vs competition and the market, etc.\n\nI really wish the devs the best because this is a cracking effort, but getting to this point in just a short few days has left me gutted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Spawn in trapped under the tow truck and my player is stuck in the ground. No button to get player unstuck or a reset.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is completely unplayable, full of bugs, the more stuff and cars you have, the more and more bugs are appearing, every auto-save the game freezes, it even started to freeze without auto-save, good idea for a game but very bad execution, plus it becomes repetitive and boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The content of the game is way too low it needs more things to do. It’s fun for about 2–3 hours and keeps you hooked with the shop upgrades, but it still needs more. Hopefully, we’ll get new content soon, along with some UI improvements and performance tweaks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty decent\n\nHOWEVER, on the other hand, i dont know if it can be called a VIDEO game, if there re no challenges whatsoever, no drawbacks no matter what you do, no difficulty settings, no rivals , there is no wrong decision, or mistakes to be done.. just buy and fix and sell and it will always work. There is nothing to set you back or step on your toes .. u just grind to level 10 and ..well..that's it.. it's more like a challenge of how long you can grind for absolutely no reason whatsoever.. \n\nFor what is done already, it's done and polished well.. but feels like main purpose or heading to the game is still missing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i normally don't write reviews for games, but this one is terrible so i wanna save you the time and money. \nthis game is boring. the progression is soooooooooooooo slow. i got almost 10 hours in this thing and i'm still at the start. i can buy ONE car, muck it up, put a decent price on it and then i stand in front of my shop for minutes and minutes till a buyer comes along. then they always ALWAYS wanna hustle me for the price. ALWAYS! let's say the car is worth 22K, i put some working hours in it so i set the price to 25K. reasonable, right? then some slack-jawed FA- ...friend comes along and offers me 17K. and the next one. and the next one. you have to wait 5 to 6 customers in order to get the full price. which means waiting around, because the car won't sell if i don't stay on the property, attracting flies all day. so i can't drive around buying other cars, because i'm stuck with this one. \n\nso to summarize gameplay: \nwake up \nsit at the computer \nbuy a car \ndrive there \nhaggle the price \nload it up \ndrive home \nwash the car \nrepair the car \npark it and price it \nwaiting \nwaiting \nwaiting \nwaiting \ncustomer comes in, insults you with his offer \nsmile and say no \nwaiting \nwaiting \ncustomer comes in, another insult masked as an offer \nno \nwaiting \nwaiting \nwaiting \nnow it is night time so no one is coming anymore \nclose shop \ngo to bed \n------------ \nwake up \non the way to my computer i walk past my windows and see the car from yesterday out front. i realize that another day of waiting and waiting and waiting and shitty offers and more waiting is ahead of me \ntake a big swig of anti-freeze fluid \ncollapse on the floor foaming from the mouth\ngoodbye cruel world \n\nfinal verdict: i got a lot of simulation games because i like them and even the mid ones are at least fun for some time. but this game is torture from minute one. never has fun gameplay, it's just some mediocre tasks over and over and over again without any room for creativity. DON'T BUY IT!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Well, good and interesting game for a short time.\nNo optimalisation, lots of bugs and game stops working frequently or when switching off. Also it gets very tedious and repetetive after few hours... It's just grinding after that, but for what? To update your business buildings to the max level, then what? Economy is broken, town is hidious, like some fentanyl addicts slum, bar is there for what? To buy candies there? Like WHAT???\nReally, game has no endgame, but also no middle game, or middle-early game. After few hours it's boring as hell and nothing to do except buy some car, wash it, fix it, sell it. and repeat for billion times... No quests, no fillers, no interactions, no foreign business getting involved, fentanyl slums looking town, just VERY SIMPLE. For 5-10 €, why not. Not worth more for sure.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "absolute garbage. it doesnt expain anything, gives you a junk car that you can't even repair cause you need workshop upgrades, why even give me such a shit car then? what do you want me to do, read your walls on walls of text? no thanks. Also junkyard doess't work shop never open.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Am sure it's a really nice, relaxing & great game though, but clearly doesn't work out well, if u don't own a good system! As it just frequently crashes all the time even in the Lowest of Settings. So yeah, in my personal experience, I won't recommend it though but, u folks can go ahead if u go for something different and try it out. Happy Gaming people !!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "soft locked on like quest 3 and you literally are not allowed to sell cars or do anything to progress because I have not fixed the 0/0 exhaust holes. Great",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Runs like straight garbage, on the steamdeck and on my rig(6950xt I can max most games no problem at over 60 fps, I can't even get a stable 60 here). Refunded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game would be so so so so much better if you could play up to four players it kinda sucks to play alone",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If I could give this game a mixed review I would.\n\nPros:\nThe grind to level 10 does feel rewarding.\nA variety of vehicles.\nA lot of different things you can do to impact selling prices.\nDevs still pushing out fixes and releasing new vehicles.\n\nCons:\nAfter level 10 there isn't much to do other than grind for achievements.\nNPC's are goofy, bugged at times and voiced by two people.\nGame stops being fun once you realize there isn't anymore progression.\n\nSide note:\nOnce you get the dealership maxed out you realize that the \"town\" you reside in looks like it needs to be condemned. The dealership looks like the only place in town you won't need a tetanus shot.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Cant get passed the body work mission. I sanded the entire car for 3 hours and still 99% sanded. The game wont let you move on until you complete this mission.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Automatic car wash worked intermittently and then stopped working. Employee stopped showing up and working... Great game concept but bugged in many areas.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buggy, poor tutorials",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Plays well enough - the minigames are a little addictive at first but very quickly get monotonous and unsatisfying. There are no systems in the game for customizing cars beyond a paint job and this does not influence the pricing of the car at all. In fact...no matter how well you soup up certain cars they will have an arbitrary value placed on them and will never exceed it, no matter how perfectly you work it out. I enjoyed my time with this game but there really isn't anything beyond surface level game mechanics that would ever bring me back to it and I can't recommend it for that reason.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bought this game over the weekend after playing the demo for awhile and it's a fun game.\nBUT it lags SO BAD and the demo was not as bad and funny thing is i meet the requirements to play this.\ni will say it's fun game for sure i see a lot that can happen with it and i wont lie i'll be still playing it. It does teach a bit of how to fix stuff. It's not car mechanic sim but it's bit of a runner up.\nBut the only downsides just lag and stutters in general UH man.\n-Driving anything bigger then the pickup or van just DESTROY's my frames.\n-Autosave's kills the game locking it for 10 seconds.\n-i have to CTR ALT DEL every time to leave to desktop cause it just locks up HARD!!!\n-Little movements are like massive inputs when the game hits a lag. You small tap the key and your 15 feet from away from what your doing.\n-Driving is pure hell and haven the trailer attached to whatever vehicle it just magically ghost ride. Example i left my truck with trailer attached one side of the lot i come back 20 minutes later and it's jackknifed in the parking spaces. no where near where i left it!!\n-Dealing itself whether buying or selling feels like real life to much LOL but buying is like they can't do that 5 or 10 dollar difference or they disagree with said price and magically go back up to the last offer or a dollar more and for selling part they come hard with the low balls and then wont budge $1,000 pass there first offer it's like giving away everything for free.\n- ooh and this masked dude or whatever he is bruh can that a setting to turn him OFF cause every day or second day he's always coming and it's the same vehicle every time no matter where it's parked and only once he went after the cars i put in the parking spaces.\n\nAny ways enough with all that it is a good fun interesting game. Fixing this,selling that,buying this,upgrading that. I do hope maybe a co-op could be added?????? maybe you know kinda......someone else to help cause your employee's don't talk back or hang out or wanna try some jack*** stuff LOL but it'll make so much better have second person they can pick up the cars and drop off they work on something you can wash or fix something else and with the employee's to be well oiled machine.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is pretty decent\n\nHOWEVER, on the other hand, i dont know if it can be called a VIDEO game, if there re no challenges whatsoever, no drawbacks no matter what you do, no difficulty settings, no rivals , there is no wrong decision, or mistakes to be done.. just buy and fix and sell and it will always work. There is nothing to set you back or step on your toes .. u just grind to level 10 and ..well..that's it.. it's more like a challenge of how long you can grind for absolutely no reason whatsoever.. \n\nFor what is done already, it's done and polished well.. but feels like main purpose or heading to the game is still missing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the games seems like its a fun game but is hard to advance when the the tutorial bugs out and you cant finish fixing the cars it forces you to  fix so it makes the game unplayable",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Game started out constantly crashing. It got better for a while but now it's constantly crashing again. If I could get a refund now I would.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Am sure it's a really nice, relaxing & great game though, but clearly doesn't work out well, if u don't own a good system! As it just frequently crashes all the time even in the Lowest of Settings. So yeah, in my personal experience, I won't recommend it though but, u folks can go ahead if u go for something different and try it out. Happy Gaming people !!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "soft locked on like quest 3 and you literally are not allowed to sell cars or do anything to progress because I have not fixed the 0/0 exhaust holes. Great",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to recommend this game but I keep having a fatal error and it crashes my game. It’s the assertion command state error. I am on steam deck and all my software is updated. I either load into a game and I fall through the world upon spawning and the game bugs out. Won’t give me prompts or let me do things. Any help?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game freezes down for the 2nd time after closing it. Only solution to fix it to restart the pc, or open a 2nd desktop, put the \"game\" to there, open the taskbar on the first one and force close the \"game\"...\r\nMaybe fix the bugs before adding new content to it next time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to say yes to this game so badly. But the dang thing crashes and forces me to hard reset so much that it infuriates me. Every time I quit the game I have to hard reset. Every time I'm mid game and go to load a previous save, hard reset. I've legit re-installed this thing five times because of all the times I uninstall from rage haha.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Im absolutely gutted to write a bad review for this game, because it has the world of potential under its feet. I thought it was an early access title, then realised it wasn't and I was playing a final product (Albeit with updates incoming but not the point).\n\nFirst, why its SO GOOD:\n\n- Addictive.\n- Finding a bargain and making money gib dopamine\n- Felt like genuine progression for the first few levels with huge progression on the horizon....\n\n....But its at a few levels in you realise, that what you have been doing, is pretty much it for the entire game. Buy a car, do it up (Or have one of your mechanics do it), sell it for profit. Rinse, repeat. There isn't a game beyond a certain point.\n\nAlso - Fuel Station at home? a 100+ car park? Who the heck needed those? You sell cars the same day you put them on sale, and you are individually responsible for moving them around. Imagine if you had 100 cars to run around to each and every station!?\n\nYou can buy a Tow Truck and its upgrade for $60k which makes picking up cars only 10% easier as you can carry two, but you can't pickup two large ones, so negates the point completely. Furthermore, you can tow large vehicles with the base standard trailer hitch you get.\n\nI found car sales pricing to be extremely patchy. I would buy one \"Porsche\" and make it perfect, sell for £60k, the next for £80k, even though the mileage and year were extremely similar. Sometimes I would get random beaters that fetched in immense cash, and others that weren't worth the hassle, but figuring it out was actually very difficult.\n\nAutomation would be nice here - Create a production line eventually where you can oversee it, what comes in (Quality vs Quantity), oversee pricing vs competition and the market, etc.\n\nI really wish the devs the best because this is a cracking effort, but getting to this point in just a short few days has left me gutted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Spawn in trapped under the tow truck and my player is stuck in the ground. No button to get player unstuck or a reset.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is completely unplayable, full of bugs, the more stuff and cars you have, the more and more bugs are appearing, every auto-save the game freezes, it even started to freeze without auto-save, good idea for a game but very bad execution, plus it becomes repetitive and boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The content of the game is way too low it needs more things to do. It’s fun for about 2–3 hours and keeps you hooked with the shop upgrades, but it still needs more. Hopefully, we’ll get new content soon, along with some UI improvements and performance tweaks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is fun and all, but could need some optimising.\nsadly i can't recommend it yet because of the games issues, the most annoying being that loading a save crashes the game and same goes for trying to quit the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is mostly fun. But it feels like it's crafted to be an idle game but with none of the features of an idle game. The progress is really slow with more than a few noob traps (don't buy the gas hub or the fuel tank it's not a gas station like I thought) and you don't really have the chance to walk away and let your car dealership run while your employees do it because most employees can't be hired until the 3rd upgrades. Most of the story pauses for a really long time. A quest said advance to Reputation level 3 and I completed that within the first 2-3 hours of the game. The next quest was advance to Reputation level 7. I thought oh maybe I'll hit it in another 3 hours. Almost 9 hours later I'm still not there. I get that it's an early access simulator game so they're all supposed to be really low quality (that's part of the charm) but this one feels like it's trying to be an idle game instead but starting you off in a very tedious version of a simulator game. I'd recommend lowering some of the values to speed up progress no matter which way you decide to take the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is bugged out cant progress after the repair stage. Contacted steam for a refund! Do NOT download.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i normally don't write reviews for games, but this one is terrible so i wanna save you the time and money. \nthis game is boring. the progression is soooooooooooooo slow. i got almost 10 hours in this thing and i'm still at the start. i can buy ONE car, muck it up, put a decent price on it and then i stand in front of my shop for minutes and minutes till a buyer comes along. then they always ALWAYS wanna hustle me for the price. ALWAYS! let's say the car is worth 22K, i put some working hours in it so i set the price to 25K. reasonable, right? then some slack-jawed FA- ...friend comes along and offers me 17K. and the next one. and the next one. you have to wait 5 to 6 customers in order to get the full price. which means waiting around, because the car won't sell if i don't stay on the property, attracting flies all day. so i can't drive around buying other cars, because i'm stuck with this one. \n\nso to summarize gameplay: \nwake up \nsit at the computer \nbuy a car \ndrive there \nhaggle the price \nload it up \ndrive home \nwash the car \nrepair the car \npark it and price it \nwaiting \nwaiting \nwaiting \nwaiting \ncustomer comes in, insults you with his offer \nsmile and say no \nwaiting \nwaiting \ncustomer comes in, another insult masked as an offer \nno \nwaiting \nwaiting \nwaiting \nnow it is night time so no one is coming anymore \nclose shop \ngo to bed \n------------ \nwake up \non the way to my computer i walk past my windows and see the car from yesterday out front. i realize that another day of waiting and waiting and waiting and shitty offers and more waiting is ahead of me \ntake a big swig of anti-freeze fluid \ncollapse on the floor foaming from the mouth\ngoodbye cruel world \n\nfinal verdict: i got a lot of simulation games because i like them and even the mid ones are at least fun for some time. but this game is torture from minute one. never has fun gameplay, it's just some mediocre tasks over and over and over again without any room for creativity. DON'T BUY IT!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Well, good and interesting game for a short time.\nNo optimalisation, lots of bugs and game stops working frequently or when switching off. Also it gets very tedious and repetetive after few hours... It's just grinding after that, but for what? To update your business buildings to the max level, then what? Economy is broken, town is hidious, like some fentanyl addicts slum, bar is there for what? To buy candies there? Like WHAT???\nReally, game has no endgame, but also no middle game, or middle-early game. After few hours it's boring as hell and nothing to do except buy some car, wash it, fix it, sell it. and repeat for billion times... No quests, no fillers, no interactions, no foreign business getting involved, fentanyl slums looking town, just VERY SIMPLE. For 5-10 €, why not. Not worth more for sure.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i exceed the system requirements and play the game on default settings yet it still has \"fatal error\"s consistently.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Runs like straight garbage, on the steamdeck and on my rig(6950xt I can max most games no problem at over 60 fps, I can't even get a stable 60 here). Refunded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game would be so so so so much better if you could play up to four players it kinda sucks to play alone",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If I could give this game a mixed review I would.\n\nPros:\nThe grind to level 10 does feel rewarding.\nA variety of vehicles.\nA lot of different things you can do to impact selling prices.\nDevs still pushing out fixes and releasing new vehicles.\n\nCons:\nAfter level 10 there isn't much to do other than grind for achievements.\nNPC's are goofy, bugged at times and voiced by two people.\nGame stops being fun once you realize there isn't anymore progression.\n\nSide note:\nOnce you get the dealership maxed out you realize that the \"town\" you reside in looks like it needs to be condemned. The dealership looks like the only place in town you won't need a tetanus shot.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Cant get passed the body work mission. I sanded the entire car for 3 hours and still 99% sanded. The game wont let you move on until you complete this mission.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Automatic car wash worked intermittently and then stopped working. Employee stopped showing up and working... Great game concept but bugged in many areas.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buggy, poor tutorials",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Plays well enough - the minigames are a little addictive at first but very quickly get monotonous and unsatisfying. There are no systems in the game for customizing cars beyond a paint job and this does not influence the pricing of the car at all. In fact...no matter how well you soup up certain cars they will have an arbitrary value placed on them and will never exceed it, no matter how perfectly you work it out. I enjoyed my time with this game but there really isn't anything beyond surface level game mechanics that would ever bring me back to it and I can't recommend it for that reason.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bought this game over the weekend after playing the demo for awhile and it's a fun game.\nBUT it lags SO BAD and the demo was not as bad and funny thing is i meet the requirements to play this.\ni will say it's fun game for sure i see a lot that can happen with it and i wont lie i'll be still playing it. It does teach a bit of how to fix stuff. It's not car mechanic sim but it's bit of a runner up.\nBut the only downsides just lag and stutters in general UH man.\n-Driving anything bigger then the pickup or van just DESTROY's my frames.\n-Autosave's kills the game locking it for 10 seconds.\n-i have to CTR ALT DEL every time to leave to desktop cause it just locks up HARD!!!\n-Little movements are like massive inputs when the game hits a lag. You small tap the key and your 15 feet from away from what your doing.\n-Driving is pure hell and haven the trailer attached to whatever vehicle it just magically ghost ride. Example i left my truck with trailer attached one side of the lot i come back 20 minutes later and it's jackknifed in the parking spaces. no where near where i left it!!\n-Dealing itself whether buying or selling feels like real life to much LOL but buying is like they can't do that 5 or 10 dollar difference or they disagree with said price and magically go back up to the last offer or a dollar more and for selling part they come hard with the low balls and then wont budge $1,000 pass there first offer it's like giving away everything for free.\n- ooh and this masked dude or whatever he is bruh can that a setting to turn him OFF cause every day or second day he's always coming and it's the same vehicle every time no matter where it's parked and only once he went after the cars i put in the parking spaces.\n\nAny ways enough with all that it is a good fun interesting game. Fixing this,selling that,buying this,upgrading that. I do hope maybe a co-op could be added?????? maybe you know kinda......someone else to help cause your employee's don't talk back or hang out or wanna try some jack*** stuff LOL but it'll make so much better have second person they can pick up the cars and drop off they work on something you can wash or fix something else and with the employee's to be well oiled machine.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the games seems like its a fun game but is hard to advance when the the tutorial bugs out and you cant finish fixing the cars it forces you to  fix so it makes the game unplayable",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Game started out constantly crashing. It got better for a while but now it's constantly crashing again. If I could get a refund now I would.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I want to recommend this game but I keep having a fatal error and it crashes my game. It’s the assertion command state error. I am on steam deck and all my software is updated. I either load into a game and I fall through the world upon spawning and the game bugs out. Won’t give me prompts or let me do things. Any help?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game freezes down for the 2nd time after closing it. Only solution to fix it to restart the pc, or open a 2nd desktop, put the \"game\" to there, open the taskbar on the first one and force close the \"game\"...\r\nMaybe fix the bugs before adding new content to it next time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to say yes to this game so badly. But the dang thing crashes and forces me to hard reset so much that it infuriates me. Every time I quit the game I have to hard reset. Every time I'm mid game and go to load a previous save, hard reset. I've legit re-installed this thing five times because of all the times I uninstall from rage haha.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Im absolutely gutted to write a bad review for this game, because it has the world of potential under its feet. I thought it was an early access title, then realised it wasn't and I was playing a final product (Albeit with updates incoming but not the point).\n\nFirst, why its SO GOOD:\n\n- Addictive.\n- Finding a bargain and making money gib dopamine\n- Felt like genuine progression for the first few levels with huge progression on the horizon....\n\n....But its at a few levels in you realise, that what you have been doing, is pretty much it for the entire game. Buy a car, do it up (Or have one of your mechanics do it), sell it for profit. Rinse, repeat. There isn't a game beyond a certain point.\n\nAlso - Fuel Station at home? a 100+ car park? Who the heck needed those? You sell cars the same day you put them on sale, and you are individually responsible for moving them around. Imagine if you had 100 cars to run around to each and every station!?\n\nYou can buy a Tow Truck and its upgrade for $60k which makes picking up cars only 10% easier as you can carry two, but you can't pickup two large ones, so negates the point completely. Furthermore, you can tow large vehicles with the base standard trailer hitch you get.\n\nI found car sales pricing to be extremely patchy. I would buy one \"Porsche\" and make it perfect, sell for £60k, the next for £80k, even though the mileage and year were extremely similar. Sometimes I would get random beaters that fetched in immense cash, and others that weren't worth the hassle, but figuring it out was actually very difficult.\n\nAutomation would be nice here - Create a production line eventually where you can oversee it, what comes in (Quality vs Quantity), oversee pricing vs competition and the market, etc.\n\nI really wish the devs the best because this is a cracking effort, but getting to this point in just a short few days has left me gutted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Spawn in trapped under the tow truck and my player is stuck in the ground. No button to get player unstuck or a reset.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is completely unplayable, full of bugs, the more stuff and cars you have, the more and more bugs are appearing, every auto-save the game freezes, it even started to freeze without auto-save, good idea for a game but very bad execution, plus it becomes repetitive and boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The content of the game is way too low it needs more things to do. It’s fun for about 2–3 hours and keeps you hooked with the shop upgrades, but it still needs more. Hopefully, we’ll get new content soon, along with some UI improvements and performance tweaks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty decent\n\nHOWEVER, on the other hand, i dont know if it can be called a VIDEO game, if there re no challenges whatsoever, no drawbacks no matter what you do, no difficulty settings, no rivals , there is no wrong decision, or mistakes to be done.. just buy and fix and sell and it will always work. There is nothing to set you back or step on your toes .. u just grind to level 10 and ..well..that's it.. it's more like a challenge of how long you can grind for absolutely no reason whatsoever.. \n\nFor what is done already, it's done and polished well.. but feels like main purpose or heading to the game is still missing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i normally don't write reviews for games, but this one is terrible so i wanna save you the time and money. \nthis game is boring. the progression is soooooooooooooo slow. i got almost 10 hours in this thing and i'm still at the start. i can buy ONE car, muck it up, put a decent price on it and then i stand in front of my shop for minutes and minutes till a buyer comes along. then they always ALWAYS wanna hustle me for the price. ALWAYS! let's say the car is worth 22K, i put some working hours in it so i set the price to 25K. reasonable, right? then some slack-jawed FA- ...friend comes along and offers me 17K. and the next one. and the next one. you have to wait 5 to 6 customers in order to get the full price. which means waiting around, because the car won't sell if i don't stay on the property, attracting flies all day. so i can't drive around buying other cars, because i'm stuck with this one. \n\nso to summarize gameplay: \nwake up \nsit at the computer \nbuy a car \ndrive there \nhaggle the price \nload it up \ndrive home \nwash the car \nrepair the car \npark it and price it \nwaiting \nwaiting \nwaiting \nwaiting \ncustomer comes in, insults you with his offer \nsmile and say no \nwaiting \nwaiting \ncustomer comes in, another insult masked as an offer \nno \nwaiting \nwaiting \nwaiting \nnow it is night time so no one is coming anymore \nclose shop \ngo to bed \n------------ \nwake up \non the way to my computer i walk past my windows and see the car from yesterday out front. i realize that another day of waiting and waiting and waiting and shitty offers and more waiting is ahead of me \ntake a big swig of anti-freeze fluid \ncollapse on the floor foaming from the mouth\ngoodbye cruel world \n\nfinal verdict: i got a lot of simulation games because i like them and even the mid ones are at least fun for some time. but this game is torture from minute one. never has fun gameplay, it's just some mediocre tasks over and over and over again without any room for creativity. DON'T BUY IT!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Well, good and interesting game for a short time.\nNo optimalisation, lots of bugs and game stops working frequently or when switching off. Also it gets very tedious and repetetive after few hours... It's just grinding after that, but for what? To update your business buildings to the max level, then what? Economy is broken, town is hidious, like some fentanyl addicts slum, bar is there for what? To buy candies there? Like WHAT???\nReally, game has no endgame, but also no middle game, or middle-early game. After few hours it's boring as hell and nothing to do except buy some car, wash it, fix it, sell it. and repeat for billion times... No quests, no fillers, no interactions, no foreign business getting involved, fentanyl slums looking town, just VERY SIMPLE. For 5-10 €, why not. Not worth more for sure.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "absolute garbage. it doesnt expain anything, gives you a junk car that you can't even repair cause you need workshop upgrades, why even give me such a shit car then? what do you want me to do, read your walls on walls of text? no thanks. Also junkyard doess't work shop never open.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Am sure it's a really nice, relaxing & great game though, but clearly doesn't work out well, if u don't own a good system! As it just frequently crashes all the time even in the Lowest of Settings. So yeah, in my personal experience, I won't recommend it though but, u folks can go ahead if u go for something different and try it out. Happy Gaming people !!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "soft locked on like quest 3 and you literally are not allowed to sell cars or do anything to progress because I have not fixed the 0/0 exhaust holes. Great",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Runs like straight garbage, on the steamdeck and on my rig(6950xt I can max most games no problem at over 60 fps, I can't even get a stable 60 here). Refunded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game would be so so so so much better if you could play up to four players it kinda sucks to play alone",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If I could give this game a mixed review I would.\n\nPros:\nThe grind to level 10 does feel rewarding.\nA variety of vehicles.\nA lot of different things you can do to impact selling prices.\nDevs still pushing out fixes and releasing new vehicles.\n\nCons:\nAfter level 10 there isn't much to do other than grind for achievements.\nNPC's are goofy, bugged at times and voiced by two people.\nGame stops being fun once you realize there isn't anymore progression.\n\nSide note:\nOnce you get the dealership maxed out you realize that the \"town\" you reside in looks like it needs to be condemned. The dealership looks like the only place in town you won't need a tetanus shot.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Cant get passed the body work mission. I sanded the entire car for 3 hours and still 99% sanded. The game wont let you move on until you complete this mission.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Automatic car wash worked intermittently and then stopped working. Employee stopped showing up and working... Great game concept but bugged in many areas.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buggy, poor tutorials",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Plays well enough - the minigames are a little addictive at first but very quickly get monotonous and unsatisfying. There are no systems in the game for customizing cars beyond a paint job and this does not influence the pricing of the car at all. In fact...no matter how well you soup up certain cars they will have an arbitrary value placed on them and will never exceed it, no matter how perfectly you work it out. I enjoyed my time with this game but there really isn't anything beyond surface level game mechanics that would ever bring me back to it and I can't recommend it for that reason.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bought this game over the weekend after playing the demo for awhile and it's a fun game.\nBUT it lags SO BAD and the demo was not as bad and funny thing is i meet the requirements to play this.\ni will say it's fun game for sure i see a lot that can happen with it and i wont lie i'll be still playing it. It does teach a bit of how to fix stuff. It's not car mechanic sim but it's bit of a runner up.\nBut the only downsides just lag and stutters in general UH man.\n-Driving anything bigger then the pickup or van just DESTROY's my frames.\n-Autosave's kills the game locking it for 10 seconds.\n-i have to CTR ALT DEL every time to leave to desktop cause it just locks up HARD!!!\n-Little movements are like massive inputs when the game hits a lag. You small tap the key and your 15 feet from away from what your doing.\n-Driving is pure hell and haven the trailer attached to whatever vehicle it just magically ghost ride. Example i left my truck with trailer attached one side of the lot i come back 20 minutes later and it's jackknifed in the parking spaces. no where near where i left it!!\n-Dealing itself whether buying or selling feels like real life to much LOL but buying is like they can't do that 5 or 10 dollar difference or they disagree with said price and magically go back up to the last offer or a dollar more and for selling part they come hard with the low balls and then wont budge $1,000 pass there first offer it's like giving away everything for free.\n- ooh and this masked dude or whatever he is bruh can that a setting to turn him OFF cause every day or second day he's always coming and it's the same vehicle every time no matter where it's parked and only once he went after the cars i put in the parking spaces.\n\nAny ways enough with all that it is a good fun interesting game. Fixing this,selling that,buying this,upgrading that. I do hope maybe a co-op could be added?????? maybe you know kinda......someone else to help cause your employee's don't talk back or hang out or wanna try some jack*** stuff LOL but it'll make so much better have second person they can pick up the cars and drop off they work on something you can wash or fix something else and with the employee's to be well oiled machine.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the games seems like its a fun game but is hard to advance when the the tutorial bugs out and you cant finish fixing the cars it forces you to  fix so it makes the game unplayable",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Game started out constantly crashing. It got better for a while but now it's constantly crashing again. If I could get a refund now I would.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I want to recommend this game but I keep having a fatal error and it crashes my game. It’s the assertion command state error. I am on steam deck and all my software is updated. I either load into a game and I fall through the world upon spawning and the game bugs out. Won’t give me prompts or let me do things. Any help?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game freezes down for the 2nd time after closing it. Only solution to fix it to restart the pc, or open a 2nd desktop, put the \"game\" to there, open the taskbar on the first one and force close the \"game\"...\r\nMaybe fix the bugs before adding new content to it next time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to say yes to this game so badly. But the dang thing crashes and forces me to hard reset so much that it infuriates me. Every time I quit the game I have to hard reset. Every time I'm mid game and go to load a previous save, hard reset. I've legit re-installed this thing five times because of all the times I uninstall from rage haha.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Im absolutely gutted to write a bad review for this game, because it has the world of potential under its feet. I thought it was an early access title, then realised it wasn't and I was playing a final product (Albeit with updates incoming but not the point).\n\nFirst, why its SO GOOD:\n\n- Addictive.\n- Finding a bargain and making money gib dopamine\n- Felt like genuine progression for the first few levels with huge progression on the horizon....\n\n....But its at a few levels in you realise, that what you have been doing, is pretty much it for the entire game. Buy a car, do it up (Or have one of your mechanics do it), sell it for profit. Rinse, repeat. There isn't a game beyond a certain point.\n\nAlso - Fuel Station at home? a 100+ car park? Who the heck needed those? You sell cars the same day you put them on sale, and you are individually responsible for moving them around. Imagine if you had 100 cars to run around to each and every station!?\n\nYou can buy a Tow Truck and its upgrade for $60k which makes picking up cars only 10% easier as you can carry two, but you can't pickup two large ones, so negates the point completely. Furthermore, you can tow large vehicles with the base standard trailer hitch you get.\n\nI found car sales pricing to be extremely patchy. I would buy one \"Porsche\" and make it perfect, sell for £60k, the next for £80k, even though the mileage and year were extremely similar. Sometimes I would get random beaters that fetched in immense cash, and others that weren't worth the hassle, but figuring it out was actually very difficult.\n\nAutomation would be nice here - Create a production line eventually where you can oversee it, what comes in (Quality vs Quantity), oversee pricing vs competition and the market, etc.\n\nI really wish the devs the best because this is a cracking effort, but getting to this point in just a short few days has left me gutted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Spawn in trapped under the tow truck and my player is stuck in the ground. No button to get player unstuck or a reset.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is completely unplayable, full of bugs, the more stuff and cars you have, the more and more bugs are appearing, every auto-save the game freezes, it even started to freeze without auto-save, good idea for a game but very bad execution, plus it becomes repetitive and boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The content of the game is way too low it needs more things to do. It’s fun for about 2–3 hours and keeps you hooked with the shop upgrades, but it still needs more. Hopefully, we’ll get new content soon, along with some UI improvements and performance tweaks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty decent\n\nHOWEVER, on the other hand, i dont know if it can be called a VIDEO game, if there re no challenges whatsoever, no drawbacks no matter what you do, no difficulty settings, no rivals , there is no wrong decision, or mistakes to be done.. just buy and fix and sell and it will always work. There is nothing to set you back or step on your toes .. u just grind to level 10 and ..well..that's it.. it's more like a challenge of how long you can grind for absolutely no reason whatsoever.. \n\nFor what is done already, it's done and polished well.. but feels like main purpose or heading to the game is still missing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i normally don't write reviews for games, but this one is terrible so i wanna save you the time and money. \nthis game is boring. the progression is soooooooooooooo slow. i got almost 10 hours in this thing and i'm still at the start. i can buy ONE car, muck it up, put a decent price on it and then i stand in front of my shop for minutes and minutes till a buyer comes along. then they always ALWAYS wanna hustle me for the price. ALWAYS! let's say the car is worth 22K, i put some working hours in it so i set the price to 25K. reasonable, right? then some slack-jawed FA- ...friend comes along and offers me 17K. and the next one. and the next one. you have to wait 5 to 6 customers in order to get the full price. which means waiting around, because the car won't sell if i don't stay on the property, attracting flies all day. so i can't drive around buying other cars, because i'm stuck with this one. \n\nso to summarize gameplay: \nwake up \nsit at the computer \nbuy a car \ndrive there \nhaggle the price \nload it up \ndrive home \nwash the car \nrepair the car \npark it and price it \nwaiting \nwaiting \nwaiting \nwaiting \ncustomer comes in, insults you with his offer \nsmile and say no \nwaiting \nwaiting \ncustomer comes in, another insult masked as an offer \nno \nwaiting \nwaiting \nwaiting \nnow it is night time so no one is coming anymore \nclose shop \ngo to bed \n------------ \nwake up \non the way to my computer i walk past my windows and see the car from yesterday out front. i realize that another day of waiting and waiting and waiting and shitty offers and more waiting is ahead of me \ntake a big swig of anti-freeze fluid \ncollapse on the floor foaming from the mouth\ngoodbye cruel world \n\nfinal verdict: i got a lot of simulation games because i like them and even the mid ones are at least fun for some time. but this game is torture from minute one. never has fun gameplay, it's just some mediocre tasks over and over and over again without any room for creativity. DON'T BUY IT!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Well, good and interesting game for a short time.\nNo optimalisation, lots of bugs and game stops working frequently or when switching off. Also it gets very tedious and repetetive after few hours... It's just grinding after that, but for what? To update your business buildings to the max level, then what? Economy is broken, town is hidious, like some fentanyl addicts slum, bar is there for what? To buy candies there? Like WHAT???\nReally, game has no endgame, but also no middle game, or middle-early game. After few hours it's boring as hell and nothing to do except buy some car, wash it, fix it, sell it. and repeat for billion times... No quests, no fillers, no interactions, no foreign business getting involved, fentanyl slums looking town, just VERY SIMPLE. For 5-10 €, why not. Not worth more for sure.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "absolute garbage. it doesnt expain anything, gives you a junk car that you can't even repair cause you need workshop upgrades, why even give me such a shit car then? what do you want me to do, read your walls on walls of text? no thanks. Also junkyard doess't work shop never open.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Am sure it's a really nice, relaxing & great game though, but clearly doesn't work out well, if u don't own a good system! As it just frequently crashes all the time even in the Lowest of Settings. So yeah, in my personal experience, I won't recommend it though but, u folks can go ahead if u go for something different and try it out. Happy Gaming people !!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "soft locked on like quest 3 and you literally are not allowed to sell cars or do anything to progress because I have not fixed the 0/0 exhaust holes. Great",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Runs like straight garbage, on the steamdeck and on my rig(6950xt I can max most games no problem at over 60 fps, I can't even get a stable 60 here). Refunded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game would be so so so so much better if you could play up to four players it kinda sucks to play alone",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If I could give this game a mixed review I would.\n\nPros:\nThe grind to level 10 does feel rewarding.\nA variety of vehicles.\nA lot of different things you can do to impact selling prices.\nDevs still pushing out fixes and releasing new vehicles.\n\nCons:\nAfter level 10 there isn't much to do other than grind for achievements.\nNPC's are goofy, bugged at times and voiced by two people.\nGame stops being fun once you realize there isn't anymore progression.\n\nSide note:\nOnce you get the dealership maxed out you realize that the \"town\" you reside in looks like it needs to be condemned. The dealership looks like the only place in town you won't need a tetanus shot.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Cant get passed the body work mission. I sanded the entire car for 3 hours and still 99% sanded. The game wont let you move on until you complete this mission.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Automatic car wash worked intermittently and then stopped working. Employee stopped showing up and working... Great game concept but bugged in many areas.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buggy, poor tutorials",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Plays well enough - the minigames are a little addictive at first but very quickly get monotonous and unsatisfying. There are no systems in the game for customizing cars beyond a paint job and this does not influence the pricing of the car at all. In fact...no matter how well you soup up certain cars they will have an arbitrary value placed on them and will never exceed it, no matter how perfectly you work it out. I enjoyed my time with this game but there really isn't anything beyond surface level game mechanics that would ever bring me back to it and I can't recommend it for that reason.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bought this game over the weekend after playing the demo for awhile and it's a fun game.\nBUT it lags SO BAD and the demo was not as bad and funny thing is i meet the requirements to play this.\ni will say it's fun game for sure i see a lot that can happen with it and i wont lie i'll be still playing it. It does teach a bit of how to fix stuff. It's not car mechanic sim but it's bit of a runner up.\nBut the only downsides just lag and stutters in general UH man.\n-Driving anything bigger then the pickup or van just DESTROY's my frames.\n-Autosave's kills the game locking it for 10 seconds.\n-i have to CTR ALT DEL every time to leave to desktop cause it just locks up HARD!!!\n-Little movements are like massive inputs when the game hits a lag. You small tap the key and your 15 feet from away from what your doing.\n-Driving is pure hell and haven the trailer attached to whatever vehicle it just magically ghost ride. Example i left my truck with trailer attached one side of the lot i come back 20 minutes later and it's jackknifed in the parking spaces. no where near where i left it!!\n-Dealing itself whether buying or selling feels like real life to much LOL but buying is like they can't do that 5 or 10 dollar difference or they disagree with said price and magically go back up to the last offer or a dollar more and for selling part they come hard with the low balls and then wont budge $1,000 pass there first offer it's like giving away everything for free.\n- ooh and this masked dude or whatever he is bruh can that a setting to turn him OFF cause every day or second day he's always coming and it's the same vehicle every time no matter where it's parked and only once he went after the cars i put in the parking spaces.\n\nAny ways enough with all that it is a good fun interesting game. Fixing this,selling that,buying this,upgrading that. I do hope maybe a co-op could be added?????? maybe you know kinda......someone else to help cause your employee's don't talk back or hang out or wanna try some jack*** stuff LOL but it'll make so much better have second person they can pick up the cars and drop off they work on something you can wash or fix something else and with the employee's to be well oiled machine.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the games seems like its a fun game but is hard to advance when the the tutorial bugs out and you cant finish fixing the cars it forces you to  fix so it makes the game unplayable",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Game started out constantly crashing. It got better for a while but now it's constantly crashing again. If I could get a refund now I would.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I want to recommend this game but I keep having a fatal error and it crashes my game. It’s the assertion command state error. I am on steam deck and all my software is updated. I either load into a game and I fall through the world upon spawning and the game bugs out. Won’t give me prompts or let me do things. Any help?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game freezes down for the 2nd time after closing it. Only solution to fix it to restart the pc, or open a 2nd desktop, put the \"game\" to there, open the taskbar on the first one and force close the \"game\"...\r\nMaybe fix the bugs before adding new content to it next time.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}