{
  "positive": [
    {
      "review": "Game Review: Luma Island – The Pirate Update\r\n⭐ 9/10\r\n\r\nOh Luma Island, you beautiful time-thief of a game — I went in for a “quick peek” and came out 60 hours later, completely hooked and finished the game. The new Pirate Update adds even more charm to an already delightful world, and I’m not even mad about the sleep I lost.\r\n\r\nLet’s get this out of the way first: UNLIMITED. INVENTORY. Truly a blessing from the game dev heavens. Whoever decided to bless us with that feature deserves a medal. No more sorting, no more tossing precious loot just to make room — it’s pure, guilt-free hoarding bliss. I could collect seashells, ores, and random shiny things for days, and the game just lets me. Absolute perfection.\r\n\r\nWhat really makes Luma Island special is how it lets you explore different professions on your own terms. You want to be a fisher today? Great. A farmer tomorrow? Perfect. Maybe a miner or a cook next week? Go wild. There’s no pressure, no grind that forces you into one path — just the joy of discovering what you love, when you feel like it.\r\n\r\nSure, there’s still a bit of polishing left to do — a few rough edges here and there — but honestly, it’s easy to overlook when the game’s spirit shines this bright. The devs clearly poured heart and soul into this update, and it shows.\r\n\r\nLuma Island – The Pirate Update is vibrant, cozy, and bursting with personality. It’s the kind of game that makes you lose track of time in the best way possible. I can’t wait to dive back in for another playthrough… and maybe add more pirate mayhem next time. 🏴☠️🌴",
      "voted_up": true,
      "votes_helpful": 69
    },
    {
      "review": "I saw this promo on reddit and thought my steam featured/discovery queue was on par with survival, crafting, open worlds multiplayer and solo play games release alerts. I was wrong as a 20+ year steam vet. These folks promoted it outside the bubble and I have loved this game playing solo and still playing now. Quick and simple response... Game is well optimized. Graphics are smooth and fit the experience. Sound and controller support is well developed and universally supportive. Gameplay and story? It's 100% relaxing, you do not feel like you have to grind for hours. You move forward ingame smoothly and well balanced as others said. Is it worth the -30% USD price of $13.99 ending on 12/1? Yes, 100%",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "A girl on Instagram was showing her cozy setup. I asked the title of the game she was playing and BOOM, I was introduced to Luma Island. It's all I've ever wanted from a cozy game: there's a ton of things to do, it's cute and absolutely [u]not frustrating[/u]. I can't believe that I never heard of this game, the definition of a hidden gem.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Overall, this game is well built and extensive, so I'm giving it a thumbs up. But I can't say I really enjoy playing it, even after a few attempts with months in between. After reading other reviews, I must be an outlier.\r\nPersonally, I find the loot/drops to be overwhelming in volume and variety (far too many items to keep track of) and the UI to be missing some extremely basic functionality and display. As others have mentioned, tracking against multiple tasks can be difficult. An improved quests/task widget, perhaps with a small map, would vastly improve things. But more importantly, why is the toolbar resistant to clicks? Why must I use the mouse wheel or number keys to select items—why not allow the user to click the item they want to use?\r\nI'm glad to see others really enjoy this game but these seemingly small, materially major, oversights ruined it for me.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "If you played Stardew Valley and really enjoyed the gameplay over everything else, this game was designed specifically for players like you. Also graphics and style is breathtakingly pretty.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game genuinly is so underrated. Its got the right amount of cozy and the right amount of fantasy but still enough challenge. Since Stardew Valley I am barely able to play any other cozy games but Luma island is amazing, can play this for hours!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "very addicting. love that you get to decorate your whole island. The fishing mechanic is something new I have never seen before, the professions are fun to build up, the quest are fun, and i love the mines, the temples and the puzzles added all over. The lumas and farm animals are adorable and I love that they all have a purpose. \r\n\r\nThe only 2 complaints i have are the map, and once you clear land it comes right back . I know we need it to come back in some cases for resources, but I wish we could have a setting that we could turn off foliage or growth in our grass areas. or you could select the option once it is cleared not to grow back. Now the map does have a way point to certain spots which is nice, but I would at least like to have the way point be able to be used anywhere all over the map.  and it could be a lot more detailed and a grid would be nice especially for multi player, so you can tell the others where you are at.  otherwise the game play is amazing",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great game that my girlfriend and I like to play together and relax. You can dump as much or as little time as you'd like playing. Buy it on sale rn. Highly recommend playing with a friend to up the experience. \n\nAudio is a great experience and I love the visuals. I have played on steam deck but from what I recall it used lots of battery fast.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hey gamers,\nThis game feels cozy, relaxing, open world, crafting, exploring, puzzle, you name it! For me is a new game added to my top favorite games and that is why I got to 100% achievements...cause I love it and also I LOVE my Luma Turtle! Over all the game is new, the team that created it is new, they still have something to improve and with this beautiful community they can create an amazing game...if the will listen to the community as well! Much love from Luma Island and stay safe out there! <3 Wazzisgaming (WG)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is truely one of the best cozy games ever made. You have so much freedom and never need to fear doing something wrong. Luma Island and Fields of Mystria, you don't need anything else. The unlimited inventory, all these different things to explore. It's a great game for every type of gamer. It is a real shame that not more people talk about this. I never have seen it being recommended when searching for multiplayer games, even though it is just perfect to play with your friends and family. I bought it 3 days ago and i already have 22 hours of playtime and no end in sight. I can totally recommend buying this game even when it's not on sale. Please support those great devs! If theres ever a dlc or anything coming out, i'll definetly buy it! :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Luma Island is a warm, free-form life-sim and exploration game developed and published by Feel Free Games, designed to offer players a slow and soothing escape into a colorful archipelago filled with treasure, magical creatures, and easygoing island routines. From the moment you arrive, the game makes its philosophy clear: this is a world meant to be lived in at your own pace. There are no stamina bars pushing you to bed, no strict inventory limits keeping you from gathering more materials, and no stressful timers forcing you down a particular path. Instead, Luma Island opens its arms to creativity and curiosity, encouraging you to farm, craft, explore, sail, and raise adorable creatures simply because you feel like it. This relaxed structure defines the entire experience and is one of the game’s greatest strengths, allowing players to slip comfortably into their own rhythm.\n\nMuch of the game revolves around carving out a personal life on the island. You begin with little more than a dilapidated plot and a makeshift caravan, but as you collect materials and craft new tools, you slowly transform your small corner of the world into a vibrant homestead. Farming is simple and satisfying: till soil, plant seeds, water crops, and harvest at your leisure. Mining and foraging feed directly into a broad crafting system that supports multiple professions, and each profession adds its own flavor to the progression. Whether you’re forging equipment as a blacksmith, cooking elaborate meals, hunting for buried treasure, brewing potions, or even building ships as a shipwright, there’s always a new task to occupy your hands. The lack of artificial restrictions means you can dip into whichever activity interests you most, switching focus whenever your mood shifts, which supports the game’s cozy, player-driven ethos.\n\nExploration plays an equally central role. The island is not just a static backdrop but a lively sandbox filled with secrets. Caves contain rare ores and hidden chambers, jungle paths wind toward ancient temples full of puzzles, and the shores hide countless chests, collectibles, and environmental details waiting to be discovered. Magical creatures known as Lumas add another layer of charm; these colorful, spirited companions can be raised, trained, and used to assist with tasks or accompany you on expeditions. The world feels handcrafted to reward curiosity, and the addition of drop-in, drop-out multiplayer transforms the island experience further—exploring new areas or completing professions with friends lends the game a communal joy that matches its warm tone.\n\nThe Pirates update, released after launch, expands the experience meaningfully. It introduces a new region—Pirate Cove—along with fresh Lumas, pirate-themed decor, new mini-games, and the shipwright profession that allows players to build and customize their own vessels. This update not only adds variety but also demonstrates a clear commitment from the developers to expand the game’s horizons. Sailing across the water in your own ship, delving into pirate ruins, and uncovering nautical treasures add a gentle sense of adventure that complements the relaxed pacing beautifully.\n\nHowever, Luma Island’s open-ended structure also highlights its limitations. With so few restrictions and such a light narrative framework, the progression can feel repetitive for some players. The basic loop of mining, crafting, selling, and upgrading eventually settles into familiarity, and without a central plot or escalating conflict to drive momentum, some players may find themselves drifting without a long-term goal. While the professions offer variety, they tend to rely on similar resource-gathering cycles, which can lead to grind-heavy intervals later in the game. The charm of the world remains strong, but those seeking a deeply structured campaign, branching story arcs, or high-stakes challenges will find Luma Island more relaxed than robust.\n\nThe game’s presentation—bright, colorful, and inviting—matching its tone, though it does not always reach the polish of the most visually intricate life-sims. Character animations can feel stiff, and occasional performance hiccups crop up depending on hardware. These are relatively minor issues, but they stand out more in an otherwise calm, low-pressure environment where immersion is essential. Still, the overall atmosphere, with its lively colors, gentle music, and charming Lumas, keeps the experience warm and welcoming.\n\nIn the end, Luma Island is a cozy, heartfelt sandbox that thrives on freedom and creativity. It offers an inviting world where you can settle into daily routines, embark on gentle adventures, or simply wander with no particular destination in mind. Its friendly tone, accessible mechanics, and generous quality-of-life features make it especially appealing for players who prefer games that focus on relaxation rather than intensity. While the lack of structure and occasional repetition may limit its appeal for those craving deep mechanical layers or narrative drive, it excels as a peaceful retreat—an island you can return to whenever you need a break from more demanding games. For fans of calming life-sims, shared multiplayer adventures, or creature-raising experiences, Luma Island shines as a pleasant and charming escape.\n\nRating: 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good gameplay loop, fun puzzles, decent to really good multiplayer depending on what you're doing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At first, I kind of stayed away from farming games because people kept saying they have cozy gameplay, but they actually end up being stressful (you know what game I'm talking about lol). But Luma Island proved me wrong. They removed the “needs” system, so I can peacefully craft and build my farm and home. I hope they keep adding updates to this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Buy it.\n\nThis game is amazing. I enjoyed this game a lot with my friend.\nStoryline : 8/10\nGameplay : 10/10\nGraphic : 8/10 (more to the cute side)\n\nDungeons are fun to conquer and solve and farming is pretty simple as well ! Love it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm finding the whole thing very satisfying and absorbing in various ways. Want to concentrate on the task list? You can do that. Want to spend several days clearing a mine? Go for it. Want to explore? Lots to find every day, since treasure piles and dig sites reset, and treasure chests are in so many nooks an crannies. The puzzles aren't so frustrating (for me) that they start to make the game less fun, and the rewards are also satisfying. I've had to look up a few things, mainly around fishing, but overall, I'm really enjoying this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "RECOMMENDED ONLY IF ON SALE\n\nI have 34 hours as of this writing and I kind of breezed through the game. That's a me problem, I guess. The game's actual problem is the lack of longevity and replay value. It's really fun at first. There's a bunch of enjoyable puzzles scattered throughout the maps that would distract you from your quest. The fishing isn't as annoying as other games (doesn't have the infuriating tension mechanic people love so much). But after playing for just 30+ hours, I realized you just go through the exact same thing in every map and they just make it more tedious as you progress. By the time you reach the Jungle, they just jack up the price of things to try to extend the game a little bit longer. Once you finish your run, you could spend some time gathering resources to prettify your farm if you want to. But there really isn't anything else to look forward to. The different classes are mostly pointless. I would probably play the game another 30 hours at most then forget about it. So buy it only if it's on sale and you want something to do mindlessly for a couple of days.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the best FarmSim games on top with StardewValley! I like unlimited inventory system and no stamina bar and lots of other QOLs; i strongly recommend it to people who like FarmSim games like StardewValley or CoreKeeper or others in genre! Give it a try. GG and can not wait to see more contents in future!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game. Get it if you want to. Its your life and money. Ball out",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun, easy, pretty, and smooth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the graphics and it is a very chill game but also keeps your attention",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of things to do, if you want a game that's full of quest and achievements and storyline and getting to know the characters then this game is for you.....Love it!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's addicting specially if you have a partner or friends. Not stressful, good mechanics, and a enough maps to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s a beautiful game, and I recommend playing it with friends for a longer and more enjoyable experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute Game!!! Fun to play alone or with friends. over all a great game. Enhoy the last update. A must play!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Almost at 6 hours in now and it's AWESOME. One of the few games that managed to really grab my attention in the last year. So much things to do, quests and side quests, there's always something to do, some way to progress in one area or another, so many characters to meet and help and areas to explore.\n\nAnd the game is ridiculously beautiful. I'm constantly in awe at the visuals. It's the first game I find that give me the same feelings old RPG games on the Sega Dreamcast used to give me in terms of visuals (but in a much more beautiful way using modern technology).\n\nOver, just freakin' AMAZING so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loving this cute, cozy, relaxing game reminds me abit of Stardew Valley with all the farming and mining but this game has alot more to offer plus great graphics. I get lost in time when running around exploring, dungeons, solving puzzles, farming and mining plus the fighting of pirates, ghosts, spiders and many other creatures you come across which are trying to attack you! A fun cute game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Currently playing my Second playthrough of this game. It's the most relaxing game ever, regarding this type of gameplay Luma island is on par with Stardew valley imo. Relaxing exploration, cute and useful companions, interesting quests and jobs and very pretty environments to boot. Not to mention very calming music. Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "„Luma Island“ ist ein charmantes Puzzle-Adventure-Spiel, das mit seinem minimalistischen Design und seiner beruhigenden Atmosphäre sofort ins Auge fällt. Entwickelt von einem kleinen Indie-Team, bietet das Spiel eine Mischung aus cleveren Rätseln, wunderschönen Landschaften und einer einnehmenden Geschichte, die den Spieler von Anfang bis Ende fesselt.\n\n[b]Gameplay:[/b]\n\nDas Gameplay von Luma Island ist simpel, aber dennoch äußerst fesselnd. Du schlüpfst in die Rolle eines jungen Abenteurers, der auf einer mystischen Insel landet, um das Geheimnis hinter den verlorenen Lichtern zu lüften. Diese Lichter sind das Zentrum der Insel, und deine Aufgabe ist es, sie zu aktivieren, indem du Rätsel löst, die auf Licht, Farben und Geometrie basieren.\n\nDie Rätsel sind gut durchdacht und steigern sich langsam in ihrer Komplexität. Sie sind nie frustrierend, sondern fordern den Spieler auf eine angenehme Weise heraus, was das Spiel zugänglicher für alle Altersgruppen macht. Besonders positiv fällt die Balance zwischen den Puzzle-Elementen und der Erkundung auf. Der Wechsel zwischen Denksportaufgaben und der Entdeckung neuer Inselteile sorgt dafür, dass das Spiel nie eintönig wird.\n\n[b]Grafik und Sound:[/b]\n\n„Luma Island“ besticht durch seine handgezeichnete, minimalistische Grafik, die dem Spiel eine ruhige, fast meditative Atmosphäre verleiht. Die Insel ist farbenfroh und einladend, und jedes neue Gebiet hat seine eigene, einzigartige Stimmung. Die Lichteffekte, die in den Rätseln eine zentrale Rolle spielen, sind nicht nur funktional, sondern tragen auch zur ästhetischen Schönheit des Spiels bei.\n\nDer Soundtrack ist ein weiterer Höhepunkt. Sanfte, entspannende Melodien begleiten den Spieler auf seiner Reise und verstärken das Gefühl der Entschleunigung und des Staunens. Es gibt auch ein subtile Sounddesign, das die Interaktionen mit der Umgebung unterstreicht und das immersive Erlebnis abrundet.\n\n[b]Story und Atmosphäre:[/b]\n\nDie Geschichte von „Luma Island“ ist zurückhaltend und wird vor allem durch Umwelterzählung vermittelt. Es gibt keine langen Dialoge oder komplexen Handlungsstränge. Stattdessen entdeckt der Spieler Stück für Stück die Geheimnisse der Insel, was den Entdeckungsdrang fördert. Die ruhige Erzählweise ist erfrischend und bietet Raum für Interpretation. Das Spiel schafft es, durch seine Atmosphäre eine tiefe emotionale Verbindung zu den Spielern herzustellen, ohne auf Worte angewiesen zu sein.\n\n[b]Fazit:[/b]\n\n„Luma Island“ ist ein wunderschönes und entspannendes Spiel, das sowohl durch seine Rätsel als auch durch seine Stimmung besticht. Es bietet eine willkommene Auszeit von hektischeren und komplexeren Spielen und entführt die Spieler auf eine friedliche Insel voller Geheimnisse. Wer auf der Suche nach einem ruhigen, nachdenklichen Abenteuer ist, wird mit „Luma Island“ definitiv seine Freude haben.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game! So great to have an option to make it easier or harder based on my mood/focus at the time. Love the pirates addition as well. Just great to go explore and solve puzzles and craft to my hearts content. No stamina bar to worry about or sleep times to worry about which is a great shift from other \"cozy\" games I have played. Hope they continue to add new content =)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addicting, but remains fun to play. I recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really cute & cozy little game. Its definitely in the vein of Stardew/Animal crossing. I don't normally play these types of games but this one managed to grab my attention. The entire game is very charming. The gamecube-esque art style is beautiful & timeless. The environment design is magical. The gameplay itself is deep while not being entirely overwhelming- although the sheer amount of items you pick up + the unlimited inventory can make the first hour of the game feel a little overwhelming, to be fair. But I suppose that depends on your personal tolerance for that sort of thing.\n Its got a nice sandbox approach which I appreciate. Lots of 'jobs' to satisfy the gathering/crafting itch, the world is fun to explore, there are little social elements that spice things up, the combat is *very* simplistic but satisfying nonetheless. The decoration/building is cute and fun if youre into that, although I wish it was just a little more robust.\nMy biggest problem with the game is the cursor/selection clunkiness and general control weirdness. But I'm playing on KBM, maybe its better on controller.\nPrice is very fair for what you're getting. 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is really a very lovely game. Its low-stress features are done right, because the game was clearly designed from the ground up with them in mind. The gameplay is addicting, the artstyle is charming, and the music is soothing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AMAZING storyline, amazing gameplay, amazing farming, amazing professions experience, amazing graphics(as in style) 10/10 would recommend <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "enjoyable! plays decently with controller; definitely could use some QoL to make it comparable compared to PC (like not having a quick inventory button for controller, meaning you have to pick up an item and manually scroll all the way down your infinite inventory to deposit it from the hotbar), but is otherwise a normal controller experience. the graphics are cute, i'm a fan of low poly and pixel art, and these combine into some very nice visuals. it has different gameplay modes for people looking for difference experiences, and the coop is enjoyable. the game is still doable as a solo experience for players looking to solo, and i've personally been enjoying both solo and multiplayer!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun RPG style game with crafting, resource gathering and treasure hunting. The colorful palette makes it ideal for younger players while still being challenging for older folks. The music is snappy without being annoying, and the NPC dialogue is hilarious.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't believe how good this game is. It's super cute, has lots of exploration and secrets to discover, and is entirely expansive. The free pirate expansion adds an amazingly dense underground network that connects all the parts of the world together.\r\nCan't recommend Luma Island enough honestly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game so far. It hasn't felt too grindy yet and I've just reached the third biome. It's very nice and cozy. The graphics are super cute. The music is alright but no song has stuck out to me as amazing.\r\n\r\nI'm afraid it might get too grindy though after I get more professions. Currently I have 4 and I've had to do plenty of backtracking through previous caves and fishing spots for them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i came a year late to the party on this game, but wow to this game being my ultimate cosy game what you can do on this game and the level of detail in it like bugs infesting the trees and sunflowers to the massive and i mean massive cave system for collecting metals very impressive game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cute and cozy game. I've played it before 2 major updates, so my review is not necessarily up to date.\nIt's really fun, the dungeons pose some challenges, so you have that, on the other hand you have the farming and building part and both are fun and enjoyable. The only negative side is the fact that it gets extremely grindy in the end game and you waste a lot of time hoarding all the resources.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Completely obsessed with this game right now, bought it on a whim as my husband and I were looking to play something together. We immediately got sucked into the game play, doing puzzles, exploring ancient temples, collecting loot, progressing in professions, and collecting cute Lumas to bring on our adventures. I recommend this game especially if you enjoyed games like Stardew Valley or My time at Portia. 10/10 will play lots more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Luma Island completely surprised me. I absolutely love this game. It’s cozy, adventurous, and everything feels so interconnected in a really satisfying way. Exploring, crafting, progressing… it all just clicks, and I had a blast the whole time.\n\nFor this price point, there are very few games that can compete. It’s fun, chill, and way more polished than I expected. Seriously, I love this game. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Fun,. Just only had this game for a couple of weeks. SO far so good. Its different but fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really like this game, Its got some bugs but not real bad ones, like my chickens and rabbits were stuck in there houses but that is about it so far, The way I fixed it was destroying there houses and rebuilding them, but it is not all that bad easy fix, Really like the building mechanic in the game such a really great experience, I give it a 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a chill and nice game :) you are discovering a nice island full of secrets and little creatures that will help you grow your farm :) a nice farmsim experience :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the different jobs you can do in this game. VERY thankful for the no bug option when Im in the mood to just chill and vibe in the caves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a small detail but one of my favorite things is the foraging aspect of the game, a lot of the base forest foraging materials are in the environment rather than needing to farm them and i think its very balanced, calm play style. I also like the luma egg concept, my first luma was a fish with shoes which is super cute!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very chill game, that draws you in with the different little pet called lumas which are very cute companions. Also the different levels of maze runs to collect them keep it interesting and exciting while arranging your farm.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cozy and the art style is aesthetically pleasing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun, feels a bit like Animal Crossing and Stardew\n\nWell worth the $$$ and a good wind down / relax game\n\nRuns decently good on deck out of box as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and worth the money. co-op works well and its never a dull day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down the best cozy/chill game i have ever played.\r\nthe graphics are so nice and everything looks so pretty.\r\nthe farming is fun, i love the way im able to decorate everything \r\nit is so damn addicting.\r\ni was looking for a game like this for so long and im so grateful a friend reccommended it to me cuz i bought it 2 days ago and already have 17 hours.\r\nReally looking forward to seeing more stuff since im pretty much still at the beginning but im having such a damn good time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "جميله وممتعه لعبة مغامرات وفيها جانب زراعه رتم التقدم سريع وكبيره 5نجوم",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I blame HenTy For my New Addiction!!! I'm in love with this game!! Its not only soo cute but the game Play is sooo ez to get used to! Perfect for a nice Cozy Stream!!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "devs need to adjust walking speed, mass destruction of built thing( removing one tree at a time when i have 100 of each sort is dumb)\r\nFIX  TERRAINNNN!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy Stardew Valley, you’ll definitely love Luma Island! It’s cozy, relaxing, and super addicting!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Needs more story, marriage and more social interactions with the NPCs but is cute.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you love stardew valley, but you're looking for more adventure, this is for you. Please help me I cant stop playing D:",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is good, very chill, an excellent way to relax.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun and very chill game, definitely gonna 100% it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my first 100% achievement game ever. I hope that says it all.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I adore this game for the cozy graphics and sound, but performance could be better for linux\nPlaying on my steam deck needs me to cap my FPS to 30 for a stable and to save battery, on my PC (cachy OS) the frame rate fluctuates between 40 to 90 whilst not having a demanding visuals. Entering the town hall really drops it to 30, and it seems the GPU utils is not quite optimized.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I found Luma Island to be really chill compared to most of the other games in its genre. I loved that there's a very casual mode because sometimes I just want to turn off my brain and chop trees without worrying about energy levels or clocks. Good stuff. Gameplay is smooth, graphics are cute, and it's easy to understand. It also has some satisfying elements and sound effects.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good / fun game.\r\nThe grind is the big issue with this game.\r\n\r\nIt’s a Life Sim where you craft stuff to get further along in your chosen profession.\r\nBut you can get multiple professions at once and level them all up together. \r\n\t\r\nBut if your just having fun and chilling, its alot of fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’m actually enjoying Luma Island a lot so far. It’s got that easy, chilled-out vibe, but still keeps you busy with enough to explore and craft. What really stands out for me is how much fun it is to jump in with other players — the co-op side makes the whole experience feel more alive.\r\n\r\nI’m still not 100% sure what the actual difference is between the Pirate version and the Vanilla version, but either way, the gameplay itself is really smooth and surprisingly addictive. For now, I’m just having fun figuring things out as I go.\r\n\r\nOverall, really cool game. I’m keen to see how it develops as I progress.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What a fun, relaxing game....I highly recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and relaxing, with some stuff to keep you going it wont get boring",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you love crafting and exploration, this game is for you! While I have heard criticism that the jobs basically do the same things, find items and unlock new recipes, I love the grind to upgrade each skill. \n\nAnother thing I love is that the NPCs don’t really need you to interact with them unless there’s a purpose with a quest. I’m not a fan of chatting with NPCs usually so that was refreshing to just get to focus on the gameplay. \n\nAnd can we talk about the unique and fun art?! So amazing to just run around and look at the beautiful and varied landscapes. \n\nThe pirate update was an expected addition too that really added to the world of the game and also connected back to the “vanilla” game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am a cozy gamer. I like games that give decorating, lots of grinding, collecting, tasks, farming, fishing etc. This game gives it all and more!! I had no idea this game was as good as it is. Every time I go into the game I do whatever I feel like without time limits. I might go to the mines and get the ores I need. Or go to the forest or the mountains to harvest plants, trees, treasures, fish. I might go to the pirate island for more things. Or decide to craft some of the things needed in each profession. Honestly, you won't regret it. The bad guys are simple. Like a plant that spits out seeds whilst stationary. \nYou upgrade your tools for ease. Love that. \nNo need to sleep!! Love that. \nNo consequences for dying. Love that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's fun, grindy in the good way",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Here's a Totally Objective Review of the Game - https://youtu.be/89J4toe35Tk\n\nRating: 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very fun and relaxing experience! :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am addicted and it's not even funny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a cozy and relaxing vibe i love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing multi-discipline game everyone will enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game design is pretty adorable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super cozy and cute",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very enjoyable game wish we had more of it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "soo cozy and magical",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Instant Gratification.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Luma Luma Yay kinda gay but not while I play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a god damn good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple but fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game lots to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a pretty relaxing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The perfect cosy game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Addictive!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, fun times!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Charming time-waster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEst game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game to play <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "SO GOOOOODDD!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD GAME",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Feel Free Games has released a rather nice game with Luma Island, but unfortunately, it has and continues to have weaknesses.\nThe graphics and style are positive aspects; it's cutely animated, and the co-op mode is also nice, although it has its flaws. For example, my wife can join me on the farm and go on adventures with me, but achievements don't count for her.\nThere are professions, but apart from the shipbuilder, they only serve to earn money and quickly become boring.\nIn the vanilla game, there were no difficulty settings, so as a \"non-controller player,\" I had big problems with the temples and the volcano.\nMouse and keyboard are not supported.\nUnfortunately, the pirate duel is not affected by the difficulty setting. The player has to land multiple hits, while Rosita only needs a single hit with her pistol (with a nasty spread) or sword, and it's over. If playing with a controller isn't your preferred way to play, this point is quite frustrating and has nothing to do with relaxation for me.\nWith the pirate update, the need to explore the forest all the way to the beach and the mountain to the summit has been eliminated. Now you simply go to the pirate bay and can quickly reach the aforementioned locations and also the jungle. You don't have to finish building the bridge or repair the cable car and the boat if you already have the achievement.\nIn its current state, I would only recommend the game with reservations.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Motion sickness alert.  Had to refund because of the motion issue; otherwise offered cute and a pleasant enough casual gameplay; not as charming as, say,  Stardew, which is the gold standard of this type of game but I couldn't stay with it very long due to the dizzy-making graphic movement.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's a pretty game, but immediately I found the game to be clunky. The camera movement dragging feels sluggish (and the mouse cursor not disappearing bugs me). Hitting things accurately can be troublesome. I want to hit the fern for resin but I hit the grass or objects around it, or chop at grass trying to pick up mushrooms.\n\nThe straw was the \"combat\". A one second stun whip is not combat. It's also difficult to attack forward without running into the enemy. One hit and I went down, losing all my gathered materials.\n\nI'm sure the game is good in other aspects, but camera and movement controls being clunky affects the entire game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a 3d stardew valley but there is no jumping mechanic. Because the landscape seems so detailed, it is REALLY disappointing you can't jump and climb onto ledges and objects. Quests are very linear and painstakingly boring with no direction and the world seems lifeless with no real \"story\". Crafting toolbenches can be confusing because you can't hover over the items you need and determine what they are. You just have to look at them and guess. You can't dissassemble crafting benches you make either, you have to destroy them and remake them which is really unintuitive. When you til soil, you can't until it, and have to have sand or hay in hand to cover the hole. This is especially frustrating because you can't exactly aim where you're tilling and sometimes the movement is so slippery your cursor moves onto a tile you didn't intend to til. Each time you want to upgrade your tools, you need to run to the store in town with a bunch of random, poorly explained items with no explanation, leaving one wondering what the purpose of it all is. There is also absolutely no way to store or organize items either from what I've gathered, so you'll need to sift through dozens of random materials you pick up in order to figure out what you have and don't have.\n\n For a game of this scope which people say is a good comparison to stardew, I would say this doesn't live up to the hype at all and it's lacking fully fleshed out game mechanics. It is just not smooth and there's no incentive to play. After experiencing whatever luma island is, I am left with the feeling that I would rather just replay stardew valley.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played for less than 30 minutes. My sim kept getting stuck and the game was very glitchy. Problems I don't have with other Steam games. I had to ask for a refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Such a beautiful game but I sorta felt lost after 3 hours. I wanted to love it but for some reason it wasn’t for me. I will give it a bad review but I think it’s just more based on my personal interest.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not recommended for new comer. no mark for every quest, i spend 30minutes just for searching the whole city for just a bench to repair",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]Luma Island[/b] is a charming and polished experience, but there's simply a few too many aspects that bring down an otherwise thoughtfully designed and fun journey. I wish I could instead mark this as neutral, but with a forced hand I reluctantly concede a negative (albeit marginally).\n\nThe distinct areas are interesting and diverse enough in visual style, but frustrating to navigate at times with how stringent the pathing is combined with the frequent changes in elevation. There are some sections that just make no sense to block navigation, given how deceptively flush the texturing can be at times, but because of how this system is designed the intention is clearly for you to adhere to a strict path with zero margin. It is just a little too restrictive, as you will find yourself tripping up constantly on the smallest of inclines.\n\nThe crafting interface (if it can be called that), particularly with how you queue multiples, could really do with an overhaul as opposed to simply holding down a button to increment the stack. While obviously intuitive, this system does not scale at all when you want to queue e.g. 100 or more at once, and by late/post game with some of the amounts required to build mega structures it is absolutely insufficient of an interface to fulfil this purpose while retaining sanity. It warrants a proper drag and drop interface alongside an ability to split stacks.\n\nMost professions follow the same formula in which you interact with an NPC and after crafting 5 relevant items essentially move into a next tier and repeat. These items can be sold, some used as ingredients to build structures, or in the case of shipwright to fulfil quest requirements. I wouldn't have much of an issue with how repetitive professions are if the prerequisite fee to acquire them didn't scale so significantly, and additionally Luma Energy as a key ingredient for every maiden craft across professions is a bit demanding given how mostly time limiting this resource is.\n\nAt times I found the dungeon crawling to just be a little too tedious between the environmental hazards and pixel perfect pathing. While the challenge adds something compelling and keeps the experience interesting, for a game in this genre I just didn't see it being necessary by the late game to have to spend ~20 minutes in one with no way to know how close you are to the end. I would have preferred these to be less rooms but with more unique puzzles as opposed to longer, rearranged ones you've solved before. Keep the harder, protracted variants as optional content.\n\nThe Luma companion system is interesting in theory but severely underdeveloped and as such kind of feels like an afterthought, particularly as many of them share the same trait (e.g. reigniting torches). I think it would have made more sense, given the small scope, to have a separate training system for the player to be able to select which trait is active, rendering the companion Luma itself purely cosmetic. This would fit the cozy vibe a bit better as you might like the design of a specific Luma but prefer a different trait to compliment your gameplay preference.\n\nDespite generally being satisfied with the gameplay systems, environmental puzzles, and overall pacing I was really let down by the completion rewards (or lack thereof) particularly for the main quest and pirates quest. Clearly so much thought and care were put into these quests, but the rewards are in no way commensurate for the time invested to complete them. Truthfully I was kind of insulted by the minable piles as despite visual differences they only allow you to mine a single coin at a time and also inhibit the natural behaviour of the pickaxe in regards to its held action.\n\nWhile I hope there is more in the pipeline, as pirates added interesting content, I hope to see a new entry eventually as I feel the high quality of this foundation coupled with some fundamental refinements could result in a greatly improved experience despite the inherent formulaic nature of its design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really regret buying the game. I was looking for an alternative to titles like Stardew Valley or Sun Haven and the further I got into the game, the more disappointed I got. Still, let me list the things that frustrated me, 'cause they might not be a big deal for you.\r\n\r\n- Lumas (the little pets you collect) are only useful when selected in your inventory. While housed inside your farm, they don't do anything but run around. (Even though they have cool abilities that have already been programmed and would be amazing for some farm automation :/ )\r\n- Following with Lumas. You can't choose the ones you get. Some people will have the amazing experience of getting the one they want and others (like myself here) will get everything BUT the one they want. I got my first combat luma when I was already at the jungle. To make it even more frustrating, I got the snail, which I don't like.\r\n- Resource grind. When people said this game was a grind, I thought it wouldn't be so bad. I mean, how grindy can a cozy game be? Well, try to upgrade your tools to volcanic and you'll soon find out. When I saw the numbers, my reaction was literally \"Nope, ty. Close the game and post this review\". You can't upgrade your workshops to produce stuff faster and shops will always sell the same amount of ingredients, be it the start of the game or late-game.\r\n- Once you're done with the Forest, other areas really feel like a brutal reskin of it. Credit to the devs where it's due, I really had fun with the Forest part. Then, I got to the Mountain and it was basically the same thing: reskinned enemies with similar mechanics, same sort of puzzles and so on. Nothing really surprises you. To make it worse, the materials are literally: rock, forest rock, mountain rock, jungle rock and it applies to all of the materials.\r\n- You get new seeds only by advancing your profession (cook/brewer). \r\n- Worst offender: no road tiles or grass tiles. You're forced into using gravel if you don't want weeds and trees to grow on your farm, so no matter where you are in the game, you're limited to one type of path (even though we see different tiles in the city).\r\n\r\nBasically, the game is very far away from similar titles in terms of polishing.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "Game components are good but may cause badly dizziness from narrow space and adjust perspective angle",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's a 3d stardew valley but there is no jumping mechanic. Because the landscape seems so detailed, it is REALLY disappointing you can't jump and climb onto ledges and objects. Quests are very linear and painstakingly boring with no direction and the world, although beautiful in design, seems lifeless with no real \"story\". Crafting toolbenches can be confusing because you can't hover over the items you need and determine what they are. You just have to look at them and guess. You can't dissassemble crafting benches you make either, you have to destroy them and remake them which is really unintuitive. When you til soil, you can't until it, and have to have sand or hay in hand to cover the hole. This is especially frustrating because you can't exactly aim where you're tilling and sometimes the movement is so slippery your cursor moves onto a tile you didn't intend to til. Each time you want to upgrade your tools, you need to run to the store in town with a bunch of random, poorly explained items with no explanation, leaving one wondering what the purpose of it all is. There is also absolutely no way to store or organize items either from what I've gathered, so you'll need to sift through dozens of random materials you pick up in order to figure out what you have and don't have.\n\nFor a game of this scope which people say is a good comparison to stardew, I would say this doesn't live up to the hype at all and it's lacking fully fleshed out game mechanics. It is just not smooth and there's no incentive to play. I do see it as part of a recurring trend in game development where basic game components and quality are reduced year after year because the devs are only after a quick buck. \n\nAfter experiencing whatever luma island is, I am left with the feeling that I would rather just replay stardew valley, because at least I'd be playing something that was made with passion, love, and painstaking attention to detail like the games we used to have.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself is fun and cozy to play with friends. but the grind is real.\r\n\r\nthe fishing game in particular is a FU to the player! having to run around for 15-30 seconds to catch 1 fish when you need 30 for a recipe is so fun /sarcasm",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Feel Free Games has released a rather nice game with Luma Island, but unfortunately, it has and continues to have weaknesses.\nThe graphics and style are positive aspects; it's cutely animated, and the co-op mode is also nice, although it has its flaws. For example, my wife can join me on the farm and go on adventures with me, but achievements don't count for her.\nThere are professions, but apart from the shipbuilder, they only serve to earn money and quickly become boring.\nIn the vanilla game, there were no difficulty settings, so as a \"non-controller player,\" I had big problems with the temples and the volcano.\nMouse and keyboard are not supported.\nUnfortunately, the pirate duel is not affected by the difficulty setting. The player has to land multiple hits, while Rosita only needs a single hit with her pistol (with a nasty spread) or sword, and it's over. If playing with a controller isn't your preferred way to play, this point is quite frustrating and has nothing to do with relaxation for me.\nWith the pirate update, the need to explore the forest all the way to the beach and the mountain to the summit has been eliminated. Now you simply go to the pirate bay and can quickly reach the aforementioned locations and also the jungle. You don't have to finish building the bridge or repair the cable car and the boat if you already have the achievement.\nIn its current state, I would only recommend the game with reservations.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "After 60 Hours in the orignal game before the pirates update i had tons progress on my solo playthrough i had all professions completed and the farm built the way i wanted it and all lumas and houses organized and built,i had a massive farm with all the fruits and crops layed out i had stopped playing for a while as i was playing other games and was excited to play again when the pirates update came out, only to find out if you transfer your og save to the pirate one they delete what was built on the farm and just throw the mateials into your inventory, so all that time building and organizing was wasted? now i have to rebuild and start again just cause? or keep your old save and what? not be able to play the new stuff  also dont have any of the lumas anymore dont know where they went, they were not in my inventory, plus all profesions are not completed anymore either, will maybe start again if any of my friends play but i wont be coming back to do that again and for what? another large update to delete everything again, shame as i had really enjoyed this game\n\nif you are new to this game it is very fun and would recommend,",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I wish I enjoyed this game, but besides it being cute, there is not much to it. I love cozy farming/mining sims and I immediately fell in love with the concept, as well as the art style, but this game leaves a lot to desire. I don't mind grinding (which the game requires from you to do a LOT), but it seemed pointless and dull to farm resources endlessly, craft 5 of the item, then craft a new thing from that item, etc. just to sell it for profit. I wish there were some more interesting mechanics in the game, but for me it quickly became repeptitive and boring. Maybe with updates to come, gameplay will enhance, but unfortunately I'm not keen on replaying games :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Motion sickness alert.  Had to refund because of the motion issue; otherwise offered cute and a pleasant enough casual gameplay; not as charming as, say,  Stardew, which is the gold standard of this type of game but I couldn't stay with it very long due to the dizzy-making graphic movement.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's a pretty game, but immediately I found the game to be clunky. The camera movement dragging feels sluggish (and the mouse cursor not disappearing bugs me). Hitting things accurately can be troublesome. I want to hit the fern for resin but I hit the grass or objects around it, or chop at grass trying to pick up mushrooms.\n\nThe straw was the \"combat\". A one second stun whip is not combat. It's also difficult to attack forward without running into the enemy. One hit and I went down, losing all my gathered materials.\n\nI'm sure the game is good in other aspects, but camera and movement controls being clunky affects the entire game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played for less than 30 minutes. My sim kept getting stuck and the game was very glitchy. Problems I don't have with other Steam games. I had to ask for a refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Such a beautiful game but I sorta felt lost after 3 hours. I wanted to love it but for some reason it wasn’t for me. I will give it a bad review but I think it’s just more based on my personal interest.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not recommended for new comer. no mark for every quest, i spend 30minutes just for searching the whole city for just a bench to repair",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]Luma Island[/b] is a charming and polished experience, but there's simply a few too many aspects that bring down an otherwise thoughtfully designed and fun journey. I wish I could instead mark this as neutral, but with a forced hand I reluctantly concede a negative (albeit marginally).\n\nThe distinct areas are interesting and diverse enough in visual style, but frustrating to navigate at times with how stringent the pathing is combined with the frequent changes in elevation. There are some sections that just make no sense to block navigation, given how deceptively flush the texturing can be at times, but because of how this system is designed the intention is clearly for you to adhere to a strict path with zero margin. It is just a little too restrictive, as you will find yourself tripping up constantly on the smallest of inclines.\n\nThe crafting interface (if it can be called that), particularly with how you queue multiples, could really do with an overhaul as opposed to simply holding down a button to increment the stack. While obviously intuitive, this system does not scale at all when you want to queue e.g. 100 or more at once, and by late/post game with some of the amounts required to build mega structures it is absolutely insufficient of an interface to fulfil this purpose while retaining sanity. It warrants a proper drag and drop interface alongside an ability to split stacks.\n\nMost professions follow the same formula in which you interact with an NPC and after crafting 5 relevant items essentially move into a next tier and repeat. These items can be sold, some used as ingredients to build structures, or in the case of shipwright to fulfil quest requirements. I wouldn't have much of an issue with how repetitive professions are if the prerequisite fee to acquire them didn't scale so significantly, and additionally Luma Energy as a key ingredient for every maiden craft across professions is a bit demanding given how mostly time limiting this resource is.\n\nAt times I found the dungeon crawling to just be a little too tedious between the environmental hazards and pixel perfect pathing. While the challenge adds something compelling and keeps the experience interesting, for a game in this genre I just didn't see it being necessary by the late game to have to spend ~20 minutes in one with no way to know how close you are to the end. I would have preferred these to be less rooms but with more unique puzzles as opposed to longer, rearranged ones you've solved before. Keep the harder, protracted variants as optional content.\n\nThe Luma companion system is interesting in theory but severely underdeveloped and as such kind of feels like an afterthought, particularly as many of them share the same trait (e.g. reigniting torches). I think it would have made more sense, given the small scope, to have a separate training system for the player to be able to select which trait is active, rendering the companion Luma itself purely cosmetic. This would fit the cozy vibe a bit better as you might like the design of a specific Luma but prefer a different trait to compliment your gameplay preference.\n\nDespite generally being satisfied with the gameplay systems, environmental puzzles, and overall pacing I was really let down by the completion rewards (or lack thereof) particularly for the main quest and pirates quest. Clearly so much thought and care were put into these quests, but the rewards are in no way commensurate for the time invested to complete them. Truthfully I was kind of insulted by the minable piles as despite visual differences they only allow you to mine a single coin at a time and also inhibit the natural behaviour of the pickaxe in regards to its held action.\n\nWhile I hope there is more in the pipeline, as pirates added interesting content, I hope to see a new entry eventually as I feel the high quality of this foundation coupled with some fundamental refinements could result in a greatly improved experience despite the inherent formulaic nature of its design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really regret buying the game. I was looking for an alternative to titles like Stardew Valley or Sun Haven and the further I got into the game, the more disappointed I got. Still, let me list the things that frustrated me, 'cause they might not be a big deal for you.\r\n\r\n- Lumas (the little pets you collect) are only useful when selected in your inventory. While housed inside your farm, they don't do anything but run around. (Even though they have cool abilities that have already been programmed and would be amazing for some farm automation :/ )\r\n- Following with Lumas. You can't choose the ones you get. Some people will have the amazing experience of getting the one they want and others (like myself here) will get everything BUT the one they want. I got my first combat luma when I was already at the jungle. To make it even more frustrating, I got the snail, which I don't like.\r\n- Resource grind. When people said this game was a grind, I thought it wouldn't be so bad. I mean, how grindy can a cozy game be? Well, try to upgrade your tools to volcanic and you'll soon find out. When I saw the numbers, my reaction was literally \"Nope, ty. Close the game and post this review\". You can't upgrade your workshops to produce stuff faster and shops will always sell the same amount of ingredients, be it the start of the game or late-game.\r\n- Once you're done with the Forest, other areas really feel like a brutal reskin of it. Credit to the devs where it's due, I really had fun with the Forest part. Then, I got to the Mountain and it was basically the same thing: reskinned enemies with similar mechanics, same sort of puzzles and so on. Nothing really surprises you. To make it worse, the materials are literally: rock, forest rock, mountain rock, jungle rock and it applies to all of the materials.\r\n- You get new seeds only by advancing your profession (cook/brewer). \r\n- Worst offender: no road tiles or grass tiles. You're forced into using gravel if you don't want weeds and trees to grow on your farm, so no matter where you are in the game, you're limited to one type of path (even though we see different tiles in the city).\r\n\r\nBasically, the game is very far away from similar titles in terms of polishing.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "Game components are good but may cause badly dizziness from narrow space and adjust perspective angle",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's a 3d stardew valley but there is no jumping mechanic. Because the landscape seems so detailed, it is REALLY disappointing you can't jump and climb onto ledges and objects. Quests are very linear and painstakingly boring with no direction and the world, although beautiful in design, seems lifeless with no real \"story\". Crafting toolbenches can be confusing because you can't hover over the items you need and determine what they are. You just have to look at them and guess. You can't dissassemble crafting benches you make either, you have to destroy them and remake them which is really unintuitive. When you til soil, you can't until it, and have to have sand or hay in hand to cover the hole. This is especially frustrating because you can't exactly aim where you're tilling and sometimes the movement is so slippery your cursor moves onto a tile you didn't intend to til. Each time you want to upgrade your tools, you need to run to the store in town with a bunch of random, poorly explained items with no explanation, leaving one wondering what the purpose of it all is. There is also absolutely no way to store or organize items either from what I've gathered, so you'll need to sift through dozens of random materials you pick up in order to figure out what you have and don't have.\n\nFor a game of this scope which people say is a good comparison to stardew, I would say this doesn't live up to the hype at all and it's lacking fully fleshed out game mechanics. It is just not smooth and there's no incentive to play. I do see it as part of a recurring trend in game development where basic game components and quality are reduced year after year because the devs are only after a quick buck. \n\nAfter experiencing whatever luma island is, I am left with the feeling that I would rather just replay stardew valley, because at least I'd be playing something that was made with passion, love, and painstaking attention to detail like the games we used to have.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself is fun and cozy to play with friends. but the grind is real.\r\n\r\nthe fishing game in particular is a FU to the player! having to run around for 15-30 seconds to catch 1 fish when you need 30 for a recipe is so fun /sarcasm",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Feel Free Games has released a rather nice game with Luma Island, but unfortunately, it has and continues to have weaknesses.\nThe graphics and style are positive aspects; it's cutely animated, and the co-op mode is also nice, although it has its flaws. For example, my wife can join me on the farm and go on adventures with me, but achievements don't count for her.\nThere are professions, but apart from the shipbuilder, they only serve to earn money and quickly become boring.\nIn the vanilla game, there were no difficulty settings, so as a \"non-controller player,\" I had big problems with the temples and the volcano.\nMouse and keyboard are not supported.\nUnfortunately, the pirate duel is not affected by the difficulty setting. The player has to land multiple hits, while Rosita only needs a single hit with her pistol (with a nasty spread) or sword, and it's over. If playing with a controller isn't your preferred way to play, this point is quite frustrating and has nothing to do with relaxation for me.\nWith the pirate update, the need to explore the forest all the way to the beach and the mountain to the summit has been eliminated. Now you simply go to the pirate bay and can quickly reach the aforementioned locations and also the jungle. You don't have to finish building the bridge or repair the cable car and the boat if you already have the achievement.\nIn its current state, I would only recommend the game with reservations.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "After 60 Hours in the orignal game before the pirates update i had tons progress on my solo playthrough i had all professions completed and the farm built the way i wanted it and all lumas and houses organized and built,i had a massive farm with all the fruits and crops layed out i had stopped playing for a while as i was playing other games and was excited to play again when the pirates update came out, only to find out if you transfer your og save to the pirate one they delete what was built on the farm and just throw the mateials into your inventory, so all that time building and organizing was wasted? now i have to rebuild and start again just cause? or keep your old save and what? not be able to play the new stuff  also dont have any of the lumas anymore dont know where they went, they were not in my inventory, plus all profesions are not completed anymore either, will maybe start again if any of my friends play but i wont be coming back to do that again and for what? another large update to delete everything again, shame as i had really enjoyed this game\n\nif you are new to this game it is very fun and would recommend,",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I wish I enjoyed this game, but besides it being cute, there is not much to it. I love cozy farming/mining sims and I immediately fell in love with the concept, as well as the art style, but this game leaves a lot to desire. I don't mind grinding (which the game requires from you to do a LOT), but it seemed pointless and dull to farm resources endlessly, craft 5 of the item, then craft a new thing from that item, etc. just to sell it for profit. I wish there were some more interesting mechanics in the game, but for me it quickly became repeptitive and boring. Maybe with updates to come, gameplay will enhance, but unfortunately I'm not keen on replaying games :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Motion sickness alert.  Had to refund because of the motion issue; otherwise offered cute and a pleasant enough casual gameplay; not as charming as, say,  Stardew, which is the gold standard of this type of game but I couldn't stay with it very long due to the dizzy-making graphic movement.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's a pretty game, but immediately I found the game to be clunky. The camera movement dragging feels sluggish (and the mouse cursor not disappearing bugs me). Hitting things accurately can be troublesome. I want to hit the fern for resin but I hit the grass or objects around it, or chop at grass trying to pick up mushrooms.\n\nThe straw was the \"combat\". A one second stun whip is not combat. It's also difficult to attack forward without running into the enemy. One hit and I went down, losing all my gathered materials.\n\nI'm sure the game is good in other aspects, but camera and movement controls being clunky affects the entire game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played for less than 30 minutes. My sim kept getting stuck and the game was very glitchy. Problems I don't have with other Steam games. I had to ask for a refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Such a beautiful game but I sorta felt lost after 3 hours. I wanted to love it but for some reason it wasn’t for me. I will give it a bad review but I think it’s just more based on my personal interest.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not recommended for new comer. no mark for every quest, i spend 30minutes just for searching the whole city for just a bench to repair",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]Luma Island[/b] is a charming and polished experience, but there's simply a few too many aspects that bring down an otherwise thoughtfully designed and fun journey. I wish I could instead mark this as neutral, but with a forced hand I reluctantly concede a negative (albeit marginally).\n\nThe distinct areas are interesting and diverse enough in visual style, but frustrating to navigate at times with how stringent the pathing is combined with the frequent changes in elevation. There are some sections that just make no sense to block navigation, given how deceptively flush the texturing can be at times, but because of how this system is designed the intention is clearly for you to adhere to a strict path with zero margin. It is just a little too restrictive, as you will find yourself tripping up constantly on the smallest of inclines.\n\nThe crafting interface (if it can be called that), particularly with how you queue multiples, could really do with an overhaul as opposed to simply holding down a button to increment the stack. While obviously intuitive, this system does not scale at all when you want to queue e.g. 100 or more at once, and by late/post game with some of the amounts required to build mega structures it is absolutely insufficient of an interface to fulfil this purpose while retaining sanity. It warrants a proper drag and drop interface alongside an ability to split stacks.\n\nMost professions follow the same formula in which you interact with an NPC and after crafting 5 relevant items essentially move into a next tier and repeat. These items can be sold, some used as ingredients to build structures, or in the case of shipwright to fulfil quest requirements. I wouldn't have much of an issue with how repetitive professions are if the prerequisite fee to acquire them didn't scale so significantly, and additionally Luma Energy as a key ingredient for every maiden craft across professions is a bit demanding given how mostly time limiting this resource is.\n\nAt times I found the dungeon crawling to just be a little too tedious between the environmental hazards and pixel perfect pathing. While the challenge adds something compelling and keeps the experience interesting, for a game in this genre I just didn't see it being necessary by the late game to have to spend ~20 minutes in one with no way to know how close you are to the end. I would have preferred these to be less rooms but with more unique puzzles as opposed to longer, rearranged ones you've solved before. Keep the harder, protracted variants as optional content.\n\nThe Luma companion system is interesting in theory but severely underdeveloped and as such kind of feels like an afterthought, particularly as many of them share the same trait (e.g. reigniting torches). I think it would have made more sense, given the small scope, to have a separate training system for the player to be able to select which trait is active, rendering the companion Luma itself purely cosmetic. This would fit the cozy vibe a bit better as you might like the design of a specific Luma but prefer a different trait to compliment your gameplay preference.\n\nDespite generally being satisfied with the gameplay systems, environmental puzzles, and overall pacing I was really let down by the completion rewards (or lack thereof) particularly for the main quest and pirates quest. Clearly so much thought and care were put into these quests, but the rewards are in no way commensurate for the time invested to complete them. Truthfully I was kind of insulted by the minable piles as despite visual differences they only allow you to mine a single coin at a time and also inhibit the natural behaviour of the pickaxe in regards to its held action.\n\nWhile I hope there is more in the pipeline, as pirates added interesting content, I hope to see a new entry eventually as I feel the high quality of this foundation coupled with some fundamental refinements could result in a greatly improved experience despite the inherent formulaic nature of its design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really regret buying the game. I was looking for an alternative to titles like Stardew Valley or Sun Haven and the further I got into the game, the more disappointed I got. Still, let me list the things that frustrated me, 'cause they might not be a big deal for you.\r\n\r\n- Lumas (the little pets you collect) are only useful when selected in your inventory. While housed inside your farm, they don't do anything but run around. (Even though they have cool abilities that have already been programmed and would be amazing for some farm automation :/ )\r\n- Following with Lumas. You can't choose the ones you get. Some people will have the amazing experience of getting the one they want and others (like myself here) will get everything BUT the one they want. I got my first combat luma when I was already at the jungle. To make it even more frustrating, I got the snail, which I don't like.\r\n- Resource grind. When people said this game was a grind, I thought it wouldn't be so bad. I mean, how grindy can a cozy game be? Well, try to upgrade your tools to volcanic and you'll soon find out. When I saw the numbers, my reaction was literally \"Nope, ty. Close the game and post this review\". You can't upgrade your workshops to produce stuff faster and shops will always sell the same amount of ingredients, be it the start of the game or late-game.\r\n- Once you're done with the Forest, other areas really feel like a brutal reskin of it. Credit to the devs where it's due, I really had fun with the Forest part. Then, I got to the Mountain and it was basically the same thing: reskinned enemies with similar mechanics, same sort of puzzles and so on. Nothing really surprises you. To make it worse, the materials are literally: rock, forest rock, mountain rock, jungle rock and it applies to all of the materials.\r\n- You get new seeds only by advancing your profession (cook/brewer). \r\n- Worst offender: no road tiles or grass tiles. You're forced into using gravel if you don't want weeds and trees to grow on your farm, so no matter where you are in the game, you're limited to one type of path (even though we see different tiles in the city).\r\n\r\nBasically, the game is very far away from similar titles in terms of polishing.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "Game components are good but may cause badly dizziness from narrow space and adjust perspective angle",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's a 3d stardew valley but there is no jumping mechanic. Because the landscape seems so detailed, it is REALLY disappointing you can't jump and climb onto ledges and objects. Quests are very linear and painstakingly boring with no direction and the world, although beautiful in design, seems lifeless with no real \"story\". Crafting toolbenches can be confusing because you can't hover over the items you need and determine what they are. You just have to look at them and guess. You can't dissassemble crafting benches you make either, you have to destroy them and remake them which is really unintuitive. When you til soil, you can't until it, and have to have sand or hay in hand to cover the hole. This is especially frustrating because you can't exactly aim where you're tilling and sometimes the movement is so slippery your cursor moves onto a tile you didn't intend to til. Each time you want to upgrade your tools, you need to run to the store in town with a bunch of random, poorly explained items with no explanation, leaving one wondering what the purpose of it all is. There is also absolutely no way to store or organize items either from what I've gathered, so you'll need to sift through dozens of random materials you pick up in order to figure out what you have and don't have.\n\nFor a game of this scope which people say is a good comparison to stardew, I would say this doesn't live up to the hype at all and it's lacking fully fleshed out game mechanics. It is just not smooth and there's no incentive to play. I do see it as part of a recurring trend in game development where basic game components and quality are reduced year after year because the devs are only after a quick buck. \n\nAfter experiencing whatever luma island is, I am left with the feeling that I would rather just replay stardew valley, because at least I'd be playing something that was made with passion, love, and painstaking attention to detail like the games we used to have.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself is fun and cozy to play with friends. but the grind is real.\r\n\r\nthe fishing game in particular is a FU to the player! having to run around for 15-30 seconds to catch 1 fish when you need 30 for a recipe is so fun /sarcasm",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Feel Free Games has released a rather nice game with Luma Island, but unfortunately, it has and continues to have weaknesses.\nThe graphics and style are positive aspects; it's cutely animated, and the co-op mode is also nice, although it has its flaws. For example, my wife can join me on the farm and go on adventures with me, but achievements don't count for her.\nThere are professions, but apart from the shipbuilder, they only serve to earn money and quickly become boring.\nIn the vanilla game, there were no difficulty settings, so as a \"non-controller player,\" I had big problems with the temples and the volcano.\nMouse and keyboard are not supported.\nUnfortunately, the pirate duel is not affected by the difficulty setting. The player has to land multiple hits, while Rosita only needs a single hit with her pistol (with a nasty spread) or sword, and it's over. If playing with a controller isn't your preferred way to play, this point is quite frustrating and has nothing to do with relaxation for me.\nWith the pirate update, the need to explore the forest all the way to the beach and the mountain to the summit has been eliminated. Now you simply go to the pirate bay and can quickly reach the aforementioned locations and also the jungle. You don't have to finish building the bridge or repair the cable car and the boat if you already have the achievement.\nIn its current state, I would only recommend the game with reservations.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "After 60 Hours in the orignal game before the pirates update i had tons progress on my solo playthrough i had all professions completed and the farm built the way i wanted it and all lumas and houses organized and built,i had a massive farm with all the fruits and crops layed out i had stopped playing for a while as i was playing other games and was excited to play again when the pirates update came out, only to find out if you transfer your og save to the pirate one they delete what was built on the farm and just throw the mateials into your inventory, so all that time building and organizing was wasted? now i have to rebuild and start again just cause? or keep your old save and what? not be able to play the new stuff  also dont have any of the lumas anymore dont know where they went, they were not in my inventory, plus all profesions are not completed anymore either, will maybe start again if any of my friends play but i wont be coming back to do that again and for what? another large update to delete everything again, shame as i had really enjoyed this game\n\nif you are new to this game it is very fun and would recommend,",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I wish I enjoyed this game, but besides it being cute, there is not much to it. I love cozy farming/mining sims and I immediately fell in love with the concept, as well as the art style, but this game leaves a lot to desire. I don't mind grinding (which the game requires from you to do a LOT), but it seemed pointless and dull to farm resources endlessly, craft 5 of the item, then craft a new thing from that item, etc. just to sell it for profit. I wish there were some more interesting mechanics in the game, but for me it quickly became repeptitive and boring. Maybe with updates to come, gameplay will enhance, but unfortunately I'm not keen on replaying games :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Motion sickness alert.  Had to refund because of the motion issue; otherwise offered cute and a pleasant enough casual gameplay; not as charming as, say,  Stardew, which is the gold standard of this type of game but I couldn't stay with it very long due to the dizzy-making graphic movement.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's a pretty game, but immediately I found the game to be clunky. The camera movement dragging feels sluggish (and the mouse cursor not disappearing bugs me). Hitting things accurately can be troublesome. I want to hit the fern for resin but I hit the grass or objects around it, or chop at grass trying to pick up mushrooms.\n\nThe straw was the \"combat\". A one second stun whip is not combat. It's also difficult to attack forward without running into the enemy. One hit and I went down, losing all my gathered materials.\n\nI'm sure the game is good in other aspects, but camera and movement controls being clunky affects the entire game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played for less than 30 minutes. My sim kept getting stuck and the game was very glitchy. Problems I don't have with other Steam games. I had to ask for a refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Such a beautiful game but I sorta felt lost after 3 hours. I wanted to love it but for some reason it wasn’t for me. I will give it a bad review but I think it’s just more based on my personal interest.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not recommended for new comer. no mark for every quest, i spend 30minutes just for searching the whole city for just a bench to repair",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]Luma Island[/b] is a charming and polished experience, but there's simply a few too many aspects that bring down an otherwise thoughtfully designed and fun journey. I wish I could instead mark this as neutral, but with a forced hand I reluctantly concede a negative (albeit marginally).\n\nThe distinct areas are interesting and diverse enough in visual style, but frustrating to navigate at times with how stringent the pathing is combined with the frequent changes in elevation. There are some sections that just make no sense to block navigation, given how deceptively flush the texturing can be at times, but because of how this system is designed the intention is clearly for you to adhere to a strict path with zero margin. It is just a little too restrictive, as you will find yourself tripping up constantly on the smallest of inclines.\n\nThe crafting interface (if it can be called that), particularly with how you queue multiples, could really do with an overhaul as opposed to simply holding down a button to increment the stack. While obviously intuitive, this system does not scale at all when you want to queue e.g. 100 or more at once, and by late/post game with some of the amounts required to build mega structures it is absolutely insufficient of an interface to fulfil this purpose while retaining sanity. It warrants a proper drag and drop interface alongside an ability to split stacks.\n\nMost professions follow the same formula in which you interact with an NPC and after crafting 5 relevant items essentially move into a next tier and repeat. These items can be sold, some used as ingredients to build structures, or in the case of shipwright to fulfil quest requirements. I wouldn't have much of an issue with how repetitive professions are if the prerequisite fee to acquire them didn't scale so significantly, and additionally Luma Energy as a key ingredient for every maiden craft across professions is a bit demanding given how mostly time limiting this resource is.\n\nAt times I found the dungeon crawling to just be a little too tedious between the environmental hazards and pixel perfect pathing. While the challenge adds something compelling and keeps the experience interesting, for a game in this genre I just didn't see it being necessary by the late game to have to spend ~20 minutes in one with no way to know how close you are to the end. I would have preferred these to be less rooms but with more unique puzzles as opposed to longer, rearranged ones you've solved before. Keep the harder, protracted variants as optional content.\n\nThe Luma companion system is interesting in theory but severely underdeveloped and as such kind of feels like an afterthought, particularly as many of them share the same trait (e.g. reigniting torches). I think it would have made more sense, given the small scope, to have a separate training system for the player to be able to select which trait is active, rendering the companion Luma itself purely cosmetic. This would fit the cozy vibe a bit better as you might like the design of a specific Luma but prefer a different trait to compliment your gameplay preference.\n\nDespite generally being satisfied with the gameplay systems, environmental puzzles, and overall pacing I was really let down by the completion rewards (or lack thereof) particularly for the main quest and pirates quest. Clearly so much thought and care were put into these quests, but the rewards are in no way commensurate for the time invested to complete them. Truthfully I was kind of insulted by the minable piles as despite visual differences they only allow you to mine a single coin at a time and also inhibit the natural behaviour of the pickaxe in regards to its held action.\n\nWhile I hope there is more in the pipeline, as pirates added interesting content, I hope to see a new entry eventually as I feel the high quality of this foundation coupled with some fundamental refinements could result in a greatly improved experience despite the inherent formulaic nature of its design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really regret buying the game. I was looking for an alternative to titles like Stardew Valley or Sun Haven and the further I got into the game, the more disappointed I got. Still, let me list the things that frustrated me, 'cause they might not be a big deal for you.\r\n\r\n- Lumas (the little pets you collect) are only useful when selected in your inventory. While housed inside your farm, they don't do anything but run around. (Even though they have cool abilities that have already been programmed and would be amazing for some farm automation :/ )\r\n- Following with Lumas. You can't choose the ones you get. Some people will have the amazing experience of getting the one they want and others (like myself here) will get everything BUT the one they want. I got my first combat luma when I was already at the jungle. To make it even more frustrating, I got the snail, which I don't like.\r\n- Resource grind. When people said this game was a grind, I thought it wouldn't be so bad. I mean, how grindy can a cozy game be? Well, try to upgrade your tools to volcanic and you'll soon find out. When I saw the numbers, my reaction was literally \"Nope, ty. Close the game and post this review\". You can't upgrade your workshops to produce stuff faster and shops will always sell the same amount of ingredients, be it the start of the game or late-game.\r\n- Once you're done with the Forest, other areas really feel like a brutal reskin of it. Credit to the devs where it's due, I really had fun with the Forest part. Then, I got to the Mountain and it was basically the same thing: reskinned enemies with similar mechanics, same sort of puzzles and so on. Nothing really surprises you. To make it worse, the materials are literally: rock, forest rock, mountain rock, jungle rock and it applies to all of the materials.\r\n- You get new seeds only by advancing your profession (cook/brewer). \r\n- Worst offender: no road tiles or grass tiles. You're forced into using gravel if you don't want weeds and trees to grow on your farm, so no matter where you are in the game, you're limited to one type of path (even though we see different tiles in the city).\r\n\r\nBasically, the game is very far away from similar titles in terms of polishing.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "Game components are good but may cause badly dizziness from narrow space and adjust perspective angle",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's a 3d stardew valley but there is no jumping mechanic. Because the landscape seems so detailed, it is REALLY disappointing you can't jump and climb onto ledges and objects. Quests are very linear and painstakingly boring with no direction and the world, although beautiful in design, seems lifeless with no real \"story\". Crafting toolbenches can be confusing because you can't hover over the items you need and determine what they are. You just have to look at them and guess. You can't dissassemble crafting benches you make either, you have to destroy them and remake them which is really unintuitive. When you til soil, you can't until it, and have to have sand or hay in hand to cover the hole. This is especially frustrating because you can't exactly aim where you're tilling and sometimes the movement is so slippery your cursor moves onto a tile you didn't intend to til. Each time you want to upgrade your tools, you need to run to the store in town with a bunch of random, poorly explained items with no explanation, leaving one wondering what the purpose of it all is. There is also absolutely no way to store or organize items either from what I've gathered, so you'll need to sift through dozens of random materials you pick up in order to figure out what you have and don't have.\n\nFor a game of this scope which people say is a good comparison to stardew, I would say this doesn't live up to the hype at all and it's lacking fully fleshed out game mechanics. It is just not smooth and there's no incentive to play. I do see it as part of a recurring trend in game development where basic game components and quality are reduced year after year because the devs are only after a quick buck. \n\nAfter experiencing whatever luma island is, I am left with the feeling that I would rather just replay stardew valley, because at least I'd be playing something that was made with passion, love, and painstaking attention to detail like the games we used to have.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself is fun and cozy to play with friends. but the grind is real.\r\n\r\nthe fishing game in particular is a FU to the player! having to run around for 15-30 seconds to catch 1 fish when you need 30 for a recipe is so fun /sarcasm",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Feel Free Games has released a rather nice game with Luma Island, but unfortunately, it has and continues to have weaknesses.\nThe graphics and style are positive aspects; it's cutely animated, and the co-op mode is also nice, although it has its flaws. For example, my wife can join me on the farm and go on adventures with me, but achievements don't count for her.\nThere are professions, but apart from the shipbuilder, they only serve to earn money and quickly become boring.\nIn the vanilla game, there were no difficulty settings, so as a \"non-controller player,\" I had big problems with the temples and the volcano.\nMouse and keyboard are not supported.\nUnfortunately, the pirate duel is not affected by the difficulty setting. The player has to land multiple hits, while Rosita only needs a single hit with her pistol (with a nasty spread) or sword, and it's over. If playing with a controller isn't your preferred way to play, this point is quite frustrating and has nothing to do with relaxation for me.\nWith the pirate update, the need to explore the forest all the way to the beach and the mountain to the summit has been eliminated. Now you simply go to the pirate bay and can quickly reach the aforementioned locations and also the jungle. You don't have to finish building the bridge or repair the cable car and the boat if you already have the achievement.\nIn its current state, I would only recommend the game with reservations.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "After 60 Hours in the orignal game before the pirates update i had tons progress on my solo playthrough i had all professions completed and the farm built the way i wanted it and all lumas and houses organized and built,i had a massive farm with all the fruits and crops layed out i had stopped playing for a while as i was playing other games and was excited to play again when the pirates update came out, only to find out if you transfer your og save to the pirate one they delete what was built on the farm and just throw the mateials into your inventory, so all that time building and organizing was wasted? now i have to rebuild and start again just cause? or keep your old save and what? not be able to play the new stuff  also dont have any of the lumas anymore dont know where they went, they were not in my inventory, plus all profesions are not completed anymore either, will maybe start again if any of my friends play but i wont be coming back to do that again and for what? another large update to delete everything again, shame as i had really enjoyed this game\n\nif you are new to this game it is very fun and would recommend,",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I wish I enjoyed this game, but besides it being cute, there is not much to it. I love cozy farming/mining sims and I immediately fell in love with the concept, as well as the art style, but this game leaves a lot to desire. I don't mind grinding (which the game requires from you to do a LOT), but it seemed pointless and dull to farm resources endlessly, craft 5 of the item, then craft a new thing from that item, etc. just to sell it for profit. I wish there were some more interesting mechanics in the game, but for me it quickly became repeptitive and boring. Maybe with updates to come, gameplay will enhance, but unfortunately I'm not keen on replaying games :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Motion sickness alert.  Had to refund because of the motion issue; otherwise offered cute and a pleasant enough casual gameplay; not as charming as, say,  Stardew, which is the gold standard of this type of game but I couldn't stay with it very long due to the dizzy-making graphic movement.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's a pretty game, but immediately I found the game to be clunky. The camera movement dragging feels sluggish (and the mouse cursor not disappearing bugs me). Hitting things accurately can be troublesome. I want to hit the fern for resin but I hit the grass or objects around it, or chop at grass trying to pick up mushrooms.\n\nThe straw was the \"combat\". A one second stun whip is not combat. It's also difficult to attack forward without running into the enemy. One hit and I went down, losing all my gathered materials.\n\nI'm sure the game is good in other aspects, but camera and movement controls being clunky affects the entire game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played for less than 30 minutes. My sim kept getting stuck and the game was very glitchy. Problems I don't have with other Steam games. I had to ask for a refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Such a beautiful game but I sorta felt lost after 3 hours. I wanted to love it but for some reason it wasn’t for me. I will give it a bad review but I think it’s just more based on my personal interest.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not recommended for new comer. no mark for every quest, i spend 30minutes just for searching the whole city for just a bench to repair",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]Luma Island[/b] is a charming and polished experience, but there's simply a few too many aspects that bring down an otherwise thoughtfully designed and fun journey. I wish I could instead mark this as neutral, but with a forced hand I reluctantly concede a negative (albeit marginally).\n\nThe distinct areas are interesting and diverse enough in visual style, but frustrating to navigate at times with how stringent the pathing is combined with the frequent changes in elevation. There are some sections that just make no sense to block navigation, given how deceptively flush the texturing can be at times, but because of how this system is designed the intention is clearly for you to adhere to a strict path with zero margin. It is just a little too restrictive, as you will find yourself tripping up constantly on the smallest of inclines.\n\nThe crafting interface (if it can be called that), particularly with how you queue multiples, could really do with an overhaul as opposed to simply holding down a button to increment the stack. While obviously intuitive, this system does not scale at all when you want to queue e.g. 100 or more at once, and by late/post game with some of the amounts required to build mega structures it is absolutely insufficient of an interface to fulfil this purpose while retaining sanity. It warrants a proper drag and drop interface alongside an ability to split stacks.\n\nMost professions follow the same formula in which you interact with an NPC and after crafting 5 relevant items essentially move into a next tier and repeat. These items can be sold, some used as ingredients to build structures, or in the case of shipwright to fulfil quest requirements. I wouldn't have much of an issue with how repetitive professions are if the prerequisite fee to acquire them didn't scale so significantly, and additionally Luma Energy as a key ingredient for every maiden craft across professions is a bit demanding given how mostly time limiting this resource is.\n\nAt times I found the dungeon crawling to just be a little too tedious between the environmental hazards and pixel perfect pathing. While the challenge adds something compelling and keeps the experience interesting, for a game in this genre I just didn't see it being necessary by the late game to have to spend ~20 minutes in one with no way to know how close you are to the end. I would have preferred these to be less rooms but with more unique puzzles as opposed to longer, rearranged ones you've solved before. Keep the harder, protracted variants as optional content.\n\nThe Luma companion system is interesting in theory but severely underdeveloped and as such kind of feels like an afterthought, particularly as many of them share the same trait (e.g. reigniting torches). I think it would have made more sense, given the small scope, to have a separate training system for the player to be able to select which trait is active, rendering the companion Luma itself purely cosmetic. This would fit the cozy vibe a bit better as you might like the design of a specific Luma but prefer a different trait to compliment your gameplay preference.\n\nDespite generally being satisfied with the gameplay systems, environmental puzzles, and overall pacing I was really let down by the completion rewards (or lack thereof) particularly for the main quest and pirates quest. Clearly so much thought and care were put into these quests, but the rewards are in no way commensurate for the time invested to complete them. Truthfully I was kind of insulted by the minable piles as despite visual differences they only allow you to mine a single coin at a time and also inhibit the natural behaviour of the pickaxe in regards to its held action.\n\nWhile I hope there is more in the pipeline, as pirates added interesting content, I hope to see a new entry eventually as I feel the high quality of this foundation coupled with some fundamental refinements could result in a greatly improved experience despite the inherent formulaic nature of its design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really regret buying the game. I was looking for an alternative to titles like Stardew Valley or Sun Haven and the further I got into the game, the more disappointed I got. Still, let me list the things that frustrated me, 'cause they might not be a big deal for you.\r\n\r\n- Lumas (the little pets you collect) are only useful when selected in your inventory. While housed inside your farm, they don't do anything but run around. (Even though they have cool abilities that have already been programmed and would be amazing for some farm automation :/ )\r\n- Following with Lumas. You can't choose the ones you get. Some people will have the amazing experience of getting the one they want and others (like myself here) will get everything BUT the one they want. I got my first combat luma when I was already at the jungle. To make it even more frustrating, I got the snail, which I don't like.\r\n- Resource grind. When people said this game was a grind, I thought it wouldn't be so bad. I mean, how grindy can a cozy game be? Well, try to upgrade your tools to volcanic and you'll soon find out. When I saw the numbers, my reaction was literally \"Nope, ty. Close the game and post this review\". You can't upgrade your workshops to produce stuff faster and shops will always sell the same amount of ingredients, be it the start of the game or late-game.\r\n- Once you're done with the Forest, other areas really feel like a brutal reskin of it. Credit to the devs where it's due, I really had fun with the Forest part. Then, I got to the Mountain and it was basically the same thing: reskinned enemies with similar mechanics, same sort of puzzles and so on. Nothing really surprises you. To make it worse, the materials are literally: rock, forest rock, mountain rock, jungle rock and it applies to all of the materials.\r\n- You get new seeds only by advancing your profession (cook/brewer). \r\n- Worst offender: no road tiles or grass tiles. You're forced into using gravel if you don't want weeds and trees to grow on your farm, so no matter where you are in the game, you're limited to one type of path (even though we see different tiles in the city).\r\n\r\nBasically, the game is very far away from similar titles in terms of polishing.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "Game components are good but may cause badly dizziness from narrow space and adjust perspective angle",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's a 3d stardew valley but there is no jumping mechanic. Because the landscape seems so detailed, it is REALLY disappointing you can't jump and climb onto ledges and objects. Quests are very linear and painstakingly boring with no direction and the world, although beautiful in design, seems lifeless with no real \"story\". Crafting toolbenches can be confusing because you can't hover over the items you need and determine what they are. You just have to look at them and guess. You can't dissassemble crafting benches you make either, you have to destroy them and remake them which is really unintuitive. When you til soil, you can't until it, and have to have sand or hay in hand to cover the hole. This is especially frustrating because you can't exactly aim where you're tilling and sometimes the movement is so slippery your cursor moves onto a tile you didn't intend to til. Each time you want to upgrade your tools, you need to run to the store in town with a bunch of random, poorly explained items with no explanation, leaving one wondering what the purpose of it all is. There is also absolutely no way to store or organize items either from what I've gathered, so you'll need to sift through dozens of random materials you pick up in order to figure out what you have and don't have.\n\nFor a game of this scope which people say is a good comparison to stardew, I would say this doesn't live up to the hype at all and it's lacking fully fleshed out game mechanics. It is just not smooth and there's no incentive to play. I do see it as part of a recurring trend in game development where basic game components and quality are reduced year after year because the devs are only after a quick buck. \n\nAfter experiencing whatever luma island is, I am left with the feeling that I would rather just replay stardew valley, because at least I'd be playing something that was made with passion, love, and painstaking attention to detail like the games we used to have.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself is fun and cozy to play with friends. but the grind is real.\r\n\r\nthe fishing game in particular is a FU to the player! having to run around for 15-30 seconds to catch 1 fish when you need 30 for a recipe is so fun /sarcasm",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Feel Free Games has released a rather nice game with Luma Island, but unfortunately, it has and continues to have weaknesses.\nThe graphics and style are positive aspects; it's cutely animated, and the co-op mode is also nice, although it has its flaws. For example, my wife can join me on the farm and go on adventures with me, but achievements don't count for her.\nThere are professions, but apart from the shipbuilder, they only serve to earn money and quickly become boring.\nIn the vanilla game, there were no difficulty settings, so as a \"non-controller player,\" I had big problems with the temples and the volcano.\nMouse and keyboard are not supported.\nUnfortunately, the pirate duel is not affected by the difficulty setting. The player has to land multiple hits, while Rosita only needs a single hit with her pistol (with a nasty spread) or sword, and it's over. If playing with a controller isn't your preferred way to play, this point is quite frustrating and has nothing to do with relaxation for me.\nWith the pirate update, the need to explore the forest all the way to the beach and the mountain to the summit has been eliminated. Now you simply go to the pirate bay and can quickly reach the aforementioned locations and also the jungle. You don't have to finish building the bridge or repair the cable car and the boat if you already have the achievement.\nIn its current state, I would only recommend the game with reservations.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "After 60 Hours in the orignal game before the pirates update i had tons progress on my solo playthrough i had all professions completed and the farm built the way i wanted it and all lumas and houses organized and built,i had a massive farm with all the fruits and crops layed out i had stopped playing for a while as i was playing other games and was excited to play again when the pirates update came out, only to find out if you transfer your og save to the pirate one they delete what was built on the farm and just throw the mateials into your inventory, so all that time building and organizing was wasted? now i have to rebuild and start again just cause? or keep your old save and what? not be able to play the new stuff  also dont have any of the lumas anymore dont know where they went, they were not in my inventory, plus all profesions are not completed anymore either, will maybe start again if any of my friends play but i wont be coming back to do that again and for what? another large update to delete everything again, shame as i had really enjoyed this game\n\nif you are new to this game it is very fun and would recommend,",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I wish I enjoyed this game, but besides it being cute, there is not much to it. I love cozy farming/mining sims and I immediately fell in love with the concept, as well as the art style, but this game leaves a lot to desire. I don't mind grinding (which the game requires from you to do a LOT), but it seemed pointless and dull to farm resources endlessly, craft 5 of the item, then craft a new thing from that item, etc. just to sell it for profit. I wish there were some more interesting mechanics in the game, but for me it quickly became repeptitive and boring. Maybe with updates to come, gameplay will enhance, but unfortunately I'm not keen on replaying games :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Motion sickness alert.  Had to refund because of the motion issue; otherwise offered cute and a pleasant enough casual gameplay; not as charming as, say,  Stardew, which is the gold standard of this type of game but I couldn't stay with it very long due to the dizzy-making graphic movement.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's a pretty game, but immediately I found the game to be clunky. The camera movement dragging feels sluggish (and the mouse cursor not disappearing bugs me). Hitting things accurately can be troublesome. I want to hit the fern for resin but I hit the grass or objects around it, or chop at grass trying to pick up mushrooms.\n\nThe straw was the \"combat\". A one second stun whip is not combat. It's also difficult to attack forward without running into the enemy. One hit and I went down, losing all my gathered materials.\n\nI'm sure the game is good in other aspects, but camera and movement controls being clunky affects the entire game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played for less than 30 minutes. My sim kept getting stuck and the game was very glitchy. Problems I don't have with other Steam games. I had to ask for a refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Such a beautiful game but I sorta felt lost after 3 hours. I wanted to love it but for some reason it wasn’t for me. I will give it a bad review but I think it’s just more based on my personal interest.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not recommended for new comer. no mark for every quest, i spend 30minutes just for searching the whole city for just a bench to repair",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]Luma Island[/b] is a charming and polished experience, but there's simply a few too many aspects that bring down an otherwise thoughtfully designed and fun journey. I wish I could instead mark this as neutral, but with a forced hand I reluctantly concede a negative (albeit marginally).\n\nThe distinct areas are interesting and diverse enough in visual style, but frustrating to navigate at times with how stringent the pathing is combined with the frequent changes in elevation. There are some sections that just make no sense to block navigation, given how deceptively flush the texturing can be at times, but because of how this system is designed the intention is clearly for you to adhere to a strict path with zero margin. It is just a little too restrictive, as you will find yourself tripping up constantly on the smallest of inclines.\n\nThe crafting interface (if it can be called that), particularly with how you queue multiples, could really do with an overhaul as opposed to simply holding down a button to increment the stack. While obviously intuitive, this system does not scale at all when you want to queue e.g. 100 or more at once, and by late/post game with some of the amounts required to build mega structures it is absolutely insufficient of an interface to fulfil this purpose while retaining sanity. It warrants a proper drag and drop interface alongside an ability to split stacks.\n\nMost professions follow the same formula in which you interact with an NPC and after crafting 5 relevant items essentially move into a next tier and repeat. These items can be sold, some used as ingredients to build structures, or in the case of shipwright to fulfil quest requirements. I wouldn't have much of an issue with how repetitive professions are if the prerequisite fee to acquire them didn't scale so significantly, and additionally Luma Energy as a key ingredient for every maiden craft across professions is a bit demanding given how mostly time limiting this resource is.\n\nAt times I found the dungeon crawling to just be a little too tedious between the environmental hazards and pixel perfect pathing. While the challenge adds something compelling and keeps the experience interesting, for a game in this genre I just didn't see it being necessary by the late game to have to spend ~20 minutes in one with no way to know how close you are to the end. I would have preferred these to be less rooms but with more unique puzzles as opposed to longer, rearranged ones you've solved before. Keep the harder, protracted variants as optional content.\n\nThe Luma companion system is interesting in theory but severely underdeveloped and as such kind of feels like an afterthought, particularly as many of them share the same trait (e.g. reigniting torches). I think it would have made more sense, given the small scope, to have a separate training system for the player to be able to select which trait is active, rendering the companion Luma itself purely cosmetic. This would fit the cozy vibe a bit better as you might like the design of a specific Luma but prefer a different trait to compliment your gameplay preference.\n\nDespite generally being satisfied with the gameplay systems, environmental puzzles, and overall pacing I was really let down by the completion rewards (or lack thereof) particularly for the main quest and pirates quest. Clearly so much thought and care were put into these quests, but the rewards are in no way commensurate for the time invested to complete them. Truthfully I was kind of insulted by the minable piles as despite visual differences they only allow you to mine a single coin at a time and also inhibit the natural behaviour of the pickaxe in regards to its held action.\n\nWhile I hope there is more in the pipeline, as pirates added interesting content, I hope to see a new entry eventually as I feel the high quality of this foundation coupled with some fundamental refinements could result in a greatly improved experience despite the inherent formulaic nature of its design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really regret buying the game. I was looking for an alternative to titles like Stardew Valley or Sun Haven and the further I got into the game, the more disappointed I got. Still, let me list the things that frustrated me, 'cause they might not be a big deal for you.\r\n\r\n- Lumas (the little pets you collect) are only useful when selected in your inventory. While housed inside your farm, they don't do anything but run around. (Even though they have cool abilities that have already been programmed and would be amazing for some farm automation :/ )\r\n- Following with Lumas. You can't choose the ones you get. Some people will have the amazing experience of getting the one they want and others (like myself here) will get everything BUT the one they want. I got my first combat luma when I was already at the jungle. To make it even more frustrating, I got the snail, which I don't like.\r\n- Resource grind. When people said this game was a grind, I thought it wouldn't be so bad. I mean, how grindy can a cozy game be? Well, try to upgrade your tools to volcanic and you'll soon find out. When I saw the numbers, my reaction was literally \"Nope, ty. Close the game and post this review\". You can't upgrade your workshops to produce stuff faster and shops will always sell the same amount of ingredients, be it the start of the game or late-game.\r\n- Once you're done with the Forest, other areas really feel like a brutal reskin of it. Credit to the devs where it's due, I really had fun with the Forest part. Then, I got to the Mountain and it was basically the same thing: reskinned enemies with similar mechanics, same sort of puzzles and so on. Nothing really surprises you. To make it worse, the materials are literally: rock, forest rock, mountain rock, jungle rock and it applies to all of the materials.\r\n- You get new seeds only by advancing your profession (cook/brewer). \r\n- Worst offender: no road tiles or grass tiles. You're forced into using gravel if you don't want weeds and trees to grow on your farm, so no matter where you are in the game, you're limited to one type of path (even though we see different tiles in the city).\r\n\r\nBasically, the game is very far away from similar titles in terms of polishing.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "Game components are good but may cause badly dizziness from narrow space and adjust perspective angle",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's a 3d stardew valley but there is no jumping mechanic. Because the landscape seems so detailed, it is REALLY disappointing you can't jump and climb onto ledges and objects. Quests are very linear and painstakingly boring with no direction and the world, although beautiful in design, seems lifeless with no real \"story\". Crafting toolbenches can be confusing because you can't hover over the items you need and determine what they are. You just have to look at them and guess. You can't dissassemble crafting benches you make either, you have to destroy them and remake them which is really unintuitive. When you til soil, you can't until it, and have to have sand or hay in hand to cover the hole. This is especially frustrating because you can't exactly aim where you're tilling and sometimes the movement is so slippery your cursor moves onto a tile you didn't intend to til. Each time you want to upgrade your tools, you need to run to the store in town with a bunch of random, poorly explained items with no explanation, leaving one wondering what the purpose of it all is. There is also absolutely no way to store or organize items either from what I've gathered, so you'll need to sift through dozens of random materials you pick up in order to figure out what you have and don't have.\n\nFor a game of this scope which people say is a good comparison to stardew, I would say this doesn't live up to the hype at all and it's lacking fully fleshed out game mechanics. It is just not smooth and there's no incentive to play. I do see it as part of a recurring trend in game development where basic game components and quality are reduced year after year because the devs are only after a quick buck. \n\nAfter experiencing whatever luma island is, I am left with the feeling that I would rather just replay stardew valley, because at least I'd be playing something that was made with passion, love, and painstaking attention to detail like the games we used to have.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself is fun and cozy to play with friends. but the grind is real.\r\n\r\nthe fishing game in particular is a FU to the player! having to run around for 15-30 seconds to catch 1 fish when you need 30 for a recipe is so fun /sarcasm",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Feel Free Games has released a rather nice game with Luma Island, but unfortunately, it has and continues to have weaknesses.\nThe graphics and style are positive aspects; it's cutely animated, and the co-op mode is also nice, although it has its flaws. For example, my wife can join me on the farm and go on adventures with me, but achievements don't count for her.\nThere are professions, but apart from the shipbuilder, they only serve to earn money and quickly become boring.\nIn the vanilla game, there were no difficulty settings, so as a \"non-controller player,\" I had big problems with the temples and the volcano.\nMouse and keyboard are not supported.\nUnfortunately, the pirate duel is not affected by the difficulty setting. The player has to land multiple hits, while Rosita only needs a single hit with her pistol (with a nasty spread) or sword, and it's over. If playing with a controller isn't your preferred way to play, this point is quite frustrating and has nothing to do with relaxation for me.\nWith the pirate update, the need to explore the forest all the way to the beach and the mountain to the summit has been eliminated. Now you simply go to the pirate bay and can quickly reach the aforementioned locations and also the jungle. You don't have to finish building the bridge or repair the cable car and the boat if you already have the achievement.\nIn its current state, I would only recommend the game with reservations.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "After 60 Hours in the orignal game before the pirates update i had tons progress on my solo playthrough i had all professions completed and the farm built the way i wanted it and all lumas and houses organized and built,i had a massive farm with all the fruits and crops layed out i had stopped playing for a while as i was playing other games and was excited to play again when the pirates update came out, only to find out if you transfer your og save to the pirate one they delete what was built on the farm and just throw the mateials into your inventory, so all that time building and organizing was wasted? now i have to rebuild and start again just cause? or keep your old save and what? not be able to play the new stuff  also dont have any of the lumas anymore dont know where they went, they were not in my inventory, plus all profesions are not completed anymore either, will maybe start again if any of my friends play but i wont be coming back to do that again and for what? another large update to delete everything again, shame as i had really enjoyed this game\n\nif you are new to this game it is very fun and would recommend,",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I wish I enjoyed this game, but besides it being cute, there is not much to it. I love cozy farming/mining sims and I immediately fell in love with the concept, as well as the art style, but this game leaves a lot to desire. I don't mind grinding (which the game requires from you to do a LOT), but it seemed pointless and dull to farm resources endlessly, craft 5 of the item, then craft a new thing from that item, etc. just to sell it for profit. I wish there were some more interesting mechanics in the game, but for me it quickly became repeptitive and boring. Maybe with updates to come, gameplay will enhance, but unfortunately I'm not keen on replaying games :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Motion sickness alert.  Had to refund because of the motion issue; otherwise offered cute and a pleasant enough casual gameplay; not as charming as, say,  Stardew, which is the gold standard of this type of game but I couldn't stay with it very long due to the dizzy-making graphic movement.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's a pretty game, but immediately I found the game to be clunky. The camera movement dragging feels sluggish (and the mouse cursor not disappearing bugs me). Hitting things accurately can be troublesome. I want to hit the fern for resin but I hit the grass or objects around it, or chop at grass trying to pick up mushrooms.\n\nThe straw was the \"combat\". A one second stun whip is not combat. It's also difficult to attack forward without running into the enemy. One hit and I went down, losing all my gathered materials.\n\nI'm sure the game is good in other aspects, but camera and movement controls being clunky affects the entire game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played for less than 30 minutes. My sim kept getting stuck and the game was very glitchy. Problems I don't have with other Steam games. I had to ask for a refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Such a beautiful game but I sorta felt lost after 3 hours. I wanted to love it but for some reason it wasn’t for me. I will give it a bad review but I think it’s just more based on my personal interest.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not recommended for new comer. no mark for every quest, i spend 30minutes just for searching the whole city for just a bench to repair",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]Luma Island[/b] is a charming and polished experience, but there's simply a few too many aspects that bring down an otherwise thoughtfully designed and fun journey. I wish I could instead mark this as neutral, but with a forced hand I reluctantly concede a negative (albeit marginally).\n\nThe distinct areas are interesting and diverse enough in visual style, but frustrating to navigate at times with how stringent the pathing is combined with the frequent changes in elevation. There are some sections that just make no sense to block navigation, given how deceptively flush the texturing can be at times, but because of how this system is designed the intention is clearly for you to adhere to a strict path with zero margin. It is just a little too restrictive, as you will find yourself tripping up constantly on the smallest of inclines.\n\nThe crafting interface (if it can be called that), particularly with how you queue multiples, could really do with an overhaul as opposed to simply holding down a button to increment the stack. While obviously intuitive, this system does not scale at all when you want to queue e.g. 100 or more at once, and by late/post game with some of the amounts required to build mega structures it is absolutely insufficient of an interface to fulfil this purpose while retaining sanity. It warrants a proper drag and drop interface alongside an ability to split stacks.\n\nMost professions follow the same formula in which you interact with an NPC and after crafting 5 relevant items essentially move into a next tier and repeat. These items can be sold, some used as ingredients to build structures, or in the case of shipwright to fulfil quest requirements. I wouldn't have much of an issue with how repetitive professions are if the prerequisite fee to acquire them didn't scale so significantly, and additionally Luma Energy as a key ingredient for every maiden craft across professions is a bit demanding given how mostly time limiting this resource is.\n\nAt times I found the dungeon crawling to just be a little too tedious between the environmental hazards and pixel perfect pathing. While the challenge adds something compelling and keeps the experience interesting, for a game in this genre I just didn't see it being necessary by the late game to have to spend ~20 minutes in one with no way to know how close you are to the end. I would have preferred these to be less rooms but with more unique puzzles as opposed to longer, rearranged ones you've solved before. Keep the harder, protracted variants as optional content.\n\nThe Luma companion system is interesting in theory but severely underdeveloped and as such kind of feels like an afterthought, particularly as many of them share the same trait (e.g. reigniting torches). I think it would have made more sense, given the small scope, to have a separate training system for the player to be able to select which trait is active, rendering the companion Luma itself purely cosmetic. This would fit the cozy vibe a bit better as you might like the design of a specific Luma but prefer a different trait to compliment your gameplay preference.\n\nDespite generally being satisfied with the gameplay systems, environmental puzzles, and overall pacing I was really let down by the completion rewards (or lack thereof) particularly for the main quest and pirates quest. Clearly so much thought and care were put into these quests, but the rewards are in no way commensurate for the time invested to complete them. Truthfully I was kind of insulted by the minable piles as despite visual differences they only allow you to mine a single coin at a time and also inhibit the natural behaviour of the pickaxe in regards to its held action.\n\nWhile I hope there is more in the pipeline, as pirates added interesting content, I hope to see a new entry eventually as I feel the high quality of this foundation coupled with some fundamental refinements could result in a greatly improved experience despite the inherent formulaic nature of its design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really regret buying the game. I was looking for an alternative to titles like Stardew Valley or Sun Haven and the further I got into the game, the more disappointed I got. Still, let me list the things that frustrated me, 'cause they might not be a big deal for you.\r\n\r\n- Lumas (the little pets you collect) are only useful when selected in your inventory. While housed inside your farm, they don't do anything but run around. (Even though they have cool abilities that have already been programmed and would be amazing for some farm automation :/ )\r\n- Following with Lumas. You can't choose the ones you get. Some people will have the amazing experience of getting the one they want and others (like myself here) will get everything BUT the one they want. I got my first combat luma when I was already at the jungle. To make it even more frustrating, I got the snail, which I don't like.\r\n- Resource grind. When people said this game was a grind, I thought it wouldn't be so bad. I mean, how grindy can a cozy game be? Well, try to upgrade your tools to volcanic and you'll soon find out. When I saw the numbers, my reaction was literally \"Nope, ty. Close the game and post this review\". You can't upgrade your workshops to produce stuff faster and shops will always sell the same amount of ingredients, be it the start of the game or late-game.\r\n- Once you're done with the Forest, other areas really feel like a brutal reskin of it. Credit to the devs where it's due, I really had fun with the Forest part. Then, I got to the Mountain and it was basically the same thing: reskinned enemies with similar mechanics, same sort of puzzles and so on. Nothing really surprises you. To make it worse, the materials are literally: rock, forest rock, mountain rock, jungle rock and it applies to all of the materials.\r\n- You get new seeds only by advancing your profession (cook/brewer). \r\n- Worst offender: no road tiles or grass tiles. You're forced into using gravel if you don't want weeds and trees to grow on your farm, so no matter where you are in the game, you're limited to one type of path (even though we see different tiles in the city).\r\n\r\nBasically, the game is very far away from similar titles in terms of polishing.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "Game components are good but may cause badly dizziness from narrow space and adjust perspective angle",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's a 3d stardew valley but there is no jumping mechanic. Because the landscape seems so detailed, it is REALLY disappointing you can't jump and climb onto ledges and objects. Quests are very linear and painstakingly boring with no direction and the world, although beautiful in design, seems lifeless with no real \"story\". Crafting toolbenches can be confusing because you can't hover over the items you need and determine what they are. You just have to look at them and guess. You can't dissassemble crafting benches you make either, you have to destroy them and remake them which is really unintuitive. When you til soil, you can't until it, and have to have sand or hay in hand to cover the hole. This is especially frustrating because you can't exactly aim where you're tilling and sometimes the movement is so slippery your cursor moves onto a tile you didn't intend to til. Each time you want to upgrade your tools, you need to run to the store in town with a bunch of random, poorly explained items with no explanation, leaving one wondering what the purpose of it all is. There is also absolutely no way to store or organize items either from what I've gathered, so you'll need to sift through dozens of random materials you pick up in order to figure out what you have and don't have.\n\nFor a game of this scope which people say is a good comparison to stardew, I would say this doesn't live up to the hype at all and it's lacking fully fleshed out game mechanics. It is just not smooth and there's no incentive to play. I do see it as part of a recurring trend in game development where basic game components and quality are reduced year after year because the devs are only after a quick buck. \n\nAfter experiencing whatever luma island is, I am left with the feeling that I would rather just replay stardew valley, because at least I'd be playing something that was made with passion, love, and painstaking attention to detail like the games we used to have.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself is fun and cozy to play with friends. but the grind is real.\r\n\r\nthe fishing game in particular is a FU to the player! having to run around for 15-30 seconds to catch 1 fish when you need 30 for a recipe is so fun /sarcasm",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Feel Free Games has released a rather nice game with Luma Island, but unfortunately, it has and continues to have weaknesses.\nThe graphics and style are positive aspects; it's cutely animated, and the co-op mode is also nice, although it has its flaws. For example, my wife can join me on the farm and go on adventures with me, but achievements don't count for her.\nThere are professions, but apart from the shipbuilder, they only serve to earn money and quickly become boring.\nIn the vanilla game, there were no difficulty settings, so as a \"non-controller player,\" I had big problems with the temples and the volcano.\nMouse and keyboard are not supported.\nUnfortunately, the pirate duel is not affected by the difficulty setting. The player has to land multiple hits, while Rosita only needs a single hit with her pistol (with a nasty spread) or sword, and it's over. If playing with a controller isn't your preferred way to play, this point is quite frustrating and has nothing to do with relaxation for me.\nWith the pirate update, the need to explore the forest all the way to the beach and the mountain to the summit has been eliminated. Now you simply go to the pirate bay and can quickly reach the aforementioned locations and also the jungle. You don't have to finish building the bridge or repair the cable car and the boat if you already have the achievement.\nIn its current state, I would only recommend the game with reservations.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "After 60 Hours in the orignal game before the pirates update i had tons progress on my solo playthrough i had all professions completed and the farm built the way i wanted it and all lumas and houses organized and built,i had a massive farm with all the fruits and crops layed out i had stopped playing for a while as i was playing other games and was excited to play again when the pirates update came out, only to find out if you transfer your og save to the pirate one they delete what was built on the farm and just throw the mateials into your inventory, so all that time building and organizing was wasted? now i have to rebuild and start again just cause? or keep your old save and what? not be able to play the new stuff  also dont have any of the lumas anymore dont know where they went, they were not in my inventory, plus all profesions are not completed anymore either, will maybe start again if any of my friends play but i wont be coming back to do that again and for what? another large update to delete everything again, shame as i had really enjoyed this game\n\nif you are new to this game it is very fun and would recommend,",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I wish I enjoyed this game, but besides it being cute, there is not much to it. I love cozy farming/mining sims and I immediately fell in love with the concept, as well as the art style, but this game leaves a lot to desire. I don't mind grinding (which the game requires from you to do a LOT), but it seemed pointless and dull to farm resources endlessly, craft 5 of the item, then craft a new thing from that item, etc. just to sell it for profit. I wish there were some more interesting mechanics in the game, but for me it quickly became repeptitive and boring. Maybe with updates to come, gameplay will enhance, but unfortunately I'm not keen on replaying games :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Motion sickness alert.  Had to refund because of the motion issue; otherwise offered cute and a pleasant enough casual gameplay; not as charming as, say,  Stardew, which is the gold standard of this type of game but I couldn't stay with it very long due to the dizzy-making graphic movement.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's a pretty game, but immediately I found the game to be clunky. The camera movement dragging feels sluggish (and the mouse cursor not disappearing bugs me). Hitting things accurately can be troublesome. I want to hit the fern for resin but I hit the grass or objects around it, or chop at grass trying to pick up mushrooms.\n\nThe straw was the \"combat\". A one second stun whip is not combat. It's also difficult to attack forward without running into the enemy. One hit and I went down, losing all my gathered materials.\n\nI'm sure the game is good in other aspects, but camera and movement controls being clunky affects the entire game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played for less than 30 minutes. My sim kept getting stuck and the game was very glitchy. Problems I don't have with other Steam games. I had to ask for a refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Such a beautiful game but I sorta felt lost after 3 hours. I wanted to love it but for some reason it wasn’t for me. I will give it a bad review but I think it’s just more based on my personal interest.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not recommended for new comer. no mark for every quest, i spend 30minutes just for searching the whole city for just a bench to repair",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]Luma Island[/b] is a charming and polished experience, but there's simply a few too many aspects that bring down an otherwise thoughtfully designed and fun journey. I wish I could instead mark this as neutral, but with a forced hand I reluctantly concede a negative (albeit marginally).\n\nThe distinct areas are interesting and diverse enough in visual style, but frustrating to navigate at times with how stringent the pathing is combined with the frequent changes in elevation. There are some sections that just make no sense to block navigation, given how deceptively flush the texturing can be at times, but because of how this system is designed the intention is clearly for you to adhere to a strict path with zero margin. It is just a little too restrictive, as you will find yourself tripping up constantly on the smallest of inclines.\n\nThe crafting interface (if it can be called that), particularly with how you queue multiples, could really do with an overhaul as opposed to simply holding down a button to increment the stack. While obviously intuitive, this system does not scale at all when you want to queue e.g. 100 or more at once, and by late/post game with some of the amounts required to build mega structures it is absolutely insufficient of an interface to fulfil this purpose while retaining sanity. It warrants a proper drag and drop interface alongside an ability to split stacks.\n\nMost professions follow the same formula in which you interact with an NPC and after crafting 5 relevant items essentially move into a next tier and repeat. These items can be sold, some used as ingredients to build structures, or in the case of shipwright to fulfil quest requirements. I wouldn't have much of an issue with how repetitive professions are if the prerequisite fee to acquire them didn't scale so significantly, and additionally Luma Energy as a key ingredient for every maiden craft across professions is a bit demanding given how mostly time limiting this resource is.\n\nAt times I found the dungeon crawling to just be a little too tedious between the environmental hazards and pixel perfect pathing. While the challenge adds something compelling and keeps the experience interesting, for a game in this genre I just didn't see it being necessary by the late game to have to spend ~20 minutes in one with no way to know how close you are to the end. I would have preferred these to be less rooms but with more unique puzzles as opposed to longer, rearranged ones you've solved before. Keep the harder, protracted variants as optional content.\n\nThe Luma companion system is interesting in theory but severely underdeveloped and as such kind of feels like an afterthought, particularly as many of them share the same trait (e.g. reigniting torches). I think it would have made more sense, given the small scope, to have a separate training system for the player to be able to select which trait is active, rendering the companion Luma itself purely cosmetic. This would fit the cozy vibe a bit better as you might like the design of a specific Luma but prefer a different trait to compliment your gameplay preference.\n\nDespite generally being satisfied with the gameplay systems, environmental puzzles, and overall pacing I was really let down by the completion rewards (or lack thereof) particularly for the main quest and pirates quest. Clearly so much thought and care were put into these quests, but the rewards are in no way commensurate for the time invested to complete them. Truthfully I was kind of insulted by the minable piles as despite visual differences they only allow you to mine a single coin at a time and also inhibit the natural behaviour of the pickaxe in regards to its held action.\n\nWhile I hope there is more in the pipeline, as pirates added interesting content, I hope to see a new entry eventually as I feel the high quality of this foundation coupled with some fundamental refinements could result in a greatly improved experience despite the inherent formulaic nature of its design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really regret buying the game. I was looking for an alternative to titles like Stardew Valley or Sun Haven and the further I got into the game, the more disappointed I got. Still, let me list the things that frustrated me, 'cause they might not be a big deal for you.\r\n\r\n- Lumas (the little pets you collect) are only useful when selected in your inventory. While housed inside your farm, they don't do anything but run around. (Even though they have cool abilities that have already been programmed and would be amazing for some farm automation :/ )\r\n- Following with Lumas. You can't choose the ones you get. Some people will have the amazing experience of getting the one they want and others (like myself here) will get everything BUT the one they want. I got my first combat luma when I was already at the jungle. To make it even more frustrating, I got the snail, which I don't like.\r\n- Resource grind. When people said this game was a grind, I thought it wouldn't be so bad. I mean, how grindy can a cozy game be? Well, try to upgrade your tools to volcanic and you'll soon find out. When I saw the numbers, my reaction was literally \"Nope, ty. Close the game and post this review\". You can't upgrade your workshops to produce stuff faster and shops will always sell the same amount of ingredients, be it the start of the game or late-game.\r\n- Once you're done with the Forest, other areas really feel like a brutal reskin of it. Credit to the devs where it's due, I really had fun with the Forest part. Then, I got to the Mountain and it was basically the same thing: reskinned enemies with similar mechanics, same sort of puzzles and so on. Nothing really surprises you. To make it worse, the materials are literally: rock, forest rock, mountain rock, jungle rock and it applies to all of the materials.\r\n- You get new seeds only by advancing your profession (cook/brewer). \r\n- Worst offender: no road tiles or grass tiles. You're forced into using gravel if you don't want weeds and trees to grow on your farm, so no matter where you are in the game, you're limited to one type of path (even though we see different tiles in the city).\r\n\r\nBasically, the game is very far away from similar titles in terms of polishing.",
      "voted_up": false,
      "votes_helpful": 68
    }
  ]
}