{
  "positive": [
    {
      "review": "Still incredible. The Nemesis system was mind-blowing when it dropped, and the combat is buttery smooth. Orc-slaying never felt so good.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "★ ★ ★ ★\n\nI give a 4 out of 5 Stars ★ for Middle-earth™: Shadow of Mordor™\n\nI just completed the 100% Steam achievements with a play time of about 60 hours and here is my review. \n\nShadow of Mordor was released in 2014, a tricky time for game developers as it was a transition between Playstation 3 to 4 and Xbox 360 to One. I had 2 copies 1 for PS3 and another for PC to test it and just ran through the Campaign and completed it in about 15 hours. I never liked the combat back then, found the nemesis system interesting but the lore was a big disappointment for many LOTR Fans. I remember this game was criticised for being a copycat of Assassin's creed free running at the time of its release including the air assassinations but it actually plays out differently. Its basically Arkham series style rhythm-based combat with excellent crowd control and fluidity. \n\nFast forward to 2025 considering the quality of games these days, this game feels like a gem to play. I needed some marathon single player game for Halloween and Shadow of Mordor became my go to choice. Despite a boring routine revenge main story and a lack of memorable characters beyond Talion and Celebrimbor, the developers made an excellent compensation with the much loved Nemesis system which gives the Orcs a lot of personality making an individual gamer's experience totally random and unique. \n\nThe Orcs are the real stars of the game and the reason one would love to play the game and with the Nemesis system you can play this forever if you want as there is no ending as an Orc can become a Captain and then a War-Chief for Talion to defeat. \n\nOverall Middle-earth™: Shadow of Mordor™ has very good Nostalgia factor. It does have outdated graphics for new gamers but it has an enjoyable combat system with Nemesis. The campaign and boss battles are pretty bad but the funny Orcs and their non stop banter and complaints of just about everything will keep anyone engaged. If you got bored simply go any stronghold and listen to the Orcs talk to themselves and you will be entertained.\n\nCheers! Have Fun!",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "Pretty derivative from the gameplay perspective. If you've played an open-world, action adventure game in the past 15 years, nothing here is exactly new or exciting (aside from the nemesis system). However, it is fun and polished. If you enjoy the Batman Arkham or Assassin's Creed games, this will appeal to you for sure.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Very solid game, 7/10.\r\n\r\nI was never the biggest fan of the \"Arkham\" style combat, so combat in this is kinda bland for me.\r\nNone of the upgrades really matter or change the game in any meaningful way. For example, the upgrade to be able to explode campfires is not impressive; it's just like the red explosive barrels, but a campfire (WOW).\r\n\r\nIt suffers from open-world game bloat but not nearly as much as Ubisoft games. And you can skip it all if you want; none of it is required for the game completion. \r\n\r\nIt's short and sweet, \r\nDoes not overstay its welcome; however, it really does feel like the games were split so they could sell more copies, as the final \"fight\" just happens, and you go back for new game+.\r\n\r\nI personally feel like these games are overrated, as everyone talks about how amazing this is, yet look at Steam achievements, only 35% of players have reached the end. With how short the game is if only doing story missions, it does make me think.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game still holds up and is excellent on the steamdeck",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun as hell... But fuck you Warner, Fuck you for patenting one of the greatest mechanics in videogame history.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "one does simply walk into Mordor and looks badass while doing it. Got this cause I love Lotr but soon found that this is just a batman arkham game set in middle earth, super fun combat, the story is ok but the real draw is the world, brutal combat, and the unique nemesis system.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game for play station a while ago and it was great, recently i got it again for the nostalgia, realized i didnt like the game for the story but more for the gameplay. game has absolutley fantastic mechanics i do recommend this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, but it keeps getting repetitive. \nShame on the developers for designing weak boss fights. Even a six-months-old baby can defeat the point-and-click bosses of the Tower and The Black Hand. WTF indeed!!! The very first boss, the Hammer, was much more challenging than the ones appear later. The Legendarium is massive, and developing a game in its universe demands hard work for sure. I suppose people at Monolith just wanted to finish everything ASAP.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "بهترین بازی از سری ارباب حلقه ها و البته نسخه بعدیش بهترم میشه!\r\nولی حیف خیلی خیلی کوتاه بود از دید من",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I must say that this game gets too much appreciation and less criticism than it should have. Out of 45h of my \"glorious\" playthrough I spent: 10h on attempting the two trials, 5h on reloading specific missions, 5h on walking and only 25h of an actual gameplay during main campaign + dlcs.\nWhile I don't find the lore butchering unfuriating/offensive (for example the in-game Sauron isn't an omniscient diety, fallen angel who served local Lucifer; instead he is an anglo-saxon 2003 Shredder, which makes him a bad Sauron, not a bad villian), but the gameplay repetitiveness + a rather narrow \"open\" world kill almost any joy this game can offer. \nThat said I would still recommend SoD, rather than not. I bought the game on sale ages ago, finally got enough time to 100% it. A shame that Monolith was closed (9 months ago, I guess), they deserved better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Went in for a quick hack-and-slash, ended up hunting orcs for hours because the Nemesis system is weirdly addictive. Combat feels smooth, stealth actually works, and every captain you annoy comes back louder and uglier than before. Story’s fine, but the real fun is causing chaos in the hierarchy. Great “let me clear one more base” kind of game that keeps pulling you back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shadow of Mordor is an action-adventure game set between The Hobbit and The Lord of the Rings, but it is not a direct retelling of Tolkien’s stories. Instead, it uses Middle-earth as a backdrop for an original tale. The result is a game that captures the atmosphere and themes of Tolkien’s world, but also takes major creative liberties that some fans appreciate and others question.\n\n🎮 Atmosphere & Lore Faithfulness\n✔ The World Feels Like Middle-earth\n\nThe game effectively portrays Mordor as a grim, dangerous, corrupted place, matching Tolkien’s descriptions.\n\nOrcs (or “Uruk-hai” in the game) have detailed personalities, rivalries, and hierarchies — something Tolkien hinted at, but never explored in depth.\n\nThe tone of the world is appropriately bleak but mythic, fitting the era before Sauron fully rises.\n\n✔ Use of Tolkien Locations & Factions\n\nNúmenórean ruins, slave pits, forges, and fortresses reflect a history consistent with the Second and Third Age stories.\n\nGollum appears, and his presence fits naturally into the timeline — his obsession with the Ring and sneaking through Mordor aligns with the lore.\n\n⚔️ Characters & Canon Deviations\n\nThis is where Shadow of Mordor takes the biggest liberties.\n\n❗ Talion (the protagonist)\n\nTalion is an original character, not found in Tolkien’s works.\n\nHis “revenant ranger” concept — a man sharing a body with a wraith — is cool but not grounded in Tolkien’s established magic.\n\nTolkien’s world rarely allows humans to return from death in this way.\n\n❗ Celebrimbor’s portrayal\n\nThis is the most controversial lore decision.\n\nIn Tolkien’s legendarium, Celebrimbor is a tragic figure who forged the Rings under Sauron’s deception.\n\nIn the game, Celebrimbor is a vengeful ghost who:\n\nBonds with Talion,\n\nForms armies,\n\nEnthralls orcs,\n\nForges a new Ring (in the sequel).\n\nThese actions do not align with Tolkien’s portrayal of Celebrimbor, who is far more humble, noble, and morally grounded.\n\n🔥 Themes: Faithful or Not?\n✔ Faithful Themes\n\nResistance against a growing evil.\n\nCorruption's influence over mortals.\n\nThe tragedy of Númenor’s legacy.\n\nThe danger of power and domination.\n\nThese ideas are very Tolkien-accurate.\n\n❗ Less Faithful Themes\n\nThe game focuses heavily on revenge, domination, and hunting orcs for power.\n\nTolkien’s works emphasize:\n\nMercy > vengeance\n\nHope > despair\n\nFree will > domination\n\nHumility > brute force\n\nThe game leans toward a darker, more power-fantasy-oriented interpretation.\n\n⚖️ Does the Game “Fit” Into Tolkien’s Canon?\n\nNot really — it fits the style and aesthetic of Middle-earth, but it isn’t canonically accurate.\n\nMost fans agree on this breakdown:\n\n✔ Lore-Compatible Elements\n\nMordor’s geography and culture\n\nOrc behavior and hierarchy\n\nGollum’s involvement\n\nMood, tone, and world-building\n\n❗ Lore-Breaking Elements\n\nTalion returning from death through wraith magic\n\nCelebrimbor as a combat-ghost general\n\nMind-controlling and dominating Uruks\n\nForging new Rings\n\nSome events contradict established timelines",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely great game. Specially in it release date. Great story. Great combat style. solid 9/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game on the ps4 and got every achievement. Have been itching to play it again and I gotta say the port for PC is exceptional. The game plays fluidly, controls are perfect and FPS is great. A must have if you are a LOTR fan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting and tight story, wonderful and revolutionary for its time enemy system (Nemesis) with enemies that feel rich and fairly fleshed out in terms of personality, and lends itself to different playstyles. Awesome game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Late to the party, but worth a playthrough, if you have not already. The game plays exactly like and Assassin's Creed game, with a LOTR paint job. It plays well though, and has some really interesting mechanics and a nice interface. My only gripe, which is somewhat irrelevant because of the age of this game, is that the map is a bit smaller and empty by today's standards. Other than that, it is great! Definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is good but a bit hard and at least the combat and finishing one are great though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "4.3/5 – A Masterpiece of Dynamic Storytelling and Challenge\r\n\r\nShadow of War is a rare gem in open-world action games, thanks to its unmatched(unfortunately copyrighted) Nemesis System. Every encounter feels personal—orc captains adapt to your playstyle, remember your failures, and even come back for revenge (or to save your skin from one). The first two maps deliver a gripping story, but the later game devolves into repetition, leaving you wondering, \"Why am I doing this again?\" Still, the journey is worth it.\r\n\r\nCombat and progression shine, especially on higher difficulties, where every victory feels earned. The skill trees add meaningful depth, and managing your orc army is a blast—though it’s frustrating you can’t bring your elite squad with you to new regions easily.\r\n\r\nThe world is immersive at first but grows repetitive, and 100% completion feels like a bit of a chore. But it is still a must play for Souls-like fans and RPG lovers who want a world that reacts to them. Just be ready to die, run, lose fights, adapt, and embrace the chaos.\r\n\r\nFinal tip: Start on the highest difficulty and work your way down if you are not making slow progress. The game rewards persistence, and the Nemesis System makes every death part of the story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although the game is now quite old, it still plays well. and its very clever in terms of the well known nemesis system. Its a shame that this cant be used in other such games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a lot less advanced in its features and the orc AI compared to its successor, but the power fantasy in this game is unmatched. The feeling you get from just cutting down hundreds of orcs with ease is just super fun.\n\nAlso trials were cool and i wish Shadow of War had them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game played it on release and love how the enemies scale based on how you kill them something i wish was in shadow of war. Game may get harder as you play but that's the beauty of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing, the graphics are good. The Nemsis system is one of the best systems I have ever tried, and a good point is that it's Renewable. Stealth, parkour, and combat, it's all good, didn't finish the story yet, but for now it can be 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game: good fighting mechanics, graphics still hold up in 2025, interesting story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good, I like. 7.8/20 although the achievement \"Test of the Wild\" is impossible to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game a lot of fun doing all the challenges and beating all the captains and warchiefs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic Hack and Slash combo adventure game.\r\nLove it. Been a long fan of the Tolkien universe, even if this series isn't technically cannon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it. Small map, but it takes advantage of it. Fabulous free flow combat system, level ups give you more abilities rather than just increase your health and stamina, and a good story without endless cutscenes. We need more games like this?!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very enjoyable combat system with lots of variety, a fun steal system and a great story. This game is amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a good/ok game.\r\n\r\n1. The nemesis system is quite good but it's not as good as the shadow of war and the videos you saw on internet\r\n\r\n2. The combat is fun and very smooth  but you see all of the combat within first 3 hr and it gets stale.  it's like arkham games but lacks impact\r\n\r\n3. story is servicable it dosen't really take much from lotr aside from names and the charectors are very generic only liked 2 in whole game \r\n\r\n4. Open world is filled to brim and you have a to do list to do. but the side activities get a lot better when you get a particular ability in 2nd area \r\n\r\n5. Art style is better in 2nd area of game also the ability you get in 2nd area makes game very fun \r\n\r\nOverall 6.5/10 pick up on sale you can play through main story in 12 hrs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game famously created the best dynamic NPC systems of all time, the nemesis system, and it feels just as amazing in 2025 as it did at release. It might the single most valuable gaming industry asset currently not being used, as far as I know. Worth a buy just to experience it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nemesis System is just so awesome. This is an Orc-Farming sim, you invest in the orcs you want to cultivate via empowering them and stuff. So that you can gain epic runes from their deaths. Very satisfying. Oh yeah and its a game set in LOTR world, that too.\r\n\r\nFun and highly recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay reminds me of Batman Arkham Asylum and the nemesis system is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Rocksteady Arkham combat style and nemesis system are great. It gives you a sense of choice and consequence people often search for in RPGs. It's a nice balance of both.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is engaging and fun to play. This can be played as stealth game or more offense & everything is fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok so the game is about a guy who losses every thing and mets a raeth a undying beaing and there is a story mode and a  hunt mode and bright lord mode so if you dont like one aspect abot it there more than u can handle \r\n\r\ni dont say this offen but trust me bro for like 5 bux you will have hours of fun\r\n\r\npls dont give me point i dont know what to do whith them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shadow of Mordor was fun to play as a Lord of the Rings fan, and the Nemesis System is really cool—though I’m still mad that it’s patented. The story was alright.\n\nGame: 6/10\n100%: 5/10\n\nNemesis System being patented: -100000/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked that there was an orc named Dush, and it was pronounced \"douche\", and you could click the button to have the ghost voice say \"douche\" over and over. 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love the Lord of the Rings Universe and wish you could massacre throngs of Uruks in brutal and satisfying ways, this game is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic that holds up fine! It is a bit limited/short though. Think Batman meets Assassins Creed with a big evolving hit-list. it's about a 7.5 outta 10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the Xbox 360 version back when it released, then recently got the itch to revisit. I have to say- it held up so well. \r\nThe combat feels great, the story is fun to follow, and the optional objectives don't feel tedious- so for 20$ (30 for GoTY which I recommend) I believe it's worth picking up and playing through/trying.\r\nFor the achievement hunters:  This title has plenty of challenges and trials for you to gravitate towards as you passively gain your achievements from the story :D\r\n\r\nFor hardcore Tolkien fans: You might not like this one too much, lore wise, since it takes a hefty amount of liberty when crafting the story, BUT if you go into it with the mindset of playing a \"action based, non-canon story set in Middle Earth\" I think you'll come to enjoy it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I definitely recommend this game, especially if it’s on sale.  This game has a heavy emphasis on letting you play your way, by giving you a large arsenal of tools at your disposal.  Orcs also have a hierarchy that you can manipulate and play politics with, which till this day is one of my favorite mechanics.  I probably wouldn’t buy it at full price as it goes on sale regularly, however it is definitely worth the money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, this game is a must have. And yes it's mainly because of the nemesis system.\n\nps: yes, it's a crime they let the franchise die.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shadow of War is better in pretty much every way, but if you enjoyed it then this one acts as a decent prequel. I especially enjoyed the Bright Lord part of the game, really felt like you were playing as a character from the Silmarillion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a Ubisoft-style open world game, with towers revealing the map and everything, BUT: the moment-to-moment gameplay is so great. There is a ton of room to change around your playstyle with the weapon runes system, Mastering the combat is fun and rewarding, and of course: there's the nemesis system. The defining mechanic (that unfortunately was copyrighted and will probably not be done again, not counting the sequel) does get a bit \"same-y\" after a while, but there were definitely some encounters that were enhanced by the one-liners, surprise encounters, etc. that can emerge from it.\r\n\r\nAll around it's fun as fuck and I'm excited to play the sequel after getting all the achievements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a must have even if you're not a fan of TLOTR. The story line is so well made that it feels like it came straight from the book. The first game is more lore accurate than the second but it's a masterpiece none the less. I first bought the game on my Xbox but when i got Steam, I knew I had to purchase it again. I love this game so much that I decided to 100% it and I've never done that with any other game before and it was worth it. Wish there were more games with the nemesis system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fantastic. It kinda stalls at the end of the main campaign, but the Bright Lord Finally was Epic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game overall, everything, story, graphics and gameplay. Only think im sad, as tolkien fan, is the fact that this game cannot really be canon. If the story had few changes it could (at least in my head and for me) work in cannon story with minor nerfes for MC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best game i've ever played. even with lower hardware requirement this game is really the best when it comes to fighting , the streak system similar to the Batman arkham game series. this game is really satisfying. As for the DLC the dark lord was the hardest but worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Let me get this out of the way, this has to be the most inaccurate tolkein adaptation in the history of everything. Bordering on fanfiction territory. So if you are a fan of tolkeins work, then this game is definitely not for you. \r\n\r\nAside from that this game is still fun as hell!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but why boss fight with tower and hand of sauron is so bad, literaly no epic boss fight in the end.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's easy to get into this game and while it's perhaps a bit repetitive, it's great fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really unique and awesome game!  Even though it's around 10 or so years old, it's a classic like Elder Scrolls v: Skyrim and GTA:V around the same time too.  This game reminds me of Assassins Creed and Skyrim actually.  I haven't heard or or played any other game where you can enter the wraith world, use the special wraith combat and interrogating/draining powers as in this game plus the kill combos are so cool!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So for the game itself it's very good, it's based on the nemesis system which I really enjoy as it adds a level of difficulty spike. Coming back to revisit this game made me miss the shaming option of the 2nd game. One flaw is if you're a normal joe with a job the achievement for the trials is near impossible to get :( but I do recommend it if you are interested in it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought this on a sale since it was really cheap so thought I might as well. Was not expecting myself to like this as much as I did. The combat felt pretty satisfying and eventually some of the abilities you unlock were really fun to use. Only complaint from me would be that movement felt pretty clunky at times like trying to climb or jump down from ledges as well as mounted combat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good story and world building, combat system was fun mixed up with the nemesis system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The FMV sequences are amazing. Story of vengeance, graphics are good considering the age and design. Ending was short but written well. lots of collectibles for ADHD type collectors. Has around 30 hours of gameplay. Lots of level up options. very fun and even replayable. Combat is like Assassins creed as well as the climbing mechanics. if youre a fan of LOTR and wanna slay endless hordes of orcs, this is your game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Technically, game is very good and mechanics are fun\r\nInfinite enemies - less so\r\nStory... meh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Haven't played in a while but it gets the hairs raised up on your neck and adrenaline going fun game wish it was 2 play for some back up lol. Great Game give it a B+",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Completely new experience for me which i really liked but after playing shadow of war this felt like the trailer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was a good LoTR game. Shadow of War is much better, but this is such a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you’re a true Lord of the Rings or Hobbit fan, this game is an absolute must-play. Few titles capture the Middle-earth vibe as perfectly as this one. The Gollum game could’ve learned a lot from it — this is how you do justice to Tolkien’s world!\r\n\r\nThe Nemesis System is pure genius — every encounter feels personal, every Uruk has a story, and every victory feels earned. Me gusta, amigo! ❤️\r\n\r\nI still hope we’ll get another game like Shadow of War someday, because nothing beats the thrill of slaying Uruks like there’s no tomorrow.\r\n\r\n10/10 — would return to Mordor any day, any time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Nemesis System keeps things pretty refreshing when you're fighting endless waves of orcs, it keeps the enemies pretty varied throughout the game. The sneaking can be exploited at some points, but is still pretty fun infiltrating and taking out entire outposts.\n\n The game really does open up once you unlock the Dominate ability, it just is unfortunate that it's not given to you until you complete the first act. The Dominate ability truly makes it an complete different game, so if this game doesn't grab you at first, I would at least give it until you unlock that ability.\nThis game still holds up after the initial release, however, the second installment, to me, is a more fun experience. They flesh out the Nemesis System even more in Shadow of War than this game, but I still thoroughly enjoy Shadow of Mordor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shadow of Mordor is an essential experience for fans of action games and the fantasy genre alike. Its main campaign is engaging, but the longevity and heart of the game lie squarely in its groundbreaking Nemesis System. It takes established gameplay mechanics and layers them with a brilliant piece of dynamic design that truly makes you the author of your own epic tale of vengeance in Middle-earth. It's a glorious knockout punch that deserves every bit of the praise it received.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is still the best Lord of the Rings open-world action/adventure game to date.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I forgot i bought this game few years back, decided to play it, amazed, and completed it with 100% achievement",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first recomendation is to engage this game more as it is inspired on the movies than in the books and don't think too much on it, because if you are of those that engage with the Silmarillion or Stories of Middle Earth, you are in for a mixed bag. In every other department, it is a competent game. Not too long, with enough mechanical nuance to engage with the gameplay from start to end and you can end up being pretty powerful and with enough practice to execute 100s of hit combos out of a pool of never ending orcs. It is a pretty satisfactory 'doom-guy simulator' where you just stand on top of dozens and dozens of enemies taking on a seemenly never ending army of goons and yet need to be skillful enough to not be touched as you can die pretty fast if you fumble.\nThe story...is there and I think it will be improved on the next game, but what you'll find here is not something to do justice to Tolkiens writtings, not by a long shot. So take it as movie inspired Lord of the Rings one man army simulator and you'll enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally one of the most cool concepts in all of gaming, not a fan of the world of Lord of the Rings, but boy was this story good, but that nemesis system was so good i'm not surprised its not under a patent. Must experience game for all people to dip your toes. (But not a fan of the game system being under a patent, totally sucks)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend the game with many caveats, and somewhat begrudgingly.\r\n\r\nPositives:\r\n1. The game is beautiful for a game of its time if your PC can run it in maxed out settings.\r\n2. The combat is very fun for the most part. It is visceral and eye catching, and the counter system it takes from the Arkham series is very well implemented.\r\n3. Captains are a lot of fun to experience. They have different designs, have their own intro lines, and when you can start dominating the game actually becomes a lot more fun in my opinion.\r\n\r\nNegatives:\r\n1. The cast feel like narrative vehicles rather than people you can relate to or care about. They seem interesting at first, but they ultimately have no utility, you never see or experience them outside of scripted story sequences, and the emotional stakes they are meant to enforce fall flat. \r\n2. The captains, while really cool in many ways, also become a source of frustration as some are immune to most attacks. Toward the end of the game the generals can have small armies of captains that overwhelm you pretty easily, especially when orc peons are literally endlessly populating and jumping you from behind. Trying to chase them down and finish them becomes a chore and source of annoyance as every other enemy gets in your way making it difficult to catch them. When you can start dominating captains, it is often very difficult as you are still getting constantly attacks which interrupts the attempt. Overall it is fun killing captains, but they too are endless, which wears thin after a while as it feels like a Hydra-like scenario where one head cut from the body just grows back, making you feel like you're not really making progress.\r\n3. Stealth sequences can be really frustrating later as you have to repeat the same mission from the beginning for even one mistake, and some of the missions become quite long and hard to avoid \"detection\" successfully. Eventually I just stopped trying to unlock my knife fully.\r\n4. The story overall falls pretty flat, though the dynamic between the two protagonists is mildly entertaining.\r\n5. Bosses seem epic, then you discover one is just a quick time event and the other is a lame stealth drain even, taking away the excitement and leading to a very weak climactic final \"battle\".\r\n6. The lame game abilities are much more fun, like dominating Caragor and Draug, but they are temporary rather than permanent mounts, which feels pretty lame ultimately as they die pretty easy and just become animal like transport vehicles losing their appeal.\r\n7. The world is open world style like Assassins creed, but there is literally nothing interesting going on it. You just travel from one mission marker to another, fighting enemies and captains along the way, and occasionally picking up collectibles, which are voice narrative (which seems cool but mostly isn't since they are random lore sequences and not really about the characters most of the time).\r\n8. Lastly, you wear the same outfit and use the same weapons the entire game. You can upgrade them, and they are further augmented with artifacts and by completing missions to strengthen them and unlock your move sets, but it felt a bit lame that nothing really visibly changed and that the environment was about unlocking stat bonuses and abilities, though your combat moves are largely the same the entire game, making exploration feel pretty pointless to me. \r\n\r\nUltimately, there are many cool ideas, but the game itself feels a bit more like a shell of a game built around a single gimmick more than anything. I hear the second game is much better, so I'm hopeful I will enjoy it more, and that they will capitalize on the interesting ideas of the original without it falling flat mid game. I say play it so you have an understanding of the game mechanics, so you can import your captain for the next game, and so you can experience the relationship between the two protagonists (though honestly a quick video summary would be perfectly sufficient as this is not a deep relationship really).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "English version (french below) : \n\nAn Assassin’s Creed style game (but better) set in the Lord of the Rings universe?\nAll that during a rarely explored era, filled with little bits of lore and attention to detail (elven runes for upgrades, etc.)?\nNo surprise here,  the game is great. The gameplay feels smooth and satisfying, it truly makes you feel like you’re in Middle-earth, the orc captain rivalry system is just brilliant, and the story is simple but enjoyable.\n\nFor completionists, you’ll need some motivation, the challenges can be tough and not always super exciting. But aside from that, nothing too frustrating, it’s all very doable.\n\nIf you love The Lord of the Rings, or even just action games in the style of Arkham / Spider-Man / Assassin’s Creed, honestly, go for it, it’s a fun game ! :-)\n\n\n\nFrench version : \n\nUn Assassin's Creed (en mieux réussi) dans l'univers du Seigneur des Anneaux ? Le tout à une époque peu explorée avec plein de petites attentions au lore et de détails (runes elfiques pour les améliorations, etc) ?\nBon aucune surprise, le jeu est super, le gameplay est plaisant, on se sent dans Seigneur des Anneaux, le système de rival des capitaines orcs est juste brillant et l'histoire est simple mais sympa.\n\nPour les complétistes, va falloir être motivés pour les défis qui sont chauds et pas très passionnants. Mais mis à part ça, rien de très notable, ça se fait sans trop de difficultés\n\nSi vous aimez Seigneur des Anneaux, ou si vous aimez juste les actions de jeux d'actions style Arkham / Spiderman / Assassin's Creed, franchement allez-y c'est sympa ! :-)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. You feel pretty invincible at a certain point, but that didn't make it any less fun. On to Shadow of War now!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Combat super similar to Batman Arkham games, but both a little more polished and easier. I think less jank just makes it easier. Can be a pain at times when multiple bosses attack at once, but otherwise really fun.\r\nShows its age a bit with the open world design choices, but still very good. As an unexpected benefit that means the map isn't quite as dense as open world games are nowadays and it has me tempted to 100% it, so not all bad. Story so far is good, but I have not had any exposure to LOTR before so take that with a grain of salt as I expected it to make no sense without consuming any of the other media.\r\nOverall, fun gameplay with an alright story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game with the fantastic Nemesis system. It's a real shame we haven't seen that system anywhere else yet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the combat, the story, the graphics, the nemesis system and so much more.\r\n\r\nMinus points for patenting the nemesis system and then proceeding to let it rot :/",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I personally LOVE this game, it runs amazing and personally awakened my love for the LOTR universe. If you enjoy Action / Adventure games or the Batman Arkham combat system for sure give it a shot. It also has a very unique mechanic that we sadly will probably never see in another game series ever....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the better game of the two. Does not hold your hand. More of a challenge. Each fight feels more rewarding then Shadow of War. Don't get me wrong, Shadow of War is still a great game no doubt about it. This just feels better to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game pretty easy difficulty \r\nCombat feels nice and fluid \r\nMovement is pretty clunky though\r\nStory is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the nemesis system has a unique, the arkham combat system is good and refreshing making the game not quick to stale. however there are many issues with the game like:\n\n- the issues with challenge modes. captains may turn to warchiefs making it impossible to complete the challenge\n\n- in the later game the intros before captain fights drag with no option to skip, you also are forced into them half the time. so a lot of the time you may be stuck into a high octane battle just to hit by a captain and locked into between 10 to 30 secs of cutscene. this also sucks because time still plays so sometimes another captain your fighting will be interrupted and decide to flee\n\n- there's not much of a power curve. this game feels more like a sandbox game or a tech demo of the nemesis system . you'll run around killing everything in 3 to 4 hits then have a fight with a captain. the story and ip feels like it was slapped on, the story is quick and weak and the characters placement makes little sense \n\noverall good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I always loved this game and couldn't wait for the shadow of war back then I've completed both games multiple times. And I've recently binge-watched solo-leveling for the second time and I thought oh this is the closest game that feels like kind of being in solo-leveling haha.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely fantastic, even years later. To be honest, it's much better than the second one imo. For an amazing combat system, wonderful graphics, great music, strong storywriting, and ofc the amazing nemesis system, its so worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is honestly one of the greatest games of all time if your into being an absolute bada** and taking down fugly orcs this game is peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Middle-earth: Shadow of Mordor Review[/h1]\n\n[hr]\n[h1]Overview[/h1]\nEven if you are not deep into Middle-earth lore, Shadow of Mordor is a very fun, very playable action game with a classic charm. Tight combat, a unique enemy system that makes fights personal, and a world that is easy to roam and grind in. I recommend it.\n\n[hr]\n[h1]What It Is[/h1]\nYou play as Talion, a ranger bound to the wraith Celebrimbor after tragedy strikes at the Black Gate. Together you hunt Uruk captains and warlords across Mordor, uncovering who pulled the strings and why, while your wraith powers grow and the Uruks remember every clash.\n\n[hr]\n[h1]World and Atmosphere[/h1]\nMordor is bleak but striking. Two large zones packed with forts, camps, and roaming warbands. It is fantasy-heavy and combat-forward, with lots of patrols to ambush and strongholds to crack. For 2014 the visuals hold up well, and the orc variety plus ambient chatter sell the setting.\n\n[hr]\n[h1]Combat and Abilities[/h1]\nIf you like Arkham-style fighting, you will click here fast. Strike to build combo, react to counters, finish, then chain executions and wraith skills. It starts simple and gets better as you unlock more moves, ranged bow shots, stealth tools, and crowd control. You can go full stealth, full brawler, or mix both on the fly.\n\n[hr]\n[h1]Nemesis System (The Secret Sauce)[/h1]\nUruks have names, traits, fears, and grudges. Captains who kill you rank up and taunt you later. You learn weaknesses, exploit them, then either execute or dominate to turn enemies into assets. This creates organic mini-stories and keeps encounters fresh in a way few games match.\n\n[hr]\n[h1]Story and Characters[/h1]\nPaced well and not too long. I liked it overall even without deep Lord of the Rings knowledge. Talion and Celebrimbor carry the plot, cutscenes are well acted, and the orc personalities land thanks to strong voice work and facial animation.\n\n[hr]\n[h1]Performance and Polish[/h1]\nRuns smoothly on modern PCs and current consoles. Facial animation and sync are still impressive. Occasional open-world repetition shows its age, but nothing critical.\n\n[hr]\n[h1]What Works[/h1]\n[list]\n[*] Addictive Arkham-like combat that expands as you progress\n[*] Nemesis system makes every death and victory matter\n[*] Lots of captain hunts and strongholds to pick apart your way\n[*] Surprising variety in orc traits and banter\n[*] Solid voice acting and cutscene presentation\n[/list]\n\n[hr]\n[h1]What Falls Short[/h1]\n[list]\n[*] Open-world activities can repeat if you chase everything\n[*] World detail is more functional than richly interactive\n[*] Some systems reveal their best tricks only after a few hours\n[/list]\n\n[hr]\n[h1]Verdict[/h1]\nThumbs up. Shadow of Mordor is a fast, satisfying power fantasy with memorable enemy dynamics. Even if Middle-earth lore is not your thing, the gameplay loop and Nemesis system make this an easy recommendation.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Like Assassin's Creed: Mordor. Runs great on OG Steam Deck, if a bit power hungry.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Just AMAZING! Its always fun to live in mordor and slay Uruks and Orcs Likewise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shadow of Mordor is basically “What if Assassin’s Creed let you terrorize orcs for fun?” You play as Talion, a ranger who’s very dead but also very alive, slicing through Mordor with a ghost buddy who treats revenge like a full-time job.\n\nThe real star is the Nemesis System, where every orc remembers when you embarrassed them, burned them, or yeeted them off a cliff — and they come back louder, angrier, and uglier every time. It feels like managing a roster of toxic coworkers, except you’re allowed to decapitate them.\n\nCombat is slick, traversal is smooth, and the orc drama is elite. The story is… there, but let’s be honest: you’re here to bully orcs until they start fear-screaming when they see you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I redid this 10 years after and now at 100%... absolutely worth it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An amazing adventure for any fans of lord of the rings who want to be in that world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is something cathartic about slicing an uruk's head off and watching it fly across the screen in slow motion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Udh lama tamat tapi baru sekarang bikin review wkwkw, jadi intinya ini game bagus dan sangat cinematic dan sistem nemesisnya adalah mekanik terbaik yg pernah ada dalam game ini dan ceritanya sngt epik walaupun menurut saya yg sebelum final bossnya dia agak kecepataan alurnya tapi untuk game yg sering diskon ini tetap memiliki kualitas yg bagus dan memanjakan para fans AAA Peminat story khususnya saya sendiri",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommend this game! Much better than 90% of the Assassins Creed games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Talion and Celembrimbor are wonderful characters and you can spend hours murdering orcs and it never gets old.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was sceptical about it since i`ve never played a stealth game likes this before. But during sales I got both Middle-Earth games for 7 bucks so I just thought \"why not?\". Not like there is a lot of money I would waste. Now I can say, best investment ever. If it wasn`t for this game, I would never have gotten into the stealth genre. Though calling it a stealth game propably isn`t correct either, it`s more like a toolbox kind of game. Here is the complete breakdown.\r\n\r\n1. Graphics. \r\nA bit dated considering it`s age but the art style is amazing, it really gives off a middle-earth feeling, dark yet beautiful. You really feel like you are in a Peter Jackson movie. The character designs in general are what you would expect from a Lord of the Rings game but where they really nailed it is the Orc and Uruk design. They all look dsictinct from each other with a lot of love for detail. Considering it`s age, this game looks great and still holds up. 9/10.\r\n\r\n2. \r\nStory. Not too much to write home about. It`s a generic middle-earth story concerning a dark master and rings. It`s loosley based on the Lord of the Rings but barely any characters are canon. It`s best to view this as a parallel universe story. Nothing that gets you too invested but good enough to drive you forward. 7/10.\r\n\r\n3. Gameplay.\r\nThis is what you are really playing this game for. It`s not like a hack x slash game at all, it`s a toolbox kind of combat system. The game gives you several ways of approaching combat and enemies. Shoot them from afar with your bow, sneak up on an enemy to assasinate him or directly confront him. Stealth is great because it can instantkill all mobs without having to engage them, which is especially great agains shielded enemies. The great thing though is, I`ve found myself using the entire arsenal throughout the game, none of the tools and skills are useless. You could try to handle and entire horde of Orcs and it`s definitely possible but very time consuming. Just shoot an arrow into a fire pit to let it explode. If you fance it, you can even grab enemies and throw them into the fire pit or just throw them off a cliff. As you progress, you unlock new skills that are very nice. Shadow Strike must be my favorite skill. Instantly teleport to an enemy to execute them and if you update it, you can even chain it. It`s a lot of fun to experiment and there is too much to explain it all in detail here. The Nemesis System is of course what people love the most about it. You can continue playing this game endlessly and it never gets boring. 10/10.\r\n\r\nOverall score: 9/10. If you are not sure if this kind of game is for you then buy it for 3 bucks during sales. If it`s not for you, you at least didn`t spend much money of it. But for the ones who like these kind of games, it will be your best deal ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Ah, maybe it's time to finish the game now, I remember getting frustrated at one point and stopped playing\"\n\nThat's a decade ago",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good orc slashing fun, shame the nemesis was flippin' patented...",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Love the Graphics and gameplay, best ever game to date 2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The main story might be short but the nemesis mechanic keeps everything fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DLC's are mid but the base game is amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game, Unfortunately games like this are no longer being produced.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can't believe they patented the Nemesis System and now no one will be able to use it ever again...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like mgsv (build army) but cyberpunk (man trapped in my head), but bg3, (fantasy rpg kind of)",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Extremely mid. The nemesis system is neat, but the rest of the game is incredibly bland. I love open world checklists, but not when the whole world is dreary and dull, with undetailed copy and pasted ruins everywhere, and only orcs to look at. No towns, no anything else. That is genuinely the entire game world, besides a couple caves. Not to mention a story that genuinely feels like fanfiction (I'm sorry, I know that's cliche to say), a protagonist that's a generic muscle cool man, and possibly the most anticlimactic final two bosses in recent memory. I could only recommend if you really wanna fight some orcs, and nothing else, for about 15 hours. \r\n\r\nThat said, it's fine. I had some fun in there. But it feels like a proof of concept. I hope the sequel is better and I will be playing it, because I had so much higher hopes!",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "The gamepad interaction is kinda dull. I have a Steam-compatible gamepad and the maneuvering of Talion (main character) feels laggy. Also, when using the right stick to control the camera view, it is either too slow or too fast independently of how you adjust the settings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Parts of the game are a lot of fun, usually when you're hunting and branding captains. Unfortuantely the rest of your time is spent of simple, dull, and short story missions. I would venture a guess that most of the game is supposed to be drawn out by all typical kinds of busy work you'd expect in an assassin's creed-esque title. \r\n\r\nThe bosses were also a let-down because there's not much to fight; most of the time it seems to resolve into a few set-piece encounters or QTE's. \r\n\r\nAll-in-all I would say this LOTR game is decent for the unique mechanic offered, but you can't expect all that much else out of it. Rather short game, with not a lot worth doing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has a couple of missions and some enemies that have a difficulty spike that goes way to far beyond what the rest of the game is at and went from being fun to being a load of frustration. Don't know if I am going to be able to beat the game since some of the bosses I need to brain fry to proceed to the end game have skills that prevent all forms of combat, there's 4 of them in a group and they never separate.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely not fun - the story is nonexistent. The shtick is just twitchy run here, run there, don't take in anything, spazz out and button mash for combat.\n\nIt's a waste of time, there's no value and there's nothing to take away from this game. It absolutely isn't relaxing either, so there's just nothing there for it. \n\nI gave it every possible chance - only have 33 hours across years of owning it. It's just a black hole for whatever little time you spend on it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After 10 hours I don't get it why I should continue playing.\nThe storyline is ok, I guess, there is a mystery behind this elf, but not really interesting for me.\nThe gameplay is very repetitive. Batman series has the same combat system and for some reason I like it more, maybe it looks more impressive\nThe nemesis system. I don't understand why should I like it) for me it is ok that we have it, but I can't say that this system changes a game drastically\nMaybe I'll give it a second chance. But only when I feel like I've had a rest from the repetitive combat",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Garbage game. You press the button it tells you to press and you die. You follow the instructions and the game doesnt respond correctly. Multiple places with this issue. With how old this game is this should not be an issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You'll enjoy yourself far more playing The Lord of the Rings: Conquest which came out in 2009..\nMiddle-earth™: Shadow of Mordor™ is boring and repetitive compared to LOTR: Conquest... The RPG elements for me personally are totally missing, and the combat is repetitive AF to the point it becomes boring in a few hours.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Never ending enemies that interrupt you whenever you get a chance at a finishing move. just a time waster. Its not a fight, its you getting mobbed, you'll press buttons trying to make head way on a measly 10 enemies but you can't because of the constant interruptions. you're basically just filling up an insta kill bar to finally take one out. but that doesnt matter either because another Uruk will just wander into the ruckus from off screen. There is a mission where you have to kill 35 trainee Uruks, good luck and enjoy the carpal tunnel and frustration.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fuck this game. Just get mobbed by bosses.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i found it rather boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely mid. The nemesis system is neat, but the rest of the game is incredibly bland. I love open world checklists, but not when the whole world is dreary and dull, with undetailed copy and pasted ruins everywhere, and only orcs to look at. No towns, no anything else. That is genuinely the entire game world, besides a couple caves. Not to mention a story that genuinely feels like fanfiction (I'm sorry, I know that's cliche to say), a protagonist that's a generic muscle cool man, and possibly the most anticlimactic final two bosses in recent memory. I could only recommend if you really wanna fight some orcs, and nothing else, for about 15 hours. \r\n\r\nThat said, it's fine. I had some fun in there. But it feels like a proof of concept. I hope the sequel is better and I will be playing it, because I had so much higher hopes!",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "SPOILERS ALERT. Game is fun for a short-running game. I actually like the fact that it's somewhat of a sandbox, nonstop action game but at the same time it lacks depth in story telling. The gameplay is its biggest strength, it has a very innovative nemesis system, combat is pretty fun and you feel powerful when unlocking each talent (Though it deserves more polishing). Graphics looks mid for its time so it really isn't the greatest looking game.\n\n[spoiler] Unfortunately the ending feels rushed, each 'boss' turned lazily made one after another especially up to the end. There wasn't even a final boss fight, just a sequence of quick time events that you need to watch, which is a bummer because there is so much potential in the combat mechanics that could have made an interesting well designed boss fight.[/spoiler]\n\nEDIT: When I heard that warner bros PATENTED the nemesis system, and has shut down monolith games as a 'strategic decision\", I changed this review from positive to negative since I heavily disagree with their company's practice.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cool to get immersed in the LOTR world again, but the storyline is super weak and the quests are very repetitive. More than anything, it's super janky and annoying to play because the camera or the moving buttons just stop working randomly or the response slows down.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The gamepad interaction is kinda dull. I have a Steam-compatible gamepad and the maneuvering of Talion (main character) feels laggy. Also, when using the right stick to control the camera view, it is either too slow or too fast independently of how you adjust the settings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Parts of the game are a lot of fun, usually when you're hunting and branding captains. Unfortuantely the rest of your time is spent of simple, dull, and short story missions. I would venture a guess that most of the game is supposed to be drawn out by all typical kinds of busy work you'd expect in an assassin's creed-esque title. \r\n\r\nThe bosses were also a let-down because there's not much to fight; most of the time it seems to resolve into a few set-piece encounters or QTE's. \r\n\r\nAll-in-all I would say this LOTR game is decent for the unique mechanic offered, but you can't expect all that much else out of it. Rather short game, with not a lot worth doing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has a couple of missions and some enemies that have a difficulty spike that goes way to far beyond what the rest of the game is at and went from being fun to being a load of frustration. Don't know if I am going to be able to beat the game since some of the bosses I need to brain fry to proceed to the end game have skills that prevent all forms of combat, there's 4 of them in a group and they never separate.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely not fun - the story is nonexistent. The shtick is just twitchy run here, run there, don't take in anything, spazz out and button mash for combat.\n\nIt's a waste of time, there's no value and there's nothing to take away from this game. It absolutely isn't relaxing either, so there's just nothing there for it. \n\nI gave it every possible chance - only have 33 hours across years of owning it. It's just a black hole for whatever little time you spend on it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After 10 hours I don't get it why I should continue playing.\nThe storyline is ok, I guess, there is a mystery behind this elf, but not really interesting for me.\nThe gameplay is very repetitive. Batman series has the same combat system and for some reason I like it more, maybe it looks more impressive\nThe nemesis system. I don't understand why should I like it) for me it is ok that we have it, but I can't say that this system changes a game drastically\nMaybe I'll give it a second chance. But only when I feel like I've had a rest from the repetitive combat",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Garbage game. You press the button it tells you to press and you die. You follow the instructions and the game doesnt respond correctly. Multiple places with this issue. With how old this game is this should not be an issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You'll enjoy yourself far more playing The Lord of the Rings: Conquest which came out in 2009..\nMiddle-earth™: Shadow of Mordor™ is boring and repetitive compared to LOTR: Conquest... The RPG elements for me personally are totally missing, and the combat is repetitive AF to the point it becomes boring in a few hours.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Never ending enemies that interrupt you whenever you get a chance at a finishing move. just a time waster. Its not a fight, its you getting mobbed, you'll press buttons trying to make head way on a measly 10 enemies but you can't because of the constant interruptions. you're basically just filling up an insta kill bar to finally take one out. but that doesnt matter either because another Uruk will just wander into the ruckus from off screen. There is a mission where you have to kill 35 trainee Uruks, good luck and enjoy the carpal tunnel and frustration.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fuck this game. Just get mobbed by bosses.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i found it rather boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely mid. The nemesis system is neat, but the rest of the game is incredibly bland. I love open world checklists, but not when the whole world is dreary and dull, with undetailed copy and pasted ruins everywhere, and only orcs to look at. No towns, no anything else. That is genuinely the entire game world, besides a couple caves. Not to mention a story that genuinely feels like fanfiction (I'm sorry, I know that's cliche to say), a protagonist that's a generic muscle cool man, and possibly the most anticlimactic final two bosses in recent memory. I could only recommend if you really wanna fight some orcs, and nothing else, for about 15 hours. \r\n\r\nThat said, it's fine. I had some fun in there. But it feels like a proof of concept. I hope the sequel is better and I will be playing it, because I had so much higher hopes!",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "SPOILERS ALERT. Game is fun for a short-running game. I actually like the fact that it's somewhat of a sandbox, nonstop action game but at the same time it lacks depth in story telling. The gameplay is its biggest strength, it has a very innovative nemesis system, combat is pretty fun and you feel powerful when unlocking each talent (Though it deserves more polishing). Graphics looks mid for its time so it really isn't the greatest looking game.\n\n[spoiler] Unfortunately the ending feels rushed, each 'boss' turned lazily made one after another especially up to the end. There wasn't even a final boss fight, just a sequence of quick time events that you need to watch, which is a bummer because there is so much potential in the combat mechanics that could have made an interesting well designed boss fight.[/spoiler]\n\nEDIT: When I heard that warner bros PATENTED the nemesis system, and has shut down monolith games as a 'strategic decision\", I changed this review from positive to negative since I heavily disagree with their company's practice.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cool to get immersed in the LOTR world again, but the storyline is super weak and the quests are very repetitive. More than anything, it's super janky and annoying to play because the camera or the moving buttons just stop working randomly or the response slows down.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is okay, but by todays standards it has not aged very well. It uses the batman combat systems, which has you spam attack button until an icon to block appears and you spam that, and you auto aim onto every enemy and just repeat, very borning combat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "+ still quite pretty\n+ character - [spoiler] gollum [/spoiler]👍\n+ not only orcs but also Caragors/Graugs you can mount\n+ skill tree, but eventually I feel like you gonna use only two abilites \n\n- tedious and repetitive gameplay\n- boss fights were disappointing\n- you cannot skip the dialogues before every captain/warchief encounter\n- unplayable (imo) without controller...\n- ...character tends to do things that you wouldn't like to do, why would I want to use execute ability on a branded orc when there is an enemy right next to him?? climbing the walls was also a pain\n- the arkham battle system, felt better in batman\n- [spoiler] when all of the captains are branded/dead, you simply lose the ability to instant kill branded captain [/spoiler]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gamepad interaction is kinda dull. I have a Steam-compatible gamepad and the maneuvering of Talion (main character) feels laggy. Also, when using the right stick to control the camera view, it is either too slow or too fast independently of how you adjust the settings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Parts of the game are a lot of fun, usually when you're hunting and branding captains. Unfortuantely the rest of your time is spent of simple, dull, and short story missions. I would venture a guess that most of the game is supposed to be drawn out by all typical kinds of busy work you'd expect in an assassin's creed-esque title. \r\n\r\nThe bosses were also a let-down because there's not much to fight; most of the time it seems to resolve into a few set-piece encounters or QTE's. \r\n\r\nAll-in-all I would say this LOTR game is decent for the unique mechanic offered, but you can't expect all that much else out of it. Rather short game, with not a lot worth doing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has a couple of missions and some enemies that have a difficulty spike that goes way to far beyond what the rest of the game is at and went from being fun to being a load of frustration. Don't know if I am going to be able to beat the game since some of the bosses I need to brain fry to proceed to the end game have skills that prevent all forms of combat, there's 4 of them in a group and they never separate.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely not fun - the story is nonexistent. The shtick is just twitchy run here, run there, don't take in anything, spazz out and button mash for combat.\n\nIt's a waste of time, there's no value and there's nothing to take away from this game. It absolutely isn't relaxing either, so there's just nothing there for it. \n\nI gave it every possible chance - only have 33 hours across years of owning it. It's just a black hole for whatever little time you spend on it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Stopped working after my Windows 11 install. Waste of money unfortunately.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You'll enjoy yourself far more playing The Lord of the Rings: Conquest which came out in 2009..\nMiddle-earth™: Shadow of Mordor™ is boring and repetitive compared to LOTR: Conquest... The RPG elements for me personally are totally missing, and the combat is repetitive AF to the point it becomes boring in a few hours.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Never ending enemies that interrupt you whenever you get a chance at a finishing move. just a time waster. Its not a fight, its you getting mobbed, you'll press buttons trying to make head way on a measly 10 enemies but you can't because of the constant interruptions. you're basically just filling up an insta kill bar to finally take one out. but that doesnt matter either because another Uruk will just wander into the ruckus from off screen. There is a mission where you have to kill 35 trainee Uruks, good luck and enjoy the carpal tunnel and frustration.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fuck this game. Just get mobbed by bosses.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After you play Shadow of War, you just can't go back to this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i found it rather boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "🐷",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely mid. The nemesis system is neat, but the rest of the game is incredibly bland. I love open world checklists, but not when the whole world is dreary and dull, with undetailed copy and pasted ruins everywhere, and only orcs to look at. No towns, no anything else. That is genuinely the entire game world, besides a couple caves. Not to mention a story that genuinely feels like fanfiction (I'm sorry, I know that's cliche to say), a protagonist that's a generic muscle cool man, and possibly the most anticlimactic final two bosses in recent memory. I could only recommend if you really wanna fight some orcs, and nothing else, for about 15 hours. \r\n\r\nThat said, it's fine. I had some fun in there. But it feels like a proof of concept. I hope the sequel is better and I will be playing it, because I had so much higher hopes!",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "SPOILERS ALERT. Game is fun for a short-running game. I actually like the fact that it's somewhat of a sandbox, nonstop action game but at the same time it lacks depth in story telling. The gameplay is its biggest strength, it has a very innovative nemesis system, combat is pretty fun and you feel powerful when unlocking each talent (Though it deserves more polishing). Graphics looks mid for its time so it really isn't the greatest looking game.\n\n[spoiler] Unfortunately the ending feels rushed, each 'boss' turned lazily made one after another especially up to the end. There wasn't even a final boss fight, just a sequence of quick time events that you need to watch, which is a bummer because there is so much potential in the combat mechanics that could have made an interesting well designed boss fight.[/spoiler]\n\nEDIT: When I heard that warner bros PATENTED the nemesis system, and has shut down monolith games as a 'strategic decision\", I changed this review from positive to negative since I heavily disagree with their company's practice.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cool to get immersed in the LOTR world again, but the storyline is super weak and the quests are very repetitive. More than anything, it's super janky and annoying to play because the camera or the moving buttons just stop working randomly or the response slows down.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is okay, but by todays standards it has not aged very well. It uses the batman combat systems, which has you spam attack button until an icon to block appears and you spam that, and you auto aim onto every enemy and just repeat, very borning combat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "+ still quite pretty\n+ character - [spoiler] gollum [/spoiler]👍\n+ not only orcs but also Caragors/Graugs you can mount\n+ skill tree, but eventually I feel like you gonna use only two abilites \n\n- tedious and repetitive gameplay\n- boss fights were disappointing\n- you cannot skip the dialogues before every captain/warchief encounter\n- unplayable (imo) without controller...\n- ...character tends to do things that you wouldn't like to do, why would I want to use execute ability on a branded orc when there is an enemy right next to him?? climbing the walls was also a pain\n- the arkham battle system, felt better in batman\n- [spoiler] when all of the captains are branded/dead, you simply lose the ability to instant kill branded captain [/spoiler]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gamepad interaction is kinda dull. I have a Steam-compatible gamepad and the maneuvering of Talion (main character) feels laggy. Also, when using the right stick to control the camera view, it is either too slow or too fast independently of how you adjust the settings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Parts of the game are a lot of fun, usually when you're hunting and branding captains. Unfortuantely the rest of your time is spent of simple, dull, and short story missions. I would venture a guess that most of the game is supposed to be drawn out by all typical kinds of busy work you'd expect in an assassin's creed-esque title. \r\n\r\nThe bosses were also a let-down because there's not much to fight; most of the time it seems to resolve into a few set-piece encounters or QTE's. \r\n\r\nAll-in-all I would say this LOTR game is decent for the unique mechanic offered, but you can't expect all that much else out of it. Rather short game, with not a lot worth doing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has a couple of missions and some enemies that have a difficulty spike that goes way to far beyond what the rest of the game is at and went from being fun to being a load of frustration. Don't know if I am going to be able to beat the game since some of the bosses I need to brain fry to proceed to the end game have skills that prevent all forms of combat, there's 4 of them in a group and they never separate.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely not fun - the story is nonexistent. The shtick is just twitchy run here, run there, don't take in anything, spazz out and button mash for combat.\n\nIt's a waste of time, there's no value and there's nothing to take away from this game. It absolutely isn't relaxing either, so there's just nothing there for it. \n\nI gave it every possible chance - only have 33 hours across years of owning it. It's just a black hole for whatever little time you spend on it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Stopped working after my Windows 11 install. Waste of money unfortunately.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You'll enjoy yourself far more playing The Lord of the Rings: Conquest which came out in 2009..\nMiddle-earth™: Shadow of Mordor™ is boring and repetitive compared to LOTR: Conquest... The RPG elements for me personally are totally missing, and the combat is repetitive AF to the point it becomes boring in a few hours.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Never ending enemies that interrupt you whenever you get a chance at a finishing move. just a time waster. Its not a fight, its you getting mobbed, you'll press buttons trying to make head way on a measly 10 enemies but you can't because of the constant interruptions. you're basically just filling up an insta kill bar to finally take one out. but that doesnt matter either because another Uruk will just wander into the ruckus from off screen. There is a mission where you have to kill 35 trainee Uruks, good luck and enjoy the carpal tunnel and frustration.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fuck this game. Just get mobbed by bosses.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After you play Shadow of War, you just can't go back to this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i found it rather boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "🐷",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely mid. The nemesis system is neat, but the rest of the game is incredibly bland. I love open world checklists, but not when the whole world is dreary and dull, with undetailed copy and pasted ruins everywhere, and only orcs to look at. No towns, no anything else. That is genuinely the entire game world, besides a couple caves. Not to mention a story that genuinely feels like fanfiction (I'm sorry, I know that's cliche to say), a protagonist that's a generic muscle cool man, and possibly the most anticlimactic final two bosses in recent memory. I could only recommend if you really wanna fight some orcs, and nothing else, for about 15 hours. \r\n\r\nThat said, it's fine. I had some fun in there. But it feels like a proof of concept. I hope the sequel is better and I will be playing it, because I had so much higher hopes!",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "SPOILERS ALERT. Game is fun for a short-running game. I actually like the fact that it's somewhat of a sandbox, nonstop action game but at the same time it lacks depth in story telling. The gameplay is its biggest strength, it has a very innovative nemesis system, combat is pretty fun and you feel powerful when unlocking each talent (Though it deserves more polishing). Graphics looks mid for its time so it really isn't the greatest looking game.\n\n[spoiler] Unfortunately the ending feels rushed, each 'boss' turned lazily made one after another especially up to the end. There wasn't even a final boss fight, just a sequence of quick time events that you need to watch, which is a bummer because there is so much potential in the combat mechanics that could have made an interesting well designed boss fight.[/spoiler]\n\nEDIT: When I heard that warner bros PATENTED the nemesis system, and has shut down monolith games as a 'strategic decision\", I changed this review from positive to negative since I heavily disagree with their company's practice.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cool to get immersed in the LOTR world again, but the storyline is super weak and the quests are very repetitive. More than anything, it's super janky and annoying to play because the camera or the moving buttons just stop working randomly or the response slows down.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is okay, but by todays standards it has not aged very well. It uses the batman combat systems, which has you spam attack button until an icon to block appears and you spam that, and you auto aim onto every enemy and just repeat, very borning combat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "+ still quite pretty\n+ character - [spoiler] gollum [/spoiler]👍\n+ not only orcs but also Caragors/Graugs you can mount\n+ skill tree, but eventually I feel like you gonna use only two abilites \n\n- tedious and repetitive gameplay\n- boss fights were disappointing\n- you cannot skip the dialogues before every captain/warchief encounter\n- unplayable (imo) without controller...\n- ...character tends to do things that you wouldn't like to do, why would I want to use execute ability on a branded orc when there is an enemy right next to him?? climbing the walls was also a pain\n- the arkham battle system, felt better in batman\n- [spoiler] when all of the captains are branded/dead, you simply lose the ability to instant kill branded captain [/spoiler]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gamepad interaction is kinda dull. I have a Steam-compatible gamepad and the maneuvering of Talion (main character) feels laggy. Also, when using the right stick to control the camera view, it is either too slow or too fast independently of how you adjust the settings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Parts of the game are a lot of fun, usually when you're hunting and branding captains. Unfortuantely the rest of your time is spent of simple, dull, and short story missions. I would venture a guess that most of the game is supposed to be drawn out by all typical kinds of busy work you'd expect in an assassin's creed-esque title. \r\n\r\nThe bosses were also a let-down because there's not much to fight; most of the time it seems to resolve into a few set-piece encounters or QTE's. \r\n\r\nAll-in-all I would say this LOTR game is decent for the unique mechanic offered, but you can't expect all that much else out of it. Rather short game, with not a lot worth doing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has a couple of missions and some enemies that have a difficulty spike that goes way to far beyond what the rest of the game is at and went from being fun to being a load of frustration. Don't know if I am going to be able to beat the game since some of the bosses I need to brain fry to proceed to the end game have skills that prevent all forms of combat, there's 4 of them in a group and they never separate.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely not fun - the story is nonexistent. The shtick is just twitchy run here, run there, don't take in anything, spazz out and button mash for combat.\n\nIt's a waste of time, there's no value and there's nothing to take away from this game. It absolutely isn't relaxing either, so there's just nothing there for it. \n\nI gave it every possible chance - only have 33 hours across years of owning it. It's just a black hole for whatever little time you spend on it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Stopped working after my Windows 11 install. Waste of money unfortunately.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You'll enjoy yourself far more playing The Lord of the Rings: Conquest which came out in 2009..\nMiddle-earth™: Shadow of Mordor™ is boring and repetitive compared to LOTR: Conquest... The RPG elements for me personally are totally missing, and the combat is repetitive AF to the point it becomes boring in a few hours.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Never ending enemies that interrupt you whenever you get a chance at a finishing move. just a time waster. Its not a fight, its you getting mobbed, you'll press buttons trying to make head way on a measly 10 enemies but you can't because of the constant interruptions. you're basically just filling up an insta kill bar to finally take one out. but that doesnt matter either because another Uruk will just wander into the ruckus from off screen. There is a mission where you have to kill 35 trainee Uruks, good luck and enjoy the carpal tunnel and frustration.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fuck this game. Just get mobbed by bosses.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After you play Shadow of War, you just can't go back to this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i found it rather boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "🐷",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely mid. The nemesis system is neat, but the rest of the game is incredibly bland. I love open world checklists, but not when the whole world is dreary and dull, with undetailed copy and pasted ruins everywhere, and only orcs to look at. No towns, no anything else. That is genuinely the entire game world, besides a couple caves. Not to mention a story that genuinely feels like fanfiction (I'm sorry, I know that's cliche to say), a protagonist that's a generic muscle cool man, and possibly the most anticlimactic final two bosses in recent memory. I could only recommend if you really wanna fight some orcs, and nothing else, for about 15 hours. \r\n\r\nThat said, it's fine. I had some fun in there. But it feels like a proof of concept. I hope the sequel is better and I will be playing it, because I had so much higher hopes!",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "SPOILERS ALERT. Game is fun for a short-running game. I actually like the fact that it's somewhat of a sandbox, nonstop action game but at the same time it lacks depth in story telling. The gameplay is its biggest strength, it has a very innovative nemesis system, combat is pretty fun and you feel powerful when unlocking each talent (Though it deserves more polishing). Graphics looks mid for its time so it really isn't the greatest looking game.\n\n[spoiler] Unfortunately the ending feels rushed, each 'boss' turned lazily made one after another especially up to the end. There wasn't even a final boss fight, just a sequence of quick time events that you need to watch, which is a bummer because there is so much potential in the combat mechanics that could have made an interesting well designed boss fight.[/spoiler]\n\nEDIT: When I heard that warner bros PATENTED the nemesis system, and has shut down monolith games as a 'strategic decision\", I changed this review from positive to negative since I heavily disagree with their company's practice.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cool to get immersed in the LOTR world again, but the storyline is super weak and the quests are very repetitive. More than anything, it's super janky and annoying to play because the camera or the moving buttons just stop working randomly or the response slows down.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is okay, but by todays standards it has not aged very well. It uses the batman combat systems, which has you spam attack button until an icon to block appears and you spam that, and you auto aim onto every enemy and just repeat, very borning combat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "+ still quite pretty\n+ character - [spoiler] gollum [/spoiler]👍\n+ not only orcs but also Caragors/Graugs you can mount\n+ skill tree, but eventually I feel like you gonna use only two abilites \n\n- tedious and repetitive gameplay\n- boss fights were disappointing\n- you cannot skip the dialogues before every captain/warchief encounter\n- unplayable (imo) without controller...\n- ...character tends to do things that you wouldn't like to do, why would I want to use execute ability on a branded orc when there is an enemy right next to him?? climbing the walls was also a pain\n- the arkham battle system, felt better in batman\n- [spoiler] when all of the captains are branded/dead, you simply lose the ability to instant kill branded captain [/spoiler]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gamepad interaction is kinda dull. I have a Steam-compatible gamepad and the maneuvering of Talion (main character) feels laggy. Also, when using the right stick to control the camera view, it is either too slow or too fast independently of how you adjust the settings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Parts of the game are a lot of fun, usually when you're hunting and branding captains. Unfortuantely the rest of your time is spent of simple, dull, and short story missions. I would venture a guess that most of the game is supposed to be drawn out by all typical kinds of busy work you'd expect in an assassin's creed-esque title. \r\n\r\nThe bosses were also a let-down because there's not much to fight; most of the time it seems to resolve into a few set-piece encounters or QTE's. \r\n\r\nAll-in-all I would say this LOTR game is decent for the unique mechanic offered, but you can't expect all that much else out of it. Rather short game, with not a lot worth doing.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}