{
  "positive": [
    {
      "review": "They did it. I thought it wasn't possible nowadays, but they managed to prove me wrong. They had already made Horizon Zero Dawn an extraordinary game, but they did even better.\n\n[h2][b]Graphics[/b][/h2]\nStunning from start to finish, from lush jungles and sun-drenched coastlines to ruined, overgrown cities and underwater depths teeming with life.\n\nThe level of detail in facial expressions, machines, and atmospheric effects is breathtaking. In my opinion, it's one of the most beautiful games ever released.\n\nEach new region is a living painting. Diverse, vibrant, and meticulously constructed.\n\n[h2][b]Story[/b][/h2]\nThe narrative continues Aloy's journey after the events of the first game. Now, her goal is to explore the Forbidden West and find a way to stop a mysterious plague that threatens to destroy all life.\n\nThe story is more ambitious, expanding the world and introducing new tribes, cultures, and characters with complex motivations.\n\nSometimes, it gets a little lost in technological explanations and dense mythology, but it maintains a strong human heart.\nAloy remains a charismatic and determined protagonist, but also shows enormous evolution compared to the first game.\nThe side missions are on a much higher level than in the first game, where many are true little stories with memorable characters and palpable consequences.\n\n[h2][b]Gameplay[/b][/h2]\nThe gameplay has evolved and refined. Combat maintains the same balance between action and strategy, but with more options, weapons, and tactics.\nThe new machines are challenging and visibly distinct, each requiring a different approach and rewarding planning.\nBeyond the improvements in climbing, it's now possible to swim at depth, use the glider, and even fly, giving a new freedom to exploration.\nMelee combat has been improved, but still falls short of the thrill of confrontations with machines.\n\nBut resource gathering and crafting remain somewhat repetitive and very tedious, especially in the later stages, not to mention the excessive resources needed to obtain certain things.\n\n[h2][b]Soundtrack[/b][/h2]\nAnother masterpiece of sound design. The music maintains the identity of the first game, but with even richer and more emotional themes.\n\nThe soundtrack perfectly accompanies each moment, from the serenity of exploration to the most intense battles.\nComposers Joris de Man, The Flight, and Niels van der Leest once again deliver exemplary work.\n\n[h2][b]Conclusion[/b][/h2]\nHorizon Forbidden West is an exemplary sequel: it expands on everything the original did well and takes the experience to new heights, literally.\n\nVisually stunning, mechanically refined, and narratively ambitious, it's a game that showcases the best that the open-world genre has to offer.\n\nThe Burning Shores DLC delivers to fans at the end something that only seemed theoretical in the first game, which only shows how much the world of video games has evolved.\n\nDespite some excess of side quests and an uneven narrative pace at certain stages, it's an unforgettable adventure and an impressive technical achievement.\n\nGuerrilla Games has mastered its craft and proves to be a threat to certain industry giants.",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "Almost as amazing as its predecessor. Amazing story and very good gameplay. DLC was nice too. Not as good as Frozen Wilds, but still kinda awesome with over the top final boss fight. If there is something i dislike about the game it must be how bad the hit registration feel. For a game with a bows as weapons and basically having to hit weak points it sure does feel off.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Good Game - with some drawbacks. I thoroughly enjoyed the first Game because it had some great character moments and an interesting story set in a new kind of world. We still have an engaging story, and the world is getting even bigger and more beautiful. The Play with elevations and some of the new mechanics are a great addition and the Side Quests are again crafted with a lot of care.\n\nMy issue is with some of the Dialogue and particularly Aloys Character. I feel like she has regressed and we are repeating her character arc, but she is even more insufferable. In the end the other characters are kind of saving the story, but it still leaves a bad taste in my mouth. And I personally know people that stopped playing the game because of that - before they even left the first open-world area. Which is a real shame because the game really finds itself after that.\n\nSo if you are reading this, pondering whether to buy or not buy this game: Buy it on a sale and keep in mind that it will get better the longer you play.\n\nI hope Guerilla takes note of the critical voices and works on the Dialogue and general flow of the next game because I would hate for the third instalment to have the same weaknesses.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "If you liked the first game, Horizon Zero Dawn, you will like this game as well.\r\n\r\nThey've improved on almost every aspect of the first game. The visuals are stunning, and they've made the animations and characters less stiff and much more natural. They've even gave Aloy a bit of a personality and a bit of an attitude as well which made her stand out much more as a main character.\r\n\r\nOf course, the mystery and discovery of the first game is no longer prevalent as you already know why the world is the way it is and who Aloy is as well. This isn't the fault of this game of course, as with all sequels, that initial world building experience is done. Hence the story can be considered weaker in this sequel vs the first game. They do make up for it in what I would call the Mass Effect experience. No longer is Aloy the only character in the game - you will also learn a lot more about side characters as you help them solve their problems, and they yours in return.\r\n\r\nSome minor bugs with occasional overlapping voice conversations, or out of order conversations or voice lines. Climbing is also a bit more restrictive as well, with occasion glitch in what's allowed or not. They changed the latter due to a new mechanic in the game, but it's not quite right. Aloy has a habit of thinking aloud as well, which is suppose to be a way to give hints to the player. But it's always very odd where she thinks one thing, and then does something completely different since the player is the one in control.\r\n\r\nAll in all, this game along with the first game had become one of my favourite games of all time. I just don't know what they will do in the future. There's only so much you can do with bows and arrows. Also, how many rocks can Aloy carry. :D",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "great game as the last one, as expected to be honest",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Absurdly entertaining, compelling story, nice controls, Aloy!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I really enjoyed this game. Although there are some minor caveats, it does improve a lot on the first entry. The story is great, and it's nice to see the character arc of Aloy and the stuff she learns (about herself). It's also cool to see that stuff carry over to the Burning Shores. The DLC was great, especially the final mission. Aloy is one lucky gal *wink* :3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy the mass amount of side quests, but the amount of false peaks in this game is insane. Definitely holds my attention. Would recommend for a nice open world long term game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "From main quest to side quests, I enjoyed exploring every tribe and listening to every story. Beautiful. The traversal, the \r\n[spoiler] Waterwing ugh I love it [/spoiler], and the gameplay slapped. \r\n\r\nZero Dawn was great, but Forbidden West is even greater. \r\n\r\nThe Apex machines did not feel very Apex-y to me. But hey, I tore off components like a mf and it got me to places. Worth every tear precision arrow tbh. \r\n\r\nAloy x Avad forever.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best looking game Ive played since Cyberpunk but with way better cutscenes, immersive storytelling, action is fun and being able to toggle loot options is an amazing feature",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've never had quite such a pronounced love-hate relationship with a single game. While HFW is a triumphant return to the even-more-beautiful world of Horizon, it's marred by a misguided attempt to add more mechanics that ends up with bloated, tepid gear and skill trees.  The world, characters, and most of the combat are all in the outstanding vein of the first game. There are moments of pure joy and wonder when all the elements combine perfectly.  But there are also many occasions of disappointment and frustration when it comes to the mechanics, especially compared to those of the first game.  (BTW, there's really no point in playing this game without first playing Zero Dawn unless you have no interest at all in the story.)  As you can tell from my time played, I did enjoy the game enough to complete it, including all the side content other than the Arena, but some of the terrible design choices made me question whether to proceed at times.\r\n\r\nHmmm.... Seems like my usual list of good, bad, and ugly points is 7383 characters too long, so I'll just summarise the first two categories...\r\n\r\n-- THE GOOD --\r\n- The world, characters, acting, sound effects, and music.  Especially the detailed and varied environment. \r\n- Story is pretty good, but not as good as in the first game.\r\n- Mounted travel feels and sounds just right\r\n\r\n-- THE BAD --\r\n- Disappointing gear: meagre bonuses are usually cancelled out by significant weaknesses, such that acquiring new gear never felt very awesome.\r\n- Nerfed weapons from the first game, making tripcaster and ropecaster almost useless\r\n- Unnecessarily complex and unreliable new melee mechanics\r\n- Aloy gets stuck on the smallest bit of terrain waaayyyyy too often, yet when you want her to stop and search a machine part she leaps over it with the agility of a gazelle\r\n\r\n-- THE UGLY --\r\n- Unlike in the first game, where every skill was significant and useful, many of the skills available in HFW are either 'meh' or 'why would I even want that?' With the way the tree is arranged, in many cases you are forced to take skills you don't want in order to get to the few that you might find useful.  And some seem downright insulting, like a reduction in damage if you trigger your own traps, or increased ammo amounts if you craft it only at a workbench.  Plus, there are no skills for several things you really could use, like a better dodge or getting up faster when knocked down in combat.  Speaking of which...\r\n- Aloy takes about three months to get up after being knocked down in combat (which happens all too frequently).  Machine fights are much less fun than they were in HZD, because Aloy is much, much less agile while even the largest machines are vastly more nimble.  Oh and her dodge is less effective as well.  I ended up long-distance sniping most encounters to avoid this de-evolution.\r\n- Many crashes to desktop claiming driver update required - tried all the solutions suggested on the web (drivers were already updated, tried rollback, increasing shader cache size, removing temp files and verifying game files, etc) to no avail. Oddly it was primarily when not much was happening or the game was actually paused, rather than during any intense graphics-oriented action.\r\n- Some of the arena fights are ludicrously difficult, especially because of the pre-selected gear, the confined space, and Aloy's 'I've fallen and I can't get up' act.  Looking on the internet, it seems that these are 'puzzle fights' where you must win using the One Solution with a strict sequence of actions in a very short amount of time. A really sad aberration, given the normally quite flexible combat system.  And these are all presented sequentially, so you can't skip a fight to see what the next one is like.  The complete lack of fun for me here meant that some of the best weapons were locked away out of my reach.\r\n- New melee combat moves that require precise timing that is almost impossible to achieve in actual combat when dodging is necessary. And there are so many of these new moves that it feels like memorising an entire Morse Code alphabet ('Was that short-short-pause-long or short-pause-short-long?').  It's nice that there are practice grounds for trying these out, but honestly almost every time I completed a training challenge I knew that would be the last time I ever tried that move.  Luckily (but also sadly) one can complete the game with almost no melee combat.\r\n- Machine resources that have only a small percentage chance of dropping and can't be harvested through careful targeting. Aren't there tons of memes and videos from the past several decades of gaming demonstrating how everyone finds this silly and annoying?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "So this games final boss fight has led me to do my first review! (Will update it once i defeat it!)( Difficulty - ultra hard)  \n\nbut since i had got 100+ hours on the game i thought it would be a fair review.\n\nSo the good things \n-Beautiful world and immersive (on a 4070 super), really enjoyed doing the side quest aswell as the ruins and metal flowers. In addition, the black boxes really do add to the feel of the impending doom the world was facing at the time.\n- story is great - they really build on  the lore from the first game (please play that before this!) and it really does go a way for the different tribes aswell as just the voice notes you get. \n\nThe bad\n- Id hope theyd improve the movement of aloy but i do not know whether it is due to the difficulty im on, but it feels she gets alot more stuck on enviroment which can be hell when your doing a boss battle/cauldron runs, they need to make it less frenquent. \n- I dont know why but ive gotten into way more glitches than i should do, especially when im grinding for parts - machines glitching in the walls and loot just disappearing (fuck those gear grinders). \n- Ill try to not spoil the boss battle, but whoever made it so scanning the boss took that long that it could wipe all my health- that neeeds looking at (Again, unsure whether its due to the difficulty level so check other reviews!)\n- Whoever added the bone break effect lasting as long as it does...yeah see yourself out. in addition to the person that decided aloy needed an age to get up from an attack, join that person and see yourself out.\n\nOverall, it may seem alot more negative but ive had a blast with the game, but its just these small things really add up after 100 hours, But you wont regret buying the game, worth the price so id say its a 7.5-8/10 game. Have a great day\n\nUPDATE:\n\nSo beat the final boss and the burning shadows dlc and honestly solid 8/10 game. just make sure when your doing the difficuly dont go ultra hard on the first play through. game builds on the first one and cant wait for the 3rd installment.\n\nSpolier:\nWe smoking on that zenith pack varl",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The graphics and the story of this game are amazing. The Horizon Franchise does not dissapoint :)\n\n\n---{ Graphics }---\n☑ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☑ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The graphics are beautiful and the story is entertaining, i'm glad the quality is carried over from the first game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Don’t be fooled by my playtime — I did finish this game under other circumstances. I love how the story progressed from the first game to this one; it felt like a natural and satisfying continuation. The narrative and world-building were so compelling that it even led me to upgrade the first game to the Enhanced Edition.\n\nIf you loved the original, Forbidden West is a must-play — beautiful, immersive, and full of adventure!\n\nAnd the new bosses will be a great surprise!\nI give this game, as a result, a Very Positive review!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Okay, what can I say about FW? I can say you absolutely should buy and play this game. I did what most people didn't do and play Zero Dawn first, which I immediately fell in love with, the graphics, the characters, the plot of the entire game, it was magnificent. The mechanics of FW were extremely different going from ZD and it was a bit jarring and I might add very intimidating, however, once I got the hang of it and understood the mechanics more and built my character up on the skill tree, I was very much able to play the game the way it was meant to be played. It's fun, it's exciting, it's gorgeous, and Aloy is a complete badass. The characters I have met have made me cry and laugh. I am not yet done with the game but honestly, I don't think I need to be yet, I know it's going to be another outstanding addition, i am so looking forward to the third installment that was announced recently.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Forbidden West improves on just about everything from the previous game, and does it with extraordinary conviction.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "if your into single player story games this is one of the best, tons of gameplay, awesome story, real fun combat, a few minor RPG elements.  its even beter than the first one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great sequel. It kept the same gameplay but improved a bunch of things from the first one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoyed the first game then buy it, if you never played these games and are curious, just watch a few game play video's to see if you like this style of game play, if you do then you will be happy with this purchase. I like this game just as much as the first, you do not need to play the first game to play or understand this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Beautiful open world, great scenery, game mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "easily one of the greatest games ive ever played in my 40 years on this earth. the writing is incredible, the animations -especially the faces- might be the best ive ever seen, on the same tier as cyberpunk. all the systems are cool and engaging, and never does the game become too easy. i dont know if ive ever been so invested in the characters of a story, this game brought tears to my eyes multiple times. i havent felt this pumped about a game since i was a child getting the new game for christmas. Guerilla / Nixxes - thank you from the bottom of my heart.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful, immersive game, just like the first one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "side quests are always the same, compareable to assassins creed, very boring, the story is very catching though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "+ Graphics\n+ Well optimized\n+ Mostly fun\n- UBISOFT LEVEL BLOAT. SO MUCH FILLER.\n- Too many samey weapons\n- Skills that don't really work, or are such a hassle to get to work that they might as well not, or are so niche they're pointless to bother with\n- Major eh I get the idea factor. I had to play several other games before I bothered with the dlc, it just gets so repetitive. Another location, different scenery but somehow looks the same. Another tribe with a supposedly different story, but they're just wearing different clothes and face paint. \n\nStill looking forward to the 3rd in the series, weirdly enough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Horizon is one of those games where I can truly get lost in the magic, guerrilla definitely hired someone who nitpicks every detail of worldbuilding. From someone who loves designing worlds, someone loved designing this world. Despite the ubisoftification, very suprisingly one of those rare games that if I found myself thinking 'damn itd be really cool if they actually did that' and then the game actually does it. \n\nAbsolute videogames✋🤚",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i cant believe they made it more woke and gayer than the first. loved the new animals and change of scenery. i was wanting more after finishing the first game and i am quite satisfied with this. cant wait for the third installation!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "una gran experiencia incluso siendo una secuela, y mas alla de lo que conlleva este tipo de juegos y el farmeo ha sido bastante interesante",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, one ups the first one. The same gorgeous graphics, amazingly thought out story and good easy gameplay. Side quests feel quite meaty too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent sequel to HZD by continuing the story and adventure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic story with noticeably improved gameplay. A clear step forward for the series, and absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Graphics, Gameplay, Story, Physics, Mechanics is excellent!! Its just the color scheme and its lighting is kinda hurtful to the eyes for my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story didn't have the same brilliant writing and payoff as the first game. It was servicable, in spite of the never ending caucophony of new characters that don't build as effective emotional impact or relationships as the first game. The story all gets a bit tedious in parts and the end game was disappointing and a bit trite compared to HZD. \n\nHowever the gameplay is significantly improved and overhauled, where I breezed through the first game this one packs a good challenge that increases as you progress (although artifically blocks areas with 1 hit deaths until you level up). Leveling is actually not bad and more involved than HZD as it requires ongoing attention. \n\nGraphics are great though it will test out your hardware especially if you don't have a high end rig. It does scale well, but I was drawn to crank details up as it is a looker!\n\nIts definitely worth playing for the world and challenge alone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More is not always necessarily better, and while I would still reccomend the sequel to anyone who had played HZD, this game didn't do it for me as well as the first one.\nFirst, the good: music is still amazing, the work on character design and facial animations is superbe (compared to HZD it's night and day), the new machines are a blast to fight, there is a lot more variety in side quests and the world is still a beautifully crafted sandbox to lose yourself into.\nFor the bad: storywise it falls a bit flat, not bad by any means but not on the levels of HZD in terms of narrative. The map is bigger, but the new side activities are a bit of a slog. The new weapons and skill trees feel redundant and variety added for its own sake. The new melee system needs a LOT of work to be even passable, nevermind any fun.\nPositive note: I enjoyed the DLC main narrative far more than the main story. I'd say it's worth going through the main game for that alone.\nOverall a bit of a letdown coming from the first HZD but nonetheless a fun Action Adventur single player experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9.5/10 for this game the only downside is the blight which was such a threat and yet dosen't have a big story behind only side quest as in the begining it was a threat and even mentioned alot of times and said on how we should find a way to stop it but yet it gets pushed aside in the story after doing alot of side quest's/Job's and trying to get a apex SpinoHeart (forgot the name of it) is absloutly impossible if you have already used them and trying to find a way to get one out of mission in open world or if you have finshed all missions and cant get one and badly need it to finsh your amour/wepon lvl up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm extremely tired of openworld games at this point, but Horizon just clicks for some reason. It's not a perfect game by any means, but gameplay is a blast and worldbuilding is amazing. It's also one of the most beautiful games I've ever seen(felt the same with HZD).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A solid game, with excellent graphics. The story develops okay as a continuation of the first part, and then it becomes a bit stupid, so to speak, especially the DLC part. It’s not worth playing if you haven’t finished Zero Dawn. In any case, the first game is definitely better in terms of story and gameplay, while this one wins in graphics. The gameplay is overloaded with a lot of boring quests and 300,000 different weapons that you’re not going to use anyway.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "loved it on playstation, even better on pc, amazing rpg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played the first version of this game and have ended it so now I am on this 2nd version. I just read there is a 3rd coming in 2027 and that is awesome! I love the game and the fact that I can play it since I'm not very good at games. There is a difficulty level so I adjusted it. The only gripes I have about the 2nd game is its so different from the first in how you upgrade and such. Its like starting a completely different game almost. I find it kind of annoying but I get it. It is also a bit more difficult. Kinda sucks I had awesome weapons in ending the first game and now have to start anew. Would have been nice to bring a better weapon with me into the 2nd game but what do I know. Im kinda new. Every day I look forward to playing. Thank you all for the beautiful work you have done. It is appreciated by us older folk who started out on an Intellivision back in the day.. lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far, so great!  I loved the first one (favorite game), and this one seems to have an interesting main story featuring a \"blight\" on the world's ecosystem.  There's quite an upgrade as far as fighting, skill tree looks more complex and varied, and graphics which improves immersion.  Aloy talks a lot more, but that doesn't matter to me cause she's great.  I'm not sure about the other characters as I've only played it for about 2 hours.  I know its a gripe among other people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love, love, loved Zero Dawn and I didn't think Forbidden West would be able to surpass it but oh my goodness DID IT EVER. Absolutely amazing, Zero Dawn feels like the warm up to this game. The depth of the characters and the story is amazing. All the mechanics too, so many cool features and new machines. And of course, the soundtrack and graphics are both absolutely amazing. So, so, so good. PLEASE ANNOUNCE THE 3RD GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing graphics, great story, open world, Aloy...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is 100% playable on linux.\nMaybe not on steamdeck cause of the graphics settings.\n\nI recommend using proton 9; works like a charm!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hfw review\n\nhorizon forbidden west is probably the best sequel they could have made to an already great game, but it does have a few critiques\n\nthe game does start pretty slow, with the far zenith launch facility and meridian part taking around ~2 hrs to complete but it is full of lore and great gameplay. Then afterwards during the first “real” main quest To the Brink, the entire daunt area is mostly a type of tutorial area, similar to the embrace from hzd\n\ni would argue the daunt is a better starter area because it features most of the activities and collectables you would find out in the forbidden west, such as relic ruins, machine strike, sunken caverns and lots and lots of quests. you could easily squeeze 10 hours out of the daunt if you want to. The game does really start to take shape after The embassy and Death’s door though with you being flung out into the forbidden west with the same “the world is dying” feel as the first game. \n\nI will say that this game also features lots of references to the HZD:FW (frozen wilds) dlc so if you haven’t played through that then you definitely shoulsuch d go back and play it before The dying lands\n\nThe gameplay has been improved significantly and so have the machines and weapons you have. The skill tree has been made ~6 times larger than the one in the first game featuring in-depth mechanics for whichever playstyle you enjoy such as melee or ranged or stealth \n\nalso i didnt mention this before but the music SLAPS dude promise of the west is actual peak and when it plays after completing a tallneck it actually feels great\n\nI will say when i started the game i chose “guided” markers but since then i have changed to fully “explorer” and i think that was a great choice because playing this game with minimal quest markers and destination points really adds to the immersion\n\nOne last thing is i constantly see people complain about the story of this game being worse than the original and IMO they are just flat out wrong. yes the story is much more Present and future focused rather than learning about the past but that’s because we already know all about the faro plague and seeing more in-depth tribes and their cultures was really great and honestly the story was probably the best part of hfw.\n\n**Overall a peak game, definitely getting a 10/10 from me**\n\n\n\n\nThe burning shores\n\nI have seen a lot of people complaining about this DLC and before i played it i was really wondering how they would impliment a good Horus bossfight but the dlc actually slapped and i found it to be on the same level, maybe even better than the frozen wilds. A small edition is that IIRC it does actually replay some of the same OST’s from HZD:FW which was so peak and nostalgic but overall i find the burning shores to be a much more gameplay focused dlc rather than the story of the frozen wilds. \n\nI would say if you’re on ps5 then only get the dlc if you’re really invested into the character development of aloy, but if you’re on pc then it being on the complete edition is great. I really enjoyed the character development of aloy finally opening up to seyka more comfortably rather than feeling like she is outcast and has to lock her emotions away\n\ni’ll give the burning shores a 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pros: Enjoyed the different landscapes and design of the robots, especially the big robots. Riding and hunting was fun. The calderas were puzzle dungeons that were a nice distraction from the overworld. Fast travel and being able to mark destinations on the map was useful. I liked the action parts of the game, so for that portion Horizon was great.\r\nCons: Not a fan of the really long dialogs nor cutscenes. The rpg style inventory, weapons and armor management, I found tedious to collect resources to upgrade (also forces you to kill a bunch of animals). Limited \"open world\" exploration due to bounding boxes on geometry (i.e. you see a ledge but cannot actually go onto it) climbing is railed to hotspots. Enemies had traversing issues where you could hack the combat by utilizing geometry they cannot pathfind around and take pot shots at them. Found the last boss fight disappointing.\r\nFor me, once you get pass all the dialog and are free to explore, that is when I enjoyed playing the game, so this leans towards a positve review as the map is huge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The archery in Horizon Zero dawn series is sublime. I so look forward to completing this game, and then the next, as I did the previous.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I gotta be honest, I don't get why people don't like this game. It's like the first game...but bigger so, what's not to like? I mean sure, there are definitely some shortcomings , specially when it comes to side missions(I would have preferred way less missions in number but better in quality) and plot(It's not bad but it doesn't hit as hard as the first game) but gameplay wise it's an amazing experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "horizon forbidden west great follow up to the original,  alot of fun played it originally on my ps5. Like it even more on the PC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More of the same \r\n\r\nIf you enjoyed the first game you will love the sequel as well. But do play that one first since this one has massive story spoilers right in the Prologue if you intend to do both and there are some characters and side quests which relate to the first game. If that doesn’t bother you, you can start with this one as well. \r\n\r\n    • Graphically it’s a huge improvement the game looks absolutely stunning you just wish you could take some wallpaper snapshots in a lot of moments. The scenery specially at dusk is amazing.\r\n    • Game play wise more of the same, there are some machines, they have detachable components which have some weaknesses which you must exploit. The roster of weapons has vastly increased even though I must admit I only used 2 types of bows for my entire playthrough. And now the basic spear attack has a lot of combos assigned to them which will greatly help in the main game.\r\n    • I liked that now each Tall-neck had a mini-story or puzzle to do and not just climb the high point and press scan like most of the games which use this mechanic. You had to invest time and mental effort each time you wanted to see the land.\r\n    • The additional side quests were good some really had a huge impact on how the world looked after you solved them, and I really liked the chess-like, machine strike mini -game. I will probably return to it until I defeat all my opponents.\r\nNow for the things I did not like :\r\n    • I was not a huge fan of how the story evolved since the first part was so good they took it into a new stranger approach a bit to SCI-FI for the current setting. The first story was plausible but the way it evolved in this one, yeah not a huge fan.\r\n    • Bugs: I sadly experienced some stuttering at some cut-scenes, some faces even blended within the masks (or were completely erased) which ruined the immersion a bit and once for a mission cut-scene I had a full PC crash. But I did not stop that to ruin my enjoyment of the game.\r\n    • Last thing I did not like was the attitude towards the main heroine. In the first you were the underdog always fighting for recognition. In this one you are treated like a demi-god walking along mortals, and each settlement make sure to remind you that It just feels a bit annoying and repetitive to hear this every time you encounter a NPC on how amazing you are.\r\n\r\nOverall a very good sequel improved fighting improved weapons stunning graphics and more challenging machines I highly recommend it. But if you want to immerse yourself in the story properly and haven’t finished the first one, I strongly recommend you do that first then return to this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I came to this game after playing HZD reading all the negative comments and watching negative YT reviews from around the time it came out. I knew all the gameplay aspects would be better and the gameplay would be neat. Story was supposed to be weaker than the first one, but honestly, i think i enjoyed it more overall, story included.\n\nThis game is the definition of next gen, the things you can do with your character in the world and during the combat between grapples on a flying mount (that can also dive underwater with you  and swim) and jumping around the battle repositioning with a gliding shield mechanic is just amazing.\n\nAmazing sequel - if you liked the first one, you will like this one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a masterpiece.  The voice acting and story are incredible, the characters rich, funny, sad.  If you like the first game, you'll love this.  Buy them both, play them both, and you'll love them both.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story 7.5/10\r\nGraphic desain 9/10\r\nGameplay 8.5/10 (You can dive under water and fly in the sky with beautiful view)\r\nMinus from this game, there something bug in quest for example you can't rotate valve  Wound in the sand, you just need reload for fixed)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nice looking game with solid game play, but the story is both convoluted and boring at the same time, so it's good you can skip the endless dialog until the next battle or fetch quest request.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the franchise so much, after playing the first game I had no idea how much bigger the world of Horizon got. The story, the characters, the landscapes, they are all brilliant! I have only one gripe about the game and that is the way the flying mechanic works on the sunwings, but overall I would absolutely recommend this game and I am holding my breath with excitement for the next installment!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, even if character design and DEI may have gotten its claws into it. Luckily it was only early days. Don't know why Valve says it's unsupported on the Steam Deck; it runs perfectly fine on mine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, the story is great. \nI like the growth Aloy goes through from the start of the first game to the end of this one. \nI always liked the visuals of the first game but when i got back to it after playing through this one i noticed these are better. Still am happy playing both. But this is the game i go back to most if i want to fight some robotic animals^^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game. It is a little annoying that you dodge by double clicking one of w,s,d,a. I accidentally fell of cliffs cerveral times wondering what gay ass coders didn't install a way to remove that double click piss. I only hate this game for that, otherwise I love the exploration and gathering of materials to make awesome weapons and weapon upgrades. And not to forget the mass murdering of innocent wildlife to get the arrow pouches fully upgraded. After I finished the game and the burning sands part, (spoiler alert) I actually wondered because of the many problems I had with the dodging system if the game was gay. And in the end Aloy had the option to kiss Seyka which means GA(Data Corrupted) END OF SPOILER anyway as I was saying its a good game not like the first game but different. I didn't get the same feeling of playing it like I did in the first game but that is due to the kinda vibe around it. The way to play the game has changed alot which means it gets harder, and in the beginning I really felt the game had been aspiring to be a game with intense fights dodging and such. I learned it after some time: I was ofc using ctrl to dodge and it got easier after I learned it. now im getting tired of writing so heres the ending phew: Thx to the creators of this annoying wonderful game:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall a really great game, good story, compelling characters and fantastic combat... though mastering the combat can take time and gets easier as more skills and weapons are unlocked",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game because the art direction and environments are FANTASTIC, it's been a real pleasure to hike through every part of the map, each location has a strong personality and details that make it feel so realistic. The base concept and the mainline story are also great. It makes me want to know more about what happened to the Old Ones and help rebuild the world.\nBut otherwise, it is a SLOP game. The writing of characters and dialogues is abysmal. Each character is actually a caricature, either full of \"good\" qualities or absolutely detestable and pathetic. No subtlety, no contrast. It's the good, open-to-their-feelings and queer people, versus the bad, greedy and intolerant ones, without any grey areas. The Tenakth are also terribly written, sold to the player as this ruthless, violent tribe who hate foreigners, only to realize they are just a bunch of skinny, quirky people who don't seem so hard to befriend after all. Very disappointed by the message the devs put in their game, because it has so much, SO MUCH potential.\nStill, I've put over a hundred hours in it, cause DAMN the hikes are great, and it's fun killing machines. Just wish it wasn't so... \"Netflix-Disney-StevenUniverse\" modern slop :/",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll recommend the game cause it's not bad by any metric but it's WAYYYY longer than it needs to be. I remember enjoying zero dawn and my only complaint when i was done was that there was too much resource collecting. this game is worse and i find the climbing to be very frustrating at times and yeah, the dialogue just dragged on and areas were so big and there was so much to do i was just like \"please i want it to be over.\r\n\r\ngorgeous game of course, but yeah. didn't REALLY enjoy it as much as i should have",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game - story, gameplay, graphics, and music all come together to make a beautiful epic game.  Maybe better than the first game. Recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A MUST PLAY if you haven't played it on Playstation. I wish there was better controller support and there are some specific 1 time boss fights that are poorly coded, but otherwise the writing is great. They took the best parts of the prior game and ran with. Do not let the sexism from external to the community confuse you, in fact, if it did, stop reading this because this review is not for sheeple. \n\n\nAloy as a character represents the 0utcast very loudly, and continues to do so. I do wish there was a little bit more flavor choices with social consequences.  As is all singleplayer games, it will die without more community engagement. This IP remains obscure to the public bc of big daddy playstation and its costing sales of the game FR. \n\nThe camera on controller has a lot of forced smoothing, that non-controller players will quickly notice. \n\nThe show will generate more interest, but its at the mercy of public opinion. Aloy for whatever reason represents some monolith to alt right think tanks and will be bashed again when the show comes out if Aloy stays true to form (I doubt they'll keep her true to form and i will blast the director for it (dont worry)). \n\nif you like dinosaurs, escapism, discovery, lore, intrigue, robots, philosophy, post-apocalypse, and self discovery themes, you'll love this game.\n\ndisclaimer: aloy is nothing like lara croft, so temper your expectations of fan service despite her gender",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing. Easily one of the best games ever made. Graphics are OUTSTANDING so is game play. It also runs very very well with no stuttering or issues which is super rare in today's day and age (looking at you Borderlands 4). \n\nI refuse to buy games that run like hot garbage... Jedi Survivor, BL4, the new Monster Hunter... they all look like great games but the performance is so dog water, I don't want to support devs like that so I refuse to spend money on them until they are fixed. You have to vote with your wallet and only buy games that actually run well or at least decent. \n\nThis game runs AMAZING and looks amazing. BUY BUY BUY.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "slow start, excellent combat system, the first game was more dense with machines but overrall it's a 9/10 game.\r\nplay it, you won't regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another banger game from Horizon Devs. \r\n\r\nMusic and Cinematic are 10 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So blown away by this game and this series. What an incredible world we get to experience. Can't recommend it more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun, the only problem is that when I move the camera, it gets a little blurry, but I'm sure that they'll fix that soon! Regardless, really high-quality gameplay, story, mechanics, and a great open-world RPG!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "By far one of my favorite games of all time. The first Horizon was a captivating world and while you can never recapture that, they did an amazing job in expanding on the existing world and adding new weapons, mechanics and creatures to keep the allure. The story was fun and the twist with the new threat was ever powerful in energizing you to keep striving to be a stronger MC moving forward. The DLC was much bigger than I would have expected and on PC it comes bundled with the game by default so it was very enjoyable. Like its predecessor, you do need to beat the game to access it but all the weapons and armor in the DLC are of course stronger than the main map and allow you to hunt new creatures and grind a little more for optimal fun and strategy. I loved this game and if you liked the first one, this should be easily as fun if not more with all the extensive new mechanics and skills added. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game speaks for itself. Robot dinosaur hunting is always dope.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game looks beautiful but the campaign kinda fell flat half way through the game. Like you set up villians only to pull a \"Oh they were the fake out bad guys and now heres the real bad guy\" which is a virus storm eldritch thingy. Like if done right it could work but it didn't here. F yall for making the dlc exclusive, I bought this on the ps4 and had a blast. Now yall making me buy the game for the second time on pc just so I can get that kiss scene.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good story, follows on from Horizon Zero Dawn.  Good graphics and wonderful scenery.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I often call Horizon games \"God of War for women\" but honestly it is its own thing and is as good or maybe evne better than god of war. Somehow they even managed to make the second  game as good or maybe even better than the first one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game and the extras that are in this over the original - love the glider and the different mounts. Was a bit worried by the start with the cut scenes showing Aloy seemingly having a personality transplant for Galadriel from LOTR TV show where she's just a bit of a **** but they seemed to drop this after a few hours of play. Not sure about the peach fuzz and acne decisions vs the model they based the character on. Good so far and much more to do!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Отличное продолжение Zero Dawn, начинал играть на выходе на плойке, а сейчас продолжаю уже на компе. Удивительно, но с клавомыши удобнее, особенно на самом высоком уровне сложности, целиться с геймпада я бы вообще повесился. \r\nГрафоний, сюжетий, мне все подходит. Лайк",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Story had great potential \r\nCharacters arcs are utter garbage \r\n\r\nBut i believe i can fly \r\n i believe i can touch the sky \r\n\r\nOnly played for the combat",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "SPending 9 hours doing the main and side quests before the embassy is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While the \"upgrades\" to the equipment system are not exactly my cup of tea, the sequel to Zero Dawn still delivers a great open world to explore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great continuation of HZD and Burning Shores add's a welcome more close knit story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible! Up there with The Witcher 3 and God of War Ragnarok as some of my favorite games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty gud so far but i can definetely see the sweetbaby influence because the first game wasn't so in your face trying to be preachy with modern topics while you're trying to escape reality. wish they gave you more places were you could make decisions because it feels like that response system is something they forget is in the game.\n\ngameplay is solid with some questionable choices in mechanics that feel they could have been almost perfect but stopped short, they could gave made GAIA more human like, she felt much more pleasant here it feels too robotic, like even in the previos game when you see her intial interactions with Elisaberth she's much more \"human\" while this feels so far like a home automation system. \n\nSo far the stupid tactic of having all of Aloy's love interest from the previous game suddenly pop up with relationships feels like they're trying to force her character arc into a corner and it's pissing me off. Varl chased after her for 6 months across the country but falls for some chick he met for two days. Talanah suddenly has someone plus the character designs feel like they have been toned down and \"modernized\", compared to how characters even side characters looked in the previous game in this one everyone now looks chunky and not athletes like the previous game with aloy being the only one that still has her figure. With body propotions and display being hidden and pacified. (i suspect sweetbaby)\n\nHopefully they ditch all that shit, but given the directors comments the next game might be worse.\n\nThe new cauldron override thing seems more like busy work just to artificial extend the game and busy work.\n\nbtw this has some facial bugs in cutscenes especially with the faces glitching in and out.\n\nSeems like those articles of just how deep sweet baby was involved had truth in them, almost every character i met in the side quest was gay ... like the majority it stopped feeling tasteful and like there's some former tumblr writers on the writing team.\n\nPlus that other off screen thing was so trash if you know you know.\n\nAnd speaking of the writing that last part of the main campaign kinda sucks, Tilda was handled poorly and it felt very forced like it was not make a shit ending and lets call it a day. there's alot more that could have been done. the story especially the writing is the weakest part of this game so much so that it blows out of proportion everything else, like the mechanics are a nice improve but feel like more of a waste of time than fun half of the time. \n\nThe motive given for even forcing the final fight is straight up some lesbian dark romance novel trashy trope not even the good kind, Ao3 writers could do better and i mean that.\n\nthere's also this thing of aloy forever being this passive and letting people push her around and that decision tree thing not be there in those moments pisses me off so bad. She's literally threatened by everyone or treated poorly and just smiles and waves. even the first game with a choice like deciding olin's fate, i thought we would have more of this or you choosing to respond in an aggresive manner, logical manner or hearfelt but it feels like everything was HR screened to be \"approved\" i don't like it\"\n\nOnly reason this review is positive is mostly i like futuristic setting and aloy plus the gameplay isn't bad but everything else is mid. let me stop thinking too much about the story otherwise this review is going to be negative.\n\ni don't like the quen plus seyka and aloy feels so forced, i knew when i felt something was off when they started closing of all other of aloy's options in the main game they were going to do something like this so predictable. Seyka's character is also unlikeable with the tantrum of a toddler it's that annoying kind that certain people think is attractive but just annoying they should have copied a character from another game tbh.\n\nAnd why are they making aloy act this way she's so far out of character, and the whole we did three missions together barely spoke and i'm suddenly inlove with you are you fucking kidding me. who wrote this shyt. i literally had to take a break from this game because that was annoying me so much, but now reading what the director said he's giving Neil Druckman vibes and that's not a good thing.\n\nfor the next copy other games that have done it better, i would recommend this game on a heavy discount if you can blank out when it;s doing the whole sweetbaby thing which is hard but doable but the story is weak and so is the writing the gameplay for the most part is the good thing. I hope the next game  is like this one because it will be a fail from me from sweetbaby to bad writing i hope they don't repeat the same mistakes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got it for about 35 dollars on sale. have already spent 50 hours in game and have enjoyed every second of it. One of my top 10 games of all time, and cheaper per hour than going to the movies!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "They improved most aspects and I'm looking forward to the next game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute Peak\r\n\r\nP.s. : Fuck the Froggy mfs\r\nP.p.s :  Horus best bae",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The continuity between Horizon: Zero Dawn and Forbidden West is perfect, the interactions with NPCs and their side plots have improved significantly, and the skills and weapons are incredible. I'm excited to explore another wide-open countryside full of machines to hunt.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i tore the horns off my own machine to meet a quest quota and dropped a spaceship on a python",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game so much. There is so much to do I'm 66 hours in and still have tons to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "glad I got this game. works very well on high graphics on ana RTX 2070.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game was great. 10/10 would recommend playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Robot Dinosaurs AND girls kissing? Uh, Yes please!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Best game ever. More update pls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games of all time, if not my favorite.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, nice story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game!\r\nPROTON_ENABLE_WAYLAND=1 mangohud game-performance %command%",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game...just as good as the first.  Can't put it down",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is in my top 10 of all time. Enough said.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game , waiting for the next act",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games every made not a complaint",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love both games, but this one is the better of the two.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great successor to the original game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Horizon series is GOATED",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "First horizon was fun, this was chore and boring :( completed more than 50% and I just dont want to play anymore",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Too many bugs to be enjoyable. It definitely seems like the game is a great continuation of the story, but I cannot recommend the game until the vast swath of bugs get fixed. I've got to restart the game every 20 minutes or so because the audio breaks and I can't hear diaolouge, or the menus break and I can't save, or I get stuck in an animation loop. Otherwise, it seems to be an improvement on HZD in so many ways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't know what it is with Nixxes and the Horizon games, but they've done 3 Horizon games with Zero Dawn, Zero Dawn Remastered and Forbidden West and all 3 are buggy as hell and some of the weirdest ways possible....\r\n\r\nI've had the war paint marking go completely crazy and flicker constantly during cutscenes on any characters who have them, for some reason.\r\n\r\nI had voice audio disappear randomly after playing the game for a while, and then eventually my map and save screen were just black screens before the game eventually froze.\r\n\r\nAt least I can play Forbidden West unlike Zero Dawn Remastered, but jeeesus man, I have PC better than 99.9% of gamers and I'm experiencing issues like this. I can play some of the most infamously broken games like Last of Us Part 1 without any issues, but the Horizon games are cursed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Boring grindfest stuffed with woke crap and soy vibes. Only good thing is the graphics... as always with sony games",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I LOVED the first Horizon game.  And I really like this game... But what I don't like is the port.  There's some sort of graphics bug in the shadow generation.  This cause anything with a shadow to flash black.  A lot of time its the faces, but sometimes the entire screen will flash black. (Can you say seizure?)  Cranking down graphics setting reduces how often it happens, but it still happens.  This is a known problem that's been going on since release, and it's still not fixed.\n\nAlso, I ran into a bug where the enemy humans were invulnerable.  I had to exit out of the game to fix it.\n\nI don't care how good your game is, if a game is buggy on this level it deserves a down vote.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "In a nutshell, it's an interesting concept with disappointing execution. Really good graphics though.\n\nI played to see where the story goes next since the first game was really interesting. This game has some good new ideas but overall, a few things made it a poor experience:\n\n- the combat is not good.\nAlloy gets knocked down easily and often. This would be fine if there were a mechanic to get back on your feet quickly, but there isn't. Also, this makes a melee play style far less feasible than a ranged style. And even if you focus on ranged gameplay, enemy machines are extremely mobile and will 100% force you into melee situations very often.\n\n- the game feels bloated and repetitive\nThe system for upgrading equipment was expanded too much or done in a way that makes upgrading gear feel like a chore. There are far too many animal parts and components to get. I'm no stranger to farming mobs to get loot for upgrades, that's just part of the genre, but this felt like such a slog . Upgrades also don't offer much increases in power, so it becomes less satisfying to play especially since the combat is often frustrating.\n\n- the writing\nAlloy can do no wrong, and she knows it. She's powerful and independent and nothing is a challenge to her; not seasoned warriors with superior equipment, not programming and computer sciences which are tough even for geniuses in our era. Characters are largely one-dimensional and the story feels like a glazing project.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The first game was fantastic. This game, I wanted to like, but it's just a souls-like hack-n-slash rage game even on easy where you never really get powerful enough to take on apex enemies. Every enemy scales with you, so even at the end, its just getting your butt kicked and knocked down over and over even with the most power weapons and armor. You never feel powerful in this game, like the first one. Story is pretty good I guess, it's just that the game play got worse because of the soul-like difficulty that it never got fun, it's just a giant grind. I get it, it's supposed to be stealth and you have a bow in a world of mechanical monsters.. but holy hell, it makes this game long, when EVERY fight takes forever, and every monster can defy physics and jump across the screen for no reason and one shot you to death. I beat it, maxed level, weapons. meh, I'll never play it again. Not really looking forward to the third one now either if its like this one. Story - Good. Game Play - Grindy Suck. Feeling - Sick of souls-like developers ruining games.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Nice story, following on the previous installment, but has terribly annoying features that totally pisses me off.\nEnemies respawns basically moment, you move few meters away from the habitats. ANd this alone is so utterly irritating, that I can not recommend.\nSome graphical glitches and artifacts, when rendering is not working, specially visible on faces.\nToo long takes it to unlock environment traversal equiplent, needed to access some of areas, which is another thing I hate in games.\nAbsolutely disgusting equipment model, where you have to get ultra rare components to get better weaponry from significantly strong oponents, but can't, due to having less powerfull weaponry, thus, obtaining those components is tedious task.\nHeavy weapon usage has become annoying task. Not only it still has low ammo count, but also having it dropped from enemy during combat is hardly a useful tool. Enemies act aggresively and will focus their attack mainly on you (even during group fights). Doing evaision ofc makes you drop the weapon, and you do a lot of evasions. When you try again to pick it up, guess what, enemy is already attacking so you evade (dropping the weapon), a circus, not a combat.\nControls are not at all adjusted for PC. Most annoying is double tap on WASD, which makes you do dodge roll, even though dodge ahs its own designated button. Incredebly frustrating on mall adjustings of possition, which oftenly makes you roll and fall out of edge or grass.\n\nThe DLC is badly designed. Missions where you can just fly on the mount, does not allow you to fly, cuz of NPC, that follows you, so you still have to solve some unnecessary environmental pathing riddles, even though you could just fly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game isn't even half as fun as the first one. Tedious, long stretches of boring climbing puzzles. The parkour platforming is atrocious and made me hate hate hate it, not fun whatsoever. I decided not to finish the game. Wont be returning to the franchise because I hated the jumping around on the yellow paint.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I'm so disappointed in this game. Having played the first game so much, on both PS4 and PC. And then this piece of crap comes along. On PC there are endless bugs, pop in. Lighting effects are just ugly as sin. HDR is terribly implemented. Textures look raw and low resolution. Sharpening effects are used to make them look more detailed but it's just ugly. Lighting is terrible going from over exposed to under exposed from one scene to the next. I spent hours trying different lighting settings, monitors, mods - it just looks like s*** a lot of the time. And for several hours at the start of the game there's a disgusting yellow haze layered on top. The plot might be ok, but I honestly suffered so much through the revolting lighting I couldn't bring myself to play more than 25% in. Large sections of the platforming are very dull and a big section of the game insists of playing through without a save point , creating extremely annoying repeat sections. I have tried and tried to enjoy this game but I think I'm just going to admit to myself it's a mess, it's not fun and I'm backing off. Perhaps in 10 years someone will remaster it and make a game worthy of 2025. This isn't it. Avoid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just a open world ubisoft game in disguise, too big, boring but looks good",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great story, great gameplay, insanely poor optimization.\n\nThe extended screen times, lags, cutscenes without graphics, and DLC that is even worse optimized than The Last of Us would still be passable, if it weren't for a bug that locks your character for 5 seconds in the last action they were performing, which happens as soon as your CPU is a bit overloaded. \nThanks to their significant investment in optimizing the game, this happens VERY often, especially in certain cauldrons such as Tai or Theta, or in the open world more generally, where you can spend more half your time stuck walking in one direction, sometimes even throwing yourself into the void.\n\nThis is the only game I know of that decides to block player inputs to manage CPU overload, and it's a shame.\n\nI imagine that this tiny studio has absolutely no way of paying a developer to fix this problem.\n\n8.5/10 without optimization into account, 5/10 with.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A downgrade all around from Zero Dawn. The story is a huge let down. Both endings, the main game and DLC, leave a lot to be desired. I doubt I'll play the third as the story just isn't worth following after this disaster.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The graphics and the open world look great. Too bad the story and characters are really boring.  Aloy is a lame protagonist with no personality or interesting traits whatsoever.  The side characters are the same and I couldn't have cared less about them.  The gameplay is mediocre with bad climbing mechanics where Aloy would miss jumps or only grab ledges when she feels like it.  Battling robots feels worse in this game than the original with no defense moves other than dodging which hardly ever works.  I give this game a 5/10.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "6/10 - Game feels overwhelming for me to personally play. First game felt much more enjoyable due to its smaller open world.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really lost my patience about 7 hours in and just started skipping every line of dialogue and cutscene because theres just way too much dialogue. Every quest is a cutscene. Want to hear a rumor? You're locked in place for 2 minutes listening to dialogue. New merchant? More dialogue. Trying to use your brain to solve a puzzle? No worries the character has dialogue to solve it for you\r\n\r\nEnemy AI is way too buggy. Tends to just completely break in some areas and it really just takes you out of the experience. \r\n\r\nThe game tries way too hard to be cinematic at times that combat just doesnt flow. Melee is still trash maybe only useful when fighting one enemy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "tela preta muitas vezes, má otimização, queda de fps, travamentos e crashes. Nunca vi um game dessa forma. Apesar disso, o jogo é lindo, história boa, gráficos e jogabilidade divina.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring game, boring story,  annoying puzzles and level design. Plenty of utterly boring dialogs. Aloy non-stop talking to herself. It is so annoying. Crappy combat and mediocre gameplay with parkour worse than in the first game. Missions relying on walking and talking, talking and walking and following persons for hundreds of meters while talking of course. Any modern Assassins Creed is a shining piece of GOLD compared to this garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Frustrating in all the wrong ways, none of the good. So repetitive I almost fell asleep several times (in the day time). Yeah the game is beautiful that's true, the lore is full, the map is big (yeah too big) but why am I so bored... I am trying so hard to like this game but to be honest I have no idea why. I'll keep on trying to see it through but the fun is not there for me. Loved the first one, but to each their own I guess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SPOILERS DONT READ IF NOT PLAYED\r\n\r\n\r\n\r\n\r\nBeautiful game no doubt stunning graphics for a 70 GBP game  though thats it. Flat voice acting too much stupid stuff suddenly space aliens Beta is annoying I guess we'll have a third clone of Elisabet Sobeck after this who is evil as the final villian as everything seems to be about Elisabet Sobeck. They killed of Varl in a stupid way - he was my favourite  Aloy I understand her stress but shes plain boring and has 0 development as compared to the first game where we actually saw the character grow. Enemies are bullet sponges combat is shit resource hunting is a chore a large downgrade since HZD which was the first game I got on the PS4 - I played it 7 times - this game I played twice and couldn't bring myself to get past the first Tremortusk even after beating the shellsnaper cause it was so boring... genuinely beatiful but thats it nice graphics average gameplay boring story.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unfortunately I have to give this a no. There are numerous issues that make the actual game frustrating after about ten hours. \nI just don't understand design decisions that are there to frustrate the player.\n\nFirst the good.\nThe game is beautiful. I didn't see any areas that weren't amazing looking.\nI didn't have a single crash or loading issue. When I went to an area all the textures were loaded properly.\nI had zero pop in that I could notice so whatever the devs did I wish more companies would do the same.\nGood job on that, seriously.\nMusic is great. Mostly the same as the first game which is good. Loved the sound track of the first game.\nSound design is weird. Some weapons sound punchy and great then some others are very weak. \nThe bow needs more snap to it in my opinion,\nThe world is big but I didn't find it to be bloated like a ubisoft game. Every region has unique enemies which  works well and doesn't feel out of place.\nTransmog is nice.\n\nA few nitpicks before the bad.\nGated areas that need an upgrade are kind of lame. When you do finally get these upgrades you just find mostly trash loot to sell instead of some actual cool gear. You get some greenshine from some of them but all in all I found them to be very disappointing. Almost every question mark on the map was one of these locked areas so I just stopped going to them until I got the upgrades which killed my enthusiasm to explore since all I was finding was mob sites and campfires.\n\nHaving to unlock overrides after I complete a cauldron doesn't make any sense. \nIt's an extra step for no real reason that I can see. Worked perfectly fine in HZD.\n\nSupplies for fast travel is very strange. After an hour or two I never had to worry about it again.\nJust like the first game it becomes an ignored mechanic after a little while.\n\nThe story so far doesn't really grab me in anyway. I just got my third GAIA piece and I'm just kind of meh.\n\nTime for the bad.\nKnockdown is so bad I cannot believe that it's in the game.\nYou will get juggled constantly with no way to recover except watching Aloy get up super slow. \nAt first it's not that bad but after the arena it is consistent. There are no skills that help. No gear that helps. You would think that there would be a button prompt or something but nope.\nThe Tideripper is the worst for this. Leap attack, ranged attack, sweeps, AOE.\nThe water jet AOE is the worst attack in the game. It will spin around for a very long time and stagger you while you get slapped around by it's other attacks. This is a constant issue and ruined my enjoyment of the combat. \nI found some attacks are unavoidable as well. They removed the long dodge from the first game and added a stamina to the roll so after three rolls you get tired. Incredibly stupid.\n\nClimbing is so messed up I hate it. \nThere are cliffs that you should be able to climb but because they have no anchor points it's a big nope.\nSometimes you just stop for no reason and get stuck in place. Only way to fix it is the try to go back the way you came even though there is a yellow X five inches in front of you OR you have to jump.\nSome posts have anchor spots but you just jump past them instead of on them. Other times you want to jump past them but you aimbot right at them. \nSame with ledges. I'll have enough momentum to clear a gap easily but it will slow me down in mid air and point me to the ledge so I can grab it. Why is this a thing? \nWhy does Aloy climb the vents in the cauldron like she's learning to climb stairs like a toddler? It's the same width as a ladder? Why is this a thing?\n\nDEI.\nLook, usually I don't really care about this. For me most of the time I'll usually just roll my eyes and move on. Almost every quest giver is a woman. Almost every person in power is a woman. \nCouple of examples. The Tenakth are a warrior culture that respect strength and reward victory but then they have multiple women as chiefs. What? That doesn't make any sense at all. It's not just one either it's all over the place. You have to always rescue men. Men are always injured. It's always men that have to prove themselves when all these women don't. \nYou mean to tell me that in a world as savage as this they have the women going out into the wild instead of having babies? I know this is fantasy but come on man. Every woman is super strong, wise and knows best and all the men are cowards, weak and idiotic. \n\nAloy is a bitch.\nShe didn't have this much of an attitude in the first game,\nThere's a line very early on that she complains about Varl's beard and when he says he'll shave it off she says \"Good.\". What the hell is even that? She has a problem with men growing beards? I don't understand why this was even put in except to demean Varl. She has multiple instances like this and just has a chip on her shoulder when interacting with anyone. Where is the empathy? This doesn't make her strong it just makes her unlikable.\n\nAloy won't shut up. \nOh my god it's bad. She is constantly yammering non stop. I even got a mod and she still goes on too much. I don't need a narrator for every little thing.\n\nHaving multiple interactive buttons.\nOkay, what do I mean by this? \nI use a PS4 controller and interact is triangle. Then you have pry open is R2 but sometimes you have to hold it then sometimes you have to just press it once. Opening a door is triangle but hacking a door is R2 that you have to hold but hacking a robot is triangle. If your not is the right spot you'll just power attack the door. Happens all the time to me.\nThen there's the wreaths in which you have to hit it three times. Wait for the animation to stop because you have skills that are tied to delays. Then hit R1 to use the flower.\nWhy? Why do we need this many interact options? Just use triangle man. Why is it so obtuse?\n\nHolding X to use, sell, buy, upgrade, move to storage, craft ammo. This needs to stop.\nEvery game these days does this and it is stupid. I've never heard a single person say \"I think the holding down X to do anything is cool!\". With all the menuing you have to do it just becomes a massive waste of time. It's not like you can't buy back an item if you accidentally sell it and if you upgrade the wrong thing you can just go get the items again. So why is this even a thing?\n\nA lot of weapons do the same thing.\nHow many more weapons do I need that do blast? I had four different weapons that basically all did the same thing at one point so they stopped having a real roll to play in combat.\nIf there's an exploding javelin why can't I have an exploding arrow?\n\nI love HZD but HFW just isn't there.  Too many issues that top up after about ten hours and it progressively gets worse. I'm going to finish it to see what happens but I won't bother with NG+ like I did with HZD.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a good game when it decides to grab a ledge. The worst climbing ingame there is i've played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT MAKE THE MISTAKE I MADE! This game is one of the most boring and pointless games I have ever played. The graphics are good, but you can say that about any game. Please take my advice and do not buy this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game doesn't even have adjustment for brightness in PC... for f.... sake what were you thinking while designing the game?......................................",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant do a thing in this \"game\". no freedom, feels like chore.\nthe dialogue is boring, basic and annoying and the storytelling feels like an insult",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Movement feels so bad that i honestly cant fathom myself continuing my playthrough",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Steam Review Horizon Forbidden West™ Complete Edition\n\nI honestly regret buying this game. My PC is strong enough to run any modern AAA title smoothly (RTX 3070 Ti, i7-13700K, 360Hz monitor), but no matter what settings I tried, the game looks bad. I spent around 90 minutes only adjusting graphics options and nothing helps. Textures keep changing and flickering during gameplay, faces look weird, and the game is full of bugs. It feels like a broken PC port.\n\nThe controls are uncomfortable, the movement feels stiff and annoying. The menus and keybinds are not user-friendly at all. There are missing subtitle options and a lack of proper explanations for controls and features.\n\nThe graphics are far from impressive for a modern game. I’ve seen better visuals from older titles. Considering the high price, it’s just not worth it.\n\nI expected a polished next-gen experience from a big Sony franchise, but instead I got a messy and disappointing game that doesn’t respect the player’s time or money. For me, it’s not worth buying. 😕",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm not sure where they get open world from. This game is very linear. One path, one solution no real variation. If you like that type of game the graphics are great and the combat system works well. It's just not my kind of thing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Annoying downgrade from the original game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I went into the first game not expecting much based on the premise, but the story and atmosphere managed to blow me away with its unique premise and quality all its own. Unfortunately, Forbidden West does not carry this forward. The game play is by and large the same as Zero Dawn, with an expanded roster of weapons and enemies, and if that's all you want then I would recommend picking this up in a sale. It's those two parts of Zero Dawn, the story and atmosphere, which are severely lacking here with only a few exceptions within the main story-line.\n\nThe best way I can describe the problems this game has, it would be to say that it is far to eager to oblige. You will come across characters and situations that are brushed off as to not challenge Aloy and the player in a manner that becomes difficult not to notice. Characters will often either be entirely filled with positive or negative traits with little room for ambiguity, leaving most outside of the main cast feel by and large the same and you will know the outcome of plot-lines within a moments of beginning them.\n\n-Spoilers ahead- \n\nYour friend is in town and doesn't like the local magistrate? Don't worry hes mean, overworks people, doesn't care about their safety, AND he caused the machine rampage in the area. Companion doesn't like his old rival turned chief? Don't worry no one in the tribe likes him and when you blow up their wall symbol of the clan's might, they'll all make fun of him for it and not care whatsoever for the cultural value of it, even the tribal elder. Faro's Tomb? Faro's villainy is amped up to 11 and nothing is added to his story of character that isn't moustache twirling evil. No incorrect and poorly justified pretense behind a horrible decision associated with his obsession to right his wrongs like he was in the first game, hes just a moustache twirling Saturday morning cartoon character here. The C.E.O. who forces you into the tomb? Turns out despite being a religious, cultural, and political icon no one cares that he's dead because 'He was an asshole anyway' and \"he manipulated our beliefs\" because people talk like that.\n\nThis extends to non mainline content as well with only a few exceptions. Nearly every situation is just unambiguous and will not challenge the player or world, people are just neatly divided into camps of good and bad. Tenakth elder's grandson joined the rebels? nah turns out hes a hero who was entirely trustworthy and turned himself in to save everyone. An Utaru village is under attack? Don't worry it's the rebels and we don't like them already. You need to break into a Tenakth prison to rescue a Carja? Nah don't worry the rebels recently took it over, and the character you came gets to leave with their head held high.\n\nTo be clear the exceptions are there, most of the main companions and Gaia are all great in their interactions between each other and Aloy. Especially Varl, and I didn't even like him in the first game. However, they can't hold up the whole game and even Aloy just devolves to a plank of wood when she's interacting with most other characters. Wish I could recommend this game but I just can't bring myself to finish it. It got just too predictable by the end. Watched the remainder of it on youtube after I defeated Regalla, and can't say I was wrong in that assessment.",
      "voted_up": false,
      "votes_helpful": 120
    },
    {
      "review": "The game is not quite as good as the first. My rule of thumb is \"less is better\" especially when it comes to videogames. HFW may have improved gameplay and more mechanics but it feels overwhelming to a point it can get boring.(Lets not mention the side challenges). The game also has many more weapons, ammo types, armors that sometimes feels redundant and to upgrade them is a real PITA and grindy. I hate grinding but maybe I'm just getting old and don't have the time to play those kind of big games that require big investment. Less is better, HZD, while still being a big game, was more self contained but this sequel is just too big, bloated and sometimes it feels like work. I would recommend to just go for the main missions if you play this otherwise you can get a bit annoyed and bored. 6/10 i can not recommend it cause i would rather play HZD again on ultra hard than this. games should be fun not a job you have to complete",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "I've just finished all side quests, rebel camps, rebel outposts and I'm on my way finishing the drones and black boxes. I do enjoy this game, but the combat (specially the difficulty) design is so atrocious that I end up getting more annoyed than having fun while playing this game. Since I have only two options here: To recommend and To not Recommend, I picked the latter. I'll try to explain my feelings about this game:\n\nTHUMBS UP:\n\n- I absolutely love the scenario, all the colors, flora and fauna. The tribes, everything is spectacular. The art design is gorgeous, all the details on the machines were meticulously crafted. The soundtrack is not a masterpiece, but it's above decent and gives more emotion to combat against big machines. I loved the amount of weapon choices and playstyles we have access to in comparison to Zero Dawn. \n\nTHUMBS DOWN:\n\n- The story itself was more attractive in Zero Dawn though, as here we have a few edgy and boring millenia-humans, a bunch of cowards who hide themselves behind a suit, just like an armed man is suddenly courageous in real life but is in fact a petty chicken without a gun. The Tenakh arc is awesome, but that's it. I haven't played the DLC yet but I've had major spoilers about it. \n\n- I have nothing against above-weight characters, chubby characters or whatever, but her head is stupidly bigger than her body that I don't know if it's funny or lame to watch. There are a few outfits that you can clearly see her legs and arms, and they are so thin that her head looks out of place. Speaking of legs and arms, why is a nomad warrior who climbs mountains, swims a lot, hops on trees and fights machines so skinny? She spent and spends 99% of her life in the wilderness, her body constitution makes no sense to me. At this point Last of Us 2 Abby would make more sense. Also, Aloy herself is a bit less \"human\" in this installment with almost 0 personality.\n\nTHUMBS TOUCHING THE GROUND OF THE REALM OF SATAN:\n\n- Pit Challenges: Making a mode encouraging melee is great, but when melee is completely useless against machines (unless you play on Story difficulty), there's no point in these challenges and all the dmc-like combos you tried to implement. NOBODY will ever use (or memorize) those combos on Rebel Camps/Outposts and more than 50% of the Warrior Skill Tree is a complete waste. The challenges are either extremely easy or extremely annoying/difficult. Honorable Mention to the Pit Master in Thornmarsh. How drunk was the guy in Guerilla team to come up with the idea of a fair melee combat bringing a coward p*ssy shield into the fight like a little girl? It was completely out of line and broke the immersion entirely, if that was in a tabletop RPG I'm pretty sure any player would call that guy a fricking pathetic coward. How do the Tenakth respect that coward as their Pit Master? Funny enough he kept almost insulting me for using a bow when he was hiding behind a shield, in again, a \"fair\" combat. COMPLETELY STUPID. The Enduring Fight was awesome though, but the story behind it kinda predictable and boring.\n\n- Big Machines are Elden Ring God Superbosses with 0 balance: Getting into the things that led me to rate this game as a \"I don't recommend it\" I should note that I started my playthrough on Very Hard. I love hard games and I always pick the highest difficulty, the only reason I didn't pick Ultra Hard is because everywhere people say it is intended for NG+. Like I mentioned in the very beginning, the machines design is superb, all their details, their movements, it's awesome! But that is where their beauty ends. For the context, I'm now on the very last main quest with all side quests completed and all non-DLC machines killed with every of their variation, which includes Apex. I'm on the 4th part of arena (will discuss the worst part of this game in a few) having completed all the first 12 challenges on Very Hard as I refused to lower down the difficulty.\n\nMost of the bigger machines break the laws of physics, the laws of common sense, they do a 180° turn during their skill movement while in the air in the middle of the animation if you dodge/jump/run...why  is that? Oh, it's because they are machines so they can. Why is this shellsnapper hitting me with its cannon when it's bound in the ground with ropecaster and stunned by shock? Oh, it's because it's a machine, so it can. Why is the same said shellsnapper literally teleporting dozens of meters with a burrow movement? It doesn't even have a drill. Oh wait, it's because it's a machine, so it can do whatever it wants.\nIt's not only the shellsnapper, every big machine can attack you even when immobilized and stunned...what the f*ck is that? It's because they are machines, so they can.\n\nI've defeated all apex machines, including Tremortusk, Slaughterspine, and I can \"farm\" them efficiently, but they are still one of the worst things in this game (big machines in general) when it comes to combat. Who was the mentally disabled person who designed Tideripper? You can get stunlocked by its Tidal Disc's waters, which brings me to the question: Did you guys in Guerrilla have someone to review these atrocities? You agreed to that? Oh yes, they are machines, they can do whatever they want.\n\nAt this point I feel I'm fighting Divine Entity Versions of Transformers. I still can farm those easily, but the fun is 0 because I either cheese them with Ropecaster>>>Frost Ammo>>>Boltblaster, I stunlock them with Ropecaster and do whatever I want, or I struggle with totally unbalanced and unreviewed movesets like I did when I was low level with blue weapons. The game is extremely easy on anything below Hard Difficulty, and is extremely r-word on Very Hard and Ultra Hard, it's cheese or be cheesed.\n\n- Why there is a fricking alligator living in harmony with anteaters? Why there are deers living in harmony with a fricking 10ft-height bear? Why every time I go to hunt a machine, instead of finding a horde of those machines, I find them accompanied by other \"animals\"? Because they are intelligent machines? If they are intelligent, why they attack people on sight like irrational animals? Why they behave like animals? It's so annoying to go fight a Frostclaw just to find 6 other machines of different types around it, it makes no fricking sense! If they are data meant to replicate animals, Gaia did it wrong, you don't see a bear partying with alligators.\n\n- The Infamous Arena: There is a reason 90% of Horizon fans hate this mode. Who in their sane mind would allow such atrocity to be launched in the game? From the dumb metal shards cost to the nullification of certain builds (stealth) to the herp-derp Locked Loadout. NOTHING is fun about arena, NOTHING. You either overlevel it, cheese it with very specific stuff, reload for the perfect rng, or get rekted. There's a reason most players just change to Story difficulty to play the arena, this is the proof the Arena if a big fail and whoever designed it should be fired.\n\nFINISHING:\n\nI'm a big fan of Aloy and her adventures, I love the post-apocaliptic USA, but I can't agree with the big amount of bad decisions taken in this game regarding level design and combat. I usually get more pissed than have fun while playing this game because the combat is so unbalanced that it makes me sick, and on the lowest difficulties the game has no challenge. I hope the third game is a better experience just like Horizon Zero Dawn was, and I'm looking forward to the Horizon MMO.\n\nDon't get me wrong, I don't hate this game, I just hate the Godlike Gundam/Transformer behavior on Very Hard, and I'm pretty sure I'll uninstall it by the time I start my Ultra Hard run. I do love everything that is not combat though, and the big head-emotionless Aloy (she was so cute in Zero Dawn). I'd give Forbidden West a 6.5/10",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Loved the first game but I just can't get into this one. Everything feels worse somehow - the story, the characters, even the graphics (apart from the character models, which have been greatly improved vs the first game) - the environment looks oversaturated and somewhat grainy no matter the settings for me. But what really killed it for me was how clunky Aloy felt to control, both in and out of combat.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "Not as good as the first game.\n\nGets extremely boring at the end if you want to upgrade your stuff because there's only 2 locations you keep going back and forth to. Not just because you need many items from a certain machine, but because there's only 1 spot on the entire map where they're at. Why the heck did they even make a bigger map then?\n\nAlso fast travel has ridiculous loading times at certain places. And a number of tiny annoyances, for instance plants spawning inside of trees so you can't harvest them. Text boxes blotting out the view for no reason. The valor crap doesn't trigger properly and character jumps instead or stops halfway in the animation. Stuff sinks into the ground, not just loot but also your mount. etc.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Maybe I just didn't notice this in the first game, but the dialogue is so bad in this game. Every character is just some overly sarcastic caricature. It's just so unimmersive. Where has all the good writers gone :/\r\n\r\nThe premise has also kind of worn thin due to everything being revealed in game 1. Now it's just another boring hero's journey rehash.\r\n\r\nThought the yellow marks being turned into an AR element rather than just yellow paint was cool lol",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "First horizon was fun, this was chore and boring :( completed more than 50% and I just dont want to play anymore",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "In a nutshell, it's an interesting concept with disappointing execution. Really good graphics though.\n\nI played to see where the story goes next since the first game was really interesting. This game has some good new ideas but overall, a few things made it a poor experience:\n\n- the combat is not good.\nAlloy gets knocked down easily and often. This would be fine if there were a mechanic to get back on your feet quickly, but there isn't. Also, this makes a melee play style far less feasible than a ranged style. And even if you focus on ranged gameplay, enemy machines are extremely mobile and will 100% force you into melee situations very often.\n\n- the game feels bloated and repetitive\nThe system for upgrading equipment was expanded too much or done in a way that makes upgrading gear feel like a chore. There are far too many animal parts and components to get. I'm no stranger to farming mobs to get loot for upgrades, that's just part of the genre, but this felt like such a slog . Upgrades also don't offer much increases in power, so it becomes less satisfying to play especially since the combat is often frustrating.\n\n- the writing\nAlloy can do no wrong, and she knows it. She's powerful and independent and nothing is a challenge to her; not seasoned warriors with superior equipment, not programming and computer sciences which are tough even for geniuses in our era. Characters are largely one-dimensional and the story feels like a glazing project.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Nice story, following on the previous installment, but has terribly annoying features that totally pisses me off.\nEnemies respawns basically moment, you move few meters away from the habitats. ANd this alone is so utterly irritating, that I can not recommend.\nSome graphical glitches and artifacts, when rendering is not working, specially visible on faces.\nToo long takes it to unlock environment traversal equiplent, needed to access some of areas, which is another thing I hate in games.\nAbsolutely disgusting equipment model, where you have to get ultra rare components to get better weaponry from significantly strong oponents, but can't, due to having less powerfull weaponry, thus, obtaining those components is tedious task.\nHeavy weapon usage has become annoying task. Not only it still has low ammo count, but also having it dropped from enemy during combat is hardly a useful tool. Enemies act aggresively and will focus their attack mainly on you (even during group fights). Doing evaision ofc makes you drop the weapon, and you do a lot of evasions. When you try again to pick it up, guess what, enemy is already attacking so you evade (dropping the weapon), a circus, not a combat.\nControls are not at all adjusted for PC. Most annoying is double tap on WASD, which makes you do dodge roll, even though dodge ahs its own designated button. Incredebly frustrating on mall adjustings of possition, which oftenly makes you roll and fall out of edge or grass.\n\nThe DLC is badly designed. Missions where you can just fly on the mount, does not allow you to fly, cuz of NPC, that follows you, so you still have to solve some unnecessary environmental pathing riddles, even though you could just fly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too many bugs to be enjoyable. It definitely seems like the game is a great continuation of the story, but I cannot recommend the game until the vast swath of bugs get fixed. I've got to restart the game every 20 minutes or so because the audio breaks and I can't hear diaolouge, or the menus break and I can't save, or I get stuck in an animation loop. Otherwise, it seems to be an improvement on HZD in so many ways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The first game was fantastic. This game, I wanted to like, but it's just a souls-like hack-n-slash rage game even on easy where you never really get powerful enough to take on apex enemies. Every enemy scales with you, so even at the end, its just getting your butt kicked and knocked down over and over even with the most power weapons and armor. You never feel powerful in this game, like the first one. Story is pretty good I guess, it's just that the game play got worse because of the soul-like difficulty that it never got fun, it's just a giant grind. I get it, it's supposed to be stealth and you have a bow in a world of mechanical monsters.. but holy hell, it makes this game long, when EVERY fight takes forever, and every monster can defy physics and jump across the screen for no reason and one shot you to death. I beat it, maxed level, weapons. meh, I'll never play it again. Not really looking forward to the third one now either if its like this one. Story - Good. Game Play - Grindy Suck. Feeling - Sick of souls-like developers ruining games.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is extremely boring. Much more than the first game. \nThe upgrade system is completely broken and requires a ton of grinding. \nHunting animals to upgrade a pouch is incredibly boring. It's just there to waste the player's time. \nCombat is basic and shallow. Especially when fighting human enemies. \nGritting for dialogs is uninspired and bland. Voice acting is mediocre, as if they got random people of the street. \nCharacters have little to no personality. Most are very basic stereotypes. \nThe player has no agency and just goes from one boring quest, to another boring quest. \nFortunately, most cut scenes can be skipped. \nThe open world is a wide as an ocean, but as shallow as a puddle. \nSome of the music is good, but a good part of it is annoying. \nGraphics are good, but there is a lot of pop in, when traversing the world.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I don't know what it is with Nixxes and the Horizon games, but they've done 3 Horizon games with Zero Dawn, Zero Dawn Remastered and Forbidden West and all 3 are buggy as hell and some of the weirdest ways possible....\r\n\r\nI've had the war paint marking go completely crazy and flicker constantly during cutscenes on any characters who have them, for some reason.\r\n\r\nI had voice audio disappear randomly after playing the game for a while, and then eventually my map and save screen were just black screens before the game eventually froze.\r\n\r\nAt least I can play Forbidden West unlike Zero Dawn Remastered, but jeeesus man, I have PC better than 99.9% of gamers and I'm experiencing issues like this. I can play some of the most infamously broken games like Last of Us Part 1 without any issues, but the Horizon games are cursed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game isn't even half as fun as the first one. Tedious, long stretches of boring climbing puzzles. The parkour platforming is atrocious and made me hate hate hate it, not fun whatsoever. I decided not to finish the game. Wont be returning to the franchise because I hated the jumping around on the yellow paint.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I LOVED the first Horizon game.  And I really like this game... But what I don't like is the port.  There's some sort of graphics bug in the shadow generation.  This cause anything with a shadow to flash black.  A lot of time its the faces, but sometimes the entire screen will flash black. (Can you say seizure?)  Cranking down graphics setting reduces how often it happens, but it still happens.  This is a known problem that's been going on since release, and it's still not fixed.\n\nAlso, I ran into a bug where the enemy humans were invulnerable.  I had to exit out of the game to fix it.\n\nI don't care how good your game is, if a game is buggy on this level it deserves a down vote.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Boring grindfest stuffed with woke crap and soy vibes. Only good thing is the graphics... as always with sony games",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "6/10. I'm calling it quits after a couple dozen hours. Played on Ultra Hard.\n\nHorizon Forbidden West has several mechanical improvements over Zero Dawn and the graphics are pretty freaking incredible. I like how you can climb on the side of most cliffsides now.\nSwimming underwater has never looked better.\nHas a fantastic \"wow\" factor for the first 10 hours. But honestly that's all the good I can say about this game.\n\nAs the game goes on and you get over the \"wow\" factor, it just feels more and more boring and bland, even more so than the previous game. The world is way WAY too big, content is way too damn repetitive and the combat system doesn't have anywhere enough depth to keep things interesting despite the improvements. Melee combat still feels pretty bad, but you have combos now in comparison to Zero Dawn. Ranged combat is easily the best way to engage enemies but it gets really old after a while. Shooting off components on robot dinosaurs gets extremely repetitive quickly. The combat system would do better in a much smaller scale game. On top of that, bosses are way too damn spongey. I remember fighting a human boss at the (light spoilers) embassy and having to unload about 300 arrows into that guy's face in order to progress.\n\nI haven't seen the story all the way to the end, not even close, but from what I've seen so far, the story is terrible. All of the intrigue and mystery that Zero Dawn had in its story is almost entirely absent in Forbidden West in favor of a very generic save-the-world plot. Every single character you meet either feels like a boring cliche, a walking caricature, or a young adult novel side character. Every single character has ZERO DEPTH (I do like Erend though, personality wise) except for Aloy, but her know-it-all attitude, monotone voice and excessive talking really got on my nerves after a while. The dismissive comebacks she has for every conversation were amusing at first but they ended up very grating.\n\nAloy comments over literally everything you do. Everything. Constantly points out the obvious, constantly spoils puzzles for you within literal seconds.\nI somewhat liked her in Zero Dawn, but here, she is honestly very annoying.\n\nThe music honestly sounds very forgettable. One of the most forgettable soundtracks I've heard in years. I can't get a single song to come to my head or remember a single melody, whereas in Zero Dawn's case I can think of the main theme almost immediately.\n\nThere's this one minigame that I found that is basically Horizon's version of Gwent called Machine Strike. Just this one basic board game you can play and collect pieces for if you don't feel like fighting robot dinosaurs all the time. Machine Strike is ok, judging from my experience from the two matches I've played. It kind of reminds me of chess or checkers if there were much less pieces on the board and every tile you move onto has certain environmental abilities. I didn't play enough of Machine Strike to properly realize my opinion, but this minigame does exist in the game.\n\nYa know, I had hope that Guerilla would recognize what they did wrong with Zero Dawn and give the next installment their all, I was truly optimistic that Forbidden West was going to be one of the greatest games of all time but it really just doubles down on everything that Zero Dawn did wrong. \n\nThe flaws are mostly the exact same as Zero Dawn's.\n\nIncredibly beautiful world full of repititive and boring content.\n\nCombat system that doesn't have enough depth and gets repetitive quickly. This is more of a foundational issue more than anything. There's only so much you can do to make shooting components off robot dinosaurs fun after a while. The core gameplay gets incredibly old in the long run.\n\nTerrible storyline that doesn't have that intrigue Zero Dawn did on top of incredibly boring characters.\n\nAnd like Zero Dawn, Forbidden West feels like 2 hour long tech demo stretched over 100 hours. Just doesn't make for a particularly good experience overall.\n\nThere's not enough done here to keep me interested in the series. \n\nSorry, Guerilla. You seriously really need to step up your game next time. \n\nDownsize. Seriously. Zero Dawn and Forbidden West would be much better games if you guys didn't have a fetish for copy/pasting several miles of the same boring and repetitive shit all over these giant maps. \n\nIf you guys cared about the quality of the content that the game has to offer as much as you did creating the incredible graphics, we would have one of the greatest games of all time.\n\nBoreizon: Borebidden West.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hi all.\r\nI thought to write this review for those whom this may be a good read, or perhaps entertaining. This will contain a bit of spoilers but to attempt to show the depth of the experience of the game, I require to name a few things.\r\nI truly wish to stress that this is a magnificent game, the graphics are gorgeous, and most importantly, the game delivered in terms of the story. That was my primary basis for buying the game. I have also played the first game, 3 times to get all the achievements, however, this is where the sequel, i believe, fails in many ways. \r\nTo add more to a positive side, I appreciated the improvements of \"valor\" skills, the glider and extra new weapons, these additions were just fantastic. I was so happy when I played over 20 hours to explore these new things. However, as the game progressed, so did my dissatisfaction with it. \r\nThis game, primarily, does aim at combat. Of course, you have many ways to always attempt stealth, but, say items like final boss of a cauldron, stealth is not exactly an option there ( for a full fledged fight ). Perhaps you can try to use smokebombs, but I never went that route, seemed a bit too much. When it comes to combat, i believe new additions were these statuses, like if you are smashed by a machine, you have ( and i counted ) up to 3,4 seconds to stand up, or sometimes you cannot run away if you are stunned. You can move, but, not at full speed. Perhaps I misremember but I do not recall such limitations in the first game that if you are hit, it takes you that much time to stand up ( to be frank, I played the game, the first one, 3.5 years ago so I may misremember ). Still, this seems to be this concept of poise ( like in souls game to which I have passed many ), but it just does not fit somehow. I found it constantly frustrating when fighting against apex monsters that if you missed the timing on a dodge, you have this annoying pause before you can stand up. \r\n\r\nAnother aspect, which I believe was done horribly in the game, is the concept of stash. I fought and apex monster ( thunderjaw ). I had exhausted all my health ( even the extra health i gathered before the battle. I respawn at a campfire. In my stash I have 216 medical berries. Because it is just a campfire, I cannot access my stash :) Brilliant decision! In order to access stash one must teleport to either a shelter, or collect items again. The concept of a stash is, you should be able to access it most of the time, perhaps not during battle of course, but once you respawn after death, have access. Unfortunately, that was not the case. But this is not all! One you teleport to a shelter or somewhere else, besides waiting for 2 seconds for the teleportation icon to finish loading, it asks you for a confirmation whether you really want to teleport. I guess i sort of see the logic here. I mean, you teleport to a campfire that you selected and then you need to reaffirm, after waiting for a bit, that it is INDEED the campfire you wish to teleport too :) \r\nClimbing. I am not entirely certain but something has definitely changed in the mechanics. Here, I wish to really express my gratitude towards developers for adding the \"guidelines\" of where you can see where one can climb. In the first game, I believe there were no indicators so I did a lot of trial and error. It was fun however :) here there are, but, the most frustrating aspect is, when you climb, if you are off, at least in my case, by a millimeter, you cannot climb up. If you click once right or left, then you can climb. It was so funny because the small mountain i climbed was pretty much the same level of height but it just would not allow to me jump up. Not sure why. That was very appreciated when running away from a thunderjaw and he grabs your a.. because you did not move a millimeter to the right or left :) It was definitely appreciated :) \r\nMoving on. Underwater. As from the trailer, we know we will be able to do some underwater exploration which is phenomenal, but i found controls of going up and down, e.g. when hiding form monsters, were rather clunky. Not certain if it was due to a PC issue, but it was definitely not fluent, not as I had expected.\r\nMounting of machines. Here, I also wish to express gratitude to developers for the cool opportunity to be able to ride overridden machines. However, once more, the controls were clunky. First one can increase speed, as soon as you hit a small bump, all speed is gone. I know the machine can jump, since the machine has a habbit of attacking me whilst jumping, but a small rock, the machine cannot jump over :) I just really did not understand the mechanics there.\r\nLastly, the arena. I really wanted to share this. There is a mission, to fight against two machines ( new comer level roughly ). I fought, then, during the fight, two more machines appear from underground. SO whilst I attempt to kill the bigger machines, i constantly get attacked, pummeled into by smaller machines that were not on the menu :) I smiled of course and thought if my math was wrong. 2 machines means 2 enemies right? not 2 and then 2 more crawling up from the earth :)\r\nAll in all, considering these new mechanics into play and a lot of combat ( i play on Very Hard ) i think that there are quite a few things that desire improvement. I will attempt to finish the story but these constant issues with combat, odd teleportation mechanics, climbing cliffs where you need to be a precision \"climber\" so to speak, i just had hit a brakepoint of - \"I had enough\". I will take a break for now and finish this game later.\r\nTo conclude, I really wished to have a middle button here since the story and graphics are just to wonderful, however, in a game where you need to fight a lot, the mechanics need to be improved a bit, or, reconsidered perhaps. Therefore, for now, a thumbs down. \r\nStill, good job team for delivering this. Solid game. Thank you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to like the game, but Aloy is... ughhh... awful dialogue, I just dont like her",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Edited review:\nAfter playing this game for about 12 hours, I began to realize that it grows on you. The interface (in my case, PC keyboard) takes a while to get used to. My first review was to hasty. I just finished the Tower climb for the large stash that turned out to not be so large (a quest after Eloy finds the real GAIA). By now, the keyboard is become more automatic and keystrokes easier to remember (from many repetitions). The moral of this review? BE PATIENT when learning the game. Also, the graphics are first class and runs great on Medium setting using AMD Ryzen 5 2600 and a RTX 2060 card running at 1980 x 1080 @ 60 Hz. Sometimes it stutters, but most of the time it's smooth, medium settings. Now moving on into Burning Shores. Seems to be more cut scenes than in the first part.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Everything runs fine. Gameplay fun. I stopped playing and uinstalled it. I just could not like Aloy as a character. She comes off ass cocky, narcisstic, ungrateful to people who just wants to have a normal conversation. \n\nShes puts on a temper tantrum and this I am a strong idependent woman vibe. Need no one to help me. Jeez cant you just say be genuine and say thank you when people wanna help you. \n\nAm sure the majority will like this game. Personal Aloy personality ruined the whole experience for me.\n\nGoing back to Tomb Raider.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game constantly crashes due to a supposed GPU driver error. In order to get it to play you have to revert to drivers from almost a year ago, this is from some research i just did before writing this.  Because of this i will not recommend this title. This \n isn't the only game i have so having to revert drivers just to play one game is a bit  ridiculous. So far  in 18 hours of play it has crashed on average every 1 to 3 hours. I run a  9800x3d, 32 gb ram and an rtx 5060ti. These errors really need to get fixed, i am not the only person dealing with the issue, apparently it's been happening for over a year.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun gameplay, but the game is still kind of buggy - if I ever alt tab out it just stops working and the faces glitch out consistently unless you turn off NVIDIA Reflex Low Latency. Nixxes Software did a bad job with the port and it is disappointing that there are no more patches.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm so disappointed in this game. Having played the first game so much, on both PS4 and PC. And then this piece of crap comes along. On PC there are endless bugs, pop in. Lighting effects are just ugly as sin. HDR is terribly implemented. Textures look raw and low resolution. Sharpening effects are used to make them look more detailed but it's just ugly. Lighting is terrible going from over exposed to under exposed from one scene to the next. I spent hours trying different lighting settings, monitors, mods - it just looks like s*** a lot of the time. And for several hours at the start of the game there's a disgusting yellow haze layered on top. The plot might be ok, but I honestly suffered so much through the revolting lighting I couldn't bring myself to play more than 25% in. Large sections of the platforming are very dull and a big section of the game insists of playing through without a save point , creating extremely annoying repeat sections. I have tried and tried to enjoy this game but I think I'm just going to admit to myself it's a mess, it's not fun and I'm backing off. Perhaps in 10 years someone will remaster it and make a game worthy of 2025. This isn't it. Avoid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too bloated. Plot is kinda lame. Everything is a written log or audio log. I'm not interested in fake AI tech, or they didn't make it interesting enough. I wish it was more grounded. Keep the robots but imagine restoring the world by rediscovering IRL technology from the 2020s, that would be cool. I don't like none of the NPCs. Aloy is great but she can't carry the whole game. Gameplay is fine, probably the best part. Graphics are well optimized. Please buy when it's very very cheap",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is loaded with stupidity.\n\nfrom broken combat to recycled avatars left and right, it is an absolute terrible game from the first one. \n\nthe enduring is such a tilted fight that it should all around be removed. you get a spear and a bow. the enduring gets exploding arrows. yup real fair.\n\nevery place the studio could have recycled a character models, they did. \n\ntheir are glitches in the map where you can fall through.\n\nfor a major studio release, this is absolutely terrible work.\n\nduring burning shores, a lot of audio dialogue  during cut scenes doesn't load. From Aloy no less.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pros\r\n- Beautiful graphics and amazing scenery.\r\n- Well performed mo-cap and high attention to character details.\r\n- So many different weapons to choose from now including traps to customize your gameplay and strategy.\r\n- Many different armors to choose from, dyes and even select another armor you aren't wearing to have its looks instead. Make your Aloy look how you want.\r\n- Aloy at least remembers how to override and mount chargers right away.\r\n- New and engaging machines to conquer.\r\n- Aloy eventually makes friends.\r\n- Cauldrons are back.\r\n\r\nCons\r\n- Even in the very beginner zone and beyond you are not rewarded for exploration but instead punished for it. Just about every single area to explore you are met with walls with which you require a device upgrade to your spear in order to proceed. Not once, but two different devices to get passed these locked areas. On top of this almost every single water area requires a rebreather device to gain access or be drowned. You are required to proceed who-knows how long into the story FIRST...in order to unlock said devices. By then you are already somewhere well into the third large map location and far too busy saving the world in order to back track to the beginner zone to get some maybe ok gear from these locations. The progression of this game is absolutely terrible. Do not explore the map until you have finished the story, unless you want to be met with wall after wall you cannot pass.\r\n- Aloy is one of the only people on the planet that can access certain locations to save the world. What does she do? Push literally every single friend and supporter away stating she \"has to do this on her own\". Meanwhile she almost dies multiple times had they not muscled their way in to helping her.\r\n- Aloy may mention some helpful tips when scanning things but the rest of the time she will say the same line over and over and over again. Mentioning how a certain environment weapon may assist her...even when you are literally in the middle of using it. I found myself yelling for her to shut up on more than one occasion. Between her girl-bossing attitude, pushing every friend away or reluctantly accepting help and endlessly talking to herself about a puzzle or scan, I ended up hating her character. I loved her in the first game.\r\n- Bugs. So many bugs its unreal. From graphical, combat or even functional systems. Wandering tribals just standing there and hanging out under water, settlement npcs walking into and becoming stuck on each other in hilarious fashion, machines attacking me with only their weak point parts loading in, flickering screen and the list goes on. I manage to take about 10 screen shots of these glitches in one day.\r\n- Apparently Aloy can climb a sheer cliff of a mountain if shes scripted to do so. Otherwise she hasn't learned the fine art of climbing a chainlink fence. Or any other surface that looks like a child could climb. Some ledges have that ugly yellow painted ledge which is not needed since you can use your focus to view scalable surfaces. So why have some ledges with the ugly paint...and others without? Don't know.\r\n- Everything feels scripted in this game. From your exploration of the map, to climbing ledges, social interactions and even the combat. You might THINK you are in control of what's happening on the battlefield but you are incorrect. If the machine is going to hit you, its going to hit you. I caught them on MULTIPLE occasions where they jumped at me and while I dodged to a random side, they moved MID-AIR course correction right on top of me. Don't believe me? Go watch a video on this. Even in some cases where you dodge so far out of the way, the AOE somehow still gets you regardless. Maybe it's like the machine version of a critical hit, its going to hit no matter what you do? Don't know.\r\n- Solid rocks and concrete walls will shatter like glass before the machines but trees are straight up invincible. Never use solid stone for cover.\r\n- Chugging berries like they're going out of style. Potions take too long in the heat of battle.\r\n- Couldn't finish this garbage, watched a video instead to enjoy the story and lore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just a open world ubisoft game in disguise, too big, boring but looks good",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Theyre allegedly developing AI voice of Aloy without the voice actor even knowing. Even if they weren’t, it’s still a less compelling version of Horizon Zero Dawn’s story and characters. Gameplay has slight improvements.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Inconceivably bad compared to the first game.\n\nThe story is shallow and boring, there are zero likeable characters (everyone is rude, ignorant, or malicious), combat is atrocious and I've never been stunlocked so badly in a game, the companions in combat are completely useless and will never actually kill anything, I've had to Alt+F4 because of getting stuck in menus several times, grapple points and the ability to climb in general just stops working, forcing a reset, the skill system is convuluted and most are useless, and the movement is the worst I've experienced in any third-person game; just getting Aloy positioned for a jump is an enormous chore.  The movement, combat, and skill controls are unsalvageably bad, and rebinding keys and controls to make one thing work better, will just make something else intolerably difficult to do.  It is rare that I do not finish a game, no matter how bad, but this one belongs firmly in the \"games so bad that they are not worth playing\" club.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The good:\r\n-The graphics are excellent, and the vibrant, theme-park-like open world is genuinely fun to explore. \r\n-The machines look fantastic, and the overall concept remains strong.\r\n-Great sound design.\r\n-Gameplay is generally better than Horizon Zero Dawn\r\n\r\nThe bad:\r\n-While the gameplay has improved compared to Horizon Zero Dawn, the story has not. It feels overly childish and Marvel-like, with characters presented as either good or bad, leaving little room for nuance (but maybe it was like this in the first game too, I'm not sure). The writing generally leans heavily on clichés and poor dialogue. The major reveal from the first game removes much of the mystery this time around, and the narrative struggles to stay engaging. Furthermore, in my view, the main character’s frequent arrogance and lack of gratitude toward both allies and strangers made it increasingly difficult for me to continue the main storyline. Her ability to instantly judge who is “good” or “bad” also undercuts potential intrigue.\r\n-Aloy talks to herself constantly during gameplay. I don't need her to incessantly state the obvious.\r\n-Far too many “go rescue that person” side quests, which quickly become monotonous.\r\n-The platforming is mildly interesting at first, but turns into a chore not long afterward.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I mean if you like the combat of the first game then this might be for you. i played then hardest difficulty on the last one and it wasn't to bad but Ultra Hard on this one can actually lick my balls. Also fair warning you can not go back on ultra hard difficulty and will be locked in. (Had to restart after like 9 hours in)\n\nIdk i felt like Aloy an the rest of the characters this time around where super lifeless and just plain.\nThere were part of the story that I thought were cool, but this one felt like chore to finish. Again if you liked the first one you may like this one. \n\nAlso biggggg point, during the game you get to make choices on dialogue. I swear I got to choose like 3 times and I have zero clue whether they affected the story in any way.  What the actual fuck does that do. I'm writing this after I just finished the game, started the DLC and uninstalled because i thought of whether or not I wanted actually continue playing it or not.\n\nTLDR - Buy it if you want/care about the progression of the story and like the Zero Dawns combat.\nThey will probably still nostalgia bate me into buying the next game in like 7 years when it goes on sale lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i can run all games with no problem but im having graphical issues with this one. \ndont buy it full price.\n i get flashed every tim i try and fight.\nrate 3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is buggy and decidedly worse than the first one as far as character acting and intros goes. \r\n\r\nVery first objective to interact with an object failed horribly. Google says its a known bug that can happen to anything requiring \"examining\". \r\n\r\nNot recommending based on the fact this game is a year old and managed to dissapoint me in record time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great story, great gameplay, insanely poor optimization.\n\nThe extended screen times, lags, cutscenes without graphics, and DLC that is even worse optimized than The Last of Us would still be passable, if it weren't for a bug that locks your character for 5 seconds in the last action they were performing, which happens as soon as your CPU is a bit overloaded. \nThanks to their significant investment in optimizing the game, this happens VERY often, especially in certain cauldrons such as Tai or Theta, or in the open world more generally, where you can spend more half your time stuck walking in one direction, sometimes even throwing yourself into the void.\n\nThis is the only game I know of that decides to block player inputs to manage CPU overload, and it's a shame.\n\nI imagine that this tiny studio has absolutely no way of paying a developer to fix this problem.\n\n8.5/10 without optimization into account, 5/10 with.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A downgrade all around from Zero Dawn. The story is a huge let down. Both endings, the main game and DLC, leave a lot to be desired. I doubt I'll play the third as the story just isn't worth following after this disaster.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The graphics and the open world look great. Too bad the story and characters are really boring.  Aloy is a lame protagonist with no personality or interesting traits whatsoever.  The side characters are the same and I couldn't have cared less about them.  The gameplay is mediocre with bad climbing mechanics where Aloy would miss jumps or only grab ledges when she feels like it.  Battling robots feels worse in this game than the original with no defense moves other than dodging which hardly ever works.  I give this game a 5/10.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "6/10 - Game feels overwhelming for me to personally play. First game felt much more enjoyable due to its smaller open world.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really lost my patience about 7 hours in and just started skipping every line of dialogue and cutscene because theres just way too much dialogue. Every quest is a cutscene. Want to hear a rumor? You're locked in place for 2 minutes listening to dialogue. New merchant? More dialogue. Trying to use your brain to solve a puzzle? No worries the character has dialogue to solve it for you\r\n\r\nEnemy AI is way too buggy. Tends to just completely break in some areas and it really just takes you out of the experience. \r\n\r\nThe game tries way too hard to be cinematic at times that combat just doesnt flow. Melee is still trash maybe only useful when fighting one enemy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good game..... with too many visual glitches.\n\nFlickering lights, shadows, textures. Occasionally screen turns black.\nBut since there wont be any updates to fix this. I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "tela preta muitas vezes, má otimização, queda de fps, travamentos e crashes. Nunca vi um game dessa forma. Apesar disso, o jogo é lindo, história boa, gráficos e jogabilidade divina.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Frustrating in all the wrong ways, none of the good. So repetitive I almost fell asleep several times (in the day time). Yeah the game is beautiful that's true, the lore is full, the map is big (yeah too big) but why am I so bored... I am trying so hard to like this game but to be honest I have no idea why. I'll keep on trying to see it through but the fun is not there for me. Loved the first one, but to each their own I guess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SPOILERS DONT READ IF NOT PLAYED\r\n\r\n\r\n\r\n\r\nBeautiful game no doubt stunning graphics for a 70 GBP game  though thats it. Flat voice acting too much stupid stuff suddenly space aliens Beta is annoying I guess we'll have a third clone of Elisabet Sobeck after this who is evil as the final villian as everything seems to be about Elisabet Sobeck. They killed of Varl in a stupid way - he was my favourite  Aloy I understand her stress but shes plain boring and has 0 development as compared to the first game where we actually saw the character grow. Enemies are bullet sponges combat is shit resource hunting is a chore a large downgrade since HZD which was the first game I got on the PS4 - I played it 7 times - this game I played twice and couldn't bring myself to get past the first Tremortusk even after beating the shellsnaper cause it was so boring... genuinely beatiful but thats it nice graphics average gameplay boring story.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cringe. I didn't even make it through the intro. Why are these PlayStation games so bad? If the main character is annoying, there is no I'm way going to make it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The dialogues are written as unenthusiastically as the story itself. The first mission was so bland and sad Ive refunded the game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Unfortunately I have to give this a no. There are numerous issues that make the actual game frustrating after about ten hours. \nI just don't understand design decisions that are there to frustrate the player.\n\nFirst the good.\nThe game is beautiful. I didn't see any areas that weren't amazing looking.\nI didn't have a single crash or loading issue. When I went to an area all the textures were loaded properly.\nI had zero pop in that I could notice so whatever the devs did I wish more companies would do the same.\nGood job on that, seriously.\nMusic is great. Mostly the same as the first game which is good. Loved the sound track of the first game.\nSound design is weird. Some weapons sound punchy and great then some others are very weak. \nThe bow needs more snap to it in my opinion,\nThe world is big but I didn't find it to be bloated like a ubisoft game. Every region has unique enemies which  works well and doesn't feel out of place.\nTransmog is nice.\n\nA few nitpicks before the bad.\nGated areas that need an upgrade are kind of lame. When you do finally get these upgrades you just find mostly trash loot to sell instead of some actual cool gear. You get some greenshine from some of them but all in all I found them to be very disappointing. Almost every question mark on the map was one of these locked areas so I just stopped going to them until I got the upgrades which killed my enthusiasm to explore since all I was finding was mob sites and campfires.\n\nHaving to unlock overrides after I complete a cauldron doesn't make any sense. \nIt's an extra step for no real reason that I can see. Worked perfectly fine in HZD.\n\nSupplies for fast travel is very strange. After an hour or two I never had to worry about it again.\nJust like the first game it becomes an ignored mechanic after a little while.\n\nThe story so far doesn't really grab me in anyway. I just got my third GAIA piece and I'm just kind of meh.\n\nTime for the bad.\nKnockdown is so bad I cannot believe that it's in the game.\nYou will get juggled constantly with no way to recover except watching Aloy get up super slow. \nAt first it's not that bad but after the arena it is consistent. There are no skills that help. No gear that helps. You would think that there would be a button prompt or something but nope.\nThe Tideripper is the worst for this. Leap attack, ranged attack, sweeps, AOE.\nThe water jet AOE is the worst attack in the game. It will spin around for a very long time and stagger you while you get slapped around by it's other attacks. This is a constant issue and ruined my enjoyment of the combat. \nI found some attacks are unavoidable as well. They removed the long dodge from the first game and added a stamina to the roll so after three rolls you get tired. Incredibly stupid.\n\nClimbing is so messed up I hate it. \nThere are cliffs that you should be able to climb but because they have no anchor points it's a big nope.\nSometimes you just stop for no reason and get stuck in place. Only way to fix it is the try to go back the way you came even though there is a yellow X five inches in front of you OR you have to jump.\nSome posts have anchor spots but you just jump past them instead of on them. Other times you want to jump past them but you aimbot right at them. \nSame with ledges. I'll have enough momentum to clear a gap easily but it will slow me down in mid air and point me to the ledge so I can grab it. Why is this a thing? \nWhy does Aloy climb the vents in the cauldron like she's learning to climb stairs like a toddler? It's the same width as a ladder? Why is this a thing?\n\nDEI.\nLook, usually I don't really care about this. For me most of the time I'll usually just roll my eyes and move on. Almost every quest giver is a woman. Almost every person in power is a woman. \nCouple of examples. The Tenakth are a warrior culture that respect strength and reward victory but then they have multiple women as chiefs. What? That doesn't make any sense at all. It's not just one either it's all over the place. You have to always rescue men. Men are always injured. It's always men that have to prove themselves when all these women don't. \nYou mean to tell me that in a world as savage as this they have the women going out into the wild instead of having babies? I know this is fantasy but come on man. Every woman is super strong, wise and knows best and all the men are cowards, weak and idiotic. \n\nAloy is a bitch.\nShe didn't have this much of an attitude in the first game,\nThere's a line very early on that she complains about Varl's beard and when he says he'll shave it off she says \"Good.\". What the hell is even that? She has a problem with men growing beards? I don't understand why this was even put in except to demean Varl. She has multiple instances like this and just has a chip on her shoulder when interacting with anyone. Where is the empathy? This doesn't make her strong it just makes her unlikable.\n\nAloy won't shut up. \nOh my god it's bad. She is constantly yammering non stop. I even got a mod and she still goes on too much. I don't need a narrator for every little thing.\n\nHaving multiple interactive buttons.\nOkay, what do I mean by this? \nI use a PS4 controller and interact is triangle. Then you have pry open is R2 but sometimes you have to hold it then sometimes you have to just press it once. Opening a door is triangle but hacking a door is R2 that you have to hold but hacking a robot is triangle. If your not is the right spot you'll just power attack the door. Happens all the time to me.\nThen there's the wreaths in which you have to hit it three times. Wait for the animation to stop because you have skills that are tied to delays. Then hit R1 to use the flower.\nWhy? Why do we need this many interact options? Just use triangle man. Why is it so obtuse?\n\nHolding X to use, sell, buy, upgrade, move to storage, craft ammo. This needs to stop.\nEvery game these days does this and it is stupid. I've never heard a single person say \"I think the holding down X to do anything is cool!\". With all the menuing you have to do it just becomes a massive waste of time. It's not like you can't buy back an item if you accidentally sell it and if you upgrade the wrong thing you can just go get the items again. So why is this even a thing?\n\nA lot of weapons do the same thing.\nHow many more weapons do I need that do blast? I had four different weapons that basically all did the same thing at one point so they stopped having a real roll to play in combat.\nIf there's an exploding javelin why can't I have an exploding arrow?\n\nI love HZD but HFW just isn't there.  Too many issues that top up after about ten hours and it progressively gets worse. I'm going to finish it to see what happens but I won't bother with NG+ like I did with HZD.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a good game when it decides to grab a ledge. The worst climbing ingame there is i've played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT MAKE THE MISTAKE I MADE! This game is one of the most boring and pointless games I have ever played. The graphics are good, but you can say that about any game. Please take my advice and do not buy this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game doesn't even have adjustment for brightness in PC... for f.... sake what were you thinking while designing the game?......................................",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant do a thing in this \"game\". no freedom, feels like chore.\nthe dialogue is boring, basic and annoying and the storytelling feels like an insult",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Movement feels so bad that i honestly cant fathom myself continuing my playthrough",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Steam Review Horizon Forbidden West™ Complete Edition\n\nI honestly regret buying this game. My PC is strong enough to run any modern AAA title smoothly (RTX 3070 Ti, i7-13700K, 360Hz monitor), but no matter what settings I tried, the game looks bad. I spent around 90 minutes only adjusting graphics options and nothing helps. Textures keep changing and flickering during gameplay, faces look weird, and the game is full of bugs. It feels like a broken PC port.\n\nThe controls are uncomfortable, the movement feels stiff and annoying. The menus and keybinds are not user-friendly at all. There are missing subtitle options and a lack of proper explanations for controls and features.\n\nThe graphics are far from impressive for a modern game. I’ve seen better visuals from older titles. Considering the high price, it’s just not worth it.\n\nI expected a polished next-gen experience from a big Sony franchise, but instead I got a messy and disappointing game that doesn’t respect the player’s time or money. For me, it’s not worth buying. 😕",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm not sure where they get open world from. This game is very linear. One path, one solution no real variation. If you like that type of game the graphics are great and the combat system works well. It's just not my kind of thing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Annoying downgrade from the original game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I went into the first game not expecting much based on the premise, but the story and atmosphere managed to blow me away with its unique premise and quality all its own. Unfortunately, Forbidden West does not carry this forward. The game play is by and large the same as Zero Dawn, with an expanded roster of weapons and enemies, and if that's all you want then I would recommend picking this up in a sale. It's those two parts of Zero Dawn, the story and atmosphere, which are severely lacking here with only a few exceptions within the main story-line.\n\nThe best way I can describe the problems this game has, it would be to say that it is far to eager to oblige. You will come across characters and situations that are brushed off as to not challenge Aloy and the player in a manner that becomes difficult not to notice. Characters will often either be entirely filled with positive or negative traits with little room for ambiguity, leaving most outside of the main cast feel by and large the same and you will know the outcome of plot-lines within a moments of beginning them.\n\n-Spoilers ahead- \n\nYour friend is in town and doesn't like the local magistrate? Don't worry hes mean, overworks people, doesn't care about their safety, AND he caused the machine rampage in the area. Companion doesn't like his old rival turned chief? Don't worry no one in the tribe likes him and when you blow up their wall symbol of the clan's might, they'll all make fun of him for it and not care whatsoever for the cultural value of it, even the tribal elder. Faro's Tomb? Faro's villainy is amped up to 11 and nothing is added to his story of character that isn't moustache twirling evil. No incorrect and poorly justified pretense behind a horrible decision associated with his obsession to right his wrongs like he was in the first game, hes just a moustache twirling Saturday morning cartoon character here. The C.E.O. who forces you into the tomb? Turns out despite being a religious, cultural, and political icon no one cares that he's dead because 'He was an asshole anyway' and \"he manipulated our beliefs\" because people talk like that.\n\nThis extends to non mainline content as well with only a few exceptions. Nearly every situation is just unambiguous and will not challenge the player or world, people are just neatly divided into camps of good and bad. Tenakth elder's grandson joined the rebels? nah turns out hes a hero who was entirely trustworthy and turned himself in to save everyone. An Utaru village is under attack? Don't worry it's the rebels and we don't like them already. You need to break into a Tenakth prison to rescue a Carja? Nah don't worry the rebels recently took it over, and the character you came gets to leave with their head held high.\n\nTo be clear the exceptions are there, most of the main companions and Gaia are all great in their interactions between each other and Aloy. Especially Varl, and I didn't even like him in the first game. However, they can't hold up the whole game and even Aloy just devolves to a plank of wood when she's interacting with most other characters. Wish I could recommend this game but I just can't bring myself to finish it. It got just too predictable by the end. Watched the remainder of it on youtube after I defeated Regalla, and can't say I was wrong in that assessment.",
      "voted_up": false,
      "votes_helpful": 120
    },
    {
      "review": "The game is not quite as good as the first. My rule of thumb is \"less is better\" especially when it comes to videogames. HFW may have improved gameplay and more mechanics but it feels overwhelming to a point it can get boring.(Lets not mention the side challenges). The game also has many more weapons, ammo types, armors that sometimes feels redundant and to upgrade them is a real PITA and grindy. I hate grinding but maybe I'm just getting old and don't have the time to play those kind of big games that require big investment. Less is better, HZD, while still being a big game, was more self contained but this sequel is just too big, bloated and sometimes it feels like work. I would recommend to just go for the main missions if you play this otherwise you can get a bit annoyed and bored. 6/10 i can not recommend it cause i would rather play HZD again on ultra hard than this. games should be fun not a job you have to complete",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "I've just finished all side quests, rebel camps, rebel outposts and I'm on my way finishing the drones and black boxes. I do enjoy this game, but the combat (specially the difficulty) design is so atrocious that I end up getting more annoyed than having fun while playing this game. Since I have only two options here: To recommend and To not Recommend, I picked the latter. I'll try to explain my feelings about this game:\n\nTHUMBS UP:\n\n- I absolutely love the scenario, all the colors, flora and fauna. The tribes, everything is spectacular. The art design is gorgeous, all the details on the machines were meticulously crafted. The soundtrack is not a masterpiece, but it's above decent and gives more emotion to combat against big machines. I loved the amount of weapon choices and playstyles we have access to in comparison to Zero Dawn. \n\nTHUMBS DOWN:\n\n- The story itself was more attractive in Zero Dawn though, as here we have a few edgy and boring millenia-humans, a bunch of cowards who hide themselves behind a suit, just like an armed man is suddenly courageous in real life but is in fact a petty chicken without a gun. The Tenakh arc is awesome, but that's it. I haven't played the DLC yet but I've had major spoilers about it. \n\n- I have nothing against above-weight characters, chubby characters or whatever, but her head is stupidly bigger than her body that I don't know if it's funny or lame to watch. There are a few outfits that you can clearly see her legs and arms, and they are so thin that her head looks out of place. Speaking of legs and arms, why is a nomad warrior who climbs mountains, swims a lot, hops on trees and fights machines so skinny? She spent and spends 99% of her life in the wilderness, her body constitution makes no sense to me. At this point Last of Us 2 Abby would make more sense. Also, Aloy herself is a bit less \"human\" in this installment with almost 0 personality.\n\nTHUMBS TOUCHING THE GROUND OF THE REALM OF SATAN:\n\n- Pit Challenges: Making a mode encouraging melee is great, but when melee is completely useless against machines (unless you play on Story difficulty), there's no point in these challenges and all the dmc-like combos you tried to implement. NOBODY will ever use (or memorize) those combos on Rebel Camps/Outposts and more than 50% of the Warrior Skill Tree is a complete waste. The challenges are either extremely easy or extremely annoying/difficult. Honorable Mention to the Pit Master in Thornmarsh. How drunk was the guy in Guerilla team to come up with the idea of a fair melee combat bringing a coward p*ssy shield into the fight like a little girl? It was completely out of line and broke the immersion entirely, if that was in a tabletop RPG I'm pretty sure any player would call that guy a fricking pathetic coward. How do the Tenakth respect that coward as their Pit Master? Funny enough he kept almost insulting me for using a bow when he was hiding behind a shield, in again, a \"fair\" combat. COMPLETELY STUPID. The Enduring Fight was awesome though, but the story behind it kinda predictable and boring.\n\n- Big Machines are Elden Ring God Superbosses with 0 balance: Getting into the things that led me to rate this game as a \"I don't recommend it\" I should note that I started my playthrough on Very Hard. I love hard games and I always pick the highest difficulty, the only reason I didn't pick Ultra Hard is because everywhere people say it is intended for NG+. Like I mentioned in the very beginning, the machines design is superb, all their details, their movements, it's awesome! But that is where their beauty ends. For the context, I'm now on the very last main quest with all side quests completed and all non-DLC machines killed with every of their variation, which includes Apex. I'm on the 4th part of arena (will discuss the worst part of this game in a few) having completed all the first 12 challenges on Very Hard as I refused to lower down the difficulty.\n\nMost of the bigger machines break the laws of physics, the laws of common sense, they do a 180° turn during their skill movement while in the air in the middle of the animation if you dodge/jump/run...why  is that? Oh, it's because they are machines so they can. Why is this shellsnapper hitting me with its cannon when it's bound in the ground with ropecaster and stunned by shock? Oh, it's because it's a machine, so it can. Why is the same said shellsnapper literally teleporting dozens of meters with a burrow movement? It doesn't even have a drill. Oh wait, it's because it's a machine, so it can do whatever it wants.\nIt's not only the shellsnapper, every big machine can attack you even when immobilized and stunned...what the f*ck is that? It's because they are machines, so they can.\n\nI've defeated all apex machines, including Tremortusk, Slaughterspine, and I can \"farm\" them efficiently, but they are still one of the worst things in this game (big machines in general) when it comes to combat. Who was the mentally disabled person who designed Tideripper? You can get stunlocked by its Tidal Disc's waters, which brings me to the question: Did you guys in Guerrilla have someone to review these atrocities? You agreed to that? Oh yes, they are machines, they can do whatever they want.\n\nAt this point I feel I'm fighting Divine Entity Versions of Transformers. I still can farm those easily, but the fun is 0 because I either cheese them with Ropecaster>>>Frost Ammo>>>Boltblaster, I stunlock them with Ropecaster and do whatever I want, or I struggle with totally unbalanced and unreviewed movesets like I did when I was low level with blue weapons. The game is extremely easy on anything below Hard Difficulty, and is extremely r-word on Very Hard and Ultra Hard, it's cheese or be cheesed.\n\n- Why there is a fricking alligator living in harmony with anteaters? Why there are deers living in harmony with a fricking 10ft-height bear? Why every time I go to hunt a machine, instead of finding a horde of those machines, I find them accompanied by other \"animals\"? Because they are intelligent machines? If they are intelligent, why they attack people on sight like irrational animals? Why they behave like animals? It's so annoying to go fight a Frostclaw just to find 6 other machines of different types around it, it makes no fricking sense! If they are data meant to replicate animals, Gaia did it wrong, you don't see a bear partying with alligators.\n\n- The Infamous Arena: There is a reason 90% of Horizon fans hate this mode. Who in their sane mind would allow such atrocity to be launched in the game? From the dumb metal shards cost to the nullification of certain builds (stealth) to the herp-derp Locked Loadout. NOTHING is fun about arena, NOTHING. You either overlevel it, cheese it with very specific stuff, reload for the perfect rng, or get rekted. There's a reason most players just change to Story difficulty to play the arena, this is the proof the Arena if a big fail and whoever designed it should be fired.\n\nFINISHING:\n\nI'm a big fan of Aloy and her adventures, I love the post-apocaliptic USA, but I can't agree with the big amount of bad decisions taken in this game regarding level design and combat. I usually get more pissed than have fun while playing this game because the combat is so unbalanced that it makes me sick, and on the lowest difficulties the game has no challenge. I hope the third game is a better experience just like Horizon Zero Dawn was, and I'm looking forward to the Horizon MMO.\n\nDon't get me wrong, I don't hate this game, I just hate the Godlike Gundam/Transformer behavior on Very Hard, and I'm pretty sure I'll uninstall it by the time I start my Ultra Hard run. I do love everything that is not combat though, and the big head-emotionless Aloy (she was so cute in Zero Dawn). I'd give Forbidden West a 6.5/10",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Loved the first game but I just can't get into this one. Everything feels worse somehow - the story, the characters, even the graphics (apart from the character models, which have been greatly improved vs the first game) - the environment looks oversaturated and somewhat grainy no matter the settings for me. But what really killed it for me was how clunky Aloy felt to control, both in and out of combat.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "Not as good as the first game.\n\nGets extremely boring at the end if you want to upgrade your stuff because there's only 2 locations you keep going back and forth to. Not just because you need many items from a certain machine, but because there's only 1 spot on the entire map where they're at. Why the heck did they even make a bigger map then?\n\nAlso fast travel has ridiculous loading times at certain places. And a number of tiny annoyances, for instance plants spawning inside of trees so you can't harvest them. Text boxes blotting out the view for no reason. The valor crap doesn't trigger properly and character jumps instead or stops halfway in the animation. Stuff sinks into the ground, not just loot but also your mount. etc.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Maybe I just didn't notice this in the first game, but the dialogue is so bad in this game. Every character is just some overly sarcastic caricature. It's just so unimmersive. Where has all the good writers gone :/\r\n\r\nThe premise has also kind of worn thin due to everything being revealed in game 1. Now it's just another boring hero's journey rehash.\r\n\r\nThought the yellow marks being turned into an AR element rather than just yellow paint was cool lol",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "First horizon was fun, this was chore and boring :( completed more than 50% and I just dont want to play anymore",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "In a nutshell, it's an interesting concept with disappointing execution. Really good graphics though.\n\nI played to see where the story goes next since the first game was really interesting. This game has some good new ideas but overall, a few things made it a poor experience:\n\n- the combat is not good.\nAlloy gets knocked down easily and often. This would be fine if there were a mechanic to get back on your feet quickly, but there isn't. Also, this makes a melee play style far less feasible than a ranged style. And even if you focus on ranged gameplay, enemy machines are extremely mobile and will 100% force you into melee situations very often.\n\n- the game feels bloated and repetitive\nThe system for upgrading equipment was expanded too much or done in a way that makes upgrading gear feel like a chore. There are far too many animal parts and components to get. I'm no stranger to farming mobs to get loot for upgrades, that's just part of the genre, but this felt like such a slog . Upgrades also don't offer much increases in power, so it becomes less satisfying to play especially since the combat is often frustrating.\n\n- the writing\nAlloy can do no wrong, and she knows it. She's powerful and independent and nothing is a challenge to her; not seasoned warriors with superior equipment, not programming and computer sciences which are tough even for geniuses in our era. Characters are largely one-dimensional and the story feels like a glazing project.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Nice story, following on the previous installment, but has terribly annoying features that totally pisses me off.\nEnemies respawns basically moment, you move few meters away from the habitats. ANd this alone is so utterly irritating, that I can not recommend.\nSome graphical glitches and artifacts, when rendering is not working, specially visible on faces.\nToo long takes it to unlock environment traversal equiplent, needed to access some of areas, which is another thing I hate in games.\nAbsolutely disgusting equipment model, where you have to get ultra rare components to get better weaponry from significantly strong oponents, but can't, due to having less powerfull weaponry, thus, obtaining those components is tedious task.\nHeavy weapon usage has become annoying task. Not only it still has low ammo count, but also having it dropped from enemy during combat is hardly a useful tool. Enemies act aggresively and will focus their attack mainly on you (even during group fights). Doing evaision ofc makes you drop the weapon, and you do a lot of evasions. When you try again to pick it up, guess what, enemy is already attacking so you evade (dropping the weapon), a circus, not a combat.\nControls are not at all adjusted for PC. Most annoying is double tap on WASD, which makes you do dodge roll, even though dodge ahs its own designated button. Incredebly frustrating on mall adjustings of possition, which oftenly makes you roll and fall out of edge or grass.\n\nThe DLC is badly designed. Missions where you can just fly on the mount, does not allow you to fly, cuz of NPC, that follows you, so you still have to solve some unnecessary environmental pathing riddles, even though you could just fly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too many bugs to be enjoyable. It definitely seems like the game is a great continuation of the story, but I cannot recommend the game until the vast swath of bugs get fixed. I've got to restart the game every 20 minutes or so because the audio breaks and I can't hear diaolouge, or the menus break and I can't save, or I get stuck in an animation loop. Otherwise, it seems to be an improvement on HZD in so many ways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The first game was fantastic. This game, I wanted to like, but it's just a souls-like hack-n-slash rage game even on easy where you never really get powerful enough to take on apex enemies. Every enemy scales with you, so even at the end, its just getting your butt kicked and knocked down over and over even with the most power weapons and armor. You never feel powerful in this game, like the first one. Story is pretty good I guess, it's just that the game play got worse because of the soul-like difficulty that it never got fun, it's just a giant grind. I get it, it's supposed to be stealth and you have a bow in a world of mechanical monsters.. but holy hell, it makes this game long, when EVERY fight takes forever, and every monster can defy physics and jump across the screen for no reason and one shot you to death. I beat it, maxed level, weapons. meh, I'll never play it again. Not really looking forward to the third one now either if its like this one. Story - Good. Game Play - Grindy Suck. Feeling - Sick of souls-like developers ruining games.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is extremely boring. Much more than the first game. \nThe upgrade system is completely broken and requires a ton of grinding. \nHunting animals to upgrade a pouch is incredibly boring. It's just there to waste the player's time. \nCombat is basic and shallow. Especially when fighting human enemies. \nGritting for dialogs is uninspired and bland. Voice acting is mediocre, as if they got random people of the street. \nCharacters have little to no personality. Most are very basic stereotypes. \nThe player has no agency and just goes from one boring quest, to another boring quest. \nFortunately, most cut scenes can be skipped. \nThe open world is a wide as an ocean, but as shallow as a puddle. \nSome of the music is good, but a good part of it is annoying. \nGraphics are good, but there is a lot of pop in, when traversing the world.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I don't know what it is with Nixxes and the Horizon games, but they've done 3 Horizon games with Zero Dawn, Zero Dawn Remastered and Forbidden West and all 3 are buggy as hell and some of the weirdest ways possible....\r\n\r\nI've had the war paint marking go completely crazy and flicker constantly during cutscenes on any characters who have them, for some reason.\r\n\r\nI had voice audio disappear randomly after playing the game for a while, and then eventually my map and save screen were just black screens before the game eventually froze.\r\n\r\nAt least I can play Forbidden West unlike Zero Dawn Remastered, but jeeesus man, I have PC better than 99.9% of gamers and I'm experiencing issues like this. I can play some of the most infamously broken games like Last of Us Part 1 without any issues, but the Horizon games are cursed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game isn't even half as fun as the first one. Tedious, long stretches of boring climbing puzzles. The parkour platforming is atrocious and made me hate hate hate it, not fun whatsoever. I decided not to finish the game. Wont be returning to the franchise because I hated the jumping around on the yellow paint.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I LOVED the first Horizon game.  And I really like this game... But what I don't like is the port.  There's some sort of graphics bug in the shadow generation.  This cause anything with a shadow to flash black.  A lot of time its the faces, but sometimes the entire screen will flash black. (Can you say seizure?)  Cranking down graphics setting reduces how often it happens, but it still happens.  This is a known problem that's been going on since release, and it's still not fixed.\n\nAlso, I ran into a bug where the enemy humans were invulnerable.  I had to exit out of the game to fix it.\n\nI don't care how good your game is, if a game is buggy on this level it deserves a down vote.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}