{
  "positive": [
    {
      "review": "The Forest taught me two things: chop trees fast, and run faster when something screams in the dark.",
      "voted_up": true,
      "votes_helpful": 33
    },
    {
      "review": "You might not see them but they are watching you, waiting to attack. Creepy and fun survival game. I never even tried to beat the game yet just been enjoying the building part of the game and exploring.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "As a single player it's almost impossible to beat this game alone, But with 3 or 4 people it's alot easier to do things, Like one will chop down trees as 1 hunt food and 1 build houses and together we can go on an adventure. But alone i don't think anyone will have a blast playing this game. IMO",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "An excellent open-world horror best survived with friends. Explore the island and her voluptuous caves, share customs with the natives, find yourself on hallowed ground and, in the end, consider inviting others to your deplorable haven. The real endgame is finding all the ways the TV series Lost copied this game.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I started the game thinking, \"I'll chop down some trees and build a house,\" but three days later, while trying to diplomacy with tribes in the forest, an eight-armed mutant jumped out at me.\nI think sitting by the fire at night wondering, \"I wonder if that sound is the wind, or a naked creature watching me?\" is the epitome of The Forest experience.\nThe building system is really solid, but let's be honest—in Sons of the Forest, we cut the wood more precisely, more like an engineer. Here, while trying to build a house, I often accidentally throw a log into my friend's face.\nDescending into the caves is a whole other level of torture. Your flashlight battery dies, your torch goes out, and then you panic in the dark with nothing but clicks and clicks.\nThe story, however, turned out to be much darker than I expected. I went in thinking, \"I'll find my child,\" and ended up forgetting my sanity somewhere in the forest.\n\nIn short, The Forest is more like a \"group therapy with a nature walk\" than a survival game.\nYou're scared, you laugh, and eventually you wonder, \"Why did I build this house next to a cave?\" You ask yourself. Sons of the Forest may be more technically advanced, but none of them can surpass the primal fear of the forest, the primal fear this game inspires.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This is definitely the best co-op horror experience out there,the amount of content this game offers is insane.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Played with friends — started as a calm survival trip, ended up as a horror movie.\nBase-building is satisfying, teamwork is essential, and the jump scares are real.\nIf you want a mix of crafting, horror, and chaos, The Forest is perfect.\nBring friends. Trust no one.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The Forest offered me the BEST gameplay I've ever had so far.\n\nI've played it all with my dear friend, and everything was flawless.\nThis game has everything: great building mechanics and blueprints, awesome enemy design, great tension buildup and enviroment, well thought difficulty increase [spoiler] through the days [/spoiler]...\nI loved building our base and making fun creations.\n\nFurthermore, the lore of this game is immaculate, It's brain twisting, mind breaking, the ending was incredible and left me speechless.\nNever seen something like this.\n\nBesides the [spoiler] main ending,  the bad ending [/spoiler] got me shocked too, so [spoiler] sad and devastating, yet fascinating [/spoiler].\n\nFor sure one of the best gaming experiences of my life, if not THE best.\nI'll miss going into the caves and trembling from fear in the dark. I'll always look back at this.\n\nI love you The Forest.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love this game, lack of technology makes it scary especially at night, it is pitch black without your little lighter which makes it so immersive, hearing any sounds around you in the forest made my skin crawl, my favorite kind of horror without cheesy jumpscares, and I loved the story\n\nhad almost no bugs or glitches and building is fun and so is the enemies, 10/10 recommend",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's a tense survival game with a surprisingly deep, hidden story that unfolds piece by piece. Atmosphere, base building, and exploration blend perfectly with psychological horror. A great choice for players who love discovering the truth on their own.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Classic survival game, probably the father of survival games.\r\nA ton of fun with friends and a crazy plot twist by the end of the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I bought it when I was bored, and I played with a friend who was also playing a strategy game. An hour later, it was late, and we went to bed, so I can't say much. But it was fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the game is an open-world survival horror built to be played with friends. you explore an isolated island and move through its eerie underground paths. you observe the unusual practices of the native inhabitants. you establish a base on territory marked with a dark history. you slowly turn that base into a place only fearless players would approach. the real endgame is noticing how many ideas the show lost seems to echo from this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I know that i dont have alot of overall playtime but i 100% the game on the playstation a while back and it was a blast. I would 100% recommend this game to people who want to try something that is \"old\" but still very very fun. In total i think i have over 200 hours on this game and i have not experienced a single bug whatsoever. Easily my all time favourite game and would 100% recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Survival Game! One of the if not the best in the genre. Multiplayer works fine even with VR and PC able to play together, it runs great even on older hardware but there are a few things that suck...\n\nNEGATIVES\nThe caves make you instanyly feel like you need a walking stick if you don't use your lighter and no I'm not a sissy that will change it.\nThere is no Kelvin ):\nThe story is mid and the cut-scenes suck except the plane crash one\nThe ending is fast and the final boss is as easy as hell, flame arrows, flame arrows, flame arrows\n\nPOSITIVES\nMultiplayer is amazing even between PC and VR \nReplayability (creative mode ect.)\nCreative mode is really fun, pick a spot and build like minecraft\nCrafting, Tree cutting and everything survival feel realistic\nProgression is sometimes slow but you keep on pushing\nKeeps you hooked, cave exploring, building, finishing...\n\nTHE FOREST",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game except bugs. You got B+, now clode the door from the outside",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h2]A game that demands the perfect mix of chaos and strategy.[/h2]\n　　For a long time, this game sat in my library because when I first played it, I got frustrated not knowing what to do. I've never had the creativity to experiment with things, and survival games aren't my forte. I had bought two copies hoping my girlfriend and I could play it together—we tried, but didn't get very far. She focused on building a gazebo, and we got stuck in a loop of chopping trees where the cannibals eventually found us. Later, she wouldn't have time to play anymore.\n　　My brother, on the other hand, is spontaneous and bold—the exact ingredient needed. Combined with my planning and strategy, we beat it in just a few days, in an unforgettable experience. My brother and I roleplayed in a macabre way, eating the cannibals, breaking their stuff, and the ending felt very natural for the twisted character we built—one who dressed in skin and bones and ate legs.\n　　We were amazed by the amount of detail the game has, the grim story behind it, and how it blends classic survival gameplay with pure horror. It's a hidden gem, very difficult and challenging, but incredibly interesting. I recommend giving it a try.\n─────────────  ✦\n[i]🚧This is just my personal take and doesn't reflect the game's real quality.🚧[/i]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun and enjoyable. It’s simple, smooth, and entertaining, with great gameplay and good vibes all around. Addictive and satisfying, I keep coming back for more. Overall, a solid game that’s fun, relaxing, and has just the right amount of challenge.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is recomended for those who want horor game but too scared to play alone, cause when you play with your friends, this game is very enjoyable and at this game you can play with a lot of friends(up to 8 player). trust me when you play this with the homies, you will be flooded with so many memory with them. but if you dont have friends to play with this game is still very enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Being a good dad is hard, but kicking bad people with good music is good. \r\n\r\nEnjoy this game to the fullest with friends and do not forget...There's always something watching you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite videogames is very fun tbh.\n\nthe fact that it teaches you how to survive on an island is amazing bro 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game gets borring after 2-3 days (with friends)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you’re after a game that’s half ‘build a shelter before you freeze’, half ‘run for your life because something grim is screaming in the woods’, and half ‘everyone completely losing it on voice chat’, The Forest absolutely delivers. It’s not flawless .....a bit scruffy round the edges — but it’s creepy, chaotic, and properly good fun. Playing solo is decent enough, but jump in with a few mates and it turns into the sort of horror-survival madness you’ll be laughing about for ages",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nostalgic, reminds me of childhood. One of the best survival/horror game out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, very fun to play but they keep poking me in the head, thats very evil and they dont wish to dance with me, but they dance with me when i burn them :D\r\n\r\nI recommend this game to other players because its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, hella fun but holy shit the achievements are so buggy in multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game Really good with friends i recomend to play it with others if not it can be a bit scary but overall its a good game worth more than its actual price",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Any one know why? I started a all new game whit my sister, and i got swarm right away whit so many worms, that it makes my pc crashed 2 times... every time i restart the game, same thing happened. Any one know ?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so frustrating at times, but I HIGHLY recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having a great time playing with friends. It's fun to see what we all come up with when discovering things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not exactly how this game is intended, but I play it to relax. I just chop down trees and lowkey forget about little Timmy for a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You'll definitely need to wiki to beat the game, and it's pretty buggy too, but overall it's a great game to play with friends and the story is worth comprehending.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommended if you want to play it with friends. \nTip: Don’t use cheats, it will ruin the experience (speaking from experience).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a good game but some spots are scarry if you going into a cave for the fist time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun survival game on a cannibal island. Was surprised with some of the things that were added to the game. I was not expecting the story to end up the way it did.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Building, exploring, and surviving against relentless threats is endlessly engaging. The balance of horror and creativity keeps you invested, and the emergent stories with friends make it even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing. Honestly no bad things I can say. Very enjoyable, beautifull maybe gets boring after a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very  good game i couldnt get of my PC how much fun it is i am gonna try the sons of the forest i have big expectations for sons of the forest 9.5 of 10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, especially if you play it with friends\nHIGHLY RECOMMENDED!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting story, good game play and I like to build bases.\r\nFun alone or with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The fact that this game doesnt have a 100 percent positive rating is insane to me - so excited to get sons of the forest (^w^)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has been around for 7 years, and i see why people are still playing it. neat, survival horror, good for casual players looking for an easy survival horror. who else nominated this game? fosho~",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game so much.\nI literally cried when I did the alternative ending...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Forest — Survival, Mystery, and Horror in the Wilderness\n\nThe Forest isn’t just a survival game; it’s a tense and immersive experience where every decision matters. From dense forests to hidden caves, every area is packed with resources, threats, and secrets that keep players on edge and constantly exploring.\n\nSurvival is challenging and rewarding. Gathering resources, crafting tools, and building shelters are essential, while managing hunger, health, and stamina adds tension to every decision. Encounters with the mysterious and deadly inhabitants of the forest turn every exploration into a test of skill, strategy, and courage.\n\nExploration is thrilling and atmospheric. Caves, ruins, and hidden paths encourage curiosity, while the day-night cycle and dynamic weather shape the experience, making each journey unpredictable. The game’s emergent storytelling allows players to create their own survival narrative, whether in solo play or cooperative multiplayer.\n\nProgression is satisfying and natural. Unlocking better tools, weapons, and structures provides tangible growth, while uncovering the mysteries of the island rewards persistence and careful observation. Every discovery feels meaningful and contributes to a sense of accomplishment.\n\nVisually, The Forest impresses with detailed natural environments, dynamic lighting, and realistic animations. Coupled with a tense, atmospheric soundtrack, every exploration, encounter, and night spent in the forest feels immersive and suspenseful.\n\n[h3]Final Verdict:[/h3]\nThe Forest is a gripping survival experience that blends crafting, exploration, and tense encounters into an unforgettable journey. Challenging, immersive, and endlessly engaging, it’s a must-play for fans of survival horror.\n\n“A tense, immersive survival adventure where every choice matters and danger lurks everywhere.”\n\nOverall Rating: ⭐⭐⭐⭐⭐⭐⭐⭐☆☆ 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun a little hard if by yourself but still very good game in my opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h3]The FIRST BEST horror survival game[/h3]\nI came back to review this game after some time of playing it. Even if I no longer play it actively, it remains one of the best survival games I’ve ever played. It’s not about the graphics, because honestly, they’re kinda messy compared with other games. But for 2018? It was the best.\n\nWhat I really loved about the game is the story. For me, The Forest will always be the first survival game that’s really worth playing. Even now and then, I reinstall the game and give it a little run. I still get scared from the screams in the caves, or when it rains (enemies usually gather when it rains), but at least now I no longer shut down the PC when I hear one or more screams😂\n\nThe open-world is amazing, with dense forests, creepy caves, and all the little details that make it feel scary and intense. Crafting and building are super fun, from chopping trees to make shelters to setting traps for enemies. \n\nOver the years, the developers kept patching bugs and improving the game, so it became way more playable and smoother than when it first came out. \n\nExploring, surviving, and getting pieces together to advance in the story while figuring out how to stay alive when it’s dark everywhere and enemies are all around you never gets old 😂\n\n[h3]Should I play it?[/h3]\nIf you like scary survival games, where you chop trees to build a shelter only for a cannibal to come and smash it, or exploring caves to gather more resources and weapons while almost pi*sing yourself from the screams and the mutants that are chasing you, yeah, I would totally recommend it 😂😂😂😂\n[i]( I’m jokin’, I’m not really into horror games, but I still loved the game. )[/i]\n\n[h3]Ratings[/h3]\n[b]Graphics: 8/10[/b]\n-  Not the best, definitely messy compared with modern games, but it works for 2018.\n\n[b]Sound: 10/10[/b]\n- Fu** off, I don’t like the sound 😂😂😂😂 (just kidding, the audio is terrifying and amazing)\n\n[b]Mechanics/Physics: 8/10[/b]\n- When doing custom buildings cand get messy, but generally good for a 2018 game\n\n[b]Optimization: 7/10[/b]\n- On low-end PC's you may need lower settings to play the game at 60fps\n\n[b]Gameplay: 9/10[/b]\n- Solid survival mechanics, building, crafting, and combat. The most you can get for 2018.\n\n[b]Story:12/10[/b]\n- At least for me, the story was the best part of the game.\n\n[b]Replay Value: 9/10[/b]\n- Even after years, I come back to it for replaying the story and building.\n\n[h3]Specific Ratings[/h3]\n[b]Map: 9/10[/b]\n- Dense and interesting, exploration is scary but rewarding.\n\n[b]Building Features: 8/10[/b]\n- There is a lot of diversity on what you can build\n- Some object positions can look bugged sometimes because of the building mechanics\n- Good textures and quality\n- Limited number of object for interior design\n\n[b]Overall Rating: 9 ⭐[/b]\n\n[h3]Highlights[/h3]\n[b]Good Parts[/b]\n- Huge map with tons of places to explore and collect, plus story progression.\n- Lots of collectibles and diverse weapons.\n- Tons of things to build, shelters, traps, custom buildings.\n- Huge backpack system, plus you can make extra storage bags for even more loot.\n\n[b]Bad Parts[/b]\n- Building mechanics are a bit limited (better in Sons of the Forest, but still fun).\n\n[h3]Conclusion[/h3]\nThe story is amazing, casual play to build crazy stuff is nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun, has a lot of naked people. gets me hard. would 100% recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only game where you can be chilling sliding on a turtle shell then get jumped by a whole family of cannibals - then continue to beat said family with a dead cannibals own leg! 10/10 wish i could play sons of the forest but my computer is a potato. Highly recommend - TIMMY WHY!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for a survival game that tickles your funny, allows your creativity to run rampant, but still kick into a horror scene at times, the forest is perfect for you. The forest has been constantly fun to play every boot up even after beating it multiple times, its a lovely sight on the eyes, has rewarding building mechanics, and the combat makes you stress sometimes I'm gonna keep it a buck... The only downside I've ever seen from my years of owning it, is that sometimes the game bugs in some funky ways but its nothing that a save and reload cant fix, i.e. some cannibals flying up up and away mid fight, mutants just vanishing off your screen mid arrow to the nuts, or an item in a cave not being exactly where it should be (somewhere else in the room cause it had physics elements for whatever reason) but all those glitches and bugs are still FUNNY and dont really affect the gameplay in huge monumental ways, only ruins the atmosphere if you're in a spooky scenario lol, other then those few minor bugs I havent really seen anything game breaking and its a total 9/10 for me and I would highly recommend for some late night gaming sessions with the boys/gals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've played. Immensely fun with friends and alone. I don't usually feel like story games have a lot of replay value for me, this one definitely does, and I will love playing more in the future. Fun crafting system, nice ease into the difficulty, and the learning curve doesn't hurt as bad as other games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i got laid by a cannibal that ate edibles then deforestationed the island for fun then killed a weird mutated leg bastard  and crashed a plane didnt help my son since i hate him so much then used a old pistol to kill animals for fun and then i got onto the game and played it 10/10\n\nbad thing \ncannot sex the male cannibals sadly\n\nedit: found a mod where i can sex male cannibals very happy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I rarely play and grind this type of game, but the forest got me hooked. I used to play this with my friends during pandemic, and we finished the game together after a week or two. I had so much fun and we had so many fun clips. Unfortunately, everyone got busy and we haven't tried SOTF. Thanks for creating such a fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Survival games aren't my favorite type of game and this most certainly isn't my favorite, but I won't give a negative review because I didn't like it, don't get me wrong I didn't really enjoy it, but if its your thing I suggest that you try it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is great, story is good and i reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is game is one of the best survival games I have ever played. The story - amazing! The gameplay - stellar. The mechanics - Unique! Overall, please play this game. It is so fun and isn't your usual survival game no, it is much more . .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun with friends and a great story, even a bunch of years later its still a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "-Ignore the story in the beginning\n-Build a base\n-Explore\n-Kill bunch of animals\n-Kill some mutants\n-Do not save Timmy it's not worth it, kid is pain in the ass\n-10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is super fun i love how you can explore and do so many things in the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the survival gameplay is great, the is like a fever dream after you drank a cough syrup infused with a monkey testoterone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Forest is an incredibly immersive survival experience. The world is beautiful to explore, but the caves are terrifying in the best way. Crafting and building feel great, and playing with friends makes everything even more chaotic and fun. It’s a game that constantly keeps you on edge but still manages to be really enjoyable from start to finish.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game if you wanna play with your friends. The only downside is that the brightness seems off during nightime, well, to the point it hurts my eyes sooo much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best horror survival games and definitely a hard game\nthe biggest problem is the bugs the achievements",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best survival games I have played.  You spend a lot of time figuring out what needs doing, but it it allows for exploration and discovery.  Use the internet for progression if you get stuck, but I would recommend exploring as much as possible before resorting to that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was awesome fun espcially with friends. Getting 100% achievments was satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First of all I really like survival games and this game is not just a survival game it's also a horror game which  is way more fun also the base building is very simple which works very well for me ask for the graphics yes it's a little bit outdated but still it's great but the still has some bugs which are funny BTW but still in this price it's great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are able to play with your friends, it is surely worth the money.\nFun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Entertaing to play. Best for playing multiplayer with your friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super cool game with cool women cannibals, if this game had updates i would play it every day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game was worth it I explored and collected everything, then finished the story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Forest is one of those games that’s good solo, but becomes peak comedy horror the moment you add friends, suddenly every bush is a jumpscare and every plan turns into “who set the house on fire this time.” The survival loop is great, the atmosphere is creepy in all the right ways, and co-op turns the nightmare into a vacation gone horribly, hilariously wrong.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly such a good game!! played with a very close friend and it was the best thing i've ever done in like the past 6 years",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is a fucking GOD of the Survival games out everywhere (expect dayz and teh sequal)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i loved the caves how the cannibals acted the graphics everything the game is great in my opinion u should buy this game its good to play with friends just one thing i think they should do is to make the stamina bar longer since it runs out pretty quickly but other than that great game would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't been scared or freaked out by a game since Resident Evil 2 first came out and maybe Nightmare Creatures, but this game is terrifying in all the right ways. The game play is a bit clunky at times, takes a while to figure out the rhythm of combat, and after a certain point the roaming packs of cannibals just become very numerous and overwhelming. But it's fun for the most part. The world and character models aren't mindblowing but they're decent. The way the environment is set up is about perfect for this type of game. The story is... just bad. As far as I know there's a bad non ending and a bad ending. Both are emotionally traumatic. All in all a fun romp with psycho naked mutant cannibals in a creepy forest blanketed with claustrophobic caves. Might play some more when I'm done being traumatized by the \"real\" ending",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game came out back in 2014, and I am suprised to say that my 2012 Lenovo thinkPad x230 can still run it at 30fps on Ultralow Graphics / 1280x720 Resolution. The game is playable and can be enjoyed. I highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game was great if you like things like minecraft its amazing, a bit confusing at first but very good when exploring caves and making progress",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I want to preface this with I LOVE this game, it's an incredibly enjoyable survival crafty that I keep coming back to.\r\n\r\nThe Forest is, however, what I would describe as a pintrest bodyhorror moodboard of worldbuilding.\r\n\r\nThere is nothing in there, this is pure vibes first explanations never storytelling. A million questions are asked by the setup of the world, by the placement of themes and aesthetics, and not a single one is answered. The story itself has very little to do with the rest of the game, and only explains A: the opening cutscene, and B: the existence of ONE of the enemy types in the game (mutants). Not even the most common enemy types. (And in fact in-game evidence suggests that the mutants existed far before what is explained by the ending but this is never ever elaborated on)\r\n\r\nMore than that, while the pinterest bodyhorror moodboard is suitably aesthetic, it blows its load so hard and fast that it undercuts its own horror.\r\n\r\nWhy would you care about a hanging corpse when you've just encountered a huge pit of thousands of dead mutant babies? Why should you be alarmed at all about some effigies when you have just waded through a cave shin-high of stripped human corpses?\r\n\r\nIt also pushes disbelief out of the window.\r\n\r\nWhy are there [i]thousands[/i] of bodies worth of [i]fresh, wet, still meaty[/i] human remains? Piles and PILES of still bloody skulls, fingers, limbs, chunks of still wet gore on cave floors, none of it is remotely possible. A small country's worth of people have to be dead within the past [i]two months[/i] for that to be possible, and it makes the rest of the game hard to swallow, even if it looks cool.\r\n\r\nThis game also doesn't even realise it is in a conversation with colonialism. You know, the thing where an invader comes in, starts stripping the land of its resources like they own the place, raids local villages and starts slaughtering the native inhabitants that they view as brutal unhinged savages who are probably not even fully human?\r\n\r\nThe horror here that doesn't lose its punch in all but vibes and aesthetic is the other side of the story, the one that 90% of the game doesn't even take place in. It's the piece where horrible things were done for profit to the people who deserve it the least. That is a truly effective piece of horror storytelling, and it is my belief that if this studio decided to ditch open world survivals for a tight, narrative and linear horror experience, it would be one for the halls of fame.\r\n\r\nAs it stands: The ending sequence is excellent, and incredibly unsettling. The bulk of the game is very cool and mechanically fun, with lots of creepy (if utterly unexplained and unanalysed) aesthetics. And those two things do not connect in any remotely meaningful way.\r\n\r\nExcellent game, highly recommend getting it and losing your mind to it for four months.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is terrifying and absolutely challenging!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic and immersive survival features and map. Fun and challenges increase in intensity as you go on, with mysteries around every corner nook and cranny. hours of fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoyed this game, Its 100% the best experience if you play with friends, Sad that the solo aspect isnt really as interesting but still worth the full price. Story is insane and i have yet to play sons of the forest.\r\nAmazing game!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve spent some time with this game and honestly, it surprised me in a way I didn’t fully expect. I don’t want to sound dramatic, but there’s something oddly satisfying about how everything fits together — not in some perfect, polished “advertisement” way, but more like a game that knows exactly what it wants to be and just… goes for it.\n\nThe first thing I noticed is the atmosphere. Every part of the game — the visuals, the sound, the pacing — kind of blends into this feeling that you’re actually inside its world, even if you’re just casually playing. I know that sounds a bit cliché, but it’s true. Sometimes it’s chaotic, sometimes slow, sometimes you’re just wandering around thinking “ok, what now?” but that’s honestly part of the charm. The game doesn’t try to rush you unless it actually needs to.\n\nGameplay-wise, it has this mix of familiar elements and small twists that keep things from feeling stale. Nothing groundbreaking, maybe, but it all works together in a way that feels natural. There were moments when I thought “yeah, I’ve seen this in other games,” but then the game throws in tiny details or unexpected interactions that make it stand out just enough. It’s the kind of thing you only notice after a few hours, when you start connecting the dots.\n\nPerformance has been mostly fine. A little rough spot here and there, but honestly, show me a game these days that doesn’t have something weird happening once in a while. Nothing game-breaking on my end, at least. You can clearly tell the developers put effort into this, even if a few edges are still a bit sharp. Again — part of the charm.\n\nWhat I really appreciate is that the game gives you space to play the way you want. Some people will rush through every objective, others will take their time exploring or messing around, and both approaches actually feel valid. I like games that don’t punish you for not following some “correct” path.\n\nOverall, I’d say this is one of those titles that grows on you the longer you play. It doesn’t try too hard to impress in the first five minutes — instead it slowly builds its identity, layer by layer, until you suddenly realize you’ve been playing way longer than you planned. If you’re looking for something that balances comfort with challenge, familiar mechanics with fresh touches, and a world that’s just fun to be in, then I genuinely think this one is worth giving a shot.\n\nWould I recommend it?\nYeah, I would — maybe not to everyone, because no game is for everyone, but definitely to anyone who likes getting lost in a game for a bit and discovering things at their own pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра кайф но в пещере немного темно но норм там видно только свои руки и зажыгалка бесконечная и сын мутант  немного\n10аборегенов из 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's still got some of that open world survival craft shittyness but this is one of the best with a decent story, atmosphere and progression path.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun, thrilling, and sometimes terrifying experience that tests your ability to strategize as a team (or God forbid solo) to progress. As time goes on it gets more difficult which you don't notice at first, but that is  a nice touch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(Just to clarify, I pretty much did everything in the game and completed it 100% (and achievements). The game offers a unique survival experience, and it was incredible for its time, made by indie devs (Canadians). It still holds up relatively well in 2025. The downside of the game is that in the storytelling, there is no dialogue—only signs indicating events and their causes. The ending raises more questions, which was good for the long awaited sequel sequel SOTF (Sons of the Forest).Now not everyone has these problems, but I had technical problems with the game. The game would crash now and then, and I lost 3h of progress, but later on it stopped, and the things that really pissed me off were the bugs of items just not spawning and enemies glitching the fuck out and other minor annoying bugs but not game-breaking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun survival horror to play with friends, graphics is not too bad as well. I will highly recommend the game, lots of cave you can explore, build base or just hunt for zombies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "O melhor jogo de sobrevivência que eu já joguei, nunca tive uma sensação tão boa jogando um jogo quanto esse, parece que ele me traz algum tipo de sensação de conforto ou de como se eu tivesse em casa eu não consigo descrever, aqui mostra que eu tenho 2 horas mais é que eu mal comecei a jogar o jogo nessa conta, em outras eu tinha mais ou menos umas 30 a 40 horas nesse jogo, infelizmente eu tenho esse tempo porque maior parte dos meus amigos não jogam esse jogo e eu acabo tendo que jogar sozinho mas eu ainda me divirto jogando ele. Se alguém quiser jogar comigo me manda pedido na steam que eu aceito todos (ou quase todos).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes I would recommend!! It is a great game I may not have many hours on here but I have completed it on PS threes times with two different friends as there are two endings. But my advice is explore as much as you can first before completing the story as you will need the stuff you find in caves and along the way to craft certain things, you will need them for the end and for going into parts of the cave. The story depending how many there are of you takes around 3 hours to complete but what is so great about this game is that you can carry on exploring and crafting etc after completing the story. I feel it is one you can always go back to! I also have the second game which I have yet to fully start and complete. It is one of my favourite survival horror games!! Definitely in the top ten of my list anyway! If you like horror survival games and like to craft, explore and also fight with a story that you can do anytime this is a game for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is very epic and realistic because is so cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i liked that when its windy that the leaves on trees on blow when its windy. i don't like tho hoe for the lighter it does barley any light it does help you just cant see that far at night.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOVE this game!! played it with my boyfriend and we made a lot of fun memories together. its a very creepy survival game, the cannibals are so fun to fight with and they freak me out everytime HAHAHA we still need to finish it soon cause we stopped playing it for a while but i always mention this game from time to time, very memorable for sure if you're a survival horror fan!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game with friends some of the cannibals were really annoying but over a 8/10. GOOD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is really janky and you can see through caves, and also get the katana and axe really fast but if you aren't trying to speedrun and its you're first time playing this game is awesome. I don't like how limited the stamina is though and i think they could expand on the story but overall, 7/10, if you don't like caves though you shouldn't buy this but if you like a spooky experience, this is the game for you. Not the best story though and they could expand on weapon upgrades and add a harder mode withe weapon durability and its janky af but i'm still on my first experience for this game, its a pretty long game, but its a good one. I'm not a fan of speedrunability tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "naked people quickly crawl on all fours, darting out of trees and dark cave corners. fetus monsters attack you too. crafting is intuitive and fun. very good and scary game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well played this game for an hour and still get fuck by Mutants. Absolutely peak game play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really like this game and the endings are ig overall the game was really good and realistical",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "extremely fun game.  recommend playing with friends otherwise you will poo yourself. 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game’s crafting system is deep but intuitive, and discovering new blueprints feels rewarding. Its story is delivered through environmental clues, gradually pulling you into a darker mystery beneath the island. While the survival grind may feel repetitive for some, and the combat can be clunky at times, The Forest excels at creating tension, immersion, and memorable co-op moments.\r\n\r\nA must-play for fans of survival games who enjoy a strong dose of horror.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very great gameplay good graphics and love the story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Holy sh! me and my friends played this game so much last christmas we got like 32 hours in two days and did so much then everyone didn't want to play so we finished the game in april i think. This is one of my most favorite games to play with friends and fun. At first it was so scary with the cannibals then it was so fun to see new wierd cannibals. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Until the developers fix the multiplayer hacker/cheating issue I can't recommend this game to new players. I'm now experiencing a cheater/hacker every time I play.  For one thing you don't even have the ability to stop other players using cheats in your own room, furthermore the cheats that are being used are all malicious designed to ruin the game for the people that actually want to play e.g. destroying buildings/bases, killing your character, summoning hundreds of enemies at once which makes the game crash etc. Only option we have right now is to make a private room with people we know (still able to get hacked occasionally) or play alone. I get this game is over 10 years old & doesn't have a huge player base like it used to but I still believe the devs have a duty to make their game safe & hack free for those who purchased it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Gameplay gets stale real quick. After you find some items, build a shelter, explore a few caves and murder a dozen or so baldies, there isn't much more to do. The game feels empty and lacks variety. It's a lumberjack simulator. Worth it at a discounted price,",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "4.5–5/10\n\nI've tried several times to appreciate this game, after forcing myself to 100% it...I still struggle with its core premise.\n\nI found the most celebrated aspect of the game, building a base, to be a tedious process that the game itself doesn't truly require you to engage with for progression.\nThe gameplay emphasizes fort-building and survival against cannibals, yet the critical path ignores these systems, and instead, funnels you into underground caves so you can progress.\nConsequently, the slow, meticulous work of building a base feels more like a optional side-project than a vital part of the \"survivor game's player journey\". \n\nTo give the game its praises: It certainly has its highs; the sight of the large landscape in front of you, filled with spots calling your name while whispering \"don't i look like a good place go build a base?\", the tension of a dark cave or the chills you'll get during your first nightly encounter with a cannibal, the pride in a well put together base. But these are mere islands in a sea of repetitive grinding, walking around with no purpose in the forest (aye!) with weirdly shaped branches and leaves. The filler tasks ultimately prevent these moments from building towards a truly compelling and satisfying end.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Buggy crafting survival hiding a horror game underneath it. Meh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring and tedious, janky aswell. Felt like I was fighting against the game rather than cannibals and nature. Though I bought it for only a  dollarydoo or two.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I like the general ambiance and graphics. The concept of the game is sound.\r\n\r\nThe execution leaves a little much to be desired, though. Simple items, like traps, cannot be picked up and moved after they're built. Buildings cannot be dismantled for their resources. All of the materials used for a building, if it gets destroyed, simply vanish, despite first breaking down into what looks like (but isn't) reusable components.\r\n\r\nIt's cute, but the building system needs to be a bit more fleshed out. Otherwise, it's just an exercise in frustration.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game technical quality standards are not even on par with early abandoned Skyrim mod. Just another \"glue it together somehow, quickly sell and be done with it\" type of project. Only recommend it in co-op and with 90% discount.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I honestly do not find what is so appealing about this game at all, there's like no storyline to it at all, it looks like crap & plays like crap, next please.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "was forcibly gifted this to play and i was very much forcing myself to play for the entire 17.2 hours i spent. \n\none main issue i have with the game is how your stuff can sort of get gatekept if you die. let's say for example you have some gear on you that you don't want to lose, you get absolutely JUMPED by a group of cannibals, was NOT even close. you then spawn on the plane again and have to run all the way back just for them to still be there and jump you again. on top of this, you respawn on the plane with many 1 second sprint's worth of stamina. tho sometimes the cannibals just go away but its so painful being chased by them while trying to just get your stuff. it happened to me a few times. the remaining like 15 hours i spent aside that i was mostly walking around, building, killing. that's the game but it just felt boring at times.\n\nthat being said i do kind of suck at these types of games anyway so i'm not trying to discourage anyone from playing it because that's just me. if you played stuff like ark you'd probably enjoy this.\n\n4/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has been an horrible exspereience their just naked dudes everywhere and trust me im gay and i dont even like dicks on my screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Forest does a terrible job at being a survival game, while doing an excelent job at being a cave exploration and horror game. Gameplay, although janky and not fun at all, can be easily ignored if playing the game with friends, or if you care about story only, which on its own has a lot of plot-holes, and inconsistencies. Unless you have a good reason, dont play it, there are better games out there",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to like this game, but multiple issues is why I can't recommend it:\r\n1. The story premise. You're supposed to look for your son Timmy in the game who was kidnapped by the monsters. But this is also a base building game. And immersion is important for me in games. And it feels weird wasting time to build a tree house and a garden in the game and explore the stuff you can build while your son is in the hands of the monsters. This is a major immersion breaker for me.\r\n\r\n2. Technical issues. I have 2 monitors of different resolutions, and I could not get the game to play on my bigger of the 2 monitors. This even caused my PC to freeze, needing to restart the PC.\r\n\r\n3. In game technical issues. It feels like rocks, small trees, berry bushes spawn out of nowhere. I turn around  and it seems new stuff spawned out from nowhere. Sometimes I see small trees growing directly from rocks. Also sometimes you get wiled life like boars and crocodiles that spawn right on top of you. Like you turn around and you get attacked out of nowhere.\r\n\r\n4. Sometimes when you want to sleep through the night, you get woken up in the middle of the night and you can't sleep or sit to pass the time again. This forces you to just sit around and do nothing which is very boring. I get that the game tries to put you in a dangerous situation, to wake you in the middle of the night making you feel cold so you need to start a fire. But if you don't feel cold, are not hungry, are not thirsty and you get woken up in the middle of the night there is no reason to start a fire or do anything. So you just end up sitting waiting for daytime to come without a way to pass the time.\r\n\r\n5. The crafting/inventory system is also an immersion breaker. In order to switch gear, to change to a spear or different weapon you have to open the inventory and lay it on the ground and unpack your whole backpack. That's ok for crafting, but to just switch weapons is very annoying. Imagine you have some monsters in front of you and you want to switch weapons, the monsters would not wait for you to unpack your whole backpack and switch weapons. But that's what the game wants you to do, and it's an immersion breaker. \r\n\r\nI think the game has promise, but little details like these that were not considered is making me give it a bad review. It just feels like the game is unpolished.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stalled out on a multiplayer playthrough with some friends a couple of months ago. Probably won't be back. Gathering and base building feels like it's at an impossible level to return to in a post-Rust, post-Valheim world. Combat feels bad, too. I can't imagine finishing this game, let alone playing through it multiple times as seems to be the norm based on what I've read about it.\n\nI think I'm missing out on a little bit of interesting exploration in the rest of the caves, but I don't think that little bit is worth another 20 hours of dragging myself through the muck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THE GAME OF ABSOLUTE DESPAIR AND DOOM.\n(if u see i barely have any hours its cos i refunded and realized i had it on another acc)\nThis game is the reason id want to kill myself. Everything about this game pisses me off so much, it is funny sometimes, but why the FUCK wold i go in that big ass hole the size of my anus just to rescue lil timmy, man FUCK THAT CHILD. if i was the parent id leave that child and hopefully have him fed to cannibals. glitches be everywhere and the point of the game is useless, aside from letting my child get fed to canniballs id kill myself if i was in this position, nigga fuck this game, this game is just like playing whit my butthole, absolute dogshit, and timmy is ugly as FUCK. all my homies hate timmy. (SPOILER ALERT: its not like youd give a fuck about spoilers in this game since its bullshit anyways, but some ppl do. in the end ur son becomes a mutant and kills you what even is the point of this, as said at the beginning, that child shoulda been left eaten.)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"You're thirsty, find clear drinking water to drink\" -- I found water, it's clear now why can't I drink it?!\n\n\"Make shelter\" -- OK I got all the sticks, rocks, and logs I need to build a shelter but opening the crafting menu doesn't give an option for building a shelter, and there doesn't appear to be any other way of building a shelter.\n\nI get that these open world survival games don't want to hold your hand through figuring things out, but this game is just ridiculous. Did the devs just never watch a new person play? Feel like the only way to make this game viable is watching online tutorials, which in my opinion is just lazy dev. \n\nMuch better survival crafting games out there that balance holding your hand with actually feeling like it's survival.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Look, this game was fun, and had some neat ideas, but here we are 10 years later and it's not exactly... great. There's been plenty of other games that have done things a lot better and are much more fun to play.\r\n\r\nI played it. I had some fun. But I got extremely bored at the end waiting for those days to roll by and exploring the same caves and dealing with the poor AI. If you haven't played it, skip it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "needs a lot work still cant save what you done in the game i find that really stupid there no auto save",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is an ocean of video games more fit for your time. I really feel deceived by the number of positive reviews I'm left wondering if gaming was really that dry in 2018 or what.\r\n\r\nThe survival crafting elements are the bare minimum. The diegetic interfaces are a pain in the ass to use. The 'story' elements are disjointed and add up to nothing. If you take a chance on what story is presented to you and try to draw connections you will be left with your energy wasted.\r\n\r\nI don't look for story in my survival crafting games, but considering how lack luster the progression and crafting system is, I hoped the story would at least be good... Turns out it barely exists. \r\n\r\nI was so bored playing the game I watched a video going through the whole story. I advise you do the same if you haven't purchased the game yet and skip hours of finding bibles and looking at grotesque effigies in wet places.\r\n\r\nLiterally play any other survival crafting game if that's what you are looking for. If you're looking for horror, just enter a few caves in game and know that's 90% of the experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bu oyunun allahını kitabını muhammedini dinini soyunu sopunu timmy'yi yapımcısını lore'unu sikeyim amına koyayım bu boktan oyun neden bu kadar ikonik oldu amk siktir boktan metro çakması sikimdirik bişi",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just boring. what am i supposed to do? do i even care to do it?\n\nthere is no good combat OR survival. \n\ni enjoyed green hell a lot more",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Repetitive and boring once you've explore the extremely small island",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's ok. I would recommend it if it was $5 and you wanted to kill a night or two with some friends, but I didn't really care about base building or grinding so I dropped it fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass a cannabal sucked my toes and then ate my intestines like spaghetti",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is really fun if you have someone to play with becouse singleplayer can get boring and hard really quick.Game is also full of bugs, and there is also no autosave or quick save, you have to build a stupid shelter to save your game, there was a lot of times when me and my friends lost our progress becouse the game just randomly crashes or it just bugs out. It is not worth over 15 euros, buy it on a sale. Overall the game is fun and you can spend alot of time in it, but these little stupid things can make it unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty boring for what its advertising. You have to play this game with friends and I didn't know that at first I thought it was going to be a pretty chill and fun horror game to play alone, ended up being boring. If you're gonna get this make sure your friends get it too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 10years the Black inventory bug is.still present.\n\nGood game but it is so frustrating this hug that i would recommend to not buying it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too many lil BSs and bugs breaking the immersion and fun. It was abandoned by the devs who would rather charge for the sequel instead of fixing the original ever so slightly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly this game feels 15 years old somehow and is just not compelling to me. sequel probably better?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shi ahh game bought it for 2 euros and disappeared from my library so corrupted so mafia stole my money uadafac is dis",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gore and psycological horor, besides which constant dying and no aim asist rectical for the ranged weapons.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Graphics ass\n\nGameplay ass\n\nBoobies ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too many bugs for a finished game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"ee aj kupimo forest igracemo svaki dan\"\nstefane nabijem te na kurac",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sons of the forest is better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "to many gooners play with me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "FUCK this GAME its ASS CHEEKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its shit fuckoff",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It crashes all the time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got touched by a naked lady",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't build giant ladder to bottom of sinkhole",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "BAD Game BAD Game BAD Game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring asf",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont know where i should be headed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "RESAD BEYENMEDI BLET",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ng a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no auto safe, after I build a huge path  into the mountain I fell down in a hole no chance to get out , needed to abandon the Game including my art of work which took hours to build.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Until the developers fix the multiplayer hacker/cheating issue I can't recommend this game to new players. I'm now experiencing a cheater/hacker every time I play.  For one thing you don't even have the ability to stop other players using cheats in your own room, furthermore the cheats that are being used are all malicious designed to ruin the game for the people that actually want to play e.g. destroying buildings/bases, killing your character, summoning hundreds of enemies at once which makes the game crash etc. Only option we have right now is to make a private room with people we know (still able to get hacked occasionally) or play alone. I get this game is over 10 years old & doesn't have a huge player base like it used to but I still believe the devs have a duty to make their game safe & hack free for those who purchased it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I'm confused because the bulk of the gameplay seems based around building a fort and defending it against cannibals but to actually progress you don't need to do any of that, you just have to explore caves. Sure it's nice to have a place to come back to but it doesn't help you enough to warrant how slow and tedious it is to create one in the first place. I made several attempts to \"get\" this game but I don't think it has the same level of replayability for me as others seem to find. I can see why an indie game of this quality was noteworthy for its time but at this point it doesn't feel particularly impressive.\n\nIt still has good moments, your first plunge into a pitch-black cave, looking out over an expansive landscape, taking a step back and admiring the base you've built yourself over several hours; but these moments don't add up to a satisfying endpoint and are largely padded with boring filler like cutting down dozens of trees or walking for a long time without seeing anything of interest. It's very cheap so there's not much harm in trying it anyway, but I can't say it did anything for me.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Gameplay gets stale real quick. After you find some items, build a shelter, explore a few caves and murder a dozen or so baldies, there isn't much more to do. The game feels empty and lacks variety. It's a lumberjack simulator. Worth it at a discounted price,",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I honestly do not find what is so appealing about this game at all, there's like no storyline to it at all, it looks like crap & plays like crap, next please.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The good: The crafting system was immersive.\n\nThe bad: Got knocked out of bounds, forcing a restart and losing save progress. Having static save locations is very old/bad game design. Friends can't join a multiplayer session in progress. It wasn't even scary, we even started calling the cannibals \"friends\" half way through the game. Combat is just spam click to melee everything since the bow is such short range and explosives are limited supply. Base building is completely irrelevant since you spend all your time in caves. No way to tell where to go next when you inevitably get stuck missing a required item. Lighting engine was way too bright during the day and too dark at night, even with the light settings cranked to the max. Death erases progress on your map. Weapon upgrades are basically meaningless after getting the first weapon, the katana. Enemies are limited to a few basic types: humanoid and fat mutants. The final boss is rediculous with a single attack that one shots you, turning it into a corpse run. Dieing to fall damage after the final boss requires you to run all the way back from your spawn point just to see the ending, which takes forever.\n\nI have no clue how this game is rated Overwhelmingly Positive on Steam. It really is not that good.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "4.5–5/10\n\nI've tried several times to appreciate this game, after forcing myself to 100% it...I still struggle with its core premise.\n\nI found the most celebrated aspect of the game, building a base, to be a tedious process that the game itself doesn't truly require you to engage with for progression.\nThe gameplay emphasizes fort-building and survival against cannibals, yet the critical path ignores these systems, and instead, funnels you into underground caves so you can progress.\nConsequently, the slow, meticulous work of building a base feels more like a optional side-project than a vital part of the \"survivor game's player journey\". \n\nTo give the game its praises: It certainly has its highs; the sight of the large landscape in front of you, filled with spots calling your name while whispering \"don't i look like a good place go build a base?\", the tension of a dark cave or the chills you'll get during your first nightly encounter with a cannibal, the pride in a well put together base. But these are mere islands in a sea of repetitive grinding, walking around with no purpose in the forest (aye!) with weirdly shaped branches and leaves. The filler tasks ultimately prevent these moments from building towards a truly compelling and satisfying end.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game technical quality standards are not even on par with early abandoned Skyrim mod. Just another \"glue it together somehow, quickly sell and be done with it\" type of project. Only recommend it in co-op and with 90% discount.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Stuck on \"starting client\" screen when trying to join a friend's session and the success of joining seems to be based on luck. A pretty fun survival game with friends when it does work.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really fun if you have someone to play with becouse singleplayer can get boring and hard really quick.Game is also full of bugs, and there is also no autosave or quick save, you have to build a stupid shelter to save your game, there was a lot of times when me and my friends lost our progress becouse the game just randomly crashes or it just bugs out. It is not worth over 15 euros, buy it on a sale. Overall the game is fun and you can spend alot of time in it, but these little stupid things can make it unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty boring for what its advertising. You have to play this game with friends and I didn't know that at first I thought it was going to be a pretty chill and fun horror game to play alone, ended up being boring. If you're gonna get this make sure your friends get it too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 10years the Black inventory bug is.still present.\n\nGood game but it is so frustrating this hug that i would recommend to not buying it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "was forcibly gifted this to play and i was very much forcing myself to play for the entire 17.2 hours i spent. \n\none main issue i have with the game is how your stuff can sort of get gatekept if you die. let's say for example you have some gear on you that you don't want to lose, you get absolutely JUMPED by a group of cannibals, was NOT even close. you then spawn on the plane again and have to run all the way back just for them to still be there and jump you again. on top of this, you respawn on the plane with many 1 second sprint's worth of stamina. tho sometimes the cannibals just go away but its so painful being chased by them while trying to just get your stuff. it happened to me a few times. the remaining like 15 hours i spent aside that i was mostly walking around, building, killing. that's the game but it just felt boring at times.\n\nthat being said i do kind of suck at these types of games anyway so i'm not trying to discourage anyone from playing it because that's just me. if you played stuff like ark you'd probably enjoy this.\n\n4/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has been an horrible exspereience their just naked dudes everywhere and trust me im gay and i dont even like dicks on my screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Forest does a terrible job at being a survival game, while doing an excelent job at being a cave exploration and horror game. Gameplay, although janky and not fun at all, can be easily ignored if playing the game with friends, or if you care about story only, which on its own has a lot of plot-holes, and inconsistencies. Unless you have a good reason, dont play it, there are better games out there",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to like this game, but multiple issues is why I can't recommend it:\r\n1. The story premise. You're supposed to look for your son Timmy in the game who was kidnapped by the monsters. But this is also a base building game. And immersion is important for me in games. And it feels weird wasting time to build a tree house and a garden in the game and explore the stuff you can build while your son is in the hands of the monsters. This is a major immersion breaker for me.\r\n\r\n2. Technical issues. I have 2 monitors of different resolutions, and I could not get the game to play on my bigger of the 2 monitors. This even caused my PC to freeze, needing to restart the PC.\r\n\r\n3. In game technical issues. It feels like rocks, small trees, berry bushes spawn out of nowhere. I turn around  and it seems new stuff spawned out from nowhere. Sometimes I see small trees growing directly from rocks. Also sometimes you get wiled life like boars and crocodiles that spawn right on top of you. Like you turn around and you get attacked out of nowhere.\r\n\r\n4. Sometimes when you want to sleep through the night, you get woken up in the middle of the night and you can't sleep or sit to pass the time again. This forces you to just sit around and do nothing which is very boring. I get that the game tries to put you in a dangerous situation, to wake you in the middle of the night making you feel cold so you need to start a fire. But if you don't feel cold, are not hungry, are not thirsty and you get woken up in the middle of the night there is no reason to start a fire or do anything. So you just end up sitting waiting for daytime to come without a way to pass the time.\r\n\r\n5. The crafting/inventory system is also an immersion breaker. In order to switch gear, to change to a spear or different weapon you have to open the inventory and lay it on the ground and unpack your whole backpack. That's ok for crafting, but to just switch weapons is very annoying. Imagine you have some monsters in front of you and you want to switch weapons, the monsters would not wait for you to unpack your whole backpack and switch weapons. But that's what the game wants you to do, and it's an immersion breaker. \r\n\r\nI think the game has promise, but little details like these that were not considered is making me give it a bad review. It just feels like the game is unpolished.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stalled out on a multiplayer playthrough with some friends a couple of months ago. Probably won't be back. Gathering and base building feels like it's at an impossible level to return to in a post-Rust, post-Valheim world. Combat feels bad, too. I can't imagine finishing this game, let alone playing through it multiple times as seems to be the norm based on what I've read about it.\n\nI think I'm missing out on a little bit of interesting exploration in the rest of the caves, but I don't think that little bit is worth another 20 hours of dragging myself through the muck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THE GAME OF ABSOLUTE DESPAIR AND DOOM.\n(if u see i barely have any hours its cos i refunded and realized i had it on another acc)\nThis game is the reason id want to kill myself. Everything about this game pisses me off so much, it is funny sometimes, but why the FUCK wold i go in that big ass hole the size of my anus just to rescue lil timmy, man FUCK THAT CHILD. if i was the parent id leave that child and hopefully have him fed to cannibals. glitches be everywhere and the point of the game is useless, aside from letting my child get fed to canniballs id kill myself if i was in this position, nigga fuck this game, this game is just like playing whit my butthole, absolute dogshit, and timmy is ugly as FUCK. all my homies hate timmy. (SPOILER ALERT: its not like youd give a fuck about spoilers in this game since its bullshit anyways, but some ppl do. in the end ur son becomes a mutant and kills you what even is the point of this, as said at the beginning, that child shoulda been left eaten.)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"You're thirsty, find clear drinking water to drink\" -- I found water, it's clear now why can't I drink it?!\n\n\"Make shelter\" -- OK I got all the sticks, rocks, and logs I need to build a shelter but opening the crafting menu doesn't give an option for building a shelter, and there doesn't appear to be any other way of building a shelter.\n\nI get that these open world survival games don't want to hold your hand through figuring things out, but this game is just ridiculous. Did the devs just never watch a new person play? Feel like the only way to make this game viable is watching online tutorials, which in my opinion is just lazy dev. \n\nMuch better survival crafting games out there that balance holding your hand with actually feeling like it's survival.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Look, this game was fun, and had some neat ideas, but here we are 10 years later and it's not exactly... great. There's been plenty of other games that have done things a lot better and are much more fun to play.\r\n\r\nI played it. I had some fun. But I got extremely bored at the end waiting for those days to roll by and exploring the same caves and dealing with the poor AI. If you haven't played it, skip it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "needs a lot work still cant save what you done in the game i find that really stupid there no auto save",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is an ocean of video games more fit for your time. I really feel deceived by the number of positive reviews I'm left wondering if gaming was really that dry in 2018 or what.\r\n\r\nThe survival crafting elements are the bare minimum. The diegetic interfaces are a pain in the ass to use. The 'story' elements are disjointed and add up to nothing. If you take a chance on what story is presented to you and try to draw connections you will be left with your energy wasted.\r\n\r\nI don't look for story in my survival crafting games, but considering how lack luster the progression and crafting system is, I hoped the story would at least be good... Turns out it barely exists. \r\n\r\nI was so bored playing the game I watched a video going through the whole story. I advise you do the same if you haven't purchased the game yet and skip hours of finding bibles and looking at grotesque effigies in wet places.\r\n\r\nLiterally play any other survival crafting game if that's what you are looking for. If you're looking for horror, just enter a few caves in game and know that's 90% of the experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bu oyunun allahını kitabını muhammedini dinini soyunu sopunu timmy'yi yapımcısını lore'unu sikeyim amına koyayım bu boktan oyun neden bu kadar ikonik oldu amk siktir boktan metro çakması sikimdirik bişi",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just boring. what am i supposed to do? do i even care to do it?\n\nthere is no good combat OR survival. \n\ni enjoyed green hell a lot more",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Repetitive and boring once you've explore the extremely small island",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's ok. I would recommend it if it was $5 and you wanted to kill a night or two with some friends, but I didn't really care about base building or grinding so I dropped it fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass a cannabal sucked my toes and then ate my intestines like spaghetti",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is really fun if you have someone to play with becouse singleplayer can get boring and hard really quick.Game is also full of bugs, and there is also no autosave or quick save, you have to build a stupid shelter to save your game, there was a lot of times when me and my friends lost our progress becouse the game just randomly crashes or it just bugs out. It is not worth over 15 euros, buy it on a sale. Overall the game is fun and you can spend alot of time in it, but these little stupid things can make it unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty boring for what its advertising. You have to play this game with friends and I didn't know that at first I thought it was going to be a pretty chill and fun horror game to play alone, ended up being boring. If you're gonna get this make sure your friends get it too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 10years the Black inventory bug is.still present.\n\nGood game but it is so frustrating this hug that i would recommend to not buying it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too many lil BSs and bugs breaking the immersion and fun. It was abandoned by the devs who would rather charge for the sequel instead of fixing the original ever so slightly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly this game feels 15 years old somehow and is just not compelling to me. sequel probably better?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shi ahh game bought it for 2 euros and disappeared from my library so corrupted so mafia stole my money uadafac is dis",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gore and psycological horor, besides which constant dying and no aim asist rectical for the ranged weapons.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Graphics ass\n\nGameplay ass\n\nBoobies ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too many bugs for a finished game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"ee aj kupimo forest igracemo svaki dan\"\nstefane nabijem te na kurac",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sons of the forest is better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "to many gooners play with me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "FUCK this GAME its ASS CHEEKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its shit fuckoff",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It crashes all the time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got touched by a naked lady",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't build giant ladder to bottom of sinkhole",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "BAD Game BAD Game BAD Game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring asf",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont know where i should be headed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "RESAD BEYENMEDI BLET",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ng a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no auto safe, after I build a huge path  into the mountain I fell down in a hole no chance to get out , needed to abandon the Game including my art of work which took hours to build.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Until the developers fix the multiplayer hacker/cheating issue I can't recommend this game to new players. I'm now experiencing a cheater/hacker every time I play.  For one thing you don't even have the ability to stop other players using cheats in your own room, furthermore the cheats that are being used are all malicious designed to ruin the game for the people that actually want to play e.g. destroying buildings/bases, killing your character, summoning hundreds of enemies at once which makes the game crash etc. Only option we have right now is to make a private room with people we know (still able to get hacked occasionally) or play alone. I get this game is over 10 years old & doesn't have a huge player base like it used to but I still believe the devs have a duty to make their game safe & hack free for those who purchased it.",
      "voted_up": false,
      "votes_helpful": 7
    }
  ]
}