{
  "positive": [
    {
      "review": "very goo looks stunning reccomended for people that struggle with tarkov or cant play tarkov as they dont have a pc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm having a total blast on this game but unfortunately don't have alot of time to play these days, however, here is my take:\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☑ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☑ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved it, the gameplay is amazing and the best part is, its that its optimized af runs on 70fps low DLSS Ultra Quality and 110fps DLSS Ultra Quality + FSR\nPeople weren't kidding the audio is next level, you can really feel the intensity of the combat in the game. In the game I litrally marked a location and my character said \"over there!\" out loud lmao and the drones heard us and some other group aswell they came hunting us. All because I marked a location and said it out loud and they heard it\n\nThe world building is fucking beautiful, the enviroment the futuristic metal 80s type of vibe. Honestly I'm just really sad it couldn't have been just a pve game or maybe a gamemode option just for that\n\nI hated the fact that if other players have spent more time, they know better and they probably have better loot so it's just pretty difficult for people who like me suck at multiplayer game's for intense combat scenarios\nOverall 10/10 game, just hate that its pvpve only and that you lose your gear if you get outgunned by some pro who has already looted the entire town",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As the game itself is pay to play, please make skins and shop items with real money much cheaper. It's the only bad thing to say about this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest game I've ever played. Even though I didn't meet the requirements and the game didn't render, the intelligent design shined through. I hope this game sells and generates an ARC RAIDILLION dollars!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I already played when its in test phase and I like it. So fun so I bought it. Definitely recommend it and worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game! It's opening the door to a new type of extraction shooter. AI must be stopped.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im only giving it a thumb up because it supports linux. but, it is a woke game. it has type one and type two bodies, because THEY CANT HANDLE males and females. Main characters all look trans, no thanks. not my thing. you dont like my review? fine, give me your points with a clown. you don't deserve your steam points.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ARC Raiders absolutely blew me away 🔥\r\n\r\nFrom the second I dropped into the surface, I knew this was something special. The mix of PvE chaos and PvP tension is genuinely perfect. You’ve got these absolutely hauntingly beautiful landscapes full of old tech and debris everywhere, the atmosphere feels straight out of a movie, and then, boom, ARC descend from the sky and all hell breaks loose. Every encounter feels cinematic without even trying and I can't help but love it.\r\n\r\nGameplay-wise, Embark nailed it yet again. They seriously cannot stop catching Ws. The gunplay is crisp, movement is smooth, and their awesome take on the extraction system keeps every run really heart-pounding. Even when I lose all my loot, I’m enjoying myself because it’s that fun to play. The sound design and visuals (especially on UE5) are just... unreal (I'm sorry 😭).\r\n\r\nI love how team play actually matters too. You can solo raids, but coordinating with others to take down massive ARC machines is such peak gaming. The balance between fighting AI and other players keeps things unpredictable in the best way possible, ESPECIALLY when they're combined.\r\n\r\nPerformance-wise, it runs great on PC, and especially so on Linux. Smooth frames, fast loads, and solid netcode. Haven’t had a single major issue during the server slam. Plus, it feels like it’s built with love... every weapon, every explosion, every moment screams nothing but quality.\r\n\r\nEmbark did it again. If you liked THE FINALS or just want a game that rewards smart plays, teamwork, and a bit of risk-taking, ARC Raiders is it.\r\n10/10 would lose all my loot again just to hear that extraction siren one more time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Retro Cassette FPS Semi-Coop Extraction Shooter.\r\n\r\nAll that needs to be known, has been said !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "camped by an extraction and killed people, 10/10 would pound noobs again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Elevator camping rats gave me cancer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10!!! looking forward to playing this more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game in the world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WHY DID YOU SHOOT IT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome bawesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hello Raiders!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i arc till i raid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐⭐⭐",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1]🚀 *[i]ARC RAIDERS (Playtest) — Drop In. Loot Out. Survive Together.[/i] 🌌[/h1]\n[quote=author][i]“The world is upside down. The machines rule the surface. Drop in, Raider — it’s time to reclaim everything.”[/i][/quote]\n[hr][/hr]\n[h2]🎮 Gameplay – Thrilling. Fluid. Extraction-Mayhem.[/h2]\nEven in its playtest phase, ARC Raiders delivers a taste of what might become one of the most compelling extraction shooters of the year. The loop is simple: drop topside, loot, fight the robotic threat known as the ARCs, maybe fight or evade other players, then extract. It works — and it works [i]well[/i].\n[list]\n\t[*]The [b]gunplay & movement[/b] feel satisfyingly weighty for a third-person perspective. One preview called it “fun to play…where most people expect stiff mechanics”.\n\t[*]The [b]progression system[/b] is smart: you die, you lose operations-run loot, but you [i]gain[/i] skill tree progress and crafting unlocks — meaning every run matters.\n\t[*]The [b]risk vs reward design[/b] is sharp. ARCs are a constant threat (huge robots one-shotted squads in the preview) while other player-raiders are optional but present — the tension is real. \n[/list]\n[hr][/hr]\n[h2]🌍 World & Atmosphere – Gritty, Sci-Fi, Alive.[/h2]\nARC Raiders nails its mood: a ravaged Earth overrun by machines, human survivors underground, and above them the war for resources.\n[list]\n\t[*]The setting is [b]dense with atmosphere[/b] — previews described how the world “made me feel like the main character”.\n\t[*]The environment design has character — from ruined topside zones to dark extraction points, everything supports the extraction shooter vibe.\n\t[*]The playtest reveals a game that [i]wants[/i] emergent moments over rigid scripting — you feel the sandbox.\n[/list]\n[hr][/hr]\n[h2]🛠️ Playtest Impressions – Strong Start, Room to Grow.[/h2]\n[h3]✅ The Good[/h3]\n[list]\n\t[*]Accessible for newcomers: you don’t have to master ultra-complex mechanics to feel awesome.\n\t[*]Team-oriented but solo-friendly: you can drop solo and still make meaningful runs.\n\t[*]Promising player numbers: the playtest drew huge interest — over 185,000 concurrent players on Steam alone.\n[/list]\n[h3]⚠️ The Room for Improvement[/h3]\n[list]\n\t[*]As of the playtest, some [b]bugs, balance issues, and optimization[/b] still needed work — the devs themselves acknowledged the game was [i]“absolutely not ready”[/i] at earlier test phases.\n\t[*]Endgame clarity is still tentative: how deep will the loot-craft-extract cycle go long-term? Some community posts wonder about lasting depth.\n\t[*]For hardcore extraction fans used to ultra-high tension (e.g., Escape from Tarkov), ARC Raiders might feel [i]just[/i] a bit more forgiving.\n[/list]\n[hr][/hr]\n[h2]🎯 Final Verdict: [b]9.0 / 10[/b] (Playtest Version)[/h2]\n[quote=author][i]ARC Raiders is not perfect — but what it shows in its playtest phase is bold, promising, and very fun. If you’re into shooters with squads, loot, extraction tension, and sci-fi chaos, this one’s for you.[/i][/quote]\nThe playtest proves one thing: this is a [b]major contender[/b] in the extraction-shooter space. The full release will determine whether it becomes a staple. For now — you’re getting one of the most engaging taste-tests of 2025.\n🧭 [i]Drop in, Raider — the ARCs don’t wait.[/i]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "G",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only optimized UE5 game compared to other UE5 games + made by ex DICE devs which means insane immersive audio design. This game is designed for casual extraction shooter genre which is good for new players. Challenging AI and intense gunfights against other players. Recommended for people who wants casual experience.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "It's a good and engaging game.\n\nIt's enjoyable to play.\n\nThe environment and atmosphere are very beautiful.\n\nThe story behind it is strong.\n\nThe guns and gunplay are unique.\n\nBut contrary to what streamers and content creators say, it's not a perfect game.\n\n There's a lot of room for improvement, and there's a lot of work that needs to be done in it, and there are problems that need to be fixed.\n\nBut overall, it's a very good game and has good future.\n\nAnd most importantly, it's a great option to get away from Tarkov.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Playtest was incredibly enjoyable and showed incredible potential. Very addictive gameplay loop, with good polish and mechanics. It only misses a couple small QOL updates and it will be golden. Can't wait for the full release and to see what embark does with it.\r\n9/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Chat, it was a movie fr. Last two games consisted of me finishing the harvester quest but got jumped by ppl camping outside, doesnt matter. Loot was good and got my Equalizer BP in safepocket. Last game, I went in with full Torrente kit for some PVP at Control Tower, ended up tackling around 4 teams and killed em all. Came back with real good loot type shi. All in all, hopefully they revert the graphics to how it was in TT2 and see yall on launch day c:",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Достаточно уникальный проект, который из-за этого весьма специфично ощущается. В связи с этим я не особо понял его на первых порах, пока не разобрался и не привык к игре. Как только спустя десяток часов я начал что-то понимать в происходящем и немного раскачал персонажа - сразу прочувствовал глубину геймплея. После этого я осознал что игра не душная, а скорее скиллозависимая: опыт, и хитровыeбанные маневры, которые он позволяет совершать по ощущению решают больше, чем в других экстракшен играх. Как только начинаешь ориентироваться и чувствовать игру, тогда сразу и роботы раскрываются, которые на первый взгляд по ублюдски сбалансированы, и даже третье лицо перестаешь воспринимать как раковую опухоль. \nТакже после того как прекращаешь осторожничать со всем подряд и пробуешь позволять себе смелые вольности начинаешь ощущать, что игре всегда есть чем тебя занять и не дать заскучать (как в матче, так и в лобби) - это первый экстракшен на моей памяти, в который не скучно играть даже в соло. Но все это только если не вестись на первое впечатление и дать игре шанс, можно считать это своеобразным порогом вхождения. Причем на подобный отзыв я наскреб еще на стадии последнего ОБТ, где большая часть контента в принципе заблокирована, считай демка по сути. На данном этапе все еще видны некоторые шероховатости и иногда ощущаешь налет сырости,  но так как это еще даже не релиз, то считаю состояние вменяемым. Пока что карандашом - с надеждой на отсутствие у разрабов лени в будущем.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This [b]Open Beta[/b] or [b]Server Slam[/b] was awesome. One of the best extraction looter-shooters I've played so far. Surprisingly, had way more fun than anticipated. Gorgeous visuals, neat game design and overall polished experience.\n\nMain hub is definitely lacking 3D environments though. They should add a space to interact with other players and NPCs before you start a run.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3590341932",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Cant wait for launch. A more enjoyable extraction loot and scoot.\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Amazing game. best extraction shooter ive ever played. the vibes are awesome, setting is great. could obivously use some balancing, but thats to be expected. ONLY PROBLEM: NO ONE FUCKING LISTENS IN VC! WHEN I YELL \"IM FRIENDLY\" AND NO ONE RESPONDS, IT PISSES ME THE FUCK OFF! COMMUNICATE IDIOTS!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Great atmosphere, but needs more reasons to cooperate[/h1]\n\n[b]A beautiful and intense extraction shooter with amazing sound, smart AI, and impressive visual detail. I just wish there were more reasons for players to team up instead of shooting on sight.[/b]\n\n\nThe graphics and sound are great in this game. The sound design in particular stands out. You can easily tell when you might want to take a detour just because you hear a heavy drone flying nearby, or notice a probe with valuable loot standing close. It really adds tension and immersion to every step you take.\n\nAtmosphere in this game is also quite breathtaking. The visuals, the way the story is told, the lighting, and the world design all work together perfectly. You really start to feel like you are living in this world. Sometimes I felt as if I were playing a hybrid of my favourite games, such as [b]S.T.A.L.K.E.R.[/b], [b]Fallout[/b], and [b]Cyberpunk 2077[/b], with some mechanics that even reminded me of [b]Helldivers[/b] and others.\n\nPlayer design is also very impressive. You can easily recognize which type of shield and weapons your opponent is using just by looking at them when you are close. All these models are distinct and detailed, and even the secondary weapon is visible on the player’s shoulder, which adds a nice tactical touch and visual realism.\n\nAI-controlled enemies are also impressive. They try to perform strategic flanking, change positions during fights, and react to you very quickly. Their ability to adapt to different situations and the environment is truly amazing.\nFights with other players can be quite intense. A lot depends on positioning, weapon choice, skill, reaction time, and of course, who has the best gear and knows how and when to use it.\n\nThe only really frustrating part is dying. You lose your entire inventory, except for one small pocket that sometimes automatically stores a random item. It can be a funny surprise to discover that you still had some ammo saved there. 😄 I understand that this is normal for extraction shooters, but it still feels painful to lose all your precious guns and great finds that took time and energy to collect. They either end up in someone else’s hands or remain lying on the map if nobody needs them or has time to pick them up.\n\nI would like to see more quests or tasks that encourage players to be at least sometimes friendly with each other. It would be nice to have some reward for extracting together, even if one of you is knocked out but still alive and carrying loot, or for fighting against ARCs as a team. This would create more moments of cooperation instead of everyone hunting players who are already being attacked by bots, finishing them off, or camping and sniping near extraction points.\nI was really impressed when I watched videos from earlier playtests where people shouted [i]“Friendly!”[/i] or [i]“Let’s team up!”[/i] and then actually played together. They helped each other fight bots, extract, and even shared loot when someone needed an item for a quest. During the Server Slam, however, I did not hear anyone using proximity chat. I tried it a few times myself, but no one responded, so I gave up. I still helped other players from time to time to at least extract together without looting them, but others never did the same for us. Most people just shot on sight.\nI can understand why. There were quests for damaging or killing other raiders, plus extra XP rewards for it, but no rewards at all for helping others. It is logical that players prefer to kill each other instead of cooperating.\n[hr][/hr]\nDespite that, I still had a great time exploring, fighting, and experiencing this world. The soundscape, the visual detail, and the atmosphere make every raid feel meaningful and unique. I really hope future updates bring more incentives for cooperation and make the world feel a little warmer and more alive. If that happens, this game could easily become one of the best and most memorable extraction shooters out there.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Amazing game, with a friendly beginning when starting out. After 4 matches you are put into the the cycling game modes which have been fun except one where the spawn rate of annoying wasps and hornets (ARCs) is increased by way too much and you are constantly getting harassed by them. The matchmaking seems to be very quick apart from slower ones (over a minute) during the even with more wasps and hornets spawning. Would absolutely recommend, even more if you get a friend or two playing to play with you",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Never liked another Extraction Shooter besides Tarkov until now. Kind of a good mix of fast combat with a good amount of time spent on finding loot. The sound is GREAT, its a bit sketchy at times , maybe because its not all the way finished yet, but its great still. Guns pack a punch, lots of different grenades, healing items, oh and theres a chicken thats in your \"hideout\" so to speak and you can have it go out and find random items and bring them to you in bulk, AND you can put a little army cap on the chicken. . .so. . .buy this game on 10-30. Lol. Seriously, i like it alot, Bravo to the Devs. Truly.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is visually beautiful, and has great performance on my rig at max settings.\r\n\r\nI can only speak for the PVE aspect so far as I've only encountered a duo during extraction and a missile launching drone helped me take them out. That being said, the safer areas feel casual to loot and fight ARC drones in, and the medium areas feel more realistic. \r\n\r\nIn the medium loot zones (yellow on the map), there are tons of drones, easy to take down a couple at once but in a group they can easily wipe you out. Medium zones feel like the bread and butter of the loot pool so far, being consistent with tier 1 and 2 weapons or uncommon rarity stuff. \r\n\r\nIn the high loot zones, it feels like a genuine android apocalypse event, actual nightmare fuel. There are way more ARC enemies, and they are harder. Not just harder, but unless you have the right weapon type or throwables you will NOT beat them, and you will NOT escape them.\r\n\r\nI don't feel much gear fear in this compared to similar games so far, but this play test map is smaller and it's only 1 of the full game playable maps. The in-game economy is fairly simple to understand but interestingly enough some items that are common rarity (white/grey) are more valuable than epic (purple/pink?) ones! \r\n\r\nThere's no storm or closing circle to deal with yet in the game, not sure if something like that will get added to the main game play loop or if it would be a limited event or separate game mode. I see that night raids are a thing but I haven't tried them yet!\r\n\r\nUnlike other games in the genre, this game places an extremely high importance on noise/sound... Everything you do makes noise, and everything you hear from breathing, footsteps, bushes rustling, doors/containers/drawers opening/closing, gunfire, reloading etc. can be heard not just by you but by everyone else AND the ARC drones! You have to think twice about vaulting/hurdling obstacles, opening/closing doors, Sure, firing your weapons in an extraction shooter game attracts other players, but in this one, you can hear others climbing ladders, looting containers, and even healing. I really enjoy how big of a role that audio plays in this game.\r\n\r\nOverall, great game so far, big potential. Feels like a void is being filled for me as someone who found Tarkov too punishing, and found the cycle frontier too cartoon/arcade like.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Graphically, it looks great. I will have to get more play time in and come back to update this review \n\nUPDATE: There is NO PvE so if you don't like PvP this is not the game for you. Otherwise it is a challenging PvP game, especially when running solo so squad up with one of your steam friends or a random if your able to make a friend and have fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h3]Buy it![/h3]\r\n\r\nArc Raiders is set to take over the extraction shooter scene. The environments are gorgeous and tense, the game is smooth and intuitive, and the rush of getting out--or not!--is genuinely addictive. This is all combined with excellent PvE components, a living, breathing world, very responsive developers, and a compelling post-apocalyptic story. \r\n\r\nThis is going to scratch competitive, casual, and exploratory itches for all kinds of gamers. The Server Slam was a truly [i]peak[/i] experience, and that was with a heavily limited feature set. \r\n\r\nThis will be a huge game, and you should get it unless you already know you hate extraction games. It may be the best of its breed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'll keep it brief—there’s not much to dissect yet. The game looks beautiful, and it finally feels like 2025 is delivering a visual boom in gaming. We're seeing titles that are genuinely pleasant to look at.\nAs for the gameplay: the stress test offered limited content, which is understandable at this stage. Still, there were some minor issues—nothing critical, but worth noting. I hope they address certain unfair advantages before launch, such as accessing rooms that require keys without actually having them, hit registration through textures influenced by ping, and the need to nerf overly aggressive NPCs in specific zones.\nThat’s all for now. Looking forward to the full release.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Visually treat \r\nbetter optimized \r\ngameplay-wise  its just early , nothing to do other than loot and dip",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a real one boys.\r\n\r\nGorgeous graphics. Second to none audio. Great lore. Lighting perfection. Movement and combat feel perfect.  Immersion out the ying yang boys.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "So... This is gonna be an interesting one. Now I'm gonna start with some context, I got access to the playtest whilst I was visiting my parents house and so I don't have access to my pc, that being said I have my uni laptop (which has run helldonkers before) and I'm like I need to atleast try it. So we look at the specs required.. ah dedicated gpu hmmm don't have one of those.. She'll be right. Download the game.. All good, open it.. Bit noisy but all good.. Cut scene... all good.. -_- suscpision mounting and I finally get into the game play. It's yellow... EVERYTHING IS YELLOW... I CAN'T SEE. Regardless to say 10 / 10 would arc raiders again",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game that came out in years.\r\n\r\nGame of the year already.\r\n\r\nDevelopers did a REALLY REALLY good job.\r\n\r\nI can't wait for full version to come out.\r\n\r\nThank you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I believe this is the third playtest I've tried for ARC Raiders.  It took awhile but it has grown on me over time.  This is only reflective of my opinion of what is available in the playtest.\n\n[b]PROS: [/b]\n- A decent mix of weapons that feel good, with customization options\n- Lots of interesting useable items\n- Multiple ways to obtain items (crafting, buying, looting) and free basic loadouts\n- AI enemies feel intelligent and dynamic\n- I like the aesthetic \n- The map available in the playtest has quite a lot of places to discover\n- Larger boss enemies\n- I like the aesthetic \n- More approachable than most extraction games\n- The game can be really fun and exciting\n- Solid performance, stable servers\n- Map has night / day / weather variations, and enemy layout variations and so on\n\n[b]CONS:[/b]\n- Looting can often be disappointing, as there are a ton of dull trash items you find, many of which can be salvaged into....more dull trash items.  Lots of items for crafting.  I like the crafting up to a point but it can become tedious\n- For every match that feels fun and exciting, you can expect to have 2 or 3 more that are quite uneventful, or encounter very one-sided PvP fights that are over quickly, or get stupid team mates.  It's the nature of these games\n- Proximity chat can be fun, but 3/4 times it's just used for people to hurl insults and slurs at you.  Sad 35 year olds wanting to relive their Halo 3 and MW2 lobby days and emotionally stunted children\n- The game has keys for locked doors.  The loot behind said locked doors can sometimes be.... underwhelming \n\nOverall it's been a good time despite any complaints I have.  I have never personally played Tarkov but I know it's a huge time sink that many don't find approachable and many veterans are not happy with.  Hunt is decent despite my issues with it, if the servers work for you that is.  Dark and Darker is having.... a time.  Marathon likely won't do well.  If you want a fresh extraction shooter, or just a new PvP (or rather PvPvE) experience, then this might be a good option.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Incredible game, THIS IS STILL A PLAYTEST/BETA/SERVER SLAM whatever you want to call it, sure things can change get worse or get better, but embark have always responded to community feedback so well compared to other franchises. there will be more content/maps etc. at launch without a doubt.\r\n\r\nGIVE IT A GO while its still free, dont make an opinion on the tutorial, play your first real raid. no game can appeal to everyone but i think of all extraction shooters this game will make the genre both accessible and fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Goodbye Tarcov..... it's been real..... it's been fun.... But I can't say it was real fun",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "only played 2 games so far.\r\n\r\npretty well optimized, I, with my potato pc, ran this at a *mostly* stable 40-60 fps (which is good cuz this game is really pretty)\r\n\r\nsound design is peak\r\n\r\ngameplay is peak\r\n\r\nlots of overall fun",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "please, PLEASE give us Dads with jobs a PvE version to play! i beg of you, Embark, please. i really like this game, been watching its progress for years now but i dont enjoy PvP and i know im not the only one. there is a market for a PvE only version and i for one would buy the game now if i knew there was the option. as it is im going to hold off purchase until / if i hear about a PvE only gameplay option.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What an amazing game. I can't wait to see what the full game is going to be like! Its already so fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't normally like games of this genre not theme. The world this game is set in is also a bit dark for my liking... But despite that I liked this game and what felt life 20 min was actually 3 hours. The only concern I have for this game is it's end game content... What happens when you get really stacked on resources? I wonder. Felt pretty lost at first 10 minutes of the game as I didn't understand a lot of things, but I gradually did and this was an enjoyable experience for me overall.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I WAITED SO LONG FOR THIS GAME AND IT DID NOT DISAPPOINT well expect the lack of map selection but I CANT WAIT FOR THE FULL LAUNCH!!!!!\r\n\r\nOCTOBER 30TH GET YOUR CALENDERS READY!!!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "people complaining about an extraction shooter because its an extraction shooter are obviously too illiterate to read and too blind to see. what else were you expecting? not an extraction shooter?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very goo looks stunning reccomended for people that struggle with tarkov or cant play tarkov as they dont have a pc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm having a total blast on this game but unfortunately don't have alot of time to play these days, however, here is my take:\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☑ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☑ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved it, the gameplay is amazing and the best part is, its that its optimized af runs on 70fps low DLSS Ultra Quality and 110fps DLSS Ultra Quality + FSR\nPeople weren't kidding the audio is next level, you can really feel the intensity of the combat in the game. In the game I litrally marked a location and my character said \"over there!\" out loud lmao and the drones heard us and some other group aswell they came hunting us. All because I marked a location and said it out loud and they heard it\n\nThe world building is fucking beautiful, the enviroment the futuristic metal 80s type of vibe. Honestly I'm just really sad it couldn't have been just a pve game or maybe a gamemode option just for that\n\nI hated the fact that if other players have spent more time, they know better and they probably have better loot so it's just pretty difficult for people who like me suck at multiplayer game's for intense combat scenarios\nOverall 10/10 game, just hate that its pvpve only and that you lose your gear if you get outgunned by some pro who has already looted the entire town",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As the game itself is pay to play, please make skins and shop items with real money much cheaper. It's the only bad thing to say about this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest game I've ever played. Even though I didn't meet the requirements and the game didn't render, the intelligent design shined through. I hope this game sells and generates an ARC RAIDILLION dollars!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I already played when its in test phase and I like it. So fun so I bought it. Definitely recommend it and worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game! It's opening the door to a new type of extraction shooter. AI must be stopped.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im only giving it a thumb up because it supports linux. but, it is a woke game. it has type one and type two bodies, because THEY CANT HANDLE males and females. Main characters all look trans, no thanks. not my thing. you dont like my review? fine, give me your points with a clown. you don't deserve your steam points.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This feels like a Blockbuster Movie! The best part about this game is it is a fun and exciting experience for almost all gamers! 10/10! I pre-ordered the Deluxe! I would like to do more tests like this in the future!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game was my first experience with an extraction shooter where I was happy to play it constantly, even though I was solo-dolo and a crap extraction shooter player. I am looking forward to playing the full version on the 30th of October",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked Arc Raiders Playtest. The graphics were well done and polished, the audio really helps with immersion. I was a bit surprised at the UI and how plain and cartoony the items and such in your stash look compared to other titles in the genre. Weapon feel was good and targeting seemed accurate, (though I reserve judgement). The PVEPVP was great I found myself in a pvp battle that got too close to some robots and the 2 of us had to start working together to survive. I think this stands apart from other games like it enough to be worth a try. Mind you I wouldn't have the same opinion at a 70 dollar price point, but at 40 dollars and many additional maps and features coming I can definitely say its on my radar and seems to be a good bang for the buck at this point.  Ohh and I love the rooster \"Scrappy\" that was a nice touch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Exciting Game Play and Great Atmosphere overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and exciting, can't wait until full release, 9/10 awesome game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun as a long time extraction shooter fan i can say this was the most actual fun ive had in these type of game..solos were often friendly as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "116 Hours of testing this game and I still have barely an idea of what is going to be possible after launch. This game deserves all of the hype and so much of the love. Enlist. Resist.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly enjoyable and this was just a Playtest! Just wait til the full release! This game is going to be PEAK!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an Extraction Adventure game. They used machine learning to train their AI. It's heavily crafting-based. In game VOIP. Solo/Squad based mach-making. Beautiful maps. Amazing map layouts. Best sound design I've EVER heard in a game. Runs fantastic. Great control responsiveness and movement. Intense experience every second of playing. Basically every weapon feels viable. Utilities are actually useful. I get to horde lots of stuff. Scrappy the rooster can wear hats. Game is a solid 10/10, easiest deluxe pre-order of my life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun so far. lets see if they ruin it with micro transactions or not",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the test is over but it foretells of a promising game. I look forward to the adventures to come.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is honestly a great game to put all of your time into. finally a good extraction shooter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is different and fun in all the right ways.  The server slam delivered a game that was exactly what was advertised which is rare from game makers these days.  It caters to casual and hardcore gamers and its a must have in the steam library.   Kudos to the entire team that made this game happen!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thanks to Arc Raiders and me loving the game so much I sold my Cs2 knives before the crash so I could buy the full game. If it wasn't for Arc Raiders I would've been down $600 So Thank you Arc Raiders <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I whole heartedly recommend this game as a sort of perfect, Terminator experience. Imagine yourself not sent back in time to our era, but actually playing in a Terminator world, overrun with robots and mechs. That's what this is like. With a little bit of Walking Dead raider v. civilian action.\r\n\r\nI never played an Extraction Shooter before. I didn't think I would like the idea of it, losing all your stuff if you do not survive the round, especially since I'm not particularly good at PVP action. \r\n\r\nHowever, I saw Asmongold play it, and I was curious. So, I participated in the Server Slam, knowing nothing about the game, and practically never even hearing of it before. \r\n\r\nImmediately, almost everything was just so intuitive. The graphics and sound just BLEW ME away, and I was hampered by a very old computer, but it still looked great and performed well for the most part. I loved exploring different areas, and just figuring things out without too much hand holding (if you like Elden Ring, you can expect some of that mystery of both lore and mechanics). \r\n\r\nI attempted to avoid most players, and focus on the environment, although I was not always successful. Despite being awful at PVP, this system is a bit forgiving, at least with starter weapons to which everyone was limited. I was able to actually escape most fire fights even when wounded.\r\n\r\nI played for 20 hours, and had some INCREDIBLE adventures. Too long to explain here, but heart pounding chases by mechs across the map, hiding in trees, crawling through swamps, barely making it to the extraction point, being gunned down while defenseless, out of ammo, and running in circles until the elevator arrived, dragging myself in bleeding to death, and ... SURVIVING.\r\n\r\nFor awhile I was doing really well and thought oh I got this now. Too easy. And then I was killed like 5 times in a row. Out of frustration I spawned in several times WITH NO GEAR AT ALL. So, there was nothing to lose. Even if I died, I always had something in my safe pocket and earned XP.  And with that, I was able to rebuild my stash to respectable levels.\r\n\r\nI have no idea what a full experience would look like, if that strategy will work when other people have epic disintegrators or whatever, but you know, I'm having fun. SO MUCH FUN.\r\n\r\nLike Elex years ago, this is the game, I never knew I wanted SO MUCH to play. I cannot wait until this goes live. I just hope I can get my computer to run it properly all the way this time :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game rocks! most fun me and the boys have had on a extraction game in awhile! See you on the 30th Raiders!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is fun. Way too expensive tho. There is better games out there for the same buck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game. The movement feels clunky at first coming from other games but soon becomes natural and seems necessary for this type of game. Feels like we are finally getting a true AAA game and not some puzzle of a game that is pieced together over the next 3 years after launch.\r\n\r\nPros:\r\nGunplay feels sharp and responsive\r\n\r\nMovement makes the game slow down and be more methodical\r\n\r\nPvp feels great\r\n\r\nGood balance between pvp and pve\r\n\r\nDeath feels punishing\r\n\r\nSurviving feels accomplishing\r\n\r\nCons:\r\nArc detection range a little wonky (but has already been addressed to be fixed)\r\n\r\nSince test was done on one map with little crafting progression it felt repetative at a certain point",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing atmosphere and a game of PVPVE engagements where the difference of playtime with players and AI enemy's is well spread in a manner of making both threatening at all times top side.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game test was promising overall. This still managed to be a very fun game, despite the test server's limited content access. Fall damage was balanced, items have clear purposes, and this game creates a noticeable skill curve in the inventory management system. Combat mechanics were acceptable, but the incomplete weapon & crafting access leaves me questioning the potential for unbalanced, toxic, or simply game-breaking playstyles. Bonus points for the \"Unstuck Player\" feature, that caught me by surprise in a very good way. \r\n\r\nDeveloper Notes:\r\n[Visual] -Clean up the hard lines of lighting at shorelines, & improve lighting transitions from mud to water.\r\n[Mechanical] -Improve jumping forward for smoother climbing mechanics; jumping while moving forward at a low speed should make you jump a little further than it currently does.\r\n[Quality of Life] Add a toggle switch for \"Craft to backpack\" so players don't have to make more storage space to access brand new items. [You can add a script to disable it automatically if the inventory is max or greater to avoid exploits.]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is pretty fun, playtest was smooth and got matches very quickly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good fun, a different approach to a extraction shooter, with tarkov and and hunt showdown being the only ones out there, good to see something different, a touch expensive i believe, still plan on getting it though, i look forward to playing more, i always appreciate a free open play test, cheers to a continuing success.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of most funny games i have played in long time, incredible performance on UE5 is such a surprise, PvEPvP very enjoying, no dumb zombies like others looter shooters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great and fun game, not as good if you want a more chill time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a masterclass on game development. From a lesser known studio you would expect lesser quality, but EMBARK studio has something special here. From the ARC to the PVP, to the sound design to the environments, This game has it all and a bag of chips. Hands down the best game i have played in years, a TRUE contender for GOTY!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very stable gameplay. No lag experienced. Did fall through the map once but was quickly reset right next to where I fell through. The same when I got my player stuck. After two attempts the unstuck button worked and reset me nearby. Both of these quick problem resolutions kept me in the match and playing the game without unneeded frustration. Now the biggest error I ran into was having the game crash mid fight but I restarted and was really glad to find I could log into the same match and continue. This felt huge. Now it crashed right away but let me back in again and I found the other player also afk but he returned too and we were able to continue fighting. However my shots wouldnt land on him so I think we got desynced in the process so I just ran off. Now those were my only problems and each was quickly resolved and kept me playing and immersed in the game.\r\n\r\nAs to the gameplay itself I had a blast. I play solo and found the PvE really fun, sneaking around past the AI was a lot of fun, they were a formidable force that can't be ignored. The PvP was fun when I felt like it, but often found running into other solos to be fun too, most were happy to just say hi and go our separate ways. Made a few friends helping them fight off their ARC pursuers and then head off on my own journey. Sure there were some sweats who would rather take my free loadout than let me pass in peace but the player interactions I had were mostly chill. I think everyone was genuinely just having a good time in game which says a lot. \r\nI'm usually pretty late to games having a busy life but I pre-ordered this one. Highly recommend for anyone who didn't take part in the playtest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played a limited number of minutes on the trial weekend version. The game played well, responded to commands and was easy to use on a PC (all standard U/I). I went on a mission with another player (random) and we went off. Neither of us knew what we were doing. The quest said score 3 containers. We kept looking for specific \"containers\" but didn't find any. We did open up a bunch of containers but there was no indication those were the containers we were to find and empty. Additionally, there was no indication of what was most valuable to score for that quest v. a lot of equipment that might not have been as valuable (we both had full inventory). A little more graphical help through that in the beginning would have been useful. I would actually play this again. Apparently you can do this in small time scale increments which would be useful for most casual players. I just wish there was something that more clearly detailed quest scope and helped you (if you wanted)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game BuuuuUUT the basic AI that's almost everywhere on the map can fly, track you hella good, take hella damage, and give hella damage.. they also come when you shoot. (its not to fun when I get punished so heavily for PVPing in a PVP game by getting third partied by a group of flying CLANKERS with assault rifles, rockets, and tazers EVERYTIME!!)\n\nBesides that everything else is pretty good for what it is. Its an extraction shooter with great graphics, fun combat, and a cool concept( + It runs good(YIPPIEEE)). I would also like to see big events that would bring different squads together.. like a big ass boss battle or a Travis Scott concert( give reasons to use voice chat other than trash talk). I give it a 8/10 and fuck the anvil it makes every other gun feel like a afterthought pea shooter. - Dr.skull signing out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the open world looting aspects and the pvpve. The weapons are cool and have variety. The arc enemies are all awesome as well. Can't wait for the full game to come out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is very fun. was hoping for more coop between players tho. I'm cool with the PvP but it seems that people are incentivised to kill each other at every opportunity which leads me to wonder why there are even arc robots to fight if everyone is focused on killing each other. this is more of a player issue than it is a game issue tho. but maybe if the game can add more incentives for cooperation we can strike more of a balance with the PvP so that the fights with the robots actually have some meaning outside of world building for a BR.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall GREAT game 9/10 ... especially by the end of the server-slam, I was really getting it. I love as a solo player trying to get other players to work with me against the machines. There are a few things I REALLY like about the game, and only 1 or 2 I don't... and from a high level, the game is super impressive. Well made. Good programming and development process shows. I had no bugs, no crashes, no strangeness at ALL in the game. Super super impressive. \n\nI'm surprised by how much of a Tarkov ripoff it is. It is 90% or more a reskinned-tarkov. I thought they were going to deviate from the fomulae a little more than that, but nope. That's a LITTLE disappointing. I was hoping for some new features or a new twist on the mechanics, but boy they really bit hard. The locations to deploy to, the crafting, the vendors, to the upgrading your workbenches, the menu-heavy aspect of the game. I almost thought the Raiders base (sparanza) was going to be a city you could walk around, but no. They just did the tarkov part with your base. From the safe slot in your inventory, to keys that unlock special areas, to the quests - I mean they literally photocopied that stuff.\n\nBut, to their credit, the 10% or so that they changed, are really good changes. Mainly the fact that there is a map in the game ... that is a godsend. I like the idea in tarkov that you need to learn each location yourself, follow a map on your own outside the game, but I just always found that overly cumbersome and is a huge barrier to entry for new players. Also, they cut down on the ammo. Ammo is a problem in tarkov because they want real guns, people want their favorite guns - but then the \"realism\" factor forces them to add that exact ammo to the game. So now you have 246 types of ammo floating around, nothing matches anything else, and it's a headache. Huge W for Arc Raiders going with the Light/Medium/Heavy and Shotgun ammo. I think there is also not going to be an auction house in the game, player to player trading which I think is also a win. Good choices on things to remove, change or add. \n\nThat about sums up my experience and thoughts. The only other thing to mention is the TTK. Time to kill is insanely long... and I know what they are doing with making it so long. It makes sense. More chances for players to escape, you dont get 1 shot by something you didnt see, more of a chance that one of the Arc machines gets involved, all cool shit. But I think it's a LITTLE bit too long, haha. But, I like the concept.\n\nAgain, 9/10. Am buying on launch day. I encourage the devloper to think outside the box a little bit and try to add more \"playable\" parts of the game, because I find the long periods in the menus to be a little boring and tedious. Also, being able to arrange my inventory slots how I want would be a huge bonus. The auto sorting and filtering is great, but you should also be able to build a custom view if you want. \n\nthank you for coming to my ted talk. play arc raiders, you wont be disappointed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excited to see the full game! \r\n\r\nMy rating: 8.5/10\r\n\r\nPros:\r\nSound Design on top\r\nPlayer base is so far non-toxic, could easily change though.\r\nEnemies aren't too hard but aren't too easy to defeat\r\n\r\nCons:\r\nPoor optimization (I had experienced a ton of lag spikes, long loading screens, and crashing)\r\nConfusing menu screen",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good, took a minute to figure out the goals and how items worked.\r\nIt's a challenging game for sure..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banger. If you have less than 3 hours on the game don't write a review, if you have more than that and you don't like it then learn to fight the AI. If you think this game is like Tarkov, you've never played Tarkov. If you got third partied, died, and you're mad, you've never played an extraction shooter, learn to be stealthy. Sorry there's no yellow paint, skill diff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is really good. I played the division allot and it gives the same feel as the old days.\r\nI would like to see the arcs a little bit nerfed because they deal a littlebit too much damage (mostly 2 shot)\r\nAnd the customization can be a little more.\r\nLike weapon mods, scopes, red dots, bigger mags, some perks maybe?\r\nA first person view with gunuse would be nice because it is not always easy to see in the distance.\r\nIn general just more option to personalize your character and playstyle and i will no life this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've played in a long time (since the finals) I love the atmosphere, it gives a very gloomy, The Last of us vibe and has gameplay similar to DayZ, or Generation Zero, but combined with MWII DMZ or Helldivers, and while I just gave multiple comparisons it truly feels unique in the sense of gameplay. I went into playing the game thinking it would be something I play a few times and then uninstall shortly after but its going straight to the top of my wishlist! 10/10 would recommend. While some times the game can have a horror-like atmosphere, if you stand on top of a complex you will be bedazzled, I stood on a balcony for a solid 5 minutes gazing off into the distance, and the animation that plays when you load into the level entering the tubes is genuinely so satisfying! I will save my paychecks for the next 6 months just to get this game and miss out of breakfast for another 6 months (I'm quite hungy rn).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Core gameplay is great, however, this game does not work fluidly as an online multiplayer extraction shooter. While it's far too late in the timeline to pivot back, I would like to see a PVE mode implemented in future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's enough like a mix between Generation Zero and Forever Winter that I'll be coming back around when it gets published to see what weathers. The aesthetic is good, light-RPG elements, crafting doesn't feel too meta/grindy to follow and the gunplay was pretty decent for an over-the-shoulder pov. Rolling, jumping, and general movement felt pretty smooth and melee strikes were also fairly intuitive. No 1st person POV though; I'd like to [maybe] see it put into a skill tree and tie-in through consuming Stamina with usage.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good blend between survival, RPG character building/crafting and action. Lots of fun, worth the wait.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Retro Cassette FPS Semi-Coop Extraction Shooter.\r\n\r\nAll that needs to be known, has been said !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Elevator camping rats gave me cancer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool :D",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Title: Arc Raiders: A Post-Apocalyptic Identity Crisis – Not What I Expected\r\n\r\nHaving spent some time with Arc Raiders, I regret to say it largely missed the mark for me. While it boasts a polished facade, the experience underneath feels shallow and ultimately unfulfilling.\r\n\r\nFrom a purely mechanical standpoint, the gameplay feels competent and modern. Character controls are standard for a third-person shooter, and visually, everything is well-executed. However, much of the core gameplay loop feels derivative, borrowing heavily from established formulas without adding anything truly unique or compelling.\r\n\r\nMy biggest issue, and where the game fundamentally fails for me, is its complete lack of immersion into the post-apocalyptic world it claims to inhabit. Despite the serious tone the game initially presented, from the very beginning, Arc Raiders constantly felt more like a vibrant, arcadey experience akin to Fortnite.\r\n\r\nThis isn't necessarily a problem for all games, but Arc Raiders marketed itself as something deep and serious, promising a gritty struggle for survival. Instead, it delivers a very surface-level engagement. This disparity between expectation and reality feels like a significant misrepresentation, one that I believe will disappoint a large segment of its potential player base.\r\n\r\nOn a more positive note, the game's graphics are quite good, and from a technical perspective, I encountered no significant issues with performance or stability.\r\n\r\nUltimately, Arc Raiders seems best suited for players who enjoy engaging with gameplay mechanics without needing a deep narrative or world to get lost in. If you approach games like competitive titles, where the surrounding atmosphere and story are secondary to pure action, you might find some enjoyment here. However, if you're looking for an immersive post-apocalyptic journey or a game that lives up to its initial serious promises, Arc Raiders is likely to leave you wanting more.\r\n\r\nNot Recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dull, boring and absolutely not worth the money. Huge pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they payed VAs what was essentially a licensing fee to use their voices for Generative AI. While the VAs were still payed at one point, the end goal is still not paying them for ALL their work. This is a scummy practice and shouldnt be normalized. I'd reccomend not supporting this game or its Dev team until they get proper VA work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, very fun to play, engaging, rewarding and straightforward, however, the use of Generative AI for the use of voices is a no no for me automatically, if this changes in the future, I'll for sure get it instantly",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"flavor of the week vibes\"\r\n-every level looks the same. its either jungle or warehouse\r\n-items are just a basic thumbnail of like wires or a cube so looting isn't satisfying\r\n-time to kill is too high. shooting robots with bullets is lame. shouldnt you have specialized weapons against them by now?\r\n-price is too high, still feels like early access\r\n-value is low looks like 5 hours of gameplay then it gets stale\r\n-main menu crafting and missions aren't satisfying\r\n-everyone has the same gun and same armor and no customization and skins are lame\r\n-it feels like it adds nothing new to the genre, like what have they invented?\r\n-i would rather play tarkov or delta force",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why is everyone losing their mind over this game, it's so boring, you very rarely meet other players, there are barely any AI enemies, little to no loot anywhere, what's the point?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played the tutorial during the weekend playtest but stopped there. After looting one of the first structures I knew opening a door would trigger some sort of lesson (probably a cutscene), so I left it for last, and I was proven right. But what happened was a scripted ambush, where after I gave a sigh of discappointment that I was proven right I had to wait through five seconds of getting shot at while my character stupidly continued failing to pry open the door. I couldn't figure out how to cancel, if you even can, and I of course died. \r\n\r\nBUT IT DIDN'T END THERE. My assailants rifled through my pockets as I bled out, not only stealing all the stuff I just grabbed (which, yeah, I get it, it's a pvp extraction looter), but taking their sweet time about it. This scene was wholly unnecessary, I know what game I selected, and it felt like the developers were rubbing my face in it by dragging it out, \r\n\r\nBUT THEY STILL WEREN'T DONE. Now the game just *revived me on the spot*, as if to say \"get up so I can kill you again!\" and I had to scramble to find (or craft? I can't remember) bandages again. If I can craft or find them so easily, why did the scavengers act like they found gold? F!@# that, everything together felt too disrespectful; I finished the tutorial out of spite, but I had no will left to play more after reaching the elevator so I dropped the game. \r\n\r\nBattlefield One's onboarding was better, where they killed you like 7 times but it felt fair, like you had agency as a player even though you were guaranteed to die by an artillery barrage or something if you survived too long.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there's more campers in this game than a your local campsite",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"I strongly feel that this is an insult to life itself\" -Hayao Miyazaki",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is ok but not worth the 40$",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "suffering.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This has got the be one of the most boring games I've ever played.\r\nYou just go around the huge empty map looting garbage, then your backpack fills after like doing this 4 times, a drone sees you, empty all the ammo into it, run around few more minutes like an idiot looking for a little bit of ammo, oh there are \"quests\" to loot specific kind of shit, you do it then realize theres nothing more to do, go for extraction point, hoping some nolife is not camping it, call it in, crouch behind a box waiting, other moron goes up to it, take them down with the 3 bullets you found earlier, go in press button, extract, game over. Repeat this over and over thats the game. After you do this a few times you can just afford a key with you can get out instantly without having to even wait for a possible fight around the extraction. Whole gaming is run around, collect some useless shit, avoid enemies as much as possible and get out. Even if you wanted to get into fights, the map is so huge you'll rarely ever run into more than one enemy, I've yet to die to any of them and this type of game is supposed to be filled with sweats so I suspect the game may be filled with bots the devs are not being honest about.\r\n\r\nAt least it looks okay and runs okay, extra point for Linux support, minus point for forcing Secure Boot on Windows users, they'll probably disable Linux when the first cheater gets reported because thats about as far as the brain of modern AAA multiplayer devs goes.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I miss the original sales pitch for the game. A PvE style extraction shooter, where you cooperate with friends and other players to complete objectives and defeat bosses. the current game decided to lean too much into a tarkov style PvP extraction shooter, creating a landscape for the same type of toxic community to surround the game that surrounds tarkov. A game that i was genuinely excited for to play with my friends is now ruined by the \"Meta\" and players sweating rather than having fun",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "Lots of hype, and honestly the graphics are really nice, but the gameplay itself is a bit boring. I think it could have potential but its possible that I'm just not enjoying looting games anymore. I think this theme and the potential lore behind it could have been better used in a singleplayer story-driven game. Overall I think it's okay, and many will have a lot of fun with it, but I don't think its for me.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "Allowing players to spawn fresh into an ongoing raid is a terrible decision. Fighting through 3 groups of extract campers just to get jumped by a fresh group that has bullets and shields is not it. Next",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Been playing since the technical test however I cannot in this state recommend the game.\r\nMy thoughts are as follows...\r\n\r\nThe PVP is good and the controls feel fluent and responsive however every fight I get into is always ruined by the \"ark robots\". I understand that the ark robots are meant to deter players from making noise I get that but...\r\n\r\nThe robots only target one player and don't de-aggro or swap targets even while being shot at by a different player. To many times I would end up in a fight which i'm enjoying just to have 3 robots waiting outside my room only aggressive towards my team and not the team outside with them.\r\n\r\nThe looting feels worthless whats the point in scrapping items if a chicken can SH#T out all the parts I need?. I understand you'll be able to upgrade your workbenches and craft better guns and equipment but in the technical test and this server slam I haven't seen enough in the 11 hours of player time to know if I like that system.\r\n\r\nFurthermore on the looting, so called high-tier loot areas have never seemed to contain any loot i would find that useful and never have I been amazed by anything I have found. Personally I don't believe the risk is worth the reward and that is if you even get there first as some spawns effectively place you right below the main loot ares, which seems unfair if you spawn miles away.\r\n\r\nIt is also way to easy to leave the elevators make minimal noise and don't really attract robot attention unlike in the technical test meaning that players are almost encouraged to leave even if they have only gained minimal loot. There is nothing to encourage people to stay in a match longer like bigger robots spawning with better loot, basically nothing to keep people in the match meaning that multiple times I've played matches and simply seen and heard nobody\r\n\r\nUltimately in the games current state £30 is simply to much to ask for the game in this state and I encourage people not to pre-order or buy this game upon launch",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Shroud streams it 24/7 = sweaty no fun losers playin, stay away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Today I saw a friend on Steam playing this game. So I thought, why not try it myself.\r\n\r\nThe introduction is a bit short, it explains the basic concept of the game and the world where it takes place. I found it rather interesting as a concept, the gameplay reminds of games like Escape from Tarkov and Rust. \r\n\r\nThe first raid I tried to keep it simple, follow the instructions from the quest I've been giving. Not too complicated, though quickly I realized, that the game is not going to go all soft on new players. That I can appreciate, challenging from the start and giving you freedom of choice while also facing the consequences of your own actions. Having played a couple raids solo, there were many ups and downs. While the ups are there for sure, the downs is what got me to write this review. To name a few things:\r\n\r\n- AI pathfinding:\r\nThe drones as enemies are a missed opportunity. The ones with automatic fire are relatively easy to defeat, but the others I encountered are just annoying and in numbers, especially when you play solo, easily swarm you. Their pathfinding felt as if everytime I wanted to go someplace else, they just B-line/fly directly towards me. It felt like the NPC enemies in Rust, a bit better and giving you the time to fight them tactically.\r\n\r\n- Goal of the game:\r\nI lost all my stuff in what could have been a good raid. I understand the concept of losing your items when you get downed/surrender. If that is your thing, than this is a game you probably like or even going to love to play again and again. But for me, it is a game where I can not get into, just too time consuming for what it is worth. If this game were to be published seven to ten years ago, I would have been playing it a lot more.\r\n\r\n- Performance:\r\nThe game performed well enough, it feels similar to the previously published game from Embark, The Finals. Some tweaking needs to be done, to finetune and make the impact of lower settings viable. Lowering did almost nothing to lower my GPU and CPU usage, so I advice Embark to look into that. I have faith in that.\r\n\r\nTo come to a conclusion:\r\n- Try it for yourself during this playtest weekend.\r\n- If you like it. good for you, enjoy it to the fullest.\r\n- As of now, I find this game too boring to enjoy.\r\n\r\nMaybe in the future, I will give it a go again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I’ll sum up the game very simply: PvP players will get bored quickly, and PvE players won’t buy it.\n\nPvP and PvE just don’t mix they’re not the same kind of players.\nOn one side, you’ve got toxic players who jump from one trendy game to another. On the other, PvE players who just want to chill and enjoy playing (which is, after all, the main purpose of a video game).\n\nWhat’s really disappointing is that the game was originally planned to be a PvE experience, but they turned it into a PvPvE one the worst decision they could’ve made. The game would have done so much better if they had stuck to the original full-PvE concept. There are so few quality PvE games like this, and players would have stayed loyal for a long time.\n\nBut the simple fact of adding PvP already killed it. PvP players will have fun for maybe two or three months, then move on to the next thing. To save the game, they should’ve kept the original idea — but it’s already too late. Bad decision.\n\nI’ve stopped buying any multiplayer game that includes PvP I’m done. I just want to play peacefully, cooperate with other players, not deal with selfish, angry people who fill every multiplayer game with toxicity.\n\nIt’s a shame, because otherwise the world, the environments, and the gameplay all seem really promising and enjoyable I genuinely liked that part. Unfortunately, in the long run, the attitude of certain players will ruin the experience for everyone else. For €40, that’s an expensive disappointment.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Arc Raiders is a really good extraction shooter, but it's still an extraction shooter. There's a solid PvE looter shooter here, but the PvP aspect honestly ruins it completely. They had the right idea, then wasted it by chasing trends. Would you like to lose hours of progress due to someone camping the extraction point? Then Arc Raiders is for you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, Not a good or fun Extraction shooter, PVP is mid to subpar, not veryenganging and serves no purpose, You do not gain anything for killing another player, the loot pool is all low end, even if it was high end it still isnt worth killing people over, the AI is boring and lackluster at best, just strong unkillable machines you avoid through rough not great or well implimented stealth.\r\n\r\nIts a shame and a sham that the FREE TO PLAY COOP 3rd Person Shooter doesnt exist and instead we have PVPVE boring Looter shooter extraction game, that has a heavy pull away from coop as coop does not make the game better it only made the whole experince worse with tighter loot, and tighter times in the zone. Coop in this game is really only good for Squad fights which is horrid combat, or vs ai bots at which point your getting best loot drops farming ai..........",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Finished the tutorial, got dropped into the first area with nothing but the basic gun, got shot and killed within the first 30 steps I took out of my pod. This game is for sociopaths. No thanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not a bad game. Looks good and can be entertaining with good teammates. But with limited money and time, I can't see myself justifying buying the game because your time is completely wasted when you die.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not for me. \n\nThe extraction shooter genre in general is a flawed game design. It lures in PvE players and then blindsides them with PvP sweat lords. It requires you to invest time and effort to collect resources in order to upgrade your gear and then takes everything away the moment you loose an encounter. Couple that with hoards of losers who camp extraction sites ambushing players, shit talkers on the prox chat who mock you while they loot your corpse, and super aggressive AI bots that swarm you with no way of escaping, its a perfect storm of time sink, frustration, and table flips. \n\nOverall not fun. \n\nSpending 20 minutes running around opening drawers and gathering junk just to loose it all after someone sucker punches you is not my idea of a good time. Equally, sitting around for 20 minutes, waiting for someone to gank is tedious, boring, and a failed test of character. Shame on you all who enjoy this gameplay loop and pissing other people off. There's a special place in hell for you. I'll come visit and laugh at you while you're getting your ass packed with hot coals. You certainly deserve it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game has alot of potential to be alot more fun i dont think the PvE should be so difficult this game is going to cater to the majority of its player being here for th PvP and with the PvE being so tough it takes away from the fun of the PvP aspect the mobs in this game are so deadly its ridiculous they eat damage like crazy and dish it out even harder this game is way to difficult all on its own without the addition of other players i think if they are gonna have NPC enemies in the game they need to tone down how tough they are to take on other wise they wont have many players for very long the game is so hard and the fun dosent really start until you can somehow manage to get high tier gear and its a grind to even get that far due to constantly dying to terminator level robots while trying to fight a team or 2 of other players just to lose all the purple gear you just found or all the mats you needed to upgrade when its fun it is really fun but those moments come far and few between i would really love to see some changes made to the PvE to keep people from being afraid to even leave a building because they dont wanna get melted by robots",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is [i]JUST[/i] an extraction shooter.  It does nothing to shake up the already horrible genre.  Go in, loot, extract in 5 minutes.  Repeat until you run into an actual fire fight, die, repeat step 1.  What else is there to do other than loot trash?  95% of the gameplay is looting trash.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Title: Arc Raiders: A Post-Apocalyptic Identity Crisis – Not What I Expected\r\n\r\nHaving spent some time with Arc Raiders, I regret to say it largely missed the mark for me. While it boasts a polished facade, the experience underneath feels shallow and ultimately unfulfilling.\r\n\r\nFrom a purely mechanical standpoint, the gameplay feels competent and modern. Character controls are standard for a third-person shooter, and visually, everything is well-executed. However, much of the core gameplay loop feels derivative, borrowing heavily from established formulas without adding anything truly unique or compelling.\r\n\r\nMy biggest issue, and where the game fundamentally fails for me, is its complete lack of immersion into the post-apocalyptic world it claims to inhabit. Despite the serious tone the game initially presented, from the very beginning, Arc Raiders constantly felt more like a vibrant, arcadey experience akin to Fortnite.\r\n\r\nThis isn't necessarily a problem for all games, but Arc Raiders marketed itself as something deep and serious, promising a gritty struggle for survival. Instead, it delivers a very surface-level engagement. This disparity between expectation and reality feels like a significant misrepresentation, one that I believe will disappoint a large segment of its potential player base.\r\n\r\nOn a more positive note, the game's graphics are quite good, and from a technical perspective, I encountered no significant issues with performance or stability.\r\n\r\nUltimately, Arc Raiders seems best suited for players who enjoy engaging with gameplay mechanics without needing a deep narrative or world to get lost in. If you approach games like competitive titles, where the surrounding atmosphere and story are secondary to pure action, you might find some enjoyment here. However, if you're looking for an immersive post-apocalyptic journey or a game that lives up to its initial serious promises, Arc Raiders is likely to leave you wanting more.\r\n\r\nNot Recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dull, boring and absolutely not worth the money. Huge pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they payed VAs what was essentially a licensing fee to use their voices for Generative AI. While the VAs were still payed at one point, the end goal is still not paying them for ALL their work. This is a scummy practice and shouldnt be normalized. I'd reccomend not supporting this game or its Dev team until they get proper VA work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There were literally fly hacking/teleport hacking/wall hackers in a WEEKEND SERVER PLAYTEST.\n\nThis game got 0 hopes of making it past a year with more then 5k active playerbase.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As with any game that forces you to play with randos, this game just spirals down to you getting killed by some random a-hole, losing all  your stuff.  People will camp the extraction points just to ruin your day right before you finish the mission.\r\n\r\nWith no option just to play only PvE, this game simply isn't enjoyable.  It's a shame; I probably would have bought it if I could just enjoy the game with my friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed this experience. I was really bad at it but nevertheless it is something new and interesting.\n\nThe balancing done right. From free basic supplies to have any chance of acquiring something on the surface, to getting some of the resources even after failed Expedition is done right.\n\nThe gameplay is good, graphics, optimization, server connectivity I have no issues whatsoever.\n\nI would see myself playing something like this if it wasn't only for a price.\nI have to work three 12 hours shifts to afford this game which is too much.I would be sad if I wasn't accustomed to my situation in life to what I can have and what I want.\n\nConclusion: 8/10 (Not accounting for the price)\nAccounting for a price 0/10 can't afford full game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're a fan of extraction shooters and PUBG this might be for you but not many mechanics are new in this game except for PvE scenarios. The gameplay is fluid ofc and less complicated than other extraction shooters. But sometimes it gets confusing and annoying. Would've been way better if they've added more compelling story quests rather than fetch quests.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a fan of games where you have loot so you can craft so you can loot so you can craft. I would like it if it were more like hunt showdown with some objective instead of just a bunch of looting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It has amazing potential but i played 3 games didnt see a single person and was being chases by a flying robot the whole time it looks good feels amazing but needs to gameplay rework or more pvp encounters",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun at the price of free. However, if you want me to pay money for it, tone down on the lame and gay shit.\n\nMaybe I'll pick it up if it goes on sale for 25% off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is everyone losing their mind over this game, it's so boring, you very rarely meet other players, there are barely any AI enemies, little to no loot anywhere, what's the point?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played the tutorial during the weekend playtest but stopped there. After looting one of the first structures I knew opening a door would trigger some sort of lesson (probably a cutscene), so I left it for last, and I was proven right. But what happened was a scripted ambush, where after I gave a sigh of discappointment that I was proven right I had to wait through five seconds of getting shot at while my character stupidly continued failing to pry open the door. I couldn't figure out how to cancel, if you even can, and I of course died. \r\n\r\nBUT IT DIDN'T END THERE. My assailants rifled through my pockets as I bled out, not only stealing all the stuff I just grabbed (which, yeah, I get it, it's a pvp extraction looter), but taking their sweet time about it. This scene was wholly unnecessary, I know what game I selected, and it felt like the developers were rubbing my face in it by dragging it out, \r\n\r\nBUT THEY STILL WEREN'T DONE. Now the game just *revived me on the spot*, as if to say \"get up so I can kill you again!\" and I had to scramble to find (or craft? I can't remember) bandages again. If I can craft or find them so easily, why did the scavengers act like they found gold? F!@# that, everything together felt too disrespectful; I finished the tutorial out of spite, but I had no will left to play more after reaching the elevator so I dropped the game. \r\n\r\nBattlefield One's onboarding was better, where they killed you like 7 times but it felt fair, like you had agency as a player even though you were guaranteed to die by an artillery barrage or something if you survived too long.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"I strongly feel that this is an insult to life itself\" -Hayao Miyazaki",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "suffering.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This has got the be one of the most boring games I've ever played.\r\nYou just go around the huge empty map looting garbage, then your backpack fills after like doing this 4 times, a drone sees you, empty all the ammo into it, run around few more minutes like an idiot looking for a little bit of ammo, oh there are \"quests\" to loot specific kind of shit, you do it then realize theres nothing more to do, go for extraction point, hoping some nolife is not camping it, call it in, crouch behind a box waiting, other moron goes up to it, take them down with the 3 bullets you found earlier, go in press button, extract, game over. Repeat this over and over thats the game. After you do this a few times you can just afford a key with you can get out instantly without having to even wait for a possible fight around the extraction. Whole gaming is run around, collect some useless shit, avoid enemies as much as possible and get out. Even if you wanted to get into fights, the map is so huge you'll rarely ever run into more than one enemy, I've yet to die to any of them and this type of game is supposed to be filled with sweats so I suspect the game may be filled with bots the devs are not being honest about.\r\n\r\nAt least it looks okay and runs okay, extra point for Linux support, minus point for forcing Secure Boot on Windows users, they'll probably disable Linux when the first cheater gets reported because thats about as far as the brain of modern AAA multiplayer devs goes.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I miss the original sales pitch for the game. A PvE style extraction shooter, where you cooperate with friends and other players to complete objectives and defeat bosses. the current game decided to lean too much into a tarkov style PvP extraction shooter, creating a landscape for the same type of toxic community to surround the game that surrounds tarkov. A game that i was genuinely excited for to play with my friends is now ruined by the \"Meta\" and players sweating rather than having fun",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "Lots of hype, and honestly the graphics are really nice, but the gameplay itself is a bit boring. I think it could have potential but its possible that I'm just not enjoying looting games anymore. I think this theme and the potential lore behind it could have been better used in a singleplayer story-driven game. Overall I think it's okay, and many will have a lot of fun with it, but I don't think its for me.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "Allowing players to spawn fresh into an ongoing raid is a terrible decision. Fighting through 3 groups of extract campers just to get jumped by a fresh group that has bullets and shields is not it. Next",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Been playing since the technical test however I cannot in this state recommend the game.\r\nMy thoughts are as follows...\r\n\r\nThe PVP is good and the controls feel fluent and responsive however every fight I get into is always ruined by the \"ark robots\". I understand that the ark robots are meant to deter players from making noise I get that but...\r\n\r\nThe robots only target one player and don't de-aggro or swap targets even while being shot at by a different player. To many times I would end up in a fight which i'm enjoying just to have 3 robots waiting outside my room only aggressive towards my team and not the team outside with them.\r\n\r\nThe looting feels worthless whats the point in scrapping items if a chicken can SH#T out all the parts I need?. I understand you'll be able to upgrade your workbenches and craft better guns and equipment but in the technical test and this server slam I haven't seen enough in the 11 hours of player time to know if I like that system.\r\n\r\nFurthermore on the looting, so called high-tier loot areas have never seemed to contain any loot i would find that useful and never have I been amazed by anything I have found. Personally I don't believe the risk is worth the reward and that is if you even get there first as some spawns effectively place you right below the main loot ares, which seems unfair if you spawn miles away.\r\n\r\nIt is also way to easy to leave the elevators make minimal noise and don't really attract robot attention unlike in the technical test meaning that players are almost encouraged to leave even if they have only gained minimal loot. There is nothing to encourage people to stay in a match longer like bigger robots spawning with better loot, basically nothing to keep people in the match meaning that multiple times I've played matches and simply seen and heard nobody\r\n\r\nUltimately in the games current state £30 is simply to much to ask for the game in this state and I encourage people not to pre-order or buy this game upon launch",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Shroud streams it 24/7 = sweaty no fun losers playin, stay away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Today I saw a friend on Steam playing this game. So I thought, why not try it myself.\r\n\r\nThe introduction is a bit short, it explains the basic concept of the game and the world where it takes place. I found it rather interesting as a concept, the gameplay reminds of games like Escape from Tarkov and Rust. \r\n\r\nThe first raid I tried to keep it simple, follow the instructions from the quest I've been giving. Not too complicated, though quickly I realized, that the game is not going to go all soft on new players. That I can appreciate, challenging from the start and giving you freedom of choice while also facing the consequences of your own actions. Having played a couple raids solo, there were many ups and downs. While the ups are there for sure, the downs is what got me to write this review. To name a few things:\r\n\r\n- AI pathfinding:\r\nThe drones as enemies are a missed opportunity. The ones with automatic fire are relatively easy to defeat, but the others I encountered are just annoying and in numbers, especially when you play solo, easily swarm you. Their pathfinding felt as if everytime I wanted to go someplace else, they just B-line/fly directly towards me. It felt like the NPC enemies in Rust, a bit better and giving you the time to fight them tactically.\r\n\r\n- Goal of the game:\r\nI lost all my stuff in what could have been a good raid. I understand the concept of losing your items when you get downed/surrender. If that is your thing, than this is a game you probably like or even going to love to play again and again. But for me, it is a game where I can not get into, just too time consuming for what it is worth. If this game were to be published seven to ten years ago, I would have been playing it a lot more.\r\n\r\n- Performance:\r\nThe game performed well enough, it feels similar to the previously published game from Embark, The Finals. Some tweaking needs to be done, to finetune and make the impact of lower settings viable. Lowering did almost nothing to lower my GPU and CPU usage, so I advice Embark to look into that. I have faith in that.\r\n\r\nTo come to a conclusion:\r\n- Try it for yourself during this playtest weekend.\r\n- If you like it. good for you, enjoy it to the fullest.\r\n- As of now, I find this game too boring to enjoy.\r\n\r\nMaybe in the future, I will give it a go again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I’ll sum up the game very simply: PvP players will get bored quickly, and PvE players won’t buy it.\n\nPvP and PvE just don’t mix they’re not the same kind of players.\nOn one side, you’ve got toxic players who jump from one trendy game to another. On the other, PvE players who just want to chill and enjoy playing (which is, after all, the main purpose of a video game).\n\nWhat’s really disappointing is that the game was originally planned to be a PvE experience, but they turned it into a PvPvE one the worst decision they could’ve made. The game would have done so much better if they had stuck to the original full-PvE concept. There are so few quality PvE games like this, and players would have stayed loyal for a long time.\n\nBut the simple fact of adding PvP already killed it. PvP players will have fun for maybe two or three months, then move on to the next thing. To save the game, they should’ve kept the original idea — but it’s already too late. Bad decision.\n\nI’ve stopped buying any multiplayer game that includes PvP I’m done. I just want to play peacefully, cooperate with other players, not deal with selfish, angry people who fill every multiplayer game with toxicity.\n\nIt’s a shame, because otherwise the world, the environments, and the gameplay all seem really promising and enjoyable I genuinely liked that part. Unfortunately, in the long run, the attitude of certain players will ruin the experience for everyone else. For €40, that’s an expensive disappointment.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Arc Raiders is a really good extraction shooter, but it's still an extraction shooter. There's a solid PvE looter shooter here, but the PvP aspect honestly ruins it completely. They had the right idea, then wasted it by chasing trends. Would you like to lose hours of progress due to someone camping the extraction point? Then Arc Raiders is for you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, Not a good or fun Extraction shooter, PVP is mid to subpar, not veryenganging and serves no purpose, You do not gain anything for killing another player, the loot pool is all low end, even if it was high end it still isnt worth killing people over, the AI is boring and lackluster at best, just strong unkillable machines you avoid through rough not great or well implimented stealth.\r\n\r\nIts a shame and a sham that the FREE TO PLAY COOP 3rd Person Shooter doesnt exist and instead we have PVPVE boring Looter shooter extraction game, that has a heavy pull away from coop as coop does not make the game better it only made the whole experince worse with tighter loot, and tighter times in the zone. Coop in this game is really only good for Squad fights which is horrid combat, or vs ai bots at which point your getting best loot drops farming ai..........",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Finished the tutorial, got dropped into the first area with nothing but the basic gun, got shot and killed within the first 30 steps I took out of my pod. This game is for sociopaths. No thanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not a bad game. Looks good and can be entertaining with good teammates. But with limited money and time, I can't see myself justifying buying the game because your time is completely wasted when you die.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not for me. \n\nThe extraction shooter genre in general is a flawed game design. It lures in PvE players and then blindsides them with PvP sweat lords. It requires you to invest time and effort to collect resources in order to upgrade your gear and then takes everything away the moment you loose an encounter. Couple that with hoards of losers who camp extraction sites ambushing players, shit talkers on the prox chat who mock you while they loot your corpse, and super aggressive AI bots that swarm you with no way of escaping, its a perfect storm of time sink, frustration, and table flips. \n\nOverall not fun. \n\nSpending 20 minutes running around opening drawers and gathering junk just to loose it all after someone sucker punches you is not my idea of a good time. Equally, sitting around for 20 minutes, waiting for someone to gank is tedious, boring, and a failed test of character. Shame on you all who enjoy this gameplay loop and pissing other people off. There's a special place in hell for you. I'll come visit and laugh at you while you're getting your ass packed with hot coals. You certainly deserve it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game has alot of potential to be alot more fun i dont think the PvE should be so difficult this game is going to cater to the majority of its player being here for th PvP and with the PvE being so tough it takes away from the fun of the PvP aspect the mobs in this game are so deadly its ridiculous they eat damage like crazy and dish it out even harder this game is way to difficult all on its own without the addition of other players i think if they are gonna have NPC enemies in the game they need to tone down how tough they are to take on other wise they wont have many players for very long the game is so hard and the fun dosent really start until you can somehow manage to get high tier gear and its a grind to even get that far due to constantly dying to terminator level robots while trying to fight a team or 2 of other players just to lose all the purple gear you just found or all the mats you needed to upgrade when its fun it is really fun but those moments come far and few between i would really love to see some changes made to the PvE to keep people from being afraid to even leave a building because they dont wanna get melted by robots",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is [i]JUST[/i] an extraction shooter.  It does nothing to shake up the already horrible genre.  Go in, loot, extract in 5 minutes.  Repeat until you run into an actual fire fight, die, repeat step 1.  What else is there to do other than loot trash?  95% of the gameplay is looting trash.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Title: Arc Raiders: A Post-Apocalyptic Identity Crisis – Not What I Expected\r\n\r\nHaving spent some time with Arc Raiders, I regret to say it largely missed the mark for me. While it boasts a polished facade, the experience underneath feels shallow and ultimately unfulfilling.\r\n\r\nFrom a purely mechanical standpoint, the gameplay feels competent and modern. Character controls are standard for a third-person shooter, and visually, everything is well-executed. However, much of the core gameplay loop feels derivative, borrowing heavily from established formulas without adding anything truly unique or compelling.\r\n\r\nMy biggest issue, and where the game fundamentally fails for me, is its complete lack of immersion into the post-apocalyptic world it claims to inhabit. Despite the serious tone the game initially presented, from the very beginning, Arc Raiders constantly felt more like a vibrant, arcadey experience akin to Fortnite.\r\n\r\nThis isn't necessarily a problem for all games, but Arc Raiders marketed itself as something deep and serious, promising a gritty struggle for survival. Instead, it delivers a very surface-level engagement. This disparity between expectation and reality feels like a significant misrepresentation, one that I believe will disappoint a large segment of its potential player base.\r\n\r\nOn a more positive note, the game's graphics are quite good, and from a technical perspective, I encountered no significant issues with performance or stability.\r\n\r\nUltimately, Arc Raiders seems best suited for players who enjoy engaging with gameplay mechanics without needing a deep narrative or world to get lost in. If you approach games like competitive titles, where the surrounding atmosphere and story are secondary to pure action, you might find some enjoyment here. However, if you're looking for an immersive post-apocalyptic journey or a game that lives up to its initial serious promises, Arc Raiders is likely to leave you wanting more.\r\n\r\nNot Recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dull, boring and absolutely not worth the money. Huge pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they payed VAs what was essentially a licensing fee to use their voices for Generative AI. While the VAs were still payed at one point, the end goal is still not paying them for ALL their work. This is a scummy practice and shouldnt be normalized. I'd reccomend not supporting this game or its Dev team until they get proper VA work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There were literally fly hacking/teleport hacking/wall hackers in a WEEKEND SERVER PLAYTEST.\n\nThis game got 0 hopes of making it past a year with more then 5k active playerbase.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As with any game that forces you to play with randos, this game just spirals down to you getting killed by some random a-hole, losing all  your stuff.  People will camp the extraction points just to ruin your day right before you finish the mission.\r\n\r\nWith no option just to play only PvE, this game simply isn't enjoyable.  It's a shame; I probably would have bought it if I could just enjoy the game with my friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed this experience. I was really bad at it but nevertheless it is something new and interesting.\n\nThe balancing done right. From free basic supplies to have any chance of acquiring something on the surface, to getting some of the resources even after failed Expedition is done right.\n\nThe gameplay is good, graphics, optimization, server connectivity I have no issues whatsoever.\n\nI would see myself playing something like this if it wasn't only for a price.\nI have to work three 12 hours shifts to afford this game which is too much.I would be sad if I wasn't accustomed to my situation in life to what I can have and what I want.\n\nConclusion: 8/10 (Not accounting for the price)\nAccounting for a price 0/10 can't afford full game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're a fan of extraction shooters and PUBG this might be for you but not many mechanics are new in this game except for PvE scenarios. The gameplay is fluid ofc and less complicated than other extraction shooters. But sometimes it gets confusing and annoying. Would've been way better if they've added more compelling story quests rather than fetch quests.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a fan of games where you have loot so you can craft so you can loot so you can craft. I would like it if it were more like hunt showdown with some objective instead of just a bunch of looting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It has amazing potential but i played 3 games didnt see a single person and was being chases by a flying robot the whole time it looks good feels amazing but needs to gameplay rework or more pvp encounters",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun at the price of free. However, if you want me to pay money for it, tone down on the lame and gay shit.\n\nMaybe I'll pick it up if it goes on sale for 25% off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is everyone losing their mind over this game, it's so boring, you very rarely meet other players, there are barely any AI enemies, little to no loot anywhere, what's the point?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played the tutorial during the weekend playtest but stopped there. After looting one of the first structures I knew opening a door would trigger some sort of lesson (probably a cutscene), so I left it for last, and I was proven right. But what happened was a scripted ambush, where after I gave a sigh of discappointment that I was proven right I had to wait through five seconds of getting shot at while my character stupidly continued failing to pry open the door. I couldn't figure out how to cancel, if you even can, and I of course died. \r\n\r\nBUT IT DIDN'T END THERE. My assailants rifled through my pockets as I bled out, not only stealing all the stuff I just grabbed (which, yeah, I get it, it's a pvp extraction looter), but taking their sweet time about it. This scene was wholly unnecessary, I know what game I selected, and it felt like the developers were rubbing my face in it by dragging it out, \r\n\r\nBUT THEY STILL WEREN'T DONE. Now the game just *revived me on the spot*, as if to say \"get up so I can kill you again!\" and I had to scramble to find (or craft? I can't remember) bandages again. If I can craft or find them so easily, why did the scavengers act like they found gold? F!@# that, everything together felt too disrespectful; I finished the tutorial out of spite, but I had no will left to play more after reaching the elevator so I dropped the game. \r\n\r\nBattlefield One's onboarding was better, where they killed you like 7 times but it felt fair, like you had agency as a player even though you were guaranteed to die by an artillery barrage or something if you survived too long.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"I strongly feel that this is an insult to life itself\" -Hayao Miyazaki",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "suffering.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This has got the be one of the most boring games I've ever played.\r\nYou just go around the huge empty map looting garbage, then your backpack fills after like doing this 4 times, a drone sees you, empty all the ammo into it, run around few more minutes like an idiot looking for a little bit of ammo, oh there are \"quests\" to loot specific kind of shit, you do it then realize theres nothing more to do, go for extraction point, hoping some nolife is not camping it, call it in, crouch behind a box waiting, other moron goes up to it, take them down with the 3 bullets you found earlier, go in press button, extract, game over. Repeat this over and over thats the game. After you do this a few times you can just afford a key with you can get out instantly without having to even wait for a possible fight around the extraction. Whole gaming is run around, collect some useless shit, avoid enemies as much as possible and get out. Even if you wanted to get into fights, the map is so huge you'll rarely ever run into more than one enemy, I've yet to die to any of them and this type of game is supposed to be filled with sweats so I suspect the game may be filled with bots the devs are not being honest about.\r\n\r\nAt least it looks okay and runs okay, extra point for Linux support, minus point for forcing Secure Boot on Windows users, they'll probably disable Linux when the first cheater gets reported because thats about as far as the brain of modern AAA multiplayer devs goes.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I miss the original sales pitch for the game. A PvE style extraction shooter, where you cooperate with friends and other players to complete objectives and defeat bosses. the current game decided to lean too much into a tarkov style PvP extraction shooter, creating a landscape for the same type of toxic community to surround the game that surrounds tarkov. A game that i was genuinely excited for to play with my friends is now ruined by the \"Meta\" and players sweating rather than having fun",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "Lots of hype, and honestly the graphics are really nice, but the gameplay itself is a bit boring. I think it could have potential but its possible that I'm just not enjoying looting games anymore. I think this theme and the potential lore behind it could have been better used in a singleplayer story-driven game. Overall I think it's okay, and many will have a lot of fun with it, but I don't think its for me.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "Allowing players to spawn fresh into an ongoing raid is a terrible decision. Fighting through 3 groups of extract campers just to get jumped by a fresh group that has bullets and shields is not it. Next",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Been playing since the technical test however I cannot in this state recommend the game.\r\nMy thoughts are as follows...\r\n\r\nThe PVP is good and the controls feel fluent and responsive however every fight I get into is always ruined by the \"ark robots\". I understand that the ark robots are meant to deter players from making noise I get that but...\r\n\r\nThe robots only target one player and don't de-aggro or swap targets even while being shot at by a different player. To many times I would end up in a fight which i'm enjoying just to have 3 robots waiting outside my room only aggressive towards my team and not the team outside with them.\r\n\r\nThe looting feels worthless whats the point in scrapping items if a chicken can SH#T out all the parts I need?. I understand you'll be able to upgrade your workbenches and craft better guns and equipment but in the technical test and this server slam I haven't seen enough in the 11 hours of player time to know if I like that system.\r\n\r\nFurthermore on the looting, so called high-tier loot areas have never seemed to contain any loot i would find that useful and never have I been amazed by anything I have found. Personally I don't believe the risk is worth the reward and that is if you even get there first as some spawns effectively place you right below the main loot ares, which seems unfair if you spawn miles away.\r\n\r\nIt is also way to easy to leave the elevators make minimal noise and don't really attract robot attention unlike in the technical test meaning that players are almost encouraged to leave even if they have only gained minimal loot. There is nothing to encourage people to stay in a match longer like bigger robots spawning with better loot, basically nothing to keep people in the match meaning that multiple times I've played matches and simply seen and heard nobody\r\n\r\nUltimately in the games current state £30 is simply to much to ask for the game in this state and I encourage people not to pre-order or buy this game upon launch",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Shroud streams it 24/7 = sweaty no fun losers playin, stay away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Today I saw a friend on Steam playing this game. So I thought, why not try it myself.\r\n\r\nThe introduction is a bit short, it explains the basic concept of the game and the world where it takes place. I found it rather interesting as a concept, the gameplay reminds of games like Escape from Tarkov and Rust. \r\n\r\nThe first raid I tried to keep it simple, follow the instructions from the quest I've been giving. Not too complicated, though quickly I realized, that the game is not going to go all soft on new players. That I can appreciate, challenging from the start and giving you freedom of choice while also facing the consequences of your own actions. Having played a couple raids solo, there were many ups and downs. While the ups are there for sure, the downs is what got me to write this review. To name a few things:\r\n\r\n- AI pathfinding:\r\nThe drones as enemies are a missed opportunity. The ones with automatic fire are relatively easy to defeat, but the others I encountered are just annoying and in numbers, especially when you play solo, easily swarm you. Their pathfinding felt as if everytime I wanted to go someplace else, they just B-line/fly directly towards me. It felt like the NPC enemies in Rust, a bit better and giving you the time to fight them tactically.\r\n\r\n- Goal of the game:\r\nI lost all my stuff in what could have been a good raid. I understand the concept of losing your items when you get downed/surrender. If that is your thing, than this is a game you probably like or even going to love to play again and again. But for me, it is a game where I can not get into, just too time consuming for what it is worth. If this game were to be published seven to ten years ago, I would have been playing it a lot more.\r\n\r\n- Performance:\r\nThe game performed well enough, it feels similar to the previously published game from Embark, The Finals. Some tweaking needs to be done, to finetune and make the impact of lower settings viable. Lowering did almost nothing to lower my GPU and CPU usage, so I advice Embark to look into that. I have faith in that.\r\n\r\nTo come to a conclusion:\r\n- Try it for yourself during this playtest weekend.\r\n- If you like it. good for you, enjoy it to the fullest.\r\n- As of now, I find this game too boring to enjoy.\r\n\r\nMaybe in the future, I will give it a go again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I’ll sum up the game very simply: PvP players will get bored quickly, and PvE players won’t buy it.\n\nPvP and PvE just don’t mix they’re not the same kind of players.\nOn one side, you’ve got toxic players who jump from one trendy game to another. On the other, PvE players who just want to chill and enjoy playing (which is, after all, the main purpose of a video game).\n\nWhat’s really disappointing is that the game was originally planned to be a PvE experience, but they turned it into a PvPvE one the worst decision they could’ve made. The game would have done so much better if they had stuck to the original full-PvE concept. There are so few quality PvE games like this, and players would have stayed loyal for a long time.\n\nBut the simple fact of adding PvP already killed it. PvP players will have fun for maybe two or three months, then move on to the next thing. To save the game, they should’ve kept the original idea — but it’s already too late. Bad decision.\n\nI’ve stopped buying any multiplayer game that includes PvP I’m done. I just want to play peacefully, cooperate with other players, not deal with selfish, angry people who fill every multiplayer game with toxicity.\n\nIt’s a shame, because otherwise the world, the environments, and the gameplay all seem really promising and enjoyable I genuinely liked that part. Unfortunately, in the long run, the attitude of certain players will ruin the experience for everyone else. For €40, that’s an expensive disappointment.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Arc Raiders is a really good extraction shooter, but it's still an extraction shooter. There's a solid PvE looter shooter here, but the PvP aspect honestly ruins it completely. They had the right idea, then wasted it by chasing trends. Would you like to lose hours of progress due to someone camping the extraction point? Then Arc Raiders is for you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, Not a good or fun Extraction shooter, PVP is mid to subpar, not veryenganging and serves no purpose, You do not gain anything for killing another player, the loot pool is all low end, even if it was high end it still isnt worth killing people over, the AI is boring and lackluster at best, just strong unkillable machines you avoid through rough not great or well implimented stealth.\r\n\r\nIts a shame and a sham that the FREE TO PLAY COOP 3rd Person Shooter doesnt exist and instead we have PVPVE boring Looter shooter extraction game, that has a heavy pull away from coop as coop does not make the game better it only made the whole experince worse with tighter loot, and tighter times in the zone. Coop in this game is really only good for Squad fights which is horrid combat, or vs ai bots at which point your getting best loot drops farming ai..........",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Finished the tutorial, got dropped into the first area with nothing but the basic gun, got shot and killed within the first 30 steps I took out of my pod. This game is for sociopaths. No thanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not a bad game. Looks good and can be entertaining with good teammates. But with limited money and time, I can't see myself justifying buying the game because your time is completely wasted when you die.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not for me. \n\nThe extraction shooter genre in general is a flawed game design. It lures in PvE players and then blindsides them with PvP sweat lords. It requires you to invest time and effort to collect resources in order to upgrade your gear and then takes everything away the moment you loose an encounter. Couple that with hoards of losers who camp extraction sites ambushing players, shit talkers on the prox chat who mock you while they loot your corpse, and super aggressive AI bots that swarm you with no way of escaping, its a perfect storm of time sink, frustration, and table flips. \n\nOverall not fun. \n\nSpending 20 minutes running around opening drawers and gathering junk just to loose it all after someone sucker punches you is not my idea of a good time. Equally, sitting around for 20 minutes, waiting for someone to gank is tedious, boring, and a failed test of character. Shame on you all who enjoy this gameplay loop and pissing other people off. There's a special place in hell for you. I'll come visit and laugh at you while you're getting your ass packed with hot coals. You certainly deserve it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game has alot of potential to be alot more fun i dont think the PvE should be so difficult this game is going to cater to the majority of its player being here for th PvP and with the PvE being so tough it takes away from the fun of the PvP aspect the mobs in this game are so deadly its ridiculous they eat damage like crazy and dish it out even harder this game is way to difficult all on its own without the addition of other players i think if they are gonna have NPC enemies in the game they need to tone down how tough they are to take on other wise they wont have many players for very long the game is so hard and the fun dosent really start until you can somehow manage to get high tier gear and its a grind to even get that far due to constantly dying to terminator level robots while trying to fight a team or 2 of other players just to lose all the purple gear you just found or all the mats you needed to upgrade when its fun it is really fun but those moments come far and few between i would really love to see some changes made to the PvE to keep people from being afraid to even leave a building because they dont wanna get melted by robots",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is [i]JUST[/i] an extraction shooter.  It does nothing to shake up the already horrible genre.  Go in, loot, extract in 5 minutes.  Repeat until you run into an actual fire fight, die, repeat step 1.  What else is there to do other than loot trash?  95% of the gameplay is looting trash.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Title: Arc Raiders: A Post-Apocalyptic Identity Crisis – Not What I Expected\r\n\r\nHaving spent some time with Arc Raiders, I regret to say it largely missed the mark for me. While it boasts a polished facade, the experience underneath feels shallow and ultimately unfulfilling.\r\n\r\nFrom a purely mechanical standpoint, the gameplay feels competent and modern. Character controls are standard for a third-person shooter, and visually, everything is well-executed. However, much of the core gameplay loop feels derivative, borrowing heavily from established formulas without adding anything truly unique or compelling.\r\n\r\nMy biggest issue, and where the game fundamentally fails for me, is its complete lack of immersion into the post-apocalyptic world it claims to inhabit. Despite the serious tone the game initially presented, from the very beginning, Arc Raiders constantly felt more like a vibrant, arcadey experience akin to Fortnite.\r\n\r\nThis isn't necessarily a problem for all games, but Arc Raiders marketed itself as something deep and serious, promising a gritty struggle for survival. Instead, it delivers a very surface-level engagement. This disparity between expectation and reality feels like a significant misrepresentation, one that I believe will disappoint a large segment of its potential player base.\r\n\r\nOn a more positive note, the game's graphics are quite good, and from a technical perspective, I encountered no significant issues with performance or stability.\r\n\r\nUltimately, Arc Raiders seems best suited for players who enjoy engaging with gameplay mechanics without needing a deep narrative or world to get lost in. If you approach games like competitive titles, where the surrounding atmosphere and story are secondary to pure action, you might find some enjoyment here. However, if you're looking for an immersive post-apocalyptic journey or a game that lives up to its initial serious promises, Arc Raiders is likely to leave you wanting more.\r\n\r\nNot Recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dull, boring and absolutely not worth the money. Huge pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they payed VAs what was essentially a licensing fee to use their voices for Generative AI. While the VAs were still payed at one point, the end goal is still not paying them for ALL their work. This is a scummy practice and shouldnt be normalized. I'd reccomend not supporting this game or its Dev team until they get proper VA work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There were literally fly hacking/teleport hacking/wall hackers in a WEEKEND SERVER PLAYTEST.\n\nThis game got 0 hopes of making it past a year with more then 5k active playerbase.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As with any game that forces you to play with randos, this game just spirals down to you getting killed by some random a-hole, losing all  your stuff.  People will camp the extraction points just to ruin your day right before you finish the mission.\r\n\r\nWith no option just to play only PvE, this game simply isn't enjoyable.  It's a shame; I probably would have bought it if I could just enjoy the game with my friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed this experience. I was really bad at it but nevertheless it is something new and interesting.\n\nThe balancing done right. From free basic supplies to have any chance of acquiring something on the surface, to getting some of the resources even after failed Expedition is done right.\n\nThe gameplay is good, graphics, optimization, server connectivity I have no issues whatsoever.\n\nI would see myself playing something like this if it wasn't only for a price.\nI have to work three 12 hours shifts to afford this game which is too much.I would be sad if I wasn't accustomed to my situation in life to what I can have and what I want.\n\nConclusion: 8/10 (Not accounting for the price)\nAccounting for a price 0/10 can't afford full game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're a fan of extraction shooters and PUBG this might be for you but not many mechanics are new in this game except for PvE scenarios. The gameplay is fluid ofc and less complicated than other extraction shooters. But sometimes it gets confusing and annoying. Would've been way better if they've added more compelling story quests rather than fetch quests.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a fan of games where you have loot so you can craft so you can loot so you can craft. I would like it if it were more like hunt showdown with some objective instead of just a bunch of looting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It has amazing potential but i played 3 games didnt see a single person and was being chases by a flying robot the whole time it looks good feels amazing but needs to gameplay rework or more pvp encounters",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun at the price of free. However, if you want me to pay money for it, tone down on the lame and gay shit.\n\nMaybe I'll pick it up if it goes on sale for 25% off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is everyone losing their mind over this game, it's so boring, you very rarely meet other players, there are barely any AI enemies, little to no loot anywhere, what's the point?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played the tutorial during the weekend playtest but stopped there. After looting one of the first structures I knew opening a door would trigger some sort of lesson (probably a cutscene), so I left it for last, and I was proven right. But what happened was a scripted ambush, where after I gave a sigh of discappointment that I was proven right I had to wait through five seconds of getting shot at while my character stupidly continued failing to pry open the door. I couldn't figure out how to cancel, if you even can, and I of course died. \r\n\r\nBUT IT DIDN'T END THERE. My assailants rifled through my pockets as I bled out, not only stealing all the stuff I just grabbed (which, yeah, I get it, it's a pvp extraction looter), but taking their sweet time about it. This scene was wholly unnecessary, I know what game I selected, and it felt like the developers were rubbing my face in it by dragging it out, \r\n\r\nBUT THEY STILL WEREN'T DONE. Now the game just *revived me on the spot*, as if to say \"get up so I can kill you again!\" and I had to scramble to find (or craft? I can't remember) bandages again. If I can craft or find them so easily, why did the scavengers act like they found gold? F!@# that, everything together felt too disrespectful; I finished the tutorial out of spite, but I had no will left to play more after reaching the elevator so I dropped the game. \r\n\r\nBattlefield One's onboarding was better, where they killed you like 7 times but it felt fair, like you had agency as a player even though you were guaranteed to die by an artillery barrage or something if you survived too long.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"I strongly feel that this is an insult to life itself\" -Hayao Miyazaki",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "suffering.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This has got the be one of the most boring games I've ever played.\r\nYou just go around the huge empty map looting garbage, then your backpack fills after like doing this 4 times, a drone sees you, empty all the ammo into it, run around few more minutes like an idiot looking for a little bit of ammo, oh there are \"quests\" to loot specific kind of shit, you do it then realize theres nothing more to do, go for extraction point, hoping some nolife is not camping it, call it in, crouch behind a box waiting, other moron goes up to it, take them down with the 3 bullets you found earlier, go in press button, extract, game over. Repeat this over and over thats the game. After you do this a few times you can just afford a key with you can get out instantly without having to even wait for a possible fight around the extraction. Whole gaming is run around, collect some useless shit, avoid enemies as much as possible and get out. Even if you wanted to get into fights, the map is so huge you'll rarely ever run into more than one enemy, I've yet to die to any of them and this type of game is supposed to be filled with sweats so I suspect the game may be filled with bots the devs are not being honest about.\r\n\r\nAt least it looks okay and runs okay, extra point for Linux support, minus point for forcing Secure Boot on Windows users, they'll probably disable Linux when the first cheater gets reported because thats about as far as the brain of modern AAA multiplayer devs goes.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I miss the original sales pitch for the game. A PvE style extraction shooter, where you cooperate with friends and other players to complete objectives and defeat bosses. the current game decided to lean too much into a tarkov style PvP extraction shooter, creating a landscape for the same type of toxic community to surround the game that surrounds tarkov. A game that i was genuinely excited for to play with my friends is now ruined by the \"Meta\" and players sweating rather than having fun",
      "voted_up": false,
      "votes_helpful": 82
    }
  ]
}