{
  "positive": [
    {
      "review": "Pro's and Cons\n\nPros: It's fun to play, pretty, and the open world dungeons are really neat. The enemy variety in game is great. Bosses and PVE content seem well designed. Loads of stuff to waste time on PVE wise. \n\nEVERYTHING is voiced over. The stories are... largely forgettable - but fun to follow along with nonetheless. World bosses, hidden areas, and a good amount of content, it has a lot going for it. \n\nRecently, they added a \"Path of Ascension\", which get's players pretty yoked (6000GS) by the end of it. This takes a lot of the grind out of the game, which is nice. Makes it fun. \n\nCastle Sieges are fun as hell if you're geared, It's like the entire server vs 1 guild, vs eachother and things get hectic. There really is no other pvp like it. \n\nOkay, so now that I've made the game sound like Emma Watson with D cups, let's get into the fact she doesn't shower, sleeps with people for money, and has a raging case of the clap. \n\nCons: *deep breath* It can feel very buggy at times, Especially some of the jumping/morph/grappling hook things. When you get a few dozen players together, shit just performs poorly. \n\nThis in and of itself would be forgivable - buuuuuut the auction house is a paid feature and this is where the cracks really show up. \n\nThe player trading/Auction house is entirely handled in Lucent - the games premium in game currency. It costs Lucent to list something, and there's not really a way to \"earn\" free Lucent. - meaning you need to spend money, in some amount - to even use it; and as a byproduct, the game is HEAVILY pay to win. \n\nEverything on the Auction house is an in game drop, so it's not as direct as  \"Buy item from shop\". There's an element of scarcity that comes with items being rare and ultra rare drops. And it is a money sink. Some of the weapons on this game cost literal thousands of dollars. \n\nDon't bullshit yourself thinking you can do it all for free - the game is designed to make that more or less impossible. There is a limit to drops you can farm in certain areas, a limit to the amount of drops you can claim in dungeons, a limit to how many things you can do to advance your character for free. \n\nRead: Even if you are an unemployed basement dweller, you can't just grind to get to the top. \n\nSo, all of the above makes PvP a battle of who has the deepest pockets.  Imagine if having a higher spec PC equated to having more skill. It's literally that. Guy who dropped 10k on his character is an un-killable god and you are going to get dumpstered unless you have spent somewhere in the 4 figure range on your account. \n\nWhich is disappointing - as if they made the game LESS pay to win I could see them potentially drawing more players and making more money.\n\nSo all in all - should you play it? \n\n Right now we are in an MMO drought. With New Worlds impending death, I don't know if there is another MMO with an active PvP community. PvE wise I think it's worth a shot just to try something different than WoW and FFXIV. \n\nIf you want to do PvE? Sure. I can recommend it. Just play casually and don't get caught up in the hype and drop money - Amazon may kill this one next. \n\nIf you want to engage in PvP? Eeeehhhhh. If you have deep pockets, go for it.",
      "voted_up": true,
      "votes_helpful": 47
    },
    {
      "review": "yes if you play with friend in a guild. \r\nHELL NO if you play alone. I have honestly never seen a game with a comunity SOOO TOXIC.\r\npeople are soooo bad they cant play or understand a mmo rpg. and prepare yourself to get kick from some group cuz you dont speak fukin spanish. im not exagerating. \r\n\r\nTOXIC TOXIC COMMUNITY.\r\n\r\nYou have be warned",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "one of the best MMORPG games i ever play but sadly after 6 months the developers let this game died.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I like it, but I'm starting to get bored with it and it is turning into a grind.  They upped the character levels, which is good for power but they've also added more gear at Epic II and Epic III, plus \"Legendary\".  That turns the game into an expensive and frustrating ordeal in order to keep up...aka, not fun.      They've also added a home residence that you can decorate, but getting the mats is a huge grind.   Frankly, I don't even bother going to the residence anymore.  Waste of time.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Besides all its flaws with its bugs, the pay to progress aspect and the bad RNG I really enjoy TL. I feel like the devs put a lot of love and effort into this game, even with it being quite buggy, but they listen to the community a lot. Yes, there is some repetitive daily grind, but I feel like this is just a general MMORPG thing. Also, keep in mind this game is one year old. That's not much for an MMORPG. The upcoming content looks really promising and the recently added housing and achievement system are fun  activities for when you just want to chill a bit, decorate, craft or try to get certain achievements.\n\nI wouldn't personally play this as a PvP game, because if you don't have a PvP build besides your PvE build, which is quite expensive in ressources and time, you won't get far. Everytime I try PvP I just get oneshot, so I just don't bother and I don't really feel like I'm missing much. I just wish there was a way to casually participate in the serverwide PvP events like castle siege without having to be in a PvP guild with all maxed out gear.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "i'm enjoying every aspect of the game, pvp, pve, guilds, class builds, exploration, skins, and much more. All for free.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "its pretty cool for an mmorpg, some things could be better but its maybe the best out",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I enjoy the game, its def nice graphics and fun open world stuff and gear progression and a nice storyline and end game content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun 8/10, if you are looking for a free to play MMO game then this is the game you should try and don't listen to those who says its pay to win i mean it's kinda is but you are not forced to play PvP or compete with others. Just give it a try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall this game is a complete golden experience. There is so much content and interesting mechanics and storytelling elements. I've been enjoying it so far.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best MMO I've played. I can get all the premium items without spending a single centavo, I like how the Aution House was structured. Whales and non spenders co-exist mutually.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is hands down the BEST MMO ive ever played. ESO doesnt even come close to how amazing this game is. I've always wanted to get into MMOs but ESO and a few others ruined it for me. I saw the trailer for this game and figured i'd give it a go, its free why not. To my surprise this game is a 10/10. I would pay 70$ for this title.\r\n\r\nMinor Complaints:\r\nThere are a few optimization issues, i have a Ryzen 7 7800x3D and a 3080. I should have no issues running this game at max settings and getting at least 120 FPS. However there are many areas where my FPS drops to 40-50 and its quite annoying.\r\n\r\nThis game allows the use of controllers and thats fantastic! however the UI is a bit hard to use on controller, for example to claim rewards you have to hold Y and then use the D pad to select where you want to go. Hit A and then you have to manually scroll through all of the areas with the D pad to collect what you want, the game should definitely add a cursor for controller in the pause menu/after holding Y.\r\n\r\nThe trailer makes this game look epic, massive fights, large classes of magic, numerous weapons and armor sets, and magic specific to your class (or magic type/symbol). It doesnt seem the game really explains the symbols and different kinds of magic, and so far (level 35) im unable to see what the different classes bring to the table. It all seems the same. On top of that the game needs way more epic fights and richer lore for each area. Starting out you just kinda do random missions and touch stones for the game to be like \"This place used to be cool till a mean wizard casted a naughty spell and now everyone is flowers, and theyre hungry\" whoever wrote that bit took inspiration from their child and is holding onto it for dear life throughout the game. Boss fights are sort of cool but i would like to see more elemental things happening, make the grim reaper summon Draugr and demons, make him summon a shadow beast or something. Make the fights more like Elden-Borne-Souls.\r\n\r\nThere is a battlepass, please remove it. Its stupid. No one likes it. There are also pay for skin/weapons/armor options, please remove that as well. Instead hide legendary skins and loot all over the world and make players search for it. Add a massive underwater side to the map, even underground and in the sky. Easily tons more content and hiding places.\r\n\r\nPositives:\r\nThe game has a sprint option (thank god) and instead of sprinting you turn into a Jaguar, Lion, Bird, skins vary. Each one has its own cool skin and unique speed. Truly a beautiful way of doing it.\r\nArmor sets are very beautiful and the graphics for this game are PERFECT. I would like to see a large increase in saturation/HDR content for the spells, i want the fire to look like its coming through my screen. Still, 10/10\r\n\r\nSummary:\r\nFor a free to play game, this is absolutely the most perfect and (in my opinion) the only good MMO out there. The things listed above are only minor and if all of them are corrected this game would be a AAA game worth 50-70$ per copy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "entertaining and well done, it has a lot of detail and the story is engaging",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Free to play player - 19 hrs in, lvl 34 - i honestly think the games fun so far - not many other players outside though, but still having a blast!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Graphics are great, good story, you can play with different weapons. I really like this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tjis game is noob friendly they give you alot starter shit. pve contents fair but this game is for whales that love pvp.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't see what everyone is complaining about.  Is it repetitive?  Yes.  But it moves perhaps too fast with too little self-input customization.   It's the closest thing to OG Shaiya you'll find mixed 50/50 with Final Fantasy.  A little love, and this could be a game of the decade.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although somewhat new to the game, I am really enjoying this vast MMO.  The character creation and vast different architypes and possibilities makes this game enjoyable.  If I could make one recommendation it would be to fix some of physics as I tend to find getting myself stuck often.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun to play, pretty, and the open world dungeons are really cool. The enemy variety in game is great. Bosses and PVE content seem well designed. Loads of stuff to waste time on PVE wise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the Game does not have a support system. If you have any issues in the game Steam will not help you. There is no way to open a ticket for the game and it sends you to the Amazon ID page, where surprise you still get no help. Steam tells you to go to the T&L page then go to the Amazon ID then they both tell you to go back to steam. They are just one big scam. Steam included. they just take your money but when the game glitches or something breaks and you lose your money they just keep  the funds and tell you they cant help you. then you have to reverse it with your bank and steam will put a penalty on your account. NOT WORTH IT!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing story and questing, PvX feels polished, looks good and there is grand variety of cosmetics too. The only few things i would suggest as a player starting now ... is to increase the Dungs rewards as the catch up items are stronger and the matchmaking needs to be tweeked as its almost imposible to match for Arena and others as new player due to ranks and all.\r\n\r\nAmazing game i would recommend it, there is also more to come to the game i heard.\r\n Its free to play install and play.\r\n Thank you people! GG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very good game to many activity and co,pa and a lot of missins",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fantastic, mechanics, effects, history...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 10 or so hours this seems like a really good, polished mmo, like old-blizz-like polish.\n\n+PluSes+\n-Art style\n-Graphics\n-Sound effects \n-Music is ok too which is rare now\n-Highly customizable and detailed UI\n-dont have to search for mobs to kill, if you want to just grind mindlessly for hours, you can do that, which is huge + for me\n-cool skill animation and again high costomization of your class (you can mix/match your 2 weapon choices and the skills that come from them + passives too)\n\n-Cons-\n-my potato comp\n-cheezy story and characters (who cares?, its a fantasy mmo, not everything has to be in cryptic darksouls style)\n-didn't see much boobeage action but thats... (ok i'v seen some so scratch that)\n-...\n-profit?\n\nI've played GW2 up to 60 on one class and this seems waaay better.\nThe negative reviews come from the fact that peoples requirements has gone so up its insane + zoomers love to hate.\n\nAfter 35hr:\nI'm so blown away by level of detail and overall quality of this game. It's insane it has ratings like it has. People must be blind. It rivals single player games easly, combat is suberb, well thought out progression, game is so beautifull you sometimes just stop to enjoy the vistas. There is freaking sky-whale that you can jump on while it flys thru the air to mine minerals that grow from its back... \n...idk why people hate this so much...\n\nAfter 55hr:\nHooked... playing in my own pace... sometimes things just click where they should. You can clearly see devs care for this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its nice game even tho you have to spend lot of time to finish the story with sooooo many of repeated quests",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has a great story progression with a planned potential continued storyline. It is fun to play a couple hours a week or so if you solo a lot. The end game area.... not so much for solo players. If you want to plan on giving this game a lot of your time, I would suggest to find a guild that you will fit in with very quickly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tons of content to keep you busy. Graphics are beautiful, cutscenes are thoughtfully crafted. I cannot speak on end-game and what that grind feels like or any raiding, for that matter, but if you are looking to turn off the brain for awhile and surge dopamine into your brain stem, this is an item.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good PVE side of the game, story line is captivating and the events are pretty cool. Have not tried PVP yet (where most of the negative reviews come from) From what I've seen its a great MMO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice Game, its pretty nice for an MMORPG, but some things couldve been better optimized. Nice World to immerse yourself into and has nice graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nice MMORPG overall, except the RNG everywhere, and different systems onto systems, stacked upon each other... I get it drives item sales in the cash shop, but that ain't make it less annoying.\r\n\r\nNevertheless, its world is interesting to delve into, and looks great too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty cool for an mmorpg, some things could be better optimized",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've heard things like \"Throne and Liberty pay to win or Throne and Liberty is a min/max NIGHTMARE\"\nIf I didn't try it out myself I would have missed out on one my my most enjoyable MMORPG experiences. I like Throne and Liberty. It rewards map exploration, it has NPCs that run under cover when it rains, and lots of the quests have voice acting. In all fairness I haven't reached max level where most of the complaints become relavent, but for  PVe player who enjoys a story and a world that not only looks beautiful, but feels real, I am so happy that I gave it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so far from what i've seen in this game, i like it. Im looking forward to playing it more and seeing how much better it gets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "E N G L I S H  /    /  S P A N I S H\n\nThrone & Liberty feels like a confused mix of MMO ideas that never fully come together. The game systems are unnecessarily fragmented, with progression split across weapon levels, traits, litography, codex entries, enchantments, and multiple currencies. None of it is explained well, making the early game feel like a chore instead of a learning curve.\nCombat is functional but lacks depth, and the game heavily pushes you into group play. If you prefer playing solo, you will quickly fall behind. Even basic progression feels slow unless you join a guild or spend money on boosts. The game clearly leans toward a pay-to-progress model, even if not outright pay-to-win.\nUI and menus are overcrowded, unintuitive, and often feel like they were designed without considering new players. Important features are buried under layers of tabs and submenus.\nOverall, the game looks good and has potential, but the experience is frustrating, overwhelming, and unfriendly to anyone who is not already familiar with modern Korean MMO design. If you’re coming from classic RPGs or older MMOs, expect a steep and unpleasant adjustment.\n\n--------------------------------------------------------------\n\nThrone & Liberty parece una mezcla confusa de ideas MMO que nunca llegan a unirse del todo. Los sistemas de juego están innecesariamente fragmentados, con la progresión dividida en niveles de armas, rasgos, litografía, entradas de códice, encantamientos y múltiples monedas. Nada de esto está bien explicado, lo que hace que el juego inicial parezca una tarea ardua en lugar de una curva de aprendizaje. El combate es funcional pero carece de profundidad y el juego te empuja fuertemente al juego en grupo. Si prefieres tocar solo, te quedarás atrás rápidamente. Incluso la progresión básica parece lenta a menos que te unas a un gremio o gastes dinero en mejoras. El juego claramente se inclina hacia un modelo de pago para progresar, incluso si no es directamente de pago para ganar. La interfaz de usuario y los menús están abarrotados, no son intuitivos y, a menudo, parecen diseñados sin tener en cuenta a los nuevos jugadores. Las características importantes están enterradas bajo capas de pestañas y submenús. En general, el juego se ve bien y tiene potencial, pero la experiencia es frustrante, abrumadora y hostil para cualquiera que aún no esté familiarizado",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i'm enjoying every aspect of the game, pvp, pve, guilds, class builds, exploration, skins, and much more. All for free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome graphic cool gameplay and it is pretty fun to mess around with. (specifically morphs)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome gamme. Needs more lineage 2 easter eggs, and definitely a open world pvp system like in lineage 2 or black desert. The game needs improvement and needs to be more difficult in overall not less difficult. Like the old mmo's",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Going of my time I have spent on the game so far I love it, the graphics and open world scenery are very beautiful, the combat and exploration is fun, and the music and voice acting is great, Id highly recommend TAL and the only negative I can give it is that the games various mechanics are overwhelming at first.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, good graphics, good story, good gameplay!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super beautiful MMO, im having alot of fun, I have not had to spend money, it honestly plays like a game you would pay for money for",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game, great UI, and the devs try to respond to the players as best as they can. I cant wait for more content, Ill continue to play this game, despite the minor inconveniences.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the fighting micanic and the way tthe game is formated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The graphics are stunning and the story telling is very good. The new player progression on the hyper-servers keeps one well geared, so long as you don't switch builds. I say this because the weapon mastery points can't be extracted to place on the new weapon. There are many \"bugs\" in the system so I had to use the escape function many times during the storyline. Overlooking these, the game seems good so far. I've yet to get to end game, so I can't comment further.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like Korean MMO, this is the game for you.  If you do not like the grind, then you might be better off looking for something else.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I originally pre-purchased this game before it launched in the west for advanced access to the game, but I fell off of it rather quick because I was not up to playing an MMORPG at the time.  I picked it back up recently and created a new character and started from the beginning.  It's a great and fun MMORPG.  The story is interesting. The graphics are great. It runs well on my PC and on Geforce Now.  The only problem that I have is that there should be more stuff shared between characters and they should allow us to mail stuff from one character to another.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "💬 Hours played: 126\r\n\r\nThrone and Liberty honestly surprised me in the best way. The world is gorgeous — every area feels alive, from the weather shifts to the lighting and creature designs. You can glide, climb, and even transform to explore, and it all just flows together really smoothly.\r\n\r\nCombat feels great once you get into it. It’s fast, flexible, and lets you mix up your playstyle by swapping weapons on the fly. Whether you’re running dungeons, exploring solo, or joining massive PvP battles, there’s always something going on.\r\n\r\nSpeaking of PvP — those large-scale fights are insane (in a good way). The sieges and world events feel epic, and when your guild actually pulls off a win, it’s incredibly rewarding.\r\n\r\nPerformance can dip a bit during big fights, and there’s still some balancing to be done, but overall the game’s in a solid place. You can tell the devs are actively improving things, which gives me a lot of confidence for the future.\r\n\r\nIf you’re into MMOs with stunning visuals, smooth combat, and massive battles that actually feel meaningful, Throne and Liberty is absolutely worth checking out.\r\n\r\n⭐ 9/10 – Beautiful world, great combat, and huge potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun combat, nice graphics, lots of build variety. Will see how long it lasts, but good for now!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "EQ, EQ2, World Of WarCraft this Game is the reason your Peeps Have Dropped this game is breath taking",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Too difficult, but for some reason I want to keep going.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "T&L is an MMORPG that offers unique gameplay in terms of combat through paired weapon sets, which can be cycled through depending on the scenario (dagger/bow, shield/wand). The unique ability to glide, dash and swim through various animal skins is a fun and refreshing aspect. The story and lore is nice if you enjoy that aspect of gaming, as well as, the leveling, PvP, PvE, solo and group instances. All and all, the game is fun and unique, and stands out in a world full of countless MMORPGS. Good job NC!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A good game full of fun and engaging gameplay.  That being said, the desire to progress is closely tied with cash shop necessities that reduce the grind at the very least.  Hard not to buy things, so had to disengage from the game.  Great game though!  Lots of things to like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 great character customization and gameplay!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its reall fun and great looking. The weapon setups are great to play how you want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "main problem i have is the lack of prerequisite explanations for quests...I.E. must be at night, must complete something else first..etc.\r\nthe storyline is great though",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've played a lot of MMOs, from WoW to ESO to GW2 to New World to FFXIV, and overall I'm satisfied with T&L for being free to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only if you have a guild or a group of friends cos otherwise you reachapoint where you can do anything exept  small contracts even at max level i onlyplay cos i help my friend do basic things then we are done cos we cant go any in the game wich inthe end bores mefurthther",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"gateserver disconnected\" all I had to do is wait... If I try to login right away I get gateserver disconnected. If I wait a few seconds and then try the game goes on smoothly!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For New World refugees, this is the closest thing you are going to get to a New World experience. RIP New World. I hope you all find new homes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super fun when it dropped. Couldn't tell you what the current state is though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stunning visuals and very immersing world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "beautiful world and fluid mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty solid MMORPG - nothing absolutely ground breaking, but definitely deserves its spot up there as one of the best F2P games available.\nThe visuals are great, the world is huge, the combat is flashy and the variety of content is just amazing.\nI haven't dropped a single buck so far and have been pleasantly surprised by the ways of making lucent if you are smart. \n\nI would think the DaVinci monthly subscription is the only close to mandatory thing due to the Sync system, but I could be wrong.\n\nI've got roughly 30 hours played in the last two weeks, which is definitely unhealthy, but I'm having fun. The hyperboost event really helps you catch up, even though you will be extremely underpowered compared to the other players (especially on servers like Carnage). \n\nThere has been no better time to try the game than now.\n\nGIve it a try, it's free, lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game might be fun, but i'm not sure yet",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you like a game that take a long grind to gear up throne and liberty is for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "classic mmorg, very nice graphix and nice dungeons for coop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fantasy mmorpg....its gonna have swords.......",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I came here after Black Desert. This one really does feel like a modern MMO, fresh, with old koren MMO style stuff, but a bit different. Graphics great, ingame knowledge library awesome. Many quests are deep and contains different tasks, many riddle types and those are not mandatory. Endgame farming gets classically boring, but there are tons of events to participate, it's not single best dungeon. Same with builds, many ways to be become dps, healer or tank. No races, very interesting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "1.500+ play time the game is just right on PTW and FTP on, i am FTP and i am allways on the same spot where PTW players are. I engoy the game, PvP and PvE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game overall, easier with payment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first MMORPG because the graphics are insane, and the characters are nice. Also, the game has a ton of playability. I've been having fun with my friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was skeptical about this game having read so many terror tales when it was released. I was also returning to New World with the Aeternum update at the time, so this lost out.\r\n\r\nI decided to give it an honest try a couple weeks ago, and man am I glad I did! This is a very well done MMO with several interesting mechanics. The crafting and upgrade system could use better explanations, and fishing really needs a stop tutorial. (The controls only pop up for a split second when a fish bites. Not nearly enough time to see what you actually need to do. Thank God for You Tubers!)\r\n\r\nOther than that though, this has lots of cool ideas and lore. I highly recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "24 hours in and nearing max level. I've heard mixed things about the endgame, but man....for a f2p game I just got 24 hours of quality entertainment. Was very impressed with the voice acting and cut scenes, very high production. The world is beautiful, the gameplay systems can be convoluted but just find some youtube videos and you'll be fine. Worst case scenario you uninstall, no reason to not give it a chance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really fun at first but then i accidently ruined my build started doing no damage on my level enemies, and this game has only 60 hours of playing (story) after story you have to grind a lot. but the game overall is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the most beautiful game but also one of the most toxic player base game. the develop make stunning animation and graphic but also let you get stun for 3 sec and 1 shoted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far the game is growing on me especially as a RPG with a lot of menus and stuff, once u get to know it and get used to things it gets easier to play and things start to make sense but it takes a while. The graphics are good and gameplay so thats why I still am enjoying it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good f2p. give it a try. got 20y of wow, this is one of the rare games that keeps me up to endgame. and il hop in from time to time. I hate pvp shit and i just ignore it for now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want to use the Breezline, please take the lift. If you're in the resistance, it's free!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid grind game with great graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really enjoy this game, i just wish it was more solo player friendly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "free to play! they have pvp! really great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played over 230h in less than a month, love that game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool game play with dumb friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only the less prepared will hate \n\nOnly weeklies, \n\nNot even a grind wahaha",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun at first, boring at the end. P2W",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun been playing since launch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game and fun pvp",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice and visually beautiful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bug and liberty",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awsome game and story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not sure yet whether i like it or not, need more testing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it was fun before you get to the paywall..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best mmo's free to play out there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best mmorpg to play in 2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very time demanding, but I'm enjoying it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bugsies but still recommended",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still new but having fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Works great on the Deck!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun and enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "joa joa, da nog gin mis spelleke wihj!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i am in love with this game big time",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "No matter how much i try i just can´t find any enjoyment out of it.\nIt´s  just bland not really cohesive attempt at an mmorpg with todays trend of f2p grind systems that exist just to waste your time. And that´s coming from someone who legit has over 30k hours on C4/C5 Lineage 2. That grind had a soul, this is just modern pay to win jank.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "The gameplay itself is decent but Amazon Games will shut it down, do not waste your time",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "The game is fun and would have totally succeeded in western culture if it didn't have PAY TO WIN predatory systems. It's a competitive game that rewards how much money you invest and NOT how much time and grind you put in. It's a shame that Amazon fell for NCSOFT monetization ways. RIP.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "althought i had fun and met a great community playing this game but it got quite repetitive reeeeal quick...\nif you woundn't do your dailies you would be missing out on alot or how often you needed to participate in guild events frequently, it just seems like the game wants you on it 24/7 (well it's a MMORPG.. what would you expect)\n\nas a F2P i found playing the game casually PVE was alright with unqiue and creative boss fights but repetitive as said, some times cannot complete co-op dungeons due to players giving up too easily, being toxic or inexperienced and extremely long character progression, the PVP aspect of the game was were the P2W elements played a huge role of it, often got destroyed in seige which made me not wanna continue playing the rest of it. like you practically got rewarded for spending money on items in a video game rather than playing the actual game which i find to be quite disingenuous.\n\nbugs? they are there, but nothing too insane like constant crashes. the bugs which i experienced were often that you got stuck as a morth and if you died in a bugged state, the death sound effect would just play every time the game updates which depends on your FPS. like 60 times per second for example, which makes my eardrums explode. rarely cannot attack others in a PVP area when entering it and plenty more.\n\nall in all, me personally never been a huge mmorpg person. (more of just regular RPG or ARPG guy.) i really cannot recommend this game to many people out there, but cannot blame you if you do enjoy it. you do whatever i'm not your dad.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Full of snowflakes getting offended by pixels and words, i miss old mmo-rpgs",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Grindy game full of buggs.  AGS makes a mistake gives me whole lot of spending currency and bans me for it. Im not mad just stating what happened.  I enjoyed the grind and meeting people but other then that this games a money grab end of the day!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Good at first but horrible for endgame, limited to everything and big P2W, unbalance mostly in pvp. No recomended.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Stay away. Unbalanced , full of bugs , p2w , devs are constantly making huge mistakes , game is getting worst every patch.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "p2w as all other asian games. we should stop buying/playing asian games.\nand the funny thing everything in this asian games are cheeper for asian players so its even racist against western players",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I enjoyed this game leveling up, but at max level there are just far too many problems. The gearing process is atrocious and takes far too long. The power gap between those at the top and the average player is insurmountably huge. You may as well be trying to kill a raid boss in pvp and you die just as fast. PVP is a joke. Its full of massively OP JERKS ganking everyone in sight over and over again mercilessly then mocking them for it. Don't waste your time. This game has the WORST COMMUNITY of ALL GAMES. It makes WOW's community look like Mother Teresa. Don't waste your time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible.Waste of time.Toxic sweaty people play the game.There is no casual in this game otherwise you are wasting your time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3/5 Overall.... just that simple.\n\nWant a game that you will spend 50+ hours on? Constantly running back and forth? No real soul to the game other than P2W above all? No lock restriction (sorta good not really)... A game where META matters and if you try to do anything else your at least top 500 at best with a few $$$$... Welcome to ToL, where 9k players still remain.... for now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has an extremely buggy tutorial; the NPCs constantly become uninteractable, making it impossible to progress without closing and reopening the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game was going well on the start, but amazon's bad customer support and atrocious ability to solve issues made the community lose trust on it and its capacity to be anything competent. \r\n\r\nThis game will probably be the New World in the next few months",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game had potential, but there are far too many negatives to give this a positive review.\r\nFirstly, it's buggy & laggy (at times, but those times are often). The updates are not well tested and often break parts of the game, usually not fixed for several days and resulting in additional downtime (I am writing this during another one of those times - the 3rd time this week).\r\nThe play limitations are very annoying (and are made to maintain value of their premium currency); there are a few specific ways to move forward with your character progression, all of which are limited by several in game tokens/currencies which refresh slowly over the course of a week. To give an example of how this works: Do you want to get new gear (or traits for your gear)? Do a dungeon, but you can only get rewards once per day (with the refresh cycle of tokens). Do you want to level up your gear or mastery? Do open world dungeons, which require tokens primarily granted from dungeons, and have a limited time you actually get rewards from it. It prevents people from playing too much and deprives them of the choice of how spend their time in game, all to mitigate impact to their monetization strategy.\r\nNow their premium currency (lucent).. that's interesting. Everything you want to buy or sell is done using their premium currency (which means you can pay to win) - however, you're limited to how much you can earn. I'll explain with another example: want to make lucent? Sell items/traits. Want to sell items/traits? Use trait unlock stones. Want trait unlockstones? You can only buy a certain amount by week with another currency gained by doing quests. Also, you can only completed limited quests per day (5).\r\nEssentially, the game is an interconnected web of grinding that is purposely made slow by the developers with small incremental impacts to your characters power. \r\nPay for Convenience is a little annoying. Spend about a week grinding lucent to buy Davinci Blessing, and for the next 4 weeks you can spend your activity tokens (e.g. dungeons, open world dungeons, quests) twice as fast.\r\nSame idea with Battle Passes, it's about 1 week worth of lucent grind to get a 30 day battle pass that grants you rewards that are so useful you can't \"not\" buy it. Then you need to do several side-quests daily & weekly, forcing you to engage in content that you may not enjoy, like Fishing/Cooking.\r\nOh yeah, there are weekly rewards that require you to engage with different kinds of content. For this weekly reward and battle pass, if you go to the Lawless Isle (Nebula Island) and step off the portal platform, you'll find a dozen players afking to get their obligatory 2-4 hours spent in that zone to complete the weekly/battle pass quest.\r\n\r\nNow some positive elements (I mean, there must be some if I played for several hundred hours.. right?).\r\nThe combat, abilities, creating builds - it's fun. They have built in systems like Item Sync to allow you to play around with different equipment builds. You can move your class/skill & ability progression to another by using vouchers earned from Battle Passes (albeit not often).\r\nI'm not a fan of PvP in this game, it's very \"rock/paper/scissors\" with very little balance. Example: the \"meta\" is critical damage, so the counter is stacking Endurance & % critical damage reduction. Or one ranged class is dominating in PvP, so people counter by stacking Ranged Evasion to mitigate the hits the land. It's not skill, it's luck & \"strategic engagement\" (if that were really possible).\r\nDungeons are decent, however there is a lot of unecessary \"puzzle\" mechanics during the boss fights. Example: arena gets divided into purple/yellow colors, players can't move across the border or they get damaged constantly. The boss throws a ball at one side, a player has to \"catch\" the ball while facing the opposite colors side and \"throw\" the ball for a player on the opposite side to \"catch\". Then they get a magic tether which they have keep lined up on the boss to break their shield, otherwise the mechanic might insta-kill the group. It's adding complexity for it's own sake, rather than difficulty or making engaging content.\r\n\r\nI digress... if you've read this and feel like you'll enjoy the game, check it out. There is some fun to be had, it is a bit addictive - but it is also frustrating.. often.\r\nI guess I'll check if they've fixed the issues causing downtime on a Friday evening, but I doubt it.\r\nCheers",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "30 minutes of \"playing\" the game, and its so mundane i could stand still and not care. no weight to combat, all flashy spells but nothing fun about it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "devs dont care. the game has cheaters. barely worth the investment",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst loot system for any MMO. Don't waste your time playing this game. It is a lot of fun up to end game, then it would take you over 6 months of grinding to get new gear to raid or PvP. You can always pay to win and I think that is what this game is built around, pay real money to get the gear or grind for 6+ months.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "-They have the formula to get you to spend money, but no formula for good pvp gameplay.\n-In battlegrounds, you are either glass cannon 1 shotter or an unkillable tank.\n-The game hates healers and tanks and you will be punished for playing either when it comes to boss participation.\n-PvE is glitchy and there were too many \"I shouldn't have died to that\" moments for my taste.\n-Token system sucks and token burning needs to be removed from the game.\n-Weapon system is rigid and trying other specs is too expensive.\n-I played at launch for a month, came back a month before T3 release, and lasted for ~3 months afterwards.\n-Worth trying out but don't spend money even if you think it's worth it!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If you are looking for something that is a limited grind fest this is the game for you. What does that mean exactly? Well what it means is unless you pay to play you will be grinding for months possibly even years to get the drops you want/need, but wait it doesn't stop there because you can not just endlessly grind and leveling up your gear is heavily gate kept and there are so many in game currencies and upgrade mats that its literally impossible to keep up. You can't even grind out the upgrade mats anywhere near efficiently. Back to the gear the drop rate chances are so minimal and gate-kept its unreal I don't know why I ever came back to this crap game. OH and some gear only drops on world bosses you might see once a week. On top of that you cant even grind gear from dungeons because those are all gate-kept by another currency you only get a limited amount of runs a day.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Campaign - Brilliant, Combat & World - Brilliant. \r\nWall of credit card debt - to be expected. \r\nEverything you need to upgrade, is linked to the auction house, which is linked to your wallet.. unless you want to beg the RNG gods that they will bless you with similar rolled things, which we all know, never really happens and thats even if you manage to roll a weapon, or armour. It really is a shame, as the game world is stunning, but unless you are with a group or in a guild, get used to waiting forever to join a dungeon (That if you're new, hope you know everything, or else someone will kick you!) or doing useless bounties, that give you access to kill mobs in a public dungeon, that you better hope you're high enough levelled for. God Damn it Amazon...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "347 hours of wasted time... maybe 10 of this was afk total, over a period of about 3 months, and maybe a little less. Well over 10 full days of my life playing this game. Just deleted at right about 7000 combat power.\n\nRecently the Auction house got nuked because of the incompetence of the support staff, they literally gave out millions of premium currency to a guild that requested the standard free, currency called Sollent after not getting it from some Siege event that bugged. Of course this guild turns around and buys out just about everything in the auctionhouse in a free for all that basically destroys the market and shuts down the game for 12 hours while they \"fix\" the problem. They bring it up about 12 hours later, as I said, and the problems aren't even solved, seemed like noone who exploited the issue got banned, and many, many people who weren't even involved in the guild came on to having NEGATIVE lucent (The premium currency). \n\nThis is only the most RECENT in a LONG line of incompetent bugs and glitches that I've noticed in the relatively short time I've played this game in comparison to the toxic players who've played the game since it's inception last year, which brings me to another point. \n\nThe playerbase. The playerbase is one of the most toxic I've ever seen in any MMORPG, and I've logged over 5000 hours between FFXIV and WOW. The PVP is total ass, there's NO balance whatsoever, the formula is literally, you spend enough money and have the time to sit on your ass all day and play this silly game, and you smash everyone. No combat power caps for pvp events like Battlegrounds, no real skill involved, just one-shotting the f2p people who play the hell out of the game in hopes of getting a drop at a worldboss or archboss that realistically only ever consistently rewards the whales and those who've spend thousands of hours grinding up there equipment, and AGS just rakes in the cash and continues to be incompetent. The game just went through a major update about a month ago too, and put through a bunch of so called \"hyperboost\" and a \"path of ascension\" feature that's designed to build you from 0-55 and about 6000 combat power in a few short days with the idea of catching people up and getting them into relevant content.\n\nHowever, regardless, the game is extremely PVP centric. All major events that really reward the most, are PVP, and good luck going into pvp with their measly so called hyperboost or path of ascension. You may think you've done something with yourself and be psyched to get into the battlegrounds, then you're faced with the reality of being near instantly oneshotted by some sweaty nerd who plays the game all day every day AND drops 100s if not 1000s of dollars into it, and it doesn't change. Not unless you give in and spend the money yourself, and even then, you'll still probably get smashed over and over by the people who've played daily for a year BECAUSE THERE'S NO REAL BALANCE. There's little skill involved at all. If you have the gear you win. Pretty simple. \n\nThe PVE is repetitive and the rewards are a pittance compared to the PVP garbage.\nWant a top 10 guild? Better be prepared to build your character the way THEY want, you better be willing to be a sweaty no life nerd like them too, PVE? Good luck. You'll be lucky if they do the guild bosses at the same time every week, but that's unlikely, because they'll likely push it back for some crap pvp event where they aren't even competitive in and just waste everyone's time.\n\n\nIf you're the type of person who has money to burn and time on their hands and likes to eat your boogers as you rage at people on the screen and tell everyone what to do, this game is for you. \n\nOtherwise, do yourself a favor, and stay away. This game is not for people who work for a living. Glad I deleted before I suffered through another 700 hours of this. \n\nTL;DR: Unless you have money to burn, time to burn, and enjoy being a toxic piece of crap, avoid avoid avoid! Not for people who work for a living!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Every time there is a new weapon in the game it gets more and more unbalanced. first it was the spear...it was broken...now  its the oracle. shields that simply ruined all the fun of the game....unbalanced weapons for no reason. sadly i am uninstalling the game after 1 year ++ cause this company cant make the classes balanced.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I got to max level and tried to queue for battlegrounds and dungeons with no results. Chat said they gave players tickets to switch servers a little while ago. Server is dead. Waste of time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Total waste of time, with a lot of grinding for literally nothing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have tried to like the game but the more and more I play the more I see it as a scam. Its extremely pay to win, yes you can earn a small amount of currency in game but the good items run 500 dollars plus roughly.  The more you contribute to a world boss kill the higher chance you get to get loot. The chance is already extremely small. I know guys who have played weekly for over a year and still yet to get the gear they need. They release new battle passes a couple of times a month. You spend far more over time buying all the passes. Most guilds use a priority system for the best gear, which normally requires you to have been around for ages. This is not a game you can play on/off. This game is equal to working a fulltime job and never being paid. Recently they made the decent traits drop even less. Now its even harder to get the traits you need. Which is what they want because it pushes you to purchase lucent and buy the trait from the auction house. This is your standard Korean grind fest game. Same your time and do not waste it here.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is getting axed, amazon hates keeping their promises to gamers.\n\nRot in piss AGS",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They gave me 187 million lucent then banned me for using the lucent. Penalizes players for winning.\n\nWas fun, gg TnL.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Most cosmetics are gatekept by time rotation. Even if you wanted to buy an outfit you most likely can't because it's not currently available in the shop or was only available for a limited time. For a F2P game that makes all its money from microtransactions, that sounds extremely stupid if you ask me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "7/10\nNice but not charming game. Gets very repetitive. Crafting system doesn't make sense. Lacks customization. Liked system to build character class by weapons. Boss raids sometimes fun. Maybe todays community lacks charm. Or just me to picky.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played a lot on xbox, maxing talandre. \r\nCame back on pc... game actually became less fun. People only log in for bosses. Party finder doesnt even find coop dungeon groups in hours",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love playing this game! The combat in the game is addicting! However... If you don't live in your mother's basement and can spend 40+ hours a week on the game you'll never be able to keep up... you could dump a bunch of money into it but for me that takes the fun out of gaming soo... its sad really cause the game play is very fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Throne and Liberty\" or as some call it \"Cash or Credit Card\"!\n\nIf you don't want to do daily contracts, bosses, dungeons and weekly guild raids + PvE raids (+PvP) then stay away or slap it with your credit card.\n\nProgression is tied to collecting all kinds of stuff, Money, materials, items, upgrade items (30 different types).\nEven if you slap it with your credit card you will still always be behind people playing 5 hours a day.\n\nIt's not a casual game.\n\nThere's no balance in PvE or PvP\n\nThe community is a toxic **** hole, without a guild or lots of experience everything becomes a pain in the ass.\n\nIf you want to do dungeons and aren't heal or tank - well, you usually wait 10-20 mins for a 5 minute dungeon. And if you don't do enough dungeons you're wasting dungeon currency  which means you're losing on potential items. And if you do to many dungeons - well bad luck, you can't loot any more.\n\nRaids are once per week only, normal, hard, nightmare.\n\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☑ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☑ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☑ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☑ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "community treats eachother like trash, its pay to win, and if you want to play and have fun you have to commit an unreasonable amount of time to the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was fun for a while, but then at least for me, the gameplay started to get a little too convoluted and generally overly complicated. I think it's just a way to kind of give you this casino \"jackpot\" experience where you get this dopamine hit by opening, unlocking, and leveling up useless things. \n\nI was impressed by how quick the fast travel worked, and initially the game really did have me and a few friends of mine hooked! I enjoyed the community feeling, at least when we all jumped onto the back of this flying whale lol. \n\nTry it out if you want, it's free.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game its so good but have to mutch bugs and its literaly p2w idk i love the game but losing all the hype since i play more and more",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game but when i log out i can never get back in tons of bugs always getting stuff on random nothings. now my house is gone",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Actually really enjoyed the game, the graphics are really good and and there is alot of content. The problem for me is the random FPS drops. I have a pretty decent rig, well above the recommended spec and I'll drop from 90+ fps to frozen for multiple seconds just running around in the wild. When it happens during party dungeons it's pretty bad as your party just leaves you behind. I've spent the last week or so playing with my graphics settings, updating drivers, tweaking this and that, and no changes I make cause the game to run smoothly enough that i feel like i could be competitive in PVP. So i'll be dropping this game unfortunately. At least it was free",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honest review:\n\nPlayed this game when it released. It was really good, i enjoyed all the content and dungeons. \nBut sadly they ruined the game for everyone. Remove this bullshit P2W shit. It ruins the whole game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "игры говна, игре уже год, делать нечего, контект завозят однотипный.\r\nу многих игроков проблема с мерцанием экрана в игре, ГОД! ГОД НЕ МОГУТ ИСПРАВИТЬ!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very Buggy and laggy overall, Anytime there is more than 5 people in an area you will glitch and teleport around. PVP is very unbalanced. Developers hear our feedback and don't care. Recent exploits and cheaters have ruined the game beyond repair. The players who don't cheat and play fair get screwed. Find a different game to spend your time on. Thanks for wasting our time and money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just to preface, I started playing this game to have something to tab in and out of while job searching and studying.\n\nI'm only just scratching the surface of this game, but the world is very pretty and gameplay is fun and engaging so far.\n\nThe graphics are gorgeous, the story is serviceable and doesn't try to be in your face too much.\n\nTime will tell if the game stays fun but to be honest, for being free, I'm just trying to enjoy the experience leveling up and questing. Should I encounter the huge P2W aspects that many complain about then I will try to update, but overall I can't complain for the amount of content the game has given me for free for right now.\n\nUpdate: NCsoft yall too greedy, fix monetization and this game would be amazing, I see what you did with AION2, mobile game slop does not belong near PC gaming, paying for essential features in a game should not be a thing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game, too many scripters, cheaters, exploits and bias mods/game support.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Spent about 3k hours playing that, though I prolly afked for about 20% of it. Overall the concept of the game that was present in t1 and later in t2 is enjoyable for those who prefer PvP, like myself. From world bosses to boon/rift wars between guilds to then wargames and sieges - everything felt like an old school MMORPG. The devs took out some things from the legendary L2 but made it more casual-friendly, and less engaging overall. Now i'll just list some pros and cons, and explain what went wrong with game direction in my humble opinion.   I've had a lot of experience with the game, been top50 arena multiple times since the release in Europe, and who knows how many hours I've spent in meaningless PvP dances around world bosses.\n\nPros:\n+ Open world PvP used to be actually old-school. OwPvP bosses felt very fun in zergy fights, since guilds could form 4-side alliance; was quite nostalgic especially at the start when there were a lot of sides on each server. Later devs felt it was too hardcore and only left 2 OW archbosses a week to fight over, others bosses became GvG-like which essentially made it worse for smaller guilds because they didnt have enough meta classes nor skill to compete in fair battles(there is always a bigger fish). All they had to do was to reduce alliances to 2 guilds(which they did a year later, when it was too late).\n\n+ Optimization. I managed to enjoy zerg fights and epic sieges with epic number of characters and somewhat mid graph settings, while having RTX 4060 and I5 12th gen. That's pretty impressive, people with high-end PCs had no problem rendering 300+ players on the screen with stable 50-60 fps(w/ DLSS ofc). Overall it's been improving since the release.\n+ Guild-based content, the game offered a lot of advantages for PvP-oriented guilds and had enough to keep people engaged. Boon/rift fights, sieges then later wargames is what a proper PvP mmorpg should aim to have at the very least.\n\n+ Gear progression. Its been pretty basic(traiting and enchanting is as basic and easy as it gets), though they did make it a bit more complicated with the release of heroic gear, but it's still not that grindy and overall they've been making it less grindy since 2 month after release(giving top gear basically for free at some point of t1, then the same thing happened in t2, they've been already giving a lot of stuff for players to catch up in t3, give it another 2 months they will give out top heroic traits for free). The runes/masteries/artifacts are also friendly. That easiness does ruin economy, which ill discuss in Cons section.\n\nCons.\nThe cons of this game come from the lack of game direction. It seems like devs have always been confused about what TnL should look like.\n\n- With the focus on Hardcore PvP and guilds they haven't offered alternatives to other players. PvE has always been pretty boring in the game, and it has never offered options to even grind it instead of PvP. Neither casual players nor hardcore PvE enjoyers could enjoy the game as there was no content for them. Not much to explore for casuals, the world feels dull, and only 1 raid. It took them more than a year to add 1 raid. And by the looks of it TnL will never see anything better.\n\n- Lack of content quickly hit the PvP base as well. When you make engaging PvP content that can eat up a good amount of time players will expect some meaning to it, which usually includes nice rewards. But outside of Archboss PvP everything else in the game gives you nothing of value, it's been like that for a year, some value appears at the release of new tier of gear, but it quickly becomes almost free, because the devs have no idea what they are doing. On top of that, they'd released a raid instead of PvP content this summer. Only recently we saw the new BG.\n\n- Top Loot system is too RNG. The loot is a classic casino situation for both PvP and PvE.. Even if you are in a strong hardcore guild you might not see a good(archboss) loot for weeks, if not months. As there have been a need to keep 4 active guilds and loot was shared between them(not much of it). Later as servers were quickly dying some guilds managed to simply channel the loot by afk killing empty bosses on dead servers, which resulted in most of the Archboss loot channeled to ~200 players on each server, then only those players would have access to it. That was a final verdict for the game. Alliances should've been reduced long time ago. Now with 90% servers being dead and in the need of another long-awaited server merge it doesnt really matter if you've gotten 1 or 2 guilds. The same circle-jerk of loot, with 90% of playerbase hoping to get some luck with PvE bosses, w/ obviously much lower chances.\n\n In the end,It took them too long to reduce alliances to 2 guilds. The cons above resulted in the lack of rewards for PvP and PvE in general. \n\n- You want your hardcore no-life guild to get something out of the fighting for the sakes of fighting? Well bad luck, global skill for top1 killing ranking that enabled PvP in open world dungeons was made useless - the only shiny thing that PvP players could get in that game was quickly reduced to just a number because the devs couldnt make up their mind on whether the game is PvP or afk macro another useless ow boss that dies in a second and gives you about nothing on average(unless you are lucky in the first 3-4 weeks when it costs something before they nuke it). Archboss PvP has been about the only thing to give you anything, but even then it wasnt designed to be that predatory. But because there are no other meaningful rewards Hardcore playerbase chose to simply exploit the existing system by turning servers into sleeping fest to at least get something. As for PvX guilds there isn't nothing to do either. Your leveling of the guild doesnt matter, some new guild bosses? Loot is devalued, so who rly needs it?\n\nYou want something out of wargames?(a really cool mode for custom interserver GvGs) well no luck here as well; it's been a year since they added wargames, community managed to host even 2 tournaments between guilds using this mode and guess what? They haven't come up with any logical successor of this mode, it's still just a custom mode, it gives nothing. It's just some entertainment for PvP guilds, but no serious MMORPG can last long when your most popular guild content is a custom no-reward training mode. \n\n- Boon/Rift wars? A nice concept, however neither buffs nor boss loot are useful. Nobody plays it anymore. A siege? Its fun but guess what? :)\n\n- Your Arena rank? It doesnt matter I'd been top50 multiple times in Europe the rewards were a joke. Sure S2 gave you some nice nebula boxes with guaranteed loot, but it lost value in a month anyway. Now it's better, but still too little too late. Oh and they removed 3v3 arena, added a copycat of 6v6(like why, NC?). Dont get me started w/ Nebula Island; a fine concept but time-gated...\n\nNow dont get me wrong, I am all for guilds-content and as many PvP modes as one can have. Ive myself played in mostly sweaty hardcore guilds and gotten over 100k worth lucent of loot, including several archboss weapons(about >$2000 worth). But had I not played in such guild that always aimed to dominate server and win I would have never gotten that expensive gear without swiping. There is no meaningful way to grind lots of lucent outside the first month of new gear release, NONE. You want to grind craft? Well it's useless and system feels mobile. Hence, that time window at release of new gear tiers is all you have, e.g. t3 is already \"nuked\", it's gonna be Groundhog day again when they add more... Good things that came in the end were the new Battleground(took 1 year to add) and nice people I've met along the way.\n\nIn conclusion, it's not worth it if you are new. And it's not about burning out, its about NCSoft sacrificing TnL in the name of their next \"big thing\" (Aion 2). The concept was good though.\n\nNC just don't care anymore. Why should we?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As you can see... I have played this game a lot.  There are a lot of reasons I can list why I am quitting but Ill keep it short.  \r\nThe Game has become very Pay to WIN \r\nGame breaking hacks and exploits never get punished so cheaters are free to keep all the rewards\r\nOrb has become the forced meta.  Instead of create your class by mixing two weapon type allowing for dozens of viable combinations.. it has become Orb and a few meta 2nd weapons that dominate everything from pvp to pve.  Having trouble Doing the hardest pve content in the game, no problem, just ditch your tank and healer get get more Orbs in your party.  Team getting deleted in pvp, no problem, just get more Orbs in your party...\r\nso... Throne has become  Buy more Lucent so you can make an Orb build and Exploit often and quickly before it gets patched.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "O jogo parece que esta em versao Beta, bugs e mais bugs... Fora que a Jeff Bezos parece estar falido, ja que nao conseguem custear um servidor que preste... O jogo se diz de PvP Massivo porem o proprio jogo nao suporta o PvP massivo, caindo os servidores diversas vezes durante esses eventos.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun until the end game. Constantly need to grind specific time frames and shit, hard to upgrade. It's just bad end game design",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Devs Destroy their game by giving out 12Billion of the in game currency out. No recovering from this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is perfect, but what Amazon is doing has ruined it. It's a shame.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is bleeding players and the lack of meaningful content doesn't help -- dev's decision to constantly new gear without adding actual content doesn't help.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not worth your time.. dont waste your money on this KR Pay 2 Win trash.. Devs dont give to shits about Class balance. Dseync Abilities not working or going off when beside players.  and everything is all Guild / alliance base.. If you run in a small group u will get face rolled.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "slapping on a lore you can supposedly shape however you dream. That’s exactly what this title feels like.\n\nVisually, it’s your typical Eastern MMO style—sometimes even reminiscent of Final Fantasy XIV. I only tried it after seeing a YouTube clip where you morph into an animal. Yes, you can, and if you’ve ever played a druid in World of Warcraft, the only difference is a smoother transition. Graphically, though, it’s far from the “Unreal Engine” wow factor.\n\nCombat? Think ESO. Ranged weapons cut off if you’re a few steps too far, and button‑mashing feels like a newbie Death Knight in WoW. Add a layer of mobile gacha mechanics—daily rewards, random upgrade boxes, endless UI screens—and you’ve got the full package. Character options? Humans only (with optional cat eyes and spiky ears). Lip‑sync is off, voice files sometimes missing, and the “storyteller” randomly rehashes dialogue you just read.\n\nThe real problem: the writing. ESO’s story kept me hooked despite its flaws; here, the narrative nosedives from a passable tutorial into bland fetch‑and‑kill quests. If AI only handled translation, I almost wish it had written the story too.\n\nWould I recommend it? Since it costs nothing, sure—if you’ve got no alternatives. Otherwise, play something better. Oh, and about thirty minutes in, you’re saddled with a permanent plushie companion whose face expressions are like a light-switch.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "6,000 Lucent is around £85\n\nToday, an Amazon DEV distributed 184 Million Lucents to every player of a Guild in NA. Those players then bought every item on the AH, and then instantly re-listed these items at exponentially inflated prices. Because Lucent is account shared, these players made their way to the EU servers too. \n\nThe game has been offline all day, for many hours, and we have received ZERO communication on the resolution or compensation. In other words, nobody knows what will happens next.\n\nTLDR: Game is super fun, totally worth the time and money investment.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I spent a bit of time on that game, and yeah… I kinda regret it.\nBut hey, at least I made some good friends.\nThis game has a lot of potential, but unfortunately they made many bad decisions.\nThe only thing that stayed consistent was the number of bugs.\n\nI had strings, but now I'm free.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring, flashy combat. Non existent lore. Tedious grind systems requiring a hundred different types of items. Zero combat challenge (brain dead levelling - same as WOW). The game is only about eye candy and nothing else.  Just play something better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "-Unreal Engine 4 (Decent graphics, animations, spells, etc).\n-Story line (Forgettable, just spam F, AI voice actors)\n-12 \"Classes\" (based on your two weapon combos but not balanced or heavily gear dependant)\n-Optimization (horrible, you have to turn everything down to be able to just play the game without massive FPS drops)\n-Cash Shop (P2W but some very pleasing looking costumes)\n-PvP (garbage)\n-Dungeons and Raids (didn't even care to try them)\n-Sieges (never tried due to optimization issues and PvP being trash)\n\nSave your time and money.  6/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is dead, Devs took advantage about their error to earn greed even more money on a dead game. I was enjoying but I was too disapointed to keep farming brainless because y'all gave too much money to a guild and didn't assume the consequences. I give this game at least 1 year before it's over bye",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Throne and Liberty: A Promising MMO Undermined by Lockouts and Pay-to-Win Tactics\n\nThrone and Liberty begins with a captivating premise, boasting an immersive world, compelling lore, and thrilling combat. However, this promising foundation is severely hampered by irritating mechanics, particularly lockouts and pay-to-win (P2W) elements, which detract from the authentic MMO experience players crave.\n\nThe game initially lures players with a world brimming with adventure. The combat is dynamic, and the expansive world offers ample opportunities for exploration, quests, and group activities. The game's potential is undoubtedly enticing.\n\nHowever, beneath the surface, it becomes clear that the game is engineered to encourage spending over genuine gameplay. Lockouts, which restrict content access on a daily or weekly basis, are a significant issue. It's frustrating to encounter a barrier after a few hours of play, realizing that further progress or access to certain features requires waiting for reset timers or, worse, paying to bypass the wait. This artificially extends playtime and constrains the enjoyment within a session.\n\nThe pay-to-win (P2W) mechanics further exacerbate this issue. While MMOs typically offer microtransactions for cosmetic items, Throne and Liberty goes a step further by providing powerful in-game advantages for a price. From paying to skip timers to purchasing top-tier gear, it's evident that the game prioritizes player spending over their time. This imbalance favors paying players, leaving those who opt not to spend at a severe disadvantage, unable to compete with those who invest money for advantages.\n\nPerhaps most disappointing is that Throne and Liberty feels more like a monetization scheme than a game. Instead of creating engaging content that rewards skill, strategy, and player investment, the game forces players into a cycle of either paying to skip tedious tasks or being locked out of progress.\n\nIn summary, Throne and Liberty has the potential to be a great MMO, but its focus on lockouts and pay-to-win mechanics ultimately undermines this potential. For players who value fair play, skill-based progression, and a sense of achievement, this game will be a source of frustration. Unfortunately, it appears that the developers prioritize monetization over delivering a quality, player-first MMORPG experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "10000000% pay to win. DONT WASTE YOUR TIME!!!\n\nonce you get past the story and can do more in the game. you quickly find yourself outmatched. and if you try PVP and havent dropped a pretty penny then its pointless. you have to spend real life money to use the auction house. and its flooded with scammers that are selling in game items and then cashing out for real money. 92% of which is all scamm bots with cheats from china and india... \n\nbeside that combat and stuff in clunky, the quest are extremely boring and half the story dialog is incrediably skippy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "as soon as i saw that stupid cartoony fairy like character, i instantly alt-f4'd and uninstalled. thats like one of the biggest red flags with companies that lust for money. can care less about this now lol, not even close to worth the 101 gb install",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s not a bad game I just really hate the combat. Somehow both camera types are just horrible. I feel like making it so you can actually click to hit would make this so much better. It just feels like an autobattler right now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Will never play another Amazon game ever again. RIP NW. T&L isn't that good either. \n\nThe horse has been lying there for a while, bleeding out slowly. But you didn't need to take a sledgehammer to it's head. You could have grabbed a bandage instead. \n\nGG #AGS.  I mean #AmazonGarbageStudios.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is trash. Pure unadulterated Korean pay to win trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Is pay to win and very repetitive and the players kick you out if you don't know mechanics or your power is not enough.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "hard script and hack player base and the developers and publisher does nothing about",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "incredibly bland gameplay loop in the time that i played",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "controller support losses right analog stick also buggy from time to time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Useless Abyssal Contract Tokens fill up Inventory; can't be destroyed, removed, or sold.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "garbage game devs have no idea what mmo is so cring and frustrating",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game was made to make money and not to be fun, you are the product here.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly had so much potential. \n\nBut unless you pay to win and join a massive pvp guild of p2w. You are wasting your time and money trust me I know.....\n\n-2k LOLXD  FKING idiot",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ultimate P2W game, you can't compete anymore without paying",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A Player’s Opinion for Players – Thrones and Liberty\n\nThrones and Liberty is a fascinating game full of promise, carried by breathtaking environments, a polished artistic direction, and an absolutely incredible soundtrack that elevates every zone and greatly enhances immersion. The gameplay mechanics are enjoyable to handle, and while the story isn’t groundbreaking, it remains coherent overall. On paper, it’s an MMORPG that truly makes you want to dive deep into its world.\n\nFrom the very first hours, you’re struck by the vastness of the map and the variety of dungeons, crypts, and zones shifting between PvE and PvP. The experience is dynamic and engaging at first, though the gameplay loop unfortunately becomes repetitive over time. Thankfully, the presence of numerous diverse guilds helps keep things fresh: you can choose to play casually with friends or commit to hardcore groups where “IRL first” quickly gets pushed aside.\n\nHowever, despite its undeniable strengths, Thrones and Liberty suffers from several major issues. Castle captures completed without fighting through exploit abuse, an unusually high level of toxicity, hundreds of bots and cheaters pulling off “legendary parries” in PvP, and questionable class balance all weigh heavily on the overall experience.\n\nTo make matters worse, the business model leans dangerously toward pay-to-win, creating unfair progression gaps and discouraging players who simply want to advance at their own pace without reaching for their wallet. The situation has degraded to the point where, a year after launch, players practically have to queue as tanks if they want to access group content—because no one plays the role anymore. Meanwhile, healers like myself now wait over an hour just to enter a dungeon instance.\n\nIt’s particularly disappointing because I’ve spent nearly 1,000 hours in the game with friends and genuinely had great moments—though far fewer than some veterans. Thrones and Liberty had everything it needed to aim for a solid 10/10, but today, it struggles to reach more than a 3.5/10. \n\nL’avis d’un joueur pour des joueurs – Thrones and Liberty\n\nThrones and Liberty est un jeu fascinant, plein de promesses, porté par des environnements à couper le souffle, une direction artistique soignée, et une bande-son absolument incroyable qui sublime chaque zone et renforce l’immersion. Les mécaniques de gameplay sont agréables à prendre en main et, même si l’histoire n’a rien de révolutionnaire, elle reste globalement cohérente. Sur le papier, c’est un MMORPG qui donne vraiment envie d’être exploré en profondeur.\n\nDès les premières heures, on est frappé par l’immensité de la carte et la variété des donjons, cryptes et zones, alternant entre PvE et PvP. L’expérience est dynamique et engageante au début, même si la boucle de jeu finit malheureusement par devenir répétitive avec le temps. Heureusement, la présence de nombreuses guildes, très diversifiées, permet de varier les plaisirs : on peut jouer tranquillement entre amis, ou s’investir dans des groupes hardcore où le “IRL first” finit très vite relégué au second plan.\n\nCependant, malgré ses qualités indéniables, Thrones and Liberty souffre de problèmes majeurs. Les prises de château réalisées sans combattre en exploitant des failles, une toxicité omniprésente, des bots et des cheaters par centaines capables de sortir des “parades légendaires” en PvP, ainsi qu’un équilibrage des classes souvent discutable, viennent plomber l’expérience.\n\nÀ cela s’ajoute un modèle économique qui glisse dangereusement vers le pay-to-win, créant des écarts de progression frustrants et décourageant les joueurs qui souhaitent simplement avancer à leur rythme sans passer par la caisse. La situation en arrive même à un point où, un an après la sortie, les joueurs sont pratiquement obligés de se taguer “tank” pour accéder au contenu de groupe — faute de joueurs dans ce rôle. Pendant ce temps, les healers comme moi attendent désormais plus d’une heure pour entrer en instance.\n\nC’est d’autant plus regrettable que j’ai passé près de 1 000 heures sur le jeu avec des amis, et vécu de vrais bons moments — même si ce n’est rien comparé à certains passionnés. Thrones and Liberty avait toutes les cartes en main pour viser un solide 10/10, mais aujourd’hui, difficile de lui accorder plus qu’un 3,5/10.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very boring.  There is nothing worthwhile to do once your daily tokens are used up.  I tried so hard to enjoy this game on multiple occasions but would log in and realize that there was nothing for me to do besides completely pointless hourly events or bosses where id never get a chance at the loot anyways. \r\nThe lucent based auction house and how you sell gear traits to try and fund purchases of the traits you actually need on your gear is the worst loot/economic system ive ever encountered\r\nHappy with what I got out of it for a free game but cant honestly recommend for anyone looking for a long term mmo home.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashing during start. Often unable to start the game at all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's like if Guild Wars 2 had terrible class design, looked like a generic KMMO, no meaningful story, and had 0 content.\n\nPlayed because of a friend who always convinces our group to play terrible KMMO's, so my 200 hours is more just because my friends were playing it, and I wanted to do stuff with them. Until we all collectively decided it was dogsh*t\n\nThe Publisher also has no idea why KMMO p2w works in Korea, but not in the West. Look at the current iteration of Black Desert Online if you want a well ported game. Maybe T&L will drop their moron vampire publisher and bring their game back from the brink of death.\n\nI am also a bit bitter about how bad KMMO's always are. It's like they take a feature, chop it in half, suck it dry of any character or fun, then charge you full price for only half the value.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Full with bug and Irresponsible data manipulation, unprecedented career balance, the operating company and the game developer are a bunch of scammers.Believe me, you won't find joy in this, they'll only engage in short-sighted deception to boost their online presence KPI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Latest patch put the game into full handbrake mode. Everything feels slow and powerless, even for the not overpowered classes. Grinding gear for weeks just feels like thrown into the bin and your character wears a wooden training sword now instead of a legendary weapon. The community got used to fast forward content for weeks, balancing came way to late and in an unappropriate way.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "THIS GAME LOOK LIKE A SHIT \r\nIf you want to ruin your life, this is the best option.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is dead boys.. was fun tho",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "getting worst bug after bug.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Terrible game, avoid like plague.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's win maxing from the start. Just don't",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meh. Pay to win.. Never would be as good as New World",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NEVER EVER PLAY AN AMAZON GAME! I WARNED YOU!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Anything Amazon touches is trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "global version its weak",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It feels AI generated.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yea this thing called a game is garbooo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unbalanced game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "couldnt get into it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disgustingly pay to win.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "about what you'd expect from amazon",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "لا توجد لغة عربية في اللعبة",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Amazon games, no thx bezo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another mid p2w korean mmo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Issues with Anti cheat errors",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}