{
  "positive": [
    {
      "review": "It's a great game I just wish the players had a better attitude the community is nothing like the original game.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "Honestly its not a bad game, I think sometimes its easy to bandwagon on the hate train, as a beta smite 1 player, this is what I will say about the downsides about this game:\n\n-Community is toxic, like okay? It was toxic in smite 1 too lol nothing changed, LoL is toxic af too its just the nature of Mobas unfortunately\n\n-Yes each character has a \"mini pass\" on each of them, it costs like $5 or u can get the special edition and get them all, but the game is *free* and the pass is for cosmetics only? I fail to see how this is even an issue, you cant spend $5 on a free game on the god you play? Like games need to make something and that isnt really that unreasonable\n\n-Besides that people complain about the time to kill, yes the game is more punishing, but that doesnt mean its bad, a game being harder for everybody does not constitute a bad game, just get better? Like thats what you do when you face an obstacle, not cry about it, that doesnt help anything, on top of that the game is in beta they are going to iron things out\n\nThe overall issue is, I care about smite, I played it for a long time, and I feel a lot of the players that are leaving bad reviews care too, so knowing this is HiRez's last shot at something and if this fails the company will likely fail, how could you possible destroy that? The game is not bad enough to warrant causing all that, and even if you want to say they shouldve done it right the first time, its in beta, they are fixing on it, working on it, with a limited staff and budget...\n\nTL;DR:\nIm not saying this is the best game ever, it needs work, but give them time to cook instead of storming in the kitchen, knocking their frying pan down mid meal prep and yelling about how raw it is",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "as someone who has 2.578 hours in smite 1 on the steam launcher and probably another 2000 before it came to steam i can say that smite 2 is a definite upgrade. it's no where near perfect yet. many gods still need to be put back in the game but the gameplay is smoother, the ui in better, it's just all round better than smite 1. the 1 BIG downside however is there is no community in-game.  there are no profiles yet, there's no whisper system. can can't talk to friends. the only interaction you have is a 30 second post game lobby. that part is atrocious but the second they fix that it'll be a amazing game",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "одному конечно играть хорошо,но с друзьями ещё лучше если они есть а так их ну.. учитывая много времени играть в это одному уж точно надоест а так напарника нет на эту игру но в целом она весьма залипательна рекомендую.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "The sequel of my favourite PvP game, which is slowly becoming better than its predecessor. Like with every MOBA, the gameplay can be tough for newcomers, but once you get the gist of it it'll become addicting.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Its really fun game(I have no hours in the first game but, despite that I am having fun in the arena) and I suggest giving it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "11/10.  I love this game.  When I discovered any god can be built any way you want, my jaw dropped in the best way possible! So you're telling me I can build a mage neith?! Incredible! 12/10.  I absolutely love this game.  Much better than Smite 1.  I am so happy all the players migrated to this amazing game! I can positively say the player base knows exactly how to play the game, too.  All around a really fun, enjoyable experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game just like the original but even better now, been playing since 2016 and wont stop anytime soon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game, loved smite 1 and love smite 2. Definitely needs to updated more often but I think it has a bright future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Smite 2 might not be the most polished game on the market right now but I have never seen harder working devs and their passion and drive to make smite 2 into a product that will set the gold standard for good gaming practices.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would highly recommend this game if you liked the first game. this games textures and map is so much more high quality and colorful, while still giving you that nostalgic feeling of the first game. just as fun too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game!!! It is only in Beta right now, but even in this stage, better than the last several CoD's,. Fun to play a MOBA with deities and gods from actual mythology, and in third person! HIGHLY RECOMMEND!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.\n\nThere are some questionable monetisation strategies with skins though which feel like a bit of a trap.\nAs an example:\n- When skins from the original game are recreated for this sequel, they are released and initially only purchasable with money.\n- Then, after a couple of weeks, you can purchase the same skin with legacy gems, a currency transferred from the original game.\n- This causes players to spend money thinking the skin is only purchasable with money, to later realise it's something they could use legacy gems for.\n- No where in game does it tell you this, apparently Hi-Rez broadcast it on social media but if it's not advertised in the game, where the purchases are made and the majority of the player base is, it feels like a shady marketing practice to make a quick buck off of the community. Not a great vibe.\n\nSkin sales strategy aside, I really enjoy Smite - my only improvement with the game would be to see some effort to tackle the toxicity with players. I'd love to see something altered in the design that encourages more supportive responses from it's community. In every game I play there is someone being harassed or abusive to someone else which most of the time just makes me feel embarrassed to be a part of the community!\n\nNotes on a napkin on how this could be improved.\n- Prevent VGS / Ping Spam.\n- Harsher punishments for harassment/abuse. (Players frequently reported are only queued with other players frequently reported) (A punishment to your rank?)\n- Rewards for players voted MVP/Good Leader/Guide.\n- Something earnt if you lose a match (something to balance the salt of rank score being lowered with progression towards something else, contribution to ranked match only skins perhaps?)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun with friends but blows absolute cheeks alone",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Much better since i last played, Aspects are great addition and graphics keep getting better. Player base is small but the game is still in Beta.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I first played on release day, I thought, what did they do to my boy smh. I came back almost a year later after hearing how good the game has become, and how much it feels like the original smite. Those people were absolutely wrong, it was even better than I remember. I had an absolute blast playing with my friends again and dunking on shidders. The maps, the skins, the voice lines, everything was so crispy and vibrant I loved it. Seeing the colorful effects from abilities and UI becoming easier to read, it felt like a massive difference from release day. I wish the people saying \"They're making us pay, and it's still in Beta\" or whatever would change their view. I am more than happy to support the team and at the end of the day Hi-Rez is a business, if restructuring and layoffs are needed then unfortunately it has to happen. You can't achieve greatness without sacrifices. I absolutely recommend you try Smite 2 now, I'm very excited to see how it turns out in the future.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best 3rd person MOBA in my opinion. A good array of god choices and items to construct a build. Nice versatility in each god. Most are playable in multiple roles which is a nice change from Smite OG. Player base is more on the casual end of the spectrum as opposed to sweaty or highly skilled. As with any online game the toxicity is real but not as bad as other online games. GLHF!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn`t play much of smite I joined in when merlin got added and played here and there with friends after that, this game feels better in alot of way some ways not so much; that`s any game, I believe what the game has to offer and potential will be far better in the end than smite one. new players frustrate old players, the game state frustrates the old player because they experienced the peaks of smite one, so its a hard balance; good things take time, especially given the behind scenes at hi-rez studios. You start a building with one set of blueprints then get rid of those and the team, bring in a new team and new blueprints, it hard to do that and not fuck up some things along the way and also another great thing if the community could not be so toxic towards one another game after game it will exponentially help the game state because competitive integrity is weak, add better incentives to winning ranked and harder punishments for tossers, bans, trolls, etc. Despite all that, try it, its fun and worth the chance seep through the dirt a lil sometimes but man the highs are high and well lows are pretty damn low.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please delete Janus... and if the devs still have some time left, they could also fix the matchmaking, or just delete that too.\nBut whenever I’m not suffering from the devs decisions, I’m actually having fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just have fun, watch some videos or find a friend and you'l love it.\r\nAlso, Mute everyone for a while",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a pretty fun game with friends take time to learn but once u get it down its pretty damn fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Smite 2 is playable now. Early releases were terrible, but its actually good now. Just needs more gods and fine tuning.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So coming from Smite 1 I was looking forward to what was/is going to be offered in Smite 2. -sighs- There are 2 really huge problems with Smite 2.\n-First- Those of us that are legacy players and spent a lot of money on Smite 1 for all the skins feel shafted. Like many tier 5 skins I can no longer get/use and I know they gave us gems for some sort of \"equal\" amount in which we spent, but it isn't equal. Like, I want my skins back.\n-Second- Waiting for gods to be playable. I understand the team is going from unreal engine 3 to 5, but they still have the models. They are releasing gods and balancing them as they're being released. Along with some updates on moves/kits along with new visual effects but it feels like we're waiting forever.\n\nThe next thing are the playable modes. Conquest, Arena, 3v3 Joust, Assault. Not gonna lie, I miss Slash & Clash mode. The 4v4 and a not conquest 5v5 objective modes were fun. 2 lanes plus jungle was enough. Especially for those of us that just don't wish to deal with Conquest mode and/or don't even know what the \"meta\" is for the mode.\nThe game feels like it's been in \"early access\" for a long time now. I really want this game to succeed but it's becoming a bit difficult to keep playing. I'm going to keep pushing on and I hope there are some more updates and soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent game so far. The matches are impersonable as people just grind them and do not communicate often.\r\n\r\nSome bugs, but the game is still in beta. Some of the deities feel redundant with their powers. More unique mechanics and slower paced fights would be good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have around 5000 hours in smite 1 and owned most of the skins,it does suck that we lost alot of skins but  this game's performance makes up for losing my cosmetics. now is the time to learn the game though before they add all the old gods back, its skill floor is fairly low right now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple if u liked Smite 1 (or think 3rd person moba or arena battles where u play as a God are something for u) then u will like this\r\n\r\nHad a rocky start but game is in a very good place now. And yes it has less Gods then Smite 1 but it will get there eventually, while everything else is like smite 1 or better (think some gods are def better in Smite 2 in terms of abilities and balance and obv game has better graphics)\r\n\r\nHonestly its def worth trying, specially now, its free, they are giving u daily log in gem bonuses (paid currency), weekly twitch drops for coins to buy skins and a lot of events, collections and sagas (in short where u get skins and other goodies) to get the player base up (yeah some are very grindy or expensive but for now and with the current event I got tons of stuff without spending a cent)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing Smite for over 10 years and over that period of time I have definitely developed a love/hate relationship with the game. Anyone that has played as long as I have knows that the game has had its low points, but as it stands right now Smite is in the best place it has been for a very long time. The constant updates and new content keep the game fresh and for the most part, enjoyable to play (Just add my boy Tyr back into the game I beg).\n\nAs a MOBA Smite 2 is definitely the most beginner friendly game on the market and the continued improvements to the new player experience are a big step in the right direction for the game. I would recommend anyone that is on the fence about trying the game because of how complex it seems to just give it a shot, its free after all. The only thing you will lose is a small amount of your sanity.\n\nI believe the 1.0 full release of the game is going to be a huge turning point for the future of Smite 2 and I'm eager to see whats coming next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bad optimization and not the best balance but It's a fun game, Feels a bit off seeing as the game Is not officially out yet but we've been getting many cosmetics compared to gods but It's really a non issue.\r\n\r\nPlease bring back anti heal 😭",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love smite, I've played smite 1 for probably 2 thousand hours across platforms, and I think smite 2 is okay in where it's going. I think re-releasing the same gods from smite 1 and pretending it's a big deal is ridiculous because no returning player gets excited by it and there isn't even enough marketing to draw new players.\n\nAs for gameplay I think Smite 2 is incredible I think this is the best gameplay Smite has had ever. What I can't stand is the role queue for Conquest. I do not care put me in a 10 minute queue just don't auto fill me every other game. Whether I'm in casual or ranked it's just constant auto fill. I understand people don't want to play support or solo, and i understand your player count isn't really high enough to just give everyone their role all the time. But if I have Jungle or Mid or even Carry as my top priority. It's nuts that I'm getting support/solo in 70% of my games. It's not even MMR based it feels like, because I can be second to top pick on the team and still get autofilled support or solo. \n\nI do not want a 2 minute queue I want to be able to play the role I queued for and not autofilled into a random role for a 30+ minute game 50% of the time. I still love Smite and enjoy the gameplay which is why I'm still going to recommend the game as I believe people should try it. But please make it more bearable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and addictive game. If you like Dota 2 and third person games mixed in one game, this is the right game for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only cause i have to defend my alma matter. Smite got me into MOBAs and once this game is through development and polished up I have no doubt it will be superior to Smite. The plus ones, aspects, and new build options have potential even if some stuff is absurdly broken or frustrating to play into. Def give it a try!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This feels like the slow update of Smite. It is still in Beta so things feel a bit wonky, but there are some new directions they are going that feel interesting, such as god aspects that alter the usual play and feel of a god. I think this is a good area to bring more variation without needing to add more and more new gods to each pantheon so quickly. Negative is that very little carries over from previous account with Smite 1, and newer skins currently feel underwelming. Especially the prisms (color variants), but that makes it easier to remain free to play for me. I spent almost 2k hours in Smite 1, on and off since launch. I paid maybe 50€ overall for the game on various skins but I feel like I got my worth out of the game so I am not too sad about the transfer. I do feel like Smite 1 is still the better experience as of November 2025, but hopefully that will shift as Smite 2 hones in on play experiences and skin quality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I do like the improvements made to the original smite experience. I really like that the tier 1 items are common amongst a lot of the same type of tier 3 items. I am not loving the hybrid scaling of some gods, it does not feel impactful enough (it is often better just to go full intelligence/magical damage or strength/phys damage. Love how the game looks!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Take it from a guy that spent 10 years in Smite 1 (~2000 hours): This game rocks. Its still rough around the edges, but dam does it feel good. The character controls are smooth (thanks to the new engine), the graphics are gorgeous, and I'm really enjoying the updated character kits. Allowing any character to buy any item really opens the designers to new possibilities, such as Sunwucong dealing more physical damage based on intelligence scaling (called magical power in smite 1) making him a true hybrid between warrior and mage. \r\n\r\nI'm not going to comment on the micro-transactions, as they are 100% cosmetic only. \r\nI highly recommend buying the god pass to get all the characters in perpetuity. I bought it for smite 1 in the beta, and it was about the best $30 I've spent on a game ( i think it was 30, it was 10+ years ago )\r\n\r\nI really hope Hi-Rez survives long enough to make this version of smite something genuinely special",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Overall a pretty good game, managing cooldowns, knowing when to attack, and defending allies at the right times. Its fun if i'm being honest. I love jormungandr tho(he's my main).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game being sucked dry by capitalism. Fire the frauds up top pls and support the devs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely fun! I am a casual player and I approve! Just chill and enjoy the ride!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's actually Smite 1/2. Half the content. The 2 stands for 2000 different battle passes. Otherwise the gameplay itself is fine, in my non MOBA playing opinion.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The new models look like crap, and it sucks you can't get your old skins for free. I think thats a load of bs.  However, the achiemvents are VERY fast, so honeslty you can finish this in a week or so.  Games DOA since they split the playerbase, but it does some things good some bad.  I like the aspects but some are garbo, some are amazing, and some are either or your playstyle. They need to be touched up. (like say morrigan aspect? What a joke!  but Chaac Aspect, awesome for tank vs more aggresive builds)  Honestly play it before it dies.  Move on.  HiRez loves to destroy their good games and churn out garbage.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has made significant improvements over the last year, it’s starting to look more like a polished product in certain areas. Only downside is the members of the community, they swear they are the best and will troll you haha",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think there is a lot to love about smite 2 coming from smite 1. I love the new engine and how the game looks and runs. When its running its sprinting!  A lot of players have issues with balancing but with any game that is as new and experimental as this it takes a lot of time.  The biggest issue you will run into playing this game is the player-base itself.  If you are used to overwatch level of crazy teammates than you will have no issue here.  I do highly recommend new and old smite 1 players to pick it up and try it none the less.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dont jump in expecting to win. takes time 2 learn it all but is a great game.......just fix ur bugs hirez!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overhated. Devs are listening to the community, biweekly gods with nice plus ones. Are there issues? Yes. Have the issues started getting fixed? Also yes. Also aspects are some of the coolest things they've ever added.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was trash, but is pretty fun now. The developers are slowly adding good additions. In a few years it should be as good as Smite 1!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than smite 1 already imho and im excited for the future",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "spawn then die then spawn and get hit with the good ol you rock cancel that. 10 out of 10 great way to pretend life didnt forget the lube",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun and pretty easy to pick up MOBA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only this is people on here can be really toxic to new people to play with people you know otherwise you will just be getting yelled at in game chat or voice chat a lot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Runs better then Smite 1 currently. But it seems like i have daily updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as good as The Orignial SMITE  [YET] \nbut considering its still a BETA .. its doing Fine so far \nthere is potential if HI-REZ locks tf in",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The continuation of Smite, if you liked the original Smite it's time to move over",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play this game every day, I've never felt more suicidal in my life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bad new player experience, matchmaking",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i don't get the hate. This is a fun game with frequent updates/new gods.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Hard to play without the Rat, best god is Smite 1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly the games not bad just a bit dead. The graphics are a BIG step up from Smite 1 and the gameplay is roughly the same. The conq map sucks but wont be changed until full release probably. Once all the smite gods are added to the pool and the game fully releases I am awaiting the games return as king of 3d mobas. Until then there is no king. The game has far less bugs than smite 1 just people wear rose lenses and say its worse. I love the aspect system, it adds a ton of flavor to the game. Legacy gems are a great way to make sure smite 1 players don't get completely f'ed. Overall I think the game is better than smite 1. Just isn't getting a ton of content outside gods until full release.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have a degenerate amount of hours in Smite 1. I can safely say that this game is better than Smite 1. It was looking grim at first but they have been really making this game feel like Smite again. If you have never played Smite and are considering trying it out you should, the game is really fun to play with your friends and the PVP is always fundamentally fun. This is always the game I can come back to and get solid PVP. I don't understand why this community try's to slander the game so hard, fyi the same people slandering the game are in your ranked games. If you do try the game i will warn you, you will face a ton of sweats that try hard in casual games so be prepared and take your time don't try to learn all the gods at once. Pick a couple gods and stick to them soon enough you will get your first Penta Kill.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is too early to write a review about the game as it is still in beta as of now, however for what it is currently it is a worthwhile game.\n\nSmite 2 is a definitive upgrade of the first Smite, made with Unreal Engine 5 instead of 3, superior graphics, and a greater variety gameplay wise. It offers a diverse roster of mythological figures from mythologies all over the world brought over and reimagined in an appealing style, as well as tons of fun cosmetics to adorn them. Gameplay wise it is one of the most unique MOBAs out there, sharing a third person perspective that is more familiar to the average gamer yet offering a unique challenging learning curve. Item and built variety is at its peak compared to the first Smite, with multiple builds and Aspects to experiment on and create a playstyle tailored to your taste and new gameplay mechanics being constantly added. The superior engine definitely aids the game, as the visuals are unlike anything before, the new characters have abilities that offer new and exciting gameplay impossible to perform previously, and the game can support a lot more interactions. Last but not least, it is way more generous with its premium currency compared to the first game, with daily log-ins alone providing you with 100 diamonds per week, in addition to events, the daily chest potential, a battle pass that's completely free and the diamonds obtained by leveling up gods, you are gathering currency at a great pace, guaranteeing you to gain your favorite skins even as a free to play.\n\n\nAs of now, the game has a steady update ratio of once per two weeks with smaller tweaks in between them, offering a new god alongside multiple gameplay enhancements and new cosmetics and features. As the game is still in Beta with a constant flow of new content being added almost weekly, expect a lot of bugs to occur, however the team is hotfixing them at a steady pace alongside implementing optimizations for better performance even between the patches. The game is far from finished, with some characters from the original game not being ported yet, extra animations such as death animations missing or advanced social features being absent, but the developers are working on it at a steady, and honestly quite rapid pace. In comparison to its state roughly one year ago, the difference is massive and the work put shows. That being said, the game is only continuing to improve and adds content in a great pace, so if you're looking for a fun game to play with friends or a unique MOBA experience that is closer to traditional 3rd person games, or even if you're a mythology fan and looking for a game to take out your fantasy of gods like Zeus, Ra, Thor, Amaterasu and Wukong clashing together in an arena, this is the game for you, give it a go, you'll quickly realize how fun it is and how good each individual god feels to play. Have fun, and see you on the battlefield.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall, I can say its going in the right direction. During alpha I was worried. On one hand, they never delivered on the style they showed in trailers, but that's mostly because players whined about things looked. They are still whining, but Hi-Rez is learning fast not to listen to steam community forums as a source of information.\n\nSo lets get to it, shall we?\n\nStory: Maybe I need a better review format for MOBAs. Lets swap this too... Cohesion? Strategy? Vision?\n\nVision: Hi-Rez is following the standard MOBA format. 3 lanes, 5 roles, 2 teams. Like League and Dota 2, it has a rough jungle, primary objectives, and secondary impactful objectives. Overall, they hit the bare minimum. Since earlier this year to now, it has seen steady improvement. I will always say Smite and Smite 2's jungle feels just... massive. Compared to League, Dota 2, Predecessor, hell even the dead Heroes of the Storm, the distance between lanes feels enormous. Most junglers have decent speed though, so it makes up for it. As far as gods are concerned, each lane has its ups and downs. With a new god every 2 weeks, it feels fresh enough that no lane is particularly boring (I say this having fought for my life to never take jungle). Some gods are... well... awful, but many people look past that and still play them because they are fun and edgy (tsuki, jorm, nemesis). Otherwise, the game is shaping up better than I expected. There was a rough patch at the start that I truly thought it was going to just collapse.\n\n7/10 (You will get more if you can keep the game from collapsing by the time all gods are back)\n\nGraphics: They had a plan, a vision. They made them newer, but what I was promised, what I saw over a year ago.... not here. Bellona's release skin's face is so bad its horrifying. The skins and animations they choose at times just do no resonate or make sense to me. I'm fairly certain Nu Wa has 4 bunny skins, all different enough to actually call them separate skins. Some skills and animations are significantly better. Eset and Daji feel and look amazing. The update to Cupid is fantastic. But oh lord, they promised me beauty and gave me hi-res Hi-rez.\n\n6/10\n\nMusic: Its fine. Its a MOBA. Some sound epic and this one, I can say I probably mute it more than I listen to it. I need to listen for the footsteps.\n\n5/10\n\nCombat: Yes and no. So agility relic (as of writing this) has a 20 second CD, thats significantly better what I think was 10s before? But I hate it. Gods that a naturally immobile get a little too much out of it if they know they can, even at 20s. It doesn't seem to improve combat or change combat in any meaningful way other than for people to run away, which is the exact reason combat blink was removed (so people couldn't be cowards). It kinda falls into the same issue as healing. Fight, run away, heal up, repeat. They addressed healing in a good way, removing a lot of its power, but also removing quick investments to get rid of it, but agility relic just makes it a budget combat blink that people will buy if they can justify it due to how strong it is when it is a good choice for the match.\n3/10 (if agility relic is present), 7/10 if its not.\n\nSystems: Match store looks good, the ability to pin and share builds is huge. UI isn't horrible, and I am not kicked out of a match but still in it so can't queue like Smite used to do.... for years. However, the store for cosmetics is still awful, and I dislike the entire approach.\n8/10\n\nOverall: 6.6/10 so it passes the recommend check. If we completely ignore agility relic. I do feel like its gone in a great direction since Smite 1, and can continue, but I can't predict what Hi-Rez will do, and hopefully it will be meaningful. Because if not, then, why would I continue playing it?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I genuinely think this is a great game that has expanded on the previous title. Hi-Rez has been going through some monumental changes within their organization. Their failed attempts to expand their brand through other titles without cementing their staple franchise (smite) has completely blown up in their face. This collapse is marked by this games transition to open beta.\n\nNow we arrive at today. More the past few months/past year, the transparency of the development team alone should be a reason to check out this game. As time marches forward Hi-Rez will have another chance, albeit not as large of a chance when they went open beta, to attract new players and have players return. The dev team listens to their audience. This game is still in open beta, the dev team are actively exploring options with balancing and gameplay ideas by collecting match data. When they finally have their next chance to expose this game to a greater audience they will succeed for they are listening to you. Which begs the question, are you willing to help them create a masterpiece?\n\nThis game is easily the best MOBA on the market.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still in the beta phase but a fun game. Love seeing the new updates to kits and aspects (alternate abilities) for old gods. Keeps the game fresh.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As of right now, this is the most fun I've had playing Smite since like S2 of the first game. It's just kinda bonkers stupid fun (at least in joust, haven't played the other modes much)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "SMITE 1 was one of my most played games of all time, and i can definitely say that me and my friends had a blast the entire time. \n\nUnfortunately, SMITE 2 feels like an empty shell. I know it is in early development stages currently, but I cant get over that feeling wit there being a drastic cut in the amount of characters that are currently playable. Most of my favorite/most played gods are unavailable in SMITE 2 and it is very disappointing. Them adding one new character every 2 weeks without some kind of roadmap leaves me feeling let down when I see characters like Artio coming before someone like He Bo or Hera. Hell even Set would make me happier. But I get that they need to introduce the characters slowly to keep hype up when a new one is added. \n\nThe gameplay is fun and I actually like the addition of aspects. Some of them are strong and allow you to play off-role with some actual benefit. I almost always have a good time when I am playing with friends or using in-game voice chat to set up a gank or just to have comms, so I cant complain about gameplay. \n\nBut thank god I stopped caring about having cosmetics in games. Some of the stuff they do with the travelers/sagas is just ridiculous. You pay $50 for one skin that has 4-5 different recolors, and I am just not a fan of that. I would be much happier with getting 3-4 cool skins for different gods at the same price point, instead of one cool skin that comes in blue, green, red, and purple. \n\nWith all that being said I do highly recommend this game. It has its flaws of course, but it will never become a great game if people don't give it a chance. If you didn't come from SMITE 1 you won't be missing out on the 70 or so characters that are currently waiting to be added. But god I am getting tired of playing the same characters over and over.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Smite has never been a perfect game, and that's alright. But, honestly, I think Smite 2 is a good direction for the future. Looking at a lot of these negative reviews, it's hard to think that these people are thinking rationally and actually trying to criticize Smite 2. Make of that what you will.\r\n\r\nOverall, Smite 2 is quite good for how turbulent it's development has been. Hi-Rez feels like it should be a shell of it's former self, but I'm honestly astounded with how much quality content they put out on a regular basis. The game itself is fun, if you like mythology, there's plenty of that here for you, and it's an absolute blast to play with friends, if you all really get into it.\r\n\r\nSmite has been a huge part of my life the last few years, and genuinely, I want this game to succeed and become the best it can be. Don't listen to the negative reviews unless they have valid criticisms, and just give the game a try. I think there's something for everyone to enjoy here! Thanks for reading, and have a nice day!\r\n\r\n(Also, if the devs somehow see this, keep up the good work, there are lots of players who actually appreciate your work!)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My game has bugged out two times  i get a deserter for 20 minutes for no GOD DAMN FUCKING REASON and it just shows connecting with a blank screen always some random ass bug, Smite 2 is dogshit compared to smite 1 and thats facts fuck hi-rez. Xian tian is better then your favorite god, still recommend because smite is fun but god shit sucks some times.Play smite 1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's not as good a smite 1 yet. But it's being actively worked on, with new gods coming out regularly. Game runs smooth and is quite enjoyable for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just give it a try or be patient as updates keep coming, best moba out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has come a long way from where it started. Hi-Rez took their loss and have been working to make this game better since. At it's currant state I enjoy it more than Smite 1, and the game just looks 100x better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The makings of a great game are here if the dev team can work out all the bugs, some of which at the time of my writing this review have been getting more frequent but with signs they are working on them. The graphics are good, the heroes if not always \"accurate\" are at least in spirit well done and most are fun to play. If some more work is done on all aspects of play and not just ranked modes this should be well received and keep players engaged for many years.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the alpha dropped and it wasnt that great in all honesty, but with the recent updates and additions to the roster, items, aspects. the game feels AMAZING (if you have a good team)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Potential for greatness, but also great potential for another gaming heartbreak. Hoping the Devs stay the course to the former.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don’t trust a lot of these reviews. This game got a bad wrap early but now it is fantastic. Way more relatability than smite 1 with all new build pathways and the aspect system. The graphics are better, the performance is now better etc. \n\nFantastic game. It should be 10x the player base imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who never really played smite 1 and has never been really into Mobas this game changed my mind. This game not only looks better and better every patch but the rate they are putting out gods is astounding. They have made the new player experience infinatly better than it was just a year ago and the match making is also so much better. \n\nIf you have never played a moba before this is a great game to get your feet wet. Also they are constantly updating and improving this game so if you played this game a year ago you need to give it another chance because it is leaps and bounds better. \n\nPeople who played smite 1 will always have nostalgia for it but people need to realize how much better smite 2 is than smite 1 even by just graphics alone! Try out the game i promise you will not regret it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very Beginner friendly! As a returning Smite 1 and Smite 2 Alpha player, I am very glad to see how the state of the game is currently.  A lot of issues players were having with Smite 2 have mostly been addressed and fixed. The game is starting to fill the nostalgic hole that was made from the end of Smite 1's life cycle. I am currently enjoying it a lot right now and hope others give it a try!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun game. It's missing a lot from Smite 1 though. But its beta so they are readding stuff at a fast rate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excuse any typos since there's probably some in the rant I wrote below.\r\n\r\nI've played it since the Alpha. Since then the game has gotten so much better. It'd be fallacious to say otherwise. We didn't use to have dedicated consumable slots, couldn't pick a relic (everyone had only beads), various lighting, visual, and performance updates, etc.\r\n\r\nI was skeptical of the tank changes to enable high HP or high PROT styles, but I can say that they do work better than before. Played a full PROT game as Chaac the other day in Arena and got 160k mitigated with a positive KDA. Tanks are definitely still a thing, even with the lower stats on items.\r\n\r\nWith the addition of a god every 2w it's likely that all gods won't be in the game until 2027. A hard launch date hasn't been confirmed, but it's likely that late 2026 or further in the future is when it will be fully launched for Season 1.\r\n\r\nThe game has some pros and cons to SMITE 1. I definitely know most of my friends who play this game only really care about it being as 1:1 with SMITE 1, but we all know that simply will never be the case, and is pretty restrictive on the game continuing to develop.\r\n\r\nThe biggest con right now is the god selection, but, again, that will simply be taken of over time. \r\n\r\nCurrently the biggest issue I have with the game is the smaller item pool. Speaking about starters, there obviously will be more added as they have confirmed that branching starters will be coming back in Titan Talks. With respect to normal items: I wish there were more simple stat sticks like Sphere of Negation (just INT and MAG PROT). As it stands they have tried to make almost all items in the game specific as a counter, like the Contagion rework, which largely works, but a simple item build would work much better IMO. The whole \"oh you want CDR so you have to sacrifice this tanky thing\" does kind of make it annoying. For instance: a full HP build (over 5k HP) likely wont have more than 20 CDR (~ 18% CDR), whereas a full PROT tank can easily have 65 CDR (~ 40% CDR). This basically forces some gods to not be viable full HP wise unless their passives counter the CDR problem. Also some tank's abilities scale with PROT so you are incentivized to do so. The best example I can give is Sylvannus' passive giving him passive CDR reduction per seed collected, so he can play high HP builds. Bacchus' flop scales with PROT so he is disadvantaged playing high HP. The way the tank items are constructed enforce most tanks to play very specific builds or always pick items like Draconic Scale (high HP and really high PROT that comes with PROT scaling on its passive). Regarding squishies (jungle/adc/mage) this isn't really an issue. Those gods have obviously preferred play styles with those styles favoring hybrid or non-hybrid power items respectively.\r\n\r\nI'm overall not a fan of actives, but I can understand the reasoning for it, especially in ranked/Conquest. Still wish Meditation Cloak was a relic and not an active item that has moderate stats. Kind of weird that it is specific to Assault as a curio and not all the game modes. Most casuals are 100% against actives. Personally, I wish they weren't in the game simply to make the game \"easier/simpler\" seeing as most controller players don't even remember they have them or have the buttons to do so.\r\n\r\nDefinitely a fan of Aspects. Having a way to fundamentally make a support/tank become totally DMG focused is a great change of pace. The Eset tank/healer/shield aspect is amazing (by far my favorite aspect in the game), just as Sylv's ADC aspect is just as cracked. Some are just downright horrible - looking at you Sobek aspect (universally agreed as the most retarded aspect by the community). Overall, most are pretty good though like Ra, Eset, Sylv, Osiris, Thor, etc. They genuinely do add more playstyles to the game.\r\n\r\nThere are still some horribly unbalanced gods (ATM mainly Xbal or Tsuk) so that's also an issue. However, the team has continued to nerf them and Xbal is largely the only big issue RN. Him being able to deal 1300 DMG by hitting one ability mid game is just way too high. This compounded by the CC Immune escape and blinding ult (with buffs on top of it) simply make him the biggest threat in every game I play (squishy and tank alike).\r\n\r\nRegarding skins/graphics of the gods there are some that obviously got waaay more attention than others. If you compare the normal Eset skin to Shadow-skin Cerberus the level of detail is trivially obvious. Eset looks like play dough compared to that skin. Many other characters have this smoothness to them, which I believe is largely due to UE5. Personally, it doesn't bother me to a great degree, since you can't really see that level of detail while playing the game - you can only really see that level of detail in the summary or god builder screen. Hopefully the models are somewhat updated overtime, but as it stands RN most look fairly rubbery (Bacchus main skin for example). I will say though that most of the ported over gods do have more detail in their design as compared to SMITE 1, it's just that the \"flatness\" is noticeable in many. Again, some skins are amazing, like the Shadow or Radian versions of gods.\r\n\r\nMatchmaking seems to still be somewhat of an issue, but I'd say this is likely an issue with accurately defining ELO/MMR to any player. I constantly get matched with people who sometimes don't even know you can buy items, skip buying a starter (even though it has a dedicate item slot in SMITE 2), just 1v3 or 1v5 the whole game, etc. The general skill gap in the gap is very apparent, especially in non-ranked Conquest game modes. Looking back at most of my matches, it's like 1/3 of games are surrenders because 1 or 2 people simply are so much worse at the game that it's impossible to carry someone potentially feeding as hard as they are. It really is that high. I don't think this is anywhere near an accurate representation for all game modes, but I'd say it is for Arena.\r\n\r\nI'm someone who spends most of their time playing Arena/Joust and utterly can't stand Conquest (too slow), but I did play a good amount of Siege/Slash in SMITE 1. So, the \"randoms are trash\" meme is something I encounter so much I could honestly make skits out of it if I cared to record more of my games. I do record about a fifth of my games and have like 100 or so to be uploaded to my YT (just honestly haven't cared enough to upload them).\r\n\r\nOverall, this game continues to get better in my view. There are some obvious weak points, as I've just outlined, but the game is still largely enjoyable. It will continue to get better if it stays on its current path. IMO it is already better than SMITE 1 even with the current limitations (gods and items mostly), though the community seems pretty 50:50 split on which one they prefer. Currently SMITE 1 has about 1/5 as many online players as the 2nd one, which should be evidence enough of which game is better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Smite 2 is a great improvement of Smite! If you liked the first Smite and love rpg's and moba's this is the game for you. If you like casual play arena and joust are great gamemodes to introduce you to Smite 2. And comp play is just as fun if you know your builds and have good game sense. the devs are constantly balancing and improving the game. So is only ganna get better from here1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is way better than Smite 1 was for the last few years. People just don't like that it's different. It has also gotten SIGNIFICANTLY better over the course of one year.\n\nStill missing a lot of gods but they are being ported over incredibly fast. Most of the systems in the game make a lot more sense and the devs are a lot more attentive to feedback and fix things faster than they ever did in OG Smite. (Not without faults though- They do need to take care of a few bad changes though like remove the agility relic, wind sprites, and bring back some form of anti-heal).\n\n Unfortunately Hi-Rez suffers from higher-ups that have zero braincells and no idea what they're doing, but the developers are working really hard to make the game good and I think they have done an amazing job given the limited resources they have. Hopefully Hi-Rez just doesn't make the same mistakes they did in the past, and actually invest in the one successful game they have rather than starting a dozen failing side projects.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has a toxic community but if you like MOBA games and are a competitive player this game suits you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They're making good progress and adding a god from Smite 1 every other Tuesday.  If you gave the early alpha or even the early beta a try and didn't like it you should give it another shot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game filled with cosmetic slop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing smite since 2014, this game will always be a game i come back to, to enjoy with the guys i grew up with playing, I'll never get bored of this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game keeps getting better almost every update",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dont play unless you want to play for endless hours of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved smite. I don't mind the new change to the buy system. I do prefer the old system. \r\nI don't like how you have to unlock the colorful skins of the base skin you just unlocked. \r\nalso what is the point of the legacy gems???????",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As someone that played smite in the past almost everyday on the console, I have to say smite 2 is a huge upgrade to smite 1, tho its not perfect, it has a huge future, I cant wait to see what items gets released in the store and the gods that wil come to smite 2, I love this game allot and I feel like to many people complain about it, so I want to say keep up the good work on this awsome game,  smite 2 might be new, but it has promise and the aspects are great as well, the way I see it some aspects needs a bit of work but I love the way you can build any item you want on any god as well, thanks for reading this and I feel like this game can go far.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Prerry fun overall. But the balace leaves something to be desired",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game can't wait for all the stuff from smite 1 to be put in!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game to play while Deadlock is downloading",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun requires thinking and teamwork if your not into that than this game might not be for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive been a fan of the franchise for a while love the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dunja Cobanovic je najbolja picka ikad jeo bi joj noge",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "milk also bot players dont even text in chat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "smite 1 with better graphics",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have played SMITE 1 for at least half of my life, SMITE 2 feels like a breath of fresh air, great for new people but just as competitive for people who have been playing for ages, it feels like a more polished game as therefore will hopefully have a better chance than SMITE 1  which if you go back and play is a whole different game, the movement is different and feels as though all gods 1 shot. I hope HI-REZ learn from their mistakes and dont turn this into a pay to win game and really focus on view interactions, <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They finally added me mains so yah I do recommend\n\nNow I look forward to play my mains in SMITE 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Suprisingly better than SMITE just because of new engine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun, smite 1 better tough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a game, and you can play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just wanted the stupid Do you recommend notif to go away.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Let's face it, Hi-Rez is not doing well. Restructurings, layoffs, pulling the plug on essentially all their games and barely keeping them alive to scrap some leftover pennies from sporadic new players - it doesn't sound good.\n\nThey decided to go all in on Smite 2, but for some reason, they thought having anti-cosumer practices that insult your intelligence was the way to go.\n\nThese guys pulled an Overwatch and killed their first game under the pretense they'd bring a new, more polished version of it. They didn't. This game, while somewhat visually more appealing, has been tweaked in the worst ways possible. And the best? It's the greediest, most revolting, insulting and obnoxious cash grab ever that makes AI generated hentai gacha games seem dignified triple A games.\n\nThese are the guys selling you 3 different version of their game, with the difference between the $29,99 and the $99,99 version (yes, there's a $100 version for a crappier version of SMITE 1, which in itself was a crappier version of LoL) are two skins and a boost for God passes. That's it. Two skins, and a boost, for dumb little you. No need to thank them! They do it from the goodness of their heart. <3\n\nAnd you read that right - PASSES. These guys have BATTLE PASSES for each individual CHAMPION, each costing $10 each, in a rooster of 50 gods, the vast majority of which are just HD versions of SMITE 1 gods, for which you have no skins even if you played SMITE 1. And it doesn't end here. Now there's the WaNdErInG MaRkEt which are basically CLUSTERS OF BATTLEPASSES each costing $10 as well. Don't you get the hint, you stubby ball of lard? GIVE THEM YOUR MONEY. God. You're so dense!\n\nThere's not 1 or 2 battle passes, but about 6, offering MINIMAL content. They broke down ONE battlepass into SIX, and charged $10 for each piece. Like ordering a carbonara, and being charged the price of the dish for each component - $10 for the spaghetti, $10 for the bacon, $10 for the cheese, etc. in what's a capitalist's explosive wet dream. And hey, be happy there's no minimum-wage service associated! At least here you don't need to give a compulsory +350% tip to your gaming-waitress!\n\nAnd it doesn't end here. Progress is AWFUL. YOU WON'T MAKE IT WITHOUT LEVEL AND WORSHIPPER BOOSTS WHICH, you guessed it, you can buy by unit with real money as well. You'll be shoving an extra $10-$15 just to actually get somewhere. Just GIVE THEM MONEY, TIMMY, GOD. Throw your wallet against the screen or something, but HURRY up.\n\n\"B-but you can play the base game for free!!!\" my guy there are SO many player-friendly games out there that offer you SO MUCH MORE hard-worked and polished content for free. Even the dreaded Overwatch 2 currently does. Hi-Rez is trying to push the boundaries of consumerism and lack of critical thinking from buyers to try and desperately suck up to their stockholders. And the game is not the cash cow: YOU are.\n\nTHE CHERRY ON TOP:\n\nTHIS ISN'T THE FINISHED PRODUCT, OF A WHAT'S ALREADY A REFURBISHED PRODUCT. It's a Beta. It's not even the final version, of their watered-down SMITE 1, which is in itself a watered-down version of LoL. \"B-but future updates!!\" WHAT future updates? Besides all this, you're charging 20 BUCKS FOR SKINS IN THE B E T A.\n\nAND YOU PULLED THE PLUG ON PALADINS AND SMITE - YOUR PLAYERS AREN'T EVEN PURCHASING SAFELY BECAUSE WHO KNOWS IF YOU'LL PULL THE PLUG ON SMITE 2 AS WELL. I mean, IT HAPPENED WITH EVERY OTHER GAME?\n\nLet me close this off with something clear. If you invest in this game, you're a cretin devoid of critical thinking. You're a drooling fool, choosing to be spoon fed poop because the poop is adorned with glitter. These guys are pulling a \"players need to be comfortable not owning their games\" on you. There are so many quality games and companies out there - if you shove a single penny into this game, you're a submissive scatophiliac and an embarrassment to your ancestors and your bloodline.",
      "voted_up": false,
      "votes_helpful": 438
    },
    {
      "review": "I could live a thousand lifetimes and not achieve this level of incompetence\n\"Let's make tanks useless, redo our items for no reason, make people pay twice for skins, and buff the strongest thing in this game even more! We love autos!\"\nHunter: Hits you once. You, someone with 2k health gets hit with 1k dmg. They fire 2.5 autos per second. Fun! Fair! Balanced! WOOOOOW\nThey thought of everything they did right in Smite 1 then did the opposite.\nThe balancing is somehow so much worse. Tanks don't exist, auto attackers (the most skillless part of the ame are the strongest), and the items are kinda fucky. Why have balancing decisions when you can just throw darts at the board right?)\nAlso having people pay for skins they already owned is crazy. Either give them the skins or don't have the old skins in the game, it is disrespectful.",
      "voted_up": false,
      "votes_helpful": 107
    },
    {
      "review": "Unfortunately this game is nowhere near its father smite 1 now that was a goated game. I know Hi rez has suffered from a significant loss of staff due to the smart decisions of their own making but this game is poop. Most days it feels like hi rez has outsourced their game balancing to overseas. Broken dumb aspects keep getting released that make the game very unfun but then they leave other aspects in the dust. Compare Osiris aspect to Hecate aspect and tell me they are made equal. The skill of the average smite player has also gone down a lot in smite 2. There are people in masters+ that really should be in bronze and that happens more often than not. The game in turn has gotten a little stale but hi rez instead of doing something about it blame the player count decline on back to school lol. Its not that horrible of a game but I will stand by the statement of its the worst game in the moba genre. Download at your own risk...",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "Honestly, this game sucks a$$. No balanceness, dead community, stupid decision making. I prefer smite 1 over this piece of junk. You can not play for fun, you can not try out builds. If you don't play something else than meta, might as well just not play at all. UI is bugged. I only play this game with some friends of mine but after the first 2 games we all want to fking ctrl alt delete. No, do not play this game. You will regret it.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Unfortunately not a very good sequel, if you could even call it that. I am baffled at the fact they released this considering almost every single aspect of the game is worse than SMITE 1. \nIf they fix the performance (I am lagging at low graphics on my RTX 3070), release all the gods from SMITE 1 (as they should have at release), balance items and make them feel more impactful, give more rewards for playing the game other than currency that doesn't do anything, overhaul some very annoying interfaces (shops, scoreboard in-game, there is no way to see your detailed stats (which SMITE 1 did with critrate and cooldownrate), give players more agency on what they want to see and hear in-game (I hate loud dubstep skins, let me turn that off client-side, other games do this), then maybe we are looking at something good.\n\nThe list of changes they need to do is too big for them to achieve in the current climate, considering all news surrounding the developers is bad. While I would like to see this game flourish, as it scratches an itch no games really do for me (Deadlock came close),  I also want to see this company fail after years and years of promises they never kept. This company's like 20 years old but with lack of quality in their games and the awful decisions made even outside their games, you could easily mistake them for total amateurs (which they are).\n\nThey shrimply should've kept SMITE 1 up as is, and release a SMITE MMO style game like the playerbase wanted. They experimented with this in a gamemode and it was fun, yet they never really did anything with it. But that's a very typical thing for Hi-Rez. Instead, they keep copying the current hype/trend, bringing the games out long after the hype already died, and then wondering why their games died (remember Hand of the Gods, Realm Royale, Divine Knockout, Smite Blitz, Paladins Strike?) I won't mention Tribes here, as it was something new and experimental, and arguably their only good game.\n\nI'd like to keep playing this game, but since I maxed out the battlepass this season, I get absolutely 0 rewards for playing, not even from dailies, so the drive to play simply does not exist. \n\nAs it stands right now, I could and will never recommend this game to anyone in its current state, and I don't expect this opinion to change, as I've seen this company's steady decline for over a decade now. It's a game that managed to kill its predecessor, Paladins, and hopefully the entire company that created it.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "Advice from a washed awilix main that's been playing Smite 1 since beta, rather than just sit and complain I figure it's better to be constructive.. So.. Here's what smite2 needs to do:\n\n-Consider \"time to kill\" as a stat, and make sure that you test all gods/items, their healing rate, their tankiness and emulate the same \"time to kill\" for as many gods as possible to their smite1 counterparts. It feels awful playing a burst down assassin that can't even damage 1/3rd of the health of a mage that's built full dps, while investing a full kit rotation including ult.\n\n-Get your marketing team to simplify and explain the value of legacy gems, and how easy it is to get the diamonds to afford any skin from the legacy system, a matter of playing less than a week has gotten me all of the skins I wanted for free. The sheer volume of players complaining at how \"they need to buy skins again\" is crazy.\n\n- Focus on releasing gods from smite1, I suspect a significant chunk of your player base is waiting for their main to be released. New gods are CLEARLY not bringing players back to your game right now, stop wasting resources on them and put your entire team on releasing gods from smite1.\n\nYou still have a chance to right the ship guys..",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Yeesh, where do I start?\n\nLet's start with the menu UI in this game. From the title screen, Item Builder, picking gods in any mode, and in-game HUD are either completely broken or are the least intuitive I have ever seen. God forbid you use a controller.  \n\nTrying to use Item Builder is an absolute nightmare.  Picking gods don't even work half the time and the in-game HUD is riddled with glitches that revert to default half the time for no reason. Sometimes the controls will switch to inverted and you can't reset it unless you leave the game. Picking gods with a controller hardly even works; many times my friends or I have to lock in a god because the game just decides to not let us re-roll or just has a mind of its own.  \n\nIt's like they intended to make things as overcomplicated as possible to navigate through the game.  These glitches and issues really are a simple fix but they just don't care enough, I guess. Any amateur dev coming out of school could fix these issues, or look at some of the decisions they've made and go, \"hmm, that doesn't make any sense. Let's fix that.\"\n\nTo elaborate, there are a lot of smaller decisions that I have a hard time believing aren't in the game. For example, why can't I see the mana I'll spend if I'm using Quick Cast? Smite 1 shows the mana you're about to use when holding an ability. Seems like such an obvious quality of life thing to have, y'know?  I have sent feedback about things like this from the game's release, but they don't seem to even read feeback given.\n\nThe audio is just half-baked. Too many games my friends and I play, where one of us doesn't have audio, or like we're swimming in water; furthermore, audio like Vulcan's ult doesn't always work. Sometimes you just see the area and get hit from it, which could be avoided if the audio always worked. \n\nThe visual effects of god abilities are getting better, but are still not there yet. \n\nSmite 1 had some balancing issues, of course, but their solution to making a more balanced game is...making more build options and Aspects available to all gods with no structure, where there are more possibilities for broken builds and combinations? Really? This decision really crushed Smite's identity. Smite 1 you feel like a tank when you're a tank, and a mage when you're a mage. It's too muddled in this game and creates way too many balancing issues. \n\nAn example of this is Yemoja doing massive damage with an attack speed build, or Poseidon's ult having an 8-10 second cooldown with a cooldown build with World Stone (because, y'know, they didn't cap cooldown, it's only got diminshing returns).\n\nCurrently, damage is king on almost everyone and it's very obvious. Not to mention lifesteal, since, y'know, they removed anti-heal.\n\n Aspects make the game less new player-friendly.\n\nThe actual gameplay is no where near the polish it should be for competitive or even casual play. Relics, like Beads, will be consumed but sometimes they won't work? It's rare, but Smite 1 never had this issue.  Same with some god abilties. Sometimes you'll use an ability and it'll use your cooldown and sound like it comes out (Like Cernnunos' 2), but just seemingly disappears. You won't be cancelled out of it either, and this still happens.\n\nSince there's no build structure or real identity to gods, the god scaling is completely out of whack.\n\nHunter basic attacks are extremely inconsistent, and unfriendly to controller players. For example, sometimes the projectiles are in sync with the god throwing animation and sometimes they're way too delayed--you can see the throwing animation finish well before the projectile comes out but then sometimes will work fine. And where is the item that increases projectile velocity? It was very valuable and controller friendly, but that's no where in sight.\n\nFrames still drop when there are too many abilities at once and I've got a 4080 with a 7800x3d and same for my friends, who are on Xbox.\n\nAs to my personal gripe, there's no ranked Joust. That was the main reason why I played Smite 1 alone and it's gone.\n\nIn conclusion, since the devs are prioritising releasing Gods for potential skin money over ANY of the above, which could so obviously be fixed easily, do not get yet.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Jesus christ they ruined the game, the main menu ui is horrendous, the constant bombardment of trying to get you to pay for stuff, having to reunlock beloved characters that I had day 1 in SMITE (really fckin ymir is locked?????). the ue5 upgrade doesnt even look that good to me, prefer smite 1 graphics\nstick to smite 1, avoid this awful cashgrab (until they eventually shut it down)\nThey also expect me to rebuy the god pack? and i lose all my skins and progress from the first game??? jog on hi-rez",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Smite 2 is a failed attempt at a sequel, the original Smite is so much better somehow.\n\nSmite 2 seems to have lost more features than gained.\nThe item shops look and feel more clunky.\nThe main menu interface looks like a mobile game.\nSomehow seeing abilities and hearing sound cues are more difficult in this game.\nThe screen feels more congested and overwhelming.\nNo antiheal is an awful idea.\nNo multiqueue???\nMatchmaking is awful.\nCant get mastery skins with earned favour, so you play for the worshippers and grind the god, for the skins to be behind a paywall.\nThe new item system is just a rip off from League of Legends, and it just feels awful, and its all clunky.\n\n\nThe visuals just dont look good, like there was no reason for a new engine for an arcadey game.\nAnd obviously the monetization is just a bit grim, what was even the point of legacy gems\n\nSome positives however:\nThe ability to bench gods in assault.\nGiving med to everyone on assault (even though you lose the second relic anyway)\nThe concept of Aspects are cool, however some are useless, and some are also miniscule compared to others.\n\nPlenty more notes to make on the game but overall its just not a good experience, fun with friends like every other game on the planet.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This text was made by Dasha, i agree with it so i post it again. Period.\n\nLet's face it, Hi-Rez is not doing well. Restructurings, layoffs, pulling the plug on essentially all their games and barely keeping them alive to scrap some leftover pennies from sporadic new players - it doesn't sound good.\n\nThey decided to go all in on Smite 2, but for some reason, they thought having anti-cosumer practices that insult your intelligence was the way to go.\n\nThese guys pulled an Overwatch and killed their first game under the pretense they'd bring a new, more polished version of it. They didn't. This game, while somewhat visually more appealing, has been tweaked in the worst ways possible. And the best? It's the greediest, most revolting, insulting and obnoxious cash grab ever that makes AI generated hentai gacha games seem dignified triple A games.\n\nThese are the guys selling you 3 different version of their game, with the difference between the $29,99 and the $99,99 version (yes, there's a $100 version for a crappier version of SMITE 1, which in itself was a crappier version of LoL) are two skins and a boost for God passes. That's it. Two skins, and a boost, for dumb little you. No need to thank them! They do it from the goodness of their heart. <3\n\nAnd you read that right - PASSES. These guys have BATTLE PASSES for each individual CHAMPION, each costing $10 each, in a rooster of 50 gods, the vast majority of which are just HD versions of SMITE 1 gods, for which you have no skins even if you played SMITE 1. And it doesn't end here. Now there's the WaNdErInG MaRkEt which are basically CLUSTERS OF BATTLEPASSES each costing $10 as well. Don't you get the hint, you stubby ball of lard? GIVE THEM YOUR MONEY. God. You're so dense!\n\nThere's not 1 or 2 battle passes, but about 6, offering MINIMAL content. They broke down ONE battlepass into SIX, and charged $10 for each piece. Like ordering a carbonara, and being charged the price of the dish for each component - $10 for the spaghetti, $10 for the bacon, $10 for the cheese, etc. in what's a capitalist's explosive wet dream. And hey, be happy there's no minimum-wage service associated! At least here you don't need to give a compulsory +350% tip to your gaming-waitress!\n\nAnd it doesn't end here. Progress is AWFUL. YOU WON'T MAKE IT WITHOUT LEVEL AND WORSHIPPER BOOSTS WHICH, you guessed it, you can buy by unit with real money as well. You'll be shoving an extra $10-$15 just to actually get somewhere. Just GIVE THEM MONEY, TIMMY, GOD. Throw your wallet against the screen or something, but HURRY up.\n\n\"B-but you can play the base game for free!!!\" my guy there are SO many player-friendly games out there that offer you SO MUCH MORE hard-worked and polished content for free. Even the dreaded Overwatch 2 currently does. Hi-Rez is trying to push the boundaries of consumerism and lack of critical thinking from buyers to try and desperately suck up to their stockholders. And the game is not the cash cow: YOU are.\n\nTHE CHERRY ON TOP:\n\nTHIS ISN'T THE FINISHED PRODUCT, OF A WHAT'S ALREADY A REFURBISHED PRODUCT. It's a Beta. It's not even the final version, of their watered-down SMITE 1, which is in itself a watered-down version of LoL. \"B-but future updates!!\" WHAT future updates? Besides all this, you're charging 20 BUCKS FOR SKINS IN THE B E T A.\n\nAND YOU PULLED THE PLUG ON PALADINS AND SMITE - YOUR PLAYERS AREN'T EVEN PURCHASING SAFELY BECAUSE WHO KNOWS IF YOU'LL PULL THE PLUG ON SMITE 2 AS WELL. I mean, IT HAPPENED WITH EVERY OTHER GAME?\n\nLet me close this off with something clear. If you invest in this game, you're a cretin devoid of critical thinking. You're a drooling fool, choosing to be spoon fed poop because the poop is adorned with glitter. These guys are pulling a \"players need to be comfortable not owning their games\" on you. There are so many quality games and companies out there - if you shove a single penny into this game, you're a submissive scatophiliac and an embarrassment to your ancestors and your bloodline.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Match making sucks and the community is toxic. Go play a better game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Doesn't have Morgan Le Fay.\r\n\r\nAlso, monetization in this game is very predatory. \r\nQuickplay is basically a bot lobby without being able to manually build your character.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "SMITE is HOSTLE to new players:\nI constantly lose to AI bots (in medium mode) even when I personally have the highest KDA and kills.\nSMITE rigs the game so my AI team under performs (with negative KDA) for me to lose, even when I play better than any of the AI.\nIt is no fun to play and lose because SIMTE  just wants you to lose.\nI have reported this dozens of times to SMITE with no response. But this is no surprise,  SMITE has the worst support of any game I have ever played. They have taken real money from me and will not answer my email or in game request for help.\nMy advice is to look for game that cares.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A slight graphical upgrade that makes you re-buy everything you had from the nearly identical previous game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's literally no reason for this game to exist. I'm a pretty die hard Smite 1 fan, own a bunch of skins and whatnot, played since beta. There is nothing this game does that is worth it existing over Smite 1. The balance is absolutely abysmal. The aspect nonsense and ability rework plus milking the player base for skins they've already bought is wild. Go play another moba, get into Dota 2 or LoL.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Smite but strictly worse. Even though the game has gotten better as time has gone on smite 2 core design likely unchangeable of being \"smite but better.\" has only hurt the game. Smite 2 could been a true upgrade with demanded features like vertically, better movement and more complex kit design. As of now it feels like a seasonal update smite one would have mixed scaling and new items are cool but not enough for the sequel with already will take time to add all smite 1 gods. Despite a engine upgrade the game looks worse than smite 1. Smite 2 big flaw was listening to hard core smite 1 fans rather than taking risks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wow. I tried; it's worse than I could possibly imagine. I tried to ignore the naysayers and give it a chance but it's even worse than they said. Somehow they released a version 2 that was worse than version 1 in about every way. It doesn't even look better despite the engine upgrade. Nope.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I given smite 2 a chance and bought founders edition to get early access and hopefully earn rewards as compensation for getting founder edition and playing before others...They didnt give anything...so if you bought founder edition and purchased your way to support smite 2, they laughed and shit on you. We didnt get anything by it. And i stoped playing because i coudnt earn anything...they removed all events that gives and rewards your playtime. Later i gave it again a chance to come play but i complete games and thats it. No rewards, nothing to boose your will to play. Smite 1 had events for gems, skins, battlepass to earn levels but smite 2 is pathetic. They want your money and they shit in your mouth for supporting them. I wpould never recomment anyone to play smite 2 because its not worth your time. You wont get anything, any rewards, everything you need to buy diamonds that are too expensive to get 1 fucking skin whos in different colors. If you want a game that rewards your time, this isnt that game. This is fully cash grab, they dont care about their players. They want your money and thats it!!!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "15 mins of waiting for arena game and still nothing... Ehh I miss good old smite 1 days with instant queues\nYou wanted new players, but there are literally no new players and old one are quitting the game. Thats sad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to enjoy SMITE 2, but the game feels like a step backward in almost every way. Balance is all over the place  some heroes completely dominate while others feel useless, so most matches end up being one-sided blowouts. Matchmaking doesn't help either; You often get thrown into games with people way above or below your skill level, and it kills any sense of fair competition.\r\n\r\nPerformance is another big issue. Frame drops, random lag spikes, and weird bugs happen far too often for a game that’s supposed to be a major upgrade. On top of that, the community has become incredibly toxic. If you're new or just having an off game, be ready for constant flaming.\r\n\r\nWhat makes it worse is that the devs seem more focused on cosmetics and monetization than fixing core problems. SMITE 2 looks decent, but it doesn’t have the same identity or feel that made the first game special.\r\n\r\nRight now, it just doesn't feel worth playing. I hope it improves, but at this point it’s more frustrating than fun.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Literally just play Smite 1. Way less bloat, sharper gameplay, and features that actually work correctly. Some cool ideas though. Maybe they should stop releasing 10 versions of one skin and actually test the game for a couple of hours to iron out the obvious flaws.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game would probably be fine if there was matchmaking for normal games. As a brand new player my first 10 games, and last, were consistently full of people expecting me to know all the ins and outs of the game. Apparently, you aren't supposed to push in lanes but rather break off and grind the jungle, I dont really get it. But the player base made it clear im not welcome so I Uninstalled. \n\nOnly 2k players for a game that isnt even out yet, and the reviews are pretty bad. This game is DOA.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "10-Year SMITE Veteran – 4,000+ Hours in SMITE 1, 0 Hours in SMITE 2. Here’s Why.\n\nI’ve played SMITE for over a decade.\n\nMore than 7,500–8,000 matches.\nAround 4,000–5,000 hours of my life.\nA god pool built over years.\nMasteries earned.\nSkins earned.\nAn identity built through thousands of games.\n\nI’m not a casual.\nI’m the kind of player that kept SMITE alive during every peak and every drought.\n\nAnd despite all that, SMITE 2 has:\n\n0 matches from me.\n0 hours played.\n0 interest until things are made right.\n\nWhy? Because SMITE 2 erased everything that made SMITE feel like mine.\n\nMy mastery → Gone\n\nMy skins → Mostly gone\n\nMy hours → Meaningless\n\nMy progress → Reset\n\nMy identity as a veteran → Deleted\n\nI didn’t need better graphics.\nI didn’t need a new engine.\nThe game ran fine.\n\nWhat competitive players value most is:\n\nbalance, consistency, and continuity.\n\nSMITE 2 broke all three.\n\nThis isn’t new — other studios have learned this lesson.\n\nLeague didn’t wipe its veterans.\nDota didn’t.\nCounter-Strike never did.\nValorant didn’t.\nEven Bungie eventually admitted Destiny’s “reset” was a mistake.\n\nHi-Rez repeated a mistake the entire industry already learned from.\n\nI’m not asking for freebies. I’m asking for acknowledgment.\n\nTell us the truth:\n\n“We mishandled the transition and we should have respected the legacy of long-term players.”\n\nThat’s it.\n\nVeterans who played for thousands of hours deserve that level of honesty.\n\nLegacy Gems are not enough.\nA few carried-over skins are not enough.\nIgnoring the backbone of your game is not acceptable.\n\n⭐ And now my challenge to Hi-Rez:\n\nRespond here.\nRight here.\nTo this review.\nTo this message.\nTo me.\n\nExplain to your longest-time players why our identity from SMITE 1 had to be reset.\nExplain why our mastery, our hours, our skins, and our progress were treated as disposable.\nExplain why starting from zero was considered acceptable for the people who supported your game for a decade.\n\nYou want SMITE 2 to succeed?\n\nThen talk to the people who gave SMITE 1 its life.\n\nI’m here.\nI’m listening.\nAnd I’m waiting for your answer — publicly, on this post.\n\nUntil then:\n\nSMITE 1: 4,000+ hours.\nSMITE 2: zero.\n\nThat says everything.\n\n**IGN: Fiddle45 — feel free to verify my SMITE 1 account and hours.\n\nI’m not exaggerating. I was in your top 1% of engagement.**",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "How is Tyr still not in the fucking game, it's been a full year. You even have random shit gods that weren't in OG Smite like wtf are we doing. A good bit of people were pissed because you guys couldn't port all of the skins over (lowkey agree with them but I'd rather see gods ported first so I get it) but forget the skins you clowns can't even port the gods over. Like how is Daji only coming in now? Are there only 3 devs or something?\n\nA nice short list of what is missing:\n1 Ah Muzen Cab\n2 Ah Puch\n3 Ao Kuang\n4 Arachne\n5 Artio\n6 Atlas\n7 Baba Yaga\n8 Bakasura (are we serious???)\n9 Bake Jujira\n10 Bastet (still no?)\n11 Camazotz\n12 Cerberus\n13 Chang'e (actually how is this not in yet)\n14 Charon\n15 Charybdis\n16 Chernobog\n17 Chiron\n18 Chronos\n19 Cliodhna\n20 Cthulhu\n21 Cu Chulainn\n22 Discordia\n23 Erlang Shen\n24 Fafnir\n25 Freya\n26 Gilgamesh\n27 Hachiman\n28 He Bo\n29 Heimdallr\n30 Hel\n31 Hera\n32 Horus\n33 Ishtar\n34 Ix Chel\n35 King Arthur\n36 Kumbhakarna\n37 Kuzenbo\n38 Lancelot\n39 Maman Brigitte\n40 Martichoras\n41 Maui\n42 Morgan Le Fay\n43 Ne Zha\n44 Nike\n45 Nox\n46 Nut\n47 Olorun\n48 Persephone\n49 Raijin\n50 Ratatoskr\n51 Ravana\n52 Serqet\n53 Set\n54 Shiva\n55 Skadi\n56 Surtr\n57 Terra\n58 Thoth\n59 Tiamat\n60 Tyr (my favorite btw)\n61 Vamana\n62 Xing Tian\n63 Yu Huang\n64 Zhong Kui\n\nEven if they added one god per week (I think we would be lucky to see one per month) it would take them over a year to even get the game to it's base state. They devs are behind by over a year's worth of content and aren't even trying to catch up.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Impossible to get into, the only people who play it have thousands of hours and will just mop the floor with you and you'll get spammed all game with pings and toxicity. Don't try this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Let's face it, Hi-Rez is not doing well. Restructurings, layoffs, pulling the plug on essentially all their games and barely keeping them alive to scrap some leftover pennies from sporadic new players - it doesn't sound good.\n\nThey decided to go all in on Smite 2, but for some reason, they thought having anti-cosumer practices that insult your intelligence was the way to go.\n\nThese guys pulled an Overwatch and killed their first game under the pretense they'd bring a new, more polished version of it. They didn't. This game, while somewhat visually more appealing, has been tweaked in the worst ways possible. And the best? It's the greediest, most revolting, insulting and obnoxious cash grab ever that makes AI generated hentai gacha games seem dignified triple A games.\n\nThese are the guys selling you 3 different version of their game, with the difference between the $29,99 and the $99,99 version (yes, there's a $100 version for a crappier version of SMITE 1, which in itself was a crappier version of LoL) are two skins and a boost for God passes. That's it. Two skins, and a boost, for dumb little you. No need to thank them! They do it from the goodness of their heart. <3\n\nAnd you read that right - PASSES. These guys have BATTLE PASSES for each individual CHAMPION, each costing $10 each, in a rooster of 50 gods, the vast majority of which are just HD versions of SMITE 1 gods, for which you have no skins even if you played SMITE 1. And it doesn't end here. Now there's the WaNdErInG MaRkEt which are basically CLUSTERS OF BATTLEPASSES each costing $10 as well. Don't you get the hint, you stubby ball of lard? GIVE THEM YOUR MONEY. God. You're so dense!\n\nThere's not 1 or 2 battle passes, but about 6, offering MINIMAL content. They broke down ONE battlepass into SIX, and charged $10 for each piece. Like ordering a carbonara, and being charged the price of the dish for each component - $10 for the spaghetti, $10 for the bacon, $10 for the cheese, etc. in what's a capitalist's explosive wet dream. And hey, be happy there's no minimum-wage service associated! At least here you don't need to give a compulsory +350% tip to your gaming-waitress!\n\nAnd it doesn't end here. Progress is AWFUL. YOU WON'T MAKE IT WITHOUT LEVEL AND WORSHIPPER BOOSTS WHICH, you guessed it, you can buy by unit with real money as well. You'll be shoving an extra $10-$15 just to actually get somewhere. Just GIVE THEM MONEY, TIMMY, GOD. Throw your wallet against the screen or something, but HURRY up.\n\n\"B-but you can play the base game for free!!!\" my guy there are SO many player-friendly games out there that offer you SO MUCH MORE hard-worked and polished content for free. Even the dreaded Overwatch 2 currently does. Hi-Rez is trying to push the boundaries of consumerism and lack of critical thinking from buyers to try and desperately suck up to their stockholders. And the game is not the cash cow: YOU are.\n\nTHE CHERRY ON TOP:\n\nTHIS ISN'T THE FINISHED PRODUCT, OF A WHAT'S ALREADY A REFURBISHED PRODUCT. It's a Beta. It's not even the final version, of their watered-down SMITE 1, which is in itself a watered-down version of LoL. \"B-but future updates!!\" WHAT future updates? Besides all this, you're charging 20 BUCKS FOR SKINS IN THE B E T A.\n\nAND YOU PULLED THE PLUG ON PALADINS AND SMITE - YOUR PLAYERS AREN'T EVEN PURCHASING SAFELY BECAUSE WHO KNOWS IF YOU'LL PULL THE PLUG ON SMITE 2 AS WELL. I mean, IT HAPPENED WITH EVERY OTHER GAME?\n\nLet me close this off with something clear. If you invest in this game, you're a cretin devoid of critical thinking. You're a drooling fool, choosing to be spoon fed poop because the poop is adorned with glitter. These guys are pulling a \"players need to be comfortable not owning their games\" on you. There are so many quality games and companies out there - if you shove a single penny into this game, you're a submissive scatophiliac and an embarrassment to your ancestors and your bloodline.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They released a game on a new engine and now it's a new game? It's the same trick they pulled with Overwatch 2. Apparently, this move will destroy the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "DISAPPOINTMENT\n\nBeen playing Smite 1 since way before it was even on Steam, and I’ve put more money into that game than any other title I’ve ever played.\n\nSmite 2 is a downgrade from a game that was already fun, diverse, and full of life.\nAnd honestly, the most insulting part isn’t even the gameplay changes — it’s how they handled the players who supported them for over a decade.\n\nSmite 1 had years of skins, cosmetics, battle passes, and gem bundles that we poured real money into. That was our investment in a game we believed in. But instead of rewarding that loyalty, Smite 2 basically gives you a pat on the back and a kick in the face.\n\nThey marketed “Legacy Gems” like some kind of compensation, but you can’t even use them without spending more money on top. They’re locked behind a co-pay system where you still have to make in-game purchases for them to matter. It doesn’t feel like appreciation — it feels like a way to squeeze more out of us while pretending it’s a gift.\n\nYears of supporting Smite just turned into a handful of restricted gems and a fresh start nobody asked for. It’s hard not to feel scammed when a decade of investment gets reset, and the “reward” is something you can’t even use freely.\n\nAnd look — I understand the desire for engine upgrades, better performance, and long-term support. But nobody was prepared for this, and nobody asked for Smite 1 to be replaced. If anything, Smite 2 should’ve been something developed quietly in the background while Smite 1 stayed the main active game. Instead, they cut the cord early and forced everyone into a game that feels unfinished.\n\nOn top of that, the item diversity is completely gone. Smite 1 had a huge pool of creative items that let you experiment, counter-build, and find unique playstyles. Now in Smite 2, so many items were changed or removed that if you don’t build the 1–2 “correct” items, you’re severely underperforming. The new Strength/Intelligence system oversimplifies everything, and you’re punished for trying anything different. It kills theorycrafting, it kills identity, and it kills fun.\n\nSmite 2 didn’t just strip away player respect —\nit stripped away gameplay diversity, community identity, and everything that made Smite worth playing in the first place.\n\nTime to go play League.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm very disappointed in Hi-Rez. Splitting their playerbase was an insane move, forcing people to repurchase skins and gods they already owned and paid for is so greedy and is probably what killed the game. I've mostly ever played vs bots in the smite franchise, but I haven't found a single other human playing the vs bots game modes since starting up Smite 2. I never had this issue with Smite before, and I assume it's just because the majority of players gave up on Smite 2 on its release.\nI'm surprised that there are usually 5k players on at any time, because I don't ever see any of them playing vs bots. I don't think the game is dead, but I'm seriously confused where they get the idea that 40+ million players love this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They have really ruined this game its gone all downhill since the healing got buffed and they only cater to the new players. having no real antiheal has really made this game just terrible. they used to say smite 1 but better yet the only thing better is the graphics. theyve even started to ruin the gods they port into this game from smite 1. daji is just terrible after they butchered her ult. got to say i was having fun in the beginning but then they start adding things that arent smite at all. why would you have an agility relic yet remove combat blink. pathetic the way the game is turning out.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't bother to play this game. If you value your time, stay away from this abomination. They took every mechanic and god from Smite 1 and made it worse and more unbalanced. They wanted a visual \"overhaul\" but instead is a clusterfuck of special effects. They re-release skins from the first game which you already own and charge u money for it. A joke of a game that deserved to end a few years ago.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "zero smart matchmaking, has like insanely stupid learning curve and no one plays it, can tell why. you try and go into a normal game and welcome to slur and grief city. absolutley no point playing. the gap in skill in match making makes the game almost unbearable, you can either no skill beat bots over and over, or get stomped into submission by the first people you match with. disgusting excuse for a \"modern moba\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "piece of shit bugged version of smite, with only trash tier AI customer support. shitheads can trade conquest roles, and if you dont accept you'll get a cooldown for deserting the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is total crap. No balance, constant desync issues, one of the worst cash grab micro transaction models out there...... seriously its not worth the \"free\" space on your hard drive. Dont play this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hi-rez is so out of touch with the community its actually insane... Literally no one asked Agility Relic in the game but they are not listening. It might not be the best active to use and it might just have a low win rate but the frustration to play against one is immesurable and definitely the worst item in the game to play into. And they are bringing this item to ranked tomorrow even though most of the high elo players don't think it should even be in the game. Your core audience complained about Combat Blink back in the day (which I think wasn't even a problem, brink back combat blink) because it was frustrating to see enemies blink away from a fight and you guys instead added this relic that is on 20 seconds cooldown. Until this item is removed from the game you guys get a bad review from me. It is bad for Smite 2. Listen to us for once maybe.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible - Game runs like shit, matchmaking is horrid, should've never stopped smite 1's live service, terrible meta, should 100% go back into hard development and shut down the beta. What a joke of a game, DO NOT PLAY THIS.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Smite is smite it is missing some stuff from the first one like motd and lots of gods but it is a good game. \nnow the bad stuff are:\n- terrible match making\n- god snatching in assault is bad\n- lag issues",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As it is right now, i cant say i would recommend it. \n\nmost of the time, the game is a laggy unplayable mess. \n\nIt's riddled with bugs that cause you to reset the game but then get the leaver debuff. \n\nSo no, would not recommend right now. Also, if you are a Smite 1 people.....99% of the awesome skins you have, yeah they are not there anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "They killed Smite 1 and released a unfinished game that aint doing well either. This company is not having the best of time but no excuse for this lol",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has became a joke, having crit on mage and dominate with auto attack and physical items on tanks is an nonsense and it's killing this game in my opinion.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Smite 2 is TERRIBLE with a capital T.\n\nZero balance. The game is a meta-locked sweatfest where fun simply isn’t allowed to exist. Want to experiment with builds? Forget it. Want to play off-meta picks? You’re basically griefing yourself, because if it isn’t meta, you might as well uninstall.\n\nThe community feels like a small town where everyone knows everyone — tiny, insular, repetitive, and exhausting. Matchmaking is a joke. Every match is just one consistent loss after another, and none of them feel remotely enjoyable.\n\nItemization is baffling — enemy teams always seem conveniently immune to whatever damage you deal before they even take it, like some kind of damage-neglecting psychic hivemind preparing for threats that haven’t happened yet.\n\nThe UI is a disaster. Bugged, broken, and borderline unreadable half the time. For a sequel, it somehow feels more unstable and less polished than the original, and that's saying something. This is supposed to be beta, but I’ve seen better “beta” games that didn’t implode into a miserable mess the moment you launch them.\n\n“Don’t waste your money.”\nActually, let’s go further:\n\n🚫 Do NOT waste your money.\n🚫 Do NOT waste your time.\n\nDo better, Hi-Rez. Because this? This ain’t it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not fall for the trend of making sequels to existing multiplayer games. Especially if you are going to butcher your previous games in the process.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't bother. They couldn't balance this mess if they wanted to. Got so many hours of Smite 1, and enjoyed most of it, but honestly this one just sucks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i mean this is just Smite 1 idk why they made another one but it's the same game. it doesn't innovate enough in any way, the visuals are also almost the same, it doesn't really feel like an improvement to me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "At this current time, I cannot recommend this game. Every game has someone rage-quitting because they die twice. Hi-Rez needs to fix their shit and put some type of harder punishment for leaving the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "compared to smite 1 this game is shit. hirez and their leftover ass cheek devs along with the paint chip crack smoking community are all that is left. The devs and the drewling on keyboard community will gaslight you and tell you that this game is completely different from smite 1. In REALITY, this game is no more than the same game with all the negatives. There no longer any tanks in this game, no healers, everyone just does dmg, items are designed by meth heads, none of your skins will be on smite 2, every god is exactly the same from walking to talking on smite 2 besides a few gods that had a tiny tiny adjustment, the graphics are not super different enough for me to say they should have started from scratch on a new engine. As a smart human being, I recommend you waste your time on any other game besides this dumpster fire. I love smite, but this version of smite is ass. ALSO, the aspects they thought were a great idea. ya, some are cool, but crit nuwa who out-performs any adc out there. this game is not balanced and the aspects are barely thought about. At this point, they rush everything out the door due to them firing half their Smite staff. No wonder this game is shit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yeah, nah.\nThis a'int it, chief.\nI have hundreds and hundreds of hours in SMITE 1 and have, unfortunately, put hundreds of dollars into it.\nI'm not really sure what kind of system they're trying to work with for the cosmetics, and I completely understand that not every single skin can come over to the new engine.\nBut to make people buy skins they already own and not even bring over the most expensive ones?\nI've felt pretty off about the game since they started running 3 or 4 different events or passes at once years ago, but I thought SMITE 2 would be a neat upgrade. \nIt's not. \nI haven't actually played much since it became available to me, since I've been waiting for more gods and skins I already OWN to be put in.\nlmao. \"Gimme money\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "having major audio issues, can hear a single thing every 3 minutes. In a game where audio is a major factor thats fucked. Restared the game, restared my pc, still had nothing. I probably have penalty now because I don't want to play a game I can't even hear.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game puts you vs ai nonstop even when doin quick match. Dog shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hi Rez, the company which runs the game, does not ban for INTing; regardless of how blatant. Because of this, Ranked Conquest is rife with people who intentionally feed, & then spam f6. It's so bad that solo que has devolved into a true Matchmaking Roulette - it's a total waste of your time. \r\n\r\nIMO, no one should take this game seriously until Hi Rez starts dishing out ban waves for the insane amount of people throwing games in ranked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blatant cash grab, unexplained fundamental changes and terrible balance. Not even close to the same enjoyable game that was smite. Hope this fails like Overwatch 2 did.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't play the game anymore, it freezes whenever abilities are used. It isn't approachable unless you have a beefy enough PC you're stuck playing joust :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible matchmaking, doesnt teach you the MOST important gamemode (conquest) and you just have to play the first dogsht quick place gamemode joust that doesnt teach you how to play the MAIN game so you're left to play against the best players of your life because the matchmaking is bad, and you dont know what to do or where to go because they dont actually teach you. the only bareable gamemode is joust.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not my vibe anymore. I dislike the direction the game is going in. Aspects ruin the the flow of the game for me, and they make it hard for new players to pick up. Smite 1 is where it ended for me, and I will miss what the game once was.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sad dead game, used to be fun and competitive now its full of pansies and manual breathers. Smite 1 was competitive, fun and had changing metas, this game is full of overtuned characters with zero though to gameplay, and a ranked system so broken its one of the only games that truely elo hell exists, you can play your heart out only to have some Spectrum rider run it over and over without understanding how to farm from behind. And Hi-Rez is one of the worst companies when it comes to creating a game to be competitive, they are more worried about making strong characters to sell skins instead of a balancing or good competitive system to make the game fun. And making a game after smite really never left beta is disgusting. DON'T Play. Please let HI-Rez and Titan Forge fail as companies as they have failed us as consumers. Definitly more like a place to care for the mentally handicapped.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For the second day in a row, the game can't find me a match for the arena. Is this a problem after the update, or is it just a general problem with the small number of people playing the game?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it feels like Hi-Rez gave up on this game already. There's no structure in roles as in no real guardian, hunter, assassin, or mage classes. every god is nothing but damage and the aspects make it worse by turning guardians into assassins or hunters into mages etc. and also including how every god can buy every item now doesn't help with that either. its so unstructured its a no brainer as in why the game feels so unbalanced right now. their focus on rushing in all the gods is making it so that every match is just a brawl rather than something with substance. there's no point playing any other game mode than arena because of the fact that you'll be punished for playing your actual role. Hi-Rez has to stop adding content and focus on balancing and adding the structure back into the game otherwise there's no point playing this mindless slog of a game. Why focus on adding all the gods back if by the time your favorite god is re-introduced it won't even feel the same because the game is entirely different from the first. I thought it was just supposed to be an engine upgrade but it feels like Hi-Rez laid off all the wrong people and the ones left wanted to make a whole new game using smite as a flesh puppet to lure in unsuspecting fans. go play a different game and save your time and sanity, i would recommend deadlock or even heroes of the storm because even though that game isn't receiving updates anymore it definitely feels more structured and balanced than smite 2 but keeps that brawling aspect Hi-Rez seems to be chasing atm.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played a couple of games and have to accept the unfortunate truth. Game is bad, HiRez is dying, and its time to accept one of my favorite games is done. GGs everyone",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have on record THOUSANDS of hours between three accounts, my true and honest opinion of this game is not good what so ever. it was supposed to be a rework of the games engine, now we get a whole new god system, each god can play physical or magical, but you have to read the abilities to see what scales with what, not to mention \"aspects\" which completely reworks a singular god to play differently (pro's and cons of this). the game is IN FREAKING BETA! and yet has a whole store... not to mention all the money i spent on smite 1, got converted to smite 2 but its an entirely different currency, i can't buy new skins with my 165K whatever tokens all it is, is \"classic chests\". \n\nThe UI is just aweful... smite 1's UI wasn't the best don't get me wrong but it was also useable and easy to understand. \n\nthis game was sooo much fun but like, its just not what it used to be at all. its truly so sad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "==This game feels bad , really really bad \r\nThey changed the core of the items, now they all have this strength and intelligence stats, but they never introduced agility, what are you trying to do, be DOTA ?/ YOU CANT and you should not be, it was ok before, change is not always good, and you change the game to the point I do not know what am I supposed to build anymore, the store is so confusing too.\r\n=======Gods changed\r\n==LOKI , where is my skinny ugly-evil looking devil , he was change into this athletic build, he made sense the way he looked before because he was a sneaky bastard, they changed his ultimate from the kinves in the head and rooting the god , to kinves in the back and a back flip ending with slashes without rooting looking super mega extra flashy and boriiiiiiiiiiiiiinnnnnnnnnnnngggg.I WANT HIM BACK.\r\n==CUPID- baby looking god who was supposed to represent PURE LOVE ,the one who pssssss you and you fall in love , to a 10 year old kid, I dont know why he was changed, but I dislike it.\r\n--they fired the girl who laughed like a pig, what a waste, she was familly.\r\n--- game looks like it was made for mobile, and feels ai too.\r\n--- skins should not have this many recolors and should feel unique.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst game of all time controls terrible, god balance absolutely atrocious, game concept fine. But overall terrible do not play ts ever. Theres atl 3 more mobas that are better than this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't understand. Year is 2025 but this game hasn't remake!!!!\nI lost my LP for afk people more then once.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried it out, i could not figure out how to sell or buy stuff on my own and i could not seem to find the autobuy button. Very confusing shop...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really hate the store. I especially hate this push towards active abilities on items and the weird cross building they have. There was nothing wrong with the store or the way items were in smite. I’ve been playing smite since 2016 and I still love it. It needed a makeover but not a complete overhaul of the systems that already worked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they dont even try to balance it. Fun or interesting builds are punished. If you wanna turn your brain off for a bit its fine ig",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fine really, has some bugs missing some of my favorite gods from smite 1 but honestly the people who play this game are AWFUL. I cant tell you how many games lost because someone gets upset with a decision someone makes and then decides to AFK in fountain, The amount of people who dodge because the dont get the one roll they play, the amount of people who throw matches because the get stuck with support, if you can 5 stack and have a good time go for it otherwise theres probably better games out there",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly as someone who grew up playing smite with my brother and it being a childhood game for us and a core memory Smite 2 just gives me a disappointed memory of what has been and couldve been. I have love for the game but the way Hi-rez treats its loyal costumers is disappointing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if i would have know that the dev would had kill the game at this point i would heave never buy it and my god it did take me too much time to ask a refund i would if i could get it now and mainly the dev just made that shit game as a cash grab with no love for they comunity and plus the never keep the promise they made to hell that shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know it's still BETA, but this giving a mobile game vibe. Nothing make sense, a completely different game to SMITE.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After a 6-month hiatus, my SECOND game has four disconnects, all on my team. \n\nThe game is developing amazingly (loving the visuals), but the core of the game, actually playing it, just isn’t there. And I don’t think it'll improve anytime soon. It’s probably best to wait until all the Gods are implemented so your favorite one can at least mask the horrid servers. Hopefully by then, they’ll finally focus on fixing the servers and DCs. \n\nSo, a 3–4 year hiatus it is.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tragicly the game is unplayable, I have had a DC in every single one of my games. not worth playing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "MARKETING AND PROMOTION ARE THE DAMN KEY TO THIS GAME — IGNORE IT, AND YOU’RE DOOMED.\n\nSmite has been stuck in the same place for years because Hi-Rez still doesn’t understand the importance of marketing.\n\nThe game has solid mechanics, a unique identity, and a loyal community. Yet all of that potential has been completely wasted over the years due to poor marketing.\n\nGraphics or design updates are nice, but that’s no longer the main issue. The game is technically mature; what it truly needs now is a real marketing vision.\n\nThe same mistakes keep repeating: there’s no esports scene, no advertising, and no influencer partnerships. Even active players struggle to explain Smite to others, because most people haven’t even heard of it.\n\nAt this point, the focus should shift from design to brand awareness, esports events, and global promotion.\n\nHi-Rez’s core problem isn’t game development — it’s not knowing how to sell the game.\nSmite has never reached the audience it deserves because no genuine effort has been made to promote it.\n\nNew gods, new skins, new maps… none of it matters anymore, because nobody cares. As players, we want more than new content — we want the game to grow and reach the audience it deserves.\n\nSmite can still be saved, but for that to happen, Hi-Rez first needs to accept this simple truth:\n\nThe problem isn’t the players — it’s you.\n\nThe game isn’t dying because it’s bad — it’s dying because of your lack of marketing vision.\n\nIf nothing changes, Smite won’t be remembered as a good game — it will be remembered as a wasted potential...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "god aweful game, no change to the ranked system, i used to be your avrage gold now im diamond and when you get into low diamond or high plat the player base is worse than gold. the ranking system is so garbage. they dont care to balance gods they just want money they dont listen to thier player base just more ''seasons\" for people to spend more money game is junk dont waste your time. the playbase is so god aweful and if you q with friends for ranked conquest they give you bronze players.\n\nyou can go 20-1 \n\nyou whole team can go 0-20 and you still lose elo your still punished for dog shit players its unbeliviable. for example i went 16-5 posidan mid we lost the team didnt get over 3 kills combined, next game i play against the 4 i just played WITH i went 20-1 and lost some how you can play your best game ever but still this shit system punishes you for good but you cant 5 stack to avoid this.... why?\n\n\npeople are carried in rank one way or another ffs. retarded developers. go make another cutsey avatar before you actully balance your game. what a joke.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Monetization cash grab slop that feels the same as smite 1",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Imagine being promised everything and getting everything... But then everything is nothing. Maybe i'll give it a chance again 6-7 months from now. Hawk Tuah!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrible game as every other by Hi Rez . Total broken and unbalanced . New players get shouted \"noob. bla bla bla , dmg stats ... \" You get few gods and thats it . Horrible tutorials . Insanely horrible match ups- just waited 10 minutes to find a game and get oneshoted by any broken god . Totally unfriendly game and very very poor balanced . No wonder why Paladins die . Every game made by this company have 0 balance and most are full of cheaters",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "horribly done, going in a bad direction.\ngreedy monitasation in a unfinished, unbalanced game that offers barely any advantage compared to smite 1.\ngod release cycle is super slow due to layoffs, playerbase not really existant anymore.\nand you need a big player pool to be able to have balanced matches within your MMR.\njust bury it, it is already dead sadly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shittiest matchmaking possible in assualt mode. Not a single casual in  opposition. released very prematurely.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The amount of money I'd pay to enjoy Smite 1 again...\n\nHi-Rez sold out and it destroyed the player base, despite the degree of disputes goin on internally. You guys took a risk rolling the dice and \"better\" graphics on unreal 5 + everything thought to be better, was not worth the trade-off of an original game. I genuinely loved playing and what you've done to 'compete' and stay relevant is just a hoax.\n\nOne of a kind MoBA that will be completely nameless in the next couple years.\nI love what it was but hate what you've bcome.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They removed the ads from the game. How am I suppose to watch the John Cena Purple Cow ad now?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For starters, 7k+ hours(probably more) on SMITE 1 combined between a plethora of platforms and accounts. \n\nIll give this game credit on a few things;\n\n1. The ability animations are TOP NOTCH and they look like you're actually casting a mythical ability.\n2. Aspects, while I don't think it outright replaces the freedom of builds that you were capable of in smite 1, the way to modify a gods kit to provide better use for certain rules is a plus\n3. SOME of the gods look really nice, don't look to gaudy and even get less scanadelous n got some more clothes.\n\nThats about all the positive things i can think of when looking back to what changes really stand out to me.\nNOW THE NEGATIVES;\n\n1. The UI is a MASSIVE FusterCluck, The UI has been dumbed down in so many aspects from the in game god ability info not telling you cost, damage scaling, cooldown, etc. to the in game store not having a stats button so you can see what your totals are on stats for Int, Stg, Cooldown, lifesteal, etc.\n2. Going back to the gods and their appearance, WAY to many gods look like they themselves are emitting light rays that rival the SUN, why does every god need to look like a shiny vampire sitting in the sun, the skin particle effects are terrible and come off pixelated even on the highest settings. they just failed at making anything shiny.\n3. Items and god builds, while i like the idea of having the auto builder and it is very useful for new players or returning players that wanna hop in and just hit ability keys mindlessly, the builds are as 2D as it gets, WHY did we have to swap from physical and magical items, one of the FEW things that made SMITE 1 actually unique and then still force gods to build certain ways because they scale off certain things more than others. Seems like a roundabout way of trying to seem more broad in building but not quite so.\n4. Monetization, Hi-Rez is going to shut down SMITE 1 eventually we all know that. but how long do you think they will support this game when the cosmetics are so obscenely priced and no one buys?! The \"Legacy Gems\" being a half off coupon when in all actuality most of the skins without them WILL cost 20 dollars a pop is asinine. That's more than double what skins cost in SMITE 1. \n5. Community, I LOVE SMITE, I've played the game since beta on PC, my first and ONLY MOBA. A lot of the reviews i see are people White Knighting for a company that does not and will not care about them.\n\nDo I recommend you play this game as a SMITE 1 vet? Sure, Its the same game with slightly \"Upgraded\" Graphics and some new twists on the OG SMITE formula. Do I think its the future the game should be heading for? No. All they had to do was make a SMITE 1 Clone with updated skins and god models, not all the extra BS they think is innovative. PLEASE, Enjoy SMITE 1 while its still online if you enjoy it. cant promise you'll love this the same.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They killed Smite 1 and released a unfinished game that aint doing well either. This company is not having the best of time but no excuse for this lol",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game looks worse than a mobile game. I put 2000+ hours into Smite 1, loaded in this joke of a game and uninstalled before the end of my first bot match. Literally looks like a Temu Disney version of what Smite 1 was. Devs have lost the plot, literally. Just get on reddit and see ALL THE DRAMA!  Shame. Sm1 was THE BOMB! This.... Is not good.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Im smite 1 veteran and i have about 3000h in it. I played it since beta and when smite was not on steam at all. I dont get it why did u kill my favorite game because u got greedy and u wanted to milk money and make smite 2. I need to be hones i like the new graphics, visuals and effects in smite 2 but gameplay its just not the smite i know. And  where are my all over 150 skins i had in smite??  They are converter in some gems where i need to spent more money to buy skins i already have thats so stupid and greedy. I will never play this game again and im sad because of that.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Basically an over the shoulder POV for a mobile game along with the same shameless monetization style",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good if you enjoy instagib mode games where you kill instantly or get deleted in 0.01 seconds. Could do with more health pools and longer fights.\nIt works well in the DOTA/LoL format but not for 3rd person imo. doesnt feel good to play at all\n\naussie being forced to play on US servers because theres no population, makes it almost impossible to land shots. theres no targeting system to assist for lag, pinpoint accuracy from 3rd person again feels awful, the farther you cast spells the more you have to change the camera view angle...this is never the case in a top down moba\ngameplay is 90% messing with stat sticks, farting about in lanes, mexican standoffs in arenas or lanes, when you finally get some pvp combat, its over in 10 seconds, after waiting 5+ minutes for action.\n\npoorly designed ripoff moba with no unique features, couldve tried something new with smite 2. \nGame feels a decade old already\n\nif you have 4 other friends and can team up and coordinate it might be bearable. \n\nDefinately not as fun as dota queuing solo",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Greedy Devs and thats why this games DOA.\n\nAll skins and rewards earned from playing smite 1 doesn't transfer over.\nIts like starting from scratch with nothing to show \nSame gods same map same skins same game\nsuch a bad decision from Hi Rez , but this is what greedy devs deserve... f**k em\n\n#LetItBurn  #DeadGame",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Do better. game is boring when every god nukes any other god in an eyeblink",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to play smite a lot as a youngin bc I didn't own a pc when I was younger. It was not until I was able to play other moba's that I realized that this game was trash lol. Smite 2 is like a company shooting themselves twice in the head after the first shot didn't finish the job. If you're looking for a 3rd person moba a little bit more polished don't play some of this ue5 slop like paragon, play deadlock which is made by a group with actual direction. 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible game. BEFORE YOU SPEND ANY MONEY ON THE GAME - know they have NO support website NO contact number and they are STEALING players money and banning them when they dont spend  money on the new prodcut even after 17k+ usd spend on the previous product. i started it and because i didnt purchase the all gods pack i was force to pick only gods i did not own. as they were all locked i could not select any leaving me with a 20 minute deserter penalty. if yo ucannot spent a toneof money on thegameyou are not able to play it and will be banned until you spend money. i have 17k usd spent into smite 1, yet some howeverytime itry to play smite 2 i get lcoked into picking one of 7 characters or so that are all locked due to toher peopel picking other rolls then i get bannedfor 20 minutes+ becasue THE GAME doesnt let me pick ANY gods. why the FUCK would you put a game out for free if you have to spend more money to get gods or get banned",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fk this Game. every game ijn rannk is the same 2 out of 5 dont play or pick correctly. 3 ppl will talk shit for 40mins the one time ytou say someythingn youll be ban anytime they feel you didnt play the way they want 120 and a perma ban for arguing. DO NOT WASTE MONey BANS ARE 18 months for a game with very low player base already GG",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Prob one of the most unfun games ive had the experience of playing the first game was awful this one is even worse, balancing is always wack, matchmaking isnt fair and its a moba so its ass to begin with",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Totally unbalanced and unplayable cashgrab. Poorly rendered but the overpriced MTX is working strong",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have 2000 hours in Smite 1. Smite 2 is worse in almost every imaginable way possible. Its actually impressive how badly they dropped the ball on the Smite franchise.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Yeah I didn't install a multiplayer game to have to play 10 matches with bots first. No thanks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In Smite 1, they said they would only release new skins so they couldn't pass the old skins to new ones. \nIn Smite 2, they released old skins and charged full price again.\n\nThe gem conversion was a joke too. I know we can't expect a f2p game to give free skins and all. But the god pack didn't pass as well. \n\nThese 3 things were just the tip of the iceberg. Unreal Engine 5 took years to finally be somewhat playable and is still riddled with bugs and client issues. The UI is ugly, the events are the same \"buy something\", \"buy something\", \"buy something\" from Smite 1; and ranked aspect is a joke. Their balancing team takes 3-4 months (that is 3-4 patch notes) to adress an overwhelming issue in ranked lobbies, and mostly they just break stuff. We aren't talking gold changes, stats changes. We are talking half the items in the game ARE USELESS, and 3 of them ARE BEYOND BROKEN. Everytime they touch anything, they replace the passive of an useless item: making still niche, situational and useless; or they kill an item. Then, after everything is nerfed; they release new broken items.\n\nThe itemization in this game is a joke. If you have ever played Dota 2 or League of Legends, you understand how important that is to a game with shop features.\n\nSmite 2 needs to die. Hi-Rez needs to die. They killed the only good product they had, the other plagiarism filled trending hopping games died on release. The only reason Smite 2 is still somewhat standing is because Smite 1 had an actual player base who enjoyed the game. I believe that not to be the case anymore. It's just that MOBA's are not having new releases nowadays. \"Friend slop\" and \"Extraction Shooters\" is whats hot right now. So it might take a while for them to actually bury this greedy ass game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "have over 5k hours on ps, smite 2 is fucking trash! i spent 100 on this bitch and its trash as fuck. controls trash, abilty switches trash, every fucking thing is trash. i dead ass hate it and wish i could get my fucking money back. i fucking hate this shit with my whole fucking heart.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The match making just isn`t good but if you do play I would suggest grabbing friends together and play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's much better than smite 1, but I'm still salty about my godpack and skins not transferring over",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Purely writing a negative review to counterbalance a friend of mine who rated it as recommended. \n\nHi-rez lazy consumerism approach to creating their own variant of Overwatch 2 has hopefully backfired on them, as this \"fruit of their labour\", really is a testament to how you take a good concept and shatter it with badly optimized gods, badly optimized items, and insanely predatory approach to microtransactions. \nAs a player who played smite 1 since that was first in beta, the fact that our investment into smite 1 didnt even transfer over, just screams corporate greed to me. Ive spent years grinding, and spent money on the game back when i really played it a lot and enjoyed playing it a lot, especially with friends. Legacy gems are worth jack, because they only cover half the price of the same damn skins you bought for smite 1. \n\nUnreal. Just, unreal.\nHi-rez you suck, you turned a good concept into a majorly bad execution.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}