{
  "positive": [
    {
      "review": "This is a game for people who enjoy engineering creative solutions for it's own sake. There is almost endless possibility for the active mind. I didn't have the mental fortitude to make it that far on my initial playthrough, but I hope to one day build a a mobile space base in which smaller functional vessels can dock. A giant space whale containing everything from fighters to transports. I would name it Purrgil.\r\n\r\nI think of it as a game for all the kids that loved playing with Lego as kids.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "I play it for more then 2years and i must say its one of the best game i played (i played many games) for starters i will say that you need to give it a chance more then 1h you need to give it like 10h and i recomend watching some youtube videos where people play from start alone you can learn how to do things and later you will know how to do many things. So what i want say its , Its very good game when you like space wars or building bases and space ships :). Majchyn",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "super interesting gameplay, like minecraft for adults",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "The base game was ok, but over time it has been updated and expanded, and is now better than ever. Even if they announced and is working on SE II, I still find loads of vaue in playing the OG. If at any point the game becomes boring, there's TONS of mods to dive into.\r\nSo if you like technical games with a survival aspect, then this might be something you will enjoy.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Over the years from just being a physics simulation with no real content or survival, just ship building and destruction to becoming one of the best experience i have had in a space game in years. Even before the DLCs with the huge modding community and the support of Keen to keep the game in line with majority of the community's  desire from the engine. In 2025 this is a very fun experience either solo, or even better with friends. Fun PVE content as well as full PVP support. Runs very well on a decent moderate level gaming rig, even better on a more modern machine. If you like trying to build your own base, finding resources, designing and building your own drones, rovers, ships, space stations, satellites and more you will enjoy this game.  Explore the default star system, playable scenarios, build unique challenges, even play hundreds of modded star systems, or scenarios. You can play creative as well; designing unique ships,  mechs, vehicles, and more to be exported and shared with others. A great game with a great community 100% recommended to anyone who loves science fiction, along with a huge open world system, and survival.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It has nice blocks and lots of space. And it is still getting major updates!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's Lego that runs on PC and have all kinds of readily available challenges to test your build. It's amazing.\r\nDouble or even triple amazing with it see-deep modding scene.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game is just incredible, I have so much love for it.\r\n\r\nI try to play with focused goals and survival based, but I easily get carried away just creating stuff... I wonder if this would work... \r\n\r\nTo top it off, the devs and community are truly wonderful and committed. The wealth of mods means you can tailor the game to your liking, and some of the creations people make are mind blowing. \r\n\r\nIf you doubt whether to buy this game, go and see what people do on youtube; take your pick from astounding creations (@ApologiesSE blows my mind) to seasons of actual rpg/fiction played out (I love Outlands).\r\n\r\nI'm gonna go away now and see if I can make a ship that eats other ships! :D",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "fun game, easy to lose hours on hours playing this with friends",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games for builders with a very active studio behind it. Still getting updates and content in 2025! Glorious!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I grew up playing with Legos. Building the sets then taking them apart to building fantastic new creations that i made up or saw in movies and Tv. This game brought back that part of me, and let me scratch that itch. I have 3,600 hours in this game and i see it as the best money i have ever spent on a video game. Especially sense Keen keeps adding new or better things every few months. So i absolutely recommend this game to builders, Survivalists, and anyone with a drive to create something.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Would be better if they updated this game instead of releasing a new game, or at least gave the equivalent DLCs for the Space Engineers 2, to everyone has the equivalent DLCs for this Space Enginners game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Currently i have logged 500+ hours in space engineers, I love what Keen is doing with this game, I have high hopes and look forward to SE2. The community is also a huge part of this game and are extremally helpful. I honesty wish i had more time to give this the dedication it deserves.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The updates to the PvE experience over the last years really made this game come to life. With renewed reasons to build space ships to survive, the gameplay loop feels more fun than ever.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good. 10/10 recommend if you like space sandbox games with very good modding/workshop support",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My friend has made \"I'm a space engineer\" his catchphrase and almost our entire group fiends over this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game might seem a bit difficult to get into at first, but once you've got to know it a bit better, it's an extremely good space sim. And if you find a good server you might even make some fairly good friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The devopers + modding community make this game extremely deep.\nWant aerodynamics? mod.\nWant orbits? mod.\nWant a real solar system where the planets orbit a star? mod.\n\nI don't expect these features to be in the base game as it's a completely different experience and that's what makes this game so amazing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Addicting creative gameplay for bringing various ships and vehicles or bases to life in a nicely immersive game. I love the mechanics for building and the planets can look nice even with graphics set to low, and there are a large number of options or modifications to change the game to your liking.\r\n\r\nI have not played multiplayer which is a difficult option for me so I have no clue about that, but I imagine it would be more intensive if you want to have battles or interactions large constructs, so you should consider that, but otherwise it has run quite nicely on my decent laptop with about 8 gigs ram, a AMD Ryzen and AMD Radeon, but this is on low graphic settings.\r\n\r\nThere are graphical glitches that pop up with clear tears in the ground now and then, not too often but they can and may pop up from time to time on a planet even with things turned down, but it was not too frequent for me.\r\n\r\nThe worldbuilding is perhaps a weak point as that and content isn't usually too complex, you won't generally expect the layers of stuff such as in Terraria or Minecraft, though modded maps can be quite rich in their own right but some may be hard to load and run depending on what they have.\r\n\r\nOverall I have enjoyed this very much and I recommend it for people with strong creative urges to enjoy crafting their own vehicles/stations.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "most hours iv ever played a game on xbox. but i wish there was a way \"that worked\" for me to use controller on steam. tried the fixes available and my triggers dont work. hopefully SE2 wont have that problem.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(have to write rev for steam anward task) very good and inovative game love the space sandbox gameplay (plz put multiplayer in SE2 faster)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's been a very fun game to play over the years and there have been so many great mods for it as well. And while I would recommend this game, I hope Space Engineers 2 ends up being far better, which I have no doubts about.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game. runs on linux just fine. dont forget to add dotnet48 through winetricks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ladies, Gentlemen and those still on the way there,\r\n\r\nI played this game for far too long. As is the same with drugs, I started out way to early.\r\n\r\nWhen I first launched this game I was still working as a chef for ungodly hours and bullshit pay. Thanks to\r\nthis game, however, I have become a design engineer due to no fault of my own. I even bought a book\r\non C# recently.\r\nNot to advance my carier or some other mindless nebulous garbage. No. I got it solely to play the game\r\nbetter. As I gained more control of my subgrids, I lost it on my IRL relations.\r\n\r\nBeware!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It may not be the most realistic game, but it sure is a lot of fun and can scratch that space combat itch you might have while giving you the creative freedom most games of the genre don't. The amount of things you can do in this game is baffling and with the developers still working on it we're only going to see more things you can do. I highly recommend at least trying it out because this sure is a one of a kind game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After over a decade: If you want to build a spaceship and fly it, this is still the best game to do that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely one of the best brain traing/engineering game in the industry, alongside Factorio, thanks for this gem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. I mostly engineer at Pertam with land vehicles. After 300+ hours all I can do is a brick, 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After spending over 70 hours in Space Engineers, I can confidently say this game is absolutely worth it. The learning curve is real, but once everything clicks, the building and engineering systems become incredibly fun and satisfying. Designing ships, bases, and automation setups gives you endless creativity and freedom.\n\nPerformance has been smooth for me, and the game still feels fresh every time I load it up — there’s always another idea to try, another ship to improve, or another planet to explore. Even with just 70 hours, I feel like I’ve barely scratched the surface of what’s possible.\n\nIf you enjoy survival, engineering, or creating your own machines and ships, this game will keep you hooked for a long time. Definitely recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun even with friends. Can be overwhelming at first but once you get the hang of it, you'll end up wanting to do more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought a space engineering game, got a mental breakdown simulator",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game and has endless replay ability and this is a game you can come back to no matter how lonng you have been gaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely one of the best creativity games I've ever played including space. And the devs work on it still, despite having the sequel already released.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, very punishing but fun to play, DONT LEAVE THINGS UNPOWERED",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, the amount potential for what you can do is vast! There is always room for improvement, particularly with the UI. This game has a lot to offer and if you're someone who loves large build and projects this will keep busy. There is a lot to learn which makes it exciting when you discover a new or better way to do something. With consistent updates it is only getting better, and with Space Engineers 2 on the way the franchise is only going to get better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Minecraft but in space and more functional builds. I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game for over six years, it's absolutely fantastic. I spent my entire teenage years building spaceships. It's one of the best video games I've ever played; it's a bit like Lego, but without having to pay €900 for sets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY FUN WITH FIRENDS! Me and my friend chefman007, we started a survival world begining on earth together, after a couple of sessions playing and building up our first base / outpost to handle mineral extraction + proccessing and manufacturing. Sometime after constructing a base we then began building space craft and autonomous drones. Great game and I still havent discovered alot of stuff, lots to learn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game.  Quite a learning curb but definitely worth it.  I also appreciate this being for adults and not loaded with kids stuff like bobbleheads and stuffed dolls..  and all of that weird stuff.  The hard work in developing this is more than evident and the passion for space exploration as well.  We're on the same page so definitely on my list of favorite games now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great space construction vehicle game! Right balance of realistic and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games to build space ships with. simple to get the ship working, but you will keep coming back to make the best looking ship you can.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Put off playing this for like about 3 or 4 years until just now, amazing game with amazing progression, building ships is difficult at first but eventually becomes muscle memory, oh and you'll never have enough iron even if you think you do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome. Can't wait for SE2 VS2 to release. Give the devs some love and nominate it for the Labor of Love award.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Somehow, I've managed to put nearly 1000 hours into this game over the last 11 years and I STILL can't make decent looking ships. \r\n\r\nIt's either a brick or it looks like a 3 year old drew it in MS Paint.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's such a complex and interesting game, but I really wish they had support for operating systems other than Windows, especially MacOS.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun game that feels like a really high budget Minecraft mod. (that's not an insult)\r\nIt has plenty of mods and community created ships to play with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love seeing the continued support for the game, even when development on the sequel is well underway. It's come very far from the early days and I'm excited to see what's next",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games i've played, been playing it since lanch, cheap DLC and good content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played Space Engineers on and off for 11 years and it is by far my most played game ever. I just keep coming back to it over and over. My playtime is amateur by comparison to some in the community. I have also bought copies for friends aswell.\n\nIt definately deserves to win this years Labour of Love in the Steam Awards. The devs are constantly updating the game for free and although I don't necessarily agree with the sheer amount of DLC's, I have bought some of them to support development.\n\nThe sheer amount of freedom you have in this massive sandbox constantly blows me away and it really tickles my engineering itch at times. It also drives me nuts when i can't get something to work, but thats more of a me problem.\n\nThe modding support is excellent and seamless with the Steam Workshop. There is a mod for almost anything and also player made ships you can download of all shapes and sizes, including just about any pop culture ship you can think of. Some of the stuff I have seen on the workshop is absolutely astounding and I can't believe some of the skill some people have to make these ships, scripts and mods (sometimes all three in one).\n\nDo yourself a favour, if you like to build stuff or have an unrequited love of engineering, pick this game up. Or try its early Alpha sequel SE2. You wont regret it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply just an incredible game. If you have a logical mind and enjoy space (like I do) this is perfect for you. I have spent thousands of hours playing this. As I look back in the years, I can remember moments in Space Engineers which would last forever, like entering space for the first time with my mate, after building what we thought was an amazing ship. It did the job, but then pirates found our vulnerabilities. Back to the workshop for us, to redesign our masterpiece with firepower! Good times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't believe I haven't posted a review of this game after almost 1000 hours but here's what I've got to say. Amazing game, thats all I can say. It has its.. \"quirks\" but its essentially minecraft in space and with physics. The possibilities are only limited by what you can think of. Thats no a joke either, I've made numerous machines that use \"hydraulics\" to actuate attachments. Heavily recommend, I also recommend picking up all the DLC's if you can, they're very fairly priced and give way more freedom with decoration",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my most played favorite games ever. Anyone who enjoys space and ships should make a space ship in this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my go to games. its been amazing on how each dlc changes the game for the better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its quite fun. Love to binge game for a week, then come back later- to continue",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While this review says recommended, i only recommend if:\r\nYou like sandbox games\r\nYou are creative\r\nYou are independent\r\nHave lots-and i mean lots-of time\r\nand can find engaging things in a finished sandbox\r\nPersonally, i only enjoyed the game for a few months, playing on and off since, but its a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have had countless hours of fun in this game.  Never at a loss for something to do next.  The biggest problem is figuring out what to do from the long list of things I want to do.  Get part way in to one task and think up 5 more things I want to do.  Still outstanding for a game that's been around a while",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love spaceships and spaceship battles and sandbox games this is the perfect game for you. The world is completely open to you build powerful warships or just be a humble minor. We've had a large assortment of blocks and weapons to construct your very own ships, forge great fleets and get to the ultimate goal of the unknown signal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, great mods. Excited for the sequel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "By far the best space building sandbox game i've played. Spent alot of time in this so far and definitely going to be more spent in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The level of creativity that is allowed is really crazy. The updates have been solid and the modding community is amazing. Very sandbox so you need to make your own fun for the most part (mods help a lot with this) but hopefully they keep adding more to help with that. Hard to get into but very worth the learning curve and sometimes annoying UI. Fills a very specific niche for me and I am very excited to watch the progress of the second game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Best sci fi ship building/ Rp game, you have to mine and sett up infrastructure to even start building a fleet, from there you can try out most designs with the voxel construction, and when ships clash, the ships actually lose parts and have holes in them. Cant wait for SE2 for even more immersive gameplay!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well over a decade in, Space Engineers is only getting better and that's amazing. You'd think after such a long time a game might get stale and predictable, but quite the opposite: with new encounters and survival mechanics new playthroughs have become more interesting and our creative options grow with every update!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had this game for years & have had fun building, surviving, & exploring on the many hours put into it. Looking forward to more updates & adding even more hours to this awesome video game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While Keen have been known to adbandon the odd title... *Cough* Medieval Engineers *Cough*... They really have continued to pour love and content into this game.  While this game is bolstered heavily by the modding community a new player can still have plenty of fun with the vanilla setup before deciding on augmenting thier experience.\r\n\r\nFor me I like the space survival challenge, which has finaly found its way into the main game, where you start with next to nothing in a hostile environment and Scavange, raid, build and blast your way back to earth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game \nfun to build and design space ships in",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "how the FUCK are they still updating it after the release of a sequel, fire game studio fire game, fire in the reactor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played many games in my life - and reviewed few - but none has really given me the same amount of freedom to create the idiotic things my mind can conjure up on any given day. Clang may not agree, but Clang at least allows me to try. Solo or with friends, Keen keeps me coming back with regular base game updates that aren't just limited to the DLC. Not that it stops me from buying almost every single one of course.\n\nSolid developer, extremely fair DLC pricing, and the game \"just works\" pretty great for the most part. Other (bigger) game devs could learn a thing or two!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "takes a good amount of time to learn but its honestly amazing whats possible!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have been playing for over a year now and love the game.  The people I play with and the community are awesome and make me keep wanting to come back for more!  Nice to see a developer care as much as they do for there game and make it reasonable priced to play.  Give 2 thumbs up Keen and keep up the excellent work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Space Engineers is a sandbox masterpiece! Infinite creativity in building spaceships, planetary bases, and survival adventures pure engineering joy, love that Keen has maintained development of this amazing title with fixes and content dropping regularly, more then happy to support their work, will always be a game i keep coming back to  10/10!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For people that don't know me I ABSOLUTELY LOVE SPACE!\nAnd this is Peak Space.\n\nYou can make insanely gigantic Megastructures and Complex Space ships and somehow this game just handles it like its no special task.\nThe mods are lovely.\nMultiplayer is amazing. (Tho sometimes if you go afk you randomly somehow die (Don't forget the Wolves))\n\n\nIm Excited for SE2 but i will continue playing the first one till the 2nd is Multiplayer,\nTHIS GAME IS A MUST-HAVE!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With over 1000 hours in this game at this point, I have nothing else than positive things to say.\nThe base game is good, and with the extensive mod support on the workshop, it is easy to tailor this game to your liking. Pick it up on sale, and just build. It is worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Masterclass in game development!  \n\nSpace Engineers is a shining example of how a game should be developed, supported, and expanded. From the moment you start building your first ship to the awe of navigating the vastness of space, the game delivers a level of freedom, creativity, and technical depth that few others come close to matching.\n\nWhat truly sets Space Engineers apart is the dedication of the developers. Their continuous updates, thoughtful improvements, and genuine engagement with the community show a level of passion that’s becoming rare in the gaming industry. This is not just a game—it's a long-term project crafted with heart, shaped by player feedback, and refined over years of commitment.\n\nThe DLCs deserve special praise as well. They’re exactly what optional content should be: affordable, high-quality additions that enrich the experience without ever feeling forced. The pricing is great, the content is polished, and none of it locks essential gameplay behind a paywall. It’s refreshing to see DLCs done right.\n\nWhether you're an engineer at heart or simply someone who loves intelligent sandbox games, Space Engineers sets the gold standard. If every game followed this model of development, transparency, and support, the gaming world would be a much better place.\n\nThis is how a game should be made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are looking for a space survival game, look no further! The graphics are amazing, the gameplay is well rounded, and the bugs are few and far between (Unless you are on the Alien Planet) Highly recommend for people who are into automation and space.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game for building with your friends or solo. build space stations or ships. from nothing in space to planetary exploration to jump driving through the galaxy with the space engineer 2 out lost of exploration is coming to the 2nd game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been really enjoying this game, It is relaxing but also has enough complexity to keep you interested.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best space sandbox game out there which game developers still works on it even though they have a brand new sequel of the game on the way. Huge respect for always listening and caring their community with their best interest and effort",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "load into game, continue building your ship. Accidently break a block connecting something important. Explosion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still Really enjoy Space Engineers after so many year of playing, and new blocks are still added constantly,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Space Engineers is a game best enjoyed with friends. If you love designing ships, constructing bases, and creating complex systems with input and output connectors to load, unload, and transport materials, this game is perfect for you.\r\n\r\nOne of its strongest points is how rewarding it feels to see your engineering ideas come to life—whether you're building a massive mining vessel, a sleek fighter, or a fully automated production line. Survival mode adds real purpose to your creations, and exploring planets or space with a crew makes the whole experience even more immersive.\r\n\r\nHowever, I wouldn’t strongly recommend it if you plan to play entirely solo, as the game truly shines in multiplayer and can feel a bit empty on your own. Also, if you're looking for a more polished experience with modern visuals, you might prefer to wait for Space Engineers 2, which promises improved graphics and gameplay enhancements.\r\n\r\nDespite that, the original Space Engineers is still receiving continuous support and updates, even as the developers work on its sequel, which is impressive after so many years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A truly creative game where most of the fun comes from the challenges you set yourself. It is perfectly easy to survive and get your base to a level where resources don't matter anymore, because you swim in everything you might ever want. However, if you try to make something that not just works but looks good, be that a stationary base or a mobile grid, or if you set your own simple rules like \"everything must be accessible on foot without the use of a jetpack\", you can sink countless hours in it just pondering new designs, constantly improving everything you built.\r\nAnd if you like mods or custom scripts, you will get your fill here. The community is amazing at coming up with little additions up to complete overhauls, all neatly integrated via Steam Workshop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I always thoguht the survival mechanics were way too complicated for me. God were they so simple. Now it's my favorite game atm.\r\nAlso, ever wanted to be a mobile space company that loans out ships to people to work? Possibly possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my all time favorite game. It can be a little complex at times but when you finally get the base, ship or rover you've been working on for hours to work the way you want, there's just no better feeling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent physics and space mechanics. Building ships is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not sure why I haven't made a review yet for Space Engineers, Guess I'm slacking.\r\n\r\nSE is definitely one of my favorite games on steam and one my most time sinks I have. Between the constant updates from the KeenSWH Team and the modding community, to even some of the Creators and Streamers that make up the platform, I enjoy it all a lot and always can relax and enjoy, or scrape my head for hours to figure out a logistics nightmare. If you haven't joined the community discord I highly recommend it as well, they post constant updates there, as well as people sharing ideas and asking for help. The community is very nice and aren't the type to just jump down your throat for asking a silly question(You may get a sarcastic answer back) but overall its new player and veteran friendly.\r\n\r\nIf you haven't already get the game and try it out! Can't wait to see your engineering, o7.\r\n\r\nAlso we are blessed by our lord and savior Klang!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like a fine wine now, just getting better with age. One of, if not the best sandboxes out there. Incredible freedom of creativity and with the DLC some very interesting things can be achieved. I like how their mainly cosmetic save for a few pipe line options that could be considered 'P2W' but it's really not important at all. Met some fantastic players online over the years, very helpful and at times, a remarkable community. \r\nAs an artist, i know the struggles, we have our ups and downs but i think if you have an artist you like, support them. \r\nI support Keen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Crashed into my friend with a space FORD F-150 and made him cry, then proceeded to make the Leviathan and all other cool ships from the hit dead game series destiny(Don't get into the game its dying and sucks your soul away) and would buy again, but anyway this game is great and cant wait to see space engineers 2 keep going in the positive direction :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like Space, you have owned sizable quantities of LEGO in the past, and/or you suspect (or have confirmed) that you have some form of Autism, ADHD, or both, stop reading these reviews and just buy the game already. \n\nThen buy the DLC's after you regain consciousness following your first session of hyperforcused ship/base building that ended with a sacrifice to Klang.\n\nA game from 2013 that has been continually updated by an actually good dev team that ACTUALLY PLAYS THEIR OWN GAME (such a thing is uncommon nowadays) is well worth the money, I'd say.\n\nIf you're still unsure, go watch SovietWomble's Space Engineers Bullshittery videos on YouTube. There are 5 parts, the first 4 being (comparatively) ancient, while the 5th is much more recent. Very enjoyable, very funny to watch.\n\nThen, buy the game. Trust me dud eit's worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Obviously ive put a fair bit of time into this game and it has its highs and lows. It is very enjoyable under the right circumstances and especially on servers if you can find one to fit your playstyle. However it does still leave a fair bit to be desired personally. It is very time demanding, from building things 1 block at a time then repairing in the same fashion if you dont have welders and blueprints to speed up the process. Its a very niche game I'd say and needs to fit you personally to enjoy it, otherwise its a safe bet you wont enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is just good. I am not going to waste much time saying more because I am going to play more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect for people who like to create, automate and dream themselves away in space.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing for its open world and its endless creativity!\nWorth 100x the money!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great creative outlet for me, a progressive game for my friends!! Whilst i like making all my things, there is also a way to make things off the workshop so you can focus on fighting, mining and doing other miscellanious tasks. With DLC's to change to look up with some different variations of blocks. No extra content is needed to really enjoy the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is just amazing. The freedom you have to build and explore, engage in combat, or just comingup with creative solutions for your current problems. If you've been thinking about buying this game but haven't, just do it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has a bit of a learning curve but once you get past that it as a game with endless possibilities",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is quite fun - especially with friends - and, unlike games made by most bigger devs, is still getting updates while the devs work on the sequel. It's certainly made better by the sheer amount of content-adding mods on the Workshop though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorites, just always hoping for a little bit more of interactive elements to make solo more replayable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still the best engineering game ever made, and always getting better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game has consistently gotten better and better over the years and is by far the best and leading game in this category. I have this many hours for a reason.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely fantastic game for those who enjoy space and creating things. The game is still getting updates even while the sequel is being created which very few other game developers seem to be able to manage in this day.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Great game, but honestly, no I wouldn't recommend it. \n\nIt's more of an engine for what COULD be a game that never was. \n\nThere's nothing to do, most the mods require DLCs, and they expect all the actual effort to come from the community while they shovel a copy+paste game as a \"second\" edition.",
      "voted_up": false,
      "votes_helpful": 59
    },
    {
      "review": "I honestly don't understand how people like this game so much. I played on survival. The entire time playing this game it was just a really bad experience, it's a cool concept but executed in the worst way possible for almost all features.\r\n\r\nIt has no functional tutorial, I watched a few hours of youtube videos to even learn how to play.\r\n\r\nThe entire game is just a slog of overly time consuming activities. The progression is pointless and shallow.\r\n\r\nPlay for about 10 hours, build a ship to get to space and congrats you have access to everything now and no more real progression to do with the new thrusters and reactor you can build.\r\n\r\nDespite that I built a space station, launched it, got it situated, built out with solar panels etc, build a large grid mining ship and....the large grid mining is crap.\r\n\r\nI resolved to just travel to each planet/moon for the achievement but then the game sent 1 pirate ship to the station, which spawned 3-4 more. The pirate out ranges the station turrets because despite their max range being higher, the auto aim function is limited to 800m. This led to the pirate destroying multiple turrets before I'd even noticed it was there.\r\n\r\nReloading backups didn't get far as the pirate had already spawned in on the earliest backup.\r\n\r\nIt's still recoverable if I wanted to put in effort but...why bother? The game just isn't fun and has almost no redeeming qualities. The entire time I was playing I was close to quitting, 3 other friends playing with me stopped before I did.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "game is great, IF YOU HAVE 100 FUCKING  DOLLARS TO EXPEND ON DLCs\n\notherwise, it's the most barebones experience where you  are kept away from building anything close to pretty, but constantly being teased by the blocks paywalled to you.\n\ni have most DLCs, at a time i had most, worst thing is  how they divide them:\n\nwant all TABLES? that is 4 DLCs, 4-5 bucks each.\nwant all storage? another 4 DLCs\nthey divide the blocks between DLCs, even when that separetesthem in an impractical way, it's cringe, it's exremely greedy, there are actual CONSTRUCTION BLOCKS behind a paywall\n\nthey added TWO fucking things to a previous DLC, decided to hike the prices of all DLCs a couple of bucks since \"they would be adding more content to previous DLCs\"\nAND NEVER DID IT AGAIN\n\n\ngreat game, greedy  fucking studio where they think it's allright to sell you updates\n\ni seriously love the game, but i can't recomend this fucking money sink, seriously, i also play rimworld, they also add  a DLC per update, diference is that the DLCs ARE ACTUALLY  GOOD, big content, loads of replayability\n\nthe DLCs in space engineers are daylight robbery\n\nwant a bed? 5$\nwant all variants of beds? that is like 15-20$\n\nthey will chunk out content and bar you entirely from decorating your ship if you don't pay them a AAA game's worth in DLCs\n\nworst thing is:\nthe community loves it,\nthey are so brainwashed that they like paying for fucking updates, and they will die on the hill that it's not as bad as it seems (some of them at least)\nthey celebrate mediocrity sold in moderately priced packages, it's a slippery slope where you pay for one, then another, then another until you notice you could have bought KCD 2, but no, you just had to get a fucking toilet for SE\n\nif at least there was a \"buy once get all future DLCs\" edition, it would be better, especially if it existed BEFOREthere was A THOUSAND of them\n\ngo play terraria, or From The Depths, it's cheaper, and they appreciaite you for something else than your wallet",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I came back to this game years later to be greeted by in-game advertisements plastered all over the screen and every single UI\n\nThis is fucking asinine",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "They are locking essentially basic shapes behind DLC now. I want to enjoy this game and the sequel so bad, but like, i cant be ok with this anymore. I know they need money, but this feels too far.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It felt like an entire football team came up with plays individually, threw them into a single document and expected it to play out.  However, what came out was more like a toddler soccer match where everything collided and it didn't make sense.  At least the soccer match was amusing, this was not.  The tutorial spent a lot of time talking, but not really giving you an idea of what to do.  It didn't teach you the game, it didn't really give you a great premise to build up and was just a VERY drawn out story that lacked...story?  So eventually, you didn't have a sandbox or really any drive to do anything.  It was just buggy and frustrating before any fulfilment/entertainment took place.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "shit game, items don't have a solid description, eg basic refinery: \"refines limited types of ores\". what am I supposed to do with that, test every ore if the refinery can refine it? building is fucked, inventory management is fucked",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game gives you limited building blocks and then it limits how many you can use with a stupid progression system bad game design.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you plan on playing with a gamepad, dont. Save yourself the headache. You would think a game thats been ported to console would work rightly so and youd be wrong.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its kinda fun, but all gameplay mechanics are pretty shallow and simple, the UI is horrible.\r\nBuilding is cool, but all the decorative blocks you might want to build with are locked behind dozens of PAID DLC.\r\nAnd now they made a paid sequel that should have been a free update to this game.\r\nShameless cashgrab, avoid. Play Stationeers instead",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not play this or even get it on sale. Play something else unless you enjoy things this aggressively unwieldy with so little payoff.\n\nThis game has got the worst new player experience that I've been through in recent memory. I tried to learn it and failed, and saw that the game's forums are inundated with years-old complaints regarding the poor usability. Fans tell anyone with a complaint to watch a youtube video to learn how to play. Regardless, this is clearly a long running issue with no fix on the horizon so you are better served by buying/playing something else.\n\nThe graphics seem ok for a game this old but the interface is a mess, and I think I remember why I first dropped it after playing it for 20 minutes 9 years ago. Icons are tiny, text is small and most indicator lights are weak or unintelligible. No information is readily available on the surface of anything (that is remotely useful) and there are so many menus to go through to do something as simple as placing blocks. Even the keybindings for common actions are strange. \n\nIn any case, I come back in 2025 and it's still a complete mess to play; why is there a sequel in early access when the first game is still this rough? The tutorial stopped progressing after I finished a couple of steps, and the included single player \"starts\" have almost no guidance. I want to enjoy this game and I love sci-fi settings and factory-building and base-building, so why does it feel hostile to me? I couldn't even dock my car to a base to do anything, nor were the endless menu tabs helpful in determining what I need to get building going. I was constantly shuffling items between containers for the majority of the hour that I played, and I didn't get to fly into space or anything more complicated than driving around and collecting resources. As another example, the tutorial introduced an enemy before it showed me how to equip or manufacture a weapon and ammo; why ?\n\nIs the game's community OK with it being so hard to do anything in a straightforward manner? Are mod creators and fans keeping the developers in the dark by not providing critical feedback? There's tons of games that provide a sandbox building experience with better UI than this one and the developers should learn from them. I played minecraft's earliest iterations and even that was smoother than this game now, 12 years after it's early release.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is okay, but to me, it's a little confusing for a psychics game. I mean the gameplay is alright! However, I had a lot of fustrations when I bought this game for $10.00, so there's that. And I will say that flying into the galaxy and landing on the moon and becoming like Neil Armstrong isn't worth it. The graphics are okay, but they are outdated which is expected for a (2013) video game.\n\nSide note: maybe if I get used to it I might change my review to a better one I still am a complete noob to this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I cannot recommend supporting a developer with such a regressive mindset towards technology. In a recent community discussion, a developer (Dan2D3D) stated regarding Linux support:\n\n\"Even my son asked me for a Linux PC this year and I told him a big NO. [...] I don't want to spend my time troubleshooting his games every months, we don't have problems at all with WIndows so we will keep using it.\"\n\nThis attitude is disheartening. Denying a request to use Linux is essentially gatekeeping knowledge and discouraging curiosity about how computers actually work. Instead of embracing the platform that powers the Steam Deck and the future of open gaming, the developer chooses convenience over compatibility and education. If this is how they treat their own family's interest in tech, it speaks volumes about how much they care about their Linux userbase.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "saving bugged in multiplayer so im just dead off spawn and my ship is destroyed when i join a friend fuck all my effort i guess lol",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is lowkey ass, have to buy literally 17 dlcs which is like 100$ and 20$ for the base game, and even then it wants you to buy more skins, and even then they just make a space engineers 2 to get more money. Like they don't update the game to make it better, and all the workshop stuff uses dlcs so the basegame is unplayable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is still amazing.\nBut it was much better a few years ago. Because you had the chance to find out a lot of stuff, without dying after a few minutes.\nYou had a small base at the start, that kept you alive, not forever, but long enough to figure stuff out. And more resources.\nI recently started more than 10 new games, and there was nothing in the area to keep me running (or building, for that). If you don't do it in the exact order, the game is now meant to be played, you loose.\nThat's exactly, what I did not expect from a game like this.\n\nAddendum:\nOk, Devs, this now totally sucks.\nIt was such a nice game, trying, building, programming...\nNow it's just die, die and die again. If I wanted to play Soulslike Games, I would have. This is just annoying.\nTo bad. You had the right ideas, but what it became... just not what I loved about this game.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "If you came here like me after some amazing coop planet crafter looking for more but better than sorry this isnt it or could be if you want to roam around a planet for hours not understanding anything or finding a solid logical idea of what you are meant to be doing here. Look at the screenshot and the huge overcomplicated control system from hell. Gyros,gravity,sliders everywhere no idea what you are doing and getting really fed up of no obvious purpose either. Hidden gun turrets kill you instantly and by then your coop partner has already quit and given up. Controls are a complete nightmare and its not a game you can simply load into coop and have fun out the box. This is more kerbal than planet crafter. Anyhow game looks amazing but that is it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Does not support ultra wide resolution. Team ignores this issue for years now",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The tutorial does NOT explain *HOW* to do anything.  Spent an hour there and STILL have no idea *HOW* to do *ANYTHING*.  \nTried quick start, \"Press X to make vehicle jump\"... I press X and vehicle flips over.  There is NO WAY TO FLIP IT BACK.  Game ruined.\nThe game is *WAAAAAAY* to complex to not have a functioning in-game tutorial.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "With the developers focused on its sequel, the future of space engineers seems bleak. They say space engineers will see continued support, but all their communication is about Space engineers 2. It seems like this game is doomed to be abandonware, as SE 2 is their \"revolutionary next step\". The only real reason SE 2 exists is to force players to re-buy their game. That's the problem with early access and long development times, SE's player base has already bought in and keen still needs funding for development, and it seems like the DLC's werent sufficient. And now we ought to expect they wont finish their second game before moving on to Space Engineers 3",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rather disappointed that this game decided to focus on releasing paid dlc during early access instead of adding it as base game content, and now they are already making a \"Space Engineers 2\".\n\nThis company went from making a cool game that was something I always dreamt of, to now becoming a company that just wants to leach all of your money, and I guarantee the same shit will happen with the second game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dead Game.  Official servers are crap, they have you stuck at 100m/s  too slow to make the game interesting at all.  Keen doesn't do anything for updating or development.  It's been the same for years.  They don't listen to player base, forcing people to buy their own stake in servers.  Admins abuse servers constantly.  Trolling players, deleting bases, launching random meteor showers in bulk, to remove players who expand \"too fast\" by their terms.  \n\nDLCS are just based cosmetic nonsense and do no functional changes to the game.  There is no concept of that game that draws people in, it's the same as alpha.. Nothing has changed other than the release of Space Engineers 2.. Which is just..  The same lame stuff with \"better graphics\"..",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have no idea what's going on. I was dumped onto the surface of mars with a few isolated buildings with nothing to do. No instructions, no goal.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "10 years later and it still runs like potato",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I've tried playing this game for years on multiple different systems with little success. It's always something either flat out doesn't work or is buggy. I recently booted up the game again just to give it a shot on my new (relatively decent) system, and it's a buggy hellscape. Audio crackling, placing blocks does this weird glitch where it seems to be cycling through every possible combination which results in it looking like someone doing alpha testing on how to render block placement. I have the same issue in various menus where my highlighted \"selection\" just infinite scrolls and there's no way out of the menu except to click off it. The camera controls (especially when in vehicle) just completely stop working correctly after using \"alt\" for free look. Frequent screen tearing. Menus that make little sense and are unintuitive. You could legitimately tell me this game were in alpha or beta testing and I would believe you. \n\nDespite this, it seems like it would be a good game, the concepts are interesting and I see why so many people are praising it. But I don't see why people are not criticizing it for glaring issues. From what I can tell the devs keep adding more and more content and charging hell of a premium for it but don't even address the core critical game breaking bugs. Let alone all the ones I just mentioned, and don't seem to care about a satisfactory user experience...at all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wish I had never played this absolutely terrible game. Waste of money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "after all these years this game still has random crashes at start and menu will have random freezes in the settings. Some people love the clang, not I",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I wanted to learn for the creative freedom this game provides but I am so tired watching Youtube tutorials on how to do this or that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its sucks ass fu ck ing this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is super difficult to follow and understand without watching hours of video tutorials.  Another I don't like is you can 't start from scratch and explore/build on your own.  You have to play a mission.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Looked cool and I was excited.\n\nThen when I logged in the tutorial was useless and everything was confusing. I don't mean \"user error that guy is dumb\" confusing; I mean \"terrible UI, terrible menu system, nothing intuitive\" confusing.\n\nI don't have time for crap like this.\n\nps- oh yes, and the 10 minutes I played I got a freeze for 10 seconds and a \"performance issue\" warning and I'm playing on a 5090.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game has been freezing non-stop about every minute or so making it nigh unplayable. I love this game but that doesnt matter when turns into a slideshow",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i saw this being played in the break room at skunkworks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dis shi ass",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this during the current free weekend. I have so far only played 3 hours so I can not say anything about the late game, but from these 3 hours I had  a truly awful experience. \n\nMany people here write that the game is too \"complex\" but I like complex games and my grudge has nothing to do with the complexity. During my short playtime I got extremely frustrated and annoyed because of three things: \n* Lack of a decent introduction\n* Tedious mining tasks\n* Bugs\n\nThe game starts with a very short tutorial on basically how to move around your character. After that you know nothing. How do I build stuff? What should I build? How do I get raw materials? How do I refine raw materials? I am not a fan of long tutorials, but you should add something to guide your new players to the game. It does not even need to be a tutorial, just giving the correct tools in the start might sometimes be enough to set players on the right track. Here we are stuck with a full UI and multiple pages of possible buildings etc, confusing and overwhelming you in an instant. However, this point wouldn't have been half as bad if it weren't for the next point.\n\nTedious mining. This is what I spent the most of my gameplay doing. Holding down my LMB to mine stone. Not even ore, stone. Maybe there is a faster way to do this, but I wouldn't know since nobody told me how to do it. To (try) and start a refinery I mined huge quantities of stone that was the refined into minuscule amounts of different resources. I had to grind my way to first create a basic refinery, in hopes of speeding up the process. Unfortunately I needed power, something I had to google my way to understand as there were no \"missing power source\" or other warning. I then built a windmill (since that was the cheapest power source building and I was really getting annoyed with the mining). After that I took on the slow and tedious task of build a basic assembler. And when this was finally done, we come to the last point. \n \nThe windmill disappeared! It was not disassembled, it didn't tip over or something. It just disappeared. A very long grind of mining just went up in smoke!\n\nAlmost every minute in this game I spent mining and refining rocks and since you are not introduced to how the game works, you have no clue if you are even working on the correct thing. Spending 30-60 min mining and then finding out that you have to mine at the very least 30-60 min more is not fun. If you really do not want to give guidelines and want new players to simply \"try things until it magically works\", then you have to make that try-part easy! You can not require a super long mining session for every time I want try something if you want me to keep trying! \n\nThere are probably a lot of players who, if they read this, would be able to point out flaws in my gameplay. How I could have mined faster, done some other build order or something. Maybe I didn't even need to mine? The point is that I didn't know those things, that I wasn't given the tools to understand it. I like to explore things on my own, but in this case I was given a full UI with no guidelines in such a nonchalant manner that I feel that the Space Engineers developers simply expect new players to google everything or grind. In other words, they do not seem to respect our time enough to actually introduce us to their game.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Look, i love the game, it's really cool what you can do in the engine and i would give it a 10/10...\nBut hiding blocks and features behind a paywall? No, this is just greedy and don't tell me otherwise. Selling Skins, Storymissions, Server Access or just the blueprints would be fine. Hell, you can put a battlepass into the game, but making big words for an update and hide the most important blocks behind a paywall, just so you can milk your fanbase a little more, without giving them actually what they wanted, is just evil. You are already paying for the base game, only to stare at 90% of the blocks, that are locked behind 24 different payed \"updates\".\n\nNo, i can not support something like this.\n3/10",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "This is not a \"Steep learning curve\". This is just outright hostile to beginners. This dev seems not to care about UX. The help system is barren, the only \"tutorial\" is a bunch of links to outdated YouTube videos where a guy is trying to explain mechanics of Survival mode while playing Creative mode where said mechanics do not exist. There is zero documentation in game, you basically have to alt-tab all the time when trying to learn. In most cases you have to guess about the fundamental mechanics of the game. I tried to learn to play this game at least 5 times from scratch and every time I got frustrated with the beginner experience. I really wanted to get into this game as it seemed promising, but the brick wall of zero explanation of a mechanically complex game is not worth it.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "(free weekend review)\n\nSeemed like a really promising game at first, played the first free trial they did back in the day. Build your own space ship or astroid base. Those features then were lacking, but it was simple and understandable.\n\nNow the game has become so super overcomplicated. Basically no tutorial, or what tutorial is there, is incomprehensible. Is unfortunate because the premise of the game is cool. It's just too complex, it's like a job to learn how to play the game.\n\nI also played a (suggested) scenario to maybe try to get into it, but it was rather confusing as well, and long and kinda tedious/boring too...\n\nThis would in principle also be totally my kind of game, but the fact that all this is so off-putting  for me should say a lot to those that know me well.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "A game where you build bases, vehicles and spaceships. Then use these to search for resources, mine them. Which in turn lets you build more and bigger bases, vehicles and spaceships. I keep returning to this every few years, hoping that the game has gotten better, it never does. Instead it seems to slowly get worse. The focus seems to be on modded creative mode large scale pvp. \n\nThe game is fun for a while when playing alone or with a friend or two, and it could have been great as a pve coop experience. Could have been, if only some work had gone into the single player, early game experience.  Its clear that this has not been the focus of the developers since release, and even then it seems after thought. There is fun to get from the sandbox, and a some fun to get from grinding through the game to space once. Unfortunately that is where it ends. Once in space its a completely blind search, at abysmally low speed at that. \n\n\nStarting in space used to work, but now its horrible. I would class it as impossible for a new player unless you get lucky or spend hours searching at random. There is no extra challenge on any of the other planets either. The difficulty is not of the fun kind where you are challenged to achieve something difficult quickly. Instead the difficulty is due to the inability to craft the needed due to grid size compatibility. You have hours to slowly realize that you must either exploit respawn mechanics, land, attack an ai ship which should be impossible since you dont have weapons, or randomly get lucky. None of which is fun or sensible. Which is such an obvious and stupid limitation is never seems more than frustrating. Its absolutely crucial to get higher max speed mods and a higher max range ore scanner mod. \n\nThe game desperately needs better pve and more interesting survival challenges, and more interesting progression challenges. And it really could have these things. It should not be that difficult to implement either, but its just not relevant to the devs it seems. \n\nAll pve starts are grindy, followed by an extremely slow extremely frustrating phase where you are looking for whatever ore you haven't  found yet. Followed by having nothing to do whatsoever except build, at which point you will miss a decent blueprint system, which in turn makes things grindy again. And if you do get around all this, the game is just empty. A pity really, I truly want a game like this, but one focused on pve, not pvp.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "There might be a good game here, but it's a fulltime job to get around the everything to find it. There's a complete and utter lack of feedback, so you can't figure out what the game wants to work within it's unknowable limitations. The interface is ghastly. The kbm controls are passable, but the controller support would be better off not existing, and using steam input instead, whoever designed them has never used a controller in their life, a common failing in the industry, sadly. I'd really like to dig into this and find the game, but it's endless frustration trying to pass the unending amount of roadblocks in basic human interfacing. Needs about 6 years more work, which it's unlikely to get at this point.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "So I tried this game when it was free for a weekend. Afaik there is no campaign, only \"scenarios\". I tried one called \"Lost Colony\", there were no directions, the game was just like \"Here you have some buildings, explore\". So I explored some rooms and after a while I realized I'm bored and I don't know what to do.\n\nThen I tried sandbox, after about 15 minutes of having to feed rocks into my pod to get SO MANY items to build a first assembler (again, no directions, I just assumed I need an assembler) I realized I'm bored again and there is nothing to do in the game.\n\nI guess this game is supposed to be played with other people but I see no point in playing it. It seems too shallow.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Great game, but honestly, no I wouldn't recommend it. \n\nIt's more of an engine for what COULD be a game that never was. \n\nThere's nothing to do, most the mods require DLCs, and they expect all the actual effort to come from the community while they shovel a copy+paste game as a \"second\" edition.",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "I didn’t get past the first real task of the tutorial, so take this review with a grain of salt.\n\nWhat was quite clear to me from the little time I spent with the game was that the user interface is incredibly obtuse, and the designers didn’t really grasp how tutorials are supposed to work. For example, it tells you to refill your hydrogen supplies from a machine, but doesn’t tell you that the machine is broken, what is wrong with it, or how you’re supposed to repair it.\n\nIt says a great deal about a tutorial that you have to look up stuff on the web to find out how you’re supposed to complete the tutorial. Also not promising was that some of the community responses I saw were toxic “you must be stupid” comments, and those useless, insulting responses were upvoted. It’s difficult for a new player to get help when a community is like that.\n\nAnother review here on Steam says there’s no tutorial. This isn’t true, there are a couple of tutorial scenarios available, but they’re easy to miss because you have to dig through the “start a new game” options a bit to find them, and they aren’t clearly labeled tutorials. \n\nThat’s part and parcel of how bad the game is at presenting new players with essential information. There’s no dedicated “tutorial” button, and the tutorial scenarios are not the defaults, you have to scroll past play options for experienced players to find the tutorial scenarios.\n\nI mentioned the UI. Another thing I ran into with the tutorial was that when I tried to operate machinery, I kept hitting dialogs that had absolutely nothing to do with what the machine did. I’m not sure what most of those dialogs did, but it says something that they came up first instead of essential controls.\n\nThe problem isn’t that the game is complex, it’s that it’s cryptic. Satsifactory’s a very complex game, but it’s also very good at teaching you what you need to know.\n\nIf you’re inclined to dive into this game, I strongly suggest either waiting for a free weekend to see what it’s like, or at least keep on eye on your play time so you don’t exceed the refund period.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "bad tutorial, bad interface, bad graphics. wtf am i even supposed to be doing? game doesnt tell me at all.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Keen has recently released a patch adding a hunger system that makes the game far more immersive.  now while playing the game you will need to constantly spam kelp sandwiches to stay alive, my only problem with the new system is that it is far too unrealistic, starving to death between meals every 10 seconds is not nearly fast enough, most humans can only live for about 5 seconds before suffering massive nutritional deficiencies.  I hope that they increase the amount of kelp needed to survive from 6 per minute to 12 in the near future as the current rate of starvation is ruining my immersion.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I don't like that it has so many DLCs, that it has to connect to the internet if I want to play offline, or that it shows ads on the home screen. Direct uninstall, comments, dislike.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "game is great, IF YOU HAVE 100 FUCKING  DOLLARS TO EXPEND ON DLCs\n\notherwise, it's the most barebones experience where you  are kept away from building anything close to pretty, but constantly being teased by the blocks paywalled to you.\n\ni have most DLCs, at a time i had most, worst thing is  how they divide them:\n\nwant all TABLES? that is 4 DLCs, 4-5 bucks each.\nwant all storage? another 4 DLCs\nthey divide the blocks between DLCs, even when that separetesthem in an impractical way, it's cringe, it's exremely greedy, there are actual CONSTRUCTION BLOCKS behind a paywall\n\nthey added TWO fucking things to a previous DLC, decided to hike the prices of all DLCs a couple of bucks since \"they would be adding more content to previous DLCs\"\nAND NEVER DID IT AGAIN\n\n\ngreat game, greedy  fucking studio where they think it's allright to sell you updates\n\ni seriously love the game, but i can't recomend this fucking money sink, seriously, i also play rimworld, they also add  a DLC per update, diference is that the DLCs ARE ACTUALLY  GOOD, big content, loads of replayability\n\nthe DLCs in space engineers are daylight robbery\n\nwant a bed? 5$\nwant all variants of beds? that is like 15-20$\n\nthey will chunk out content and bar you entirely from decorating your ship if you don't pay them a AAA game's worth in DLCs\n\nworst thing is:\nthe community loves it,\nthey are so brainwashed that they like paying for fucking updates, and they will die on the hill that it's not as bad as it seems (some of them at least)\nthey celebrate mediocrity sold in moderately priced packages, it's a slippery slope where you pay for one, then another, then another until you notice you could have bought KCD 2, but no, you just had to get a fucking toilet for SE\n\nif at least there was a \"buy once get all future DLCs\" edition, it would be better, especially if it existed BEFOREthere was A THOUSAND of them\n\ngo play terraria, or From The Depths, it's cheaper, and they appreciaite you for something else than your wallet",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "a game with thousands of hours of content but without a usable tutorial\ntold me to do something but never told me how to do it\nmaybe if I watch some hours long youtube video I would know how to play this game but no",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I honestly don't understand how people like this game so much. I played on survival. The entire time playing this game it was just a really bad experience, it's a cool concept but executed in the worst way possible for almost all features.\r\n\r\nIt has no functional tutorial, I watched a few hours of youtube videos to even learn how to play.\r\n\r\nThe entire game is just a slog of overly time consuming activities. The progression is pointless and shallow.\r\n\r\nPlay for about 10 hours, build a ship to get to space and congrats you have access to everything now and no more real progression to do with the new thrusters and reactor you can build.\r\n\r\nDespite that I built a space station, launched it, got it situated, built out with solar panels etc, build a large grid mining ship and....the large grid mining is crap.\r\n\r\nI resolved to just travel to each planet/moon for the achievement but then the game sent 1 pirate ship to the station, which spawned 3-4 more. The pirate out ranges the station turrets because despite their max range being higher, the auto aim function is limited to 800m. This led to the pirate destroying multiple turrets before I'd even noticed it was there.\r\n\r\nReloading backups didn't get far as the pirate had already spawned in on the earliest backup.\r\n\r\nIt's still recoverable if I wanted to put in effort but...why bother? The game just isn't fun and has almost no redeeming qualities. The entire time I was playing I was close to quitting, 3 other friends playing with me stopped before I did.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Played for a few hours this free weekend.  I wanted to love this game, but when I had to google how to get past the quick start, the game quickly wasn't for me.  It should be a polished game by this time with an adequate tutorial- but it just isn't there.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Bought the game because it's on sale. Just tried it, but so far i don't think it's worth it. Controls are not consistent (some doors can be opened with mouse, others need the F key), physics is kinda weird, like inside the spaceship you seem to be weightless, but when you jump overa hole and miss, you fall down, so suddenly no more weightless.\nAlso, the controls are very sensitive. I have to point the mouse exact on a terminal and nog a few mm left or right, or it doesnt respond. Last but not least it has a very steep learning curve.\n\nSo i might give it a chance in the future but right now, the game was disappointing enough for me to not even complete the first missions.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Overcomplicated to the point where they lost me at the tutorial... \r\n\r\nThank you for the option to play for free, but it's gonna be a no from me.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "After selling thousands of copies and years of success, the devs decided to put advertisments in the game that you cannot disabled, integrated into the UI so you cannot avoid them. This is not excusable. Avoid this game, and avoid this developer.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This game is confusing.\nI SO want to like it. But would I recommend this game? I don't know!\nWell, I just bought it.\nI played during the free weekend, and (near-) died a couple of times. The game is known to have not a learning curve, but a learning cliff. To make that better, the game has no tutorial worth the name. They essentially push you off that cliff without a parachute. Then, to make things even better, they regularly mix things up, so even a youtube guide that's one year old is already outdated. So even that parachute is gone.\n\nI have never began a new game where I have to turn to youtube video's to understand even the most basic things. I've never began a new game where even youtube guides didn't help. It's insane. I can't recommend a game like that! If you can't be bothered to include a tutorial, I can't be bothered to recommend it. That's fair, right?\n\nSo, why did I just buy it? Would I recommend it? I don't know! Do you like jumping of a cliff without parachute? If yes, then I recommend it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The worst tutorial ever!\r\n\r\nThey even dont try to explain anything, if you want to understand how to play you will be forced to watch hours of youtube videos.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I am genuinely mad at myself for wasting so much time believing the game would get better when it doesn't, I didn't even PAY for the game and I'm mad, I really wanted to like this game, but it's just honestly terrible, this game doesn't even feel like a complete game and yet they're already making a new one. This game came out only 6 years ago yet the only indicator that it had come out at the time is the fact that my PC which has a RTX 3060 Ti ran like terribly, freezing up at times. As someone who has played around in some game engines like godot and unity I could never imagine making a game so un-intuitive with the control scheme and mechanics, it almost seems intentional, I can only hope that the sequel will completely reworked.\n----------------------------------------------------------------------------------------------------------------\nControls & Building: Terrible\n- Normal interactions with refining and crafting requires you to go into 2 of about 5 separate menus, and if you want set an assembler to make all the components to a building or part you then have to navigate to an entirely new set of menus and scroll to eventually find the part that you want\n               +  this could be fixed by having a single menu for crafting and inventory and not having every single intractable item linked to each other within a grid/base \n               + (Revamping the build menu and making a dedicated grid/base status panel and getting rid of the menu would also somewhat fix the maze of menus issue but there are just so many issues with the presentation of options that to truly fix the problem you would have to start from scratch)\n\n- The way that the keys are mapped to certain actions are baffling\n              + In a game where both mouse and keyboard is required, I don't understand why someone would choose a K or I key to merely interact and open up the menu of a simple refinery or assembler when the E key is right there and almost never used.\n              + they also made inspect, home, PG-UP/DOWN, and End key to be the keys used to rotate objects while building which was not needed, there where other keys that could've been used \n\n- Mechanical Parts on rovers and other crafts can only be controlled from the settings menu of the part, which requires not only navigating to one of the 5 menus, but also requires scrolling to find the part out of every single part that is not a building block which is ALOT of parts even on smaller crafts, the only way to change this is either through mods or using the gyro part to make it follow the mouse if setup PROPERLY (I cannot attest to the efficacy of either method because I have not tried it and I have no intention to ever touch this game with a 20 ft pole ever again)\n\n- Only two types of structural blocks in the base game besides all variation with corners and different shapes, but what I don't understand why they didn't just make differently modeled basic blocks to add more variety, they do have a paint and texturing option, but with the textures being behind a paywall, most crafts end up looking kind of bland, it really wouldn't take much work to add different blocks if the game was programmed halfway decently, just open up blender and make similarly sized components.\n--------------------------------------------------------------------------------------------------------------\nPerformance & Visuals: Terrible\n- Poorly optimized and frequently immediately switches from being stormy to clear which hurts the immersion, even with a top of the line computer this game runs terribly, no point in dwelling on it as most people don't play this game for the visuals\n--------------------------------------------------------------------------------------------------------------\nGrinding: Absolutely horrible\n-Without the terrible controls the game would still be grindy, some spawn locations don't have stone for miles and others don't have ice for miles, which are both necessary for progression in the game and stone is normally needed in MASS amounts to even start a base or make a craft\n\n-Even if you spawn in a location with both stone and ice you'll quickly become away that you'll need cobalt which in my 11 hours of playing the game I have not come across or detected once, you cannot make ANY thrusters without it so you'll have to find cobalt with a rover that has an ore detector or get lucky \n\n-The tech tree is also pretty confusing at first, the tutorial at the beginning of the game doesn't even mention it even through it is an integral part to the game, it's supposed to help the player get a sense for how the game should progress and which order resources should be obtained, but it's not even explained how to unlock items it just gives the crafting requirements and the menus like all other menus in this game looks terribly in formatting.\n-----------------------------------------------------------------------------------------------------------------\nThis game could've been so much better, but every step of the way it seems to purposely self sabotage itself, the ideas they present and the concept are amazing, but I feel like they really tried to make their game mechanics distinct from the rest of the genre without thought of what it would do to the game quality or to the player experience, for example the assembler is basically like any other crafting bench in the open-world survival genre except the crafting and inventory menu are separate, which does basically nothing to how it works except you can't directly take the final product or materials without going back to the inventory menu, even watching other people play the game it doesn't seem to actually have any real reason for the menus being separate, even in the later game. \n\nThis game is a testament to why game developers normally take inspiration from each other instead of reinventing the wheel, in numerous forums I see people recommending mods to people to fix basic mechanical issues within the game so it's PLAYABLE, if I had made a game and saw that my own players were fixing basic mechanical issues within the game I would be so unbelievably disappointed in myself and I would try to rework the game from the ground up. The studio touts it's games as a way to get kids involved in stem and yet it would probably do the complete opposite.\n\n\nI cannot fathom how someone's ego could be large enough to even try to say that's the case with a game as bad as this, you served shit on a platter and called it Filet mignon with no hesitation, you \"CEO\" Marek Rosa have absolutely no humility and as someone who founded a game studio it's disappointing but no surprise that you think AI is the only way understand the universe when you have as much creativity, intelligence and taste as a calculator.\n\n(for context Marek Rosa also founded an AI company and invested 10 million dollars into it, if only he could invest such money into the games his studio makes, this review wasn't revised so forgive me for being so all over the place)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I came back to this game years later to be greeted by in-game advertisements plastered all over the screen and every single UI\n\nThis is fucking asinine",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They are locking essentially basic shapes behind DLC now. I want to enjoy this game and the sequel so bad, but like, i cant be ok with this anymore. I know they need money, but this feels too far.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ok, I honestly tried to like this game. And I can see why people like it. From what I've seen, there might be great possibilities to build to your liking, to explore and to do lot's of fun stuff. But holy shit this game is abysmally designed in terms of actually teaching you how to play. No tutorial except for a couple scenarios, one of which is not even labeled as a tutorial, and the other is just a bad tutorial. I found some great videos on Youtube, and I managed to kickstart my base, but then I decided to build a rover, and it just came to me, that I have to watch another 20 minutes video just to place all this shit right. Because the game just doesn't tell you anything at all, save some very basic hints. And this is definitely not my Idea of fun. Plus the UI is clunky and not intuitive. Plus technical issues... Sorry, but no. \nIf I bought it, I'd refund it, but I played it during the free weekend, so I had plenty of time to try to understand this game. There is obviously lot's of gameplay, but there is literally no game design. And that's a pity.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "really buggy multiplayer and seemed very uninspiring",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I want to like it, But it has the downfalls of so many games. If i'm on a planet with normal \"Earth\" gravity, I shouldn't float when i jump. Causing me to float over or slide off of blocks. \"Vehicles\" should not hit ABSOLUTELY nothing and just flip heads over tails, And i kept running into an issue where i could not get my Assembler and H2/02 generator to run without saving and re starting the game. This is one of those it's fun to watch someone else play the game AKA Rust, But just gets frustrating with the poor/odd decisions made by the developers, \n\nSeems like the game is one of those \"The players will fix it with mods games\" As anyone having fun playing it has like 500 mods installed",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Space Engineers: A game about engineering in space that refuses to give you any sort of meaningful or relevant information required to engineer in space.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Disappointing game.  Could not figure out any of the controls.  Stuck in the beginning spot.  Walked around like an clueless person opening and grinding doors.  The videos really make it look great.  I so wanted this game to be my next game that I get hooked on.   Waste of bandwidth to download.  Deleting now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Having almost every item in the build menu greyed out and locked behind paid DLC that can't be filtered out is embarrassing.\n\nIt looked eh but I've deeply regretted getting this with the lack of instructions on how to do literally anything.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It felt like an entire football team came up with plays individually, threw them into a single document and expected it to play out.  However, what came out was more like a toddler soccer match where everything collided and it didn't make sense.  At least the soccer match was amusing, this was not.  The tutorial spent a lot of time talking, but not really giving you an idea of what to do.  It didn't teach you the game, it didn't really give you a great premise to build up and was just a VERY drawn out story that lacked...story?  So eventually, you didn't have a sandbox or really any drive to do anything.  It was just buggy and frustrating before any fulfilment/entertainment took place.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Impossible to understand \nthe multiplayer barely works \nnot very fun :(",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game barely has a tutorial. It just throws you in to the game and you have to figure out the rest. The \"tutorial\" the game has isn't that helpful.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is complete trash, and I had to fight against the interface at every turn to try to figure out what I was supposed to be doing, without success. The engine is trash, the design is trash, and the mechanics are trash. This isn't even worth the $5 it's current on sale for.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "this game gives you limited building blocks and then it limits how many you can use with a stupid progression system bad game design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you plan on playing with a gamepad, dont. Save yourself the headache. You would think a game thats been ported to console would work rightly so and youd be wrong.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its kinda fun, but all gameplay mechanics are pretty shallow and simple, the UI is horrible.\r\nBuilding is cool, but all the decorative blocks you might want to build with are locked behind dozens of PAID DLC.\r\nAnd now they made a paid sequel that should have been a free update to this game.\r\nShameless cashgrab, avoid. Play Stationeers instead",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is incredibly great other than the fact that I can't build multi grid ships in survival. The reason for the thumbs down is because the developers declined to do anything about it and that seemed to happen around 2018 or 19. And i can't find any mods to help with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They said it was a \"Mostly Positive\" simulation sandbox...\r\nSo I tried running over a wolf with my ~3000kg van at full speed, a few times.\r\nThe wolf took direct hits and still healthy.\r\n\r\nThe UI is also annoyingly complicated.\r\n\r\n\"Mostly Positive\" simulation game, huh? At least I got my refund in time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is okay, but to me, it's a little confusing for a psychics game. I mean the gameplay is alright! However, I had a lot of fustrations when I bought this game for $10.00, so there's that. And I will say that flying into the galaxy and landing on the moon and becoming like Neil Armstrong isn't worth it. The graphics are okay, but they are outdated which is expected for a (2013) video game.\n\nSide note: maybe if I get used to it I might change my review to a better one I still am a complete noob to this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I cannot recommend supporting a developer with such a regressive mindset towards technology. In a recent community discussion, a developer (Dan2D3D) stated regarding Linux support:\n\n\"Even my son asked me for a Linux PC this year and I told him a big NO. [...] I don't want to spend my time troubleshooting his games every months, we don't have problems at all with WIndows so we will keep using it.\"\n\nThis attitude is disheartening. Denying a request to use Linux is essentially gatekeeping knowledge and discouraging curiosity about how computers actually work. Instead of embracing the platform that powers the Steam Deck and the future of open gaming, the developer chooses convenience over compatibility and education. If this is how they treat their own family's interest in tech, it speaks volumes about how much they care about their Linux userbase.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Do not play this or even get it on sale. Play something else unless you enjoy things this aggressively unwieldy with so little payoff.\n\nThis game has got the worst new player experience that I've been through in recent memory. I tried to learn it and failed, and saw that the game's forums are inundated with years-old complaints regarding the poor usability. Fans tell anyone with a complaint to watch a youtube video to learn how to play. Regardless, this is clearly a long running issue with no fix on the horizon so you are better served by buying/playing something else.\n\nThe graphics seem ok for a game this old but the interface is a mess, and I think I remember why I first dropped it after playing it for 20 minutes 9 years ago. Icons are tiny, text is small and most indicator lights are weak or unintelligible. No information is readily available on the surface of anything (that is remotely useful) and there are so many menus to go through to do something as simple as placing blocks. Even the keybindings for common actions are strange. \n\nIn any case, I come back in 2025 and it's still a complete mess to play; why is there a sequel in early access when the first game is still this rough? The tutorial stopped progressing after I finished a couple of steps, and the included single player \"starts\" have almost no guidance. I want to enjoy this game and I love sci-fi settings and factory-building and base-building, so why does it feel hostile to me? I couldn't even dock my car to a base to do anything, nor were the endless menu tabs helpful in determining what I need to get building going. I was constantly shuffling items between containers for the majority of the hour that I played, and I didn't get to fly into space or anything more complicated than driving around and collecting resources. As another example, the tutorial introduced an enemy before it showed me how to equip or manufacture a weapon and ammo; why ?\n\nIs the game's community OK with it being so hard to do anything in a straightforward manner? Are mod creators and fans keeping the developers in the dark by not providing critical feedback? There's tons of games that provide a sandbox building experience with better UI than this one and the developers should learn from them. I played minecraft's earliest iterations and even that was smoother than this game now, 12 years after it's early release.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "saving bugged in multiplayer so im just dead off spawn and my ship is destroyed when i join a friend fuck all my effort i guess lol",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is lowkey ass, have to buy literally 17 dlcs which is like 100$ and 20$ for the base game, and even then it wants you to buy more skins, and even then they just make a space engineers 2 to get more money. Like they don't update the game to make it better, and all the workshop stuff uses dlcs so the basegame is unplayable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is still amazing.\nBut it was much better a few years ago. Because you had the chance to find out a lot of stuff, without dying after a few minutes.\nYou had a small base at the start, that kept you alive, not forever, but long enough to figure stuff out. And more resources.\nI recently started more than 10 new games, and there was nothing in the area to keep me running (or building, for that). If you don't do it in the exact order, the game is now meant to be played, you loose.\nThat's exactly, what I did not expect from a game like this.\n\nAddendum:\nOk, Devs, this now totally sucks.\nIt was such a nice game, trying, building, programming...\nNow it's just die, die and die again. If I wanted to play Soulslike Games, I would have. This is just annoying.\nTo bad. You had the right ideas, but what it became... just not what I loved about this game.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "If you came here like me after some amazing coop planet crafter looking for more but better than sorry this isnt it or could be if you want to roam around a planet for hours not understanding anything or finding a solid logical idea of what you are meant to be doing here. Look at the screenshot and the huge overcomplicated control system from hell. Gyros,gravity,sliders everywhere no idea what you are doing and getting really fed up of no obvious purpose either. Hidden gun turrets kill you instantly and by then your coop partner has already quit and given up. Controls are a complete nightmare and its not a game you can simply load into coop and have fun out the box. This is more kerbal than planet crafter. Anyhow game looks amazing but that is it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Does not support ultra wide resolution. Team ignores this issue for years now",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The tutorial does NOT explain *HOW* to do anything.  Spent an hour there and STILL have no idea *HOW* to do *ANYTHING*.  \nTried quick start, \"Press X to make vehicle jump\"... I press X and vehicle flips over.  There is NO WAY TO FLIP IT BACK.  Game ruined.\nThe game is *WAAAAAAY* to complex to not have a functioning in-game tutorial.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "With the developers focused on its sequel, the future of space engineers seems bleak. They say space engineers will see continued support, but all their communication is about Space engineers 2. It seems like this game is doomed to be abandonware, as SE 2 is their \"revolutionary next step\". The only real reason SE 2 exists is to force players to re-buy their game. That's the problem with early access and long development times, SE's player base has already bought in and keen still needs funding for development, and it seems like the DLC's werent sufficient. And now we ought to expect they wont finish their second game before moving on to Space Engineers 3",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rather disappointed that this game decided to focus on releasing paid dlc during early access instead of adding it as base game content, and now they are already making a \"Space Engineers 2\".\n\nThis company went from making a cool game that was something I always dreamt of, to now becoming a company that just wants to leach all of your money, and I guarantee the same shit will happen with the second game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is super bloated now. i miss what this game was in 2013. do not recommend. like when you eat too much and you get fat... this game is too fat now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dead Game.  Official servers are crap, they have you stuck at 100m/s  too slow to make the game interesting at all.  Keen doesn't do anything for updating or development.  It's been the same for years.  They don't listen to player base, forcing people to buy their own stake in servers.  Admins abuse servers constantly.  Trolling players, deleting bases, launching random meteor showers in bulk, to remove players who expand \"too fast\" by their terms.  \n\nDLCS are just based cosmetic nonsense and do no functional changes to the game.  There is no concept of that game that draws people in, it's the same as alpha.. Nothing has changed other than the release of Space Engineers 2.. Which is just..  The same lame stuff with \"better graphics\"..",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "almost nothing is explained, and anything that is explained is explained poorly, batteries dont hold charge, solar panels cant charge batteries, and thrusters are extremely weak, dont buy unless you want to be enraged every second of it, and its also extremely tedious",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have no idea what's going on. I was dumped onto the surface of mars with a few isolated buildings with nothing to do. No instructions, no goal.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "10 years later and it still runs like potato",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Amazing Concept. But three vital things missing from basic game (not modded). Communications are busted and the requirements to get them is just.... why? should be able to communicate immediately. Second thing if your survival kit gets destroyed. GL because it will take up to an hour plus to reach the destination unless your ungodly lucky and spawn nearby. third thing is if you want to play with your friends you need to be an expert at navigation and have extreme patience because there's no indictors even when you've established a faction that let you know where your friends are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't recommend; this type of game requires multiplayer to be fun. Getting it refunded",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shit game, items don't have a solid description, eg basic refinery: \"refines limited types of ores\". what am I supposed to do with that, test every ore if the refinery can refine it? building is fucked, inventory management is fucked",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game gives you limited building blocks and then it limits how many you can use with a stupid progression system bad game design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you plan on playing with a gamepad, dont. Save yourself the headache. You would think a game thats been ported to console would work rightly so and youd be wrong.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've tried playing this game for years on multiple different systems with little success. It's always something either flat out doesn't work or is buggy. I recently booted up the game again just to give it a shot on my new (relatively decent) system, and it's a buggy hellscape. Audio crackling, placing blocks does this weird glitch where it seems to be cycling through every possible combination which results in it looking like someone doing alpha testing on how to render block placement. I have the same issue in various menus where my highlighted \"selection\" just infinite scrolls and there's no way out of the menu except to click off it. The camera controls (especially when in vehicle) just completely stop working correctly after using \"alt\" for free look. Frequent screen tearing. Menus that make little sense and are unintuitive. You could legitimately tell me this game were in alpha or beta testing and I would believe you. \n\nDespite this, it seems like it would be a good game, the concepts are interesting and I see why so many people are praising it. But I don't see why people are not criticizing it for glaring issues. From what I can tell the devs keep adding more and more content and charging hell of a premium for it but don't even address the core critical game breaking bugs. Let alone all the ones I just mentioned, and don't seem to care about a satisfactory user experience...at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The only good thing about this game is mining. if you dont know how to play dont bother",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "absoloutly horrendes i cant stop playing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not worth it too much crashes even when fixed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wish I had never played this absolutely terrible game. Waste of money.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}