{
  "positive": [
    {
      "review": "I am going to be completely honest here, this game is one of the best I've played. The graphics are smooth and beautiful to look at, also the game play is awesome even if it is repetitive. Love the way how different strikers have so many different approaches. Especially melee mechs since you really need good control (stfu you melee haters Stellarus and the 2 other melee are a great f***ing mech).\n\nBesides the absurd prices the Ace Recruitment offers (Please lower the pricing Seasun) I don't get why people say this game was extremely P2W (Pay to Win) early on. Yea maybe the pricing is weird but the mechs are unique in their own way and you actually need to grind for them. And most of the so called \"P2W\" items usually are just cosmetics anyways\n\nEven the character customization is great (In many ways) and is very in depth. Almost taking the poll that stupid question on which game can produce the most thicc\n\nOverall I love how this game is turning out and I will continue to support this game\nHope you enjoyed my yap session lol\n(I am not f***ing glazing it I actually love mecha break alot)\n\nEdit: Seasun you should remove covert operations because that is like the go to place for alot of people and it is really f***ing up the operation VERGE queues",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "As a devout 'single player games will always be better than online multiplayer ones' kind of guy, I gotta say, Mecha Break is pretty fun.\n\nIn terms of moment-to-moment gameplay, Mecha Break is really fun. Fast combat, snappy controls, and there's actually quite a bit of variety in the mechs, to the point that I can't say any of the current lineup is any similar to any other ones. You've got the drill-spear mech, the stealth sniper mech, the [i]air[/i] sniper mech, the absolute tank mech, plane mech, heal mech, the list goes on. I want to say that some could use a bit of tuning (looking at you Welkin), but it's possible that I just suck at certain matchups. The mechs and moment-to-moment gameplay carries the whole game, I think. Because outside of that, I wouldn't say Mecha Break sets any standards.\n\nFor the content, I admit I'm not sure I can be a proper judge for it, because I usually hate multiplayer online PvP games and am not very familiar with them, but by itself, Mecha Break feels a tad lacking. You've got the default 6v6 mode with several different types of missions, you've got the 3v3 arena that's basically just a Deathmatch mission from the 6v6 mode, and you've got the extraction shooter mode that seems to have hardly any players and also seems to be the only feasible way to earn any amount of the premium currency as an F2P, because you can sell your loot in the in-game marketplace and pray to the mech gods that someone will buy.\n\nThat's also my main criticism, I suppose: there's hardly any way for F2P to earn premium currency; not even a pittance. Most cosmetics, notably outfits, can only be bought with premium currency too, so as someone who loves cosmetic options in games, I can only ask the mech gods why.\n\nBack to the game modes, specifically the ranked 6v6 one. It is ranked, and you get rewards at the end of every season. The rewards? Lootboxes. Yeah, grind your weekend away, place well, and you get a [i]chance[/i] of rolling...something. Is this the standard for online PvP games? I wouldn't know, but if it is, good lord. I'm not even sure what significant thing you can get out of the lootboxes. Most I've gotten out of them are paltry amounts of seasonal points and dupes upon dupes of paintjobs for the mechs that I'll never use because I already have a favourite--and also most of them look like old carpet.\n\nThe seasonal points are used as currency, by the way; you use them to buy newly-released mechs (not the default lineup; those are free), items for the extraction mode, and that's about it. There are cosmetics that you can buy with them, but they're locked behind the premium pass. Yeah, you need to spend money to get the privilege to spend in-game money.\n\nAnd that's about it, I suppose. Good gameplay, everything else is ehhhhhhhhhhhhhhh. I've been picking it up from time to time since launch, and while I enjoy my short bursts of mech on mech action, there isn't really much incentive to keep playing. Still, I recommend at least to check it out, if not only for the mechs and gameplay.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I really, REALLY LOVE this game! I really do. \r\nBut I need PvE in this game. I don´t like PvP at all. I HATE fighting other people in games. It really takes the good vibes and joy out  of playing the games.\r\nI have heard that this game is getting PvE, that it is in the future works. So I give this game a YES because I know it will get bette rin the fututre. But as it is right now, I don´t want to play it tbh. \r\n\r\nThis is just constructive critisim: PLEASE; DO PVE a main par tof this game! I would LOVE this game so much if it had single player none PVP content to play. Even if you could just fight bot or something I would be happy.\r\nI just want to goof around and play with cool weapons and mechs without having othe rpeople mellow my vibes and ruin my fun. I personally don´t care for it. But I know that is in the works so I am just waiting to see what happens.\r\nDevs, I wish you all the best and I hope you will make me really happy in the future ;)",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "OK for like no reason possible, you can use the bathroom in this game and I think thats the funniest shit possible (no pun intended)",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "A few rough edges. Good performance and stability, Matchmaking feels fair. Mechs offer different playstyles which are relavivly balanced.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Mecha Break has huge potential in how it moves forward with future gameplays and maps. The beauty of piloting a mech is not just to fight the opposing mech of a different faction but to protect your people. That is why a lot of mecha type anime like gundam is a fan favorite because it brings about a sense of character growth. For this game buying mechs and choosing a pilot based on looks brings little to the table. if we can incorporate a deeper storyline for characters and maybe as you play and reach a certain power level threshold you can slowly unlock flashbacks of said character. As for gameplay throughout most watched or read mecha anime or manga they are not just limited to fighting on land and the fact that our ship is stationary in the sky or space even should be a base to plan for a map where combat is in full 0 gravity which would mean your skills would be tested even more as there would be little to no cover so mastering your mecha or even mastering a different type of mech is crucial to achieving victory. and to create an even bigger player base we can add alien invasion since if our technology is advanced enough to traverse space why not use that to our advantage towards acquiring advanced tech from the aliens. The mode could either be an invasion on multiple areas of the map and players across all platforms must combine their strenth to repel the enemy. On the flip side once enough advanced tech is acquired and the mech is up to the power level we can initiate our own invasion of the enemy however this time players must compete against each other to collect the highest points and may allow for revival of another player from a different team. Will you choose to claim the throne for yourself or help others and achieve greatness together while also competing. The positive of the defense is that you would have npc help while also in a group of 12 or more real mech players supporting each other. As for initiating the invasion due to leaving friendly air space you are now solely responsible for bringing back your mech and should it be completely destroyed in battle you must return back to base and wait out the timer to be able to invade again with that mech. During defense there is no cooldown however should it be destroyed in an initiated invasion it is locked for both modes for a certain time or you can use your in game points to repair it right away. Anyway these are just some of my ideas to expand the game for a more enjoyable experience than fighting the same mechas over and over again. cooldowns would last no more than 10 minutes",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "this is one of the best mech game i played other than armored core series, i like the feeling when  controlling the mech, it feels like piloting heavy machine and seeing lots of parts moves.. there's some area need to be polished and improved here and there but this is only new mech game that feels like armored core and titan fall in terms of \"heavy\" movement and moving parts.. i hope this game will keep improving and will get recognition by other mech fans out there..",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Very fun PvP mech game, I don't play enough to get too into the smaller details, but I know I have a good time whenever I get a chance to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a great mecha game but the game population is low and game lobbies are usually filled with bots. You'll still have fun but it's not the same. You'll get actual players in ranked mode but usually at higher tiers. \n\nIt's a shame it is not more popular.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty fun so far, but honestly i wish they do more with the PvE as they have a pretty solid AI for the enemy, and wished they delved or make a story for it especially how the \"tutorial\" literally puts you in a boss fight",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I'm wainting for changes. \n- Mashmak with more pve aspects (unlimited, solo, dynamic improvised(on-the-fly) missions, etc);\n- overhaul combat system enabling even more tactical and no tryhard feeling;\n- toggle boost speed buttons , not even the ones  already exist (sniper) work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's a really great core game here - the design/art style is incredible, the mech fantasy is alive, and the combat is fluid, fun, and feels like what piloting a mech would feel like (I think?).\n\nThe problem is there is no strong sense of identity. The game feels 'aimless' and almost experiemental as they continue to revamp things. I felt like I understood the \"what\" of the game in prior beta tastes than in Season 2. If the devs could choose a lane, they have a really fantastic core product to work with here. \n\nThis is a good game, its all there, and I hope it can get out of its own way. Present day, I still absolutely recommend, even if you just dabble here and there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is far more solid than it probably should be. It has a solid earning system and it does have a pay to play option, but the game is cool enough to not even spend the money. TRICERA is the best striker in game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is a gooner game but you never see the goon pilots in game, only after the game MVP's pilot is shown but the gameplay is pretty good, games great with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game reminds me of playing gundam games on psp in the good ol days. Tho, I wish the cosmestic could be easier to get instead of lock behind of paywall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the game its fun but there are problem like unbalnce team or just player dc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty fun. I enjoy the combat and unique mechs. my only complaint is maybe the music? there's definitely a small part missing to this game. I enjoy the game but nothing really makes me feel like i wanna come back the next day and play. I'm okay with missing out. Its missing something that can really hook you and keep you coming back for more and I feel like what that could be is maybe visuals and sounds. Moving around the menu and even in the battlefield sounds a bit stale. reguardless tho, i will definitely continue to play in the hopes it improves",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great mecha game. Played the betas and S0. Took a break and came back for S2 to take a little break from Rivals S5. All the mechs are viable and it's really just how good are you vs the other mechs. Really hope the player base gets bigger again!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is new and there are not a lot of players right now but it is growing. If you are into mecha stuff (I'm not) you should give it a try",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game but the game play and mission just too repetitive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like the mech fighting each other. The battle is intense. Every mech can be strong although some of them looks overpowered, i.e. Tricera. The game is mostly F2P except mashmak. You need to craft expensive beacon to get more in-game points.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game solo, but better with friends. As long as the devs keep listening to player feedback like they have, I can see the game live to last a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a woefully flawed game that I have doubts will last 2 years; but it will be an awesome two years.\n\nLet's start with the good:\n\nThe mechs are very varied covering many different roles, all feel like they have a place depending on matchup and map. The game runs very smoothly and the visuals are very impressive, although sometimes cluttered. \n\nThe combat is some of the best fighting mecha I've ever played, it reminds me of playing those arcade mecha games with the dual sticks, so much fun I forget to blink sometimes.\n\nMashmak (extraction mode) has a pve mode that , in my opinion, is a staple of the game. It's fun, can be challenging, lets people play at their own pace without pvp sweatiness that plagues extraction games normally.\n\nThe battlepass, which is 10 euro for me, provides ample credits to buy new mechs and various other cosmetics...speaking of cosmetics\n\nTHE BAD:\n\nthey have horribly priced cosmetics for special mechas; i think they START at 50 euro, which is eye-watering for a game with no established presence. They don't do anything different, just maybe custom animations or whatever, but still. Holy molllyyyy\n\nAI voice acting; I can give this a pass somewhat as it allows dev's to cut corners on costs and really it doesn't matter all that much in a fighting game, but it does reduce the overall soul of the game. Part of the staying power of games is the memorable voicelines even if they aren't voicelines at all (wololo for instance). With AI it's less impactful.\n\nand lastly, the direction of the game; \n\nThere have been a lot of grumblings on the lack of transparency of addressing issues with the game (namely player count and content) and the devs have made more effort as of late, but if it's too late or not, we shall see.\n\nOverall; the game is free. You owe it to yourself to at least try a few hours of it. It's my favorite arcade fighting game thus far, I hope it succeeds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is it the best game ever? The best mecha game? The best PvP game?\r\nNo.\r\nIt has issues. Balance is not always the greatest, new maps would be nice, the prices in the shop are way too expensive, etc..\r\nBut the maps are fun, the shop is entirely optional, there's likely a mecha you'll enjoy.\r\nAnd lets be honest, thats the fun part, piloting a big mecha in epic fights.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the game when it first released and I loved the direction (excluding the ferocious micro-transactions) been looking forward to getting back into this one, maybe on a Steam Deck 2/Steam Machine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great casual game who doesnt like a good mecha war.\nbetter with friends if you wanna get competitive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nicee game but need more improvement. Need joy stick",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!  Really hits that Z.O.E. itch that no game has really been able to hit ever since the PS2 days.  The character creator is fun!  it's a bit hard to make a \"macho man\" or anything along those lines but you can do it if you try, and they let you make one avatar of each gender.  One of each of the two human genders I should say, it doesn't make up any fantasy genders or anything along those lines.  You can even name them something different and they have their own tracked stats which is pretty cool to be honest.\n\nIt has a surprising amount of game for something that's free, and honestly surprisingly little to purchase which is almost a bummer since I'd happily throw $20 dollars to the game every once in a while for new outfits for the avatars or tune ups for the mechs.  \n\nAnd yes it's an awesome mech game with lots of different play styles!  well worth diving into and fooling around on!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mecha Break is a fun mech combat game that i've enjoyed. The gameplay loop is fun, with unique set of weapons and classes for each mech you pilot. I'm not normally into pvp games, but i've really enjoyed this one. PVE mode is fun too, but it can be directionless from time to time. \nCharacter and mech customization is excellent, and the game throws you stuff to customize them, so it is really cool. I'm most likely wrong on this one, since i've played this game for a few hours, but people mention that this game has a very bad monetization, from what i've seen it doesnt seem so bad. \nThe only nitpicks i have are the overabundence of voicelines in combat (you can turn them off in the settings thankfully), silly voice acting in general and bad/cluttered ui and menus. \nOverall, Mecha Break is a fun game to play. At least give it a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mecha BREAK is absolutely a hidden gem\nThis game delivers all the feelings mecha fans crave: awesome achievements, intensely rewarding victories, and adrenaline-filled battles. Winning feels genuinely satisfying, and every accomplishment in-game is celebrated.\n\nYou don’t need to pay a cent, the most important items and upgrades can be acquired just by playing\n\nDiscovering it by accident was the best surprise, and I rate this game a solid 10/10\nIf you’re into mechas, this one’s for you. Give it a try!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The character customization in this game is worth five stars alone. this is the gold standard for character customization, and every game should give you this level of customization, i love it. overall, though, i would give the game 4/5 stars because there isn't much for you to do as the character you spent so much time and effort creating, additionally, you don't get the same level of customization with the mechs themselves which is a bummer. my only other gripe is that i wish it was more PVE focus instead of multiplayer/PVP focus. everything else about the game is phenomenal, the character customization (obviously), the style, the gameplay, the concept, the mechanics, the graphics, all some of the best i've played. if this game played more like armored core 6 or had an interesting socio-political plot for the pilot themselves to follow outside of missions, it would be a perfect game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game, tho the sensitivity is low and whacky",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome and gives you the real experience of a fast paced mecha/gundam pvp game. I've played all other games out there and the action gameplay is exciting. Yes there's things they can improve on but remember this is still a new game and the mech designs are really amazing and have their own unique playstyle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game nice graphics and the fact i got it for free? 10/10 best game i have played for awhile",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The mech designs are balanced and the gameplay feels smooth on every character!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I understand the mixed reviews on this one.\n\nI love the gameplay, I love the mechs and their kits. I love the fantasy this game gives me, it's something I've not been able to find anywhere else. I so dearly wish for this game to do well, to stay online, so I can keep enjoying it whenever I get the itch for mech action. I do only play the 6v6 mode.\n\nWhat sucks, though, is the bits that surround the gameplay. Currencies and markets that are confusing and reset every so often (rip my merits from season 0). I don't mind large microtransactions in a free game, but paying to trial a cosmetic is a bit much. Each shade of paint being locked behind a currency is kinda demoralising too. I haven't touched the extraction shooter mode. Mods happened while I wasn't looking?\n\nAnyway, play this while you still can, it's great and it's completely free to enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've never been big fan of shooter games nor sci-fi. Mecha BREAK made the impossible and changed my mind. While it has its own flaws, it strikes a satisfying balance between competitive play and casual fun. Mechanics to assist new players but also specialized stuff for the hardcore players to flex. Beautiful graphics, smooth controls, satisfying combat. If only Overwatch, Marvel Rivals, Apex Legends and Valorant were that good! Only major drawback I'd say is (at this time of the review at least) the design choices of menus and navigation outside of the game; too confusing and too many clicks to do simply tasks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a hero shooter disguised as a mech game. That said, I love the pilot customization.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty nice gameplay and most mecha are  prety balanced, a lot of peoples scream about some mech being better than other but its more that mech are purpose build for only a very specific gamplay and suck at anything else. \r\n\r\nNarukami is lethal against glasscanon when she take them by surprise but die in straight fight especially when the player refuse to focus on priority targets they can actually kill quick (other sniper, flyers, healers  only go after tanks if the enemy team is sleeping on you). \r\n\r\nStellarus is cracked iin 1v1 against ranged targets but only if it catch them by surprise and melted if it can't get close before being spotted or is targeted while fighting another mech especially if the user decide to duck it out with tanky mech instead of picking off the sniper and flyers (i hate stellarus but god does it win game on its own when its played well). \r\n\r\nStego can melt entire enemy team but get countered hard if forced to move by area of damage or flanked, especially if the one playing them is brain dead and refuse to stay back on the high ground and pummel the enemy and instead decide to try and duck it out in close quarter (my beloved, litteral million of damage in game if no one zone me).\r\n\r\nYou get the gist of it peoples screaming about unbalanced mechs just want to play every mech the same way and are just pissy they can't but its why i like this game personnaly, in most game like these i generaly like to play only a few charachters and stick to them but here i often -and happily- switch my mech depending on my team comp and the map and objectives.\r\n\r\nEvery mech feel great and unique enough i don't mind switching every game and while a few are just clearly not pleasant to play for me (skyraider, i swear i can't for the life of me figure out whats the point if this mech aside being starscream.)  I cannot in good conscience not recomend this game, its pleasant to play got a nice variety of mechs, the graphics are awesome, the maps varied, the gamemode is very random but prevent peoples from swarming one and ignore others, the monetization is not worst than other game i played, honestly fair if you do your weekly mission wich you can go through in 4/5 hours total in casual games and take the battle pass, could use seasons being a month longer honestly but that is my preference i can understand others wanting more contents more often. \r\n\r\nonly minus is the server lag when long distance players are matched together ping can go from 30 to 999 for a few second at random and at higher ranks it can get stuck at 120 for some. also that all my first 2/3 games of the day after starting the game the loading screen kind of hold me longer than other and i spawn when the gamer is already started. (do a few quick casual game, at least it warm you up for ranked i guess ^^'')\r\n\r\nThose problems are technical and not related to the game design so i expect they will be fixed at some points. the game has only been out for a 9 month after all. oh...oh shit.\r\n\r\nstill pretty cool game that does not warrant the crazy amount of peoples screaming its dead for no reason other than a \"low player count\" , the game is still in the top 400 game with most players in 24h peaks on steam above games that are considered great success even now.  i think the only reason peoples say its dying is because the game hit the 300 000 player all time peak at release and some expected that to be the norm somehow? Just for frame of reference that is in the top 50 of steam, place 45 in fact, just 2 place below counter strike FFS, it is not a reasonable expectation for a game in this day and age (filled with releases) to compete with precursor and iconic game like CS.\r\n\r\nAnyway that's my take on this game.\r\n\r\n8.5/10 because of the server lag and limited inventory space (inventory should never be limited when every paint colors and patterns take an entire spot. not even when they drop like fucking rain and can be sold without much care.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game! I love mecha and the battling is and movement it on point. Worth a try if you enjoy mecha too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, each striker has their own hard counter. But what's funny is the game thinks Laragon (yes that development environment that's usually used for web dev) as a cheat application. Well I have no issue with it but still funny tho. Also, remove/rebalance stelaris and things will be more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "extremely  fun,  dont think too much and just enjoy , its free , its good made for a free game , being updated and going to consoles means more players , the only good mech game of its kind aside from mechawarrior , peaple nag too much and dont see that everything else is worse done by all companies except a few , relax and enjoy , specifically if its free.\n\ngood luck and have a good day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! Every character is different & fun in their own way. Balancing everything perfectly is extremely difficult & sometimes impossible.  I acknowledge that. \r\nThe only thing I do not like about this game is how overpowered Welkin character is. That character is too much and often times, there is little to nothing you can do.\r\nSO MANY matches, spawning in as a character that has no way to deal with a melee attack except dodging or running away, getting trapped in Welkin's box is an immediate death. While trapped inside the box, Welkin can hit you with the blades that fly around, the howitzer, melee attacks being spammed at full blast, all the while Welkin is being healed by one of those abilities. That's crazy, in my opinion.\r\nOther than that, I think this is great game.  the game play is so smooth and responsive.  every character is really fun to play in a different way. I look forward to more content!! :-)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game. There’s a lot of misinformation out there about its so-called “pay-to-win” elements. It’s true that you can buy mods with real money, but these mods mainly help you specialize in certain playstyles —they don’t necessarily make you more powerful. Each mod comes with both pros and cons, so it’s more about customization than advantage. In fact, most players don’t even use mods — myself included.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really cool game with interesting and interactive mechanics as well as being well balanced once you know how to play with only minor exceptions definitely worth getting through the tutorial (which is rather long) and at least a few matches though the game does have its issues right now since its not incredibly optimized and the menu navigation is hard to get used to even with the tutorial",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "maybe its me but if you like mech battles and stuff go for it but i dont recomend this game as a completionist. because you pay to unlock cosmetics, the effort to aquire keycards is not worth it and be sure to spend your credits before the next season because everything resets. it was cool to play at first but i find it really hard to figure out the upgrade mechanics. so im at a basic level mech and i dont know how to upgrade or at least in a way that i'm improving. but the character creation is cool and the graphics are killer but in my mind its visuals over gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h2] Mecha BREAK - Review [/h2]\n\n[i]Let me begin with a warning for new players. Pick the time you start this game very carefully.\nThis game has some of the biggest BS unlock requirements for Season Content and is very, very sparse on the most basic information, like, for example, how long the season is going to last.\n\nFurthermore, you might end up wasting your time farming for something and losing both money and in-game currency because they somehow decide to release a new season on a completely different day than the weekly reset happens, and the day you find out is actually when you try to log in, but they are already mid-maintenance, because you thought the time (the only time!) they showed in their news post was not 8 hours ahead of you. (I know that's partically my fault, but still).\n\nThis game has some great gameplay and attention to detail. It can be very immersive.\nBut god, I don't feel safe investing anything into it because I don't know if my time and money have any value to the developer. I feel robbed.[/i]\n\nUnto the actual review. \n\n[h3]Gameplay[/h3]\n\nMecha BREAK offers surprisingly deep character creation and an immersive base to explore, complete with interactable objects and an hangar that shows future Mechs being build in realtime. The game features a mix of PvE and PvP modes. Operation Storm (PvPvE) has fun ideas with free roaming, collecting upgrades, and exploring the map, but it loses purpose once everything is collected, and finding cooperative teammates can be difficult. Covert Operations (PvE Version of Operation Storm) is limited to 3 free weekly attempts. Doing more will cost money. \n\nOn the PvP side, Operation Verge provides classic 6v6 multiplayer with rotating maps and objectives such as capture the flag, point control, and team deathmatch. For smaller and more focused combat, Ace Arena offers fast-paced 3v3 deathmatches that emphasize mech control and coordination. Despite some structural issues, the core mech combat remains enjoyable and is the strongest element of the game.\n\nMatchmaking often fills lobbies with bots, which speeds up queues but creates inconsistent gameplay.\n\n[h3]Monetization[/h3]\n\nMecha BREAK includes a cash shop, battle pass, and cosmetic bundles. Most prices are reasonable, though some high-end cosmetics, especially full pilot and mech sets, can be very expensive. Ace Recruitment allows players to buy special pilot and mech combos directly for real money, but these are still purely cosmetic versions of mechs obtainable through gameplay.\n\nPlayers can earn premium currency by selling items on the Matrix Market, although creating a listing sometimes requires spending a small amount of that same currency. The season shop is less friendly to newcomers because of weekly soft caps for earning Mission Tokens and unlock requirements that slow progress toward seasonal rewards.\n\nThe game also relies heavily on time-limited seasonal content that disappears once a season ends. This creates a constant pressure to grind before rewards vanish, and it personally makes me hesitant to invest time or money in the game.\n\n[h3]Performance[/h3]\n\nPerformance is inconsistent. Mech gameplay generally runs better, but the base area, can perform poorly. The game supports very high graphical settings, yet optimization varies significantly between environments. Lowering rendering quality helps performance but severely impacts visual clarity, making it an unattractive option for players who value image quality. Overall, the game looks good at maximum settings, but currently demands strong hardware and better optimization.\n\n[h3]Conclusion[/h3]\n\nOverall, Mecha BREAK has a lot of impressive and unique features, from the insane character creation to the immersive base and hangar systems. The gameplay is fun and varied, but there are clear drawbacks, like performance issues, unlock requirements in the season shop, and the limited Covert Operations. Monetization is mostly fair for a free-to-play game, though some cosmetic options feel overpriced. Despite its flaws, I am still having fun and will probably keep playing for the time being. It’s far from perfect, but there’s enough here to make it worth trying if you enjoy mech combat and good character customization.\n\nAs I am still a 'new player' I apologize if I got anything wrong. Especially about the monetization.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game ranked is fun love how you can earn and sell your stuff keep it up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it was fun at first, fast pace a lots of modes to play.. but once you peak around grandmaster suddenly both verge and mashmak waiting time is around 1hr+ i ain't have time for that",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's really fun, and for the low price of free, well I'd say is there a reason not to try it?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ts game is the best free game evaer its so good i want to grind non stop for 10 milion hours its that good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You like mech? You like arena shooters? Play this\n\nThe people screaming about \"muh currencies, muh melee\" are the same people who will gladly pay 60+ dollars for another AAA game with shit design. There is no PTW as the game has only optional cosmetics with real money, or in game currency which you earn by playing or completing missions.\n\nYeah, it's a Free To Play, with a cash shop. The cosmetics are completely optional and honeslty, if you really wanted they don't even cost that much. The majority of the mechs are free from the get go, and it'll take you a long time to master all of them. The rest can be bought for 15.000 credits which you will farm in like less than a week if you do the missions (which are easy af to do). The combat is amazing but it gets especially good if you have a team to communicate with and friends, as every mech has strenght and weakness. Narukami may be INCREDIBLE at dealing ranged damage and harassing, but a single Welkin or Panther will MURDER you in no time if you dont't play the map and your team does not engages them.\n\nThe characters you create (you can have a male and female and can switch freely between them and also modify their appearance anytime) has a lot of depth (it is a chinese game, they make their character look CRISP) especially as Seasung is also the creator of an infamous gacha. Honestly, the characters are just eye candy, you will ignore them after 5 hours playing to focus on ther mechs babyyyy.\n\nThe designs are incredible, if you like gundam, ac, or any other mecha anime it really feels like the creators are also huge mecha nerds. And honestly, as a mecha fan we don't have a huge choice of games, so something like this is more than welcome!\n\nAlso to the people complaining about the end of season reset of their token... it's literally written in the game menu. It's in big goddam red letters, cmon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ever since I played the Demo version, the gameplay was absolute best and would recommend this game for people who have interest in Gundam Anime and maybe other gamers as well for the best clips and montage to be made by them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a really good game the only thing I don't like is because it takes away your missions coins when you leave the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not AC6 levels of mech combat, but it's nice, I guess.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "coooool mechs,  unfortunately can be seen as a gooner game. besides the almost sexual aspects the game is pretty cool 😎",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah these guys are goin places. My friends invited me so i went in blind with a bit of skepticism but came out a full blown addict. Looking forward to future updates. Ride on pilots",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is proof positive that Steam reviews are, for a very large part, total and complete bullshit takes from people with low iqs. How this game only has a \"Mixed\" rating is baffling to me. It is an incredibly  well made game. The combat feels incredible. I'd say it feels even more fluid and natural than Armored Core 6. I can't say enough positive things about it. This is NOT A P2W GAME. Anything and everything that is locked behind a price tag is COSMETIC. ONLY COSMETICS ARE PAID. THATS IT. Which is fine by me! I mean how are they going continue developing for the game if they cannot make any money. Everything core to the game is progression based. Incredible game. If it ends up dying because of all these assholes leaving bad reviews who probably played the game for 5 mins I will lose my goddamn mind. Whiners please shut your fking mouths.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best if not the only good fast pace mech game of all time, never in my life I would see a mech game with all types of battles that depends on what mech you use, you can be fast, slow tanky, or just right in the middle.\n\nThe game itself is amazing I wish a lot of people played it, it is so sad to see it die so quickly, I suppose in an era where PVE's are king having to compete with PVP games is a bold move and a lot of people including myself can see that.\n\nOverall this game is amazing its a 10/10 experience for me, every mech is a demon if mastered but it keeps reminding me sometimes that this is a team based pvp game so I guess that's the reason why a lot of people did not keep playing this game, so far it is the best Online Mech game available out there and there's a lot of mech to choose! That's the best part of this game as it doesn't force you to grind a mech only to find out that its not for you lol, either way this is my review and I really recommend you try this game especially if you've played and enjoyed Armored Core 6 as well!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PVP is rough, blantantly cheating Bots \r\n\r\nbut i really like PVE, marshmak, I can meet really great guys and just vibe along, taking down deadly bosses (hellcat) and farm materials together. I think it is beautiful once I got matched with the same guy i matched with before and when i wanted to add him to my friend's list he was already there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun mech game with pvpve. it has  like gundam and armored core vibes to me i really like it if u are a fan of mech games you have to try it out highly recommend! pardon my grammar english class was my worst lmao :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good graphics and combat. Exteel style robot fights. Will recommend others to try!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS FIRE SHOULD PLAY IF U DO U CAN ADD ME @ Blakegod ITS SO MUCH FUN 100000000000/10 WOULD  FOR EVER PLAY #freescheelp",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game lets you pilot machines in various customization mods that enhances the mechs in the battlefield, while also do some interactions in the base you're in, mostly NPCs, though I'm not sure if you can have at least some players in the base. You can pilot different machines, feel their performance, and their power, and also the freedom to how you want to fight in the battlefield too. I'm looking forward to the day where you can make your own machine in a Research and Development Labs in order to make a unique machine.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really like the game. its very fun and mechs are unique. I just hate Welkin...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fighting mechs as the biggest boobed baddie, match made in heaven",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Correct me if I'm wrong, but this game reminds me of Armored Core VI",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For how diverse the mechs are they are surprisingly well balanced, every mech can counter the other with the right approach in PvP.\r\n\r\nHowever I would like to see a new challenging PvE game mode that would give you incentive to grind the extraction mode for weapons and upgrades, because as of now I don't see a point in playing the extraction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Gundam game I ever played\n\nGoat Hiroyuki",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice gameplay cool graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and fast pace mech game. The game needs more quality of life. 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is phenominal some control issues but you get useed to it an if tehy implement later stuff from the habitual china release wit will be one of the greatest games of all times!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you into mecha, gundam, robot and quick battle, here you go the Fast Pace Combat game!!! Gotta Say is extremely fun and the combat mechanical is special and fast. \nI use Falcon, is hard but totally insane, just like ace combat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it and its so gundam vibe but more detailed with a cool character you can cuztomize",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Divertido, altas customizações, principalmente nos mechas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Custom coloring of multiple areas on your mech for free. Has  \nGame modes are somewhat typical of most games, having them all be included without having them as \"event only\" or \"limited time only\" was nice though.\nReally enjoying it, pvpvpe or pve. You choose.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A mecha game with amazing visuals, great maps, pretty good hero/mecha design - (visuals and mechanics), top-notch animations, decent sound design and very accessible gameplay - all built on top of armored core fundamentals. This is like a dream come true for a mecha-fan like me. What's already here in year one is absurdly good for the entry price of 0 bucks. I'd always recommend this to everyone to atleast try even if pvp/mecha scene is not something they are familiar with. As a bonus you get pretty decent character creation/customization system which sadly is more in-depth that the mecha customization.\n\nAnd yes, here comes the catch - the cosmetics are absurdly priced, the primary currency for purchasing most stuff will reset every season, the premium currency is pretty difficult to get without coughing up cash, the auction house is a mess and non-casual end of the game is a bit of a mess.\n\nIf you're worried that this game will disappear due to it existing and competing in the same market as other pvp/extraction shooter/looter shooter/tps games, then I feel it might be a bit unfounded considering the company's not  super reliant on this game alone for their finances. I would caution against purchasing the battlepass since the battlepass contains primary currency that'll reset after season's over - that is unless you feel hooked and find yourself playing it frequently, in which case the battlepass is a QOL ticket.\n\nCome play and have a great time. There's no bar to entry and you get to try out 8 mechs out of the gate. See if it works out for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Writing a review upon 100th MVP (ranked)\r\n+ Great atmosphere.\r\n+ Great Soundtracks.\r\n+ Great gameplay.\r\n+ 10+ Versatile Mechas to choose and more new release each month.\r\n+ Quick Gamemods that can be finished within 10 mins of engage with teamwork.\r\n+ Great PvP and PvE Coop with 3 players.\r\n+ Great Camera Mode and Character Customization.\r\n+ Challenging Advanced Training.\r\n\r\n\r\n- Most makeups/cosmetics are paid.\r\n- Plethora of bots in Gold/Platinum tier.\r\n- Red Coins are limited, Recalculates with each new seasons, difficult to buy expensive old tier items/access cards of bunker.\r\n- Explore Base should be a lobby full of people.\r\n- unnecessarily overpowered and very unfair matchups in Advanced Training for no reason. \r\n\r\nwill update more pros & cons if found.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Mecha anything is one of my least enjoyed genre, I'm actually really into how this game plays. I didn't get far because the concept doesn't interest me but if the game is anything like it is this early on, actually a good experience. \nSome mechas are hot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a rare gem, I would say that this has the best movement feel of any mech game I've tried, including titanfall (titanfall pilot movement is good but the mechs feel bad). The gameplay is interesting enough and there are enough counterplays and strategies to counter all the mechs in the game.\r\n\r\nI mostly played the 6v6 pvp gamemode in the beta and I haven't tried much of the \"extraction shooter\" gamemode yet.\r\n\r\nMy opinion on the top mechs in each category for solo queue carry:\r\nBrawler - Welkin\r\nSniper - Aquila\r\nAttacker - Stego or Falcon (if you can control the flight)\r\nDefense - Tricera\r\nSupport - Luminae",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So much of this game's bad press is laughable. 45% of it is over customization monetization (A well established practice by now in most games), and the next 45% is about the overuse of bots in ranked matches (Which is it's self caused by the drop in player count due to the customization monetization).\n\nThe game it's self is polished to a mirror shine in terms of both game play and graphics. It has well designed mechanics, mechs with their own individual playstyles, and if you can achieve proficiency with multiple the game has a great amount of variety.\n\nIt's not easy or cheap to develop a game like this, and at the end of the day the company needs to bankroll all that. Could they lower the prices on stuff? Yes. Is that enough to break the game? HELL no. If you see negative reviews parroting these same two points, take them with a grain of salt. Just play the game, relax, and enjoy the game for the gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just the kind of mech game I like, you have lots of mech with different play styles, is fast paced and super fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun mecha game, does not appear to be pay to win. One con is that it does not have single player option but still very good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Eh, I have fun playing the PvPvE/PvE modes in Mashmak, title chasing in Operation Verge. That's about it really, oh and the pilot customization, that's cool too. Hopefully they add more bosses and weapons to grind for. Anyone who says this game is pay to win is a fool, there're no weapons or mods that you can't get for free just by playing the game. I don't even mean participating in the player driven Matrix Marketplace, just grinding in Mashmak will get you Tier 6 Weapons and Flawless Mods and Gliders. UI is a mess though, if you have a potato PC, the navigation will hurt you a little. Core Gameplay is fun all round though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mecha BREAK is a great game where you use giant robots to battle other giant robots. simple concept, great execution. it's fun, fast-paced, there's a crapton of lore to be had, and graphically pleasing to look at. \n\nOn the downside, there are microtransactions, the battles are.... a lot to take in, and the massive number of bots are bland.\n\nanother problem is that MB is on it's last legs. sure, it launched less than half a year ago, and had 130K concurrent players, but that number is down to around 1.4K. \nI love this game and I'm really sad to see it having gone down like this.\nto be fair-- the game isn't dead yet. seasun still has time to make changes and get the numbers up. but the clock's ticking.\ntime's running out to act. if they don't get to act together soon, then MB will die.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To be honest, its free to play, you dont need to engage with any micro-transactions (most are cosmetics when its come to premium currency, you can get new mechs by just playing the game), you can get previous season mechs too but the base roster is pretty large and good too.\n\nYou can boot up this game, turn off your brain, and just shoot shit and fly around. Play the objective and you'll win most matches. If you have trouble against melee mechs, play an ultra-heavy with a turret mode to become immune to the stagger (or evade if you cant)\n\nI will say that this game's biggest weakness is its horrendous amount of menus and confusing user interface sometimes.\nI had to look up how to replay my match highlights and export a video of it to show my friend, that thing is buried in an obscure menu. And if you want to rewatch the very cool blueprint-esque intro to the mechs you have to go into the exploration mode and go to your bedroom's terminal.\n\nI just hope this game is here to stay, and not just a quick money grab. The game has a lot of potential and is a good casual fun game. It has a 6v6 PvP gamemode and a squad-based PvPvE extraction mode (that's where you go to farm mods)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ignore the bad reviews its a good game, no need to spend money. Very fun gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVED THIS GAME ,This not a play to win game only problem this game has is the player base q times are insane or just cant play some game modes sad to say game is dead now and i can see it closing in 6 months if nothing is done :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Actually nice, Tried it out on Gamescom and again at home.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game keeps crashing after finishing mission please fix it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot is needed to be added to this game, but it got a huge potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Verry great game, you can see its good when you play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big robots and u can edit your avatar 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD GAME IF YOU LIKE MECHS AND MOBA GREAT GRAPHICS AND PERFORMANCE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the best mecha game ever made",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game so much the only thing missing as a strat up  story mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please don’t abandon this game, it has soo much potential",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The demo was better, but still playable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "的推进政府禁止非法没事",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game with some nice QoL features",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game's gonna shut down in about 5 months, give or take. They didn't announce it or anything, but take my word for it.\n\nI'm not gonna say much else because my disappointment in what this game could've been is immense. It's really fun, you should play it, but don't spend any money for when this company inevitably takes it and runs in about half a year. They're pushing out as many cosmetics as possible (35$ skins) to recoup their losses as best they can, I'm assuming.\n\nThey didn't listen and they lost 90% of their player base. Sucks to suck.\n\nEdit: being mad about this review doesn't make the game any better. Since this review was made, this company;\n\n1. Doubled down on nuking their own auction house, one of the only consistent ways they had of actually making money on the game\n\n2. Revealed and executed the baffling decision that battle passes and battle pass currency completely expire and disappear into the nether after their season ends, ensuring most people (me included) who HAVE bought a battle pass in this game will never buy another\n\n3. Released more mecha with mechanics that are toxic and bad for competitive play and casual players alike, and refuse to address the balance issues with the mecha that are already ruining games, especially for new players, which they obviously badly need.\n\nIf you think the game is good and I'm wrong, go play it and support it financially. But I know you won't.",
      "voted_up": false,
      "votes_helpful": 152
    },
    {
      "review": "Stop me if you've heard this one before: A good game, with nice visuals and mechanics, but utterly brought down by microtransactions and confusing currencies. The gameplay is something I've always wanted as a fan of the Gundam Vs series of games, and when it works it works extremely well, but progress feels stale, too much content is gated, and now the player base is shrinking. \n\nIn many ways I think Mecha Break proves that the mecha combat genre doesn't really have the legs to be a big PvP contender. It asks too much of your time while competing with the likes of Marvel Rivals and whatever BLOPS, PUBG, BFUS, GGGR, or Forknife that gets all the attention. All these games have time-sensitive season passes and your average player just doesn't have the time to play them all. \n\nThere was no posted deadline for the end of Season 1 until they announced it 2 weeks before it ended. I'm nowhere near completing the paid season pass and unless I play 250 matches in 7 days, I cannot unlock the content I paid for. My incentive to continue playing doesn't match whatever enjoyment I get out of the game at this point. \n\nAlso, nerf the sniper mechs, come on, that's no fun.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "[h1]Remove the limit on Covert Operations or the game dies.[/h1]\n\nThe game is hemorrhaging players tired of slapfighting each other in the same 5 pvp modes on the same 9 maps.  Most remaining interested players would rather play covert operations against bots at their own place than sweat out an extraction royale or team deathmatch.\n\nThe new releases, while high quality, are not remotely abundant enough to support this live service model.  There is a severe quality-to-content output bottleneck that is hampering this game's entire market, culminating in the removal of the in-game player auction house.  Seasun really removed the only mechanism within this game that actually generated value over time, a very fatal shot in their own foot.  \n\nThey finally released a highly demanded purely-PVE rendition of Mashmak, but we are ungraciously granted three opportunities to play it weekly.  Despite being the mode I actually want to play- I won't even touch it because I fear I will enjoy it and then use up the three chances.\n  \nMecha Break still has a bunch of dedicated mecha [strike]idiots[/strike] fans like myself who would actually keep paying their asking price for a reason to grind beyond player adversity.  If we had another context in which to see our Strikers and Pilots beyond endgame victory or defeat screens, we would inhabit this game much more.\n\n[h3]Seasun needs to stop teasing us with the firing range door and throw in that third person shooter I know they've been keeping in their back pocket.[/h3]\n\nSo much potential in so many places, but I will spare you any redundant lamentations about get-rich-quick Free-to-Play live service crap that has infected everything these days.\n\n[b]Halo Infinite is now the popular business model: [/b] Big marketing and preorders, the usual.  Release just [i]enough [/i]of a game to hold its own hype for exactly two weeks.  Population and player satisfaction predictably implodes, and then the rest of the game is doled out over the next 4 years to the 2% of players they retained post-launch.  I said I was going to spare you but I didn't.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "You know, I thought I was such a good player in this game, but then after getting into a 1v1 battle with a friend, I realized that this entire time I've been playing with bots. I was of course suspicious after 5 games by myself, but was later able to confirm it.\n\nThey fake EVERYTHING, all the bots have their own ranks, their own stats, their own customization, they are made to mimic player behaviour and it's very difficult to tell who's real and who isn't. They fixed the \"test by sending a friend request\" now you can friend request ALL OF THE BOTS and you won't have a clue anymore. I'm entirely convinced I haven't played with a single person throughout my entire playtime. \n\nDon't get me started on ranked, that is a joke. You win a game, you go up, you lose a game, you STILL GO UP, it quite literally does not matter, and you also play with bots in ranked. They made it so that you don't win every single game, and so the bot difficulties do get changed depending on your performance and wins. \n\nIn conclusion, I totally understand why they do it, mechs are a niche genre sadly, and it would suck to queue up 20+ minutes to find a match.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I've played this game since release and loved the gameplay and concept. This game is so unique. I am not a mecha fan but this game brought me interested in the genre. months went by and still played this game and and stayed by it. From S0 to S2, i have witnessed how the game is heading. since S2 dropped, I was disappointed with the content. It's just customizations and they added more DPS mechas. they buffed DPS mechs while nerfing tanks. for half a year, we still ONLY have 2 healers!!! as a healer main, i feel left out. no new content. at that point, it got boring. the player count is so low that i had to wait almost an hour to find one. all that wait just to get dominated and lose in operation verge. same goes for mashmak, you wait for an hour just to get wiped in a few minutes by another player who is better than you. with already low player numbers, the player market is dead. you can't sell anything anymore for corite. so there's no point anymore. i really tried to love and stick to the game but i can't. i really tried.... sad to see a game with so much potential to fall",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I am genuinely surprised how they managed to make a game about giant robots so incredibly fkn boring....\nYou got BIG robots + BIG guns + BIG explosions + BIG SFX + BIG uhhh... You know.. Yet it's so empty and boring??? How do you do it???? \n\nYou know the feeling of jumping into a swimming pool thinking that the water is deep only for you to land so hard and twist your knee because it's actually the kid's pool? This is what this game feels like - You think you get fun stuff, but no, it's just [Left Click] when you see an enemy, [Right Click] when you see an enemy that is shooting at you, you don't even have to aim, the game does the aiming for you.\n\nThe most advanced system in the game? The monetization system of course! What did you expect? Want to get a new color? Pay up with premium credits, or open loot boxes (Which you still have the option of buying, but we know that's not what's happening here.).\n\nWhen will Chinese net game devs ever learn....  What a disgrace...\n\n真的不知道你们是怎么把一个“炫酷机甲互殴”题材的游戏做的这么无聊的。这么肤浅的游戏拿出来不觉得给中国游戏丢脸吗？",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Some solid ideas and a solid foundation in Mecha movement & mechanics, completely overshadowed by zero dev transparency, an infestation of bots in all but the highest ranks, questionable balance decisions, and a gameplay loop that turned out to be extremely flawed at high elos.\n\nPeople will point to a single decision that broke the camels back but truthfully, it was the complete lack of drive to do anything about those problems from over a YEAR of beta testing that did them in.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly loved the game but after this many hours of gameplay and the game tells me to hit the tutorial because i lost like i'm a new player, super insulting considering that i actually completed the tutorials and had the title to show for it. All in all i've had 1 other game EVER do this and its enough to make me say bye. Dont understand why some games do this but its annoying to the point of not wanting to play anymore, because it just leads to telling you to go to tutorial more often. Which again shouldnt be telling me since I beat the training and challenge missions.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "horrible.\r\n\r\nbot lobbies in RANKED. bots pretend to be players, and even come with fully manufactured play history, profiles, customized mechs and characters. recently the game turned into a mobile game full of slop rewards, lootboxes and of course predatory monetization. \r\n\r\nthe gameplay itself isnt bad, but good luck finding a lobby where you can actually play against other players in this PvP game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Whoever's bright mind thought a mech like Stellarus would be a great idea needs his brain scanned.\nBesides, the game as a whole is a glaring example of wasted potential, core and designs are good, ruined by literally everything else.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The beta playtest was really fun, unfortunately the game changed a lot during its full release and it's full of predatory monetization tactics. I can't really recommend playing it any longer as you can't even get to play as the other pilots like how it was during the beta and customizing your own Mechas feels like a grinding chore",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i dont think i was more excited for a game to release, i played the first few betas and was so happy to be playng a new mech game, mashmak was fun except for the laser rifles but when the game released it took a major downhill. ill never feel better about how it turned out and it will always have a sour taste in my mouth",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unbalanced, unstable servers, BS challenges, and predatory marketing, and even the base movement system is uncomfortable at best due to how janky it feels. By that I mean that you have no momentum AT ALL, when you run out of energy you just stop DEAD in your tracks no matter what. Overall, this is one of the worst mech games I've experienced. And it's unfortunate because the mechs themselves are really cool and have an in depth customization system, but that's all outweighed by the cons.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Mechabreak is a game that was built and marketed and a mecha pvp game that is trying to be anything but a mecha pvp game and it alienating its player base in the process.  Couple that with the worlds worst UI, GACHA mechanics, cash grabby limitations on inventory space and its no surprise people are turning on it. Simple things like skins and paints take inventory space and can only be used on one mech so if you want RED mechs you have to go farm red paint for each and every mech you own. These things share space with items from every mode and you cant use anything if your inventorys full.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had my doubts about this game because of Kingsoft aka the parent Company and quite a bit was justified tbh.\nThe Monetization is kinda awful, People that play Mech games love Customization and options but there is so much Overprized stuff that i went \"huh\" \nThe Mechs from a design perspective are actually Amazing like they are really cool and give off the actual Fantasy of piloting but what honestly really got me was when i wanted to take a look at the shop because i heard quite a bit about it. \nAnd it was actually the first awful experience and i don't mean the shop itself but that i'm required yes required and not optional to play basically a \"tutorial match\" of the Extraction gamemode is horrible. I personally just don't like Extraction shooters, i wanted to try this game because of my love for Mechs. Heck i even do render and modeling in Blender of Mechs for my own Wallpapers where i sit hundreds of hours just for the modeling. I tried extraction shooter mainly because of friends but i just don't like them even Arc Raiders. I think it's an awful mandatory way to make people unlock something. I just wanted to play the normal PvP aspect nothing more because it seems they don't have a real PvE mission story mode btw which could be really cool and think bring alot of people to this game. Like, make a couple cool story missions and bundle them slap 20$ on it and sell it as DLC where you can also unlock some cool customizable stuff for Mechs. Beside that it seems this game can be more considered like a \"hero shooter\" because Mechs have specialitys so why are Mechs behind a currency unlock? It's an awful method to stretch an unneeded progression system which even other games learned the hard way like Overwatch and needed to step away from their awful way of unlocking characters. This game could be so much more and could have so many more players if it wasn't for all the bad stuff like yes you can earn lootboxes but come on are they really needed? Is it really needed to sell a skin bundle for 50$ and even though 20 would be also alot but it would atleast make me wanna buy stuff instead of 50. For 50 i could buy another copy of Armored Core think about that....\n\nBut well i guess that's it from me and there will probably people thinking \"Ah let her say stuff lalala\" but i honestly really think this game needs alot of changes in it's presentation which honestly saddens me because it has such an amazing base, like i said the Mechs are Amazing from a Design perspective. Whoever made them good job.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game's matchmaking is non-existent because you can get bots for teammates about 50% of the time So you just gonna not have a great time in the match Also if you're loose you get very little reward, So if queue into a match and you have bot teammates Congrats, you just wasted the whole match getting nothing, No gameplay no reward, waste of time. this also applies on high ranks",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Warnings about this game. ALL YOUR MARTIX POINTS BE GONE AFTER EACH UPDATE. So if you purchased a Matrix Contract, use them before another season. Do not play this game and make purchases.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you value your time - don't bother picking this game up. \n\nGameplay is fun although messy, unpolished and there are problems with balancing in PvP. PvPvE (Extraction) is meh, didn't play it much. \n\nCharacter creation is pretty good and as man of culture - I do enjoy good latex texture work and modelling around it. \n\nEverything else around this game is just obnoxious and it truly feels like developer is trying to squeeze every single penny out of you. It's like very toxic relationship - game demands your constant attention and punishes you harshly for not playing it daily.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game launched in July 2025. It is currently 22nd of November 2025.\n\nThere's only 5.7% of players who got the achievement where you finish a daily quest given by one of the mcnugget factions.\n\nThis should be more than enough of an indicator that the game fails at retaining its players.\n\nSure, the game is super fun. Hell, so long as I can react to something, the game follows and responds. It's the only PvP game I found in the market that does not make me feel miserable for having a mismatching response time between my eye/brain and hands. Hit feedback is amazing, visuals are well-coordinated, and the gameplay loop is satisfying.\n\nIt has everything set up proper to be a great game, but the management ruins it. Again.\n\nCharacter balance and in-game monetisation strategies/management are mediocre at best.\nMech designs aside from the ones that were available with the launch are uninspired.\nInstead of thinking hard to regaining players by fixing the issues, the game fills itself up with bots.\nThe devs had shut themselves in, and would not respond to most if any inquiries and suggestions.\n\nTo summarise:\nThis game is a gift box shops put up by the window as decoration, with a \"UP TO 70% off\" poster on it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’m honestly heartbroken by how this game turned out. I was really looking forward to Mecha BREAK, but the final version is nothing like what it promised. The monetization is overwhelming to the point where it feels impossible to enjoy the game without paying. If you don’t spend money, you’re locked out of real progress and any meaningful gameplay.\n\nThe core fun is gone. There are barely any mechs, barely any maps, and the game modes feel empty. Even basic materials are so difficult to collect that the whole progression feels intentionally slowed down to push players into spending.\n\nIt’s incredibly disappointing to see a game with so much potential become this. I genuinely hope the developers reconsider their entire approach, because right now, it feels like a huge letdown.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's not a bad game I mean I really enjoy it I just feel like its fan base Is very small so it might end up getting shut down which is sad and I almost see no advertisement or anything about it on my fyp",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Devs decided to actually murder the game by implementing bots in every lobby. A real shame because of how well received the game was in beta.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is pretty much dead atm with lobbies full of bots. Can't recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is good, there are a lot of costumes, an interesting selection of mechs, they are constantly developing this direction by adding new ones, several game modes competitive LASSO and the MESHMEK extractor, but there are a lot of problems: there are few players, except that in prime time it is difficult to play without waiting; Bots, bots, bots replacing players, everyone already knows about them, make a bot, don’t disguise yourself as a player; in MESHMEK you can stand in line for 2 hours and not get in, playing only in normal mode, you won’t be able to get into the hard mode at all, there is no one there at all, the same with the group mode, it’s better to add more bots here so that you can go play for your own pleasure, and not wait for hours. The market is dead.\nI'll also add a note about a common critical error in MASHMACK mode, in PVE, PVP, and even just on the go. By the time you reload, your character often dies AFK, and all your loot goes missing, as it turns out you've lost. While some loot is still saved in special slots, the glader is gone, as is the weapon you had equipped.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Time Played: 40 hours On my main account\n\nI approached Mecha Break with the enthusiasm of a player keen on FPS/TPS, strategy, and competition, hoping to finally experience the Mecha genre. After forty hours, the conclusion is brutal: this is just another failed Hero Shooter that only has the name 'Mecha'.\n\nThe disappointment started with a critical lack of depth: there is zero customization (no builds, just fixed abilities). The 6v6 gameplay is reduced to \"spam\" and \"dogfighting\", lacking resource management or overheating. The maps are boring and empty, and the absence of destructible elements means the gigantic power of your machine is never truly felt. In fact, the gap between what the Mecha is supposed to be and the in-game feeling is immense, a fact made starkly clear when seeing the Mecha at real scale in the base. My exploration of other modes was equally futile, as Mashmak felt uninteresting and empty.\n\nDespite these warnings, I pushed towards competition. I played about fifteen hours in Quick Match before managing to figure out how to launch ranked because the disgusting menus made me reluctant to search for anything. Once in ranked, the game collapsed. The technical problem was immediate: the ping is a constant 50ms (the servers are at fault). I reached Master rank in just 20 hours of ranked play, which is extremely fast because the matches were too easy (likely filled with bots). Once at the top, the game stops finding matches; I waited up to an hour with no success. The balance is disastrous: in my opinion, Aquila and Welkin are far too powerful, and Falcon and Luminae are useless. Furthermore, simple modes are flawed, like the 8-kill setting where you literally spawn on the opposing team.\n\nFinally, these long waits allowed me to discover the deep sense of unease linked to the developers' priorities. The camera's plunging view of the pilot's silhouette at the start of every match is awkward. By searching Google for the purpose of areas like the gym, I discovered the photo mode and felt soiled. You cannot market a game as a future eSport title when the energy is spent on this superficial and awkward content rather than stable servers.\n\nIn conclusion, the only positive thing I find about Mecha Break is that it highlights the quality of other Mecha games. I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game doesn't respect you time, the free currency grind is painfully slow and it costs ridiculously much to get one skins for your mechs, free currency resets every season as well which makes it extremely hard to get anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As far as the Mechs goes, they're the highlight of the game along with the character creation. But that's where all its uniqueness ends. Everything else is just another standard looter shooter and Multiplayer that's free to play with repetitive and tiring gameplay. Most players in the multiplayer side would not choose any support class and on the Looter side snipers are OP forcing you to buy their recall shuttle (forgot what's it called) so you can send the loot you have back which cost a lot to buy or you can use IRL currency. Nothing to break the edge off. I wish they made a Co-op campaign or an actual campaign story, which when you start had potential. Shame they never lean onto it. I'm unable to give a recommendation for the game since there are other better Mech games out there and with only two features being worth mentioning it is an unfortunate 5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bot lobbies until higher ranks and at those ranks there aren't enough players to create a lobbie so its just play with bots untill you cant anymore. Negative until bots are removed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "spend 30 minutes creating an abomination and the first time you get to control a mech its laggy and takes control away from you within 30 seconds",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hard to recommend in its current state owing to lack of players, which makes it near impossible to find a match. A bit of a shame since the game has a solid foundation with different mechs that play quite differently from one another and suit different roles on a team. The standard 6 vs. 6 objective modes are quite fun and tend to be fun even when one is losing.  The real disappointment, although had potential, was the extraction mode in which one goes around destroying NPC enemies of various sizes and strengths, obtain loot, extract, repeat. The problem is the presence of other players also doing the same elsewhere on the map and typically results in a team wipe either on your end or theirs which results in a mission failure, no loot, and time wasted. This PvEvP setup works passably in 1v1v1v1...etc, but the 3v3v3v3... is the most frustrating, but also produced some banger moments on occasion that were quite memorable when your had a team that shared the same brain cell against another team with such cohesion. Such moments were few and far between as usually one would get curb-stomped by a team using either much higher leveled \"auxiliary\" weapons that are not unique to each mech, which completely throw off the balance present when restricted to each mechs' default weapons and abilities , or perhaps some kind of cheats; I never figured out which. I suspect making the NPC faction enemies more of a threat all around could have alleviated such a problem, which would force players to use their more powerful weapon ammo to survive such a threat, and would make it more precarious for another group of players to interrupt your while you are engaging NPC enemies. \n\nAs it stands I will probably not play this much in the future until the next version update to see if that both draws in new/returning players so I can actually get a game and if it addresses some of the game deficiencies outlined above (ie new/tweaked game modes that take advantage of the game's solid foundation).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well... Not so bad, if you like mecha themed action.\nPilot girl fan service is at place.\nI'd play more, but when I tried to MOVE game files to another drive, this piece of code DELETED the game from first drive and started to do a 36GB \"UPDATE\"  to the second drive xD.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This was the Mecha game I looked forward to the most. I even bought a PC just to play this. Now, here we are. The devs made a grim announcement about how long term life is looking rough and uncertain. They push out loads of cosmetics / microtransactions which all point to \"Give us your money before we shut down and oh, no refunds.\" That is an embarrassment. A great game, ruined by greed and devs who just don't listen at all. The players have spoken. The future of this game? \"Uncertain\" = Shut Down",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you purchase the \"Contact\" Pass, all unlock cargo will end once season is over...this is like cheating players of their money, the reason I purchase is for the secure cargo to be unlock permanently not only available per season....really not worth wasting the money....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's meh. The gameplay is actually very fun but everything else screams F2P game. The menu UI/UX is horrendous. And of course they somehow shoehorned in some gooner shit in a mecha PvP game. Give it a try if you're interested in mechs, but don't expect anything Armored Core tier.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Limit the game to run on ARCH Based OS,\r\nOther linux based system like NixOS don't work because of ACE.\r\nThis is a shame.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i hate pvp campers i just want to shot guns and play my mech add pve only modes i'll come bck no one miss me but shit game forces you to pvp when you don't want to good luck with this dying game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "uninstalled this rubbish game after an hour. And then my league client won't start. I've tried fresh reinstall, but league is still broken. When I run leagueclient.exe as admin, it shows an error message saying \"Windows cannot access the specified device, path or file. You may not have the appropriate permissions to access the item.\"\n\nSo for some reason, after playing and uninstalling Mecha Break, league of game is blocked access on my own PC. Never had this problem for 2 years until Mecha Break.\n\nIf you play league, I caution you not to play this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah, can't recommend. I picked Welkin as a main after 2 matches of casual and decimated every match ranked/casual as a melee. I'm not even good. Don't get me started on Tricera or the ungodly lag.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No \"support\" for Linux via electron because they need to be very stringent with the anti cheat malware but at the same time they are certified to run on SteamDeck, which already IS LINUX.\r\nThey are not getting a cent from me unless they fix this and preferably remove the useless anticheat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was fun.  Was.\r\n\r\nPut in a new mech... huzzah sniper from anywhere.  Enjoy getting wrecked by unbalanced garbage.\r\n\r\nuninstalled.  till i see a balance patch?  nope.. im out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unbalanced. why do the only air special strikers do ZERO DAMAGE. and everyones fully kitted in casual so if youre a new player YOURE FUCKED",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No \"support\" for Linux via electron because they need to be very stringent with the anti cheat malware but at the same time they are certified to run on SteamDeck, which already IS LINUX.\r\nThey are not getting a cent from me unless they fix this and preferably remove the useless anticheat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is very good and polished. \nLow player count makes matchmaking hell and it doesn't help that people are pissed at the DEVs for giving up on this game.......... makes me sad to see such a good game being thrown away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It is not clear from the store menu, but the mission tokens expire each season. It was not clear to me at all so I was surprised to find my mission token balance at zero. No kind of roll over, chance to use it, or anything.  I wasn't aware at all that the $12.99 pass I bought was a temporary pass. You have to navigate into the mission token tooltip to learn this information. This important information was mostly absent in all the screens I cycled through. Feels a bit misleading.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Free game, kinda boring, camera is annoying, not very KBnM friendly, better on controller, goodluck i guess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Currently the Melee strikers are almost unplayable if thee is a Norne on the enemy team.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is good but in game purchasing is significantly flawed, I bought a matrix contract to boost the amount of mission tokens I had but never spent them because nothing in the item shop was appealing or you had to spend so much more time to play to be able to buy things that you want which as someone who likes to play other games and do other things isn't going to happen enough now they have updated the game to a new season all of the tokens are gone unless told I can have them back I am not going to reinstall the game despite everything good about it because the gameplay and customisation is there but if I can't hold on to game currency what's the point it's too time consuming.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good concept, extremely poor balancing, poor game mode and game play design, poor new mech design, poor strategy as a service game. It isn't born to fail, but born to suffer from all poor decision made by the development team.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely fucking not.\n\nThis game was so greedy when I first tried it on launch. Confusing menu with a lot of pathways pointing to one very common denominator... how to spend your money. Day one even had a package for a unique pilot / mech (if I remember correctly) somewhere around 30-40 USD that offered very little in the way of benefits for the account. The best part is that there were multiple, multiple, multiple packages that all wanted your money with no overlap.\n\nImagine that. Predatory micros with multiple currency \"confusion\" - something of my own word, I guess... or phrase. \n\nDo yourself a favor and just play AC6. If you've already played it, play it again. Do not invest time or money into this game. If someone says that they really enjoyed this game, they were taken hostage or have terrible taste in games or companies with questionable, shit tier, money grubbing consumer practices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At the moment no ranked play on grandmaster im not able to match, and every first few games i play audio and game itself lags for over 2 min every time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "FUCK this FUCKING tutorial oh my GOD\r\nthere has never been any tutorial ever that's offput me from the entire game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to love this game so much. BUT...\r\n\r\nConstant issues where I would be stuck on loading screens but my Striker would be in game and getting killed by the enemy team because I couldn't control it. Reached out to support and all they would ever do is tell me to check my internet connection and lower my graphics settings. NEITHER of those things are the problem.\r\n\r\nTheir reputation/appeal system is garbage. Appeals mean nothing. They just tell you to keep on playing.\r\n\r\nGarbo. No thank you. I give up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i see why now that this game recently got bad reviews, cuz damn these enemy bots just straight up aimbotting and xray the whole shit. even im using narukami invis cant escape them especially the melee's bots",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too generic in all aspects",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fun for a few hours, then uninstall after the honeymoon phase.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "hard to gain currency for getting the new mecha.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Does anyone actually enjoy playing this game?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Loading and waiting times are almost half the play time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "4/10 not a huge fan of gooner bait games",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Aquila griefers killed happy hour",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fan service and monetization",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "999 ping fiesta dev must be hosting it on cheap server",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Add Fembots",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\" we will listen\"\n> proceeds to not listen\n\nbased",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "RIP. Game shutting dow soon",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i fought many a bots and i'm proud to say i emerged victorious",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "All my mission tokens disappeared after the season ended. WHAT THE HELL IS THIS GAME MECHANIC????!!! \nI don’t usually make reviews, but this got me too angry not too.\n\nI work a 9 to 5 I only get to game for a few hours in the weekends after I’ve done all my responsibilities, Mecha Break is not the only game I play, but it’s a casual mech game I enjoy every now and then. I only have 15 ish hours in this game, and I played both betas quite a bit.\n\nAs S1 started I decided to have a nice chill game, I open the game I find that I get a loot crate that gives me 3500 of the mission tokens. This is cool because I already had 13800 from the previous season so I thought I buy a new mech from the store which costs 15,000 mission tokens. I go to the store and what do I find? ALL MY MISSION TOKENS ARE GONE. THE MAJOR GAMEPLAY CONTENT OF THE GAME IS BEING PUT BEHIND A STUPID TEMPORARY CURRENCY????? \n\nI have never seen a worse anti-consumer tactic, in any Free to Play multiplayer game I have ever played. 15 hrs already pushing my grind limit for a new mech. But I was ok with it since there was a bunch of OG mechs to keep me happy. So, I was ok with the slow but sure grind to unlock new mechs when I had the time to play. BUT ALL MY PROGRESS TOWARDS A NEW MECH DISSAPEARD IN A FLICK OF A SWITCH.\n\nI do NOT recommend this game if you respect yourself and your time. It’s a shame, it is a very fun mech game and there is nothing like this on the market. Until they change this anti-consumer mechanic, refund my mission tokens with some extra on top. I will not be returning to this game or changing my review.",
      "voted_up": false,
      "votes_helpful": 184
    },
    {
      "review": "Stop me if you've heard this one before: A good game, with nice visuals and mechanics, but utterly brought down by microtransactions and confusing currencies. The gameplay is something I've always wanted as a fan of the Gundam Vs series of games, and when it works it works extremely well, but progress feels stale, too much content is gated, and now the player base is shrinking. \n\nIn many ways I think Mecha Break proves that the mecha combat genre doesn't really have the legs to be a big PvP contender. It asks too much of your time while competing with the likes of Marvel Rivals and whatever BLOPS, PUBG, BFUS, GGGR, or Forknife that gets all the attention. All these games have time-sensitive season passes and your average player just doesn't have the time to play them all. \n\nThere was no posted deadline for the end of Season 1 until they announced it 2 weeks before it ended. I'm nowhere near completing the paid season pass and unless I play 250 matches in 7 days, I cannot unlock the content I paid for. My incentive to continue playing doesn't match whatever enjoyment I get out of the game at this point. \n\nAlso, nerf the sniper mechs, come on, that's no fun.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "This game's gonna shut down in about 5 months, give or take. They didn't announce it or anything, but take my word for it.\n\nI'm not gonna say much else because my disappointment in what this game could've been is immense. It's really fun, you should play it, but don't spend any money for when this company inevitably takes it and runs in about half a year. They're pushing out as many cosmetics as possible (35$ skins) to recoup their losses as best they can, I'm assuming.\n\nThey didn't listen and they lost 90% of their player base. Sucks to suck.\n\nEdit: being mad about this review doesn't make the game any better. Since this review was made, this company;\n\n1. Doubled down on nuking their own auction house, one of the only consistent ways they had of actually making money on the game\n\n2. Revealed and executed the baffling decision that battle passes and battle pass currency completely expire and disappear into the nether after their season ends, ensuring most people (me included) who HAVE bought a battle pass in this game will never buy another\n\n3. Released more mecha with mechanics that are toxic and bad for competitive play and casual players alike, and refuse to address the balance issues with the mecha that are already ruining games, especially for new players, which they obviously badly need.\n\nIf you think the game is good and I'm wrong, go play it and support it financially. But I know you won't.",
      "voted_up": false,
      "votes_helpful": 152
    },
    {
      "review": "Certainly one of the free games out there.\n\nYou're going to be playing bots, all the way until perhaps Master or Grandmaster rank, which would be like Silver or Gold in other games. Are these bots going to be fun to play against? Perhaps even a learning experience to help you get used to the game and how it's like fighting against players playing such characters?\n\nNada.\n\nThe bots are cheating. Blatantly cheating.\n\nIt's made worse by the fact that it's not immediately obvious that they're bots (unless you're on console, I saw that they show the bot icon, but not on PC). Why go through the trouble that you're hiding bots? Why not show straight up that you're fighting bots? Why make these bots cheat? And how come when I look at my friendly bots, they're pathetic?\n\nYou're going up against an enemy Welkyn. Their back is turned to you, you see that right as you round the corner- uh oh, that bot Welkyn just 180'd, turned to you, flashbanged you, box'd you, melee you into stunlock then starts the spin of death. If you're playing one of the lighter strikers, that's a over half of your health gone in less than 3 seconds. What a bummer. Totally a human play right there.\n\nThese bots also are said to have their stats boosted. Better health and better energy, so I'd hear.\n\nEnough about bots. Let's talk a bit about playing against actual players. Yeah, they definitely play a lot differently compared to bots. I'll be honest, it can be quite fun, finally putting in some effort and communicating (sometimes) with your team to pull the win and comeback.\n\nJust know that when you pick the wrong team comp, you're very, very, likely to lose.\n\nThere's no mid-game switching. You're stuck with the Striker you've chosen at the start of the match. Your entire team is mostly heavies consisting of Stego, Tricera, Hurricane with Pinaka as a healer? Too bad, the enemy team chose an anti-heavy composition of Serenith, Inferno, Hel, and Aquila (the remaining members are almost irrelevant). Stego and Tricera aren't living long enough even with Pinaka healing them. The game is fatally lost.\n\nThere's going to be a decent chunk of those type of games. I bet it's fun to have chosen the correct team comp to stomp out the enemy team, I know I had those few kind of games. This is a free game I'd kinda compare to Caliber if anyone even knows that. A decent amount of potential, but I don't think the devs are able to live up to it. Play another mecha game, this is barely one. (Don't play Gundam Battle Operations 2 though)",
      "voted_up": false,
      "votes_helpful": 69
    },
    {
      "review": "[h1]Remove the limit on Covert Operations or the game dies.[/h1]\n\nThe game is hemorrhaging players tired of slapfighting each other in the same 5 pvp modes on the same 9 maps.  Most remaining interested players would rather play covert operations against bots at their own place than sweat out an extraction royale or team deathmatch.\n\nThe new releases, while high quality, are not remotely abundant enough to support this live service model.  There is a severe quality-to-content output bottleneck that is hampering this game's entire market, culminating in the removal of the in-game player auction house.  Seasun really removed the only mechanism within this game that actually generated value over time, a very fatal shot in their own foot.  \n\nThey finally released a highly demanded purely-PVE rendition of Mashmak, but we are ungraciously granted three opportunities to play it weekly.  Despite being the mode I actually want to play- I won't even touch it because I fear I will enjoy it and then use up the three chances.\n  \nMecha Break still has a bunch of dedicated mecha [strike]idiots[/strike] fans like myself who would actually keep paying their asking price for a reason to grind beyond player adversity.  If we had another context in which to see our Strikers and Pilots beyond endgame victory or defeat screens, we would inhabit this game much more.\n\n[h3]Seasun needs to stop teasing us with the firing range door and throw in that third person shooter I know they've been keeping in their back pocket.[/h3]\n\nSo much potential in so many places, but I will spare you any redundant lamentations about get-rich-quick Free-to-Play live service crap that has infected everything these days.\n\n[b]Halo Infinite is now the popular business model: [/b] Big marketing and preorders, the usual.  Release just [i]enough [/i]of a game to hold its own hype for exactly two weeks.  Population and player satisfaction predictably implodes, and then the rest of the game is doled out over the next 4 years to the 2% of players they retained post-launch.  I said I was going to spare you but I didn't.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "game was fun for a while but after 40 hours i started to see to many problems.\r\n\r\nfirst thing the menus are a mess, theres like 15+ different tabs, 3 different currency. just screams eastern f2p game.\r\n\r\nsecondly the melee combat looks amazing, feels amazing when it works but sadly it rarely works, you can never know whos turn it is, after melee clash it should be back to neutral (if youre the same mech) but it never is. parries are less reaction and more prediction. the aim assist feels clunky as hell, making you melee dash to things you dont want to.\r\n\r\nand thirdly it suffers from the overwatch syndrome, in early game / lower ranks the games when people arent going full meta / team hugging, its great. you get some nice duels, occasional 2v1. feels great. once you get to higher ranks and people get better and play how to win, it turns into a team hugging mess. no more 1v1 duels, 2v1 if youre lucky but usualy 3v1 or more. and as per usual in rank your team is nowhere to be found. not on the OBJ, not in the team fights.\r\n\r\nso all and all, it has some potential to be amazing game, but how you need to play to win, the inconsistency in melee (the most fun ive had when it works) and some over tuned garbage new release mechs make this a no for me. i might not be the best, but i like to have fun in a game and this isnt it 80% of the time.\r\n\r\nit is FREE so might as well try it. get a couple dozen hours of fun.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "Not a casual friendly game as you lose your tokens at the end of each session. i was looking forward to come back to try a new striker even if it was just one of the three new in s0. safe your time and money with devs to greedy to allow casual gameplay and mourn the fact that this game was so damm close to greatness. for other gameplay flaws listen to the people that played it more.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "You know, I thought I was such a good player in this game, but then after getting into a 1v1 battle with a friend, I realized that this entire time I've been playing with bots. I was of course suspicious after 5 games by myself, but was later able to confirm it.\n\nThey fake EVERYTHING, all the bots have their own ranks, their own stats, their own customization, they are made to mimic player behaviour and it's very difficult to tell who's real and who isn't. They fixed the \"test by sending a friend request\" now you can friend request ALL OF THE BOTS and you won't have a clue anymore. I'm entirely convinced I haven't played with a single person throughout my entire playtime. \n\nDon't get me started on ranked, that is a joke. You win a game, you go up, you lose a game, you STILL GO UP, it quite literally does not matter, and you also play with bots in ranked. They made it so that you don't win every single game, and so the bot difficulties do get changed depending on your performance and wins. \n\nIn conclusion, I totally understand why they do it, mechs are a niche genre sadly, and it would suck to queue up 20+ minutes to find a match.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I've played this game since release and loved the gameplay and concept. This game is so unique. I am not a mecha fan but this game brought me interested in the genre. months went by and still played this game and and stayed by it. From S0 to S2, i have witnessed how the game is heading. since S2 dropped, I was disappointed with the content. It's just customizations and they added more DPS mechas. they buffed DPS mechs while nerfing tanks. for half a year, we still ONLY have 2 healers!!! as a healer main, i feel left out. no new content. at that point, it got boring. the player count is so low that i had to wait almost an hour to find one. all that wait just to get dominated and lose in operation verge. same goes for mashmak, you wait for an hour just to get wiped in a few minutes by another player who is better than you. with already low player numbers, the player market is dead. you can't sell anything anymore for corite. so there's no point anymore. i really tried to love and stick to the game but i can't. i really tried.... sad to see a game with so much potential to fall",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Wasted opportunity for a solid PvE mech game. Hard skip unless the devs pivot into a different model, which I doubt they will.\n\nPros:\n- The controls and combat are (mostly) extremely solid and fun.\n- Mech designs are familiar and reliable, albeit a bit \"safe\" in visual design. Could be more abstract or bizarre in some cases.\n- I was surprised that the system resources and performance wasn't an issue. I've got an impressive, self-built PC but I was expecting more nonsense with hardware.\n\nNeutral:\n- Pilots have this weird gooner thing where they're \"super hot\" all the time and jiggle a bit. They look like Barbie dolls though with kinda generic models. I don't mind the 'gooner' stuff, I guess, but I really don't care. It's just weird that the models are so generic looking.\n- They have a section where you can walk around the ship as your pilot? I see no reason for this.\n- The game opens with a strong cinematic narrative. Then does... nothing with it past that point.\n- Their menu system took a bit longer than it should have to figure out where things are. Changing game modes requires a bit of navigating, which is bizarre.\n\nCons:\n- Monetization is a big aggressive. They should be focused on attracting new players, not pricing out the ones that are there. My logic for F2P games is \"If I like it enough and naturally want to invest enough time into it, sure, I'll spend some money.\" not \"Oh a new mech came out, time to drop money.\"\n- The biggest con for me is the direction of the game is entirely PVP focused. I hate PVP games in general. To make it worse, it's an extraction system. It's basically just like every other hero or arena shooter but with mechs.\n- They have a PvPvE mode that is absolute cancer. Objectives are unclear and you get a huge range of player skills in matchmaking; sometimes getting some OP gold rank something or other but typically just first time players. The main issue is that when an extractor spawns on the map, the closest team to it will set up camp and just AFK there, waiting to snipe people. It's incredibly infuriating to spend +20mins with your 3-man team clearing objectives and having fun, knowing full well you won't get any rewards because some jackholes will be camping the exit point.\n- No PvE mode. That's criminal in this. I have zero interest in PvP games at all.\n- Customizable loadouts for the PvPvE game mode are stupid. You have to craft everything, which again requires you to do the game mode, get the items (RNG drops), then somehow escape the map while random teams #2 and #3 are AFK camping the exit points. The amount of time it takes to actually get the materials successfully, then craft and equip it isn't worth it at all. Having 'optional weapons' is also not super fun. I like the mech I picked, I like its weapons, now you're adding complex layers that don't need to be there. It's like they wanted to design it with RPG elements in mind... but then never made a dedicated PvE mode.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "In theory, it’s a shooting game; in practice, it’s almost entirely a melee combat game. The dominance of melee MECHAs is so overwhelming that all others end up being constantly farmed. \r\n\r\nToo bad, the game’s got great potential, and MECHAs designs are amazing.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "I wanted to love this game so much. The betas were amazing and it was genuinely a great experience, release however was shocking...\n\nWhile I'm somewhat okay with the monetisation in the game (despite it being ridiculous) as it's all cosmetic my real concerns come down to balance concerns that I noticed in the beta tests which were never addressed. The community of people playing is slowly dwindling and with (expensive) FOMO purchases and zero balancing from the devs I can't see this game surviving with a strong community for much longer - there will always be players, but it will be a shadow of what it could have been had the development team not tried to be greedy and protect their poster boy.\n\nThe devs seem fairly adamant to protect their golden child Falcon by any means possible with it having benefited from QoL buffs despite it being largely untouchable expect when played by someone inexperienced. It does not run out of energy, most of it's abilities break a target lock on it and it can detect invisible enemies.\n\nStellaris is equally broken though tends to be hard-countered by, you guessed it, Falcon.\n\nUnfortunately I cannot recommend this game due to the absolute disrespect of balancing shown by the devs and having seen them continue to make completely unnecessary balance modifications based on nothing more than outlying observations and not actual data I cannot see it getting better.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Yeah, no - this is going to be a hard pass for me. As many others have stated, what little there is to be enjoyed here (in terms of combat gameplay) is smothered by egregious P2W, horrible core design choices (looking at you Mashmak), questionable balancing, and the underhanded implementation of bots (I hope you like them prior to reaching General in 6v6 Verge).\n\nAnd if the developer's responses and actions during the length of Season 0 (as well as the severely declining player numbers) are any indication, I don't think there is going to be a future (let alone a remotely positive one) for this game that doesn't involve EOS.\n\nThen again, serves me right for putting faith in a Chinese gacha game developer.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Devs are basically killing this game with each patch and genuinely do not seem to understand why players aren't playing despite ample attempts at communicating the issue to them.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I am genuinely surprised how they managed to make a game about giant robots so incredibly fkn boring....\nYou got BIG robots + BIG guns + BIG explosions + BIG SFX + BIG uhhh... You know.. Yet it's so empty and boring??? How do you do it???? \n\nYou know the feeling of jumping into a swimming pool thinking that the water is deep only for you to land so hard and twist your knee because it's actually the kid's pool? This is what this game feels like - You think you get fun stuff, but no, it's just [Left Click] when you see an enemy, [Right Click] when you see an enemy that is shooting at you, you don't even have to aim, the game does the aiming for you.\n\nThe most advanced system in the game? The monetization system of course! What did you expect? Want to get a new color? Pay up with premium credits, or open loot boxes (Which you still have the option of buying, but we know that's not what's happening here.).\n\nWhen will Chinese net game devs ever learn....  What a disgrace...\n\n真的不知道你们是怎么把一个“炫酷机甲互殴”题材的游戏做的这么无聊的。这么肤浅的游戏拿出来不觉得给中国游戏丢脸吗？",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Skins give you gameplay buffs. This isn't intentional, but it's insane that such simply avoidable bugs made it in.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Some solid ideas and a solid foundation in Mecha movement & mechanics, completely overshadowed by zero dev transparency, an infestation of bots in all but the highest ranks, questionable balance decisions, and a gameplay loop that turned out to be extremely flawed at high elos.\n\nPeople will point to a single decision that broke the camels back but truthfully, it was the complete lack of drive to do anything about those problems from over a YEAR of beta testing that did them in.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a polished turd. It looks pretty and the mecha movement / abilities are fun to use. BUT it is a game of rolling the enemy team in some matches and getting rolled in others. There is practically no games that feel fair or properly matched. The mech mechanics can be effective against other mechs of specific classifications but if one team has all the counters to one mech on the opposite team, it quickly turns into a having 1 member of that team immediately getting taken down and the roll begins. This game seriously need character switching, mid match. Otherwise, it is boring to just crush a team because of asymmetrical mecha line ups and feels terrible to get crushed all because you chose the wrong mech and you cannot undo your mistake.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I have put nearly 100 hours into the game and found it fun initially. Even bought the Matrix Contract day 0. Wanted to invest time into playing the game. \n\nBut the first thing that put me off is the unit balancing the developers did. Unnecessarily nerfing units that were good in their roles like Tricera, Stego and Aquila, while buffing fliers like Falcon and SkyRaider when they were already in a good spot. \n\nAnother balance issue is in a game like this, where players rely on lock on to actually hit a lot of things because of how fast everything moves  and manual aiming mechanics is not fine tunes like Overwatch, Marvel Rivals(90+ hours) or Gundam Evolution(300+ hours), lock on immunity from Falcon and SkyRaider is not fun to fight (borderline op because they can still do damage to you), most you can do is waste their time by taking overhead cover or getting above them. Even with the recent adjustments it dose not resolve the issue with them having lock-on immunity tied to their energy, unlike Sereneth which is an ability that has a proper up time and cooldown\n\nWith the recent season update they reset all player matrix points and did not at least convert remaining matrix points into crates that can be opened later. This wasted the time of players that were saving their points for a new season so they can get the new mechs on release. \n\nI also cant support the game anymore with my time or money because they did not provide players who have bought the Matrix Contract from the previous season to grind out a way to renew their Matrix Contract without having to open their wallet again and they also did not respect the players time they put into the game with the matrix point reset.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "As a MASSIVE Mecha fan, I wanted to like this game. The mechas are cool but thats it. The gameplay is monotonous and a GRIND. Pay to win is a massive problem. Sweats camping the PVE area made it unplayable. Would have loved PVE content with co-op instead of PVPVE.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Dont listen to the verified status of the Steam Deck compatibility. Its a lie. The devs only allow the launcher to be used, but after you get passed the tutorial and to the main menu, the game breaks.\n\nIts sad that Steel Hunters can allow Linux users to play the game flawlessly, but this game doesn't. I will not come back until I see Platnium status on protondb.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Id normally reconmend stuff like this but, the devs do not listen to anyone, made a decent mech game, made a terrible live service game, and each change just keeps driving out people to where its basically unplayable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "this game is gonna die... all your mission tokens get reset after every season and FOR WHAT?? I LOST 60K MISSION TOKENS????????? I WAS SAVING THAT FOR NEW MECHS, YOU'RE TELLING I SHOULD'VE GOONED ON THAT STUPID GYM ACCESS CARD?????? NOW I HAVE TO REGRIND MY MISSION TOKENS FOR STELLARIS AND SERENITH ON TOP OF THE TWO NEW MECHS!!!!!???\n\nTHIS GAME IS GONNA DIEEEE NOOOOOOOOOOOOOOOOOOOO. It was already on 5k average players, its gonna go down even more with their questionable balancing and the new mechs being insanely strong compared to the original cast. It was my fault for not reading it because it apparently it was said since the beginning but you had to click on the mission token to find out. I bought the battle pass too and just lost all the mission tokens. This is NOT how do you player retention, gonna uninstall man, I'm so sad that this game had to die alongside Gundam Evolution :/ \n\nGod forbid we have any good mech game...",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "I love the game, unfortunately ive decided to stop playing. Not because of the game, but because of the faulty anti cheat it uses. ACE anti cheat does not properly shut down after closing a game that uses this anti cheat, resulting in incomplete pc shut downs and failed pc boot ups. This forces me to cycle on/off my PSU every single time, as the main power button does nothing in this state. I will not play this game or any game that uses ACE anti cheat until they switch to a different anti cheat completely.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have a love hate relationship with this game, love the game but stability makes it impossible to play.\n\nI cannot recommend this game until they fix the stability of this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game would be amazing if it had devs that liked to make games leading the direction instead of what feels like a soulless conglomerate. \r\n\r\nthe combat is hectic and fast and feels both extremely unfair at times but is varied and fast pace enough to not be too infuriating. but it just feels like a glorified mobile game in how its presented and how rewards for playing are given out.\r\n\r\nJust a reminder: If a game has daily login and needs to pay influencers to advertise it, its probably not a very good game just a time dump praying for your money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly... I tried this game for a few hours and this game is kinda trash. Lobby wait times are horrible. You'll wait 9+ minutes for a game to start and then you'll get killed immediaetly by some player with over 300 wins and 600 kills. This game does not balance matches what so ever. I was brand new and being put into lobbies with people who were clearly very experienced at this game. I mean you might as well be a fish in a pool full of sharks. Its fun to customize your mech but after that, the game kinda gets old fast.\nIt just wasn't for me but clearly other people like it so maybe you'll have better luck.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "horrible.\r\n\r\nbot lobbies in RANKED. bots pretend to be players, and even come with fully manufactured play history, profiles, customized mechs and characters. recently the game turned into a mobile game full of slop rewards, lootboxes and of course predatory monetization. \r\n\r\nthe gameplay itself isnt bad, but good luck finding a lobby where you can actually play against other players in this PvP game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Whoever's bright mind thought a mech like Stellarus would be a great idea needs his brain scanned.\nBesides, the game as a whole is a glaring example of wasted potential, core and designs are good, ruined by literally everything else.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "at first the game is very fun and after some time when you rank up you will soon noticed that the games are full of bots instead of real players\r\nmost of my matches are like 95% bots and i was unable to play with real people \r\nand another thing is that welkin the heavy brawler is too overpowered making light work  and basically impossible to kill and combined that with a bot and it's basically an unstoppable force\r\nnot a good game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After season 0, the game's population collapsed, now you either match up with 11 bots or go against squad of top 100. Not a bad game, just that the community moved on, so much wasted potential.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Currently there is a possibility that skins give players buffs if you buy them. It's not explicitly mentioned at all and there is no way it's a bug. The game is fun, the battles are fun, however their monetization strategy is horrible and will kill the system.\n\nNew mechs are overpowered and it seems like a method to sell before saying \"oopsie we goofed up guess it's too powerful.\"\n\nThe rotating market has prevented me from getting a SINGLE hair style I wanted for the last few months. We will buy it anyway what's the point? I will finish achievements but after that they need to restructure.\n\nThe game is fun, it's what I've wanted for years and I want it to succeed. I want to keep playing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has been going through some of the most volatile overhauls I've seen. Anyway temporary currencies are still the worst and the battlepass is way too much grind, imagine having to farm 5000 argon for the hema.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Love this game, but it really not good idea to erase all red credit when you start new season.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}