{
  "positive": [
    {
      "review": "Wow! Where do i even start?\r\n\r\nMy husband surprised me with a new PC and the first thing i download from stream is this game , Inzoi ! I know thier is still updates and bugs to fix  but So far i have been loving it! I am a huge fan of sims 4 BUT this is a whole new level ! This game satisfied my craving for creativity and control. The graphics BLEW ME away my expectations , like everything looks insanely beautiful and lifelike, from the city streets to the stunning Zoi themselves! I don't even need mods to edit my Zoi ! If you need to download mods its so convenient ! (anyone who plays Sims 4 for years knows what im talking about.)\r\n\r\nHighly recommend for anyone passionate in building and Character Creation! I think Inzoi offers a beautiful sandbox for simulation lovers with focus on creative possibilities, community management , and photorealistic design, though on going updates promise even deeper gameplay and social complexity. I am excited what comes next !",
      "voted_up": true,
      "votes_helpful": 45
    },
    {
      "review": "Honestly, InZoi feels like a dream come true. The shoulder-view perspective alone already makes it feel so real, and then there’s running around via WASD, driving vehicles manually, and just exploring the open world. It’s crazy how immersive it all feels.\n\nThe graphics are absolutely insane, like every little detail makes you want to stop and take screenshots. It’s the kind of game that makes you forget time exists.\n\nCan’t wait to see what future updates bring. This is easily one of the most exciting gaming experiences I’ve had in a long time.",
      "voted_up": true,
      "votes_helpful": 50
    },
    {
      "review": "Its like The Sims, but no micro transactions, no hacking and its still in development. Nice to play when I just want to manage a house for fun.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "This game needs a lot more love poured into it before it's at the same level as some other life sims, but I think it's worth giving it a try. The gameplay is still a little clunky but I think it has some really creative ideas and I appreciate that the first DLC was released for free. I'm honestly a little shocked that pets aren't included but will eagerly await their arrival.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Amazing game, wish for it to receieve more progress in the times to come!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "inZOI is a promising modern life-simulation game — and it immediately catches your eye. It offers impressive character and world customization, high-quality visuals, and the kind of freedom that life-sim fans will appreciate.\r\n\r\nWhat I like the most:\r\n- The character creation and world building are really strong — lots of options, plenty of creativity.\r\n- The graphics and environment show big potential — the engine, the details, the atmosphere all feel premium.\r\n- The developers are committed to updates and support, which is a big plus for future growth.\r\n\r\nThat said — there are some important caveats:\r\n- The game is still in Early Access, meaning some core mechanics are missing or not fully polished — which may affect some players.\r\n- The depth of character interaction and expected life-sim content aren’t quite at the level of the best in the genre yet.\r\n- If your PC is not very strong, you might face performance issues — the game demands a bit to run smoothly.\r\n\r\n💬 In summary:\r\ninZOI is definitely worth keeping an eye on — it has the potential to become a standout life sim for fans who enjoy games like The Sims 4. But if you're looking for a fully finished, polished experience right now, you might want to wait until content and mechanics are more refined.\r\n\r\nRating - 8.5/10⭐\r\nA strong start with huge potential. It’s now up to the developers to make good on it.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "I guess I'll start by saying that I am a die-hard Sims fan. I grew up playing that game, and still play it to this day. \r\n\r\nWhen I saw the release for inZOI, it peaked my curiosity and I wondered how a game with similar mechanics to the Sims could possibly compete to the game I was so biased about, lol. I bought and played inZOI pretty much right after it released to the public.\r\n\r\n I love the graphics, and how you can move your character with WASD. I love building houses for my little made up characters, and inZOI definitely has this on lockdown for it's players. They have the 3D printing option, people are able to add their creations through \"CANVAS\", and that just shows how inZOI is being more open to community creations directly integrated into their game than the Sims (where your CC/mods break with every update?!). Guess what, I dont have that issue with inZOI! You can definitely create and customize your Zoi's and make them whoever your imagination wants to create, build and decorate houses, and play god with your Zoi's life, including career, relationships, and daily activities! They do not have pets yet, but I am waiting for that! They added a DLC that has a bit more interactive gameplay and if they keep adding things like this to the game, then they're definitely on the right track. I would definitely say I love this game as much as The Sims, as this game has amazing potential.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I like everything about this game. The only change I would make is to change when you are texting other people to be able to text other people whenever you want and to have more options for what to be able to text them!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Honestly it's pretty good in its concept, but might need more times for the developers for providing better gaming experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Basically The Sims on crack. If you grew up off the Sims and enjoyed them, This game comes highly recommended. Fits that same Niche with so much more epxanding from those original life building games",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Still does not beat Sims 4 in any way, shape or form. But it still a beautiful game, good visuals, up-to-date mechanics. Modding is okay, character customization is pretty good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like the game. The graphics are great and it has lots of potential, but it still needs more time, for more things to get added, for more variety in general.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 would recommend. its so much fun to create and play with my zoi, detail over the city and in characters, the story you can create and history recorded... just all over everything I have ever personally wanted from the sims. Im so excited to see all the updates and what this game brings in the future. I hope to see more ability with more tattoos being placed on your zoi, mods definitely help but sadly take away from other jewelry your zoi can wear. I also would like to see more household things and child toys and such just felt a bit sad / repetitive in the kids room with certain aspects.. otherwise amazing game and absolutely a new favourite!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I enjoy played this game. The Customization is great 👍. But so far, some of feature just kinda wasted. I hope in the future, they add many content and features",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Definitely needs more work to compete with a powerhouse like The Sims. Only pick up if on sale or if the game has progressed alot further.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Please note that I'm just still a beginner living off youtube channels for help. I love this game so far. There are so many options, I was first overwhelmed, but once I watched a few beginners tutorials, I figured out how to navigate the screens...now I'm in love with the options this game has to offer. I have been playing it for over 50 hrs so far and have barely noticed the glitches and have not once thought I need mods to make the game better. I love the presets, it makes creating Zois easy for someone like me. So far, I've just been playing random scenarios (no big generational game started yet:P). I know there are endless presets available, I have not figured out how to go get them yet. That's next on my list of stuff to learn. \r\nI had difficulty with driving lol. It's not as easy as it looks. Since I bough this game last week, I've noticed it changed twice. I feel like it's being updated live as I play it. My suggestion is to be patient, the changes have made menus easier to navigate. \r\nI feel like I've been waiting for this game for years! I have been watching my husband play games like GTA and kept wanting that game, but with me controlling it like I do with the Sims... I feel like Inzoi has been the answer to my wish.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm just posting a review to help the dev out. There's been some hilariously overblown and overdramatized articles from games sites on inZoi, trying to spin lack of active players into lack of success. It's not am MMO shooter, player numbers don't mean whack.\n like me, the vast majority bought it because they believe in what the devs are trying to achieve. and like me, the vast majority have the brains to understand what \"early access\" means. We're waiting and letting KRAFTON work their magic. Expecting the title to have as much versatility and depth as a game series with 20+ years of experience before full release is a bit idiotic imho.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "What’s going on? Why do we always have problems with the Canvas downloads after every game update? This is really annoying! Please fix this issue.”",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its Alright. its Lack of \"something\" if you what i mean,....this not a sims 4 killer yet. still in beta, give em a chance. but,...still lacking Features.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Loving this game so far. They've got excellent communication, responsive teams to bugs that occur, and continuously push out free content as the game goes through development. \r\n\r\nWhile they still have a ways to go in terms of diverse, expansive gameplay elements, the foundation they do have is incredibly innovative and strong. I absolutely love the clothing designer, and the online elements like Canvas that make it so I can download others creations - and share mine. The tools make it both easy to be discovered and easy to find what I'm looking for. \r\n\r\nI look forward to when they add things like pets, gardening, and basements. In the meantime, I love that you can change almost every texture in the game and even upload your own. It's so satisfying having all the door handles in the house match the same metal of the stove, lamps, etc. and similarly, having all the wood furniture the exact same texture and color. They truly put a lot of thought into the building mode (even though it took me a long time to learn! It's way more powerful than other games, just not as intuitive).  \r\n\r\nCheers to this team and looking forward to more <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Inzoi is a gorgeous game with immense potential, but in its current early access state, the simulation lacks the depth and objective to be replayable.\n\nPros:\n- Stunning Visuals - incredibly realistic graphics and detailed character models\n- Open World Potential - The large, open cities provide an immersive setting with many buildings to visit.\n\nCons:\n- Lack of Depth - Hobbies, careers and relationships need more substance. The personality traits have minimal impact on actual gameplay.\n- Performance - To experience the game's impressive photorealism, you need a powerful PC\n- User Interface Issues - difficult to navigate, hard to find options you need",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Love it. I'm playing on a mac, so this game will be the sole reason I invest in a bigger bloody setup. Definitely worth the hype. It's early release, so I'd like to see what careers are added later down the track. I'd also like to see clubs and various other venues (bowling, bars, cinema etc.) added in time as the game progresses. Overall, 10/10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i love the game but it gets pretty boring at a point and the zois dont have lot of emotions so if that can work on that",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "better then sims 4 fs!!! the only thing is the game does run slower then the sims 4 it dont have a fast pass tbh,",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'd wait to buy the game when its out of early access. kinda lacking a bit of gameplay features rn but it has A LOT of potential.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still has some time to cook and it has some great things alrady, but I hope for greater things down the line, gives me big Sims 3 vibes on the freedom that you have to go and interact with the world, yeah, some things are missing but only time will tell and with the integrate modding capabilities it can add some interesting things without going outside the source game and files which is convenient",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very good Simulation game. Good graphics even at low settings. Many hotfixes and bug patches every week! Create a Zoi is so innovative! Building concept can be better. I love the events, the karma system, the realistic drama slap in the face. It is an open world so Zois are everywhere, no loading screens, a paradise indeed. Lot of things to do, and more are coming because it is EARLY ACCESS!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "works well for my pc i just wish it wouldnt cash during a zoi  making and loading slow when building",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still feels empty when you are out exploring with your Zoi's and I am still getting used to the game mechanics, but considering this game is still in it's early access phase I am EXTREMELY impressed. The graphics are so beautiful and I am excited to see what inZoi adds in the future. My favorite so far is the free DLC pack, free Halloween items, and driving around. It has the foundations to become one of the best simulation games out there I believe!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun life simulation game with lots of entertaining content and much thought put into details",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Still kinda buggy but it's running fine in general - Needs some polishing and more stuff to do, but for EA is going good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's alright, just beware that at the time of writing this review it is terribly optimized. I'd wait for the full release if I wasn't me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i believe this game has more potential than EA's sims bs\nhell we get free dlcs too i think that's pretty awesome\n\ni hope they'll keep cooking good updates and other stuff, the life simulator game really needed good game like this\nfor now its early access so it may be buggy or laggy at times but so faor its running decent, still it may lack some content for now, the future update launch does look promising as well\n\nits worth buying this game! :D",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The Best Life simulator game I've ever played and it is 100% better than The Sims...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really do like this game. It’s not as filled out as other life sims are but that’s to be expected, it’s very new. My only real gripe is I’m unable to enjoy the game fully due to the inability of my pc to handle this games workload.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Definitely improving, deserves a chance for full release, it has the potential to be as fun as the other lifesim game. Played like 10+ hours yesterday.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely would recommend this game to everyone trying to phase away from the Sims, I cannot explain what it is, but the game play interactions for inZoi are so much better and complex. Yes, this is just beginning and isn't as \"filled\" as the Sims, but if I'm honest, inZoi is more complete in the aspects of game play, and they are still improving the game! I am blown away! Simply blown away, and I was the person who was hesitant to purchase it,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this, Sims 4 but Korean edition (It has other maps focused on North America and another one focusing more on a Caribbean theme.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very unstable game, expect tons of crashes. Outside of that, it's a pretty decent life sim game, I just wish it had pets and wasn't a gamble as to whether I'll be able to play a given patch.\nI love me some AI slop!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The possibilities are limitless and it is fun to spend time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As an early access game, I am so happy to see the flood of updates the developers are giving us. \n\nI'm having a lot of fun. It's an amazing game to just sit and unwind, enjoy the time in the game. The mechanics of actually controlling the characters in 3rd person is my personal favourite!\n\nHonestly happy I spend the money, it's fun and I am super excited to see what the game has to offer in the future!♥",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game so far and I'm loving it better than Sims. It's really nice the level of customization I got to do with my character and I didn't realize until the end that she looks a bit like me! Lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game! I am really enjoying the game it even has me thinking about designing more items when I am not playing the customisation and building is so wonderful. The product placement is an interesting feature that doesn't really add anything yet for me but I can see the reason behind it. The ability t apply videos as textures is one of my favourite features in the game, really enjoy the ability to have a water animated texture as a bathroom floor with dynamic lighting. If you you enjoy the sims 3 this game is a must try and the ability to mod and inbuilt mod market is  something I think is a good addition though I think modders would be rewarded with Karma or something.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "InZoi is a stunning life-sim with impressive visuals and tons of customization. Building homes, creating characters, and exploring the city feels smooth and satisfying. It’s still growing, but the foundation is strong and full of potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "InZOI is a really impressive next-gen life simulation game that stands out for its stunning visuals and high level of customization. It delivers exceptionally detailed characters, expressive animations, and richly crafted environments that feel far more lifelike than most games in the genre. The highlight is its deep creation tools: you can fine-tune facial features, body types, fashion, interior design, and even entire neighborhoods with remarkable precision. The game also gives you flexible control over characters’ actions, personalities, and social interactions, making each scenario feel dynamic and cinematic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game and the graphics. It's a little laggy, but thats to be expected in early release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would choose neutral if there's such an option. this game has a lot of potential that hasn't really kicked out yet. the only things that kept me interested are the character customization and building mode. the graphic is worth mentioning too. other than that, i agree with many reviews saying this game feel soulless. there's not much content to do, i really hope there's an achievements progress.\n\nbut again, i'm aware that this is still an early access game and i appreciate the devs for always listen to the community and keep improving the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im a big fan! so excited to found this game, even while in early access, its worth!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good graphics and  good communication options. not alot of lag compared to the sims 4 . good character creation also. would recommend to players especially girl gamers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been super excited for a new life sim experience. When this game came out with much more realistic graphics, I was thrilled to get it in early access. This game is going to be great when it is completed. Already taking feedback seriously from the community and listening! It's been cool to see it evolve :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game that reminds me of the Sims 3 without tall the paywall DLC's that EA charges. Fun activities to perform and do but unfortunately the game still contains a lot of bugs and crashes. I'm excited for new game content and hope they add in cats and dogs soon!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game similar to The Sims 4, but some mechanics lack in this particular game though. However I still highly recommend it for being a good sit back and chill. ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "inZOI already looks incredibly promising - especially compared to how expensive all the Sims packs have become over the years. Hopefully this game keeps growing just as fast, but without the price tag of an entire furniture-pack collection.\r\n\r\nReally excited to see what new features inZOI adds — the potential is huge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is honestly super enjoyable even though it is in its early stages. As someone who has played Sims for a very long time this game is so beautiful and unique. You can customize everything and the interactions seem more realistic. There’s already so much to do in the game for it being fairly new. The developer is very active in discord and they have a clear roadmap for a bunch of future updates, which I am excited about.  \n\nOverall, I would definitely recommend this game. They just came out with a free expansion too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good sim builder. Nice open world? but it need a more deteched housing. And creative mode is bad, the net is eye burning. We want to practice on building in a beautiful locations, not on a sky with ugly net..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I want to update mode feature, works, \nI am eagerly anticipating future updates. The core gameplay is fantastic, but I really hope the developers add more engaging endgame content and activities soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i've been a lifelong sims fan, and if you are a fan of the sims 3 this inZoi is the game you wanted The Sims 4 to be.\n\nyou can edit anything you want in the city, on your zoi or in your house. you can even import your own creations from blender into the game. you are no longer in the EA shackles of their greed and lack of creativity... or good graphics.\n\ncalling this even close to the sims is an injustice to inZoi. the sims has been taken over by greed and god knows whatever else that new company that bought them beliefs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my first tme ever playing a game that is not fully released and even with all the changes the game has been going thorugh over the past 8 months I have been thoroughly enjoying playing and discovering featrures. The Cahaya DLC and October Halloween update added some much needed gameplay features. Inzoi has, while still in early access, more gameplay built in to the base game than sims 4 with its many EPs, and its still an unfinished product. \n\nThe main developer's (Kjun) weekly communication with the player base on discord is unmatched to any other game I have ever played. Its nice to feel heard and have my suggestions and opinions not only acknowledged or considered but to actually see some addressed and added to the game.\n\nMy one wish for Inzoi is that they don't lose their individuality. All the differences they have to what simmers are currently used to (from years of playing the sims franchise) is what makes them stand out. Really hoping some of that uniqueness (karma system, rumor mill etc) make a return in a huge way!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love playing InZOI so much.. I love how this game looks realistic and has beautiful scenes etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely loving this game so far, the only feature i would love to see is the ability to sit on top of/relax on top of beds! other than that im having a blast :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is quite the sims-like, it started a bit rough around the edges.\nBut now it surpasses it in so many ways. It's insane how you can lose yourself in all the little details.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very good looking game. I spent so much time creating characters instead of playing with them, but still, I think it has so much potential. We'll see in the future. So far so good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite being in early access it is a good game afterall. Still has a lot of bugs, but playable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fine, just a little less simping for turbocapitalis influencer culture would be nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for people who love to build and design good for people who love character creation- game play similar to other like games but i feel is a deluxe version. was a bit hard to figure out buttons at first but it is very fun and they include a guide for what each button is for! using tab to change the POV and pulling up the guide is really helpful!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buyed the game when released.\nStill Enjoy some contant.\nBut sometimes its getting a bit bored after a while. \n\nBelieve need some tweeks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So much better than Sims on Graphics, deffo alot of potential still to go. Storytelling is perfect but wish there was more things",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than another similar game with it numerous over priced DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good but its bad or just need updates and by the way you should take my advice i am a huge rp fan or family whatever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an enjoyable game, but please do not compare with Sims, there's nothing to compare, Sims eventually get you tired and if you are tired of that game then you can play Inzoi and enjoy it pretty well, a lot of stuff need this game but in essential it's a good game, hope devs keeps updating and adding more stuff, and I like they are open for the mod community so thats great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It more than meets expectations in terms of aesthetics, but it needs some further development on functionality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Obviously still a WIP game so there are bugs and lags and whatnot but devs are on top of fixes. For what it is, it's great gameplay with huge potential and I'm excited for future updates and dlc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "getting better every day imo... i will update this once i play it a little longer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sims like game. but it is on with stuttering and bad performance since 0.4.0 ver",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice graphic but it has nothing much to do in game like Sims 4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game feels alive.. the world is detailed, vibrant, and full of personality. I love how much freedom it gives you to shape your character’s life, home, and daily routine. The animations are smooth, the visuals are gorgeous, and the little interactions make everything feel believable and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still a long way to go. \nI don't really want to word it like this but it just feels like everything is pointless- you can just spam interactions with people until you get what you want and when you do something, nothing ever feels like anything changes dynamically. \n\nBut the character maker is great, I've spent almost all my hours just playing around in it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game shows promise, but is unfortunately still in an incomplete state.\r\n\r\nI would hold off buying until more updates roll out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who has played the Sims, I really enjoy this game. I like the character customization. I look forward to seeing the new things that will be added on in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love causing chaos in this game. So glad the mods are added within the game. All in all a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun sims game with amazing graphics. There's still a lot of content that could be developed and improved in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like the sims but better and doesn't cost $1,500+ for all the \"content\". 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game needs a lot more love poured into it before it's at the same level as some other life sims, but I think it's worth giving it a try. The gameplay is still a little clunky but I think it has some really creative ideas and I appreciate that the first DLC was released for free. I'm honestly a little shocked that pets aren't included but will eagerly await their arrival.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy escaping reality for a little while, inzoi is the way to go. Its very relaxing and I like the freedom of the customization options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I rarely play sims like game, but this one I like. Graphics are nice, music is relaxing, AI is sometimes weird but overall ok. It has a lot of activities, career choices and relationship options",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "inZOI is a very relaxing and beautiful game. I love the overall look of the game and the interaction with the other characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game for relax and creative. Just turn your favoarite music and relax in this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve played InZoi for about 9.8 hours now, and it’s been a really cozy experience. The visuals are beautiful and surprisingly calming, and I found myself spending a lot of time in the character creator and building tools just because they’re fun and relaxing. The world has a peaceful charm that makes wandering around feel really comforting.\r\n\r\nThe game is still early in development, so some of the life-sim depth isn’t there yet. NPCs can be a little awkward and there aren’t a ton of activities, but I never felt annoyed, it honestly feels like watching a wholesome little world slowly take shape. There’s a lot of heart and potential in what the devs are building.\r\n\r\nOverall, my 9.8 hours have been relaxing and enjoyable. If you like creative, gentle games and don’t mind that it’s still growing, InZoi is a lovely place to spend some time. I’m excited to see where it goes from here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is definitely a sims killer 10/10 game. Mods and cheats are also a plus",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun but system-demanding game that delivers a fresh and unique approach to life simulation, offering a different experience than The Sims.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is this game beautiful?\n- HELL YEAH! \nIs it playable? \n- Yeah\nIs it fun?\n-Well...\nWould you recommend it?\n- I guess...\n\nAll in all, a game with GREAT POTENTIAL but it was MOST DEFINATELY released on early access WAY TOO EARLY.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is full of bugs and those problems will need to be repaired in the future, but idea of this game is beautiful. Creation mode of Zois is really good, building and life mode are pretty simple and complex at the same time. I would like to see more clothing items, new hairstyles and more. I am looking forward to see, what this game brings to the players in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Since I weren't following the development of this game, at this moment I will leave a positive review BUT it's not a good game yet and I have heavy doubts it ever will be.\n\nIt feels like a bunch of Unreal Tech Demos glued together, without much substance of a game, which brings a question about development priorities and roadmap. Like consider these tech gimmicks that sound very cool and this game indeed has:\nsLM for character thought? It's too small, too weak, and useless as it's not capabe of some MCP / structured output for actually making your character do something. So it just cooks your computer periodically to spit some random nonsence about what just happened with a Zoi. It could be fun to read the end-of-day report that Zois do, but it's just a flavored description of the day. What's the use of it really? Was it important? Since it's experimental and active development, IS it important? Don't get me wrong, I'm quite happy to see that thing running locally in a videogame, but it should be a flavoring, not the dish. I understand and kinda support \"AI bad\" train, but this is literally on your puter for your entertainment AI - practically the single good use case.\nFaceID tracking? Amazing, creating detailed character while moving your own face brings some joy. But there's absolutely no need in that. It's not a multiplayer game, it's cool for photo mode I guess, but I really don't see why focus on this?\nDriving? Honeslty I had a great laugh when I accidentally hit a car on my bike and died after ragdolling, I absolutely did not expect that for a sims-like game. But the city is small, traffic is laggy as hell, the physics is lame and driving is literally a chore. Why? I guess it's easy to slap some Unreal plugin that's why, but like it's not making it better at all. Do it right or don't do it, it's NOT needed for the game like this.\nBuilt in DALL-E (I think) is cool for some textures since generally game is low on content, though I admit the existing content feels more quality. This is the first tech gimmick I can understand, but still, was it more important than that little gameplay thingy? It's local and seems to be oblivious enough about popular culture to believe it's actually reinforced on open data, again, it's not \"AI bad\" case here, what they do is practically a guideline on how it should be done.\nBuilding is kinda fun but very much limited and floor/street decoration is weird. I like the grid better than Sims though. Character editor is quite nice too.\n\nBut the game, like actual gameplay is incredibly undercooked. It feels like they jump on the next big thing every time without actually making the game, and by the time they return to the core mechanics everyone won't give a damn about the game already. No depth in characters, no interactions, goals values and passions are kina weird and feel useless, city parameters are kinda cool but again what do they do really, there's no \"bad\" in this game it's too toothless for that to be useful.\n\nThat all leads to big expectations in set up and inevitable disappointment that most of the things in this game are stubs, placeholders. Things break left and right, oftentimes funny, but there's no feeling of acheivement, no reward in this game, no substance, no pleasant surprise.\n\nLet's hope I'm wrong and all that will turn into something good later. I will keep positive attitude and check it again later.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very unique and i love it so much, would be something to play if you are looking for something realistic graphic wise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game kind of reminds me of Sims 4 but the characters looks more realistic. It does have some bugs which is expected for a newly made game (I think this game has been out for about or almost a year). I'm looking forwards seeing some improvements in the near future and waiting to see what's next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "English:\r\n\r\nThe game INZOI is a refreshing change, especially if you often play The Sims. It has a subtle Asian touch, and with every update the game just keeps getting better. Can you already spot the differences between the versions? I also love cats, so you really can’t make me happier.\r\nAre you curious yet? Come join and play with me!\r\n\r\nNederlands:\r\n\r\nHet spel INZOI is een leuke afwisseling, vooral als je vaak The Sims speelt. Het heeft een subtiel Aziatisch tintje en met elke update wordt het spel alleen maar leuker. Kun je de verschillen tussen de versies al zien? Ik hou ook van katten, dus blijer kun je mij bijna niet maken.\r\nBen je ook benieuwd? Kom dan gezellig meespelen!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think its off to a better start than other simulation games started. There isn't a ton to do now but you can see the potential and vision and I'm excited. For a simulation generation player Inzoi is perfect for me. Love that genetics seem to actually transfer to the kids in this game but I can also take pictures easily and post them on our wall. I can easily make family collages. The mods help customize the game more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very relaxing, love the graphics, furniture is amazing I love the variety. Overall I've had a pleasant experience so far :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Frequent updates and new content, can see this game becoming amazing when it's complete.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Reading the reviews prior to this made me think twice, but after buying this and playing more than the refund time of 2 hours and dealing with the anomalous mess that is performance, I recommend this game. \n\nInZOI has a lot of things that give it more replayability over the entire Sims franchise. \nOne example are its AI features, such as AI Build and 3D Print. Albeit a bit wonky in its creations, it proves to be a very fun and interesting niche in its application, giving the game almost endless possibilities in design for all 3 levels; character, house and world.\n\nThat being said, there is a noticeable learning curve if you just came from the Sims franchise like me, but it's pretty easy to grasp, and quite fascinating as to how in-depth the interactions, animations and designing are. The graphics are absolutely amazing at ultra settings and with raytracing on. Even with some tweaks, even high and medium look leagues better, if not, on-par with other adult games, and far beyond the most modded Sims setup. \n\nIt is however, NOT recommended if you have an office PC or some 2010 and before gaming desktop/laptop, you will probably cook your setup without any chance of repair. It is *very* GPU intensive.\n\nIf you're expecting a somewhat finished product with no glitches, kinks or sudden performance degradation, do not buy it now, wait until official release. \n\nIf you're expecting this to be the average \"early access\" slop game, you're going to be amazed by the potential and the current state of the game. A decade's worth of content is coming out for this game alone, so it's worth that 44 dollars with tax price, especially with all DLC being free. Have fun!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Game was fun at first, but as of me typing this, the developer is going with an \"AI first\" approach. I don't like that, and people shouldn't support this approach to games.\n\nI can no longer get a refund, but I would suggest to other people to not drop any money for this game.\n\nF*ck AI.",
      "voted_up": false,
      "votes_helpful": 505
    },
    {
      "review": "Soulless and boring with a recent announcement that Krafton will transform into an \"AI-first\" company. Good luck with the slop factory!",
      "voted_up": false,
      "votes_helpful": 324
    },
    {
      "review": "I bought this when it first released and was underwhelmed. I figured I'd give it some time to cook, implement player feedback, etc. Now they're laying off devs and spouting the AI-first nonsense. That tells me everything I need to know about this company. I wish I could refund it, but all I can do is remove it permanently from my library and ignore it forever. \n\nI wish them ruin.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "As this company has just announce they are an \"AI First\" company, I will no longer be supporting them or their games.\n\nThey have offered employess leave packages if they don't like it and won't be hiring new people because they are moving onto AI. This is disgusting and honestly probably explains so much about why this game is just, not fun.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "AI \"First\" company, Yeah, **** that. Go broke. Just play the sims. Game had potential but we don't need more Ai slop or Ai focused companies. I originally bought the game during first release because I was under the impression that the Ai was something you could avoid, but a company that is AI first? Heck no. I don't trust nor want to trust anything they do going forward. We all know that's just a cop out. Creatives first every time. Artists first every time. Developers first every time.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "There is simply nothing to do. The game looks fabulous but it is boring",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I had a lot of hope for this game, and was very excited for its release.\n\nUnfortunately, the company has decided to lean heavily into generative AI instead of using any form of real creativity. They have recently announced they will be leaning MORE into it as well.\n\nThere are a handful of other life sims FAR more promising than this lazy AI slop. It's pretty, but that is ALL it has going for it.\n\nBeyond AI, there is hardly any substance to the game. It's very boring.\n\nIf you're just absolutely desperate to try it out, do NOT buy it at full price. Wait for a sale. This game is NOT worth the price for lazy, ignorant, and BORING AI.\n\nMy heart goes out to those on the team of the company who did not want this.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Overwhelming and underwhelming at the same time.\nThere really is no point or goal to follow and usually find myself bored after making a person.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I bought this game since day one, come back every now and then for the update but this game is still so boring for me, the contents that was here aren't really in-depth, extremely boring animation, everything here is so safe and pretty, nothing remotely exciting happens to the world around you. The marketing team will keep pushing out these lame trailer where the Zoi do dances and stuff (that was probably done by AI) on every new update pretending that this game is so fun and interesting but it's not. Behind all the unreal engine veneer is an unsatisfying game to play with no real end goal, a boring world to live in and boring animation, honestly go play 🏴☠️ the sims 2,3 or hell even 4.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "It looks pretty, but it has no soul. \n\nI like the character creator and build features: the Zois and environment do look great. But it feels like there is not much of a \"game\" here. Interactions are very simple and repetitive, and it seems that the characters are devoid of personality. There is no sense of objective or accomplishment. It feels a bit like a very early beta.\n\nThe gameplay feels incredibly simple and a bit shallow, and the interface is quite confusing. It might improve with time, since this is early-access, but for now, I did not enjoy the game as it feels quite lacking.\n\nThe AI features feel a bit iffy to me. It also does not look good and add to the entire \"artificial\" feeling here.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I wanted to like this game. I was so excited for it for months up to its release. But honestly, it didn't keep my attention/interest. Now, Krafton has announced that they're going AI-first as a company, costing good-paying jobs and only accelerating the death of our climate. Wish I could still get this game refunded, as I never would have supported them if they announced this before my purchase. Very disappointed and I don't recommend supporting any company that replaces their workers with AI when there's no safety net in place yet for them.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "DON'T BUY THIS GAME!! This game was fun at first, but has gone downhill FAST. Went from being excited for it to further develop, straight into wishing I could refund it (I can't atp). Lifeless, over-complicated and clunky functionality with horrible writing and nothing to do. This game looks pretty, but that's it. It's empty, half-finished and a waste of money. Perfect example of the dangers of over-reliance on AI.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I wish I could return this.\n\nWhen I first bought it, I was excited to see a Sims competitor.  It felt a little shallow but a game that with time could develop into something good and I was excited to support it.  The AI features, especially combined with mod support, felt like a great way to use generative AI in as ethical a way possible (e.g. allowing users to create custom content in game, and have infinite dialogue trees that would not be programmable otherwise).\n\nKrafton has unfortunately decided to ensure that they are moving in a grossly bad direction with AI.  I will not buy any of their titles or DLC in the future, and I am encouraging everyone I know to avoid their titles as well.  If Steam allows me to return this at any point I will jump at the chance.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The creators care more for pretty photos for promos online than actual game content. Why are they adding more worlds when the basic gameplay loop is nonexistent? Not remotely a life simulation game as it stands. Simply a pretty photo creator. Additionally, becoming an \"AI-first\" company and replacing staff with AI is a poor choice at this stage of development. This \"game\" already desperately needs the work of actual humans who understand game design.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "You guys seriously need to focus on the crashing on steam I can’t load in and start playing without it crashing PLEASE FIX THE CRASHING if it doesn’t get fixed I will be requesting a refund of my money the satiability on steam is horrible",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I Agree with (PrincessHoneyBat), Using and depending on AI for developing a Game and it's optimization and Core Fuctionalities is a NO for me and a negative review on my end!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Lacks any meaningful content. Hardly any updates really barebones. overall boring give it a few years and it might be good by then if they work on it that long",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "inZOI is... difficult to review, and even more difficult to categorise. But there is a point to my rambling so please bear with me.\n\nFor 25+ years the life simulation genre has been dominated by a single entity: The Sims. The original Sims game released by Maxis in 2000 arguably created the genre. It was a risky venture at a time when studios doubted the market for a game without a pre-defined story or objectives.\n\nThis was followed by The Sims 2 in 2004, which brought a rotatable camera and 3D world and then The Sims 3 in 2009 which introduced a groundbreaking (if technically demanding) open world. However, The Sims 4's launch in 2014 was notoriously bad. Missing core features like toddlers, pools, and lot rotation among many others lead EA to give away The Sims 2 Ultimate Collection (upon Sims 2 base game installation code verification) as a distraction from the backlash.\n\nNow I am aware that by consistently comparing inZOI to The Sims I risk sounding like a broken record. Yet, the comparison is necessary because The Sims 1-3 didn't just dominate the genre; they WERE the genre for at least 2x generations of players.\n______\nHowever, it is crucial to state this plainly: inZOI IS NOT A DIRECT COMPETITOR TO THE SIMS.\n______\n\nThe Sims franchise for all it's quirks and flaws (including Sims 4's its indoor rain) has always been targeted at a broad audience. This is a series that for commercial purposes often prioritised accessibility over technical ambition. The Sims 3 was a 32-bit game, capping its adjustable ram at 8 GB even as 64-bit systems were becoming standard, solely to ensure it could run on lower-end systems. The philosophy is simple, if The Sims is the only game you play, you'll invest all your gaming budget into its ecosystem.\n\nThis brings us to the first and most significant divider: System requirements\n\ninZOI's minimum PC requirement is a NVIDIA RTX 2060 with 6 GB VRAM and 12 GB system RAM. Its recommended specs is an RTX 3070 with 16 GB system RAM. With a 2060 retailing for around $288 and a 3070 Ti easily exceeding $600 (before the rest of the PC components), the financial barrier to entry is immense. The average Sims player simply cannot afford to play inZOI, which automatically distinguishes it from being a true competitor.\n\nSo, what is inZOI in its current state? Right now, it functions primarily as a an \"Instagram game\". It is a stunningly beautiful sandbox for posing your Zoi at a plethora of of scenic, pre-set locations. The goal is a staged, \"perfect\" realism, and in this, the game is unarguably successful. Its visual presentation is nothing short of breathtaking.\n\nHowever, this pursuit of realism exposes the current shortcomings in its simulation:\n* Poor Path-finding: NPC's and your Zoi frequently struggle with navigation, often walking over objects unless you take manual control.\n* Shallow Autonomy: Autonomous interactions are underdeveloped. A Zoi might say one sentence to an NPC before abruptly wandering off to greet someone else.\n* Repetitive Skill Building: Improving skills feels like a shore. For example, reading requires finding pre-spawned books in book cases and involves a fixed, timed action rather than a continuous activity.\n* Cumbersome Travel: Autonomous vehicle driving is incredibly slow, book-ended by loading screens (though manual driving avoids this). Vehicles and NPC's also have a tendency to pop into existence directly in front of the player.\n____________\n\nInZOI is a visually striking game whose extraordinarily realistic graphics are a double-edged sword. This forces players to scrutinise the depth of its life simulation more critically. Every aspect; from your Zoi's behaviour to their interactions with neighbours, is held to a higher, more demanding standard. Unlike the stylised, \"whimsical\" worlds of The Sims and other cosy games, inZOI's hyper-realism offers no hiding place for its current mechanical imperfections. Its ambition is its greatest strength, but also the source of its most intense scrutiny.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "For now, no. Why? It feels lifeless. Although I understand the vision and I know it is in early access, but gameplay-wise, I think at least it should be in beta phase.\n\nI did buy this on release, I played for a few hours and got bored because it was a bit underwhelming for me. Maybe others would like it, it does have the 'realism' aspect, but immersion seems to lack depth. Realism is BORING. Also, I think it fell off because no one really seems to talk about it anymore. I do want to support it but for now, I guess I have to give time for the inZOI devs, skip and wait for Paralives instead.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Felt inclined to write a review because the game feels like a cash grab and nothing else. \r\nWhat I have seen, nothing much, gameplay wise, has been done in the game since it was \"released\" and second of all it has used gen AI despite them telling us their tool only accesses their own data base.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This is where I give up. The game won’t launch anymore. Followed troubleshooting instructions, made sure GPU drivers are up-to-date. Even ended up wiping and re-downloading everything just in case. No luck.\n\nI could write an essay detailing the clunky, frustrating interactions, and how there's too much repetitive busywork, while lacking genuine simulation. But that would be pointless at this point.\n\nEdit/update: The game runs again after switching from Windows 10 to Linux. Yes, really.\n\nAs for the gameplay, I gave it a fair chance, but it isn't for me. I wish to populate a city with my NPCs, and set them loose without constant micromanagement of the mundane. You know, to see what happens: what do they do with their lives, who hooks up with whom, children growing up and moving out on their own volition. Inzoi doesn't really allow that kind of gameplay, and I doubt that’s going to change.\n\nFor example, relationships won't advance to the next level without player intervention. Nobody gets married unless you make it happen yourself. On the other hand, ruining relationships seems to be an important part of Zoi autonomy. How fun.\n\nBabysitting adults who don't take care of their basic needs in a timely manner is neither interesting nor enjoyable. An update added homework for the workers, resulting in even more busywork.\n\nEarly on, I created a multi-generational family. After switching to another household for a while, I came back to discover grandpa had knocked up grandma. Yes, it seemed funny at first, but then the game truly bugged out. It was quite distressing to witness a child in the house whose needs and very existence were ignored by everyone. It's probably been fixed since then, but it makes one wonder what people normally do in these kinds of games when something so fundamental can be overlooked during development.\n\nOn a more positive note, Inzoi provides a solid dollhouse. The character creator is excellent, and the house editor isn’t half-bad either. One might get their money's worth just by playing around with those basic game features, ignoring the lacking interactions by playing as a single hermit who works from home.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h2]General Impressions[/h2]\nA [b]life simulation[/b] game where, in my observation, the story unfolds very stiffly - and only for your own character.\nYou can give your Sim all possible traits, but they barely affect anything. In the end, you create a nice-looking shell.\n[b]Will this be improved after EA? Unlikely.[/b]\n\n[h2]Customization[/h2]\nPleasant but [b]limited[/b]. Body sliders barely change anything, and it's not always clear what each one does - pull the wrong way and you end up with a Frankenstein.\nSkills seem diverse, but in practice offer little to do. It feels like they created the \"meat\" of the system but forgot to add any \"flavor\".\n\n[h2]Daily Life and Character Behavior[/h2]\nCooking exists, but you can't prepare multiple servings (or I just didn't find how). After cooking, the character [b]automatically starts eating[/b], and you can't disable it.\nConversations between characters are mostly fake variety. There are many dialogue options, but they all mean the same thing: \"Talk, talk, talk.\"\nSome compare this game to The Sims, but the only real similarity is the [b]pushy behavior of other characters[/b], who constantly interrupt you and break your task queue.\n\n[h2]Canvas and User Content[/h2]\nThe Canvas platform works, and yes, there's content there.\nBut [b]there are almost no filters[/b], and finding something specific is frustrating. Everything just drowns in chaos.\n\n[h2]Bugs and Optimization[/h2]\nPlenty of small (and not-so-small) bugs.\nThe interaction system works poorly when objects overlap. Click on a plate, and the game decides you meant the table. Menus disappear if you move the cursor a little too far.\n\nAnd of course, [b]everyone's always hungry[/b]. Your Sim eats, and an hour later they're starving again. Half the city walks around thinking about food.\n\n[h2]Conclusion[/h2]\ninZOI [b]could have been a great life simulator[/b], but right now it's an empty shell filled with meaningless mechanics.\nThere's more and more content, but [b]no real depth[/b].\nOptimization is poor, and honestly, it's hard to believe it will ever be fixed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have almost 2000 hours in The Sims, so I was excited for a new life sim to dive into. Instead, Inzoi is jank and boring.\n\nThe AI in the game is so bad. Characters do random things, say things that make no sense, and generally feel lifeless. The publisher Krafton is pushing AI-first and prioritizing flashy tech over actual design. Instead of a living, dynamic city, it often feels like a hollow set piece.\n\nThe karma system is exhausting. Every sim has a karma rating, and one bad sim can drag down the entire neighborhood. While you can technically see who has good or bad karma, the system is confusing and tedious. Fixing city karma feels more like micromanaging dozens of NPCs than playing a life sim.\n\nThe publisher recently said they will try to add multiplayer, but to me that isn’t going to save the game. \n\nInzoi could have been a great life sim. Instead, it’s just a very pretty AI first slop of a game. I wish more people would advocate for developers over AI as Krafton has already killed its other upcoming releases... cough \"Subnautica 2\"",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "looks like a beautiful game on the outside (it does have good graphics i have to admit), but turned out to only be a mostly ai-generated slop filled game thats just about as boring and soulless as the sims 4. if you're looking for a good life sim go check out sims 3, NOT this",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Its like the sims but with no gameplay. Potential is there but the game is at this moment.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I genuinely don't understand how the reviews for this game are so positive. I'm not sure if maybe there's something that I'm missing or not understanding? But I've heard many people claim this as the better Sims and while I'm not a huge fan of Sims myself (I am eagerly waiting Paralives because of how shoddy Sims has become), and I just have to be honest and say that I would rather play Sims than this game.\r\n\r\nThe world and interactions just feel so remarkably empty and soulless. The building mechanics are confusing and frustrating. I understand that this game is early access, but there have been so many issues with building, the InZoi's themselves, the world, etc. that I find myself typically closing out the game 2-3 hours in because it just becomes upsetting running into the same issue 5-10x an hour. This game is very pretty, but to be perfectly honest, I feel like people glaze it purely because of its looks. The characters are gorgeous and yet you're given barely any hairstyles/outfits to work with. The worlds are also incredibly gorgeous, but at the same time feel as though they were made in mind for AI to fill in the gaps. That being said, I have not done very much research about this game, but it does kind of have the vibe that AI is implemented in every aspect of the game. I really don't know any other way to explain it. I used to play Sims for hours at a time, but I typically find that after creating my Zoi and their home, I can only play the game for about an hour or two before I start really getting bored. \r\n\r\nAdditionally, the autonomy in this game is so incredibly frustrating. I typically like to leave this on and see where the characters take themselves, but to an extent. I still like to be in control enough that the characters do what I tell them to when I click around and fill up their queue. InZoi makes this nearly impossible when autonomy is active and I found that most of the time, the Zoi's wouldn't even listen to me and I was forced to turn the autonomy off. \r\n\r\nI'm also really not a fan of the fact that your Zoi's can't partake in basic cooking when hungry? I found myself ordering out and loading up the fridge with these meals (which, btw, takes so so long - unless, again, there's something I'm missing. Having to individually place groceries/meals in the fridge is so incredibly annoying). I understand that once you start building their cooking skill, they CAN start cooking proper meals, but I feel like this takes so long and again, buying ingredients for these meals takes even longer, which just made me not want to partake in this particular function of the game.\r\n\r\nLastly, this is just kind of something minor, LMFAO! But it's seriously so annoying that you can't assign proper beds/bedrooms, because my mom&dad kept doing the devil's tango in their teenager's bed and it was just so.............. 🫥 Haha!! \r\n\r\nFor anyone that can find joy in this game, I am very happy for you! Unfortunately, I could not seem to find or understand the love for this and I really wish I could sell this game to another user or claim a refund for it. Sadly, it just does not itch that itch for me. I'm hopeful that in time, as the game grows, I may come back to it with a different opinion. But this is like the 5th time I've tried picking up this game (twice after their recent island update) and thus far, it just is not any fun for me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A game with a lot of potential, but it has a way to go get there.\nAlso, the Publisher is sketchy. Be careful with them. They want to go \"AI first\".\nSo yeah, stay away for now, wait for the 1.0 release and then look at the reviews.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "for creative games like these you need good user generated content to expand on creative freedom and there is. getting user generated content into your game however ranges from difficult to impossible. downloading and installing mods is a nightmare with this glitchy bugpile. the in game modding tool can't remove mods only download. you can't use the curseforge app you have to use the in game modding tool which lacks a lot of basic functionality like being able to filter for a specific mod author or for a specific type of clothing shirt, pants, shoes, etc. right now the in game modding tool keeps trying to uninstall all of my mods every time i open it which fortunately it can't actually do. you are able to browse mods on the curse forge website but only a quarter or a half of the mods you subscribe to on the curse forge website will sinc to the in game modding tool(which uses curse forge as its back end). you can side load mods from nexus but the vortex tool constantly gets confused about how to deploy mods for this game so you have to manually install a lot of the mods and there's not a lot of selection on nexus since the game devs would rather you use curse forge, having files from the game and mods save into the documents folder is annoying and doesn't play well with onedrive. i want this game to be good but the devs need to fix these issues with user made content. i know you can't expect a perfect experience with mods but this is ridiculously bad.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I wish I could ask for a refund on this soulless excuse of software \n\nBut the fact that Krafton is forcing their employees to \"resign\" and be replaced by an AI is the straw that broke the camels back\n\nFuck this company, never buying shit from Krafton again",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I bought this game back when it first released because I was so excited to finally be able to play a \n\"sims\" like game without actually being The Sims. After playing it for a few hours I found it to be very shallow and empty and the only good thing about it was the character creator. Building houses wasnt fun and at the time i was playing, they didnt even have landscaping options..Now I am sure they have made plenty of updates since the launch but I just cant bring myself to play this game again, especially now that they are becoming an \"AI first\" company.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Although a lot of people will say this game very good I would beg to differ. Though it has an enormous amount of potential there are way too many bugs. Characters go off and do whatever they want. You set up schedules only to have them disappear when you make appointments or a date. A lot of other small glitches. Career advancement has a lot to be desired and there's only a few careers right now. I can't say I would recommend buying and I can't say that I would recommend not buying this game. It's up to you and if you rather deal with the bugs for the time being.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Currently, this is a no from me. I have 2,000 hours in the Sims 4 (yes, I'm that guy) and was looking for something that scratched the same itch, but was different: more polished, modern and realistic. \n\nInzoi certainly is more modern and realistic, but then perhaps an excess of that is its problem. The whole experience felt unnervingly...empty. Like living in a soulless, ultra-capitalist universe where basically the people just live to work and make money, and very little happens that is truly moving and meaningful. It felt unpleasantly similar to real life. \n\nI didn't knowingly or deliberately engage with the AI features at all, but I do also wonder whether AI's centrality to Krafton's whole design philosophy is part of the problem here. The sheer identikit *sameness* of everything, the same \"oh look another IKEA sofa\" vibe, the same conversations with every single person about what seems to be a completely random, low-quality, computer-generated series of conversation topics. \n\nWhat made the Sims 4 great -- yes, janky and buggy mess that it is -- is its heart, its whimsicality, and the knowledge that there is actually a human design team there who are trying to come up with new (and often hilarious) things that will excite the player on a human level. \n\nWhereas so much of Inzoi just feels...the same. Every day the same, really. Events are put into your Zoi's diary to give the world a sense of being alive, but why you would go to any of these events is anyone's guess, because it's more of the same: standing around in a different pretty backdrop, not really engaging in collaborative experiences, but just waiting to \"praise the joy of being alive / discuss the future of artificial intelligence / say there is a cat only you can see\" with some rando until you get bored and leave. \n\n(My constructive criticism here: please please delete the entire social interactions menu, and start the whole thing again from the ground up, preferably using human beings to actually write human conversation).\n\nI am still keeping my eyes on this game. The specs to run it are intense and I have been following the updates, and I really want a viable market competitor to the Sims to succeed. But the new \"AI first\" policy is *literally the problem with the game right now*: its soullessness, its inauthenticity, its same-ness and lack of character. On that level it feels quite dystopian to play, precisely because it feels to me like being fed so much of the identikit rubbish that we already have to put up with every day. Inzoi, currently, might be the most realistic life Sim out there, but that might be its weakness rather than its strength.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "When I first heard of InZoi, I got so excited. As a long-time Sims player, I love seeing devs come up with their own versions of life-sims and I'm always interested in seeing their approach on these types of games. \n\nWith the Sims, you get to build an entire virtual life for yourself, a character you have an attachment to, etc. I thought InZoi would take that and turn it into something more realistic, and it did to some extent, but sadly it was not what I expected or hoped for.\n\nInZoi looks wonderful on the surface and the character creation is honestly the best I've seen in these types of games. It's so detailed and so beautiful in every sense! However, unless you're someone who thoroughly enjoys the visual appeal over actual gameplay and the game being immersive to the point where you can get a bit lost in it, the game loses it's substance very, very quickly. To me, the game lacks emotion and the zois feel a bit robotic... Time moves a lot slower, giving the game that more realistic feel but it doesn't feel like a life sim to me. It feels more like a massive sandbox test for people to create models and watch them move around for experimental purposes. The world is gorgeous, the architecture is incredible, the environment and every other visual aspect in this game is stunning beyond belief, but I can't bring myself to spend more than the hours I already have on this game. \n\nIf you're someone who loves to create, build, and experiment with mods, then this game is probably right up your alley. If you're someone like me who prefers to feel like you can immerse yourself fully and get lost in your imagination through life sims, then I'd say try a different game OR if you're caught by the graphics and visuals, maybe wait until it goes on sale to give it a try. Who knows, maybe you'll have a better experience than me.\n\nThis isn't a jab at Krafton or anything btw. I love their creative approach and the way they are constantly communicating with their players to improve the game, but it's just not for me. At least not right now. Even with the recent AI announcement, I still hope for great things in the future.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Created a character, ran out of my apartment to meet another character and got married within literally 10 minutes IRL after meeting them. Way too fast paced. The game feels soulless.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "On the surface it looks like the killer app for Sims 4, a departure to the tried and true method. Underneath its a tech demo more than anything. \n\nWith Krafton moving to being AI-first I wasn't really surprised given the game's MINOR implementation of it. I was willing to look past it for the (at the time) only promising competitor to Sims. However now not only can I not recommend this title for supporting their slop machine, but I also have my doubts that from anyone complaints will be addressed. The game will likely continue to be developed with the sterile appearance it has today.\n\nI'm gonna wait for Paralives.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly would recommend this game and have.. i enjoy the 7-18 minutes of playing the actual gameplay, sad to say that i can only enjoy it for that long because simply it crashes consistently, which is insane like a love hate relationship and something needs to change.\n\nI've recently started crashing like this for the past few months and nothing is working or helping, yes my specs can handle the game at ultra but this game shouldn't break so easily from a few caz mods that none of my zoi is wearing.. and it's to the point that i cover my screen when it loads hoping that i don't crash to now it's the only thing i think about which ruins the whole \"can't wait to play this yay\" mindset when ingame doing basically anything but yes i still do wish to play and will try to everyday as i did enjoy the time i had playing excluding the pretty recent common crashing",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've played for quite some time, but the game faces too much bugs imo.\r\n1) character outfit doesn't safe, it changes all the time even though I've adjusted and saved it various times.\r\n2) When you let the Zoi have his own will, it doesn't do what it tells me it wants to do. instead it does something completely irrelevant. So I have to make sure it eats, showers, uses the toilet and does one of its wishes, while all that thing does is talking to its SO non stop. Only doing that...\r\n3) When I build a relationship, all of a sudden one is betrayed and one is the cheater (NOTHING ACTUALLY HAPPENS) and it ruins the whole gameplay since i have to start all over again with the relationship.  Nothing actually happens, except this message happens to pop up frequently (sometimes during dinner, sometimes during talking or gardening). \r\n\r\nIf you expect a similar game that reminds you of the Sims, this doesn't cut it. To me, it's not worth the money tbh.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This no longer works for me it crashed and now it wont load I have gone through all the fixes but nothing has helped I uninstalled and reinstalled and deleted all my save files in case of corruption nothing works. I understand that its in early access but this is No access.  \r\nI am about to uninstall the game for the last time it a waste of money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I bought it a few months ago, played around 5 hours.(summer)\nIt's not bad but also not great. Give it some time to develope into something better.\nSome controls I find confusing and it effects my gameplay. \n\nI'll try it again in a few more months.\n\nI don't recommend it rn because I don't play it as much as i've hoped..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "\"AI-first\" company. Legit making EA and the Sims $1000 game look good in comparison. Don't support Krafton.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game is stucked and could not be closed that is why I can not give it back to steam since it shows as over 2 hours of playing time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "im struguling into getting the game run corretly, but it break down everytime. i felt i west my money. i really love the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It will not load up at all make a character and try to get into the city and it crashes everytime. Can't get money back on it or anything.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "AI stuff aside, this game just isn't very fun to play. Menus feel cluttered, navigating them can get confusing, gameplay isn't very engaging, and character creation is somehow more tedious than The Sims. I realize it's in Early Access, but there isn't much about the game that hooked me to keep me playing. The visual identity of the game doesn't help- hyper-realism is pretty unforgiving when it comes to making things visually interesting or entertaining in a game like this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm going to be honest first time playing was fun  and looks better than the sims 4. but with Krafton going Ai First, and this game relying on Ai of CC (lets not forget copyrighted items). 100% concerning for me. But I hope to comeback to it and see a good update and maybe they don't go Ai first to help with shareholder value becasueI can't wait for that bubble to pop tbh.\n\nthanks for coming to my ted talk",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Krafton is now an 'AI-First' Company.\nSo this game will mutate into slop.\nI can no longer get a refund (I tried).\n\nSo yeah, F*ck AI\n\nEdit: the hight positive Reviews in November 25 seems odd.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game, while fun, needs a lot of improvement in terms of its stability. After trying to troubleshoot dozens of times the constant crashing I had been getting whenever trying to run the game, I discovered that, basically, everytime I have to run the game, I have to delete the settings file (the\"GameUserSettings.ini\" \nand \"GameContentsUserSettings.ini\" files located in C:\\Users\\$UserName\\AppData\\Local\\BlueClient\\Saved\\Config\\Windows), clear the cache, AND compile the shaders, otherwise, the game would just crash to desktop. \n\nIt's a hassle since just compiling the shaders takes about 15 minutes, and I have to do that troubleshooting process I mentioned above  every single time I want to play this game.\n\nWhat's even more disappointing is that the game wasn't like this before (for context, I had gotten this game since release, and I even got to play the game normally for months without it crashing before getting to the title screen, until the recent Halloween update was released).\n\nAs such, I do not recommend the game in its current state. While performance seems to have improved since the update, the game is just not that stable right now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Slow development, lack of content, and just AI slop.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Would not recomend, if you have a low end computer, as I was loading it up for 2 hours and I ended up crashing every single time had to get a refund, was looking forward to playing it, but couldn't unfortunly",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I only got to be on it for about 2 hours whenever it came out. Then it crashed. I tried again a few weeks later and it crashed not even 30 seconds after choosing to load my save. And then I waited months until a week or so ago...and it crashed once again after 30 seconds of choosing my save or even trying to make a new file. So, I give up on this game. I guess I might have to wait over a year to try again. I tried verifying game files and that did nothing. Uninstalling and reinstalling. Nothing has worked. It is what it is. I wish I would have waited to buy it instead of spending $45 on something I cannot even play.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "My review is based on my save from months ago so I don’t know about the recent updates but even then I found the game empty, the UI absolutely horrendous and the gameplay kinda clunky. The character creation is fine, I guess but other than that I find it way below The Sims (and I hate EA).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Im sorry, but... I waste my money here. Some things looks cool but idk... I thought i might enjoy it but its kinda boring, too much glitch and that even ruined my saves... im sorry, no offense.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Don't bother with playing early access games if you expect it to be fully released. Double negative points if you use AI in your games, instead of your imagination and actual voice actors. This game lacks one thing that all games should have and that's soul, and a rhythm that other life sims: Sims 2 & 3 have already established. Just expect emptiness.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game not ready can never load my save from before the updates and just crashes when i do so. not investing any time on this unfinished buggy mess till they sort their crap out",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I enjoyed this game to start, now  hearing they announced they are going AI first, when a lot of their stuff is \"creative assets\" gives no confidence that it won't be ripping from artists without their consent.\n\nThe game needed a lot added to it and was promising to compete against sims series.... and they absolutely ruined it. When you shove your creatives to the side in a game you already lost. There is no longer the true love poured into it and soul that devs and artists give to these projects. \n\nI highly suggest no picking up this game now.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is without challenges and can be accomplished with no real effort or strategy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I wanted to like this game, love it even, but I just couldn't. I love the graphics, but other than that? There's no there there. First, as a Sims player, the controls and mechanics took more time for me to get used to and figure out than I actually played. It shows nearly 8 hours of playtime, but the majority of that time was trying to get the game to work properly. Second, my computer(s) meet the requirements, but it was extremely laggy and stuttered like crazy. Graphics, even on Ultra, had black shadows around objects. I can't comment on how it runs on MacOS, as the game would immediately say my MacBook doesn't meet the requirements (it does), so that's another thing adding to the list of cons. As I said, as an avid sims player, I wanted to like this game, but when the majority of time I spent in game was to try and get it working properly, I just can't be bothered with it. Had to request a refund which thankfully was approved despite playime (I had no idea about the 2 hour limit). \n\nMeh. I can't recommend this, even if it is in early access.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Sadly had to refund this game due to the extreme issues with graphics and performance",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I had high hopes for this game bc I was sick of the sims and wanted another immersive life sim to play out my kdrama dreams. first of all its still in early access so when I played it when it first came out in the spring time I was... met with with it constantly crashing and lagging. I also felt like the characters aged way too fast bc I would meet someone, get married, have a kid with them and they become a grandma within a few hours. I also got constantly {stuck?) when I went to put a canvas mod in alot of times. I didnt play with the ai much but thought it was a decent idea to decorate. It still felt very bare bones though. \nI came back recently to play their update and they did improve on alot of qol issues it had in the beginning but it failed to keep me in since I feel like nothing else really got added. \nI wouldnt reccomend getting it full price in this state",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Can not get it to work on AMD 25.10.X --- RX7700 XT 64gb Ram works on AMD 25.9.X a little disappointing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought this game at launch as I was excited for a new life-sim that could potentially rival The Sims franchise. While the game definitely had big shoes to step into and I wasn't expecting it to blow me out of the water completely, it was quite disappointing to see just how bare-boned the game actually was. At best, this game has been nothing but an over-glorified dress-up game, with poor optimization and world-depth. Sure, the graphics were beautiful, but that was all there was to it. There's nothing about the game that allows for true individuality or uniqueness. The game itself comes packaged in an influencer-style kind of sameness and filter; nice to oggle at and admire, but with nothing meaningful underneath.\n\nNot to mention, Krafton's recent announcement to push for an \"AI-first\" model reeks of tone deaf, lmao. Couldn't get my money back for any of the above reasons, so I imagine leaving this review and leaving this game to rot in my Library is my second-best option. Fuck AI and support real humans across all fields—regardless of whether or not they're part of the marketing team or actual dev team.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pretty disappointed, it had so much potential and it just feels so soulles and empty. Bored after like 20min. The create a Zoi is probably the best part, but the build mode and gameplay is very hollow and does not feel great. Sad and unsatisfied with my purchase. Seems like after the several months of hype it also died down as a community and from the Developers end as well just feels unresponsive. Worst 35£ i've spent probably",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not sure what they did with the game, now shader compile takes 30 minutes...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I honestly feel like I wasted my money looking back on this. The more I've learned about the game beyond playing it myself has just turned me off more. It's empty, heavy on AI slop, and there's hardly anything to do.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Horrid optimization, every update is worse then the previous one regarding optimization. \r\ngamplay is okay if you wanna play like 50 100 h in the game but not worth the price.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know the ram is important for games of this advanced quality but i cant even open the game beacuse my macbook only has 8gb ram and its an M1 2020 macbook air so i cant pay it and i spent $40 for this game this is highly disappointing. I guess its my fault for not reading the fine print smh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly I wanted to like this game, I loved the sims but the Sims 4 is just garbage that is barely functional. \n\nI know inzoi is still early access but it's basically the same as the sims, just with less content.\n\nAll the advanced stuff they promised does nothing to detract from the fact that the game is WILDLY incomplete, to the point it should not have been released period. Graphically I cannot even say it looks nice, because even with a RX7800XT 16GB it always has this weird, grainy look to it no matter what I change settings wise.\n\nIt's been like this for a YEAR.\n\nThe gameplay itself is incredibly shallow, with next to nothing to do. Left to their own devices, zois will usually do one of two things: Find the nearest computer, and spend an inordinate amount of time on it, before getting off and getting immediately back on, or, they will find the nearest mirror, and talk to themselves. But more often than not, it is just going back and forth between these two things, regardless of \"personality\"\nAnd speaking of personalities, the zois have none. \n\nI don't see this game recovering from this flop year. They sold us on a ground breaking new life sim, but what we got was a bare frame, that took a year for them to add wheels to, and the wheels barely work. \n\nWait like 3 years before looking at this game again, because it's going to be about that long before anything meaningful comes to this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's deteriorating daily. First, I couldn't control the character Zoi, then it started behaving erratically. It's not even lag. I wouldn't recommend this to anyone.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I was initially excited about what was to come for Inzoi, but I did lose that excitement pretty quickly. The gameplay \n and world itself felt pretty one-note and surface level, but I did want to excuse that with the fact that it is, to this day, an early access game. However, after learning about the developer's choice to be \"AI-first\", I am no longer interested and wish I had kept my money. \n\nReally disappointing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "COMPUTER TURNS OFF from initial Shader Compiler OVERHEATING my CPU. 90-100% utilization and 90 degree cpu eventually turns off computer. Game is currently unplayable all of a sudden. currenly at recommended specs :\nNvidia 3070 8 Gb\nAMD Ryzen 7 7800x3D\n32 GB Ram",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Looks cool from the outside. Boring and barren on the inside",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game isn't even working anymore - crashing right after loading screen. Even after reinstall. What a pathetic piece of generic engine 5 slop.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Nice looking game but building mode is still not good enough after i bought it. Now Kraftons corporate lords have fallen for the ai stupidity to stuff in even more cash in their pockets in the short term. Ai is not nearly good enough to replace people. Instead of keeping people and invest in ai to have a good tool for their employee's they go the microsoft way to pave way for the Linux transition, not complaining about that as open source is the future and windows is spyware nowadays. Krafton has basically made the future of Inzoi very questionable and most likely will remain on early access mode whatever they want to call it. I regret I bought it and gave money to a greedy moneygrabbing Ai company. Last game I ever get from Krafton. I want serious companies that care at least a little about their customers and a lot more about their employee's!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "AI \"First\" company, get in the bin.\n\nGame barely has anything to offer unfortunately.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Unfortunately all saves prior to recent update cause crashes its unplayable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game was fun at first, but as of me typing this, the developer is going with an \"AI first\" approach. I don't like that, and people shouldn't support this approach to games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Every updated breakes the whole game and all mods. WIthout mods the game is useless since there still is not alot of content. Every hotfix and the game and save is broken",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I can't even get it to load so I haven't been able to play but yet it says I've been playing for 4 hours",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Firing people over “the era of AI transformation”?\n\nFuck that! Zero hope for the future of this mess. Hope you guys go bankrupt ASAP.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Krafton has became an AI first company and offering people to quit but let me honest they'll have no choice as they'll do lays off eventually. I'm sorry for the Inzoi team as krafton has the major power over inzoi.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it’s just not fun. the zoi creator also isnt my thing. plus, i absolutely despise AI. i didnt realize (maybe i shouldve looked more into it. no worries now, i refunded the game) that inzoi had it. i instantly regretted buying it",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Without mods like WW and McCmdCenter in Sims 4 is boring af",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bad copy of Sims. Nothing more to offer than the false hope and promises of a new era in the sims play style which I fell for, all while dropping the ball all over the place resulting in a very un-enjoyable experience. Go play sims instead, this isn't worth it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI first announcement from the company :( rip what could have been a good game, probably don't buy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This, in fact, did not kill The Sims at all in retrospect to what everyone thought before its release.\n\nKorean developers are so obsessed with everything looking perfect that it entirely takes any realism away from the setting. It genuinely just feels like a modded sims 4 game but ONLY the fashion mods where every sim looks like a doll that is impossible to look “ugly” no matter how much you try to mess up the face.\n\nI don’t know why I bought AND kept it. It only LOOKS great but that's about all going for it",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[u] First of all, I know the game is on early access. Don't come at me. [/u]\n\nGraphics are nice, creating a character is very detailed. \n\n[b] BUT [/b]\n\nI don't know what's the problem but the game just doesn't... flow?\n\n[list]\n[*] I don't like the fact that I have to go in and out just to change some details of different characters. I wish we could customize all the characters in the same household at the same time. I don't want to keep saving and going back to the household menu just for a little change.\n\n[*]Canvas (the gallery) is nice, yes. But it needs to improve.\n\n[*]Even though I have a mid-good tier system, I tried to play the game on medium settings but I still have issues. Optimization needs to be improved. \n[/list]\n\nOverall, it looks great but I feel like it lacks something on the gameplay side. If you want to create realistic characters, amazing. You can enjoy it. But the game feels slow. Hope it'll improve with the updates.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Pretty, but completely hollow ⭐☆☆☆☆\nInZoiu looks great, but the moment you play, it falls apart. Not from glitches but from the weird, empty behaviour. \n\nCharacters ignore what’s right in front of them, and move like NPCs with no inner life.\nThe world is detailed but soulless, and nothing feels connected or meaningful beneath the visuals...\nPerhaps future patches will salvage it?.. but I doubt it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I need to simulate chaos to get my fix, not normalcy. I need my fight or flight reflexes, adrenaline flowing. I don't think I know how to play this game properly. I can't rob or shoot anyone. Where's the fun in that...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it's annoying as f*ck and tbh, if i could, i'd get a refund. i don't like it at all.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "sandbox but empty . there is almost nothing to do in the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring and lifeless",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Cool character creator but where's the game?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Soulless cash grab with AI stuff tells you all that you need to know. Not worth the money...",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This never ran so good anyway, now not at all, just black screen, so not for me, can't play it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Sims franchise needs competition with games like inZOI and Paralives.\r\n\r\nThe Good: In my opinion inZOI shows a lot of promise at early access. WASD character movement is an underrated and greatly welcomed addition to the life-sim genre. Freeroam is another feature that is great to see in inZOI when compared to The Sims, which has excluded this feature in their latest installment when compared to its predecessors. Hopefully, Krafton can continue to improve and add features that the community wants such as more interactions with the world and the ZOIs. \r\n\r\nThe bad: In it's current state, inZOI has beautiful scenery, character models, and objects, but suffers from a lack of interact-ability with the world, resulting in a sterile experience. To address this, Krafton could implement increasing the interactions ZOIs have with their careers, with other ZOIs, with objects, and with the world around them. \r\n\r\nThe ugly: Generative AI is not something to celebrate or commend in inZOI nor the video game industry. It will remain as a major flaw in an otherwise promising game until it is removed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "game says it's running yet i'm being told that that it won't open because the graphics is low",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I cant even play. It just hangs every time and crashes before I can even play. I have a high performing gpu and cpu.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "inZoi is technically very impressive with it's visuals and tools. It's however not as intuitive or as easy to play as its major peer. The building system especially is a bit tricky.\n\nI hope these things will improve in the future. At it's current state it's at least for me not very enjoyable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "honestly one of the worst games i have ever played the game crashes and barley works.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game feels very empty. I spent like two hours making a family, but then there was not much else to do. I haven't tried the latest update and I don't feel like trying it.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}