{
  "positive": [
    {
      "review": "I haven't reviewed yet and just clocked my 160th hour not too long ago so figured I'd shoot.\n\nSo far I've liked the game quite a bit. It's a different pace from a game like Tarkov in the sense that the pvp will not feel the same, as well as most other things, but I like the idea that its more of an open world rather than an extraction shooter. Tactics are actually key when clearing larger areas like Midnight Sapphire Hotel or Fort Narith, you can team up with 3 other people to form a squad, and there are A LOT of missions to do. It's a lot more chill than games like Tarkov because you can have almost similar fun while still adhering to your normal schedule. \n\nIt's super enjoyable for the price point, especially with a couple friends, and the upcoming updates seem like they're going to have a lot of great QoL updates. Of course there's always going to be more to refine but MADFINGER actually seems to genuinely care and do their best to apply the communities feedback. Between the content, and adrenaline you get when you randomly get shot at or are clearing a building with friends, you'll get your money's worth out of the base edition but I highly recommend trying to play with friends or at the very least try to make some friends in the game. The community is relatively friendly (sometimes people are just in a mood) and most of the times I've needed or seen anyone who needed help its gotten done.\n\nSome problems you might encounter if you first get the game is some FPS issues at times (like for example certain areas cause CRAZY frame drops when you aim down sight) but you can always try to run your weapon canted and use a laser (although there are certain areas lasers are bugged). Theres also the occasional frustrating random 1 tap or AI in a bush you cant really see but because they're AI they are able to detect you a little better, but they're working on all of these things and they strive to uphold a \"same or better, not worse\" standard which I can always appreciate, and I look forward to seeing how far this game will go as more and more time passes!\n\nAnyways hope this grants y'all some feedback into whether you should get the game, and if you do I hope you enjoy!",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "First off, it’s important to emphasize that this game is still in early-access, pre-alpha. It’s not a finished product, and it’s not a full release. Anyone thinking about buying it should know that upfront so they understand what they’re getting into. A lot of people compare it to games like EFT and end up disappointed when it isn’t the same. But GZW is its own game! Let it grow into what it’s meant to be, not what others expect it to be.\n\nThat said, GZW already shows a ton of potential. There’s an impressive amount of content for an early-access title, and the community has been incredibly supportive and always ready to help new players and bring them into the fold.\n\nIf you feel like you’re ready to jump in, definitely join the GZW Discord server! You’ll be part of an ever growing community that helps each other out, discusses the game’s development, and shares feedback directly with the devs. It’s the best place to stay connected and be involved as the game evolves.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "The game development is really good. They listen to the community and fix so many bugs. On top of that they release crazy updates with new content and the recent one giving everyone 50-100% more fps in-game. You can see their hard work and i'm looking forward to the full release of the game. After the performance patch I actually would recommend buying this game because for me it went from 100 fps to 200 fps.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "It's like Farcry, DayZ, and Ghost Recon had a baby. Epic game.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Running on a 3060 Ti and Ryzen 5600X, I still get random crashes but keeping only the game open helps a bit. The game is raw yet promising. Even in this early stage, it already feels closer to Tarkov than anything else on the market.\n\nNo long raid queues. No pointless backtracking. You lift off by helicopter and drop straight into the action. The map is fully open world, and missions flow naturally through your radio without forcing you to return to base every time. It keeps the pace fast and immersive.\n\nCombat is intense. Three PMCs fight for control, and friendly fire has heavy consequences. You can switch between PvE and PvP seamlessly, leveling up in one and fighting in the other. Small touches like raising your weapon while wading through water show real design care.\n\nPerformance still hurts. FPS drops, crashes, and unstable AI happen often. Landing zones discovered manually feel clunky. Yet the core gameplay loop is there and solid. If the devs stay committed, Gray Zone Warfare can become what Tarkov has been trying to be.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game had a rough start with limited servers at launch which delayed my purchase at first. They fixed that issue. Love the detail in this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its not like all the other extraction games its one of a kind you can switch PvE or PVPVE and keep your gear progress so play as your mood feels its early but the devs are for the community",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Imma say first I don't know why anybody would want to play this in pvpve, seems like it would be akin to C&B torture. In pve though this is my favourite PMC tactical shooter, like a first person GR wildlands that's tense, has stakes but doesn't need to become your second job just to be able to enjoy and scratches that tactical itch in a way that no other game can for me. The combat is great, the world is immersive and the addition of the weather/time systems adds to that, plus no loading screens when you are in, you physically ride in choppers to get in/out and its always a vibe. \r\nAlso the biggest game-changing change (quite literally) recently is the improvements with the enemy AI that was implemented recently, they are sooooo much better to fight than before, mid/long range engagements actually feel like firefights and they feel more fair while still being deadly, rewarding good repositioning and moving smart. Mind you they are not perfect but even the devs have said that, but what they have done so far is waaay better than before and has got me back into playing since the update. If you are a returning player that was annoyed by the enemies laser zeroing you instantly through foliage, I'd suggest giving it another go.\r\nThe only gameplay thing that can be a bit frustrating sometimes is that some of the mission directions can be a bit too vague for me, like I get that its supposed to be immersive but sometimes it askes you to find a needle in a haystack with barely any leads, when that happens I just get a little hint from the wiki cos I haven't got all day, got a life outside of gaming. Obviously I'm not saying they should put big quest markers on the UI or anything like that, but just wish they would use the map coordinates more like the earlier missions do, they help a lot and add to the immersion imo.\r\n\r\nOther than that though I love this game, yeah its not perfect its still in active development, but I'd suggest checking out their Youtube channel, you can tell that these are some really passionate and talented people and don't deserve the hate they get online. Salute to you Madfinger keep on cooking!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☑ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game's PVE is fantastic and scratches the \"Tarkov without sweaty pros exit camping\" itch. While comparisons are inevitable, it's got enough going on that it really stands out as its own unique experience.\n\nThe AI is capable, the open world is fun and engaging, and the questing/progression is enjoyable. There's an incredible amount of immersion and it's easy to get lost just exploring the world and looting in between firefights. The pacing is slow overall (think Tarkov mixed with Arma), but there is plenty of action to keep the game exciting. \n\nLooking forward to continued development.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Insanely fun and atmospheric, even moreso with a friend. The game takes some time to get good at, but has a special experience I've not found in other extraction shooters.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "WAYYY BETTER THAN TARKOV!!! I absolutely love this game. it makes me feel like im in special forces",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome military shooter for patient players. Any COD-rusher didn't enjoy it too much but if you expect battlefield realism, awesomly made weapons and modyfying them, realistic wound and healing system, yhats something you will enjoy that game a lot",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I’m leaving a review to help other players, because a lot of the negative reviews are just from people who don’t understand what they’re talking about. Yes, this is a demanding game on your PC, so don’t expect max graphics if you don’t have a strong computer. A lot of people complain about the AI being too hard, but they’re really not you’re just playing wrong. For every 100–200 AI I kill, I might die once. This game is about tactics, not running and gunning.\n\nThe devs genuinely try to make the game better, and they do. I’ve noticed huge AI improvements and big performance gains while playing. I definitely recommend this game if you have the hardware for it or the money to use a streaming service like \"Geforce Now\" Which I used on this game for a long time to play this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Playing mostly PvE with a friend, and the game is quite fun that way. We love the atmosphere and immersion. Ballistics is quite nice, the map is extremely well made and beautiful to play in. The AI is challenging enough in the later parts of the map and forgiving enough in the earlier ones. Death is not too punishing (in PvE) and money and loot isn't too hard to come by. Overall a good experience to team up with some friends and raid the most difficult areas.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its not worth the hate that it gets (or the lack of anything really); this game is truly special to people who want to play PvE shooters and enjoy them. it does everything right with beautiful gunplay, an intricate health system, and a wide array of systems that could satisfy a game for at least a week of playtime. its worth a shot for anyone look for some fun with friends or by themselves.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is absolutely worth its cost. Optimization could use some small amount of work, but it's def not as bad as people are saying. I'm running at 2k in ultra settings and my average FPS is 100+. Enemies are a bit on the extreme side, they need more balancing, but I have found that if you run in a squad and keep a momentum going that everything just falls over. Now, when running solo, diff story. Everything you do and every move you make you have to do with confidence and precision or it could end up being your last. Server performance has been smooth. I even decided to check out an Asian server since it was night on it and was impressed even with the high ping \"I normally run US-East\". I feel that over time when more armor and weapons are released it will have more variety, but even with the limited selection it feels nice. As for modding weapons, you don't get much of a choice. Mods are by tiers so obviously you will be using the mods with the best stats you can get your hands on. The only thing I'd really like to see in game at the moment though is the option to see other faction players in the area you are at on the PvE servers. Would make it a lot easier to know if I'm alone or if I have some help nearby if needed.  I'd say the only thing that super annoys me is the damn time restrictions on the quests. It either needs to be longer \"currently 22:00-05:00\" or not as frequent.  It wouldn't be such a prob if the NODs worked with some of the scopes. Basically, if it's night, don't plan on doing anything ranged. I'm almost done with all my tasks and so far I'd have to say the game is a solid 9/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "probaly the best extraction game ive ever played but make sure your computer is good cause i have a rtx 3080 and barley get 60 fps on low-medaim settings",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, looks amazing - Only problem is if I play for two hours I'll be guaranteed to crash 5-6 times.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, devs are still working hard and regularly updating. Has a chance to be a great game but worth it in it's current iteration",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "at first i was frustrated by the game. kept dying and losing all my gear. couldnt figure it out. ended up making a new character like 5 times. took a break for a month and then came back and took my time and learned everything i needed to know. now i love the game and playing it several times a week for hours. it's a blast. if youre having trouble getting started, take it slow and dont take good gear with you, or ask a higher level player to show you the ropes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has issues but also has potential, ADD Zombies i swear this will save this game. I promise you",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It has everything you are searching for if you look for an extraction shooter, incl. a PvE mode, which many others lack. It also have the best graphics if you have a beefy pc (but they recently improved optimisations!). You can tell they are really working hard to make it the best out there, just look at the latest major Patch releases. This will be a masterpiece.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Beautiful graphics, captivating location, smooth performance so far, very wide selection of weapons and gear, nice health system and very immersive gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is insane , really intense and immersive . Im addict but it really need more Guns,  like the scar L - Scar H , G36 , Acr etc cant wait to see whats coming next",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very fun game for early access with interesting, unique takes on the extraction shooter genre. This game has a LOT of potential--check out the early access for a sneak peak. You'll have plenty of hours of fun. The developers are excellent and pushing regular updates at the time of this review. They communicate regularly with the player base, adjust based on feedback, and are actively pushing to make their game better. Worth supporting if you enjoy extraction shooters!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The recent performance patch they released has finally allowed me to play a game I bought almost a year ago. The changes in A.I./Loot have been noticeably great, and I am genuinely enjoying my experience with GZW. If you were like me, who was hesitant to come back and try the game again. You should give it another go; it might just surprise you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong, it definitely needs work, but I have a strong love/hate relationship for this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. Has come a long ways since it started. Still a ways before it is released and it is in no way perfect, but the community is wholesome and supportive. Warrants a play in my opinion and cant wait to see what they have in store for this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is good and the community is very helpful to new players. will pay it forward as i get better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "devs are updating like crazy, game is becoming more and more enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is wonderful, I don't play many mil sim games but i had a little playtime with other milsim's and i some what enjoyed them, but i had gotten grayzone to play with my dad and i have to say this was an amazing expirence from content, never having nothing to do. squading with buddies is super easy. And the health system is a nice blend of realistic damage model, and simple treatments for injuries. If i could i'd have MIB wipe my brain so i could expirence it all again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic open map, with increasingly harder missions as you get used to the environment.\n\nTakes into account the difference between cover and concealment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gray Zone Warfare is a long-awaited gem for fans of co-op shooters. The map is massive—42 square kilometers (over 26 square miles)—and offers endless opportunities for exploration. Weapon customization is already impressive across several platforms, and remember, the game is still in Beta.\n\nThere’s plenty of PvE content, with questlines that can keep you engaged for hours. Progression feels rewarding thanks to the reputation system with vendors, and the addition of dynamic day/night cycles and weather changes makes the world feel alive. Visually, it’s one of the most realistic and beautiful shooters I’ve played in years, and it keeps improving with each update.\n\nIf you’re into FPS games, don’t miss out. Jump in now and support the developers as they continue to refine what could become one of the best titles in the genre.\n\nAs for the “thumbs down” crowd: constructive criticism helps. Instead of trying to tear down a project still in development, share your feedback directly with the devs. The foundation here is already strong, and the potential is enormous.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Great dev support team that will actually listen to player feedback and try to accommodate but also stay true to their vision for the game, So much improvement from launch. Cant wait to see where they can take this game by 1.0 release",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun action adventure  and play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has a long way to go, but for what it is now I'd say it is pretty good, I have played almost 400 hours now although it can get a little boring at times but if you have a friend to play with this can be quite fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The 0.3 update has been a blast and the optimization has improved significantly. Definitely worth a honest shot if you haven't played since launch,the most important is you have to focus to your task to leveling up your traders and you get money from the task and equipments \nAnd don’t forget this is pre alpha game.\nMy only problem is with the ai, in the night time if you shoot from the jungle with suppressor from 100m\nThe ai can see you. I hope they gonna fix",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's fun to larp in this game and explore around. the openness of the world makes it a better extraction shooter cause there's no time limit and you can come in an objective/poi in any direction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game. Is it a little buggy? Sure... Is it fun? Absolutely! Can I recommend it enough? Nope! Just buy it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hoping this game continues to develop. Took a hiatus waiting for new stuff and updates. They have been doing it in increments and I look forward to a complete game. Not as many people playing these days but, I think its for similar reasons. It appears the devs care about the game and from prior updates it just requires patience. Fun game overall but, definitely better if you have friends in the same faction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing graphics with amazing ai and its only in pre alpha i cannot wait to see what is to come for this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Refreshing experience in this genre. The first game that I find myself wanting to finish all missions after each wipe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game from these devs. truly immersive world that has so much to offer to those who dare explore it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this rather chill, if you are ok with walking for a bit to get to landing zones, it is eventually worth it, the players are so fricking  nice and chill i recommend pve",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The devs have fixed SO MUCH still launch, the gameplay and graphics add to the immersive feel of being a PMC in south east Asia. Wonderful game, came back to it and can't stop playing it. Favorite fix is that you don't get one tapped in the chromadome by an Ai 200m away anymore but also seem a tiny bit too easy now due to the flashlights not alerting them. (Nov 2025)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Works flawlessly on a laptop with 13th intel i7, 40GBRam, 4060 8GB Ram\nHard to play, but when you'll have understood it is a gameplay so far than COD, you will love it ! \nYou cannot run and put 3 headshots than run again, here it is really slower,  you have to preprare, observe, plan.\nIt is in fact closer to Arma 3, with the simulation pushed far more and without the vehicles, only you, your team if you have one, and the rebels (?) in the jungle.\nStill some rough edges here and there, like when you cough, I dont know how to heal that apart from safely end deployment or wait a looooong time it goes away\nI really like the \"rpg\" part when you have to explore, find keys or clues on how to open doors to find interesting loots, hidden stashes etc :)\nThe stash can fill up quickly, especially with the basic (tactical) version, but some youtubers say it can grow bigger after certain tasks :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is an awesome extraction Shooter with it's own little quirks to master and explore. It is in my opinion on the way to be a huge thing once it is finished. Even though it is as of this review still a pre-alpha, it is already more engaging and more consumer friendly than every AAA game I played in the last 5+ years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than it used to be, just tasks are kind of annoying as you have to look up a tutorial for every single quest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a refreshing departure from CS2 and BF6. Since I've purchased it, I've played 37 hours. I have not played CS2 or BF^ since installing this game. Its mission oriented rather KDR oriented. IT comes with real loss when you get killed. If you don't make it back to the exact point where you died, and you get killed again on the way, you lose all your equipment. ITs a fun game for sure! Yes it has bugs since I'm playing the pre release version. I'm happy to share that the bug I reported, I got an actual response from the DEV team. Very nice! There's far more to this game than running and gunning. It's not COD, or BF6, or CS2. Its not that simple, and requires far more planning and thought than the others I've mentioned. I'll also say that every player I've encountered has been mature and friendly. Such a welcome change!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "217 hours in and writing my first review for the game. The game is in a great state right now. There are some issues but overall the game is a ton of fun, compared to .1 and .2. The one way I can describe this game for those looking to buy it is if ghost recon wildlands had an extraction shooter mode. This game definitely won't kill tarkov but its a nice break from it. AI is still pretty annoying, but new update definitely improved them. Want a new military extraction shooter, get this game, community is great and will help you get through the tasks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its still a work in progress but its getting better its leaps and bounds from the day one game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has alot of potential but the devs still has a long way to go. I do hope they work on more dynamic lively missions as currently the missions feel very stale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All I can say is WOW. This game is something special!!! This is by far the BEST mil sim/ fps I have ever played! Crazy to think its not even finished honestly. This game is more addictive than nicotine. Beautiful graphics, The sounds of gunfire will have your gut dropping and hands sweating when your in a gunfight. The community on the PVE side (Joint Operations) are some of the BEST people i have ever met on a game. They dang near hold your hand while escorting new players through the ups and downs. Also, they will hand you some of the best gear from the start and say \"No trust me, you're helping me out I promise you\" when you say you feel like a bum XD. Hands Down My FAVORITE Game!!!!!!!!!!!!!!!!!!  Also If you like PVP its there too, (Warfare) But beware, that stuff is brutal XD.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "***YES BUT NEEDS MORE BADLY*** Let me start by saying, I love this game. It could easily be my favorite extraction shooter to date. But once you play through the tasks for your vendors that's pretty much it. Its a good grind imo but with how long these wipes are we need something to do badly, or we need more content and wipes quicker. The end game loop is literally just pvp over loot. Don't get me wrong the grind is super fun, the gameplay feels clean (when you have a decent pc) the graphics are phenomenal, the gunplay is clean as hell. What you want is what you get in my opinion and the price is worth it if it stays this price. Once this game gets developed more it could stomp out the industry if done right. It just needs so much more to do. For one thing, my favorite thing to do in an extraction game is loot. This games looting is pretty awful, its just raid military stuff for gear. There's no real \"Oh my god I need to get this to my stash now\" moments. I mean maybe pvp tag runs but trading DDr4s by dying gets old. The COPs were a massive step in the right direction. What about territory control for tasks? Give refreshable missions based around pvp like fighting for COPs or holding a certain group of them to get rewarded. I like the pvp but making it something that's a need occasionally would be nice. Besides pvp, the pve game is really bland. There is nothing to grind for at the end of your vendors levels. I know its not released but the game is almost the same at its core since release. DEAR DEVS, don't let this be tarkov, 8 years is not okay. Its getting to feel repetitive and its not out yet. The new missions are nice, but its still just missions for rep. The bosses arent worth worrying about except for tasks, their loot sucks and they're just another scav with one solid attachment and good ammo. I just want to play the game more and have reasons to play it. I want the loot to not be \"soda\" and \"earrings\" and have uses for loot outside of just money. I want WAY MORE GUNS. The gun selection on this game is atrocious. You will use maybe 6 guns tops throughout your vendor grind. Unless you choose to play at a disadvantage or run tight areas, its m4. I enjoy every aspect of the game and I just want more of it. Also, scav changes were ****ing huge. I want to play 1.0 now, and I am fine with waiting, but you gotta give me more than night time, rain, and balance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game still has a long way to go but the foundation for a great game is here and with the devs being so open about everything is very nice to see",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice aspect to the extraction shooter series. Different servers for either PvPvE or PvE.\r\nNo time limit for each sessions so you're not bugged by a timer to extract.\r\nDifferent Enviorments from Airfields, Towns, Forests, etc.\r\nLots of different weapons to facilitate a vast array of play-styles.\r\nTasks from Vendors to help introduce gameplay and giving something to do if you dont like exploring freely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gray Zone Warfare is a pretty interesting game, it uses mechanics of Extractions Shooters in an open world. The game is far from finished and still needs a lot of improvements but MADFINGER is doing an exellent job, sadly the updates come almost like seasonal but every major update theres new features, items and changes to the quests. The community and dev team are something very special in this game, eventhought the community at the moment is not that big its pretty active and ready to help. The dev team always does some livestreams when its close to the major updates where you can make questions and suggestion. Hope this game turns into a big thing in the Extraction Shooter genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PVE is really fun if you enjoy a realistic style game where you loot and kill enemies cant say much for pvp",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No game has ever made me more paranoid in my life. I never jumped when i hear gunshots...until I played this game. I love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun and engaging FPS extraction shooter. Definitely recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Expect Arma type milsim besides the constant crashing its a great game but has a huge learning curve when your new.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GWZ is the best modern shooter available atm. I've tried about every hardcore title worth mentioning and nothing clicks quite like this. \r\n\r\n- unswayed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is great when you play it out in the open as a homeless man living in a storm drain in Las Vegas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive had game sense drop but sense 0.3.5.0 this game got so good AI's dont have aim bot anymore such a great game wish it had some atvs or jeeps tho to get around the map",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game weather you go solo or in a team, Does not hold player hostage and it's easy enough to go in and out. Additionally it allows mutiple game styles, go fully kitted up and careful or go in naked and get all the gear on site. Each update is solid and the wipes do not hurt as they give more reason to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been here since launched and couldn’t play the game because was terribly optimized (have a 4070ti) but this new 0.3.5 update had made this game more than playable now I average 110-120 fps now and with frame gen I get a stable 180 fps and crazy part is that with Frame gen the game runs better this is a first, if you haven’t played in awhile I jump back in to see if the game runs better for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun and deep extraction shooter that is surprisingly impressive for a game basically in Alpha or Beta. Just make sure you find a good group to play with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really really good game.\r\nBetter than tarkov, with devs that actually care about thier game, looking forward to seeing where it goes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For those looking for a realistic and immersive combat experience, this is the game you've been searching for!  Excellent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like dayz if you guys have ever played thats and overall its a really fun game to play with freinds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is amazing, and from the begining to now is amazing, the QoL is shockingly good. well done MadFinger Games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really interesting game for early development. Gunplay is tactical and the world is immersive with some of the best graphics I've seen. Excited to see where this development ends up!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not gonna lie i had different expectations for this game but its pretty good. \nIts kind of like comparing every MMO to world of warcraft. But this game is totally different. I love the helicopter. I like that i can find close bases fight take them over and use my stash. \nThe traders so far are interesting and running faster with your knife out is fire. I definitely want to see more than the Kbar or different variants.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely brilliant! great map, great customization, mint weapon handling.\nAt this stage of development and being this good, looking forward to its full release",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun love pvp and pve give you a choice to fight with players I have came across one cheater but other than that solid game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is surprisingly good and has quickly become a favourite. If you want some real realism and excitement in this world of unrealistic, fast and chaotic shooters, try this game. Graphics, sound and the environment is great. Good vibes and just like the in game characters heart is pumping of adrenaline and excitement, so will yours 😉",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great shooting and looting game. the fundamentals of the game play and the realism of the survivor instinct really shows.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is rlly fun even tho its in pre alpha game is rlly good i just hit 1000 hours and its like the only game i play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great, 32hour of game and still have interesse. idk if  its the new update but i got no issues whit the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game! dont listen to the haters, cant make anyone happy these days. but im old now, this game has a good pase to it. pve is an option. Madfinger has been around forever making good mobile games. they really came a long way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoy the quest system and how the map is open world and constantly running. I do find the lack of variety in voicelines annoying, as well as the fact that they speak broken english instead of some native language.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like Tarkov, I recommend this game.\r\nIt's Tarkov that runs better, with more user friendly mechanics, but not too arcade-ey\r\n\r\n\r\nIt has the \"Down but not out\" Tarkov talked about. If your squadmate goes down there's a chance he goes into a \"coma\". You can drag them to safety and heal them. \r\n\r\nThere's a live in game map that shows you where you're at, what direction ur facing. You can place waypoints that show up on the compass.\r\n\r\nThey just updated the A.I. they're much better than Scavs in tarkov.\r\n\r\nAnimations and graphics looks great. Sounds isn't bad either.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "movement and everything was so jank about 6 months ago, friends and I refunded. recent patch on the 4th of nov 2025 smoothed out enough (especially movement/ animations/ performance) that its really good enough right now to enjoy, even as at this stage (pre alpha), even as a solo player. the open world PVE is fun running into other players and getting blasted and blasting NPCs. not sure it holds up in PVP yet tho, and the progression/ tasking/ looting is still mehhh but glad to support at this stage.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far i like it. The missions at the moment of being level 7 are okay. However i am enjoying the guns and customization of guns. Looting guns and parts off enemies. Something i would hope to see added in future is binoculars and bayonets. 1903 springfield, any lmg such as DP-28, grenade launchers  any more of guns please. perhaps may we see vehicles added? the light pickups that are through out the world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] A Must-Have for Anyone Who Wants to Dive Into the World of PMCs [/h1]\n\n[h2] Review: [/h2]\n\nGray Zone Warfare is, in my view, essential for anyone looking to immerse themselves in the operations and atmosphere of a private military company. The game runs exceptionally smoothly, and its visual presentation is outstanding. The overall design — from landing zones and forward operating bases to contested PvP areas — creates a highly engaging and believable environment.\n\nCombat mechanics are another standout element. Weapon handling and ballistics feel exceptionally well-crafted for a milsim title. The medical system, too, is impressively detailed: dragging unconscious teammates to safety, securing the area with your squad, stitching wounds, administering blood, applying tourniquets, and managing other medical procedures adds depth and tension to every encounter. It’s one of the most satisfying tactical medical systems I’ve experienced.\n\nThe developers embody their motto, “Community first.” They consistently communicate with players, share updates, invite the community to tests, host events, and stream development insights. Their interaction feels genuine and greatly contributes to the positive experience.\n\nThe main limitation is the progression system. Acquiring weapon platforms, ammunition types, protective gear, and medical supplies requires significant effort, especially considering the regular wipes — typically every major update (around every six months). While these wipes are necessary to maintain balance and integrate new systems, they can be restrictive for milsim enthusiasts who want consistent access to equipment.\n\nA dedicated freeplay or training mode would be highly beneficial. Being able to experiment with different weapon systems, ammunition types, vests, and medical tools — alone or with friends — would allow players to warm up, practice tactics, and familiarize themselves with the game’s mechanics without grinding for gear.\n\nDespite the effort required, the progression itself remains enjoyable and offers room for strategic variety depending on your chosen approach and tactical tools. Whether practicing close-quarters engagements (CQB) or open-field battles (OFB), Gray Zone Warfare is an excellent platform for turning theory into practical skill.\n\nOverall, it is a remarkable and carefully crafted game that offers immense value to players who appreciate realistic tactical experiences.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game, it's different than most extraction shooters in the sense your always in the game/world, there is no separate loading/starting prep area (It's got something similar call the FOB but your already in the game world where you do everything.). The community is one of the best and friendliest you'll ever find compare to other games of this genre, the majority will pretty much always help with anything, may it be doing missions or just need a friendly pick me up after a few bad tries. \n\nIt's a bit more on the hardcore/realistic side but thankfully once you get the hang of doing a lot of the intro missions it's like riding a bike after that during the updates and because of the awesome community people have no problem answering any questions. The fact that it's still early in development is impressive, I definitely got my money worth of content. \n\nThe 2 main negatives I find so far is the usual performance issues you get with UE 5 and the AI seems to either be really dumb or somehow they are like CAG + Navy Seals + Green Beret + Ranger all in one despite the updates lol. But, thankfully they are some of the key areas the devs keep tweaking and working on. They are also very great at staying in constant communication with the community so no lack of transparency. \n\nThis would be a great start for those to get into this kind of genre of game since there is just as much a heavy focus on PvE if I dare say even more than PvP right now and add the fact the dedicated community is great and helpful for the most part. So this be great for those trying to give something like this a try or those who are big into this genre will certainly find everything they expect to love.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got to say, this game will be really good when it's out for reals. Being an Early Access game, I got to admit, this game surprised me. It's good. I like how you can build up your weapon. Even though it's rather simple right now. I feel it will get a lot better. The bullet drop more or less doesn't exist, so zeroing in on scopes is unnecessary. The M4 is as good a gun as you'll ever get your hands on, so the other weapons feel kind of unnecessary. In late game, this game is no longer challenging, which is to be expected. So the moment you get your hands on Night Vision with IR laser, you will find the game is the most tactical and easiest at night between 22-05 in game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played the game since day one of its release. The first version was weak and it didn't seem worth the time, but when the first wipe and also the first major update came out, the game was given another chance, and it was worth it!\nThe game isn't finished; the developers still have a lot of work to do, but it has great potential. The PvP is okay, but it didn't impress. The way the bullets behave is brilliant, even if they sometimes stop in leaves. The enemy AI still needs work, as they are either too unintelligent or can eliminate a player with a single shot through the bushes. The zone and graphics are superb, and the rain, wind, and sound are good. Initially, the game seemed to be a copy of Escape from Tarkov, but it has similar features, though it is quite different. It is very immersive, and a player can get lost in the landscapes and missions. The day-night cycle is perfectly done. Well done to the developers and keep up the good work. All missions are complete, and the player is eagerly awaiting the next wipe and major update.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very realistic feel to the weapons, gunplay, and world.  Harsh and unforgiving to give you a real sense of panic when it hits the fan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite games to play with friends. well thought out, great dev team, continuous support. Been here since day one and will be here until the end. dont forget to check out all the latest on grayzone and gaming as a whole https://link.me/thelounge",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "WAYYY BETTER THAN TARKOV!!! I absolutely love this game. it makes me feel like im in special forces",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "With all the new updates its quite enjoyable now. The AI is more tamed, you still get shredded if you are not careful. Looking ahead for the wipe and new content!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its the best open world shooter looter extraction/RPG there is i recommend getting on the train now because it aint stopping or slowing down anytime soon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While still in development, Gray Zone has quickly become one of my all time favorite shooters.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great mil-sim, even better after the last patch. Small tip for beginners, don't rush :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "because its real, and its better than cod, and bf6. PLUS, it is depression relief from a tied game i am on, APESEX Legends. I AM VERY DEPRESSED, and this game makes me super duper happy, highly recommend it for stress relief from a competitive game like apex legends because i wanna bash my head open so thank you for creating this game!!!! Please create more content for it, take my money!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "please add like a market to buy more weapons and put in a gun build options and more content its a good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic. very polished for being in an alpha. I cant wait to see the full release",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As an USMC Veteran, I can say this game is what all military personnel would love to play! The game is perfect!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The Devs said they fixed the AI in this last patch but I'm still getting lasered through bushes at 100+ yards  consistently by dudes with iron sight AKs. Also I don't really understand the mechanic of the military AI going for mostly head shots. If you want realism especially when it comes to military AI, make them actually behave like military personnel i.e. aim center mass. This mechanic coupled with the Aimbot they have is fucking annoying. Also, somehow dudes are still able to tank 5 plus shots while wearing nothing but a tank top, shorts, and flip flops. Not only do they still tank shots, but now the recoil is even worse making it 10x harder to get on target along with actually killing the damn guy. I really like this game but you guys just keep dropping the ball. Definitely not wasting anymore storage space on this game for awhile.",
      "voted_up": false,
      "votes_helpful": 160
    },
    {
      "review": "Pitch black darkness that requires NVGs or flashlight to see anything, yet NPCs can beam you in the head from 300m away with no flashlight or NVGs. I understand that this game is still in development, but this is pretty basic stuff. When this issue gets fixed, I will change my review.",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "PVE solo isn’t worth it. Progression on PVE servers is often impossible because everything is cleared or looted. They only let streamers and “influencers” run private servers. You reach quest areas and find all enemies dead, quest items and bosses gone, and loot caches empty because other players got there first. This is especially bad at the start, it took me 3 real days to finish the starter quests because I couldn't find any keys. I've dealt with this issue until the end game.\n\nYou will often spend half an hour or more clearing enemies at a location then a group of randoms will roll up on you and go straight to the loot cache/kill the boss that you came for, and leave.\n\nAll of the quests are impossible to do without a wiki/youtube guide. I can summarize the quest design as \"find needle in a haystack\". \n\nI can write a book about how bad the AI is. It got wallhack. In heavily fortified areas, pushing solo is very difficult.\n\nNo to mention the unfriendly community, rubber banding, network stutter, and the slow updates... Since this game gets 2 updates per year, you might wanna wait until 2030 before it's ready.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "I'm putting this as a thumbs down, not because it's a bad game, so far it's actually pretty decent...\r\n\r\nBut just simply because a game should not go for this long in an \"early access\" status, and I want to disincentivize game developers from doing this.\r\n\r\nThe game isn't complete yet, but they're already selling DLC's as if it is. I'm sorry... what?\r\n\r\nYou're producing DLC's, for a game, that you haven't even finished and launched? Why not just package those DLC's into the game? (We all know why.)\r\n\r\nI'm tired of cash grabs. On ethical grounds it has to be a thumbs down.\r\n\r\nOnce the game actually launches I'll give a more serious and though out review.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I've been monitoring Gray Zone Warfare for a couple of months now, and have been impressed by gameplay I've seen on YouTube. Seeing the Earl Access label kept me from purchasing the game until yesterday. I decided I'll bite and give it a try. I can see where this game is going and I'm excited for it, however in the current state it is not worth the $39.99 price point. There are graphical glitches, random ai moonwalking, and the sound reminds of an Alpha state game. I immediately refunded after 30 minutes of gameplay. I will keep monitoring the game's progression because I do believe they've got a gem of a game. As of right now I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[b]I’m genuinely sorry…[/b] I really like the Southeast Asian theme, the atmosphere, and the overall concept. But since you ask for feedback to improve the game, I’ll give you some so the final product can be better. I won’t go too deep since I’m not a game tester or anything like that:\n\n[b]I only started with PvE, and in my short playtime there are three main things:[/b]\n\n[b]1) Performance:[/b]\nThis is a big problem. I have an i5, 16 GB of RAM, and an RX 6600. The game runs very poorly, and to get above 60 FPS (barely around 70) I have to lower everything, giving myself the small luxury of keeping global illumination on medium. Even then, the performance is painful. As a result, the game looks terrible—pixelated, noisy, and with visual artifacts I honestly don’t even know how to describe.\n\n[b]Advice:[/b] I don’t know what engine you’re using, but consider downgrading—use UE4 or something less demanding. I’ve read comments from people with high-end GPUs who still have issues. Look at ABI [b](just as an example, with respect):[/b] they use a UE4 version and it works great. Players don’t care what engine you use; we just want good FPS and a decent-looking game, whether it’s Source [b](Insurgency looks great)[/b], UE4, Unity, whatever. You still have time. I’m no tester, but if you’re still in active development, consider moving everything to another engine now. Otherwise this will end up like Arma 3—playable only 10 years after release.\n\n[b]2) Helicopters shouldn’t exist as they are now.[/b]\nWaiting for one to spawn or be available is hell.\n\n[b]Advice:[/b] Add some kind of teleport system with a cinematic that simulates a helicopter drop-off to the chosen area. Anything would be better than the current waiting.\n\n3) Why do you give me missions if, when I get to the location (and I’m talking about PvE), the items I’m supposed to retrieve [b]are already looted by other players[/b]?\n\n[b]Advice:[/b] Add a PvE mode with bots only, like [b]Incursion: Red River (again, just as an example).[/b]\n\nThanks. [b]I hope the project goes well.[/b] I’ll keep following the development. [b]Cheers.[/b]",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "-Game suffers fairly regular crashes.\r\n-Every injury imaginable leaves you having to listen to the loudest most insufferable breathing effects that just make you willing walk into enemy fire to force a respawn.  (SERIOUSLY DEVS.....dial that wayyyyy back)\r\n-Enemy AI will just randomly spawn on top of you.\r\n-Sometimes unarmored AI will just tank rounds upon rounds as if you were shooting a max geared player.\r\n\r\nIf you can tolerate all of that mess, then sure give it a try....  As of now, there are way better options out there IMO.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game desperately needs a 10h-long demo or something. The 2 hour Steam Refund limit is a joke and there's no way to tell if this is a game you'll continue playing within 2 hours of mindless running around, shooting braindead AI's, and looting. \n\nFor the short time I have on GZW I wasn't able to do anything aside from leave base in helo, land in nearest LZ, walk another 5 minutes to a town just to shoot scavs who couldn't hit me or see me when I stood in front of them. That's it. I had no way of getting around since all the LZ's are locked? Outside of the 2 LZ's you already have which aren't even that far from base... Before even leaving the base I accepted all tasks, looked at my map and the tasks I had accepted were locked or bugged? Then there were other unrelated tasks that were all located at ends of the map that would've most likely required me to spend my refund time on simply reaching those areas.\nI'll also add that I was playing on a pvp server and there seemed to be little to no players considering I never saw anyone else and never heard anyone else shooting.\n\nI simply can't support \"Early Access\" games anymore. Like when is this going to be a finished/functional product? In 10 years after I've given the company my 50$+ donation and fully lost interest in gaming? No thank you.\n\nLast thing, I ran this on a rtx 5070, 7 7700x, 32gbram, 1tbssd, and I still had to lower some settings to have stable frames. It's not optimized, the environment will give you an eye sore, the only thing I can say I liked was the exterior design of towns and compounds.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't usually write reviews; this is my first one.\n\nPvE is great in this game; I've achieved 100% quest completion.\n\nAfter that, I wanted to try PvP, but it's really annoying with all the hackers. That's why I took a break from the game for a few months. With the new 0.3.5 update, I was hoping there would be no more hackers.\n\nUnfortunately, I've played a few games now and the hackers are still there. \n\nFor me, this is a real game-breaker and I'll have to take another break for now.\n\nPlease, Devs, fix the hacker problem.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gray Zone Warfare has surprised me with how far it has come, especially now that it is running on Unreal Engine 5.5. The graphics are honestly gorgeous, every surface and shadow feels alive, and when you crank it up with RTX the whole world just pulls you in. The weapon handling might be the best part though, it feels heavy and sharp in all the right ways, the sort of gunplay that makes every single shot feel deliberate. Performance has improved massively since the early builds as well. Weather rolling through the map and proper night time darkness add a level of realism that you notice instantly, especially with the improved lighting.\n\nThe sound work helps it all hit harder. Bullets snap past you, footsteps carry properly through the environment, and the whole audio mix finally feels mature. It is genuinely immersive.\n\nThen you have the AI, and this is where the magic starts to fall apart. They still behave like hyper aggressive Rust scientists on steroids. They can snap lock your head from what feels like two hundred metres with an iron sight AK, tank rounds they have no right surviving, and spot you through bushes as if foliage does not exist. Weather does not matter, time of day does not matter, they just know where you are. It feels cheap, and after more than 120 hours it still kills the vibe every time.\n\nThe game has the bones of something incredible and visually it is already there, but the AI needs a complete rethink before it reaches its full potential.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible crashes!!! You spend a fortune on tactical gear just to lose it all after a crash!!!!! Cant relocate the server without being stuck in a crash loop! Takes the complete experience of lvling up just to losing all your gear with multiple crashes !!!!!! Terrible Terrible Terrible truly unplayable !!!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yeah, nah. More than a year of a peg-legged mil-sim with plastic guns and awful shooting sounds that doesn't get any attention. Dear Lord, guys, get your shi together, it's boring and not getting any better. Proper gunplay and movement can make it much better. GUNS! MAKE IT ABOUT GUNS IN THE FIRST PLACE! Do I have to say the word? Don't make me, it won't make me happier, but it seems like I have to....Tark.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have played all the missions and loved playing pvp. But my goodness, cheaters had ruined this game for me. My group and I got footage of these cheaters and reported them to madfinger but nothing ever gets done. Tons of kits lost to these cheaters and hackers even us messaging madfinger aint doing much. They say that they are working on it in each update but barely an impact.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great gunplay, customization, and player character feel, and PvP. The game is really held back by the over-tuned Bots. They can laser your head with no scope AK's, at midnight, from over 50 meters through bushes and concealment.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I just wanted to fly the helicopter, come to find out it was on metaphorical rails and almost everytime I inserted on it I was almost immediately gunned down in the field trying to make it to my first objective. Your average scrubs wont do to well in this kinda game. I returned the game and got my money back though so no harm no foul i guess.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wish I could get my $40 back. I just uninstalled it for the second time. Will not be reinstalling the game is terrible.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "ATM not playable, game crashes alot. FPS is not stable and the game micro-pauses randomly. I realy hope they will develop it, yes iknow its a pre-alpha.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Loved the game at first......reset progression. Was having a lot of fun with getting close to mission completion......RESET PROGRESSION. Got good gear and everything setup the way you like it???.......RESET PROGRESSION. Optimization is complete trash......RESET PROGRESSION, Absolute GARBAGE......RESET PROGRESSION. Early Access for WAY TO LONG.....RESET PROGRESSION, good luck and this is why your player base has went to nothing",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I would not recommend this game.  The developers have made it incredibly difficult to advance, particularly if you are playing solo.  Despite every effort to utilize stealth military tactics to  locate and eliminate the NPC enemies, the NPC's seemingly know where you are well in advance of your approach.  If, in the rare instance, you catch an NPC enemy off guard, you can unload a full magazine into them (20 rounds) and they seemingly are unaffected and take cover only to retaliate against you with a one-shot kill.  I hope the developers modify this incredibly frustrating component to the video game. JC/HK",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Smart thing that I was killed and right afterward a bunch of people respawned and I wasn't able to get back to my corpse in time so I lost all of my gear because my corpse was \"too old.\" Great gameplay mechanic  there, devs. I get that losing your gear is part of it, but I was literally looking at my fully geared up corpse, unable to recover anything.  I'd refund if I could, but nope, over the 2 hr threshold.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Broken bots, bad performance. Still too early to play, wait for full release.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tbh it's hard to decide on thumbs/up thumbs down for the review because this game is really good from what i've seen and played of it, but server instability ruins it completely\r\n\r\n3hrs played and hoping steam will refund me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game runs great until it doesn't. It'll run about one to two and half hours flawlessly then just randomly crash to the desktop after a it causes GPU Crash Dump. I've sent the crash report every time so hopefully they will get squared away. This is the only unreal game engine based game of the several I have installed that has this issue. Once they get that sorted I can change the review to positive.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Killed 40 enemies with about 3 different weapons on my first mission by myself. Guess it wasn't enough because I still didnt find the key I needed. Ended up quitting the game. Tired of wiping out an entire city over and over.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll give it to 'em, it DOES look and feel better now. However, the game is consistently freezing, and had a pretty harsh crash not even 5 minutes into playing that forced me to restart my PC. If you have better than a 12th gen intel core, and NVIDIA RTX 3060, and 16GB ram, you may be able to have a genuinely good time on this game. I sadly still have to wait for them to fix crashes as I lost a good 50% of my starting loot and the several weapons I had picked up thanks to the fatal crash the game had. Reinstalled with the hopes that it would be a better experience, and at first it was, but I should have known it was gonna pull that the moment it froze the first time before deploying to the raid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "on the games release it was a really cool concept but overall the game just feel off not enough player pvp and not many guns to use low fps im sure things are better now but still ABI is free and a lot better then GZW i payed for a good case too on this game and wont ever be playing it again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sadly very poor. Had huge potential, but just isn't very well optimised or refined as a game. \nAI ememies are ridiculously accurate",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Performance are very bad considering the visuals of this game, and the gameplay is super jank. Not worth 50$ CAD.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is currently in EA state so as such I cannot recommend this game to anyone.  Here are my reasons:\n\n1. Unfriendly to new comers- If I'm not mistaken, vendors will offer you better stuff as you level up.  But in order to level up, you have to fight enemies and complete tasks.  Problem is you start with lousy gears and venders also sell you lousy stuff.\n\n2. Hunger and thirst meters- The only vendor who sell medical stuff doesn't even sell quality food or water.  All she has to offer are soda and energy bars.  These won't last long and only take up spaces in your bag, which is lousy game design.  How do you survive in danger zone with these?!\n\n3. Enemies- They seriously need some adjustments with their aim.  You start with crappy scope so you cannot even scout your surroundings.  No vendor offer binocular nor scope.  It is very difficult to see the enemies and their location.  When enemies start shooting at you, you are already too close to them and they will overwhelm you and kill you.\n\nI like the concept of deploying into danger zone and returning to HQ by taking chopper.  Graphic is also great!  There are some framerate problem but the game in EA so it's tolerable.\n\nI'm probably not the only one with these complaints.  I really, really hope the developers, MADFINGER Games, take note of these and fix them as soon as possible.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This games concept is great. The main issue is the frame rate. It becomes such a issue that the game is unplayable depending on what graphics card you have. I have a RTX 4060 and have no problem running large games like COD and Battlefield on max graphics and frame rate. Even on the lowest settings this game is not playable. Note: I've had this game since it dropped and have waited for many updates and hotfixes for this to be resolved. Please consider before buying!!!!!!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is the probably the worst extraction shooter ever made just go watch a wall",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Came back to play after upgrading rig. Worse than i remember, complete hot dog water.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Flat out confusing, tasks are go here, get shot there, die there, don't recover anything ever, never complete anything and get frustrated. Bodies not on map. Vendors impossible to find. Random missions from no one. They need to make an easy way to start over because I'm stuck with no weapons or money or access to any vendors. No tutorial they just stick in and hope for the best. Hate this kind of game. Oh and if you die twice you lose all your shit. Lots of fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game will die if they don't drastically improve the performance. I can't give a good rating on something that performs this bad. Good idea, Horrible execution.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn’t work on older hardware bc of the tpm2.0 so although I wanted to try this game I went back to tarkov which still runs on my old pc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Provato per 45 minuti.\r\nSia pve dove sono arrivato a 2 case e non c'era loot proprio zero e tornato alla base letteralmente ero fuori mezzo metro dal cancello mi diceva che comunque avrei perso gli oggetti, letteralmente avevo gia passato il cartello area militare alleata (boh).\r\nProvato il pvp, e niente trovato 2 player, voluto fare rotation facendogli credere di scavalcare una finestra spaccando il vetro con il coltello e nulla il mio ben addestrato soldato probabilmente era fatto di qualche sostanza perchè deve essere entrato nell'armeria dei giochi dei bambini.\r\nUn coltello militare che non spacca un vetro.\r\nLe basi.\r\nPerso il fight uscito e disinstallato.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So listen... I have had a great time on this game both solo and with friends. he game overall is a fun time, challenging, but fun. Albeit, it's not a full released title yet, so I can only comment on content that I've got access to for now, but the latest update to Unreal 5.5 has created a broken state of play for me. Each time I boot the game, I load and compile shaders. Each time I deploy, load and compile shaders. Each time I back out to the main menu, load and compile shaders. My hardware can certainly bare a heavy load, but I am sitting in a wait screen listening to glitched audio longer than I'm playing the game. \nThe game is a good time for sure, but in it's current state... unless you have a thing for Compiling Shader Simulators, steer clear for a bit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolutly bad for new players. Keeps dropping me into night time. Pitch black. Cant see anything or do anything because the screen is literally black at night time and it doesn't give you night vision to start with. Great introduction guys... I'm sure its good once you put the hours in but starting out it bad!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really want to play this game, I love mil sims and just this genre and watching videos and such it looks like so much fun. But I have owned this game since its launch and for some reason I can NOT get it stable to play. I have a 3090 and for some reason. Even on low settings am not able to get above 40-50 fps. Is there something I am doing wrong? Please someone help because this is getting ridiculous.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When you loose your money and your guns you can not play the game with out these Items so you need to create a new character but the game will not let you wipe your old character so you are stuck with a character and insufficient supplies to play the game. also there are not different levels of play so if your old and slow or a beginner there is a dead end waiting for you with no instructions on how to start a new game it the game will not let you create a new character hence forth DEAD END.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game had a great start but has fallen off due to the lack of content and updates when other games are coming out and also new games are giving 4 updates within a single month. This game gives updates once every 6 months which i know im not waiting half a year or longer to play something new with this game. Ive lost interest like the thousands of others. Could have had something good here but the devs have ruined it by barely giving us any content. RIP GZW I wouldnt waste my money on this game if you havent bought it already.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gray Zone Warfare looks pretty, lush jungles, moody lighting, and guns so customisable they’d make a Royal Armourer blush. But once the novelty wears off, you’re left with a gameplay loop that’s about as thrilling as watching paint dry.\nThe missions? Bland as a a slice of bread on toast. You’ll spend most of your time revisiting the same locations schlepping through uninspired fetch quests than engaging in anything remotely fun. \n\nThe stash space is tighter than a miser’s wallet, forcing you to play Tetris with your gear like it’s some sort of punishment.\n\nSure, it’s pretty, sure, the guns are fun to fiddle with, but when the core experience feels like a never-ending trudge through mediocrity, it’s hard to stay invested.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The devs clearly don't know what \"Entrance to a town\" means. Playing this game is a chore. You spend 20 minuets to get to the objective area then spend a half hour looking for a building that does'nt exist just to be shot by respawning enemies. If you value the little time you have in you're life you're better off playing anything else because these devs have no clue what fun is. It's slow and boring",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fix you're fucking game before releasing it no wonder it's almost dead shitty developers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally cant even join a single game...\n\nQuite literally unplayable...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Jogo nao e divertido. Graficos sao bonitos, mas cenario e morto, sem vida, sem npcs, sem eventos dinamicos. Adoro jogos milsim, mas este esta ainda muito cru, muito sem recursos.Fiquei decepcionado quando vi que tem tantas paredes invisiveis, pois antes de comprar queria muito subir nas montanhas para usar o rifle sniper, e simplesmente quando voce tenta se aproximar fica bloqueado. Falta neste jogo um carisma, pois ele esta tao serio que fica tedioso atirar em inimigos que parecem ser feitos de papelao. Espero que no futuro ele fique mais divertido e contagiante, com missoes mais interessantes e interaçao com o mundo. Ele e imersivo, mas pela falta de atrativos, fica tedioso depois de cinco minutos de jogo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ignore minimum recommended spec requirements. absolutely need a high end pc to play. even after recent update \"reducing cpu usage\", i'm still hitting 90C and 100% usage in JUST the main menu. still crashing in the heli. still crashing randomly. it's been over a year. i don't even want to play anymore, i just want my money back.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game still runs like shit, new update changed almost nothing, playing on a PC with a 9800x3d and a 5070 ti and i only get 45 fps at 4k max settings, that's literally awful compared to almost any other game out there... even arc raiders runs at 80fps and looks WAY BETTER..... don't waste your money, the performance is so bad its literally unplayable, you WILL get killed because of it, unless you have a 5090 and wanna play at 1440p of course.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bought game on release, unplayable for the first 4hrs being afk in queue for servers, couldnt refund, when i do eventually get ingame i get AI walking through walls and doming me. wtf",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unoptimized and buggy. I can run Tarkov and can't run this game? Yeah Ill pass",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "anti-cheat software fails to verify half the time when loading in. who the heck is using cheats on this low level creation. waste of money",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game was just a horrible experience form start to finish. Completely optimisation is needed for it to be even remotely recommendable. zero stars.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game's worse than literal arma 2 mods, bullets don't kill anyone",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Most Trash Game I ever played so many issues with it. Even though my pc specs are best you can get at the moment. out there. I had restart the game like 10 times each. They need fixed thier game. I also got full refund cause the developers. It had so many reports about having issues with thier game. I wouldn't recommend playing it. \n\nLeast go Buy Squad way better game. without any issues.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I give a negative rating because you're struggling to complete a mission and another player kills you and you lose everything. The game is very nice but it would be better if you didn't lose anything when you were killed, not all are good. That's my suggestion, I don't disagree with it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Obvious false advertising. The recoil simulation does not match the video.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Bullsh** a$$ mechanic that if you die 2 times all your stuff is gone.  Tried to get back to my body and 5 enemies respawned in front of me killing me instantly.  Lost all of my good stuff too.  Also hate the fact that AI can snipe you from 300 meters away from hip fire but take 20 rounds to kill.\n\nGame is also buggy as hell, I keep randomly getting random fails or network fails.  Don't have this issue with any other game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ADD OFFICIAL CONTROLLER SUPPORT PLZ! FOR GOD SAKE WE ARE IN 2025-2026... UNTIL THEN IF YOUR A CONTROLLER PLAYER DONT WASTE YOUR TIME",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "full of cheaters game runs like a bag of wank",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Played a few hours of this about a year ago, was extremely unimpressed. now a year later... still unimpressed. Needs a lot of work and wish I did not buy this game, going against other players is not that bad, its the AI that really messes up this game, as well as the movement in my opinion, there is a really solid base for what could be a good game, but it just lacks a dedicated dev team (that listens to the players). unfortunately I dont see myself or my freinds returning to this game again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has great potential and I enjoyed it a lot. Large map, lot of different places with different difficulty. Guns got bit more realistic at last patch. \n\nBut then the reason for negative review. Latest patch AI performance supposed to get more realistic but it didn't. AI is still shooting through bushes with laser precision in darkness without light or NODs. AI without armor takes couple of shots center mass, crouches a while and then straightens and shoots you in the face. This game needs major AI patch still, this was not step in wrong direction in my opinion. \n\nFirst of all AI awareness needs rework. All AI in area seem to instantly know exactly where you are after one of them knows where you are. I would like to see that AI maybe know general direction where you are and then act either shooting at that general direction (suppression fire for high tier soldiers) or get to cover (low tier mobs). AI should also try to find cover more often so it would give some resemblance of realistic behavior. Now they stand in the open shooting accurately at your position. It would be nice if sometimes AI would attack your direction in force.\n\nI hope they will make it better soon because this is most realistic and for me the best looter shooter at the moment.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is boring and sucks. Which is sad to see because I had high hopes and this could have been something special but it just didn't work out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game runs like ass after a year and a half. borderless doesn't support 4k forces me down to 1440p. im disappointed i really wanted to play this again last time i played it, it had potential but after such a long break and not seeing much improvement is sad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "performance is better, AI is still terrible",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Games not even worth $10 if itd costed that much. Fuck you devs do better",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Unoptimized tarkov clone that runs like shit and has even worse bugs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game performs horrible",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game is a fucking scam, dont buy this shit",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "runs like shit not a good game no content",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too many hackers. What's the point in going out and gaining a bunch of loot, then getting killed by some clown who can see you regardless of darkness, foliage, distance, and can hone right in on you even when you havent fired a shot, havent moved, and havent made a noise. Have sent many messages complaining about these cheaters and nothing has been done yet.  Not worth playing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is still not optimized",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not ready yet, very basic",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "poopoo game play cs instead",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just not good at all",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "HOW DO YOU EVEN DEPLOY LOL",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "only good with friends. period.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you will losing all your gear after you dead",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Need work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nope.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is like a fever dream. I cant believe I payed 40 dollars to be bored out of my mind. -10 monkeys out of 10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was enjoying my time playing, met friendly people then I got back to a COP which is meant to be a safe zone or so I thought and a TEAM MATE killed me and looted all my stuff and threw it into their safe locker so I couldn't get it back... what kind of stupid game design is this? Getting killed by my own friendly faction as soon as I get back to a COP and get my stuff looted by them in the COP? This is the dumbest thing I've ever seen in this sort of game and highly frustrating, your own team will just spawn kill you and camp you in your team's zones (literally died to teammate like 10 times in the span of a few mins respawning trying to get rest of loot back from original body)! This is not a welcoming feature to entice new players to stick around when you get spawn camped by your own team while trying to learn the game, what a load of crap - wish I could refund it.",
      "voted_up": false,
      "votes_helpful": 156
    },
    {
      "review": "This game is fun and has a ton of potential, but the AI is one of the worst things I have ever experienced in all my life. It's insane. They have wall back and autolock and they're just waiting to blast you. They spawn on top of you and instantly start blasting you with their autolock features. You can try to be stealthy and they'll just randomly lock onto you and start yelling through walls and bushes and just shoot and kill you. It happens about 70% of the time you play. I could go on and on... The silencers! Why have them??! You fire one time and the whole compound looks directly at you.  They just stand there locked onto you waiting to use their wall backs and aimbots. It's insane and I promise you it's that bad...",
      "voted_up": false,
      "votes_helpful": 104
    },
    {
      "review": "The game is nice. But the \"cant loot old body\" makes no sense at all, i should be abble to loot what i want and when ever i want. Game prevents yo ufrom looting your original body after dying multiple times because of broken ai insta kill shots",
      "voted_up": false,
      "votes_helpful": 109
    },
    {
      "review": "Pitch black darkness that requires NVGs or flashlight to see anything, yet NPCs can beam you in the head from 300m away with no flashlight or NVGs. I understand that this game is still in development, but this is pretty basic stuff. When this issue gets fixed, I will change my review.",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "I really wish I didn’t have to say this. Because I like this game. The map, the concept ... BUT ...\n\nTASKS AND PROGRESSION:\nSame mundane, boring task system as almost every other failed extraction shooter. “Take this box of food and medicine and drop it by a house next to the road” — meanwhile you’re getting shot at by AI from that same house. Everything wrong with Tarkov’s task system, multiplied by 100. There’s zero creativity, even in naming the tasks. Task name: “Negotiator.” Task description: “Find the negotiator.” Honestly, it feels like the tasks are AI-generated. Coming from Tarkov and looking for something new and refreshing, the progression and task design pushed me straight back to Customs, hunting for that pocket bronze watch.\n\nMOVEMENT:\nMovement is awful. You get stuck on the smallest objects. Vaulting barely works. A short sprint and two jumps, and your character sounds like he’s about to have a stroke.\n\nAI:\nThe AI is awful — in every possible way. I’ve had enemies walk right past me without noticing, and the next second I’m being shot through walls. The moment I hear “RELOADING,” I peek — and instantly get lasered in the face. And why are the native Lamang fighters giving each other callouts in English??? “He’s running!” “He’s going left!” Honestly, what the fuck.\n\nIMMERSION:\nNONE. And I mean NONE. The only time I actually feel immersed is when I’m walking around trying to find new LZs — that’s it. PVP is barely engaging. It mostly happens in LZs or outposts. LZs are just camping, and outposts are glorified camping. The NPC voice lines? Maybe four sets of conversations, fifteen lines max. Every time I start to feel like I’m part of the world, I hear the same recycled dialogue, get shot from the same house I’m delivering food to, or hear indigenous fighters yelling callouts to each other in ... ENGLISH.\n\nThis game has so much potential. Honestly, out of all the extraction shooters I’ve played — besides Tarkov — this one could’ve been something special. But here I am, pissed and unimpressed. \n\nI wish in couple of months I can come back here and Change this Review.",
      "voted_up": false,
      "votes_helpful": 117
    },
    {
      "review": "Setting? Good. Innovation in the looter-shooter-extraction genre? Yep. Execution? Maybe in Beta or release. I don't recommend this very highly in it's current state as of the posting of this review. I played very early Alpha and stopping by after playing EfT feels bad. I'm sure it'll become great, but paying $40CAD for a marginally playable extraction shooter is not it. Check back in a year, it'll probably be good. \r\n\r\nKeep going Devs, you're on to something. Just needs some more time.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "The Devs said they fixed the AI in this last patch but I'm still getting lasered through bushes at 100+ yards  consistently by dudes with iron sight AKs. Also I don't really understand the mechanic of the military AI going for mostly head shots. If you want realism especially when it comes to military AI, make them actually behave like military personnel i.e. aim center mass. This mechanic coupled with the Aimbot they have is fucking annoying. Also, somehow dudes are still able to tank 5 plus shots while wearing nothing but a tank top, shorts, and flip flops. Not only do they still tank shots, but now the recoil is even worse making it 10x harder to get on target along with actually killing the damn guy. I really like this game but you guys just keep dropping the ball. Definitely not wasting anymore storage space on this game for awhile.",
      "voted_up": false,
      "votes_helpful": 181
    },
    {
      "review": "PVE solo isn’t worth it. Progression on PVE servers is often impossible because everything is cleared or looted. They only let streamers and “influencers” run private servers. You reach quest areas and find all enemies dead, quest items and bosses gone, and loot caches empty because other players got there first. This is especially bad at the start, it took me 3 days to finish the starter quests because I couldn't find any keys. I've dealt with this issue until the end game.\n\nYou can spend nearly an hour clearing tough locations, only for random players to swoop in and steal the loot cache or boss kills at the last minute. At Midnight Sapphire Hotel, one of the hardest areas, my boss kill for a quest was stolen twice after I cleared almost all enemies. I uninstalled the game because of this. \n\nAll of the quests are impossible to do without a wiki/youtube guide. I can summarize the quest design as \"find needle in a haystack\". \n\nYou can write a book about how bad the AI is. It got wallhack. In heavily fortified areas, pushing solo is very difficult. And a stealth approach doesn't work.\n\nNo to mention the unfriendly community, rubber banding, network stutter, and the slow updates... Graphics are the only thing that is done well.\n\nSince this pre-alpha game gets 2 updates per year, you might wanna wait until 2030 before it's ready.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "On the start i must say this game can be fun, the most enjoyable part of the game is when u are on the middle of a quest and u will find yourself on a fight with other players and bots, what is also cool in this game is the teams, so its not like u are alone and u must fight with everyone, u can cooperate with randoms from your faction, and we have here 3 factions so sometimes u can fight with 2 other teams from other factions and u dont even know it, and when anyone from your faction will be on a pvp fight u will see a red circle on a map, and a lot of ppl just going there to fight with the enemy, we have also a outposts on the map so we can take them and spawn there when we die, so u dont need to run from your base or call another heli to the LZ - landing zone to get closer\nand i think its the good parts of this game the rest is... complicated xD \n\nlike LZs its cool idea, u just call a heli and fly to diffrent parts of the map, the problem is everyone have same LZ spots so u can camp on them or your heli will just land in the same time when enemy heli, when u fly in a heli you can shoot and die but when u land u have 10s spawn protection but when u jump in u dont have that protection, and to unlock LZ u need to find them on a map by walking to them or jump to random heli called from a guy from your team xD and u can just open pve mod and find all LZs and then just change to pvpve and go to enemy base and camp for the new players bec each faction have a starting city when u have first quests \n\nand this quests... its one of the laziest designe i ever saw, most of them is go from point A to point B, kill 10 enemies, kill 30 enemies oh but u must kill them on specific places, quest will tell u \"kill 10 enemies on the west of nam thaven\" so u go to the west kill some bots and your quest is still 0/10, bec after first quest the game will not tell u where your objective exactly is, u have to guess or check on the wiki xD or it will tell u like \"go to the south part of the city, there will be a grey building behinde a garage and there is the body u need to find\" and city is big, and the building is not grey more like blue but ye he will be there, anyway, these tasks are not that bad the worst is how they desinge them, bec u get some quest after u complete some quest, thats logic yes but why 1st quest tell me go to the village and find book or whatever so u go u find what u need, now u need to come back to your base or to the outpost and go the tasks and click hand over and yay quest complited, and when u die u will need to go again to the same spot to find same book on the same spot, but u did it u won and now u get 2nd quest from the same guy - go the same village and kill the leader of rebel group, oh he will be in the same building where u need to find this book btw, yes same building where u was 5 mins ago and u kill everyone already... happy waiting time for respawn xD and now imagine u play with freinds and even if u are in the same squad all of u need to do tasks separately so all of u must kill this guy now, and other ppl from your faction maybe need kill him too and other ppl from other factions also need to kill him so u can find yourself on a middle of a pvp fight or spend 2h to finnaly be lucky and kill this guy, and i already did like 4 quests like that, its like u doing same stuff all the time but in different places\n\nNPCs are strange, they are stupiud and sometimes u can just walk slowly and stab them and sometimes they will do 360 and kill u with headshot xD u have diffrent types of bullets like some have better pen others can do more dmg to unprotected body but AI use the worst ammo in the game and they dont care what armor u use, but when u will use this ammo oh boy sometimes u will spend full mag on a one guy, but sometimes u can use ammo with best penetration and sometimes u will kill a guy with few shots or even one but sometimes he will reject to die, and of course AI have auto aim and auto lock when they will hear u they will insta lock on you and sometimes they will shoot nvm if they see u or not xD so yes they will shot on a wall bec why not, and silencers dosent matter at all AI will lock on u anyway like u never use one, and yes i know in real life silencers dont rly change that mutch but its a game so was be cool if we can do a silent mission not all the time go full loud, and when u die u will respawn and u can loot your body but if u dont manage to take your stuff from the 1st body it will be locked for u, so bye bye stuff BUT players from your factions can just drop this stuff for u, so why u cant just loot it? and if someone from your faction will loot you he will be marked as traitor or something but if he open and drop stuff he don't get anything, so u can just ask people if they will help u get your stuff back and mostly they will, i never meet anyone who reject \n\nweapons, we dont have that mutch choice and when u get traders on higher lvls they can give u same weapon but with better attachments, and like in 1st version some traders like artisan was able to sell us PBS-1 and PBS-4 they are silnecers for AK type guns with 7.62 caliber but the devs for some reason remove this silencers so u cant buy them anymore but they didnt change rewards for a quests so u can get a gun with this silencer, so now when u lose this weapon u will be able to buy same weapon but u cant buy silencer and for a pvp fights silencer isnt that bad how it is vs AI \n\nperformance is still bad, u can just run thru the field check the left and get drop to 40 fps, u can be on a village and have stable fps and then aim and get a drop, and this drops can kill u, i guess we should have a NASA pc for this game so we will get less drops xD \n\nand finally, u have good conection? u play on other games without ping drops or other issues? well not here, u can just play on this game maybe even have fun and u just go sleep try open this game tomorow and boom “RTC Connection Failed” oh u pay 40 euro and what u expected? like the devs know how to make a good servers? well just remember when u played on this game without issues and now u get this issue, it obviously your fault so YOU MUST REPAIR IT xD i dont know what i did wrong maybe close the game wrong xD i dont know, but if i can open any other game and play on and here i get this BS for some reason this is my fault? so why my other games working, like what is the difference betwen connetc to your server or to connetc to darktide servers? like what other devs are competent? I dont know what IPv6 mean but thats the point I dont need too, and I definitely shouldn't turn it off to play this game bec I can play other games without change my connection settings, if i can play other games with IPv 6 on and for that game i need to find it in my settings and turn it off that's mean is something wrong from the devs site, I just should buy the game, instal it and play it, for what i pay 40 euro?",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Sadly this game is really good, but it's really badly optimized. I have a Ryzen 9 5950x and a RX 6750XT 12 GB and I can barely run the game at low settings.\r\n\r\nThis is a game for the rich ones who can afford the High End PC. All the other players can't afford to play this game with minimum performance.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I'm putting this as a thumbs down, not because it's a bad game, so far it's actually pretty decent...\r\n\r\nBut just simply because a game should not go for this long in an \"early access\" status, and I want to disincentivize game developers from doing this.\r\n\r\nThe game isn't complete yet, but they're already selling DLC's as if it is. I'm sorry... what?\r\n\r\nYou're producing DLC's, for a game, that you haven't even finished and launched? Why not just package those DLC's into the game? (We all know why.)\r\n\r\nI'm tired of cash grabs. On ethical grounds it has to be a thumbs down.\r\n\r\nOnce the game actually launches I'll give a more serious and though out review.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "My friend of 10+ years who bought me the game was falsely banned after replacing his SSD. Neither of us cheat and we only play casual low stakes PvE mode anyway. There's literally no reason to cheat. Besides, we both detest cheaters and cheating is part of the reason we play PvE mode in the first place. MFG need to sort out their anti-cheat because false bans seem to be a common issue after googling around a bit. \n\nIf his appeal is granted I'll change this review, but I can't recommend a game that will so easily ban paying customers for nothing.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "After a year of being in early access, the developers still cannot get hit registration and the AI to play well or not be bullet sponges. I had high hopes for this game and bought it at launch, but honestly, it does not seem like they will ever get it to play well.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The gun play and graphics are good but the ai is terrible. They are either dumb as a rock or you feel like youre playing with cheaters and there are too damn many of them. Forget the idea of clearing an area and looting cause once you kill 10 of them 20 more will come and shoot you in the face while looting. I wanted this game to work so bad but the ai ruins it for me completely i hope to see a fix soon. Also this is coming from a a guy with 2k hours and dayz and tarkov each so dont think im just whining cause the game is too hard. $40 is too much for what it is right now, Great game, alot of potential  but after 30 hours of dealing with hordes of aim  bot ai im uninstalling untill they do something about it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Let me preface by saying this game IS fun, but there's a couple things that make it not worth your money. \r\n\r\nNegatives:\r\n\r\n - The graphics are god awful. I would say everything looks really realistic and the lighting is fantastic, but there's some strange fuzzy-looking filter over everything that make it disgusting to look at, on top of that theyre really hardware intensive. For any of my tarkov players out there: the graphics look like the old painkiller effect. It hurts my fucking eyes. \r\n\r\n - The performance is terrible, and the game LIES about frame rate. I have a pretty good PC, it's not the best, but it's good enough to run any AAA game at AT LEAST 60 FPS with any other programs running in the background. This game runs awfully. It stutters at random times, not a lot mind you, but it does stutter. The frame rate is not very good and for some reason the game lies in the frame counter... While I was playing, I never had my frame rate (according to the counter) drop below 70 fps, most of the time it sat around 90-100 fps. This was a lie. I dont know why the counter is inaccurate, but I recorded footage from the game just to confirm that yes, a MAJORITY of the time I was playing, the game stayed at or below 60 fps, sometimes around 30-40 fps. I checked all my hardware, it's not the fault of my computer, recording software, or monitor, it is the game falsely advertising frames. Why would they do this? who knows. the visual difference between 100 and 50 frames is very apparent to the eyes. FIX YOUR FPS COUNTER.\r\n\r\n - The faction base mechanic. Why is it a thing? it serves absolutely no purpose. It could be entirely replaced by a stash/inventory/traders menu like in ANY OTHER EXTRACT SHOOTER. ALL of the things you interact with in the base to sort your stash, trade with traders, or accept quests, is all in your inventory UI anyway, there's no physical locations you need to go to to do these things, so what's the point? The only thing it does is show off the neat little helicopter ride to/from the home base, which, after your first time doing it, gets annoying. Most heli rides, I'm playing on my phone while I wait for it to drop me off. It's basically at LEAST a 2 minute unskippable cutscene EVERY TIME you infil or exfil. Much longer if youre going further on the map. It's tedious, it's pointless, and most annoyingly, it wastes my fuckin time. \r\n\r\n - The faction system needs a MAJOR rework. When you first start the game, it asks you to pick a faction to play as. The only information it gives you is a single paragraph of lore background for each organization, so the most you do is go \"oh cool this one sounds neat\" and pick a random one. What it DOESNT tell you, is that picking a faction will actually affect your gameplay. For one: each faction has similar, but different starting quests and starting locations. Each faction gets a little \"starter\" town near it's home base, to learn mechanics and do simple quests, and theyre all different. That's not a big issue though, the biggest problem, is that youre UNABLE to play with friends who happened to pick a different faction as you... That is the stupidest thing ever. You have two options: either reset your account and lose all your progress just so you can play with friends, or get fucked. At least in Tarkov, if I chose BEAR and my friend chooses USEC, we can still play together. Nope, not in Gray Zone. The faction system is stupid, and needs a rework, plain and simple.\r\n\r\nPositives: \r\n\r\n - The gunplay is VERY satisfying. The guns feel weighty and realistic. The animations are clean, and the models are very good looking. There is a very satisfying feeling to gunfights, and they often differ a lot depending on your environment: The sound of a snap overhead when youre trudging through a wide open rice field makes your cheeks clench. Laying prone to take more accurate fire, then watching the grass and flowers blow to the sides as gas escapes your muzzle is just, mwah, chef's kiss. Hearing enemies shouting from inside a little wood shack, saying to yourself, \"fuck that shit, I'm not going in there\" then proceeding to dump 3 mags of 7.62 through the walls, and listening to the bodies drop on the other side... Then throwing a grenade in a window too, just for good measure. Firefights with both players and the AI are fun... they did a good job with the gunplay, and the AI behavior. \r\n\r\n - The health mechanics are very well done. Not a lot to say here besides that it's realistic enough to be engaging, but not realistic enough to make the game miserable. Honestly a better healing system than tarkov in my opinion. On top of that the hitboxes are VERY precise, it's very impressive how well they did it. I like the feature where you can see the enemy's health UI when youre looting them, so you can see where you hit them, it's immersive and satisfying.  \r\n\r\n - it's only $40, most AAA games are making you pay $70 for their dogwater games. At least this is dogwater at a discount. Enough said there. \r\n\r\nOverall: \r\n\r\nIf they fixed some of the things that I mentioned in the beginning, I would highly recommend this game, but I highly doubt they will to be honest. The gameplay is fun enough to WANT to ignore the issues with the game, but theyre just really hard to ignore. I wouldnt recommend anyone buy it in it's current state. Play another extract shooter that's actually fun, like Hunt Showdown.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[b]I’m genuinely sorry…[/b] I really like the Southeast Asian theme, the atmosphere, and the overall concept. But since you ask for feedback to improve the game, I’ll give you some so the final product can be better. I won’t go too deep since I’m not a game tester or anything like that:\n\n[b]I only started with PvE, and in my short playtime there are three main things:[/b]\n\n[b]1) Performance:[/b]\nThis is a big problem. I have an i5, 16 GB of RAM, and an RX 6600. The game runs very poorly, and to get above 60 FPS (barely around 70) I have to lower everything, giving myself the small luxury of keeping global illumination on medium. Even then, the performance is painful. As a result, the game looks terrible—pixelated, noisy, and with visual artifacts I honestly don’t even know how to describe.\n\n[b]Advice:[/b] I don’t know what engine you’re using, but consider downgrading—use UE4 or something less demanding. I’ve read comments from people with high-end GPUs who still have issues. Look at ABI [b](just as an example, with respect):[/b] they use a UE4 version and it works great. Players don’t care what engine you use; we just want good FPS and a decent-looking game, whether it’s Source [b](Insurgency looks great)[/b], UE4, Unity, whatever. You still have time. I’m no tester, but if you’re still in active development, consider moving everything to another engine now. Otherwise this will end up like Arma 3—playable only 10 years after release.\n\n[b]2) Helicopters shouldn’t exist as they are now.[/b]\nWaiting for one to spawn or be available is hell.\n\n[b]Advice:[/b] Add some kind of teleport system with a cinematic that simulates a helicopter drop-off to the chosen area. Anything would be better than the current waiting.\n\n3) Why do you give me missions if, when I get to the location (and I’m talking about PvE), the items I’m supposed to retrieve [b]are already looted by other players[/b]?\n\n[b]Advice:[/b] Add a PvE mode with bots only, like [b]Incursion: Red River (again, just as an example).[/b]\n\nThanks. [b]I hope the project goes well.[/b] I’ll keep following the development. [b]Cheers.[/b]",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "i hope they fix graphics for this game this game is really bad at i5-9400f 1060ti i recommend not playing this on low end pcs",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "extremely choppy and constant stuttering",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "-Game suffers fairly regular crashes.\r\n-Every injury imaginable leaves you having to listen to the loudest most insufferable breathing effects that just make you willing walk into enemy fire to force a respawn.  (SERIOUSLY DEVS.....dial that wayyyyy back)\r\n-Enemy AI will just randomly spawn on top of you.\r\n-Sometimes unarmored AI will just tank rounds upon rounds as if you were shooting a max geared player.\r\n\r\nIf you can tolerate all of that mess, then sure give it a try....  As of now, there are way better options out there IMO.",
      "voted_up": false,
      "votes_helpful": 6
    }
  ]
}