{
  "positive": [
    {
      "review": "Craft the World is a game that I have played on and off over the years. It's a very fun game but I never can play it for extended amounts of time because it can become very frustrating. I will later get into more detail why that is the case, for now let me tell you about what this game is about.\nIn Craft the World you take control of a tribe of dwarves that use portals to colonize new worlds. You play in such a world and build a thriving dwarven colony. The world is made out of blocks which you can tell your dwarves to dig out for you. Blocks take longer to dig depending on the material it is made of, with dirt and sand being super fast while stone and ore takes longer. Removed blocks are carried by your dwarvces to their stockpile where you can use them to craft various tools and structures. You also can hunt down animals and chop trees for food and extra materials. Dwarves can carry equipment, so you want to start out by crafting pickaxes and axes to speed up the gathering process. You also need weapons, starting with a simple wooden club, to defend yourself against dangerous enemies that can spawn at night or in the underground.\nDwarves can have various skills, each one starts with one random skill but can learn up to three. These skills level over time and speed up tasks like cutting trees, mining or crafting items. Combat skills on the other hand increase damage. In order to learn these skills you need to give your dwarve a skill book that randomly drops from blocks you mine. These skill books also increase the experience of a skill if the dwarve knows it already. \n\nYOur dwarves have of course personal needs. They need food and a bed to sleep. You need to build a shelter by placing a totem inside an enclosed space. The totem will create an area that stops enemies from spawning and allows dwarves to heal by sleeping inside a bed. The totem also shows the quality of the shelter which speeds up the sleeping process of dwarves. Higher quality can be achieved by having more decorations or better building materials for your shelter.\n\nBesides directing your dwarves by giving orders you also can cast various spells that you unlock as you progress through the game. These spells can be something simple like placing an artificial light to something more offensive like launching a fireball. Spells cost mana however that you regenerate over time and the costs for spells increase the further away you are from your shelter. \n\nEverything you do will earn you experience and every time you level up your mana limit increases and you get a new dwarve. More dwarves means more productivity but also another citizen to please. A large colony will also attract attention. After enough time has passed, a monster portal will open at night which spawns many enemies that attack your shelter. These attacks can be difficult but also lucrative since monsters drop valuable loot like materials and more importantly, coins. Coins can be used at a shop to buy materials, tools, whatever you need. It's great way to further improve your colony.\nThis game has a very huge technology tree. To unlock new technologies you simply have to craft structures, refined materials and tools from the technology before it. It's a simple concept that allows you to progress naturally.\n\nYou can play as long as you want but each world also ha s awin condition that you can achieve if you desire. The game has a hidden portal somewhere in the underground, you have to find it, beat kill the guardian and then find the recipes of the portal parts that are hidden through the world. Once you assemble the portal you can use it to leave the world, unlocking the next world type. Doing this the first time will also permanetely unlock a trophy decoration for syour settlement.\nThe different world types offer various new challenges for players to overcome. The first world is easy to get into with weaker enemies and fewer monster spawns. The ice world has snow and ice instead of water, so you need to melt the ice to generate your own water. The desert has sand storms that can deal damage and destroy blocks and also has pyramids that have dungeons to explore.\nThe game has a lot of content to offer, more so if you have some of the DLCs which add new items and new worlds to explore.\n\nBut let's talk about some of the frustrating parts. This game has an infamously bad AI. This has been improved over the years and honestly, it is much better as it used to be, but it still makes many mistakes. Dwarves don't always pick the fastest route to travel or the best dwarve for the job but this isn't as bad as the combat AI. Dwarves will run into fights and almost die, run out of the fight and then run back into it. This can lead to frustrating moments in which a dwarve dies because he couldn't value his own life. On the other hand you have dwarves with full live and a high cvombat skill that run away because they are frightened. It makes no sense why some are suicidal while others don't attempt to fight. But one of the worst things in the game is when you order an attack on an enemy. Suddenly ALL dwraves drop all their items and run to the enemy like some rabid dogs no matter hwere they are on the map. The dwarves that are the furthest away won't even reach the target before it dies and then they slowly waddle back to pick up the items they dropped. It's so annoying that dwraves drop all their pockets before heading into fights, just take it with you.\nSpeaking of items, the storage management is anightmare. Dwarves have only ONE dedicated storage during the majority of the game. This storage is at the spawn point of your dwarves (the portal) anmd since you cannot move it you have to build your settlement around it. If that storage is in a bad spot, tough luck, make it work! All the chests in the tech tree are just decorative, apparently dwarves like to look at boxes but they don't like to put things into them. You can buy a new storage from the merchant or wait until a very late game tech that allows you to build extra storages. The good thing about these at least is that they all share the same storage but until you unlock these you will have a wait a long time for dwarves to deliver goods to your storage.\n\nAnother annoying aspect is the grind. All blocks drop onlöy one material. Ore block? One ore. Coal? One coal. This means you have to mine an absurd amount of blocks if you want to produce in a meaningful quantity. Combined with the fact that you need to produce stuff to unlock more tech, you realize how much more materials you actually need. It's never enough! This kinda fits into the \"greedy dwarves\" stereotype but from agameplay perspective it just takes too long.\n\nThen there are sapwning rules. Objects and creatures spawn at random. The game makes sure that there is always a minimum amount of objects in the game world but this can be frustrating if you try to mine or build. Objects on top of a block will block your ability to mine it or build on it, so you have to remove it. Combined with the long walking times to and from the storage you have asituation in which you give an order, a dwarvbe walks to the storage to get the required object, then reaches his destination just for a tree to have spawned on top of it, blocking whatever you wanted to do.\n\nBut despite all of that, there is a reason I always come back to the game. The game devs are still active even after more than ten years. They still put out updates with new content, some free, some paid DLC. They add new quality of life imrpovements, recently they added a merchant that allows you to sell items for gold coins. They try really hard for a game that doesn't have the same reach as Dwarf Fortress or Terraria. And whenever I see a new update I jump back in the game and play for several weeks. The game is just fun, even if the dwarves are dorks that don't know how to survive on their own.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is fun, Relaxing, Problematic, and a kind of puzzle. Been playing for a long time and I keep coming back. Each game map is different. SUCH a wonderful game and with  all the DLC's, it makes it even more enjoyable! If you are looking for a good digger dwarf game built on a solid system, This is for you. Highly recommend!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Craft The World is a charming mix of sandbox building, strategy, and survival that feels like Terraria meets Dwarf Fortress, but more accessible. You manage a tribe of dwarves, gather resources, craft gear, and slowly build up a fortified base while defending against waves of monsters. The gameplay loop is addictive, progression is satisfying, and the quirky dwarf AI adds both humor and occasional frustration.\n\nIf you enjoy base-building with a touch of RPG and automation, Craft The World is a fun, cozy, and surprisingly deep experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good casual game. Simple to play, decent crafting tree, good balance of resource scarcity and challenges from enemy forces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun explore/build game. If you like minecraft, lemmings, or anything in those genres, this would be a good one to check out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love games with dwarves and this one is peak sandbox / tower defense game. i would love to see CtW2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it.  It's a simple and easy to jump into to kill some time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved this since I was a kid. Still good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of my favorite games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is beautiful, fun, and offers a lot of content. It had been my 'comforting' game for about 10 years. I have poured over 2k hours into it but haven't even seen everything (like some biomes or game modes). And I don't know any other game quite like this, so it definitely has unique value to me.\r\n\r\nBUT here is a fair warning! Bugs, inconsistencies, obscurities - there is plenty of that, too. You might not feel it if you play occasional hour here and there. But if you go long and deep (which the game encourages you to do), chances are you'll be dissapointed, especially when trying new content. Players had been whining and cursing for years upon years, begging the devs to fix things. No use! To be fair, they do fix something here and there, occasionally. But in the end, the devs are obviously focused on making more buck from new DLCs, not on squashing bugs or improving AI. Therefore they just keep creating more beautiful content to sell. That new content, of course, brings new bugs, inconsistencies and obscurities on top of the old ones! As a result, I found myself rejecting those new DLCs, because less content in this case means less bugs. The choice is yours, but I think the basic game (and maybe 2 or 3 of older DLCs) is worth a try.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Craft the World is a game that I have played on and off over the years. It's a very fun game but I never can play it for extended amounts of time because it can become very frustrating. I will later get into more detail why that is the case, for now let me tell you about what this game is about.\nIn Craft the World you take control of a tribe of dwarves that use portals to colonize new worlds. You play in such a world and build a thriving dwarven colony. The world is made out of blocks which you can tell your dwarves to dig out for you. Blocks take longer to dig depending on the material it is made of, with dirt and sand being super fast while stone and ore takes longer. Removed blocks are carried by your dwarvces to their stockpile where you can use them to craft various tools and structures. You also can hunt down animals and chop trees for food and extra materials. Dwarves can carry equipment, so you want to start out by crafting pickaxes and axes to speed up the gathering process. You also need weapons, starting with a simple wooden club, to defend yourself against dangerous enemies that can spawn at night or in the underground.\nDwarves can have various skills, each one starts with one random skill but can learn up to three. These skills level over time and speed up tasks like cutting trees, mining or crafting items. Combat skills on the other hand increase damage. In order to learn these skills you need to give your dwarve a skill book that randomly drops from blocks you mine. These skill books also increase the experience of a skill if the dwarve knows it already. \n\nYOur dwarves have of course personal needs. They need food and a bed to sleep. You need to build a shelter by placing a totem inside an enclosed space. The totem will create an area that stops enemies from spawning and allows dwarves to heal by sleeping inside a bed. The totem also shows the quality of the shelter which speeds up the sleeping process of dwarves. Higher quality can be achieved by having more decorations or better building materials for your shelter.\n\nBesides directing your dwarves by giving orders you also can cast various spells that you unlock as you progress through the game. These spells can be something simple like placing an artificial light to something more offensive like launching a fireball. Spells cost mana however that you regenerate over time and the costs for spells increase the further away you are from your shelter. \n\nEverything you do will earn you experience and every time you level up your mana limit increases and you get a new dwarve. More dwarves means more productivity but also another citizen to please. A large colony will also attract attention. After enough time has passed, a monster portal will open at night which spawns many enemies that attack your shelter. These attacks can be difficult but also lucrative since monsters drop valuable loot like materials and more importantly, coins. Coins can be used at a shop to buy materials, tools, whatever you need. It's great way to further improve your colony.\nThis game has a very huge technology tree. To unlock new technologies you simply have to craft structures, refined materials and tools from the technology before it. It's a simple concept that allows you to progress naturally.\n\nYou can play as long as you want but each world also ha s awin condition that you can achieve if you desire. The game has a hidden portal somewhere in the underground, you have to find it, beat kill the guardian and then find the recipes of the portal parts that are hidden through the world. Once you assemble the portal you can use it to leave the world, unlocking the next world type. Doing this the first time will also permanetely unlock a trophy decoration for syour settlement.\nThe different world types offer various new challenges for players to overcome. The first world is easy to get into with weaker enemies and fewer monster spawns. The ice world has snow and ice instead of water, so you need to melt the ice to generate your own water. The desert has sand storms that can deal damage and destroy blocks and also has pyramids that have dungeons to explore.\nThe game has a lot of content to offer, more so if you have some of the DLCs which add new items and new worlds to explore.\n\nBut let's talk about some of the frustrating parts. This game has an infamously bad AI. This has been improved over the years and honestly, it is much better as it used to be, but it still makes many mistakes. Dwarves don't always pick the fastest route to travel or the best dwarve for the job but this isn't as bad as the combat AI. Dwarves will run into fights and almost die, run out of the fight and then run back into it. This can lead to frustrating moments in which a dwarve dies because he couldn't value his own life. On the other hand you have dwarves with full live and a high cvombat skill that run away because they are frightened. It makes no sense why some are suicidal while others don't attempt to fight. But one of the worst things in the game is when you order an attack on an enemy. Suddenly ALL dwraves drop all their items and run to the enemy like some rabid dogs no matter hwere they are on the map. The dwarves that are the furthest away won't even reach the target before it dies and then they slowly waddle back to pick up the items they dropped. It's so annoying that dwraves drop all their pockets before heading into fights, just take it with you.\nSpeaking of items, the storage management is anightmare. Dwarves have only ONE dedicated storage during the majority of the game. This storage is at the spawn point of your dwarves (the portal) anmd since you cannot move it you have to build your settlement around it. If that storage is in a bad spot, tough luck, make it work! All the chests in the tech tree are just decorative, apparently dwarves like to look at boxes but they don't like to put things into them. You can buy a new storage from the merchant or wait until a very late game tech that allows you to build extra storages. The good thing about these at least is that they all share the same storage but until you unlock these you will have a wait a long time for dwarves to deliver goods to your storage.\n\nAnother annoying aspect is the grind. All blocks drop onlöy one material. Ore block? One ore. Coal? One coal. This means you have to mine an absurd amount of blocks if you want to produce in a meaningful quantity. Combined with the fact that you need to produce stuff to unlock more tech, you realize how much more materials you actually need. It's never enough! This kinda fits into the \"greedy dwarves\" stereotype but from agameplay perspective it just takes too long.\n\nThen there are sapwning rules. Objects and creatures spawn at random. The game makes sure that there is always a minimum amount of objects in the game world but this can be frustrating if you try to mine or build. Objects on top of a block will block your ability to mine it or build on it, so you have to remove it. Combined with the long walking times to and from the storage you have asituation in which you give an order, a dwarvbe walks to the storage to get the required object, then reaches his destination just for a tree to have spawned on top of it, blocking whatever you wanted to do.\n\nBut despite all of that, there is a reason I always come back to the game. The game devs are still active even after more than ten years. They still put out updates with new content, some free, some paid DLC. They add new quality of life imrpovements, recently they added a merchant that allows you to sell items for gold coins. They try really hard for a game that doesn't have the same reach as Dwarf Fortress or Terraria. And whenever I see a new update I jump back in the game and play for several weeks. The game is just fun, even if the dwarves are dorks that don't know how to survive on their own.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of my top 10 favourite PC games. Mechanics are smooth, goals keep you driving forward as does the need to control the waves. Ongoing DLCs have kept it interesting over the years. Use of mods keep it fresh also.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've been playing this game for years and it's always my got to. \nThanks to the devs who continue to update it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun, Relaxing, Problematic, and a kind of puzzle. Been playing for a long time and I keep coming back. Each game map is different. SUCH a wonderful game and with  all the DLC's, it makes it even more enjoyable! If you are looking for a good digger dwarf game built on a solid system, This is for you. Highly recommend!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Craft The World is a charming mix of sandbox building, strategy, and survival that feels like Terraria meets Dwarf Fortress, but more accessible. You manage a tribe of dwarves, gather resources, craft gear, and slowly build up a fortified base while defending against waves of monsters. The gameplay loop is addictive, progression is satisfying, and the quirky dwarf AI adds both humor and occasional frustration.\n\nIf you enjoy base-building with a touch of RPG and automation, Craft The World is a fun, cozy, and surprisingly deep experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good casual game. Simple to play, decent crafting tree, good balance of resource scarcity and challenges from enemy forces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun explore/build game. If you like minecraft, lemmings, or anything in those genres, this would be a good one to check out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good, solid and fun game by a small company that has supported the game for many years. I have played the base game for many, many years; no DLC are required for a complete experience. I have only recently started to buy the DLC, because I wanted to support the devs and I have not regretted it: they are fairly priced and with good content. I really can't say anything negative about this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i loved this game on the mobile version so much when i was younger, with my mother being the one to introduce me to it. so i was so happy to see that it hasn't been abandoned, and that it's a much better game on pc lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "final boss of adding basic game mechanics as DLC (but its ok on sale)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love games with dwarves and this one is peak sandbox / tower defense game. i would love to see CtW2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it.  It's a simple and easy to jump into to kill some time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "为童年买单咯，玩的时候还是会想起小时候那个暑假",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its my favorite game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Loved this since I was a kid. Still good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of my favorite games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very enjoyable casual game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "крута гра про дворфів",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My mom showed me this game. I love her a lot, even if I don't alway show it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is beautiful, fun, and offers a lot of content. It had been my 'comforting' game for about 10 years. I have poured over 2k hours into it but haven't even seen everything (like some biomes or game modes). And I don't know any other game quite like this, so it definitely has unique value to me.\r\n\r\nBUT here is a fair warning! Bugs, inconsistencies, obscurities - there is plenty of that, too. You might not feel it if you play occasional hour here and there. But if you go long and deep (which the game encourages you to do), chances are you'll be dissapointed, especially when trying new content. Players had been whining and cursing for years upon years, begging the devs to fix things. No use! To be fair, they do fix something here and there, occasionally. But in the end, the devs are obviously focused on making more buck from new DLCs, not on squashing bugs or improving AI. Therefore they just keep creating more beautiful content to sell. That new content, of course, brings new bugs, inconsistencies and obscurities on top of the old ones! As a result, I found myself rejecting those new DLCs, because less content in this case means less bugs. The choice is yours, but I think the basic game (and maybe 2 or 3 of older DLCs) is worth a try.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Craft the World is a game that I have played on and off over the years. It's a very fun game but I never can play it for extended amounts of time because it can become very frustrating. I will later get into more detail why that is the case, for now let me tell you about what this game is about.\nIn Craft the World you take control of a tribe of dwarves that use portals to colonize new worlds. You play in such a world and build a thriving dwarven colony. The world is made out of blocks which you can tell your dwarves to dig out for you. Blocks take longer to dig depending on the material it is made of, with dirt and sand being super fast while stone and ore takes longer. Removed blocks are carried by your dwarvces to their stockpile where you can use them to craft various tools and structures. You also can hunt down animals and chop trees for food and extra materials. Dwarves can carry equipment, so you want to start out by crafting pickaxes and axes to speed up the gathering process. You also need weapons, starting with a simple wooden club, to defend yourself against dangerous enemies that can spawn at night or in the underground.\nDwarves can have various skills, each one starts with one random skill but can learn up to three. These skills level over time and speed up tasks like cutting trees, mining or crafting items. Combat skills on the other hand increase damage. In order to learn these skills you need to give your dwarve a skill book that randomly drops from blocks you mine. These skill books also increase the experience of a skill if the dwarve knows it already. \n\nYOur dwarves have of course personal needs. They need food and a bed to sleep. You need to build a shelter by placing a totem inside an enclosed space. The totem will create an area that stops enemies from spawning and allows dwarves to heal by sleeping inside a bed. The totem also shows the quality of the shelter which speeds up the sleeping process of dwarves. Higher quality can be achieved by having more decorations or better building materials for your shelter.\n\nBesides directing your dwarves by giving orders you also can cast various spells that you unlock as you progress through the game. These spells can be something simple like placing an artificial light to something more offensive like launching a fireball. Spells cost mana however that you regenerate over time and the costs for spells increase the further away you are from your shelter. \n\nEverything you do will earn you experience and every time you level up your mana limit increases and you get a new dwarve. More dwarves means more productivity but also another citizen to please. A large colony will also attract attention. After enough time has passed, a monster portal will open at night which spawns many enemies that attack your shelter. These attacks can be difficult but also lucrative since monsters drop valuable loot like materials and more importantly, coins. Coins can be used at a shop to buy materials, tools, whatever you need. It's great way to further improve your colony.\nThis game has a very huge technology tree. To unlock new technologies you simply have to craft structures, refined materials and tools from the technology before it. It's a simple concept that allows you to progress naturally.\n\nYou can play as long as you want but each world also ha s awin condition that you can achieve if you desire. The game has a hidden portal somewhere in the underground, you have to find it, beat kill the guardian and then find the recipes of the portal parts that are hidden through the world. Once you assemble the portal you can use it to leave the world, unlocking the next world type. Doing this the first time will also permanetely unlock a trophy decoration for syour settlement.\nThe different world types offer various new challenges for players to overcome. The first world is easy to get into with weaker enemies and fewer monster spawns. The ice world has snow and ice instead of water, so you need to melt the ice to generate your own water. The desert has sand storms that can deal damage and destroy blocks and also has pyramids that have dungeons to explore.\nThe game has a lot of content to offer, more so if you have some of the DLCs which add new items and new worlds to explore.\n\nBut let's talk about some of the frustrating parts. This game has an infamously bad AI. This has been improved over the years and honestly, it is much better as it used to be, but it still makes many mistakes. Dwarves don't always pick the fastest route to travel or the best dwarve for the job but this isn't as bad as the combat AI. Dwarves will run into fights and almost die, run out of the fight and then run back into it. This can lead to frustrating moments in which a dwarve dies because he couldn't value his own life. On the other hand you have dwarves with full live and a high cvombat skill that run away because they are frightened. It makes no sense why some are suicidal while others don't attempt to fight. But one of the worst things in the game is when you order an attack on an enemy. Suddenly ALL dwraves drop all their items and run to the enemy like some rabid dogs no matter hwere they are on the map. The dwarves that are the furthest away won't even reach the target before it dies and then they slowly waddle back to pick up the items they dropped. It's so annoying that dwraves drop all their pockets before heading into fights, just take it with you.\nSpeaking of items, the storage management is anightmare. Dwarves have only ONE dedicated storage during the majority of the game. This storage is at the spawn point of your dwarves (the portal) anmd since you cannot move it you have to build your settlement around it. If that storage is in a bad spot, tough luck, make it work! All the chests in the tech tree are just decorative, apparently dwarves like to look at boxes but they don't like to put things into them. You can buy a new storage from the merchant or wait until a very late game tech that allows you to build extra storages. The good thing about these at least is that they all share the same storage but until you unlock these you will have a wait a long time for dwarves to deliver goods to your storage.\n\nAnother annoying aspect is the grind. All blocks drop onlöy one material. Ore block? One ore. Coal? One coal. This means you have to mine an absurd amount of blocks if you want to produce in a meaningful quantity. Combined with the fact that you need to produce stuff to unlock more tech, you realize how much more materials you actually need. It's never enough! This kinda fits into the \"greedy dwarves\" stereotype but from agameplay perspective it just takes too long.\n\nThen there are sapwning rules. Objects and creatures spawn at random. The game makes sure that there is always a minimum amount of objects in the game world but this can be frustrating if you try to mine or build. Objects on top of a block will block your ability to mine it or build on it, so you have to remove it. Combined with the long walking times to and from the storage you have asituation in which you give an order, a dwarvbe walks to the storage to get the required object, then reaches his destination just for a tree to have spawned on top of it, blocking whatever you wanted to do.\n\nBut despite all of that, there is a reason I always come back to the game. The game devs are still active even after more than ten years. They still put out updates with new content, some free, some paid DLC. They add new quality of life imrpovements, recently they added a merchant that allows you to sell items for gold coins. They try really hard for a game that doesn't have the same reach as Dwarf Fortress or Terraria. And whenever I see a new update I jump back in the game and play for several weeks. The game is just fun, even if the dwarves are dorks that don't know how to survive on their own.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of my top 10 favourite PC games. Mechanics are smooth, goals keep you driving forward as does the need to control the waves. Ongoing DLCs have kept it interesting over the years. Use of mods keep it fresh also.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've been playing this game for years and it's always my got to. \nThanks to the devs who continue to update it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun, Relaxing, Problematic, and a kind of puzzle. Been playing for a long time and I keep coming back. Each game map is different. SUCH a wonderful game and with  all the DLC's, it makes it even more enjoyable! If you are looking for a good digger dwarf game built on a solid system, This is for you. Highly recommend!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Craft The World is a charming mix of sandbox building, strategy, and survival that feels like Terraria meets Dwarf Fortress, but more accessible. You manage a tribe of dwarves, gather resources, craft gear, and slowly build up a fortified base while defending against waves of monsters. The gameplay loop is addictive, progression is satisfying, and the quirky dwarf AI adds both humor and occasional frustration.\n\nIf you enjoy base-building with a touch of RPG and automation, Craft The World is a fun, cozy, and surprisingly deep experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good casual game. Simple to play, decent crafting tree, good balance of resource scarcity and challenges from enemy forces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun explore/build game. If you like minecraft, lemmings, or anything in those genres, this would be a good one to check out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good, solid and fun game by a small company that has supported the game for many years. I have played the base game for many, many years; no DLC are required for a complete experience. I have only recently started to buy the DLC, because I wanted to support the devs and I have not regretted it: they are fairly priced and with good content. I really can't say anything negative about this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i loved this game on the mobile version so much when i was younger, with my mother being the one to introduce me to it. so i was so happy to see that it hasn't been abandoned, and that it's a much better game on pc lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "final boss of adding basic game mechanics as DLC (but its ok on sale)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love games with dwarves and this one is peak sandbox / tower defense game. i would love to see CtW2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it.  It's a simple and easy to jump into to kill some time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "为童年买单咯，玩的时候还是会想起小时候那个暑假",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its my favorite game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Loved this since I was a kid. Still good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of my favorite games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very enjoyable casual game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "крута гра про дворфів",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My mom showed me this game. I love her a lot, even if I don't alway show it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is beautiful, fun, and offers a lot of content. It had been my 'comforting' game for about 10 years. I have poured over 2k hours into it but haven't even seen everything (like some biomes or game modes). And I don't know any other game quite like this, so it definitely has unique value to me.\r\n\r\nBUT here is a fair warning! Bugs, inconsistencies, obscurities - there is plenty of that, too. You might not feel it if you play occasional hour here and there. But if you go long and deep (which the game encourages you to do), chances are you'll be dissapointed, especially when trying new content. Players had been whining and cursing for years upon years, begging the devs to fix things. No use! To be fair, they do fix something here and there, occasionally. But in the end, the devs are obviously focused on making more buck from new DLCs, not on squashing bugs or improving AI. Therefore they just keep creating more beautiful content to sell. That new content, of course, brings new bugs, inconsistencies and obscurities on top of the old ones! As a result, I found myself rejecting those new DLCs, because less content in this case means less bugs. The choice is yours, but I think the basic game (and maybe 2 or 3 of older DLCs) is worth a try.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Craft the World is a game that I have played on and off over the years. It's a very fun game but I never can play it for extended amounts of time because it can become very frustrating. I will later get into more detail why that is the case, for now let me tell you about what this game is about.\nIn Craft the World you take control of a tribe of dwarves that use portals to colonize new worlds. You play in such a world and build a thriving dwarven colony. The world is made out of blocks which you can tell your dwarves to dig out for you. Blocks take longer to dig depending on the material it is made of, with dirt and sand being super fast while stone and ore takes longer. Removed blocks are carried by your dwarvces to their stockpile where you can use them to craft various tools and structures. You also can hunt down animals and chop trees for food and extra materials. Dwarves can carry equipment, so you want to start out by crafting pickaxes and axes to speed up the gathering process. You also need weapons, starting with a simple wooden club, to defend yourself against dangerous enemies that can spawn at night or in the underground.\nDwarves can have various skills, each one starts with one random skill but can learn up to three. These skills level over time and speed up tasks like cutting trees, mining or crafting items. Combat skills on the other hand increase damage. In order to learn these skills you need to give your dwarve a skill book that randomly drops from blocks you mine. These skill books also increase the experience of a skill if the dwarve knows it already. \n\nYOur dwarves have of course personal needs. They need food and a bed to sleep. You need to build a shelter by placing a totem inside an enclosed space. The totem will create an area that stops enemies from spawning and allows dwarves to heal by sleeping inside a bed. The totem also shows the quality of the shelter which speeds up the sleeping process of dwarves. Higher quality can be achieved by having more decorations or better building materials for your shelter.\n\nBesides directing your dwarves by giving orders you also can cast various spells that you unlock as you progress through the game. These spells can be something simple like placing an artificial light to something more offensive like launching a fireball. Spells cost mana however that you regenerate over time and the costs for spells increase the further away you are from your shelter. \n\nEverything you do will earn you experience and every time you level up your mana limit increases and you get a new dwarve. More dwarves means more productivity but also another citizen to please. A large colony will also attract attention. After enough time has passed, a monster portal will open at night which spawns many enemies that attack your shelter. These attacks can be difficult but also lucrative since monsters drop valuable loot like materials and more importantly, coins. Coins can be used at a shop to buy materials, tools, whatever you need. It's great way to further improve your colony.\nThis game has a very huge technology tree. To unlock new technologies you simply have to craft structures, refined materials and tools from the technology before it. It's a simple concept that allows you to progress naturally.\n\nYou can play as long as you want but each world also ha s awin condition that you can achieve if you desire. The game has a hidden portal somewhere in the underground, you have to find it, beat kill the guardian and then find the recipes of the portal parts that are hidden through the world. Once you assemble the portal you can use it to leave the world, unlocking the next world type. Doing this the first time will also permanetely unlock a trophy decoration for syour settlement.\nThe different world types offer various new challenges for players to overcome. The first world is easy to get into with weaker enemies and fewer monster spawns. The ice world has snow and ice instead of water, so you need to melt the ice to generate your own water. The desert has sand storms that can deal damage and destroy blocks and also has pyramids that have dungeons to explore.\nThe game has a lot of content to offer, more so if you have some of the DLCs which add new items and new worlds to explore.\n\nBut let's talk about some of the frustrating parts. This game has an infamously bad AI. This has been improved over the years and honestly, it is much better as it used to be, but it still makes many mistakes. Dwarves don't always pick the fastest route to travel or the best dwarve for the job but this isn't as bad as the combat AI. Dwarves will run into fights and almost die, run out of the fight and then run back into it. This can lead to frustrating moments in which a dwarve dies because he couldn't value his own life. On the other hand you have dwarves with full live and a high cvombat skill that run away because they are frightened. It makes no sense why some are suicidal while others don't attempt to fight. But one of the worst things in the game is when you order an attack on an enemy. Suddenly ALL dwraves drop all their items and run to the enemy like some rabid dogs no matter hwere they are on the map. The dwarves that are the furthest away won't even reach the target before it dies and then they slowly waddle back to pick up the items they dropped. It's so annoying that dwraves drop all their pockets before heading into fights, just take it with you.\nSpeaking of items, the storage management is anightmare. Dwarves have only ONE dedicated storage during the majority of the game. This storage is at the spawn point of your dwarves (the portal) anmd since you cannot move it you have to build your settlement around it. If that storage is in a bad spot, tough luck, make it work! All the chests in the tech tree are just decorative, apparently dwarves like to look at boxes but they don't like to put things into them. You can buy a new storage from the merchant or wait until a very late game tech that allows you to build extra storages. The good thing about these at least is that they all share the same storage but until you unlock these you will have a wait a long time for dwarves to deliver goods to your storage.\n\nAnother annoying aspect is the grind. All blocks drop onlöy one material. Ore block? One ore. Coal? One coal. This means you have to mine an absurd amount of blocks if you want to produce in a meaningful quantity. Combined with the fact that you need to produce stuff to unlock more tech, you realize how much more materials you actually need. It's never enough! This kinda fits into the \"greedy dwarves\" stereotype but from agameplay perspective it just takes too long.\n\nThen there are sapwning rules. Objects and creatures spawn at random. The game makes sure that there is always a minimum amount of objects in the game world but this can be frustrating if you try to mine or build. Objects on top of a block will block your ability to mine it or build on it, so you have to remove it. Combined with the long walking times to and from the storage you have asituation in which you give an order, a dwarvbe walks to the storage to get the required object, then reaches his destination just for a tree to have spawned on top of it, blocking whatever you wanted to do.\n\nBut despite all of that, there is a reason I always come back to the game. The game devs are still active even after more than ten years. They still put out updates with new content, some free, some paid DLC. They add new quality of life imrpovements, recently they added a merchant that allows you to sell items for gold coins. They try really hard for a game that doesn't have the same reach as Dwarf Fortress or Terraria. And whenever I see a new update I jump back in the game and play for several weeks. The game is just fun, even if the dwarves are dorks that don't know how to survive on their own.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of my top 10 favourite PC games. Mechanics are smooth, goals keep you driving forward as does the need to control the waves. Ongoing DLCs have kept it interesting over the years. Use of mods keep it fresh also.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've been playing this game for years and it's always my got to. \nThanks to the devs who continue to update it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun, Relaxing, Problematic, and a kind of puzzle. Been playing for a long time and I keep coming back. Each game map is different. SUCH a wonderful game and with  all the DLC's, it makes it even more enjoyable! If you are looking for a good digger dwarf game built on a solid system, This is for you. Highly recommend!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Craft The World is a charming mix of sandbox building, strategy, and survival that feels like Terraria meets Dwarf Fortress, but more accessible. You manage a tribe of dwarves, gather resources, craft gear, and slowly build up a fortified base while defending against waves of monsters. The gameplay loop is addictive, progression is satisfying, and the quirky dwarf AI adds both humor and occasional frustration.\n\nIf you enjoy base-building with a touch of RPG and automation, Craft The World is a fun, cozy, and surprisingly deep experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good casual game. Simple to play, decent crafting tree, good balance of resource scarcity and challenges from enemy forces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun explore/build game. If you like minecraft, lemmings, or anything in those genres, this would be a good one to check out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good, solid and fun game by a small company that has supported the game for many years. I have played the base game for many, many years; no DLC are required for a complete experience. I have only recently started to buy the DLC, because I wanted to support the devs and I have not regretted it: they are fairly priced and with good content. I really can't say anything negative about this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i loved this game on the mobile version so much when i was younger, with my mother being the one to introduce me to it. so i was so happy to see that it hasn't been abandoned, and that it's a much better game on pc lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "final boss of adding basic game mechanics as DLC (but its ok on sale)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love games with dwarves and this one is peak sandbox / tower defense game. i would love to see CtW2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it.  It's a simple and easy to jump into to kill some time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "为童年买单咯，玩的时候还是会想起小时候那个暑假",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its my favorite game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Loved this since I was a kid. Still good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of my favorite games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very enjoyable casual game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "крута гра про дворфів",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My mom showed me this game. I love her a lot, even if I don't alway show it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is beautiful, fun, and offers a lot of content. It had been my 'comforting' game for about 10 years. I have poured over 2k hours into it but haven't even seen everything (like some biomes or game modes). And I don't know any other game quite like this, so it definitely has unique value to me.\r\n\r\nBUT here is a fair warning! Bugs, inconsistencies, obscurities - there is plenty of that, too. You might not feel it if you play occasional hour here and there. But if you go long and deep (which the game encourages you to do), chances are you'll be dissapointed, especially when trying new content. Players had been whining and cursing for years upon years, begging the devs to fix things. No use! To be fair, they do fix something here and there, occasionally. But in the end, the devs are obviously focused on making more buck from new DLCs, not on squashing bugs or improving AI. Therefore they just keep creating more beautiful content to sell. That new content, of course, brings new bugs, inconsistencies and obscurities on top of the old ones! As a result, I found myself rejecting those new DLCs, because less content in this case means less bugs. The choice is yours, but I think the basic game (and maybe 2 or 3 of older DLCs) is worth a try.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Craft the World is a game that I have played on and off over the years. It's a very fun game but I never can play it for extended amounts of time because it can become very frustrating. I will later get into more detail why that is the case, for now let me tell you about what this game is about.\nIn Craft the World you take control of a tribe of dwarves that use portals to colonize new worlds. You play in such a world and build a thriving dwarven colony. The world is made out of blocks which you can tell your dwarves to dig out for you. Blocks take longer to dig depending on the material it is made of, with dirt and sand being super fast while stone and ore takes longer. Removed blocks are carried by your dwarvces to their stockpile where you can use them to craft various tools and structures. You also can hunt down animals and chop trees for food and extra materials. Dwarves can carry equipment, so you want to start out by crafting pickaxes and axes to speed up the gathering process. You also need weapons, starting with a simple wooden club, to defend yourself against dangerous enemies that can spawn at night or in the underground.\nDwarves can have various skills, each one starts with one random skill but can learn up to three. These skills level over time and speed up tasks like cutting trees, mining or crafting items. Combat skills on the other hand increase damage. In order to learn these skills you need to give your dwarve a skill book that randomly drops from blocks you mine. These skill books also increase the experience of a skill if the dwarve knows it already. \n\nYOur dwarves have of course personal needs. They need food and a bed to sleep. You need to build a shelter by placing a totem inside an enclosed space. The totem will create an area that stops enemies from spawning and allows dwarves to heal by sleeping inside a bed. The totem also shows the quality of the shelter which speeds up the sleeping process of dwarves. Higher quality can be achieved by having more decorations or better building materials for your shelter.\n\nBesides directing your dwarves by giving orders you also can cast various spells that you unlock as you progress through the game. These spells can be something simple like placing an artificial light to something more offensive like launching a fireball. Spells cost mana however that you regenerate over time and the costs for spells increase the further away you are from your shelter. \n\nEverything you do will earn you experience and every time you level up your mana limit increases and you get a new dwarve. More dwarves means more productivity but also another citizen to please. A large colony will also attract attention. After enough time has passed, a monster portal will open at night which spawns many enemies that attack your shelter. These attacks can be difficult but also lucrative since monsters drop valuable loot like materials and more importantly, coins. Coins can be used at a shop to buy materials, tools, whatever you need. It's great way to further improve your colony.\nThis game has a very huge technology tree. To unlock new technologies you simply have to craft structures, refined materials and tools from the technology before it. It's a simple concept that allows you to progress naturally.\n\nYou can play as long as you want but each world also ha s awin condition that you can achieve if you desire. The game has a hidden portal somewhere in the underground, you have to find it, beat kill the guardian and then find the recipes of the portal parts that are hidden through the world. Once you assemble the portal you can use it to leave the world, unlocking the next world type. Doing this the first time will also permanetely unlock a trophy decoration for syour settlement.\nThe different world types offer various new challenges for players to overcome. The first world is easy to get into with weaker enemies and fewer monster spawns. The ice world has snow and ice instead of water, so you need to melt the ice to generate your own water. The desert has sand storms that can deal damage and destroy blocks and also has pyramids that have dungeons to explore.\nThe game has a lot of content to offer, more so if you have some of the DLCs which add new items and new worlds to explore.\n\nBut let's talk about some of the frustrating parts. This game has an infamously bad AI. This has been improved over the years and honestly, it is much better as it used to be, but it still makes many mistakes. Dwarves don't always pick the fastest route to travel or the best dwarve for the job but this isn't as bad as the combat AI. Dwarves will run into fights and almost die, run out of the fight and then run back into it. This can lead to frustrating moments in which a dwarve dies because he couldn't value his own life. On the other hand you have dwarves with full live and a high cvombat skill that run away because they are frightened. It makes no sense why some are suicidal while others don't attempt to fight. But one of the worst things in the game is when you order an attack on an enemy. Suddenly ALL dwraves drop all their items and run to the enemy like some rabid dogs no matter hwere they are on the map. The dwarves that are the furthest away won't even reach the target before it dies and then they slowly waddle back to pick up the items they dropped. It's so annoying that dwraves drop all their pockets before heading into fights, just take it with you.\nSpeaking of items, the storage management is anightmare. Dwarves have only ONE dedicated storage during the majority of the game. This storage is at the spawn point of your dwarves (the portal) anmd since you cannot move it you have to build your settlement around it. If that storage is in a bad spot, tough luck, make it work! All the chests in the tech tree are just decorative, apparently dwarves like to look at boxes but they don't like to put things into them. You can buy a new storage from the merchant or wait until a very late game tech that allows you to build extra storages. The good thing about these at least is that they all share the same storage but until you unlock these you will have a wait a long time for dwarves to deliver goods to your storage.\n\nAnother annoying aspect is the grind. All blocks drop onlöy one material. Ore block? One ore. Coal? One coal. This means you have to mine an absurd amount of blocks if you want to produce in a meaningful quantity. Combined with the fact that you need to produce stuff to unlock more tech, you realize how much more materials you actually need. It's never enough! This kinda fits into the \"greedy dwarves\" stereotype but from agameplay perspective it just takes too long.\n\nThen there are sapwning rules. Objects and creatures spawn at random. The game makes sure that there is always a minimum amount of objects in the game world but this can be frustrating if you try to mine or build. Objects on top of a block will block your ability to mine it or build on it, so you have to remove it. Combined with the long walking times to and from the storage you have asituation in which you give an order, a dwarvbe walks to the storage to get the required object, then reaches his destination just for a tree to have spawned on top of it, blocking whatever you wanted to do.\n\nBut despite all of that, there is a reason I always come back to the game. The game devs are still active even after more than ten years. They still put out updates with new content, some free, some paid DLC. They add new quality of life imrpovements, recently they added a merchant that allows you to sell items for gold coins. They try really hard for a game that doesn't have the same reach as Dwarf Fortress or Terraria. And whenever I see a new update I jump back in the game and play for several weeks. The game is just fun, even if the dwarves are dorks that don't know how to survive on their own.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of my top 10 favourite PC games. Mechanics are smooth, goals keep you driving forward as does the need to control the waves. Ongoing DLCs have kept it interesting over the years. Use of mods keep it fresh also.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've been playing this game for years and it's always my got to. \nThanks to the devs who continue to update it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun, Relaxing, Problematic, and a kind of puzzle. Been playing for a long time and I keep coming back. Each game map is different. SUCH a wonderful game and with  all the DLC's, it makes it even more enjoyable! If you are looking for a good digger dwarf game built on a solid system, This is for you. Highly recommend!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Craft The World is a charming mix of sandbox building, strategy, and survival that feels like Terraria meets Dwarf Fortress, but more accessible. You manage a tribe of dwarves, gather resources, craft gear, and slowly build up a fortified base while defending against waves of monsters. The gameplay loop is addictive, progression is satisfying, and the quirky dwarf AI adds both humor and occasional frustration.\n\nIf you enjoy base-building with a touch of RPG and automation, Craft The World is a fun, cozy, and surprisingly deep experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good casual game. Simple to play, decent crafting tree, good balance of resource scarcity and challenges from enemy forces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun explore/build game. If you like minecraft, lemmings, or anything in those genres, this would be a good one to check out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good, solid and fun game by a small company that has supported the game for many years. I have played the base game for many, many years; no DLC are required for a complete experience. I have only recently started to buy the DLC, because I wanted to support the devs and I have not regretted it: they are fairly priced and with good content. I really can't say anything negative about this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i loved this game on the mobile version so much when i was younger, with my mother being the one to introduce me to it. so i was so happy to see that it hasn't been abandoned, and that it's a much better game on pc lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "final boss of adding basic game mechanics as DLC (but its ok on sale)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love games with dwarves and this one is peak sandbox / tower defense game. i would love to see CtW2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it.  It's a simple and easy to jump into to kill some time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "为童年买单咯，玩的时候还是会想起小时候那个暑假",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its my favorite game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Loved this since I was a kid. Still good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of my favorite games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very enjoyable casual game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "крута гра про дворфів",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Güzel bir fikrin kötü uygulaması. Yıllardır gelişmeyen UI, bir arama kutusunun bile eklenmemiş olması, öncelik ve karar vermede buglar...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't possibly recommend this game for a few fundamental reasons. As this game acts like a dwarf fortress sim, where you can't control your dwarves, it leaves the game to control the characters instead, except the AI for them is absolutely broken, and pathfinding is a joke. There are times where you dwarf will be standing next to a ladder, but fall and hurt themselves for seemingly no reason at all instead of taking the ladder. If they are partially in water, they will swim next to an enemy and just die instead of swim away. \n\nOnly later did I discover a huge bug, which apparently has never been fixed, where all of your dwarves are all unnamed and broken, where you can't add skills. \n\nLosing dwarves because the game is fundamentally broken makes it hard to enjoy or recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As you can tell from my total play time, I really want to provide a positive recommendation for this game but I cannot.  While the start of each level is enjoyable due to the early build and survival aspects of the game, the later hours of play are tedious.\n\nHere are some positives and negatives for this game:\n\nPositive : You will enjoy the challenge of the campaign for your first play through.\nNegative : You are literally dealing with the dumbest AI you will ever encounter in a game.  The dwarves will kill a creature and walk away from the loot that is dropped.  The dwarves will continue to fight a Guardian until they die because there was an object to gather near the Guardian rather than going to sleep due to low health.\nPositive : Some of the DLCs are quite good additions.  Look at their ratings to figure this out as it's pretty accurate.\nNegative : The lack of additional environments is very striking for a game that is this old.  They could easily add another four (4) biomes (forest, ice, desert, underground are currently in the campaign) and extend the campaign accordingly.  Adjust it for difficulty accordingly but it would make a lot more sense to do this and then charge $9.99 for the DLC than to let the original release langish.  They recently released a \"cosmetic DLC\" rather than adding content.  Unbelieveable.\n\nYou will enjoy it initially but you will quickly grow frustrated by the mentally challenged dwarves that populate your environment.  I hope some new actual content arrives otherwise I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "WAS a wonderful game, had it for years.  Then you introduced that floating ship.  i just put two transport thingys in the sky.  Why can't i turn it off.  Why don't i have the option to turn it OFF?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[EDIT]\nUnforgivable stupid design decisions. If you want to remove a world, it removes the 'campaign' and then you lose all progress. My god, what were these people thinking?\n0/10,\n\nIn principal, an interesting game. In practice, its really fun to play.\nHowever, there is one key problem. The tutorial is not a tutorial, it is the entire game. So, to unlock the second through fourth worlds, I have to play the entire game to the end, just so I can play the game to the end again. \nUm...no.\n\nDon't make the mistake of playing with the expansion packs turned on. It can make the \"tutorial\" painful beyond belief. To the devs - this is a simple fix (which you aren't going to do at this late hour are you?).\nI liked it, right up until it just got too frustrating. I would have loved to start on the 'next' world, but I cannot because I have to finish the \"tutorial\".\nOverall, I would rate a six out of ten. However the quick-bar based interaction is pathetic, which lost it a whole three points right there. If you wanted to have everything done via the quickbar (and I mean absolutely everything only works via this method) then you should have provided far more than ten slots. The other lost point is the pathetically laid out building screens which suffer from the same quickbar issue of \"We only want you to see ten things at a time, you cannot search, and good luck figuring out how all the stuff is grouped. Oh, and you cannot turn stuff off, so you'll see all the basic recipes even though you won't evern build them again.\"\nIn short, the UI is from the nineties, and the game suffers massively as a result.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The tutorial is really bad or unfinished, doesn't explain any of the basics and leaves you wondering. As if that wasn't bad enough, the main screen of the game is full of locked content that you have pay if you want to unlock.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fun game though i cant find myself playing it. progression is a little slow and quite a few things were hard to get a grip on. not a bad game but i cant see myself recommending it to others.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a fun little game that I try to enjoy when I just want to turn my brain off; the problem is that is impossible. This game is entirely not user friendly. I turn it on so that I can relax and do a little mining. Instead of spend 40 minutes adjusting the display settings on my computer, the UI settings on the game, troubleshoot the properties on the executable file... After all of that I get it so that the button to open the crafting menu is just barely visible at the bottom of my screen. Finally relief, I can play my game; wait no, when you actually click the crafting menu it opens up off screen. So then I try setting the game to full screen mode again. Now I cannot scroll in to see what the workers are doing. It is frozen in the full map mode. I fuss with that for a few minutes, figure out a way to scroll in to the furthest distance outside of full map mode, can't get any closer than that.\n\nThat is when I see my little worker swimming in place. Then I remembered why I quit playing this game about a year ago. Not only is the user interface basically unplayable but the little workers are completely incompetent. I guess I repressed the memory of seeing my workers repeatedly drowned because they got stuck swimming nowhere in one little square. Or all the times my little guys jumped to their death down a deep mine shaft when there was a ladder right at the entrance of the mine. I get that there is a climbing skill and a swimming skill for a reason; but I am no Michael Phelps and I can still manage to swim forward, albeit slowly, in water without drowning.\n\nI should not have to be a computer whiz to play the game at all, and I should not have to helicopter parent my workers to keep them alive when I finally get the game running correctly. The fact that these are common problems that the developers seem to have no interest in resolving is egregious.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Güzel bir fikrin kötü uygulaması. Yıllardır gelişmeyen UI, bir arama kutusunun bile eklenmemiş olması, öncelik ve karar vermede buglar...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I saw good reviews and thought the game must be worth trying. I can't believe how horrible the Dwarf AI is! The entire map is up/down of 1-2 tile cliffs, but if an enemy is up or down a level from them, they endlessly hop up/down and do nothing until they die, never recover health while sleeping, etc.\n\nWorst AI I've seen in a game in a very, very long time, and I have experience with literally hundreds of games including many of its competitors. Strongly recommend other games like Ratopia, Terraria, and many, many others with far better AI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cannot recommend this game. Details will follow eventually. Disregard the playtime: it is due to bad programming/game design and abusive achievements (that I tried getting).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really bad, poorly built and buggy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't possibly recommend this game for a few fundamental reasons. As this game acts like a dwarf fortress sim, where you can't control your dwarves, it leaves the game to control the characters instead, except the AI for them is absolutely broken, and pathfinding is a joke. There are times where you dwarf will be standing next to a ladder, but fall and hurt themselves for seemingly no reason at all instead of taking the ladder. If they are partially in water, they will swim next to an enemy and just die instead of swim away. \n\nOnly later did I discover a huge bug, which apparently has never been fixed, where all of your dwarves are all unnamed and broken, where you can't add skills. \n\nLosing dwarves because the game is fundamentally broken makes it hard to enjoy or recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A very basic colony sim with the trappings of a 2D action & exploration game like Terraria. \n\nFun for a time, but with too little in the way of automation (making colony management repetitive) and the lopsided difficulty (making the early game particularly frustrating) there’s little of value in the campaign to warrant completion beyond the first level.             \n\n5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As you can tell from my total play time, I really want to provide a positive recommendation for this game but I cannot.  While the start of each level is enjoyable due to the early build and survival aspects of the game, the later hours of play are tedious.\n\nHere are some positives and negatives for this game:\n\nPositive : You will enjoy the challenge of the campaign for your first play through.\nNegative : You are literally dealing with the dumbest AI you will ever encounter in a game.  The dwarves will kill a creature and walk away from the loot that is dropped.  The dwarves will continue to fight a Guardian until they die because there was an object to gather near the Guardian rather than going to sleep due to low health.\nPositive : Some of the DLCs are quite good additions.  Look at their ratings to figure this out as it's pretty accurate.\nNegative : The lack of additional environments is very striking for a game that is this old.  They could easily add another four (4) biomes (forest, ice, desert, underground are currently in the campaign) and extend the campaign accordingly.  Adjust it for difficulty accordingly but it would make a lot more sense to do this and then charge $9.99 for the DLC than to let the original release langish.  They recently released a \"cosmetic DLC\" rather than adding content.  Unbelieveable.\n\nYou will enjoy it initially but you will quickly grow frustrated by the mentally challenged dwarves that populate your environment.  I hope some new actual content arrives otherwise I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "WAS a wonderful game, had it for years.  Then you introduced that floating ship.  i just put two transport thingys in the sky.  Why can't i turn it off.  Why don't i have the option to turn it OFF?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[EDIT]\nUnforgivable stupid design decisions. If you want to remove a world, it removes the 'campaign' and then you lose all progress. My god, what were these people thinking?\n0/10,\n\nIn principal, an interesting game. In practice, its really fun to play.\nHowever, there is one key problem. The tutorial is not a tutorial, it is the entire game. So, to unlock the second through fourth worlds, I have to play the entire game to the end, just so I can play the game to the end again. \nUm...no.\n\nDon't make the mistake of playing with the expansion packs turned on. It can make the \"tutorial\" painful beyond belief. To the devs - this is a simple fix (which you aren't going to do at this late hour are you?).\nI liked it, right up until it just got too frustrating. I would have loved to start on the 'next' world, but I cannot because I have to finish the \"tutorial\".\nOverall, I would rate a six out of ten. However the quick-bar based interaction is pathetic, which lost it a whole three points right there. If you wanted to have everything done via the quickbar (and I mean absolutely everything only works via this method) then you should have provided far more than ten slots. The other lost point is the pathetically laid out building screens which suffer from the same quickbar issue of \"We only want you to see ten things at a time, you cannot search, and good luck figuring out how all the stuff is grouped. Oh, and you cannot turn stuff off, so you'll see all the basic recipes even though you won't evern build them again.\"\nIn short, the UI is from the nineties, and the game suffers massively as a result.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The tutorial is really bad or unfinished, doesn't explain any of the basics and leaves you wondering. As if that wasn't bad enough, the main screen of the game is full of locked content that you have pay if you want to unlock.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fun game though i cant find myself playing it. progression is a little slow and quite a few things were hard to get a grip on. not a bad game but i cant see myself recommending it to others.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a fun little game that I try to enjoy when I just want to turn my brain off; the problem is that is impossible. This game is entirely not user friendly. I turn it on so that I can relax and do a little mining. Instead of spend 40 minutes adjusting the display settings on my computer, the UI settings on the game, troubleshoot the properties on the executable file... After all of that I get it so that the button to open the crafting menu is just barely visible at the bottom of my screen. Finally relief, I can play my game; wait no, when you actually click the crafting menu it opens up off screen. So then I try setting the game to full screen mode again. Now I cannot scroll in to see what the workers are doing. It is frozen in the full map mode. I fuss with that for a few minutes, figure out a way to scroll in to the furthest distance outside of full map mode, can't get any closer than that.\n\nThat is when I see my little worker swimming in place. Then I remembered why I quit playing this game about a year ago. Not only is the user interface basically unplayable but the little workers are completely incompetent. I guess I repressed the memory of seeing my workers repeatedly drowned because they got stuck swimming nowhere in one little square. Or all the times my little guys jumped to their death down a deep mine shaft when there was a ladder right at the entrance of the mine. I get that there is a climbing skill and a swimming skill for a reason; but I am no Michael Phelps and I can still manage to swim forward, albeit slowly, in water without drowning.\n\nI should not have to be a computer whiz to play the game at all, and I should not have to helicopter parent my workers to keep them alive when I finally get the game running correctly. The fact that these are common problems that the developers seem to have no interest in resolving is egregious.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Güzel bir fikrin kötü uygulaması. Yıllardır gelişmeyen UI, bir arama kutusunun bile eklenmemiş olması, öncelik ve karar vermede buglar...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I saw good reviews and thought the game must be worth trying. I can't believe how horrible the Dwarf AI is! The entire map is up/down of 1-2 tile cliffs, but if an enemy is up or down a level from them, they endlessly hop up/down and do nothing until they die, never recover health while sleeping, etc.\n\nWorst AI I've seen in a game in a very, very long time, and I have experience with literally hundreds of games including many of its competitors. Strongly recommend other games like Ratopia, Terraria, and many, many others with far better AI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cannot recommend this game. Details will follow eventually. Disregard the playtime: it is due to bad programming/game design and abusive achievements (that I tried getting).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really bad, poorly built and buggy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't possibly recommend this game for a few fundamental reasons. As this game acts like a dwarf fortress sim, where you can't control your dwarves, it leaves the game to control the characters instead, except the AI for them is absolutely broken, and pathfinding is a joke. There are times where you dwarf will be standing next to a ladder, but fall and hurt themselves for seemingly no reason at all instead of taking the ladder. If they are partially in water, they will swim next to an enemy and just die instead of swim away. \n\nOnly later did I discover a huge bug, which apparently has never been fixed, where all of your dwarves are all unnamed and broken, where you can't add skills. \n\nLosing dwarves because the game is fundamentally broken makes it hard to enjoy or recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A very basic colony sim with the trappings of a 2D action & exploration game like Terraria. \n\nFun for a time, but with too little in the way of automation (making colony management repetitive) and the lopsided difficulty (making the early game particularly frustrating) there’s little of value in the campaign to warrant completion beyond the first level.             \n\n5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As you can tell from my total play time, I really want to provide a positive recommendation for this game but I cannot.  While the start of each level is enjoyable due to the early build and survival aspects of the game, the later hours of play are tedious.\n\nHere are some positives and negatives for this game:\n\nPositive : You will enjoy the challenge of the campaign for your first play through.\nNegative : You are literally dealing with the dumbest AI you will ever encounter in a game.  The dwarves will kill a creature and walk away from the loot that is dropped.  The dwarves will continue to fight a Guardian until they die because there was an object to gather near the Guardian rather than going to sleep due to low health.\nPositive : Some of the DLCs are quite good additions.  Look at their ratings to figure this out as it's pretty accurate.\nNegative : The lack of additional environments is very striking for a game that is this old.  They could easily add another four (4) biomes (forest, ice, desert, underground are currently in the campaign) and extend the campaign accordingly.  Adjust it for difficulty accordingly but it would make a lot more sense to do this and then charge $9.99 for the DLC than to let the original release langish.  They recently released a \"cosmetic DLC\" rather than adding content.  Unbelieveable.\n\nYou will enjoy it initially but you will quickly grow frustrated by the mentally challenged dwarves that populate your environment.  I hope some new actual content arrives otherwise I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "WAS a wonderful game, had it for years.  Then you introduced that floating ship.  i just put two transport thingys in the sky.  Why can't i turn it off.  Why don't i have the option to turn it OFF?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[EDIT]\nUnforgivable stupid design decisions. If you want to remove a world, it removes the 'campaign' and then you lose all progress. My god, what were these people thinking?\n0/10,\n\nIn principal, an interesting game. In practice, its really fun to play.\nHowever, there is one key problem. The tutorial is not a tutorial, it is the entire game. So, to unlock the second through fourth worlds, I have to play the entire game to the end, just so I can play the game to the end again. \nUm...no.\n\nDon't make the mistake of playing with the expansion packs turned on. It can make the \"tutorial\" painful beyond belief. To the devs - this is a simple fix (which you aren't going to do at this late hour are you?).\nI liked it, right up until it just got too frustrating. I would have loved to start on the 'next' world, but I cannot because I have to finish the \"tutorial\".\nOverall, I would rate a six out of ten. However the quick-bar based interaction is pathetic, which lost it a whole three points right there. If you wanted to have everything done via the quickbar (and I mean absolutely everything only works via this method) then you should have provided far more than ten slots. The other lost point is the pathetically laid out building screens which suffer from the same quickbar issue of \"We only want you to see ten things at a time, you cannot search, and good luck figuring out how all the stuff is grouped. Oh, and you cannot turn stuff off, so you'll see all the basic recipes even though you won't evern build them again.\"\nIn short, the UI is from the nineties, and the game suffers massively as a result.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The tutorial is really bad or unfinished, doesn't explain any of the basics and leaves you wondering. As if that wasn't bad enough, the main screen of the game is full of locked content that you have pay if you want to unlock.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fun game though i cant find myself playing it. progression is a little slow and quite a few things were hard to get a grip on. not a bad game but i cant see myself recommending it to others.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a fun little game that I try to enjoy when I just want to turn my brain off; the problem is that is impossible. This game is entirely not user friendly. I turn it on so that I can relax and do a little mining. Instead of spend 40 minutes adjusting the display settings on my computer, the UI settings on the game, troubleshoot the properties on the executable file... After all of that I get it so that the button to open the crafting menu is just barely visible at the bottom of my screen. Finally relief, I can play my game; wait no, when you actually click the crafting menu it opens up off screen. So then I try setting the game to full screen mode again. Now I cannot scroll in to see what the workers are doing. It is frozen in the full map mode. I fuss with that for a few minutes, figure out a way to scroll in to the furthest distance outside of full map mode, can't get any closer than that.\n\nThat is when I see my little worker swimming in place. Then I remembered why I quit playing this game about a year ago. Not only is the user interface basically unplayable but the little workers are completely incompetent. I guess I repressed the memory of seeing my workers repeatedly drowned because they got stuck swimming nowhere in one little square. Or all the times my little guys jumped to their death down a deep mine shaft when there was a ladder right at the entrance of the mine. I get that there is a climbing skill and a swimming skill for a reason; but I am no Michael Phelps and I can still manage to swim forward, albeit slowly, in water without drowning.\n\nI should not have to be a computer whiz to play the game at all, and I should not have to helicopter parent my workers to keep them alive when I finally get the game running correctly. The fact that these are common problems that the developers seem to have no interest in resolving is egregious.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Güzel bir fikrin kötü uygulaması. Yıllardır gelişmeyen UI, bir arama kutusunun bile eklenmemiş olması, öncelik ve karar vermede buglar...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I saw good reviews and thought the game must be worth trying. I can't believe how horrible the Dwarf AI is! The entire map is up/down of 1-2 tile cliffs, but if an enemy is up or down a level from them, they endlessly hop up/down and do nothing until they die, never recover health while sleeping, etc.\n\nWorst AI I've seen in a game in a very, very long time, and I have experience with literally hundreds of games including many of its competitors. Strongly recommend other games like Ratopia, Terraria, and many, many others with far better AI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cannot recommend this game. Details will follow eventually. Disregard the playtime: it is due to bad programming/game design and abusive achievements (that I tried getting).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really bad, poorly built and buggy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't possibly recommend this game for a few fundamental reasons. As this game acts like a dwarf fortress sim, where you can't control your dwarves, it leaves the game to control the characters instead, except the AI for them is absolutely broken, and pathfinding is a joke. There are times where you dwarf will be standing next to a ladder, but fall and hurt themselves for seemingly no reason at all instead of taking the ladder. If they are partially in water, they will swim next to an enemy and just die instead of swim away. \n\nOnly later did I discover a huge bug, which apparently has never been fixed, where all of your dwarves are all unnamed and broken, where you can't add skills. \n\nLosing dwarves because the game is fundamentally broken makes it hard to enjoy or recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A very basic colony sim with the trappings of a 2D action & exploration game like Terraria. \n\nFun for a time, but with too little in the way of automation (making colony management repetitive) and the lopsided difficulty (making the early game particularly frustrating) there’s little of value in the campaign to warrant completion beyond the first level.             \n\n5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As you can tell from my total play time, I really want to provide a positive recommendation for this game but I cannot.  While the start of each level is enjoyable due to the early build and survival aspects of the game, the later hours of play are tedious.\n\nHere are some positives and negatives for this game:\n\nPositive : You will enjoy the challenge of the campaign for your first play through.\nNegative : You are literally dealing with the dumbest AI you will ever encounter in a game.  The dwarves will kill a creature and walk away from the loot that is dropped.  The dwarves will continue to fight a Guardian until they die because there was an object to gather near the Guardian rather than going to sleep due to low health.\nPositive : Some of the DLCs are quite good additions.  Look at their ratings to figure this out as it's pretty accurate.\nNegative : The lack of additional environments is very striking for a game that is this old.  They could easily add another four (4) biomes (forest, ice, desert, underground are currently in the campaign) and extend the campaign accordingly.  Adjust it for difficulty accordingly but it would make a lot more sense to do this and then charge $9.99 for the DLC than to let the original release langish.  They recently released a \"cosmetic DLC\" rather than adding content.  Unbelieveable.\n\nYou will enjoy it initially but you will quickly grow frustrated by the mentally challenged dwarves that populate your environment.  I hope some new actual content arrives otherwise I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "WAS a wonderful game, had it for years.  Then you introduced that floating ship.  i just put two transport thingys in the sky.  Why can't i turn it off.  Why don't i have the option to turn it OFF?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[EDIT]\nUnforgivable stupid design decisions. If you want to remove a world, it removes the 'campaign' and then you lose all progress. My god, what were these people thinking?\n0/10,\n\nIn principal, an interesting game. In practice, its really fun to play.\nHowever, there is one key problem. The tutorial is not a tutorial, it is the entire game. So, to unlock the second through fourth worlds, I have to play the entire game to the end, just so I can play the game to the end again. \nUm...no.\n\nDon't make the mistake of playing with the expansion packs turned on. It can make the \"tutorial\" painful beyond belief. To the devs - this is a simple fix (which you aren't going to do at this late hour are you?).\nI liked it, right up until it just got too frustrating. I would have loved to start on the 'next' world, but I cannot because I have to finish the \"tutorial\".\nOverall, I would rate a six out of ten. However the quick-bar based interaction is pathetic, which lost it a whole three points right there. If you wanted to have everything done via the quickbar (and I mean absolutely everything only works via this method) then you should have provided far more than ten slots. The other lost point is the pathetically laid out building screens which suffer from the same quickbar issue of \"We only want you to see ten things at a time, you cannot search, and good luck figuring out how all the stuff is grouped. Oh, and you cannot turn stuff off, so you'll see all the basic recipes even though you won't evern build them again.\"\nIn short, the UI is from the nineties, and the game suffers massively as a result.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The tutorial is really bad or unfinished, doesn't explain any of the basics and leaves you wondering. As if that wasn't bad enough, the main screen of the game is full of locked content that you have pay if you want to unlock.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fun game though i cant find myself playing it. progression is a little slow and quite a few things were hard to get a grip on. not a bad game but i cant see myself recommending it to others.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a fun little game that I try to enjoy when I just want to turn my brain off; the problem is that is impossible. This game is entirely not user friendly. I turn it on so that I can relax and do a little mining. Instead of spend 40 minutes adjusting the display settings on my computer, the UI settings on the game, troubleshoot the properties on the executable file... After all of that I get it so that the button to open the crafting menu is just barely visible at the bottom of my screen. Finally relief, I can play my game; wait no, when you actually click the crafting menu it opens up off screen. So then I try setting the game to full screen mode again. Now I cannot scroll in to see what the workers are doing. It is frozen in the full map mode. I fuss with that for a few minutes, figure out a way to scroll in to the furthest distance outside of full map mode, can't get any closer than that.\n\nThat is when I see my little worker swimming in place. Then I remembered why I quit playing this game about a year ago. Not only is the user interface basically unplayable but the little workers are completely incompetent. I guess I repressed the memory of seeing my workers repeatedly drowned because they got stuck swimming nowhere in one little square. Or all the times my little guys jumped to their death down a deep mine shaft when there was a ladder right at the entrance of the mine. I get that there is a climbing skill and a swimming skill for a reason; but I am no Michael Phelps and I can still manage to swim forward, albeit slowly, in water without drowning.\n\nI should not have to be a computer whiz to play the game at all, and I should not have to helicopter parent my workers to keep them alive when I finally get the game running correctly. The fact that these are common problems that the developers seem to have no interest in resolving is egregious.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Güzel bir fikrin kötü uygulaması. Yıllardır gelişmeyen UI, bir arama kutusunun bile eklenmemiş olması, öncelik ve karar vermede buglar...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I saw good reviews and thought the game must be worth trying. I can't believe how horrible the Dwarf AI is! The entire map is up/down of 1-2 tile cliffs, but if an enemy is up or down a level from them, they endlessly hop up/down and do nothing until they die, never recover health while sleeping, etc.\n\nWorst AI I've seen in a game in a very, very long time, and I have experience with literally hundreds of games including many of its competitors. Strongly recommend other games like Ratopia, Terraria, and many, many others with far better AI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cannot recommend this game. Details will follow eventually. Disregard the playtime: it is due to bad programming/game design and abusive achievements (that I tried getting).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really bad, poorly built and buggy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't possibly recommend this game for a few fundamental reasons. As this game acts like a dwarf fortress sim, where you can't control your dwarves, it leaves the game to control the characters instead, except the AI for them is absolutely broken, and pathfinding is a joke. There are times where you dwarf will be standing next to a ladder, but fall and hurt themselves for seemingly no reason at all instead of taking the ladder. If they are partially in water, they will swim next to an enemy and just die instead of swim away. \n\nOnly later did I discover a huge bug, which apparently has never been fixed, where all of your dwarves are all unnamed and broken, where you can't add skills. \n\nLosing dwarves because the game is fundamentally broken makes it hard to enjoy or recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A very basic colony sim with the trappings of a 2D action & exploration game like Terraria. \n\nFun for a time, but with too little in the way of automation (making colony management repetitive) and the lopsided difficulty (making the early game particularly frustrating) there’s little of value in the campaign to warrant completion beyond the first level.             \n\n5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As you can tell from my total play time, I really want to provide a positive recommendation for this game but I cannot.  While the start of each level is enjoyable due to the early build and survival aspects of the game, the later hours of play are tedious.\n\nHere are some positives and negatives for this game:\n\nPositive : You will enjoy the challenge of the campaign for your first play through.\nNegative : You are literally dealing with the dumbest AI you will ever encounter in a game.  The dwarves will kill a creature and walk away from the loot that is dropped.  The dwarves will continue to fight a Guardian until they die because there was an object to gather near the Guardian rather than going to sleep due to low health.\nPositive : Some of the DLCs are quite good additions.  Look at their ratings to figure this out as it's pretty accurate.\nNegative : The lack of additional environments is very striking for a game that is this old.  They could easily add another four (4) biomes (forest, ice, desert, underground are currently in the campaign) and extend the campaign accordingly.  Adjust it for difficulty accordingly but it would make a lot more sense to do this and then charge $9.99 for the DLC than to let the original release langish.  They recently released a \"cosmetic DLC\" rather than adding content.  Unbelieveable.\n\nYou will enjoy it initially but you will quickly grow frustrated by the mentally challenged dwarves that populate your environment.  I hope some new actual content arrives otherwise I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "WAS a wonderful game, had it for years.  Then you introduced that floating ship.  i just put two transport thingys in the sky.  Why can't i turn it off.  Why don't i have the option to turn it OFF?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[EDIT]\nUnforgivable stupid design decisions. If you want to remove a world, it removes the 'campaign' and then you lose all progress. My god, what were these people thinking?\n0/10,\n\nIn principal, an interesting game. In practice, its really fun to play.\nHowever, there is one key problem. The tutorial is not a tutorial, it is the entire game. So, to unlock the second through fourth worlds, I have to play the entire game to the end, just so I can play the game to the end again. \nUm...no.\n\nDon't make the mistake of playing with the expansion packs turned on. It can make the \"tutorial\" painful beyond belief. To the devs - this is a simple fix (which you aren't going to do at this late hour are you?).\nI liked it, right up until it just got too frustrating. I would have loved to start on the 'next' world, but I cannot because I have to finish the \"tutorial\".\nOverall, I would rate a six out of ten. However the quick-bar based interaction is pathetic, which lost it a whole three points right there. If you wanted to have everything done via the quickbar (and I mean absolutely everything only works via this method) then you should have provided far more than ten slots. The other lost point is the pathetically laid out building screens which suffer from the same quickbar issue of \"We only want you to see ten things at a time, you cannot search, and good luck figuring out how all the stuff is grouped. Oh, and you cannot turn stuff off, so you'll see all the basic recipes even though you won't evern build them again.\"\nIn short, the UI is from the nineties, and the game suffers massively as a result.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The tutorial is really bad or unfinished, doesn't explain any of the basics and leaves you wondering. As if that wasn't bad enough, the main screen of the game is full of locked content that you have pay if you want to unlock.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fun game though i cant find myself playing it. progression is a little slow and quite a few things were hard to get a grip on. not a bad game but i cant see myself recommending it to others.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a fun little game that I try to enjoy when I just want to turn my brain off; the problem is that is impossible. This game is entirely not user friendly. I turn it on so that I can relax and do a little mining. Instead of spend 40 minutes adjusting the display settings on my computer, the UI settings on the game, troubleshoot the properties on the executable file... After all of that I get it so that the button to open the crafting menu is just barely visible at the bottom of my screen. Finally relief, I can play my game; wait no, when you actually click the crafting menu it opens up off screen. So then I try setting the game to full screen mode again. Now I cannot scroll in to see what the workers are doing. It is frozen in the full map mode. I fuss with that for a few minutes, figure out a way to scroll in to the furthest distance outside of full map mode, can't get any closer than that.\n\nThat is when I see my little worker swimming in place. Then I remembered why I quit playing this game about a year ago. Not only is the user interface basically unplayable but the little workers are completely incompetent. I guess I repressed the memory of seeing my workers repeatedly drowned because they got stuck swimming nowhere in one little square. Or all the times my little guys jumped to their death down a deep mine shaft when there was a ladder right at the entrance of the mine. I get that there is a climbing skill and a swimming skill for a reason; but I am no Michael Phelps and I can still manage to swim forward, albeit slowly, in water without drowning.\n\nI should not have to be a computer whiz to play the game at all, and I should not have to helicopter parent my workers to keep them alive when I finally get the game running correctly. The fact that these are common problems that the developers seem to have no interest in resolving is egregious.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Güzel bir fikrin kötü uygulaması. Yıllardır gelişmeyen UI, bir arama kutusunun bile eklenmemiş olması, öncelik ve karar vermede buglar...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I saw good reviews and thought the game must be worth trying. I can't believe how horrible the Dwarf AI is! The entire map is up/down of 1-2 tile cliffs, but if an enemy is up or down a level from them, they endlessly hop up/down and do nothing until they die, never recover health while sleeping, etc.\n\nWorst AI I've seen in a game in a very, very long time, and I have experience with literally hundreds of games including many of its competitors. Strongly recommend other games like Ratopia, Terraria, and many, many others with far better AI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cannot recommend this game. Details will follow eventually. Disregard the playtime: it is due to bad programming/game design and abusive achievements (that I tried getting).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really bad, poorly built and buggy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't possibly recommend this game for a few fundamental reasons. As this game acts like a dwarf fortress sim, where you can't control your dwarves, it leaves the game to control the characters instead, except the AI for them is absolutely broken, and pathfinding is a joke. There are times where you dwarf will be standing next to a ladder, but fall and hurt themselves for seemingly no reason at all instead of taking the ladder. If they are partially in water, they will swim next to an enemy and just die instead of swim away. \n\nOnly later did I discover a huge bug, which apparently has never been fixed, where all of your dwarves are all unnamed and broken, where you can't add skills. \n\nLosing dwarves because the game is fundamentally broken makes it hard to enjoy or recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A very basic colony sim with the trappings of a 2D action & exploration game like Terraria. \n\nFun for a time, but with too little in the way of automation (making colony management repetitive) and the lopsided difficulty (making the early game particularly frustrating) there’s little of value in the campaign to warrant completion beyond the first level.             \n\n5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As you can tell from my total play time, I really want to provide a positive recommendation for this game but I cannot.  While the start of each level is enjoyable due to the early build and survival aspects of the game, the later hours of play are tedious.\n\nHere are some positives and negatives for this game:\n\nPositive : You will enjoy the challenge of the campaign for your first play through.\nNegative : You are literally dealing with the dumbest AI you will ever encounter in a game.  The dwarves will kill a creature and walk away from the loot that is dropped.  The dwarves will continue to fight a Guardian until they die because there was an object to gather near the Guardian rather than going to sleep due to low health.\nPositive : Some of the DLCs are quite good additions.  Look at their ratings to figure this out as it's pretty accurate.\nNegative : The lack of additional environments is very striking for a game that is this old.  They could easily add another four (4) biomes (forest, ice, desert, underground are currently in the campaign) and extend the campaign accordingly.  Adjust it for difficulty accordingly but it would make a lot more sense to do this and then charge $9.99 for the DLC than to let the original release langish.  They recently released a \"cosmetic DLC\" rather than adding content.  Unbelieveable.\n\nYou will enjoy it initially but you will quickly grow frustrated by the mentally challenged dwarves that populate your environment.  I hope some new actual content arrives otherwise I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "WAS a wonderful game, had it for years.  Then you introduced that floating ship.  i just put two transport thingys in the sky.  Why can't i turn it off.  Why don't i have the option to turn it OFF?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[EDIT]\nUnforgivable stupid design decisions. If you want to remove a world, it removes the 'campaign' and then you lose all progress. My god, what were these people thinking?\n0/10,\n\nIn principal, an interesting game. In practice, its really fun to play.\nHowever, there is one key problem. The tutorial is not a tutorial, it is the entire game. So, to unlock the second through fourth worlds, I have to play the entire game to the end, just so I can play the game to the end again. \nUm...no.\n\nDon't make the mistake of playing with the expansion packs turned on. It can make the \"tutorial\" painful beyond belief. To the devs - this is a simple fix (which you aren't going to do at this late hour are you?).\nI liked it, right up until it just got too frustrating. I would have loved to start on the 'next' world, but I cannot because I have to finish the \"tutorial\".\nOverall, I would rate a six out of ten. However the quick-bar based interaction is pathetic, which lost it a whole three points right there. If you wanted to have everything done via the quickbar (and I mean absolutely everything only works via this method) then you should have provided far more than ten slots. The other lost point is the pathetically laid out building screens which suffer from the same quickbar issue of \"We only want you to see ten things at a time, you cannot search, and good luck figuring out how all the stuff is grouped. Oh, and you cannot turn stuff off, so you'll see all the basic recipes even though you won't evern build them again.\"\nIn short, the UI is from the nineties, and the game suffers massively as a result.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The tutorial is really bad or unfinished, doesn't explain any of the basics and leaves you wondering. As if that wasn't bad enough, the main screen of the game is full of locked content that you have pay if you want to unlock.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fun game though i cant find myself playing it. progression is a little slow and quite a few things were hard to get a grip on. not a bad game but i cant see myself recommending it to others.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a fun little game that I try to enjoy when I just want to turn my brain off; the problem is that is impossible. This game is entirely not user friendly. I turn it on so that I can relax and do a little mining. Instead of spend 40 minutes adjusting the display settings on my computer, the UI settings on the game, troubleshoot the properties on the executable file... After all of that I get it so that the button to open the crafting menu is just barely visible at the bottom of my screen. Finally relief, I can play my game; wait no, when you actually click the crafting menu it opens up off screen. So then I try setting the game to full screen mode again. Now I cannot scroll in to see what the workers are doing. It is frozen in the full map mode. I fuss with that for a few minutes, figure out a way to scroll in to the furthest distance outside of full map mode, can't get any closer than that.\n\nThat is when I see my little worker swimming in place. Then I remembered why I quit playing this game about a year ago. Not only is the user interface basically unplayable but the little workers are completely incompetent. I guess I repressed the memory of seeing my workers repeatedly drowned because they got stuck swimming nowhere in one little square. Or all the times my little guys jumped to their death down a deep mine shaft when there was a ladder right at the entrance of the mine. I get that there is a climbing skill and a swimming skill for a reason; but I am no Michael Phelps and I can still manage to swim forward, albeit slowly, in water without drowning.\n\nI should not have to be a computer whiz to play the game at all, and I should not have to helicopter parent my workers to keep them alive when I finally get the game running correctly. The fact that these are common problems that the developers seem to have no interest in resolving is egregious.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Güzel bir fikrin kötü uygulaması. Yıllardır gelişmeyen UI, bir arama kutusunun bile eklenmemiş olması, öncelik ve karar vermede buglar...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I saw good reviews and thought the game must be worth trying. I can't believe how horrible the Dwarf AI is! The entire map is up/down of 1-2 tile cliffs, but if an enemy is up or down a level from them, they endlessly hop up/down and do nothing until they die, never recover health while sleeping, etc.\n\nWorst AI I've seen in a game in a very, very long time, and I have experience with literally hundreds of games including many of its competitors. Strongly recommend other games like Ratopia, Terraria, and many, many others with far better AI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cannot recommend this game. Details will follow eventually. Disregard the playtime: it is due to bad programming/game design and abusive achievements (that I tried getting).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really bad, poorly built and buggy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't possibly recommend this game for a few fundamental reasons. As this game acts like a dwarf fortress sim, where you can't control your dwarves, it leaves the game to control the characters instead, except the AI for them is absolutely broken, and pathfinding is a joke. There are times where you dwarf will be standing next to a ladder, but fall and hurt themselves for seemingly no reason at all instead of taking the ladder. If they are partially in water, they will swim next to an enemy and just die instead of swim away. \n\nOnly later did I discover a huge bug, which apparently has never been fixed, where all of your dwarves are all unnamed and broken, where you can't add skills. \n\nLosing dwarves because the game is fundamentally broken makes it hard to enjoy or recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A very basic colony sim with the trappings of a 2D action & exploration game like Terraria. \n\nFun for a time, but with too little in the way of automation (making colony management repetitive) and the lopsided difficulty (making the early game particularly frustrating) there’s little of value in the campaign to warrant completion beyond the first level.             \n\n5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As you can tell from my total play time, I really want to provide a positive recommendation for this game but I cannot.  While the start of each level is enjoyable due to the early build and survival aspects of the game, the later hours of play are tedious.\n\nHere are some positives and negatives for this game:\n\nPositive : You will enjoy the challenge of the campaign for your first play through.\nNegative : You are literally dealing with the dumbest AI you will ever encounter in a game.  The dwarves will kill a creature and walk away from the loot that is dropped.  The dwarves will continue to fight a Guardian until they die because there was an object to gather near the Guardian rather than going to sleep due to low health.\nPositive : Some of the DLCs are quite good additions.  Look at their ratings to figure this out as it's pretty accurate.\nNegative : The lack of additional environments is very striking for a game that is this old.  They could easily add another four (4) biomes (forest, ice, desert, underground are currently in the campaign) and extend the campaign accordingly.  Adjust it for difficulty accordingly but it would make a lot more sense to do this and then charge $9.99 for the DLC than to let the original release langish.  They recently released a \"cosmetic DLC\" rather than adding content.  Unbelieveable.\n\nYou will enjoy it initially but you will quickly grow frustrated by the mentally challenged dwarves that populate your environment.  I hope some new actual content arrives otherwise I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "WAS a wonderful game, had it for years.  Then you introduced that floating ship.  i just put two transport thingys in the sky.  Why can't i turn it off.  Why don't i have the option to turn it OFF?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[EDIT]\nUnforgivable stupid design decisions. If you want to remove a world, it removes the 'campaign' and then you lose all progress. My god, what were these people thinking?\n0/10,\n\nIn principal, an interesting game. In practice, its really fun to play.\nHowever, there is one key problem. The tutorial is not a tutorial, it is the entire game. So, to unlock the second through fourth worlds, I have to play the entire game to the end, just so I can play the game to the end again. \nUm...no.\n\nDon't make the mistake of playing with the expansion packs turned on. It can make the \"tutorial\" painful beyond belief. To the devs - this is a simple fix (which you aren't going to do at this late hour are you?).\nI liked it, right up until it just got too frustrating. I would have loved to start on the 'next' world, but I cannot because I have to finish the \"tutorial\".\nOverall, I would rate a six out of ten. However the quick-bar based interaction is pathetic, which lost it a whole three points right there. If you wanted to have everything done via the quickbar (and I mean absolutely everything only works via this method) then you should have provided far more than ten slots. The other lost point is the pathetically laid out building screens which suffer from the same quickbar issue of \"We only want you to see ten things at a time, you cannot search, and good luck figuring out how all the stuff is grouped. Oh, and you cannot turn stuff off, so you'll see all the basic recipes even though you won't evern build them again.\"\nIn short, the UI is from the nineties, and the game suffers massively as a result.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The tutorial is really bad or unfinished, doesn't explain any of the basics and leaves you wondering. As if that wasn't bad enough, the main screen of the game is full of locked content that you have pay if you want to unlock.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fun game though i cant find myself playing it. progression is a little slow and quite a few things were hard to get a grip on. not a bad game but i cant see myself recommending it to others.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a fun little game that I try to enjoy when I just want to turn my brain off; the problem is that is impossible. This game is entirely not user friendly. I turn it on so that I can relax and do a little mining. Instead of spend 40 minutes adjusting the display settings on my computer, the UI settings on the game, troubleshoot the properties on the executable file... After all of that I get it so that the button to open the crafting menu is just barely visible at the bottom of my screen. Finally relief, I can play my game; wait no, when you actually click the crafting menu it opens up off screen. So then I try setting the game to full screen mode again. Now I cannot scroll in to see what the workers are doing. It is frozen in the full map mode. I fuss with that for a few minutes, figure out a way to scroll in to the furthest distance outside of full map mode, can't get any closer than that.\n\nThat is when I see my little worker swimming in place. Then I remembered why I quit playing this game about a year ago. Not only is the user interface basically unplayable but the little workers are completely incompetent. I guess I repressed the memory of seeing my workers repeatedly drowned because they got stuck swimming nowhere in one little square. Or all the times my little guys jumped to their death down a deep mine shaft when there was a ladder right at the entrance of the mine. I get that there is a climbing skill and a swimming skill for a reason; but I am no Michael Phelps and I can still manage to swim forward, albeit slowly, in water without drowning.\n\nI should not have to be a computer whiz to play the game at all, and I should not have to helicopter parent my workers to keep them alive when I finally get the game running correctly. The fact that these are common problems that the developers seem to have no interest in resolving is egregious.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Güzel bir fikrin kötü uygulaması. Yıllardır gelişmeyen UI, bir arama kutusunun bile eklenmemiş olması, öncelik ve karar vermede buglar...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I saw good reviews and thought the game must be worth trying. I can't believe how horrible the Dwarf AI is! The entire map is up/down of 1-2 tile cliffs, but if an enemy is up or down a level from them, they endlessly hop up/down and do nothing until they die, never recover health while sleeping, etc.\n\nWorst AI I've seen in a game in a very, very long time, and I have experience with literally hundreds of games including many of its competitors. Strongly recommend other games like Ratopia, Terraria, and many, many others with far better AI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cannot recommend this game. Details will follow eventually. Disregard the playtime: it is due to bad programming/game design and abusive achievements (that I tried getting).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really bad, poorly built and buggy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't possibly recommend this game for a few fundamental reasons. As this game acts like a dwarf fortress sim, where you can't control your dwarves, it leaves the game to control the characters instead, except the AI for them is absolutely broken, and pathfinding is a joke. There are times where you dwarf will be standing next to a ladder, but fall and hurt themselves for seemingly no reason at all instead of taking the ladder. If they are partially in water, they will swim next to an enemy and just die instead of swim away. \n\nOnly later did I discover a huge bug, which apparently has never been fixed, where all of your dwarves are all unnamed and broken, where you can't add skills. \n\nLosing dwarves because the game is fundamentally broken makes it hard to enjoy or recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A very basic colony sim with the trappings of a 2D action & exploration game like Terraria. \n\nFun for a time, but with too little in the way of automation (making colony management repetitive) and the lopsided difficulty (making the early game particularly frustrating) there’s little of value in the campaign to warrant completion beyond the first level.             \n\n5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As you can tell from my total play time, I really want to provide a positive recommendation for this game but I cannot.  While the start of each level is enjoyable due to the early build and survival aspects of the game, the later hours of play are tedious.\n\nHere are some positives and negatives for this game:\n\nPositive : You will enjoy the challenge of the campaign for your first play through.\nNegative : You are literally dealing with the dumbest AI you will ever encounter in a game.  The dwarves will kill a creature and walk away from the loot that is dropped.  The dwarves will continue to fight a Guardian until they die because there was an object to gather near the Guardian rather than going to sleep due to low health.\nPositive : Some of the DLCs are quite good additions.  Look at their ratings to figure this out as it's pretty accurate.\nNegative : The lack of additional environments is very striking for a game that is this old.  They could easily add another four (4) biomes (forest, ice, desert, underground are currently in the campaign) and extend the campaign accordingly.  Adjust it for difficulty accordingly but it would make a lot more sense to do this and then charge $9.99 for the DLC than to let the original release langish.  They recently released a \"cosmetic DLC\" rather than adding content.  Unbelieveable.\n\nYou will enjoy it initially but you will quickly grow frustrated by the mentally challenged dwarves that populate your environment.  I hope some new actual content arrives otherwise I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "WAS a wonderful game, had it for years.  Then you introduced that floating ship.  i just put two transport thingys in the sky.  Why can't i turn it off.  Why don't i have the option to turn it OFF?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[EDIT]\nUnforgivable stupid design decisions. If you want to remove a world, it removes the 'campaign' and then you lose all progress. My god, what were these people thinking?\n0/10,\n\nIn principal, an interesting game. In practice, its really fun to play.\nHowever, there is one key problem. The tutorial is not a tutorial, it is the entire game. So, to unlock the second through fourth worlds, I have to play the entire game to the end, just so I can play the game to the end again. \nUm...no.\n\nDon't make the mistake of playing with the expansion packs turned on. It can make the \"tutorial\" painful beyond belief. To the devs - this is a simple fix (which you aren't going to do at this late hour are you?).\nI liked it, right up until it just got too frustrating. I would have loved to start on the 'next' world, but I cannot because I have to finish the \"tutorial\".\nOverall, I would rate a six out of ten. However the quick-bar based interaction is pathetic, which lost it a whole three points right there. If you wanted to have everything done via the quickbar (and I mean absolutely everything only works via this method) then you should have provided far more than ten slots. The other lost point is the pathetically laid out building screens which suffer from the same quickbar issue of \"We only want you to see ten things at a time, you cannot search, and good luck figuring out how all the stuff is grouped. Oh, and you cannot turn stuff off, so you'll see all the basic recipes even though you won't evern build them again.\"\nIn short, the UI is from the nineties, and the game suffers massively as a result.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The tutorial is really bad or unfinished, doesn't explain any of the basics and leaves you wondering. As if that wasn't bad enough, the main screen of the game is full of locked content that you have pay if you want to unlock.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fun game though i cant find myself playing it. progression is a little slow and quite a few things were hard to get a grip on. not a bad game but i cant see myself recommending it to others.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a fun little game that I try to enjoy when I just want to turn my brain off; the problem is that is impossible. This game is entirely not user friendly. I turn it on so that I can relax and do a little mining. Instead of spend 40 minutes adjusting the display settings on my computer, the UI settings on the game, troubleshoot the properties on the executable file... After all of that I get it so that the button to open the crafting menu is just barely visible at the bottom of my screen. Finally relief, I can play my game; wait no, when you actually click the crafting menu it opens up off screen. So then I try setting the game to full screen mode again. Now I cannot scroll in to see what the workers are doing. It is frozen in the full map mode. I fuss with that for a few minutes, figure out a way to scroll in to the furthest distance outside of full map mode, can't get any closer than that.\n\nThat is when I see my little worker swimming in place. Then I remembered why I quit playing this game about a year ago. Not only is the user interface basically unplayable but the little workers are completely incompetent. I guess I repressed the memory of seeing my workers repeatedly drowned because they got stuck swimming nowhere in one little square. Or all the times my little guys jumped to their death down a deep mine shaft when there was a ladder right at the entrance of the mine. I get that there is a climbing skill and a swimming skill for a reason; but I am no Michael Phelps and I can still manage to swim forward, albeit slowly, in water without drowning.\n\nI should not have to be a computer whiz to play the game at all, and I should not have to helicopter parent my workers to keep them alive when I finally get the game running correctly. The fact that these are common problems that the developers seem to have no interest in resolving is egregious.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Güzel bir fikrin kötü uygulaması. Yıllardır gelişmeyen UI, bir arama kutusunun bile eklenmemiş olması, öncelik ve karar vermede buglar...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I saw good reviews and thought the game must be worth trying. I can't believe how horrible the Dwarf AI is! The entire map is up/down of 1-2 tile cliffs, but if an enemy is up or down a level from them, they endlessly hop up/down and do nothing until they die, never recover health while sleeping, etc.\n\nWorst AI I've seen in a game in a very, very long time, and I have experience with literally hundreds of games including many of its competitors. Strongly recommend other games like Ratopia, Terraria, and many, many others with far better AI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cannot recommend this game. Details will follow eventually. Disregard the playtime: it is due to bad programming/game design and abusive achievements (that I tried getting).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really bad, poorly built and buggy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't possibly recommend this game for a few fundamental reasons. As this game acts like a dwarf fortress sim, where you can't control your dwarves, it leaves the game to control the characters instead, except the AI for them is absolutely broken, and pathfinding is a joke. There are times where you dwarf will be standing next to a ladder, but fall and hurt themselves for seemingly no reason at all instead of taking the ladder. If they are partially in water, they will swim next to an enemy and just die instead of swim away. \n\nOnly later did I discover a huge bug, which apparently has never been fixed, where all of your dwarves are all unnamed and broken, where you can't add skills. \n\nLosing dwarves because the game is fundamentally broken makes it hard to enjoy or recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A very basic colony sim with the trappings of a 2D action & exploration game like Terraria. \n\nFun for a time, but with too little in the way of automation (making colony management repetitive) and the lopsided difficulty (making the early game particularly frustrating) there’s little of value in the campaign to warrant completion beyond the first level.             \n\n5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As you can tell from my total play time, I really want to provide a positive recommendation for this game but I cannot.  While the start of each level is enjoyable due to the early build and survival aspects of the game, the later hours of play are tedious.\n\nHere are some positives and negatives for this game:\n\nPositive : You will enjoy the challenge of the campaign for your first play through.\nNegative : You are literally dealing with the dumbest AI you will ever encounter in a game.  The dwarves will kill a creature and walk away from the loot that is dropped.  The dwarves will continue to fight a Guardian until they die because there was an object to gather near the Guardian rather than going to sleep due to low health.\nPositive : Some of the DLCs are quite good additions.  Look at their ratings to figure this out as it's pretty accurate.\nNegative : The lack of additional environments is very striking for a game that is this old.  They could easily add another four (4) biomes (forest, ice, desert, underground are currently in the campaign) and extend the campaign accordingly.  Adjust it for difficulty accordingly but it would make a lot more sense to do this and then charge $9.99 for the DLC than to let the original release langish.  They recently released a \"cosmetic DLC\" rather than adding content.  Unbelieveable.\n\nYou will enjoy it initially but you will quickly grow frustrated by the mentally challenged dwarves that populate your environment.  I hope some new actual content arrives otherwise I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "WAS a wonderful game, had it for years.  Then you introduced that floating ship.  i just put two transport thingys in the sky.  Why can't i turn it off.  Why don't i have the option to turn it OFF?",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}