{
  "positive": [
    {
      "review": "A fun addictive game, It's the only game i have been playing for weeks now, Demolishing houses and slowly upgrading your company is enjoyable and well balanced, you feel like you've hit gold sometimes when you find expensive items for your warehouse, the warehouse ordering system is fun and reminds me of when i used to work in a warehouse picking and packing items to sell, the dev listens to his community and adds the features that are requested when its possible / feasible to do so.\n\nIt's sad to see some negative reviews about how the game can be repetitive, at the end of the day your buying a game about deconstructing houses, its like you buying a game about PC repair and then complaining that all you do is PC repairs lol",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Good game to kill time with, and not have to think too much about while you are doing it. I would deff recommend to anyone that likes simulator games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely loved this game. There’s something oddly satisfying about standing in the middle of my little warehouse, deciding how everything should be arranged. And once you get the hang of it, the deconstruction is genuinely fun. Best of all, the devs are still actively polishing and improving it, which makes the whole experience feel even better.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Nicely made game and relaxing and fun if you have some rage good game to buy as you can go hulk smashing for no extra pain or money I would recommend this game very easy to play nothing to hard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE this game; with a few caveats. The deconstruction is super fun, The warehouse customization is really fun even to micromanage and rearrange for your most optimal setup. \n\nThe Tool and upgrade system is a great concept, But I feel it was implemented a bit poorly. I know this isn't a huge game with no early middle and endgame sort of play, But I would love if the tool system could be expanded upon and customized perhaps to make them more efficient at some things while making them less efficient for others.\n\nAs for the Things that could use some work; the placement system is... well its buggy as hell and not to mention objects you place LOVE to bounce around and either fly away and or rocket to the moon. I also think the way that the flooring of the houses/trailers/apartments count as deconstruction requirements expecially considering they are A unsalvageable and worthless and B they barely fill your constructor waste bag at all despite looking like it should fill quite a bit more, especially considering a small potted plant can fill it more.\n\nAlso please please pleaseeeee add the ability to rename your company after its creation, maybe add some company colors as well as a simple logo designer? Furthermore what the hell is the point of the garages,  so far the only thing i can think of that they do is act as a storage facility  for items you can't put up on shelves just yet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its easy to understand, Straightforward and nice niche fun. Its bugs are mainly it having trouble with fullscreen and windowed mode switching when your adjusting that stuff. Also it slows down if your playing another game in the background by chance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I fully completed the game, had a lot of fun with it. Only the last hours where a bit of a grind for the final achievement. Otherwise, for people who enjoy a bit of braindead deconstructing, i would recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game play loop is ok. It can get old but it's worth it for the price",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The perfect game to just chill and destroy stuff, Very satisfying to do. And extremely fun at the same time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This Games is awesome... Great game play ... Awesome Updates... contracts are challenging and still completable in the time given ... always extra challenges to complete!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really loving the game its a very laid back involving game to play. It’s still early stages I hope they will add to the game more houses and other stuff . Eg radiators could be added, that way you could take apart and sold in warehouse. The destruction in this is so much fun . You really get into the whole business side of it very early on. The only negative is it’s pricing for contracts and some of the one day contracts are not worth it as the day goes too quick in the game. As it’s early days these I hope will be looked at in future updates. Love the game play and I would recommend it if you want a fun chilled game to make the hours fly by. If you want action this is not game for you. I like the grinding games so it suits my play style.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly really enjoy this game, it's a fun time killing game, i sometimes get lost for hours playing it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It feels like they are doing something no other game has tried before and its working",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that is basically just smashing things with a permit and praying your computer can survive the physics engine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun time killer. Would one hundred percent recommend. My only dislike is that taking apart some items can feel a little numbing during long play sessions (I dread the kitchen cabinets).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game 10/10 would play any day of the week. Hope they add more or game 2 will be even better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, lots to do. with further updates i think it could have some good replay ability. id say consider adding a few things:\r\nDrivers to purchase- bring an extra vehicle or two. \r\n\r\npotentially even larger vehicles - longer box trucks/semi's (maybe have to purchase a CDL)\r\n\r\nlarger warehouse upgrades. if i want to keep a minimum of 6 items in stock- per item, that alone will be cramped. makes it hard to keep large inventory.\r\n\r\nbetter stock visibility. everything is rather spread out on the list. maybe add some sort of search function/filter. also potentially a \"phone\" or something to look at what is in the warehouse while at a jobsite. negates bringing items back that are unneeded. \r\n\r\npotentially a trash bin to get rid of excess stock (i might be dumb and just havent figured this part out)\r\n\r\nsorting - adding the ability to give a shelf an number. (ex A-1, A-4, B-3, etc) to further help with easily locating product. (sort've like large big box retailers do)\r\n\r\nmaybe in future expansions- add larger structures like warehouses, civil buildings, theatres etc. (maybe even warehouses at different locations to store more stuff. with a courier to bring product from warehouse to warehouse.)\r\n\r\nthese are just a few ideas ive had while playing. overall i've thoroughly enojyed the game and even \"beat\" it within a few days. 10/10 would purchase again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had this game since launch and i've enjoyed it so much! Something about destroying a house feels so good and satisfying!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy titles like Ship Graveyard Simulator 2, House Flipper, or Contract Ville, then Deconstruction Simulator is well worth your time. Slip on your hard hat, grab your hammer, and dive into a satisfying blend of demolition and management gameplay.\r\nThe developers have been proactive since launch, quickly addressing issues and steadily rolling out new features that enhance the experience. Visually, the game stands out compared to many others in the genre, with environments that feel detailed and immersive.\r\nBeyond the demolition work, the business management aspect adds real depth—encouraging you to recycle and upcycle materials from your breakdowns while building a thriving enterprise. It’s a rewarding loop that keeps you coming back for more.\r\nOverall, Deconstruction Simulator is great fun and an easy recommendation for fans of life sims and job sims alike.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a cozy game. It has some flaws, sure, but it's enjoyable and a perfect game to relax with. Here are some things I like and dislike:\r\n+ Destruction\r\n+ Physics\r\n+ Stacking and the choices of what to bring\r\n- Warehouse and selling inventory\r\n- No clear progression (even at top rep, you only get offered low-rep jobs that pay crap)\r\n- Selling furniture and materials isn't worth the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It would be nice to see where you can pull up the floors like you do the walls. I love the deconstruction game overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I expected a game where I can destroy things, but it is not just like that. It is so many more. You literally run your own company, including the demolition of buldings, but also reselling goods and materials.\n\nThe levels are made lovely with many details!\n\nOnly \"minus\": the game has some pretty high requirements to your hardware. Depending on how ultra you set your configuration, it can have lags.\n\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10\n☐ 11 would click again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is really dynamic, and it's been receiving quite frequent updates + optomizations! It's really fun, and I've only noticed a couple glitches (which were not game-breaking). I have had the fatal error bit show up once, but it was easily fixed by going into the game properties (through steam), and validating the integrity of the files^^ Overall, really solid game, defintely worth the money, and I'll edit this review if my opinon changes at any point!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good but has room to improve, a TLDR would be, 7/10, has easy achievements to get and has roughly 30hrs of gameplay to complete but you will have seen everything it has to offer within the first 10hrs. \r\n\r\nI find myself spending less time on this game than other job simulators and it's kind of hard to pinpoint as to why when this game is up my alley. I think it's a multitude of factors but mainly that the upgrade system is a bit lacking and it doesn't take very long to get everything.  There also isn't much variety in terms of the items you can resell or the houses themselves, everything feels very similar. The game itself is fine, it does what it sets out to do and while it is on UE5 it runs pretty ok on a 3060 12gb. \r\n\r\nThe gameplay consists of a few main jobs/features. Taking jobs that have you either removing walls, furniture and/or demolishing the house. Managing your warehouse of items that you've taken from jobs that clients didn't want and then fulfilling orders for said items. \r\n\r\nUltimately the game is fun to play for a handful of hours, if you like job simulators you'll probably like this one too. It really just needs more complexity and depth to make it that much better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so much fun I can't stop playing it and there is so much more that can be added to make it even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It could certainly use some improvements on the job descriptions/stories, but it has a solid tutorial and is very fun to play. I've enjoyed expanding the warehouse, getting larger trucks, and working on larger houses. It's quite cathartic to just take a sledgehammer to a whole house and just knock it all down!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Deconstruction Simulator\n\nfun and satisfying game\nrun your own deconstruction company get contracts to earn cash by demolish houses or recover the materials like planks of wood , bricks etc to resell \nempty the content of the houses like taking the furniture by dismantling , cookers,fridges to resell to make more cash \nthere are opportunities to earn money \n\nIf you like games like House Flipper the you will like this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An enjoyable, chill game with a lot of variety in how you want to handle jobs. If you like games like House Flipper, you'll like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thought this would be a quick 2 hour playthrough but 26 hours later I am still hooked. It is pure organized chaos and incredibly satisfying to destroy everything in sight. The lack of multiplayer hurts a little (actually a lot... I wanna smash with friends!!), but overall this is an addictive and fun game that I would absolutely play again. There's a few small issues and glitches, like no matter how good or bad I do of a job I get a 5 star rating, which is hilarious. It would also be awesome to add a third person POV for accessibility reasons. First person is a vertigo trigger, and I have a few friends who would love to play but are unable due to first person limitations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "🛠️ “Deconstruction Simulator: The Joy of Taking Things Apart”\n\nA Glowing Review by Someone Who’s Definitely Not Addicted\n\nIf you’ve ever stared longingly at a bungalow and thought, “I wish I could lovingly dismantle that, brick by brick, for modest profit,” then Deconstruction Simulator is your new spiritual home.\nThis nonviolent masterpiece invites players into the thrilling world of small business simulation—where the stakes are low, the drywall is stubborn, and the satisfaction is immense. You don’t kill monsters. You don’t save kingdoms. You remove cabinetry. And let me tell you: it’s glorious.\n\n🧱 Gameplay\nYou start with a crowbar, a dream, and a choice: Serious Gameplay or relaxed recreation. From there, it’s a whirlwind of contracts, tool upgrades, and the occasional existential reflection on the nature of impermanence.\n\nThe gameplay loop is hypnotic:\n- Accept job\n- Deconstruct house\n- Get paid\n- Buy shinier tools to deconstruct slightly fancier houses\n- Repeat until you forget what sunlight feels like\n\n🐛 Glitches? What Glitches?\nYes, there’s screen lag. Yes, sometimes a piece of roof hangs suspended in midair. But that’s not a bug—it’s a feature. It’s the game reminding you that perfection is an illusion, and that even in demolition, there is grace.\n\nBesides, who needs smooth frame rates when you’ve got a spreadsheet tracking your tile salvage efficiency?\n\n💼 Small Business, Big Feelings\nThe emotional arc of Deconstruction Simulator rivals that of any Oscar-winning drama. You start as a humble contractor, and by hour 40, you’re a philosophical powerhouse with a fleet of vans and a deep respect for load-bearing beams.\n\nThere’s no combat, no enemies—just you, your tools, and the quiet thrill of responsibly disposing of used insulation.\n\n🏆 Final Verdict\nDeconstruction Simulator is a triumph. It’s meditative, absurd, and weirdly moving. It’s the kind of game that makes you whisper, “Just one more wall,” at 3 a.m. while your cat judges you from the windowsill.\n\nIf you’re tired of saving the world and just want to take it apart—politely, profitably, and with excellent tooltips—this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love game once i figured out everything works great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "House (Un)builder 2. \n\nThis is one of those SIM games where you turn your brain off to complete blue collar work in a semi-satisfying fashion. The mechanics are simple but get the job done, there is a progression system in play to give incentive to continue doing jobs. The factory aspect of the game takes other SIM like game mechanics and adds another layer to the game. I didn't think this was going to be one that I would enjoy but found myself actually having a decent time. \n\nThis game does use a lot of AI art for everything that needs art so if that is a turn off for you, well it's all over the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "❤ Audience ❤\n☑ Beginner\n☑ Casual Gamer\n☑ Normal Gamer\n☐ Expert\n\n☼ Graphics ☼\n☐ Bad\n☐ Alright\n☐ Good\n☑ Beautiful\n☐ Fantastic\n\n♬ Music ♬\n☐ Bad\n☐ Alright\n☑ Good\n☐ Beautiful\n☐ Fantastic\n\n☠ Difficulty ☠\n☑ Easy\n☐ Average\n☐ Easy to learn / Hard to master\n☐ Hard\n☐ Unfair\n\n§ Bugs §\n☐ Bugs destroy the game\n☐ Lots of bugs\n☑ Few Bugs\n☐ You can use them for speedrun\n☐ Nothing encountered\n\n☯ Story ☯\n☐ There is none\n☐ Bad\n☐ Alright\n☑ Good\n☐ Fantastic\n\n⚔ Gameplay ⚔\n☐ Frustrating\n☐ Sleepy\n☐ Boring\n☑ Fun\n☑ Challenging\n\n۞ Game time / Length ۞\n☐ Really short (0 - 3 hours)\n☐ Short (4 - 8 hours)\n☐ (10 - 20 hours) \n☑ Long (40-60 hours)\n☐ Very Long (61-100 hours)\n☐ Extremely Long (101+ hours)\n\n$ Price / Quality $\n☑ Full price\n☑ Wait for Sale\n☐ Don't buy\n☐ Refund it if you can",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I accidentally played this until 5 am! Very addicting! I switched it to casual mode for no timer or penalties as I get used to the game. The tutorial is very straight forward and lets you make mistakes a new player would without being hurtful. The sledgehammer is such a stress relief and that rare furniture find is excitement. I highly recommend this one! Just watch out for the neighbor's fence when bulldozing! Can't wait to get the bigger van so I can clear a full house out to sell!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game that is good to just waste time and not have to think about.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Game. Only thing I would look into is for the clean up bonus missions. All you have to do is put it in bags and chuck the bags off to the side, no need to clean up the bags when you've completed it. Seems to defeat the purpose of \"Cleaning up\" when your still able to leave a mess behind. (perhaps there could be a dumpster on the worksite)? I look forward to future updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Disliked : ECONOMY IS SOOOOO WRONG !\r\nIt is the same company that made Shipyard Simulator and it's the same problem !\r\nWho in the world will pay 5K for a tool and receive 148$ for the complete destruction of a House ?\r\nI mean, come on, the pricing is an insult to the inteligence. A truck, the last one, should cost around 150K$, the warehouse rack should cost around 5k$ each. A wooden palet 80$. A chisel should NOT GO over 120$ (The final one) Did any of the programmers took the time to validate REAL world economy ?\r\nWHO in the world would destroy and clean a whole house for 180$ ? NO ONE !\r\n\r\nIf you want the players to play long, then just modify the reputation needed to upgrade your permit. Everytime I play, I feel insulted with the pricing.\r\n\r\nLike: I love this game and still continue to play. I've played Shipyard simulator, House flipper, Car mechanic and other game in that style and I love them all.\r\n\r\nI hope to see an update further this year to correct the economy.\r\n\r\nKeep up the good work and cheers !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game but it can get repetetive after a while",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very relaxing. Needs some work (looking at you, order system), but fun nonetheless.\r\nIt's not a deep simulator, more like chill house deconstruction. Break stuff, feel good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "could not complete first tutorial because of missing plank",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very time consuming. I have enjoyed this game. In a way is satisfying to see things be destroyed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love destroying things with a hammer. This is the game for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very addictive game really enjoying the mechanics, would like to see more options for house deconstruction maybe even commercial properties or I might  just not be high enough level. Also can we buy a wrecking machine? also might not be high enough level. And please more achievements",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game does not deserve the negative reviews. I don't think it's any less repetitive than other management games so I guess try the demo first if you think that might be an issue. Overall I'm having a great time.\n\nThe warehouse management aspect is great. The levels are fun and super satisfying by the end. Normal mode gives a nice extra challenge of having to complete jobs within the right amount of time. It makes you coordinate the travel time of the job vs. what you need (or just want) to get done. \n\nOnly major suggestion right now is a change to the customer order feature. I want to be able to sell the stuff that I collected relatively quickly, not be stuck waiting for them to maybe show up in a random buy order. The customers should be able to only see what you have for sale and not randomly pick stuff that they want. Or at least have a \"searching for\" category for a few of the orders but not all of them. Would also love to see online co-op show up in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun and satisfying, tho gets boring quite quickly",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's an amazing game with impeccable graphics. It's worth playing. Everything looks as if it were real.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game my computer lags a little bit while using the wrecking ball but other than that it is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good sim, would recommend to anyone else into sim games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The opposite of House Flipper! \r\n\r\nBreaking stuff is fun! :P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a nice game very joy able i recommend it so much buy it and you will enjoy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game to chill and play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing post-launch support from devs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "another addictive game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Można zrobić rozpierdol 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game wish it had employees though",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really fun and relaxed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "swing hamnmer.\r\ncrumble wall.\r\nseratonin.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "addicting game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Keep up the good work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun chill game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cozy game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DESTRUCTION!!! MUAHAHAHAHAHA!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really enjoying it so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "more fun than it seems",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hammer time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game love it so far done 3 jobs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "deconsturction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "big like",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly good for a PlayWay game. You can tell there were about 3 people that absolutely loved what they were doing, and execs shouting at them about release dates resulting in this mess. Obviously unfinished, buggy in many ways, but somehow still worth playing. -points for rampant ai usage",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "**Feedback for Deconstruction Simulator**\n\n1. When carrying large items (like washing machines), I can’t see where I’m going in tight spaces. Please add an option to look around or to the sides while holding big objects.\n\n2. When loading items into the truck, the placement system could be improved. Instead of showing red zones, it would be better if the mouse movement simply stopped at the edge of valid placement (the last green zone). It’s frustrating to spend 10 minutes trying to perfectly align items just to save space. For example, if I want to place a recycling sack in the back-left corner, the truck walls should just block my movement, not show red placement areas.\n\n3. Please add an option to **hire workers** to help move items from the truck to shelves. Once the warehouse is fully upgraded, it becomes huge, and moving things back and forth manually takes forever.\n\n4. Carrying heavy items should be a bit faster — maybe introduce an **upgrade system for physical strength** so we can improve that over time.\n\n5. During delivery missions, give us an option to **highlight** the specific items the client needs on the shelves. It’s really time-consuming to find things once the warehouse gets big.\n\n6. The largest truck should be a bit **taller and wider** so big furniture (like the rare fridge) and 3x3 recycling bags can fit properly when placed upright.\n\n7. The **daytime timer** should start only when we **leave the warehouse** (for deliveries or contracts), not while we’re organizing, upgrading, or preparing inside.\n\n8. If the day ends while I’m in the warehouse, please allow me to **unload the truck before finishing the day**.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "A fun addictive game, It's the only game i have been playing for weeks now, Demolishing houses and slowly upgrading your company is enjoyable and well balanced, you feel like you've hit gold sometimes when you find expensive items for your warehouse, the warehouse ordering system is fun and reminds me of when i used to work in a warehouse picking and packing items to sell, the dev listens to his community and adds the features that are requested when its possible / feasible to do so.\n\nIt's sad to see some negative reviews about how the game can be repetitive, at the end of the day your buying a game about deconstructing houses, its like you buying a game about PC repair and then complaining that all you do is PC repairs lol",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "16 hours for $10. Pretty easy recommend. \r\n\r\nThat said, it needs work. Early on I figured out a way to fast track to Tier 5 which is the last tier. Then when I got there I was underwhelmed and without a driver to keep going there was no point in continuing to grind a rather repetitive game. \r\n\r\nThey have the opportunity to add collectables to the game. There are tons of objects scattered all over the houses that you could scan and collect or sell for $$$.\r\n\r\nThe tier 5 houses dont have windows you can grab. They are obviously next tier from the garbage windows from the earlier tier, but you cant grab them. The tier 5 hours are made out of brick. .....\r\n\r\nThe transport of choice are vans. No idea why. no one in the USA is going to use Vans in a salvage company. Trucks and trailers.....\r\n\r\nBut again, $10 ... i spend more than that on lunch and it got me 16 hours of entertainment. Great value.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "So I want to preface this review by saying I am still a relative noob on Steam. Been a console player since 77 but a friend convinced me to try the Steamdeck. And has it made me see the light. Now, with that said, I never would have said this ever if I had not been on Steam. This game, about basically running your own warehouse, something I've done in real life, has me completely addicted!  \n\nThe core gameplay loop of this game is one that digs its claws into you and don’t let go!  I fear I am about to be close to the end of the game as I am near the level 5 permits. The developers of this game have absolutely crushed the gameplay.  Now I will say, I wish I had a more powerful setup. That's no shade at the deck. It is actually a beast and it's powering all my Steam games. But I would love to play this game on max settings, but it does not deter my score for the game.  \n\nBetween this and Ship Graveyard Simulator 2, these are two games I could just play out until I'm gone. I hope we are getting DLC, new updates, new jobs, I don’t want this game to go away,  I would love to be able to have another bay or 2 for orders to do multiple at time. I'm just brainstorming. But if you like demolishing s*#t, creating your own Hone Depot lite and just satisfying gameplay, I highly recommend this game, it is fantastic!  \n\nEasy 9.5 out of 10 for me. And the .5 is ONLY because I am playing on Steam and have to run on medium, but that's no fault of the developer but does affect me. Look forward to more stuff coming hopefully. I'm ready for Deconstruction Simulator 2!!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Super fun and satisfying. Destruction physics are great and game has a really solid loop. I see some reviewers are dogging on the lack of variety/longevity, but I'm 10hrs in and still haven't even unlocked a larger vehicle or the larger warehouse (and I'm still on the 3rd license out of 5 for different job types). For $15 I'm not sure how much more \"game\" you can ask for. Well worth it IMO.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "good time passing game. put on a podcast in the background, and break stuff.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game is dangerous.\r\n\"I'll just sell some more furniture\", \"I'll just fill up this one last pallet\", next thing you know, its 4am, 3 days later!!\r\nSeriously a lot of fun and I can see myself losing way too much time to this.\r\n\r\nA couple of suggestions that might make things a little better though:\r\n1. It would be good if items of the same type (eg brick pallets) would snap together when you are placing them.\r\n2. Placing furniture items on the top shelves of racks is a little awkward and could use a little tightening up.\r\n3. A pallet truck for your warehouse so you can move more then one object around at once instead of running back and forward between the shelving and your truck over and over.\r\n4. You can carry a full brick pallet, but only a single empty one? Maybe it would be better if you could carry two or three empty pallets and small item boxes at once.\r\n\r\nOther than these few things, this really is a superb game!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Deconstruction Simulator is, in terms of gameplay, a simple game. \n\nYou accept contracts, most often to demolish a given house, from which the contractor often wants you to give load some of the items still in the house into their car, with the rest being free for you to take back to your warehouse. \n\nThese items you then sell via customer orders, to earn some extra money. Though you never know just what the orders are going to want. And they refresh daily (But I do feel like the game goes out of its way to generate orders for at least some of the items you do actually have, not completely random-like)\n\n...Or you can just recycle them, if your warehouse's full, but then you will not be getting any money for those.\n\nAside from big items (And small ones, that you pack away in boxes that you bring back), your mission is to... Deconstruct, the house.\n\nThe approach you choose is up to you. Either you can pick it apart, piece by piece (Or rather, wall by wall and plank by plank), which is painfully slow, but you do get to keep the materials, or you can pull out your trusty old sledgehammer, and mash all the walls to pieces (Then also clean up the pieces, and bring back the bags of trash for recycling, for which you do actually get some money back this time!)\n\nSlowly, as you finish more contracts and orders, you build up your reputation, unlocking permits that let you take on bigger, more luxurious homes and houses, that take longer to demolish, and contain more furniture and items for you to (voluntarily, up to you) take back and sell. \n\n###################################\n\nOkay, so now that you know what the game's flow is like. what are it's ups and downs?\n+ The game's physics are fun, making the demolition satisfying\n+ Many different houses to take down\n+ Easy to pick up, casual, satisfying gameplay\n\n- Can be pretty tedious, with all the furniture, and all the little items, I get easily overwhelmed by the amount of work each house takes. \n- Bringing back the furniture takes a lot of time, as the controls of moving it around to stack it up in your van are not ideal. And the space in your warehouse is limited, which, along with the random nature of the orders, and being unable to check while at the site of the contract... If you're like me, you'll feel pressured to take back everything, which will cost you a lot of time. \n- No in-game music, making the gameplay feel a bit... Hollow. Like, I have to watch a video along with it, to fill out the \"void\" of only SFX\n\n~Oh, and some people have complained of bad optimization, but that, I cannot judge, the game ran fine on my system. Specs: Ryzen 7 5700X3D (Stock clock), 32GB RAM, AMD RX 6800 XT\n\nAll in all, an 8/10; for those \"Tough day at work, want only to relax, and not think anymore\" kind of games.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Surprisingly addictive and way more stable than Borderlands 4",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Pretty good so far, the graphics are nice and it runs well. You notice little details that makes the game stand out from others, for example different items have different weights and make you walk at the right pace and carrying a fridge blocks some of your vision just like real life. There seems to be alot of upgrades to work towards too. Ive only played 1 mission out of the tutorial and so far it seems that it's well worth the time and money.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Really fun game! Progression is slow but steady! I love the customization of the warehouse, the vehicles etc. Selling stuff could be better. I wish they would just buy stuff you have instead of want stuff you dont have since you dont really have a choice on what you get. the wrecking ball is a blast! overall a great game.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "It is surprisingly satisfying.\nIt’s not for everyone though — as with most simulators, tasks take time and patience. But I’ve played for 5 hours and haven't faced any major bug, and if you enjoy games like House Flipper, this one is worth a try.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I'm not one to really leave reviews on games (Mainly due to Devs abandoning the game after release) But I noticed the updates and patches were ACTUALLY in response to issues that users were reporting, which makes me feel like this game is gonna have good potential. \nLike most others, I hope there will be a permanent fix to the visibility issue when carrying items that don't get boxed? \n-I.E. Maybe implement some sort of dolly or hand-trucks for us to roll out items such as Doors, washing machines, chairs, sofas, etc. and just keep it at 1 item loaded per trip. \n-Similar to the doors & windows crate at the warehouse, maybe it's possible to add a travel version of that in the truck so we can save some space? I've tried to stack them behind other objects but the game rejects it due to \"collision\".\n\nOverall, Fun game to play!\n\nGameplay-\n☑ Very good\n☐ Good\n☐ Nothing special\n☐ Okay\n☐ Bad\n\nGraphics-\n☐ Masterpiece\n☐ Beautiful\n☑ Good\n☐ Will do\n☐ Bad\n☐ Awful\n\nAudio\n☐ Amazing\n☐ Very good\n☑ Good\n☐ Decent\n☐ Not too bad\n☐ Bad\n\nAudience\n☐ Kids\n☐ Teens\n☐ Adults\n☑ Everyone\n\nStory-\n☐ Lovely\n☐ Good\n☑ Average\n☐ Not great\n☐ None\n\nDifficult-\n☐ Just press a bunch of buttons\n☑ Easy\n☐ Significant brain usage\n☑ Easy to learn / Hard to master\n☐ Not so easy\n☐ Difficult\n☐ Dark Souls\n\nGrind-\n☐ Nothing\n☐ Only if you care about leaderboards/ranks\n☐ Isnt necessary to progress\n☐ A bit grindy sometimes\n☑ Average grind level\n☐ Too much grind\n☐ Insanity\n\nGame Time-\n☐ Short\n☐ Average\n☐ Long\n☑ Depends on you\n☐ Endless\n\nPrice\n☐ Just buy it\n☑ Worth the price\n☐ Wait for sale\n☐ Maybe if you have some spare money left\n☐ Not recommended",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's fun, it's a good time killer, and for the price, it fits exactly what i expected it. Get it on sale, put a couple 10 hours into and go back after new content. Devs have been very quick to fix major issues, multiple patches during first week.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game does still need some polishing but the premise of the game is good! There are some bugs though. Like items disappearing from the warehouse, sometimes the text of the contracts and the objectives don't always seem to match up right. But I'm enjoying it enough to work around the bugs I have been getting. Give the game a shot!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "good game but needs more content, it would be nice to hire employees. It would be nice to have a leaderboard in the game as well as being able to buy a hammer or upgrade to a better one",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Well, the release is finally here. Compared to the demo, a lot of tedious mechanics have been simplified, and the optimization is definitely better at least on my potato PC. For fans of slow-paced games, this is just perfect.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love to think that this game exists in the same universe as House Flipper. You spend tens of thousands of dollars cleaning the house and transforming it just so some jerk comes and destroys it for couple hundreds.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Being a fan of sim games, I was pleasantly surprised by this demolishing houses instead of building them. Been having a ton of fun with it, my only complaint is the screen freezing from time to time I figure thats from updates since I didn't have that issue prior to the first patch day launch day (I have a 4070, it's annoying but doesn't stop me from playing). I hope this comes to PS5 eventually.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A fine game for some mindless chill gaming. It gets repetitive quickly and the selling aspect is slow compared to the intake of items, but this does allow for some silly warehouse storage. Overall an okay game, but it isn't one that will stay installed for good. Once played through it is headed to the \"back shelf\" of my collection.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you liked Ship Graveyard 2 you'll love this game.  A very relaxing and fun game which does have it's quirks and bugs which are being ironed out as fast as people post them.   Coming home from a long day and launching this game to knock a 3 story house down with a wrecking ball and sell all the trinkets for $$$ is a true treat.   Worth the price of admission.",
      "voted_up": true,
      "votes_helpful": 3
    }
  ],
  "negative": [
    {
      "review": "Being a big fan of sim games, I thought I would enjoy this, but I did not. The gameplay is very boring and repetitive in ways that other simulators are not. Many mechanics were difficult to use due to not being intuitive, having little to no instruction, and some not working properly.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Game crashed frequently when i'm on a job, can't destroy 3 or 4 walls without it crashing. Seems boring and repetitive mid-game. There's only 10 Achievements, which are things you would do in a normal playthrough. And the last one is Hidden, but i'm pretty sure its unlocked when you complete the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 23 hours and just about to finish the game my save file has been replaced with one at the start of the tutorial fml",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can sadly not really recommend this game. It is really repetetive, and sadly not in a good way. Its the same over and over again and not really interesting. There are sadly still many bugs like not beeing able to exit the wrecking ball. I can sadly not recommend it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So, this game isn't too bad...but it does have some issues that make me not want to recommend it to others. For one, at a certain point, the jobs get extremely repetitive, especially at the end game level. you get this two story house and its always the same.\r\n\r\n2. I absolutely hate that your two forms of destruction, the sledgehammer and the wrecking ball have issues. The sledgehammer cant be upgraded and that means that during later jobs, when you have a two story house to break down, it takes forever. The wrecking ball on the other hand works great, but cannot be bought, only tented, so you lose 600 dollars for every single job you use it in. This wouldn't really be an issue except that most jobs pay like 1500 at most if you don't disassemble stuff (which doesn't feel very fun, at least for not for me). \r\n\r\nAnother issue is that if you tackle a two story house thinking of starting on the bottom and collapsing the house, frequently debris will float in midair, and you have to stack scrap bails to have any shot at getting at any of it.\r\n\r\nAll of this said, it was fun for a little while. I think with some polish it could really be great.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game but after maybe the 6 to 10hr mark the game just gets really boring. The upgrades are sort of ok, but doesn't really make the game any better. It just needs more content and maybe a multiplayer so you can do stuff with friends. It just needs more stuff to spice it up and get rid of some of the repetitiveness.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am very disappointed in the developers. Every time I try launching the game it crashes with a fatal error immediately. I tried updating everything, drivers, audio drivers, steam, epic games, unreal engine, windows, everything I could think of. I tried restarting steam, my PC, unplugging and re-plugging my adaptor, monitor, etc. I tried verifying files, disabling firewalls, launching as administrator, etc. I tried everything I could think of and absolutely nothing fixed it.\n\nWorst part? The Demo runs with no issue. How do you mess up so bad that the paid product crashes immediately but the demo runs flawlessly? There are even others in the discussions that bring up how they have the same fatal error message and most go ignored so they have to fix it themselves by randomly troubleshooting. Overall I would not recommend this game to anyone, mainly due to the off chance that it will just refuse to work for you even if the demo does.\n\nEdit: Dev has responded. Sent email to dev to hopefully help, will leave review as is until a patch comes out that fixes error.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Review of Deconstruction Simulator\n\nThe game is genuinely fun and has a lot of potential, but in its current state I can’t honestly recommend it.\n\nIssues I’ve encountered:\n\nContract payouts: All contracts have started giving extremely low payouts, even though I have a 5-star rating. This makes progression feel unrewarding. \n\nLack of incentive for full deconstruction: There really should be a bulk goods buyer who lets you sell collected materials, even at a reduced price. As it stands, there’s no reason to carefully deconstruct and transport materials home, it’s simply faster and more efficient (and more rewarding) to demolish everything outright.\n\nLimited content: I’d love to see more buildings available for deconstruction.\n\nController support: Better controller integration would be great. Let me use my PS5 controller so I can comfortably play on my TV.\n\nI know the game is still in active development, and it’s clear the developers are putting effort into improving it. I’m hopeful that future updates will address these issues, and if they do, I’ll be happy to update this review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A very relaxing game to play UNTIL i log in today and i cant play it i need 8 GB VRAM emmmm helllo this is a simulator game not GTA 6 i mean come on now honestly just disappointing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not Recommended, Not Recomended. You get that item and sell with very Cheap price, No ReCoomended, if can Refund i Want REFUND IT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game just crashes with fatal error non playable",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Jobs pay very little compared to the high priced upgrades, it costs $600 for a wrecking ball rental when the jobs pay less then $400 making it a pointless mechanic to have in the game, the orders people make is completely random when it should try to focus towards items you actually have, you cant buy your own demolition equipment or any kind of explosive, there is no upgrade to the hammer so its tedious having to manually smack the beams in walls especially when your hammer just gets caught on the mountain of insulation that just pours out of the wall the game gets very old very quickly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game plays fine, some minor issues when dealing with massive amounts of debris but that is not really the game or maker. \nThere is not a lot of upgrades for yourself and seems to be a lack of content for the warehouse. Would be nice to have a pallet jack or forklift or something in the warehouse, especially once you get to higher tier warehouses. \nThe method of \"deconstructing\" the homes isn't very interesting after you get used to it. I feel that you are negatively rewarded for bringing anything back to sell, due to how much time it takes for the little payoff. \nThe latest update, where you can throw the debris bags, has broken how i make most of my money. Its more lucrative to just destroy it all and recycle than to take your time selling. Difference between 3 jobs a day and 1 job a day.\nOverall, took my attention for a bit but lost it after nothing new was really introduced in late game. \nSynopsis: Wait for a sale, worth playing if you enjoy these types of games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is buggy as hell. This isn't a \"released\" game, it is barely a beta version.\nSome of the bugs: (not comprehensive!)\n- Items disappear randomly or change shape or design after changing locations.\n- The warehouse doesn't calculate available stock correctly (sometimes it shows items as available, sometimes not).\n- Interfaces often glitch and can only be reset by reloading or changing locations.\n- Hinges and screws for disassembly often float in the air near the object you are trying to disassemble.\n- Indestructible items like chimneys float in the air after a house was demolished.\n- Some items respawn when revisiting a site.\n\nAnnoyances:\n- Interface for selling items (called contracts) is overly click-heavy and the contracts are so randomised, that 90+% of them could never be fulfilled (like 10 sofas, that would never fit into a single transporter) and therefore clutter your screen, making it just a bother to interact with it at all, even though the VAST majority of money is gained with it.\n- Contracts rarely ask for wood, bricks or drywalls, which is the stuff you typically have the most of.\n- Upgrading tools is expensive and barely increases speed.\n- The devs would rather add new fancy features that were barely asked for than address or even fix the issues that were in the game since the beginning.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was loving it till the recent updates broke it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Should've expected as much from playway",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "awful.....nothing like i thought it was going to be",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're thinking about getting this game, download the demo and play it through a few times until you're bored because there really isn't much more content that's worth it outside of the demo itself. \n\nThis game was initially a lot of fun, it felt like there were clear objectives and lots to look forward to, but it feels like I've reached mid-game about 10 hours in, and there's no real urge to see it to completion. It's repetitive. \n\nThe idea of the game is neat, but what it really lacks is any sort of tangible progression or end state. Later game contracts are made arbitrarily harder by implementing a \"day-tax\" penalty and making the contract 200km away. Being able to only sell collected items as part of bundles means you spend hours painstakingly collecting items that likely never get sold and just take up space in your warehouse. Overall, the upgrades just feel like something to waste money on to flesh out the maybe 5-10 hours of gameplay this game has than something that makes any tangible difference. \n\n90% of your in game time will be spent fighting the punishing mechanics of trying to fit items into your van. You can see the silhouette, you can see that it fits, but the hit markers won't let you place anything. This is especially frustrating when the later-game contracts take 2 hours each way to get to and you have to make numerous trips. \n\nOverall, fun at first, but if I had to do it all over again I'd wait for this game to go on sale for $5, play it on a rainy Sunday, then forget about it.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "I am still waiting for the game to be in what I'd consider a playable state before continuing. Here are the larger issues I've seen reported recently. I make no claims as to the accuracy or completeness of this list. There are a number of other minor and visual issues as well such as garage doors respawning, chimneys not falling when buildings collapse, furniture models / shadows getting messed up in the warehouse, trees clipping through vans, etc.\n\n* Items falling through customer van on travel, then unable to be picked up (10/5/25)\n* Items (rarely) disappearing when placing in van (10/5/25)\n* Relaxed-mode turning off randomly (10/6/25)\n* Destroyed entire house, only 92% completion shown (10/5/25, is this just visual?)\n* Furniture pallets (maybe also non-furniture?) disappearing from warehouse (10/4/25)\n* Various racks (cardboard, windows, wood) disappearing and/or partially falling through warehouse floor (10/5/25)\n* Items disappearing from site on travel (120cm drywall, 150cm beams reported 10/6/25)\n* Partially completed pallets / boxes disappearing from site (10/5/25)\n* Pending money lost on reloading save before end of day (10/3/25)\n* Cannot fulfill some orders even with correct item / rarity (10/5/25, maybe different items with the same name?)\n\n--------------------------------------\n\nI really like this game so far, but I can't recommend it in it's current state. I hope the bugs detailed below are fixed soon and I will amend my review afterward. Dev communication so far has been excellent in both the Steam forums and Discord (though I'd like to see a known-issues list), so I do have hope.\n\nUnfortunately, there is a bug which is completely killing my enjoyment where items can despawn when you leave the job site. The game is designed such that you have to leave and return multiple times in order to finish unless, maybe, you destroy literally everything, so I can't see any way to avoid this unless you are much better than I am at figuring out what will fit in the van by eyeballing it.\n\nThe first time this happened to me, another player let me know on Discord they had previously reported this issue (he had an early access key) and it seemed to happen to items you left near the delivery van. However, after starting over (I had lost a customer-requested item and didn't want to lose the reputation), I had multiple items disappear from inside the house. Brick pallets are apparently especially susceptible to this, though I had at least four other different types of items disappear, so it's not limited to them.\n\nThere are a couple other more minor bugs related to game settings. When I quit the game, all of my settings were reset and I had to redo them. Other people report this happening whenever they try to confirm the settings with the hotkey. (The workaround is to just exit the settings menu and select to save them that way instead.) Also, some people have reported that various difficulty settings (which are not modifiable after the prologue) are resetting mid-game.\n\nPeople also report progress-stopping bugs in the prologue and crashing, but I didn't experience them.\n\nThis isn't a bug per se, but I'd also really like a way to rotate items in all three dimensions. In particular, there is no way to lay an item flat. For example, drywall can either be set down at an extreme angle or at a low angle, but if you want to slide it in into the truck on top of a refrigerator, you're out of luck. With as much work as they seem to have put into the collision boxes and physics, and with van-tetris being kind of fun in general, it's strange how difficult it is just to put something into a space which is obviously large enough to accommodate it. It would also be nice if there was a way to \"nudge\" items without having to pick them up and completely reposition them. Also, items tend to bounce around like they're made of Styrofoam when you place them too close to the van walls, which is strange since the game won't let you place things where there are collisions.\n\nBeyond that, I was really enjoying the game so far, though I was only on the first mission post-tutorial. Disassembling items is a bit annoying and that's a little surprising since it seems like the optimal way to play in the early game is already to destroy almost everything and thus bypass the tools. This is because the starter van is just far too small for anything else to make sense due to fuel costs unless the job site is extremely close to the warehouse. This may change later with a large truck, faster tools and more expensive items, but I'm not there yet.\n\nDestroying stuff is fun in general, though it does feel like it takes maybe too many hits with the sledge. This may be something that gets upgraded later, I'm not sure.\n\nWhen picking up items like wood planks or bricks, and when placing them onto pallets, i would like to be able to hold down the button instead of having to press the button repeatedly. My RSI will thank you for making this change. :D\n\nThe warehouse is a really cool idea and it's fun to store things there. I don't know yet how I feel about the \"orders\" system where you look for people wanting things you have. It feels a little convoluted and game-y. I'd rather hold an auction or build a house or something.\n\nPerformance is great for me with a 3060ti and 5600x. With high settings, default FoV and DLSS 4 (the game comes with DLSS 3 but I updated it via DLSS Swapper) DLSS: Balanced is giving me 55-65 FPS in 1440p, which I'm doubling to 110 with Lossless Scaling while still having some GPU room to spare. I haven't noticed any hitching, though I wouldn't expect to since the game takes place in relatively small areas with a loading screen between them.\n\nI'd also like to note that I think the price is extremely reasonable and much less than the community had been expecting pre-launch. If the aforementioned bugs are resolved, this is an easy game to recommend.",
      "voted_up": false,
      "votes_helpful": 59
    },
    {
      "review": "Can't recommend in its current state. I enjoy the gameplay loop, but stuff like packing your truck needs work. The larger trucks are not as efficient as they could be, and the item hitboxes prevent you from stacking things to the ceiling. Stuff like doors, windows and walls are impossible to lay flat. \n\nContracts get ridiculously far away and very time consuming for little pay. And why would I rent a wrecking ball for $600 when the contract only pays out $350? The sale of reclaimed items and building materials isn't very good, I have a full warehouse and rarely get orders for what I have. \n\nI think I'm done with this for now until the mechanics get a rework.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "I originally bought this game, in the blind, because I love Ship Graveyard Simulator 2 so much, and was hoping this would be a building version of that. I assume I'm not alone in that, but am sad to report that this is not that.\n\nAfter a frustrating Tutorial experience, I decided to 100% the first level before writing my review, and ultimately have decided that this game is more not fun than fun, hence the thumbs down. Will you like this game? Maybe. I don't know. I'll detail below what the game entails, so you can decide if it sounds fun or not.\n\nFirst, this is not a Deconstruction Simulator game. At least not primarily. That comes like fourth.\n\n1st - It's a van loading/unloading simulator - Every plank, every piece of drywall, every piece of furniture, every bucket of small items, etc. must be manually loaded into your van, in a maddening game of wobbly-physics Tetris. And then, when something is sticking out just a little too far, and you try to close the doors, they will almost close, and then fly back open, so you can play Tetris some more. Then, once you finally get the load in and doors closed (of which you will have many many runs/loads per job), you get to unload everything in your warehouse! Every plank, every piece of drywall, every piece of furniture, etc. I hate this. Then, when it comes time to sell off everything you've stockpiled, yay, you get to load it all up again in the buyer's van! So you've now loaded/unloaded every single piece of everything, no less than three times, before you can get it out of your life. Did I mention I hate this?\n\n2nd - It's an inventory management game - Very few games handle inventory management well, and this is not one of them. It's usually a necessary bummer, but this game tries to make it the secondary game loop. Once you get everything to your warehouse, you have to sort it all into the correct shelves, like a HomeDepot worker stocking the lumber yard. Then, once my warehouse was full (after just one job), I couldn't sell any of it off because I still didn't have all of the items in any of the available client orders, so I guess I was just expected to start the second job with a full warehouse and start dumping stuff anywhere there was space, since my shelves were full?\n\n3rd - It's an IKEA furniture disassembly simulator - You spend more time taking apart all the different furniture pieces than you do the house. I will say, it is very satisfying how each piece of furniture auto-packages itself into a new IKEA box after disassembly.\n\n4th - It's a deconstruction simulator, which should really only be called a wall removal simulator - The ceiling and floors are just bashed with a hammer and thrown in the trash. It's only the walls that are taken apart and salvaged.\n\nLastly, this game has chosen punishment over reward. It charges you for gas. It charges you rent. When you complete a level, you don't get paid (immediately), but rather you invoice the customer and have to wait. If you break something you shouldn't, you get docked for it (why not instead reward a player who doesn't damage anything?). This realism isn't fun. I play games to NOT think about bills. Don't give me game bills.\n\n\n\nWish List\n- Let me carry more than 1 piece of drywall at a time. Loading/Unloading a stack of 50 sheets (3 times), one-by-one, is not a fun game mechanic.\n- You currently have to wiggle your mouse to use many of the tools. I don't want to wiggle my mouse, I want to click once and hold. This isn't a VR game.\n- Let me just sell off the stuff I salvaged. What am I supposed to do when the warehouse is full and there aren't any fullfillable orders?\n- Let me just chuck everything into the truck. If there must be a capacity system (volume? weight?) so be it, but I never ever want to stack anything in these ridiculous physics simulators. I hate it. It is not fun. It is what your game is, and shouldn't be.\n- The game runs hotter than an American Eagle jeans ad. Needs more optimization.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "I love these kinds of games, but many of the reviews are correct.  Play the demo 3-4 times and its the same thing.  The only difference is later contracts are worth more to make up for the upgrades costing significantly more. It feels like time gating to make the game feel longer than it really is.   You have the whole game at about 2 hours of play, but to get all the upgrades i would assume you have to play those 2 hours around 25 times to complete it. \r\n\r\nThe speed increase you get from several thousands of dollars of screwdrivers/chisels/etc isn't really worth it because the mechanic of selling the things you salvage is so frustrating because customers only want them in bundles with things you probably didn't save and theres no way to check contracts customers want when youre on the job site so you have to memorize or, more likely, ignore the mechanic. \r\n\r\nI made it to tier 3 contracts before giving up.  The upgrades are so expensive and the contracts only increase a bit.  I wanted to save up for a bigger van which is only $5000 but it felt like such a grind for a small payoff i gave up.  I am sitting on like $5000 of salvaged items i cant sell because i am missing 1 of the things the customer wants.  \r\n\r\nIt would be nice to see employees who could autoship what you already have so you dont need to look up and down your shelves to find the right item with the right rarity and move it to a van. It would also be nice to get a more powerful sledge hammer or different tools to bring to the site to help destroy small houses.   Would also like to see the base tools start at the level 3 tools speed for disassembly. Its an interesting mechanic, but it is such a carpal tunnel trap as it stands.  \r\n\r\nI hope that there will be more updates to bring more content to make it more worth the purchase",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "This had potential, but the gameplayloop get's way to monotone and tedius.\nThe only upgrades are making your tools work faster, and are superexpensive.\nSelling items are also tedius, the only reason you have such a big warehouse for your stuff is to wait until someone orders what you have, ridiculous, what if you could work together with a wholesaler, or even your own second hand shop?\nNo helpers to hire? Someone that can drive the vehicle and store your items?\n\nAs i said, it had potential, but  feels like they just wanted the product out and be done with it, a shame.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I can say I am enjoying my time with this game but, there are to many issues to give it the thumbs up. If you are someone that doesn't like doing the same 1 or 2 things over and over, then this game wont be for you. All you do is go to a site and get some items out for a customer and for your self, then either demo the whole house or a couple walls. That's it, besides selling a few things you brought back here and there. I would highly suggest trying the demo first as that is what you will be doing the whole game.\n\nIssues are:\n\n-Things disappearing from job site. Only noticed this happening by work van.\n\n-The shelves that store the items you disassemble are very finicky to place the items.\n\n-When completing a job, it would tell me I was going to loose rep like I was not done with everything. I would complete and seemed not to.\n\n-I get a loud noise when traveling to locations.\n\n-Performance needs work. I am getting anywhere from 70-100 on epic settings and around 144 on high settings and tanks to 30 when demoing parts of a house. I didn't really see any difference between the 2 settings but, still is a huge gap between the numbers. This game is not really all that graphically demanding and should be seeing higher numbers. Also, why are things in the distance blurry and bad looking? Nothing to take you out of the game like seeing a pixelated, blurry water tower, tress etc.  (RTX4080 Super, 9800x3d, 64GB)\n\n-The orders need tweaking. Don't get to many orders that I can fully complete.\n    -Need to be able to put items in recycling area or sell somehow when needing to make space. \n    -Need it so if you can sell a partial order and it doesn't hurt your rep. You are full filling items they are \n       after.\n    -Rep takes a massive hit when not completing a full order but, doesn't help when completing a full order.\n\n-Need to be able to toggle the difficulty settings individually that are offered after tutorial.\n\n-Loading things into the van needs work. Its a pain to get things in most of the time. Can't even load past a certain height. Items wont go over half the height unless the item you are trying to stack on is at or below that point.\n\n-When holding items, it shows a button to open door. When pressing the button it just want to set down the \n item in hand and NOT opening the door.\n\n[strike]-In settings menu, E is to accept changes but does nothing. Only way to change any setting is to back out to menu.[/strike]\n\n-Major bug: Saving and quitting before ending day will lose any pending money. Some times it is fine but, I am finding that it will wipe any pending money most of the time. So make sure to end day before you are done playing.\n\n-Items disappear out of hands on occasion when loading them into the shipping van in warehouse. \n\n-When buying pallets for warehouse, after purchase they would not spawn when selecting the pallet. It \nwould rather purchase another. Each time it would take money. Now there are 2 that I can see in the office. There may be more, just clipped inside each other.\n\n[strike]-Piggy bank achievement bugged.[/strike]\n\n-Brick Pallets clipping through each other when loading onto truck.\n\n-VSync is not working properly. With it on it keeps at 120 (unless I am breaking things in house) but, it should be keeping it at my refresh rate of 144. Turn it off and it gets to it or close to. my refresh rate.\n\n-No bay B when fully upgrading warehouse. \n\nFix issues and I will change the thumb.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Game is very buggy and monotonous. Items keep disappearing and my character got stuck where I had to exit the game and reload. The unstuck feature didn't work. The tools are slow even with the max upgrades. Money income is also very slow causing you to collect more things which means more slow disassembling. I feel like the game would be more fun with the income was faster. The game desperately needs employees to unload your truck or a way to move multiple packages at a time instead of walking slowly with one package. Also the house and item variety is low. At it's current state I don't recommend the game.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I endured this game as much as I can and now I think I can say this game sucks. I got the last permit, upgraded tools and warehouse and bought the big truck, but I did most of it just for the sake of it and see until the end if the game gets any interesting with new permits and more item space.\n\n1- It's a high when you first get into business, then it's downward spiral. There is no joy in this game, you can get more satisfaction and joy if you actually deconstructed a building yourself. Really, really boring.\n\n2- There is no music, no story, no end goal, nothing. Intro starts like you are on a revenge mission, you have a story, a target. But nope. After the tutorial you are on your own and only thing you see is the mission descriptions. No secrets, no easter eggs, no fun. You just go through the same dozen of houses over and over and over and over...\n\n3- There are some concepts they tried, like customer types, but it's shallow as a pool of piss. You can't set a quality for your products, you have to collect EVERYTHING or you miss the most profitable contracts because that wealthy customer wants a premium TV, a premium couch, coupled with some stupid common walls or bricks. You can't just focus on most valuable items, unlike what game tells you at the beginning.\n\n4- That cool wrecking ball in trailer? It's not free, you can't buy it, you have to pay a hefty amount at the beginning of the mission to use it and it's not cheap at all.\n\n5- Game has a lot of jank. Not only a couple of assets, whole second floor doesn't even collapse if you start hitting the bottom floor first. You will get used to see floating pieces everywhere.\n\n6- IF they implemented a \"set item\" system to contracts, that would improve the experience. Like, you see 8-pieces-premium kitchen set, well, tough luck, you sell each piece randomly. But if you could get a bonus for set items like chairs and tables, bed and wardrobe, TV and coach whatever, that would be great. But of course, it's way beyond the bubble of thought of these devs obviously.\n\n7- I mean, that's pretty much it for this game. There is nothing even exciting to complain about. It's THAT boring, shallow, poorly implemented and isn't rewarding. Stare at a wall instead.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Game is a lot of fun in the beginning, but late game playability is virtually non-existant.  You end up with racks and floors stuffed to the brim with nothing to do with any of it unless you draw a lucky card and have a so-called client make an offer for a bunch of your junk at once.  Just like it's predecessor \"Ship Graveyard Simulator 2\" late game must not be considered by the developers.  After playing over  400 hours my opinion hasn't changed much.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Can't recommend in it's current state. The destruction and physics feel underwhelming and janky at times(ceilings and door frames floating with no support). The wrecking ball vehicle is overpriced to rent per contract it feels and just saves a couple minutes of hammering for breaking your budget. The order system needs to be reworked because it feels ridiculous and barely have room to fit some orders(9+ brick stacks+other things) in the largest truck. The tool upgrades are good but there's no hammer or garbage bag upgrade.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Over all game is good for the price.. which is bad thing... \r\n\r\nIt just feels incomplete. Gameplay over all is enjoyable but game lacks some kind of \"late game\" \r\n\r\nGive me more upgrades, skills let me upgrade my carry speed, buy some industrial equipment for warehouse, let me whole sell items rather than pick x amount of specific items. Game just needs some love. And I woud be way more happy to pay 20-25€ for fuller game. Guesss i can only hope for more features to be added in form of updates or DLCs maybe.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "After 20min of trying to do the tutorial that is hella buggy I gave up. I really wanted to like the game.\nMaybe if it receives a couple updates I'll rebuy",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Man, fuck this game.\n\nNo wonder the in all the 'let's play' videos the streamers just destroyed everything with hammer and not give a fuck. Tediously picking up EVERY brick one by one and putting them in a pallet ONE BY ONE is not fun.  Game wants THESE bricks, BUT NOT ALL these bricks that look identical that came from the same wall?\n\nTell me I can take an item home, but only that one specific item other wise, penalty,\nTell me to destroy wall, well a brick fell and broke that desk you had no clue about, penalty.\nBreak this, oh your hammer's aoe went a pixel out of the invisible boundary of the item you're break and now you broke something else you weren't suppose to, penalty. \nCostumer only wants bricks from one wall? WTF, where does it say that. Thats not on the list of instructions. It says DESTROY WALLS, not dismantle and recover from ONE. Here's the kicker. The fucking game tells you dismantle is not the same as destroy, but you instructions tab.... counts a dismantled wall as DESTROYED in your task window. Make up your mind. Which fucking walls am I suppose to magically know are to be dismantled and which fucking ones to be destroyed because you for sure aren't fucking telling me.\n\nI just don't fucking get the rules this game is setting on me because its telling me one thing but adds on a ton of extra conditions I'm not aware of.\n\nShip Graveyard Simulator was glitchy as all hell but at LEAST it stayed consistent in how it and in what way it wanted you to do things. Here its destroy this, oh you destroyed it the wrong way, fuck you now. If you're asking me to be that FUCKING precise WITH A SLEDGE HAMMER the why the FUCK am I using the sledge hammer when the amount of time it takes to break the fucking way is the same as to dismantle it brick by brick/board by board AND I won't get penalized for invisible 'destruction' waves' from my hammer that is destroying desks on the other side of the wall.?",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Played the demo, it worked great, bought it can't even get past the tutorial, it keeps telling me to clean out the van when i have nothing in it and it wont let me continue without doing so. :( I've tried restarting, exiting the game, alt f4, trying a new play through nothing is working i keep getting stuck at the same place in the tutorial.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game is good however few things are letting it down.\n\n- Hit boxes on some items are awful.\n- Job pays $335 and the crane is $600 + travel costs + tax per day = A pointless contract.\n- Garage has 3 slots... Why? When there is only 1 of us.\n- No \"Rename\" company option\n- Lack of various options on contracts (Feels like i'm repeating the contract)\n- Some doors won't come off (See my latest livestream 03/10/25)\n- No second slot for delivery drivers (accepting multiple contracts to sell items would make it quicker)\nBuyers not buying what I have in stock\n\nOne the plus side it triggers my OCD......  I'll change this as progress with the game is made",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I actually enjoy this game and plan to keep playing, but in its current state I can’t recommend it. It feels like one of those 50/50 games where some people might like it, but right now it’s closer to 90/10 against.\r\n\r\nThe biggest issues:\r\n\r\nWarehouse feels pointless – customers almost never buy what you have in stock. I’ve gone 3–4 in-game days without selling anything, even with the knick-knacks box.\r\n\r\nDisappearing items – things vanish overnight or when you return to the warehouse. Example: I stack sheets, run out of truck space, head back to drop stuff off, and by the time I return the sheets are gone.\r\n\r\nFloating objects – tearing down a two-story house from the first floor leaves the second-floor doorway hanging in mid-air.\r\n\r\nUI glitches – if you bounce between the warehouse and jobsite, the house destruction percentage can turn from green to blank, even though it still shows 100%.\r\n\r\nIf the devs fix the warehouse system, disappearing items, floating pieces, and UI bugs, I think this could turn into a really solid game. But right now, it’s rough.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Slowly taking apart a house, now that part is fun. But everything else around it is dreadfully tedious. Taking valuable stuff to your warehouse? That requires loading  the stuff in a van in way that's a bit like analog tetris with a broken controller. Then you have to hire a delivery truck, pick up the items from you truck, bring them to the delivery truck, play the cursed tetris again, then send the delivery truck on it's way.\n\nThe game would be better if they removed the whole warehouse and made placing items in the truck automatic.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Being a big fan of sim games, I thought I would enjoy this, but I did not. The gameplay is very boring and repetitive in ways that other simulators are not. Many mechanics were difficult to use due to not being intuitive, having little to no instruction, and some not working properly.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "had hoped the game would change from start but it really doesn't. it is incredibly boring after a while. I have too many beams, bricks breaks stuff that i didn't even see, nor do i have any control over where they fall. Same houses and quests, just variances in how much you get paid. No real late-game objective. Upgrades are far too expensive compared to their use case.\nAnd the crazy amount of lag in this game is wild. Runs incredibly badly. \nThe sledgehammer is both too weak and too imprecise. The recycling is annoying because i can't sell all my wooden planks and beams but putting them in the recycling area just means you lose them.\nIt's a good way to waste 5 hours but I wouldn't want to pay 15€ for this...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The Jobs pay very little compared to the high priced upgrades, it costs $600 for a wrecking ball rental when the jobs pay less then $400 making it a pointless mechanic to have in the game, the orders people make is completely random when it should try to focus towards items you actually have, you cant buy your own demolition equipment or any kind of explosive, there is no upgrade to the hammer so its tedious having to manually smack the beams in walls especially when your hammer just gets caught on the mountain of insulation that just pours out of the wall the game gets very old very quickly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cool idea poor game-play. Loading vehicles is horrible, Tetris did it better. Lumber and wall panels go flying once loaded into van then if you pick up one. contracts are messy info is scattered. The amount you make per job based on what the job really is a joke. No one would do that work for little pay. adding items to your warehouse is pointless the orders ask for items you dont have or havent seen meanwhile your warehouse is full of other crap. No new tools to purchase, no appliance dollies. This game should have been early access release with its current state.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is fun for a while, but the grind kicks in quite soon. The amount of repeated things to do arnt to much fun.\r\n\r\nThe concept of the game is very nice, but it could be better executed. The amount of things you can take home is greater that the amount you can ship/sell each day, so take only the things that are most worth and destroy the rest... The warehouse is so expensive to upgrade / buy racks to put stuff in, it makes no sense. And to top it off, the largest truck you can buy is still to small, it take atleast 5 trips to take all the stuff from a basic house.\r\n\r\nThere are also alot of bugs in the game;\r\n- loading the truck, where things fall/clipp through the truck\r\n- loading the truck, where every item should be in the truck but the doors wont close\r\n- driving from the job side to the warehouse and coming back to the job side to see that more than half of the items (put in front of the house) are despawned\r\n- placing items in racks in the ware house, and seeing the items despawn the next day\r\n- cant disamble doors\r\n- when destroying walls, door instandly break\r\n\r\nAll with all, good idea, but not to well executed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy this game! I want to recommend it! I really do! It's SO close!!!\n\nThere are plenty of reviews that rightfully point out the game's glitches. The developers seem to be on top of things and I don't doubt a future update will flip this thumb around. Seriously, if there was a maybe thumb, I'd do that. Alas, Steam be Steam.\n\nThe game, at its core, has three issues that hold it back more than even the glitches.\n \nThe first might be a minor or major issue depending on who you are. While the beginning hints at some kind of story or narrative to encourage you to continue growing your business, this kind of just vanishes after the tutorial. While this isn't a deal breaker, it does make any failures of the game's other systems stand out all the more blatantly.\n\nThe second is the gameplay loop. The overall flow is: Go to site, collect as many materials/valuables as you can, break everything else, clean up, go home, sell what you brought back. The primary issue with the loop is that the \"sell what you brought back\" portion lags far slower that you are going to be getting materials and valuables. You sell the items in the form of requests that are fully random both in how close to full value the item is, how many items they want, and what kind they want. That means that you will VERY quickly accumulate a ton of inventory and seriously struggle to get rid of anything.\n\nTo clarify why this becomes a problem, let's say you treat a home like a Buffalo and carefully break down everything you can and bring back everything you can as I started doing early on.  If you get unlucky, you might never seem to get a request for lumber and even if you do it will only be for one particular kind meaning you will accumulate a ton of one specific size that you can never seem to get rid of. All of the items you can bring back and sell have this problem and you could go several in game days of nothing only to have one order asking for a ton of stuff but they just HAPPEN to be asking for the ONE thing you don't have and there's no assurance that the next few contracts you do will have what they are asking for. So you just end up accumulating more junk hoping desperately you are hording the right stuff.\n\nThe third is probably the biggest disappointment: Lack of hazards. Hardspace: Shipbreaker is probably the abject best example of how to handle games focused on deconstruction and has a feature that easily puts it ahead of the rest are hazards. As you are working, you actively have to consider what you are tearing apart and how. Without hazards, games centered on deconstruction inevitably just boil down to a very monotonous cycle where you smash stuff until it falls over. There's no fear of being under the roof as it collapses, no pipes you need to close off, and, heck, you can literally smash the power bank that provides the building electricity hard enough to make it explode into sparks and nothing happens.\n\nThe third point is honestly the biggest elephant in the room for me. Ironically, Ship Graveyard Simulator 1 had this exact same problem and even the sequel doesn't really utilize hazards enough to be a huge challenge. As it stands, the most efficient method of playing this game is to recover any item people want, smash the two edge planks holding walls up until all of the walls come down, pack up the mess, and leave. Without any risk to smashing buildings apart like a maniac, the game just turns into one of those rage rooms where you smash stuff to let off steam.\n\nGreat fun in the flesh. Digitally, it gets dull very quickly when you realize everything you smash just feels the same.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At it's core this game is fun, I am sure that more content will come the game play loop will probably become very monotonous and should they add more content its something to look at modifying the game play to add more mechanics. There are quite a few game breaking bugs that really ruin your reputation.\n\nFor example one is if you take items back to your warehouse from a contract even if you 100 percent take or destroy items and then sell it on a order it subtracts from the contract total. It has left the location and it should not count negatively towards your contract.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game doesn't respect your time at all.\n\n I was having fun at first.    Due to my eagerness to complete orders  after salvaging  I took orders that I didn't have enough of certain material needed for those orders  First couple starts I spent too much money on racks and could never expand the warehouse.  \n\nSo after the last patch I started over again.   This time I didn't buy any new racks outside of tutorial.   Here is where the lack of respect for your time comes in.   I was very meticulous on salvaging of a house.  I disassembled all the fixtures and kept everything that I could.  All the panels and bricks. I filled up all my storage for materials.  I salvaged enough bricks to make a minimum  of 17 filled pallets along with my filled storage.  I placed all the excess pallets of full bricks and wall panels in the recycle zone which I thought would just sell the items.  Using the hand scanner it says 100 for a full pallet of brick  so you would think I would at least get 1700 for all those pallets that took me a few hours to put together since you can only carry 5 bricks at a time....nope only got money for the full bags or scrap and got some sort of mark  for stuff on the warehouse floor even though I put all the stuff I wasn't going to use in the recycle zone.  \n\nOther issues that annoy me with this game is the placement mechanic.   You can't tell how things are stacking when you are putting things into the van.  Even the demolish mechanic with the sledge/ brick tool gets  time consuming with just aiming.  I also don't like the night cycle.\n\nSo after that last restart thinking that I could sell stuff I salvaged  after spending all that time with the bricks and annoying placements of wall panels and not get paid  for excess material I put into the recycle zone. It just doesn't respect your time for trying to be meticulous for saving as much material as possible.  \n\nMaybe after a few patches things will change but right now it is just frustrating.\n\n10/11/25 After the first few patches 1.0.7 things are still frustrating.  Its tough to play the game when all of a sudden the screwdriver doesn't work or stalls.  Can't play the game  when it bugs out and you cant even dis-assemble anything.  Re-load and click on a desk to dis-assemble and then nothing works. I want to play this game.  With all the bugs it bums me out.  Maybe in a few more patches things  will improve.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Laggy interface, and the game's safe area does not fit my monitor. Tried all settings and could not find a way to adjust it. The game also crashed my PC for no reason and now I'm having issues with my microphone being detected on discord and other VC apps. Do not recommend. Refunded the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "constant crashes, can only go about 5 minutes or so before the game crashes, sometimes 30 if im lucky",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is an ok game, but I would categorize this as Early Access.\r\nThe system works, but is very basic. It's buggy in a few places, but overall pretty stable.  No crashes.\r\nIt does have some serious quality issues.\r\nShelf items are not labeled, so you have to rely on pictures, and some items have the same picture.\r\nThe video glitches at night when you use a flash light.\r\nThe physics bugs out on 2 story buildings when you collapse a wall that causes multiple floors to collapse.\r\n\r\nThere's a huge opportunity for upgrades that they didn't think about (is this AI slop):\r\n- Add an upgrade to the computer for a picker system (highlight the item in your order)\r\n- Add an upgrade to the shelving to show an electronic label of what's on the shelf.\r\n- Add item SKUs\r\n- Add an upgrade for a lift assisted exosuit to remove the weight penalty in the warehouse.\r\n- Add an upgrade to hire warehouse assistant that will unload and sort truck inventory.\r\n- Add an upgrade for AR goggles for the scanner that auto tag/highlights items in the house according to value.\r\n- Add an upgrade to shred overstock that you place in the recycling area so you get trash credit.\r\n- Add an upgrade to set shelf category for auto sorting.\r\n- Add an upgrade for palette robots to move bricks, wood, doors,windows, etc.\r\n\r\nThere's huge opportunities here to improve and expand the game, but in it's current state it's just an Early Access indie game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's some 200.000 games on Steam right now. You could be exploring faraway galaxies, leading vast armies, saving a beautiful dragon from a horrible princess, you could be building magnificent cities, or perhaps entire civilizations that will stand the test of time. You could be securing the future of your royal dynasty by getting to know your sister better. You could be a master assassin, or an ancient vampire, heck you could run around and cause mischief as a goat. Either of those would be more fun than what the devs, appropriately named Incubator, are expecting you to spend your limited time on this planet on. \n\nThis game lures you in with a promise of explosive action - something that could help lower your cortisol levels after a stressful day job. Instead, it offers an exciting opportunity to do a second job in your free time. Indeed, the Destruction tag in this mostly refers to your sanity. You get half a dozen tools in this game - screwdrivers, saws, you name it. And all of them but one you can upgrade many times. The one you can't is the sledgehammer. You nominally have it, yes, but the game goes out of its way to discourage your using it. That's because it wants you to spent 10 minutes carefully dismantling a wardrobe - one screw at a time - because you can then sell it for more than the entire contract's worth... And the wrecking ball? Well, it costs $600 to rent one, when the contract to wreck the house pays... that's right, $600. Mic drop.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sadly this game appears to have enough content to fill a demo and not much more. No real complexity or difficulty curve to speak up. The unlocks for new tools are not rewarding or particularly helpful, slightly father disassembly of furniture or a technically larger vehicle that isn't much more helpful because of bad physics. The secondary RNG around selling the components you optionally gather from demolished houses is another premise that seems fun but works poorly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Couldn't pass the tutorial because a plank was missing and I couldnt even knock down any more walls to get a new one.\n\nSeemed like such a stupid bug so didnt want to try anymore of the game as I anticipated more shit like this. May buy again after more patches",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Gets boring fast. even when buying permits for new locations, its the same locations over and over again. You will stuff things in your warehouse and never sell it. Tried to give it some time but does not get better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Never have I ever written a bad review because of graphics issues, but here we are. I do not have a potato pc, it can run most games at High or Ultra settings. Because of this, I most certainly never check the specs of a game unless I find negative reviews about it and do a double take. This game is the only sim game I have ever played on PC that does require at minimum 8GB VRAM, but optimal 16GB VRAM. This is absolute insanity for a simulator game and frankly unacceptable. Fine if you have a sprawling open world game, but not for a game with small areas in which normal textures do not load. No matter how low I set the settings, textures just aren't loading and it is just a blur. \n\nFor anyone wanting to try this game: Check your specs and do not expect that just because your PC can run any other big game it can run this. Do not buy if you fall under the recommended, because you will just be looking at blurry textures for the rest of your gameplay. I requested a refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unplayable, unfinished and buggy. As others have said, this game is broken. Starts off well, then bugs appear, such as not being able to pick anything up, or dismantle, or close any doors on the vehicle. Will seek a refund, suggest other don't buy this game until its fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ai slop and a complete lack of content its astounding theres like a couple tool upgrades theres no customisation and nothing to make you feel like that playthrough is yours",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Was Really hyped for this game's release. Bought it the second it went live on steam. Was really enjoying it honestly. Sadly tho, I had less than 10 hours in game and I already got a repeat mission. I thought maybe it just didn't register that I did it and didn't think much else of it. well now i've gone from tier 1 to tier 3 with only 14 hours in and I've gotten the same contracts over and over and over again and its just not what I was expecting. I'm tier 1 and all but 2 of my contracts are for tier 2, I get tier 2 and then all but 1-2 contracts are tier 3, I unlock tier 3 and now I get 1 tier 4, 1 tier 3, 1 tier 2, and 1 tier 1 contract as options. What really is confusing is how a tier 1 5 day contract will pay out more than a tier 3 1 day contract that's more elaborate to do in 1 day. honestly if I could I would refund it and get my money back. I don't ever leave bad reviews but this game has already gotten boring.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "3 words, completely utter garbage, i bought this because i thought i might enjoy  it DID NOT. i played the demo, thinking it might improve, IT DID NOT. i just cant wrap my head around, how the publishers let this one through, the controls are awful, the game play is tedious as hell, i cant believe i paid 20$aud for this, it's just that bad,",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is very hard to follow and there is way too many controls that are all very different which make them harder to remember. This game is fairly new which means it still has lots of growing to do. Just not my cup of tea for the time being :/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game crashed frequently when i'm on a job, can't destroy 3 or 4 walls without it crashing. Seems boring and repetitive mid-game. There's only 10 Achievements, which are things you would do in a normal playthrough. And the last one is Hidden, but i'm pretty sure its unlocked when you complete the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 23 hours and just about to finish the game my save file has been replaced with one at the start of the tutorial fml",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can sadly not really recommend this game. It is really repetetive, and sadly not in a good way. Its the same over and over again and not really interesting. There are sadly still many bugs like not beeing able to exit the wrecking ball. I can sadly not recommend it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So, this game isn't too bad...but it does have some issues that make me not want to recommend it to others. For one, at a certain point, the jobs get extremely repetitive, especially at the end game level. you get this two story house and its always the same.\r\n\r\n2. I absolutely hate that your two forms of destruction, the sledgehammer and the wrecking ball have issues. The sledgehammer cant be upgraded and that means that during later jobs, when you have a two story house to break down, it takes forever. The wrecking ball on the other hand works great, but cannot be bought, only tented, so you lose 600 dollars for every single job you use it in. This wouldn't really be an issue except that most jobs pay like 1500 at most if you don't disassemble stuff (which doesn't feel very fun, at least for not for me). \r\n\r\nAnother issue is that if you tackle a two story house thinking of starting on the bottom and collapsing the house, frequently debris will float in midair, and you have to stack scrap bails to have any shot at getting at any of it.\r\n\r\nAll of this said, it was fun for a little while. I think with some polish it could really be great.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game but after maybe the 6 to 10hr mark the game just gets really boring. The upgrades are sort of ok, but doesn't really make the game any better. It just needs more content and maybe a multiplayer so you can do stuff with friends. It just needs more stuff to spice it up and get rid of some of the repetitiveness.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am very disappointed in the developers. Every time I try launching the game it crashes with a fatal error immediately. I tried updating everything, drivers, audio drivers, steam, epic games, unreal engine, windows, everything I could think of. I tried restarting steam, my PC, unplugging and re-plugging my adaptor, monitor, etc. I tried verifying files, disabling firewalls, launching as administrator, etc. I tried everything I could think of and absolutely nothing fixed it.\n\nWorst part? The Demo runs with no issue. How do you mess up so bad that the paid product crashes immediately but the demo runs flawlessly? There are even others in the discussions that bring up how they have the same fatal error message and most go ignored so they have to fix it themselves by randomly troubleshooting. Overall I would not recommend this game to anyone, mainly due to the off chance that it will just refuse to work for you even if the demo does.\n\nEdit: Dev has responded. Sent email to dev to hopefully help, will leave review as is until a patch comes out that fixes error.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A very relaxing game to play UNTIL i log in today and i cant play it i need 8 GB VRAM emmmm helllo this is a simulator game not GTA 6 i mean come on now honestly just disappointing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not Recommended, Not Recomended. You get that item and sell with very Cheap price, No ReCoomended, if can Refund i Want REFUND IT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game just crashes with fatal error non playable",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game plays fine, some minor issues when dealing with massive amounts of debris but that is not really the game or maker. \nThere is not a lot of upgrades for yourself and seems to be a lack of content for the warehouse. Would be nice to have a pallet jack or forklift or something in the warehouse, especially once you get to higher tier warehouses. \nThe method of \"deconstructing\" the homes isn't very interesting after you get used to it. I feel that you are negatively rewarded for bringing anything back to sell, due to how much time it takes for the little payoff. \nThe latest update, where you can throw the debris bags, has broken how i make most of my money. Its more lucrative to just destroy it all and recycle than to take your time selling. Difference between 3 jobs a day and 1 job a day.\nOverall, took my attention for a bit but lost it after nothing new was really introduced in late game. \nSynopsis: Wait for a sale, worth playing if you enjoy these types of games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is buggy as hell. This isn't a \"released\" game, it is barely a beta version.\nSome of the bugs: (not comprehensive!)\n- Items disappear randomly or change shape or design after changing locations.\n- The warehouse doesn't calculate available stock correctly (sometimes it shows items as available, sometimes not).\n- Interfaces often glitch and can only be reset by reloading or changing locations.\n- Hinges and screws for disassembly often float in the air near the object you are trying to disassemble.\n- Indestructible items like chimneys float in the air after a house was demolished.\n- Some items respawn when revisiting a site.\n\nAnnoyances:\n- Interface for selling items (called contracts) is overly click-heavy and the contracts are so randomised, that 90+% of them could never be fulfilled (like 10 sofas, that would never fit into a single transporter) and therefore clutter your screen, making it just a bother to interact with it at all, even though the VAST majority of money is gained with it.\n- Contracts rarely ask for wood, bricks or drywalls, which is the stuff you typically have the most of.\n- Upgrading tools is expensive and barely increases speed.\n- The devs would rather add new fancy features that were barely asked for than address or even fix the issues that were in the game since the beginning.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was loving it till the recent updates broke it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Should've expected as much from playway",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "awful.....nothing like i thought it was going to be",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're thinking about getting this game, download the demo and play it through a few times until you're bored because there really isn't much more content that's worth it outside of the demo itself. \n\nThis game was initially a lot of fun, it felt like there were clear objectives and lots to look forward to, but it feels like I've reached mid-game about 10 hours in, and there's no real urge to see it to completion. It's repetitive. \n\nThe idea of the game is neat, but what it really lacks is any sort of tangible progression or end state. Later game contracts are made arbitrarily harder by implementing a \"day-tax\" penalty and making the contract 200km away. Being able to only sell collected items as part of bundles means you spend hours painstakingly collecting items that likely never get sold and just take up space in your warehouse. Overall, the upgrades just feel like something to waste money on to flesh out the maybe 5-10 hours of gameplay this game has than something that makes any tangible difference. \n\n90% of your in game time will be spent fighting the punishing mechanics of trying to fit items into your van. You can see the silhouette, you can see that it fits, but the hit markers won't let you place anything. This is especially frustrating when the later-game contracts take 2 hours each way to get to and you have to make numerous trips. \n\nOverall, fun at first, but if I had to do it all over again I'd wait for this game to go on sale for $5, play it on a rainy Sunday, then forget about it.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "I am still waiting for the game to be in what I'd consider a playable state before continuing. Here are the larger issues I've seen reported recently. I make no claims as to the accuracy or completeness of this list. There are a number of other minor and visual issues as well such as garage doors respawning, chimneys not falling when buildings collapse, furniture models / shadows getting messed up in the warehouse, trees clipping through vans, etc.\n\n* Items falling through customer van on travel, then unable to be picked up (10/5/25)\n* Items (rarely) disappearing when placing in van (10/5/25)\n* Relaxed-mode turning off randomly (10/6/25)\n* Destroyed entire house, only 92% completion shown (10/5/25, is this just visual?)\n* Furniture pallets (maybe also non-furniture?) disappearing from warehouse (10/4/25)\n* Various racks (cardboard, windows, wood) disappearing and/or partially falling through warehouse floor (10/5/25)\n* Items disappearing from site on travel (120cm drywall, 150cm beams reported 10/6/25)\n* Partially completed pallets / boxes disappearing from site (10/5/25)\n* Pending money lost on reloading save before end of day (10/3/25)\n* Cannot fulfill some orders even with correct item / rarity (10/5/25, maybe different items with the same name?)\n\n--------------------------------------\n\nI really like this game so far, but I can't recommend it in it's current state. I hope the bugs detailed below are fixed soon and I will amend my review afterward. Dev communication so far has been excellent in both the Steam forums and Discord (though I'd like to see a known-issues list), so I do have hope.\n\nUnfortunately, there is a bug which is completely killing my enjoyment where items can despawn when you leave the job site. The game is designed such that you have to leave and return multiple times in order to finish unless, maybe, you destroy literally everything, so I can't see any way to avoid this unless you are much better than I am at figuring out what will fit in the van by eyeballing it.\n\nThe first time this happened to me, another player let me know on Discord they had previously reported this issue (he had an early access key) and it seemed to happen to items you left near the delivery van. However, after starting over (I had lost a customer-requested item and didn't want to lose the reputation), I had multiple items disappear from inside the house. Brick pallets are apparently especially susceptible to this, though I had at least four other different types of items disappear, so it's not limited to them.\n\nThere are a couple other more minor bugs related to game settings. When I quit the game, all of my settings were reset and I had to redo them. Other people report this happening whenever they try to confirm the settings with the hotkey. (The workaround is to just exit the settings menu and select to save them that way instead.) Also, some people have reported that various difficulty settings (which are not modifiable after the prologue) are resetting mid-game.\n\nPeople also report progress-stopping bugs in the prologue and crashing, but I didn't experience them.\n\nThis isn't a bug per se, but I'd also really like a way to rotate items in all three dimensions. In particular, there is no way to lay an item flat. For example, drywall can either be set down at an extreme angle or at a low angle, but if you want to slide it in into the truck on top of a refrigerator, you're out of luck. With as much work as they seem to have put into the collision boxes and physics, and with van-tetris being kind of fun in general, it's strange how difficult it is just to put something into a space which is obviously large enough to accommodate it. It would also be nice if there was a way to \"nudge\" items without having to pick them up and completely reposition them. Also, items tend to bounce around like they're made of Styrofoam when you place them too close to the van walls, which is strange since the game won't let you place things where there are collisions.\n\nBeyond that, I was really enjoying the game so far, though I was only on the first mission post-tutorial. Disassembling items is a bit annoying and that's a little surprising since it seems like the optimal way to play in the early game is already to destroy almost everything and thus bypass the tools. This is because the starter van is just far too small for anything else to make sense due to fuel costs unless the job site is extremely close to the warehouse. This may change later with a large truck, faster tools and more expensive items, but I'm not there yet.\n\nDestroying stuff is fun in general, though it does feel like it takes maybe too many hits with the sledge. This may be something that gets upgraded later, I'm not sure.\n\nWhen picking up items like wood planks or bricks, and when placing them onto pallets, i would like to be able to hold down the button instead of having to press the button repeatedly. My RSI will thank you for making this change. :D\n\nThe warehouse is a really cool idea and it's fun to store things there. I don't know yet how I feel about the \"orders\" system where you look for people wanting things you have. It feels a little convoluted and game-y. I'd rather hold an auction or build a house or something.\n\nPerformance is great for me with a 3060ti and 5600x. With high settings, default FoV and DLSS 4 (the game comes with DLSS 3 but I updated it via DLSS Swapper) DLSS: Balanced is giving me 55-65 FPS in 1440p, which I'm doubling to 110 with Lossless Scaling while still having some GPU room to spare. I haven't noticed any hitching, though I wouldn't expect to since the game takes place in relatively small areas with a loading screen between them.\n\nI'd also like to note that I think the price is extremely reasonable and much less than the community had been expecting pre-launch. If the aforementioned bugs are resolved, this is an easy game to recommend.",
      "voted_up": false,
      "votes_helpful": 59
    },
    {
      "review": "Can't recommend in its current state. I enjoy the gameplay loop, but stuff like packing your truck needs work. The larger trucks are not as efficient as they could be, and the item hitboxes prevent you from stacking things to the ceiling. Stuff like doors, windows and walls are impossible to lay flat. \n\nContracts get ridiculously far away and very time consuming for little pay. And why would I rent a wrecking ball for $600 when the contract only pays out $350? The sale of reclaimed items and building materials isn't very good, I have a full warehouse and rarely get orders for what I have. \n\nI think I'm done with this for now until the mechanics get a rework.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "I originally bought this game, in the blind, because I love Ship Graveyard Simulator 2 so much, and was hoping this would be a building version of that. I assume I'm not alone in that, but am sad to report that this is not that.\n\nAfter a frustrating Tutorial experience, I decided to 100% the first level before writing my review, and ultimately have decided that this game is more not fun than fun, hence the thumbs down. Will you like this game? Maybe. I don't know. I'll detail below what the game entails, so you can decide if it sounds fun or not.\n\nFirst, this is not a Deconstruction Simulator game. At least not primarily. That comes like fourth.\n\n1st - It's a van loading/unloading simulator - Every plank, every piece of drywall, every piece of furniture, every bucket of small items, etc. must be manually loaded into your van, in a maddening game of wobbly-physics Tetris. And then, when something is sticking out just a little too far, and you try to close the doors, they will almost close, and then fly back open, so you can play Tetris some more. Then, once you finally get the load in and doors closed (of which you will have many many runs/loads per job), you get to unload everything in your warehouse! Every plank, every piece of drywall, every piece of furniture, etc. I hate this. Then, when it comes time to sell off everything you've stockpiled, yay, you get to load it all up again in the buyer's van! So you've now loaded/unloaded every single piece of everything, no less than three times, before you can get it out of your life. Did I mention I hate this?\n\n2nd - It's an inventory management game - Very few games handle inventory management well, and this is not one of them. It's usually a necessary bummer, but this game tries to make it the secondary game loop. Once you get everything to your warehouse, you have to sort it all into the correct shelves, like a HomeDepot worker stocking the lumber yard. Then, once my warehouse was full (after just one job), I couldn't sell any of it off because I still didn't have all of the items in any of the available client orders, so I guess I was just expected to start the second job with a full warehouse and start dumping stuff anywhere there was space, since my shelves were full?\n\n3rd - It's an IKEA furniture disassembly simulator - You spend more time taking apart all the different furniture pieces than you do the house. I will say, it is very satisfying how each piece of furniture auto-packages itself into a new IKEA box after disassembly.\n\n4th - It's a deconstruction simulator, which should really only be called a wall removal simulator - The ceiling and floors are just bashed with a hammer and thrown in the trash. It's only the walls that are taken apart and salvaged.\n\nLastly, this game has chosen punishment over reward. It charges you for gas. It charges you rent. When you complete a level, you don't get paid (immediately), but rather you invoice the customer and have to wait. If you break something you shouldn't, you get docked for it (why not instead reward a player who doesn't damage anything?). This realism isn't fun. I play games to NOT think about bills. Don't give me game bills.\n\n\n\nWish List\n- Let me carry more than 1 piece of drywall at a time. Loading/Unloading a stack of 50 sheets (3 times), one-by-one, is not a fun game mechanic.\n- You currently have to wiggle your mouse to use many of the tools. I don't want to wiggle my mouse, I want to click once and hold. This isn't a VR game.\n- Let me just sell off the stuff I salvaged. What am I supposed to do when the warehouse is full and there aren't any fullfillable orders?\n- Let me just chuck everything into the truck. If there must be a capacity system (volume? weight?) so be it, but I never ever want to stack anything in these ridiculous physics simulators. I hate it. It is not fun. It is what your game is, and shouldn't be.\n- The game runs hotter than an American Eagle jeans ad. Needs more optimization.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "I love these kinds of games, but many of the reviews are correct.  Play the demo 3-4 times and its the same thing.  The only difference is later contracts are worth more to make up for the upgrades costing significantly more. It feels like time gating to make the game feel longer than it really is.   You have the whole game at about 2 hours of play, but to get all the upgrades i would assume you have to play those 2 hours around 25 times to complete it. \r\n\r\nThe speed increase you get from several thousands of dollars of screwdrivers/chisels/etc isn't really worth it because the mechanic of selling the things you salvage is so frustrating because customers only want them in bundles with things you probably didn't save and theres no way to check contracts customers want when youre on the job site so you have to memorize or, more likely, ignore the mechanic. \r\n\r\nI made it to tier 3 contracts before giving up.  The upgrades are so expensive and the contracts only increase a bit.  I wanted to save up for a bigger van which is only $5000 but it felt like such a grind for a small payoff i gave up.  I am sitting on like $5000 of salvaged items i cant sell because i am missing 1 of the things the customer wants.  \r\n\r\nIt would be nice to see employees who could autoship what you already have so you dont need to look up and down your shelves to find the right item with the right rarity and move it to a van. It would also be nice to get a more powerful sledge hammer or different tools to bring to the site to help destroy small houses.   Would also like to see the base tools start at the level 3 tools speed for disassembly. Its an interesting mechanic, but it is such a carpal tunnel trap as it stands.  \r\n\r\nI hope that there will be more updates to bring more content to make it more worth the purchase",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "This had potential, but the gameplayloop get's way to monotone and tedius.\nThe only upgrades are making your tools work faster, and are superexpensive.\nSelling items are also tedius, the only reason you have such a big warehouse for your stuff is to wait until someone orders what you have, ridiculous, what if you could work together with a wholesaler, or even your own second hand shop?\nNo helpers to hire? Someone that can drive the vehicle and store your items?\n\nAs i said, it had potential, but  feels like they just wanted the product out and be done with it, a shame.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I can say I am enjoying my time with this game but, there are to many issues to give it the thumbs up. If you are someone that doesn't like doing the same 1 or 2 things over and over, then this game wont be for you. All you do is go to a site and get some items out for a customer and for your self, then either demo the whole house or a couple walls. That's it, besides selling a few things you brought back here and there. I would highly suggest trying the demo first as that is what you will be doing the whole game.\n\nIssues are:\n\n-Things disappearing from job site. Only noticed this happening by work van.\n\n-The shelves that store the items you disassemble are very finicky to place the items.\n\n-When completing a job, it would tell me I was going to loose rep like I was not done with everything. I would complete and seemed not to.\n\n-I get a loud noise when traveling to locations.\n\n-Performance needs work. I am getting anywhere from 70-100 on epic settings and around 144 on high settings and tanks to 30 when demoing parts of a house. I didn't really see any difference between the 2 settings but, still is a huge gap between the numbers. This game is not really all that graphically demanding and should be seeing higher numbers. Also, why are things in the distance blurry and bad looking? Nothing to take you out of the game like seeing a pixelated, blurry water tower, tress etc.  (RTX4080 Super, 9800x3d, 64GB)\n\n-The orders need tweaking. Don't get to many orders that I can fully complete.\n    -Need to be able to put items in recycling area or sell somehow when needing to make space. \n    -Need it so if you can sell a partial order and it doesn't hurt your rep. You are full filling items they are \n       after.\n    -Rep takes a massive hit when not completing a full order but, doesn't help when completing a full order.\n\n-Need to be able to toggle the difficulty settings individually that are offered after tutorial.\n\n-Loading things into the van needs work. Its a pain to get things in most of the time. Can't even load past a certain height. Items wont go over half the height unless the item you are trying to stack on is at or below that point.\n\n-When holding items, it shows a button to open door. When pressing the button it just want to set down the \n item in hand and NOT opening the door.\n\n[strike]-In settings menu, E is to accept changes but does nothing. Only way to change any setting is to back out to menu.[/strike]\n\n-Major bug: Saving and quitting before ending day will lose any pending money. Some times it is fine but, I am finding that it will wipe any pending money most of the time. So make sure to end day before you are done playing.\n\n-Items disappear out of hands on occasion when loading them into the shipping van in warehouse. \n\n-When buying pallets for warehouse, after purchase they would not spawn when selecting the pallet. It \nwould rather purchase another. Each time it would take money. Now there are 2 that I can see in the office. There may be more, just clipped inside each other.\n\n[strike]-Piggy bank achievement bugged.[/strike]\n\n-Brick Pallets clipping through each other when loading onto truck.\n\n-VSync is not working properly. With it on it keeps at 120 (unless I am breaking things in house) but, it should be keeping it at my refresh rate of 144. Turn it off and it gets to it or close to. my refresh rate.\n\n-No bay B when fully upgrading warehouse. \n\nFix issues and I will change the thumb.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Game is very buggy and monotonous. Items keep disappearing and my character got stuck where I had to exit the game and reload. The unstuck feature didn't work. The tools are slow even with the max upgrades. Money income is also very slow causing you to collect more things which means more slow disassembling. I feel like the game would be more fun with the income was faster. The game desperately needs employees to unload your truck or a way to move multiple packages at a time instead of walking slowly with one package. Also the house and item variety is low. At it's current state I don't recommend the game.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I endured this game as much as I can and now I think I can say this game sucks. I got the last permit, upgraded tools and warehouse and bought the big truck, but I did most of it just for the sake of it and see until the end if the game gets any interesting with new permits and more item space.\n\n1- It's a high when you first get into business, then it's downward spiral. There is no joy in this game, you can get more satisfaction and joy if you actually deconstructed a building yourself. Really, really boring.\n\n2- There is no music, no story, no end goal, nothing. Intro starts like you are on a revenge mission, you have a story, a target. But nope. After the tutorial you are on your own and only thing you see is the mission descriptions. No secrets, no easter eggs, no fun. You just go through the same dozen of houses over and over and over and over...\n\n3- There are some concepts they tried, like customer types, but it's shallow as a pool of piss. You can't set a quality for your products, you have to collect EVERYTHING or you miss the most profitable contracts because that wealthy customer wants a premium TV, a premium couch, coupled with some stupid common walls or bricks. You can't just focus on most valuable items, unlike what game tells you at the beginning.\n\n4- That cool wrecking ball in trailer? It's not free, you can't buy it, you have to pay a hefty amount at the beginning of the mission to use it and it's not cheap at all.\n\n5- Game has a lot of jank. Not only a couple of assets, whole second floor doesn't even collapse if you start hitting the bottom floor first. You will get used to see floating pieces everywhere.\n\n6- IF they implemented a \"set item\" system to contracts, that would improve the experience. Like, you see 8-pieces-premium kitchen set, well, tough luck, you sell each piece randomly. But if you could get a bonus for set items like chairs and tables, bed and wardrobe, TV and coach whatever, that would be great. But of course, it's way beyond the bubble of thought of these devs obviously.\n\n7- I mean, that's pretty much it for this game. There is nothing even exciting to complain about. It's THAT boring, shallow, poorly implemented and isn't rewarding. Stare at a wall instead.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Game is a lot of fun in the beginning, but late game playability is virtually non-existant.  You end up with racks and floors stuffed to the brim with nothing to do with any of it unless you draw a lucky card and have a so-called client make an offer for a bunch of your junk at once.  Just like it's predecessor \"Ship Graveyard Simulator 2\" late game must not be considered by the developers.  After playing over  400 hours my opinion hasn't changed much.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Can't recommend in it's current state. The destruction and physics feel underwhelming and janky at times(ceilings and door frames floating with no support). The wrecking ball vehicle is overpriced to rent per contract it feels and just saves a couple minutes of hammering for breaking your budget. The order system needs to be reworked because it feels ridiculous and barely have room to fit some orders(9+ brick stacks+other things) in the largest truck. The tool upgrades are good but there's no hammer or garbage bag upgrade.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Over all game is good for the price.. which is bad thing... \r\n\r\nIt just feels incomplete. Gameplay over all is enjoyable but game lacks some kind of \"late game\" \r\n\r\nGive me more upgrades, skills let me upgrade my carry speed, buy some industrial equipment for warehouse, let me whole sell items rather than pick x amount of specific items. Game just needs some love. And I woud be way more happy to pay 20-25€ for fuller game. Guesss i can only hope for more features to be added in form of updates or DLCs maybe.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "After 20min of trying to do the tutorial that is hella buggy I gave up. I really wanted to like the game.\nMaybe if it receives a couple updates I'll rebuy",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Man, fuck this game.\n\nNo wonder the in all the 'let's play' videos the streamers just destroyed everything with hammer and not give a fuck. Tediously picking up EVERY brick one by one and putting them in a pallet ONE BY ONE is not fun.  Game wants THESE bricks, BUT NOT ALL these bricks that look identical that came from the same wall?\n\nTell me I can take an item home, but only that one specific item other wise, penalty,\nTell me to destroy wall, well a brick fell and broke that desk you had no clue about, penalty.\nBreak this, oh your hammer's aoe went a pixel out of the invisible boundary of the item you're break and now you broke something else you weren't suppose to, penalty. \nCostumer only wants bricks from one wall? WTF, where does it say that. Thats not on the list of instructions. It says DESTROY WALLS, not dismantle and recover from ONE. Here's the kicker. The fucking game tells you dismantle is not the same as destroy, but you instructions tab.... counts a dismantled wall as DESTROYED in your task window. Make up your mind. Which fucking walls am I suppose to magically know are to be dismantled and which fucking ones to be destroyed because you for sure aren't fucking telling me.\n\nI just don't fucking get the rules this game is setting on me because its telling me one thing but adds on a ton of extra conditions I'm not aware of.\n\nShip Graveyard Simulator was glitchy as all hell but at LEAST it stayed consistent in how it and in what way it wanted you to do things. Here its destroy this, oh you destroyed it the wrong way, fuck you now. If you're asking me to be that FUCKING precise WITH A SLEDGE HAMMER the why the FUCK am I using the sledge hammer when the amount of time it takes to break the fucking way is the same as to dismantle it brick by brick/board by board AND I won't get penalized for invisible 'destruction' waves' from my hammer that is destroying desks on the other side of the wall.?",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Played the demo, it worked great, bought it can't even get past the tutorial, it keeps telling me to clean out the van when i have nothing in it and it wont let me continue without doing so. :( I've tried restarting, exiting the game, alt f4, trying a new play through nothing is working i keep getting stuck at the same place in the tutorial.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game is good however few things are letting it down.\n\n- Hit boxes on some items are awful.\n- Job pays $335 and the crane is $600 + travel costs + tax per day = A pointless contract.\n- Garage has 3 slots... Why? When there is only 1 of us.\n- No \"Rename\" company option\n- Lack of various options on contracts (Feels like i'm repeating the contract)\n- Some doors won't come off (See my latest livestream 03/10/25)\n- No second slot for delivery drivers (accepting multiple contracts to sell items would make it quicker)\nBuyers not buying what I have in stock\n\nOne the plus side it triggers my OCD......  I'll change this as progress with the game is made",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I actually enjoy this game and plan to keep playing, but in its current state I can’t recommend it. It feels like one of those 50/50 games where some people might like it, but right now it’s closer to 90/10 against.\r\n\r\nThe biggest issues:\r\n\r\nWarehouse feels pointless – customers almost never buy what you have in stock. I’ve gone 3–4 in-game days without selling anything, even with the knick-knacks box.\r\n\r\nDisappearing items – things vanish overnight or when you return to the warehouse. Example: I stack sheets, run out of truck space, head back to drop stuff off, and by the time I return the sheets are gone.\r\n\r\nFloating objects – tearing down a two-story house from the first floor leaves the second-floor doorway hanging in mid-air.\r\n\r\nUI glitches – if you bounce between the warehouse and jobsite, the house destruction percentage can turn from green to blank, even though it still shows 100%.\r\n\r\nIf the devs fix the warehouse system, disappearing items, floating pieces, and UI bugs, I think this could turn into a really solid game. But right now, it’s rough.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Slowly taking apart a house, now that part is fun. But everything else around it is dreadfully tedious. Taking valuable stuff to your warehouse? That requires loading  the stuff in a van in way that's a bit like analog tetris with a broken controller. Then you have to hire a delivery truck, pick up the items from you truck, bring them to the delivery truck, play the cursed tetris again, then send the delivery truck on it's way.\n\nThe game would be better if they removed the whole warehouse and made placing items in the truck automatic.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Being a big fan of sim games, I thought I would enjoy this, but I did not. The gameplay is very boring and repetitive in ways that other simulators are not. Many mechanics were difficult to use due to not being intuitive, having little to no instruction, and some not working properly.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "had hoped the game would change from start but it really doesn't. it is incredibly boring after a while. I have too many beams, bricks breaks stuff that i didn't even see, nor do i have any control over where they fall. Same houses and quests, just variances in how much you get paid. No real late-game objective. Upgrades are far too expensive compared to their use case.\nAnd the crazy amount of lag in this game is wild. Runs incredibly badly. \nThe sledgehammer is both too weak and too imprecise. The recycling is annoying because i can't sell all my wooden planks and beams but putting them in the recycling area just means you lose them.\nIt's a good way to waste 5 hours but I wouldn't want to pay 15€ for this...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The Jobs pay very little compared to the high priced upgrades, it costs $600 for a wrecking ball rental when the jobs pay less then $400 making it a pointless mechanic to have in the game, the orders people make is completely random when it should try to focus towards items you actually have, you cant buy your own demolition equipment or any kind of explosive, there is no upgrade to the hammer so its tedious having to manually smack the beams in walls especially when your hammer just gets caught on the mountain of insulation that just pours out of the wall the game gets very old very quickly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cool idea poor game-play. Loading vehicles is horrible, Tetris did it better. Lumber and wall panels go flying once loaded into van then if you pick up one. contracts are messy info is scattered. The amount you make per job based on what the job really is a joke. No one would do that work for little pay. adding items to your warehouse is pointless the orders ask for items you dont have or havent seen meanwhile your warehouse is full of other crap. No new tools to purchase, no appliance dollies. This game should have been early access release with its current state.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is fun for a while, but the grind kicks in quite soon. The amount of repeated things to do arnt to much fun.\r\n\r\nThe concept of the game is very nice, but it could be better executed. The amount of things you can take home is greater that the amount you can ship/sell each day, so take only the things that are most worth and destroy the rest... The warehouse is so expensive to upgrade / buy racks to put stuff in, it makes no sense. And to top it off, the largest truck you can buy is still to small, it take atleast 5 trips to take all the stuff from a basic house.\r\n\r\nThere are also alot of bugs in the game;\r\n- loading the truck, where things fall/clipp through the truck\r\n- loading the truck, where every item should be in the truck but the doors wont close\r\n- driving from the job side to the warehouse and coming back to the job side to see that more than half of the items (put in front of the house) are despawned\r\n- placing items in racks in the ware house, and seeing the items despawn the next day\r\n- cant disamble doors\r\n- when destroying walls, door instandly break\r\n\r\nAll with all, good idea, but not to well executed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy this game! I want to recommend it! I really do! It's SO close!!!\n\nThere are plenty of reviews that rightfully point out the game's glitches. The developers seem to be on top of things and I don't doubt a future update will flip this thumb around. Seriously, if there was a maybe thumb, I'd do that. Alas, Steam be Steam.\n\nThe game, at its core, has three issues that hold it back more than even the glitches.\n \nThe first might be a minor or major issue depending on who you are. While the beginning hints at some kind of story or narrative to encourage you to continue growing your business, this kind of just vanishes after the tutorial. While this isn't a deal breaker, it does make any failures of the game's other systems stand out all the more blatantly.\n\nThe second is the gameplay loop. The overall flow is: Go to site, collect as many materials/valuables as you can, break everything else, clean up, go home, sell what you brought back. The primary issue with the loop is that the \"sell what you brought back\" portion lags far slower that you are going to be getting materials and valuables. You sell the items in the form of requests that are fully random both in how close to full value the item is, how many items they want, and what kind they want. That means that you will VERY quickly accumulate a ton of inventory and seriously struggle to get rid of anything.\n\nTo clarify why this becomes a problem, let's say you treat a home like a Buffalo and carefully break down everything you can and bring back everything you can as I started doing early on.  If you get unlucky, you might never seem to get a request for lumber and even if you do it will only be for one particular kind meaning you will accumulate a ton of one specific size that you can never seem to get rid of. All of the items you can bring back and sell have this problem and you could go several in game days of nothing only to have one order asking for a ton of stuff but they just HAPPEN to be asking for the ONE thing you don't have and there's no assurance that the next few contracts you do will have what they are asking for. So you just end up accumulating more junk hoping desperately you are hording the right stuff.\n\nThe third is probably the biggest disappointment: Lack of hazards. Hardspace: Shipbreaker is probably the abject best example of how to handle games focused on deconstruction and has a feature that easily puts it ahead of the rest are hazards. As you are working, you actively have to consider what you are tearing apart and how. Without hazards, games centered on deconstruction inevitably just boil down to a very monotonous cycle where you smash stuff until it falls over. There's no fear of being under the roof as it collapses, no pipes you need to close off, and, heck, you can literally smash the power bank that provides the building electricity hard enough to make it explode into sparks and nothing happens.\n\nThe third point is honestly the biggest elephant in the room for me. Ironically, Ship Graveyard Simulator 1 had this exact same problem and even the sequel doesn't really utilize hazards enough to be a huge challenge. As it stands, the most efficient method of playing this game is to recover any item people want, smash the two edge planks holding walls up until all of the walls come down, pack up the mess, and leave. Without any risk to smashing buildings apart like a maniac, the game just turns into one of those rage rooms where you smash stuff to let off steam.\n\nGreat fun in the flesh. Digitally, it gets dull very quickly when you realize everything you smash just feels the same.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At it's core this game is fun, I am sure that more content will come the game play loop will probably become very monotonous and should they add more content its something to look at modifying the game play to add more mechanics. There are quite a few game breaking bugs that really ruin your reputation.\n\nFor example one is if you take items back to your warehouse from a contract even if you 100 percent take or destroy items and then sell it on a order it subtracts from the contract total. It has left the location and it should not count negatively towards your contract.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game doesn't respect your time at all.\n\n I was having fun at first.    Due to my eagerness to complete orders  after salvaging  I took orders that I didn't have enough of certain material needed for those orders  First couple starts I spent too much money on racks and could never expand the warehouse.  \n\nSo after the last patch I started over again.   This time I didn't buy any new racks outside of tutorial.   Here is where the lack of respect for your time comes in.   I was very meticulous on salvaging of a house.  I disassembled all the fixtures and kept everything that I could.  All the panels and bricks. I filled up all my storage for materials.  I salvaged enough bricks to make a minimum  of 17 filled pallets along with my filled storage.  I placed all the excess pallets of full bricks and wall panels in the recycle zone which I thought would just sell the items.  Using the hand scanner it says 100 for a full pallet of brick  so you would think I would at least get 1700 for all those pallets that took me a few hours to put together since you can only carry 5 bricks at a time....nope only got money for the full bags or scrap and got some sort of mark  for stuff on the warehouse floor even though I put all the stuff I wasn't going to use in the recycle zone.  \n\nOther issues that annoy me with this game is the placement mechanic.   You can't tell how things are stacking when you are putting things into the van.  Even the demolish mechanic with the sledge/ brick tool gets  time consuming with just aiming.  I also don't like the night cycle.\n\nSo after that last restart thinking that I could sell stuff I salvaged  after spending all that time with the bricks and annoying placements of wall panels and not get paid  for excess material I put into the recycle zone. It just doesn't respect your time for trying to be meticulous for saving as much material as possible.  \n\nMaybe after a few patches things will change but right now it is just frustrating.\n\n10/11/25 After the first few patches 1.0.7 things are still frustrating.  Its tough to play the game when all of a sudden the screwdriver doesn't work or stalls.  Can't play the game  when it bugs out and you cant even dis-assemble anything.  Re-load and click on a desk to dis-assemble and then nothing works. I want to play this game.  With all the bugs it bums me out.  Maybe in a few more patches things  will improve.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Laggy interface, and the game's safe area does not fit my monitor. Tried all settings and could not find a way to adjust it. The game also crashed my PC for no reason and now I'm having issues with my microphone being detected on discord and other VC apps. Do not recommend. Refunded the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "constant crashes, can only go about 5 minutes or so before the game crashes, sometimes 30 if im lucky",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is an ok game, but I would categorize this as Early Access.\r\nThe system works, but is very basic. It's buggy in a few places, but overall pretty stable.  No crashes.\r\nIt does have some serious quality issues.\r\nShelf items are not labeled, so you have to rely on pictures, and some items have the same picture.\r\nThe video glitches at night when you use a flash light.\r\nThe physics bugs out on 2 story buildings when you collapse a wall that causes multiple floors to collapse.\r\n\r\nThere's a huge opportunity for upgrades that they didn't think about (is this AI slop):\r\n- Add an upgrade to the computer for a picker system (highlight the item in your order)\r\n- Add an upgrade to the shelving to show an electronic label of what's on the shelf.\r\n- Add item SKUs\r\n- Add an upgrade for a lift assisted exosuit to remove the weight penalty in the warehouse.\r\n- Add an upgrade to hire warehouse assistant that will unload and sort truck inventory.\r\n- Add an upgrade for AR goggles for the scanner that auto tag/highlights items in the house according to value.\r\n- Add an upgrade to shred overstock that you place in the recycling area so you get trash credit.\r\n- Add an upgrade to set shelf category for auto sorting.\r\n- Add an upgrade for palette robots to move bricks, wood, doors,windows, etc.\r\n\r\nThere's huge opportunities here to improve and expand the game, but in it's current state it's just an Early Access indie game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's some 200.000 games on Steam right now. You could be exploring faraway galaxies, leading vast armies, saving a beautiful dragon from a horrible princess, you could be building magnificent cities, or perhaps entire civilizations that will stand the test of time. You could be securing the future of your royal dynasty by getting to know your sister better. You could be a master assassin, or an ancient vampire, heck you could run around and cause mischief as a goat. Either of those would be more fun than what the devs, appropriately named Incubator, are expecting you to spend your limited time on this planet on. \n\nThis game lures you in with a promise of explosive action - something that could help lower your cortisol levels after a stressful day job. Instead, it offers an exciting opportunity to do a second job in your free time. Indeed, the Destruction tag in this mostly refers to your sanity. You get half a dozen tools in this game - screwdrivers, saws, you name it. And all of them but one you can upgrade many times. The one you can't is the sledgehammer. You nominally have it, yes, but the game goes out of its way to discourage your using it. That's because it wants you to spent 10 minutes carefully dismantling a wardrobe - one screw at a time - because you can then sell it for more than the entire contract's worth... And the wrecking ball? Well, it costs $600 to rent one, when the contract to wreck the house pays... that's right, $600. Mic drop.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}