{
  "positive": [
    {
      "review": "1001 ways to die : the game\ntruly a masterpiece 10/10\nbest dlcs of any game ever",
      "voted_up": true,
      "votes_helpful": 44
    },
    {
      "review": "Twice I completed every achievement (yes, 2 different accounts)\nThrice I ascended to Dead God.\nAnd still I return to the basement… willingly.\n\nI’ve seen more room layouts than my actual house.\nHalf my decisions in life are now based on whether they feel like a Devil Deal or an Angel Deal.\n\nI adore this chaotic masterpiece.",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "A love letter for the players that try it with its lovely Christian story and the family friendly items , i heartfully recommed this",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "If you love hardcore games with high replayability, where every attempt is a unique experiment, and you are not put off by the dark and specific theme, then Rebirth is one of the best games in its genre.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "I've never reviewed a game before and I will likely never review again but I have to recommend this game. it has a great gameplay loop feels fun to play and I can spend hours on this game and feel like no time has passed. I'm nowhere close to getting dead god but this is a game that I feel I deserves to be 100 percented",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I've played thousands of hours on my switch until I finally got it on PC. This is one of my all time favorite games. You go from a crying child to a being with unimaginable power. Every run is so different and I'm still learning new things about this game to this day. It's a masterpiece of replayability with its hundreds of items and all the unique combinations. I'm glad to see it still being updated and improved upon. Internal Item Descriptions has made it so much easier for people new and old to play this game.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Isaac Id be crying if I looked like that too bruh thats fucked up what the be doing to yall i ain't even gone hold you bro be saying that's fucked up like bro you probably had the full wash and set ya shit be fire proudly if they ain't cut your shit fuck it tho bro its your life.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "With near infinite replay value and content in the form of an arcade game its the ultimate classic roquelike.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Game's great. Challenging, weird, tons of replayability. Over a decade and they're still adding features? Worth every penny.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A legendary classic roguelike that still gets updates from time to time. You can sink tons of hours in this game and still have fun, even more if you get a friend to join you in the chaos.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing gameplay, theme, and music. AFter so many years still so much to do and discover.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Spent so many hours in binding of isaac, still worth playing til this day. though one of the challenges, cantripped is unbeatable as soon as an item spawns, the game crashes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i love this game its so good, also lazy mattman is the goat so yeah",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 — A Roguelike Masterpiece \n\nThe Binding of Isaac: Rebirth is one of the most rewarding, addictive, and brilliantly designed roguelikes ever made. Every run feels completely unique thanks to its massive pool of items, enemies, and room variations. No matter how many hours you put in, the game always finds a new way to surprise you — a broken synergy you’ve never seen, a devil deal that changes your whole build, or a chaotic moment that turns disaster into triumph.\n\nThe gameplay is tight, responsive, and incredibly satisfying. Early runs feel scrappy and tense, but once you start stacking items and discovering powerful combos, the game transforms into a wild, unpredictable power fantasy. The amount of variety is incredible: dozens of characters, multiple final bosses, branching paths, secret floors, hidden challenges, and endless item interactions that keep you experimenting run after run.\n\nBut more than anything, Isaac has soul. Its dark humor, eerie atmosphere, and unsettling themes create a world that’s weirdly emotional and strangely compelling. The pixel art is beautifully detailed, the soundtrack is hauntingly memorable, and every element of the game leans into its twisted, surreal identity in a way few games dare to.\n\nThe replay value is practically infinite. You can play for 20 hours or 2,000 hours and still discover new combinations, secrets, and strategies. It’s a game that respects your time, rewards your skill, and constantly pushes you to grow, learn, and adapt.\n\nWhether you’re chasing unlocks, aiming for high-difficulty runs, or just enjoying the chaos of unpredictable item synergies, Rebirth delivers an experience that is unmatched in the genre. It is challenging, creative, dark, brilliant — and endlessly replayable.\n\nA must-play.One of the greatest roguelikes ever made.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a great game with insane replayability.\r\nIt can be a bit tough and unfair at times but that makes winning (either by luck or by skill) more rewarding in my opinion!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "got infinity percent, account got fucked, now doing it all again, yay",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A very nice game, great support from the creators - you can see how much love and effort is put into it. Even 10+ years after the launch, the game still gets big updates and changes.\n\nEvery run is different from the others, and there is always something new to surprise you.\n\nHave played over 1k hours, and hope to play many more yet!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "So dogshit at the game but its great, even better with friends/",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Binding of Isaac: Rebirth is the best roguelike I’ve ever played. It's challenging, but that's what makes it fun, and there’s always something new to unlock. The dark, quirky art style and great music match the fast-paced gameplay perfectly. If you're a fan of roguelikes, this is a must-play!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Brilliant game carried me through the hardest time from college to postgraduate study. Inspiring and relaxing game content find me inner peace in the long dark night.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Hands down one of the best Roguelites there is.\r\n\r\nPlease, just play it. Its good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's literally the best Roguelike ever made!!! Edmund made peak years ago and it still holds up (And at the time of writing) is still getting a major update to it's latest DLC!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I would sell my entire soul just to have one MORE run of binding of isaac.\nDude I just got into that game and that game is so good, I'm like straight up addicted.\nI have an art history exam in like in quite literally like 10 days do you think I'm studying for that \nno\nin fact right NOW is the perfect time to get on the sack...\nI'm gonna pop up my laptop and GET ON, and there's NOTHING ANY of you could do to stop me",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very good rougelike with pretty good gameplay that you can spend hours on without realizing it. Get this one first and try it out BEFORE you buy the DLC in case you don't like it as much as you thought.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is just perfect... the amount of ragequits you will do during this game is just a perfect number, and even if you ragequit, you will return.... this game... wants you to return\n\n9,9/10 Game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has reminded me that I'm a talentless hack, and don't deserve anything good in life.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "lots of fun, so much replayability, very difficult to 100%",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The first roguelike I ever got into. This game got me through university.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The perfect roguelike.\n\nOne of the best games in history, unmatched within the gender as of 2025. definitely a masterpiece, Edmund fucking cooked with this one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing this game for years now. When it came out I was a wee lad, now I grown up and still playing it from time to time. Best game, best replayability  and now, with introduction of coop, best game to play with your buddies. Would recommend to anyone. Oh, and it has a steam workshop",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Out of any rougelike I have ever played, Isaac stands out as one of a kind. There is no other game that gives the possibilities, and synergies that exist in Isaac. After playing for 30 hours I see many of the same items, but none of my runs ever feel the same. Isaac offers a huge amount of replayability, on top of that the game itself is just fun. Although I'm a little late on playing Isaac, I can say that in a time when rougelikes have become somewhat repetitive and uninspired. Isaac stands as a beacon in the genre as a timeless game. I wouldn't be suprised if this becomes one of my most played games. If you enjoy rougelikes and you haven't played Isaac, then play Isaac, because it will give you possibly the best rougelike experience you will ever get.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really don't need to say anything, you already know what this game is, and the fact that it's still getting amazing updates to this day since 2014 should tell you about the magnitude of this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ohmygod.... peak..... community/fandom, modding support, mods, gameplay, the devs themselves, story, everything.......... definitely get the game full dlc its worth the price",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "probably the best roguelike ever created, especially post Repentance. Been with it since flash and seeing where it is today brings a tear to my eye. Thanks Edmund, you sucker.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "when i first got this game, i instantly fell in love with it, as it has so much lore and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but absolute chaos. This game does not hold your hand and i think for this type of game its great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game can feel pretty challenging at first, but once you get the hang of it, it becomes incredibly fun and satisfying. The synergies you can create are insanely varied, and I highly recommend giving it a try. There’s just so much you can do—mini-games, multiple floors, hidden secrets, and tons of unique interactions waiting to be discovered. If you enjoy deep, replayable games, The Binding of Isaac is absolutely worth diving into!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got trapped in a chest by my religious mother then escaped and got the game is so peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RAAHHH\r\n\r\nAddicting.\r\nJust trust, you'll like it. It's worth every cent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best roguelike ever made. theres so many items and combos to try out. all the dlc adds a lot of content and is definitely worth it especially on sale. steam workshop is an amazing way to add random whatevers to your game for endless amounts of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite possibly the greatest roguelike to ever exist, the grand poobahh of flash games, the grand daddy to fun and rage. I hope it only keeps growing into more DLC, theyt can beat this horse to death like Skyrim for all I care.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "John Rougelike, runs on anything, near infinite content, great DLC, good game, only problem is that Jacob and Hitbox exist",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes i recommend this game its super fun and has alot and i mean ALOT of stuff to do / unlock alot of charcters and secrets so yeah i recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very enjoyable grindy dungeon crawler with lots of unlockables and different gamemodes,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Isaac is one of those games that grabs you from the first run and refuses to let go. The blend of grotesque humor, unsettling atmosphere, and strangely charming art style creates a world that feels unlike anything else. What truly makes the game shine, though, is how every item you pick up can completely reshape your run, turning chaos into surprising synergies that feel both ridiculous and brilliant. The achievement system is woven deeply into the experience, constantly rewarding you with new items, characters, and secrets that keep expanding the game long after you think you have seen everything. No matter how many times I die, I always feel that pull to jump into just one more run, and somehow each one still manages to feel fresh. For me, this remains one of the most addictive, replayable, and cleverly designed roguelikes ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd say at this point im the leading authority on this game with my vast swaths of knowledge and hands on know-how and with that being said yea its great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. When I describe it to friends, I just say, \"It's a bit disturbing and extremely addicting. You should get it.\" I use it as a game to play when I want to game and chill.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Splendid game, now I can't even look at any Religious bumper stickers in the US without thinking of a stupid little naked crying baby dancing over finding a dead cats head in his basement.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A challenging but very rewarding game, lots of gore-like stuff so that might make some uncomfortable. Takes a lot of time to learn a lot more to master and fully complete, If you get into it, will definitely take a lot of your free time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the amount of time I have put into this game amongst multiple platforms is more than I have ever given to my family. Would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's very easy to empathize with Isaac; it's as if you are the crap kid. Enemies are crap, but that's okay. The big poo is a bit crap, but there's nothing you can do about it just beat. In fact, there's a lot of crap in the crap overall, but having this much crap is enough crap for something that's already crap. Crap/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Noice but i suck in it (also i recommend to buy all dlcs at once cause its worth it)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Favorite game in my steam library. I've played it for so many hours but keep coming back to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and lot of challenges and things to do. 100+ hours of gme play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As one of, if not THE, original roguelikes to popularize the genre, this game really delivers a type of fun that's difficult to normally get into. Bullet hell is usually off putting due to the pressure normally put on the player to avoid taking any kind of damage. Binding of Isaac is much more forgiving but can be at times just as brutal with a gameplay loop full of unlocks that delivers a very satisfying result. Absolutely worth a try just to know where a lot of this genre comes from, and as a relic of older flash game days.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i never thought i'd play a game where you cry over countless piles of shit and use beans to fart all over your enemies, but 600hrs later here we are. peak roguelike",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1000+ hours and I still discover new synergies or new rooms \nThis game is just so sick and so much fun in many ways\nSo many ways to break the game\nSick bosses\nSick music\nSick artstyle\nI love pretty much everything about this masterpiece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the binding of isaac is one of the greatest games ever made, it takes time to learn but theres a lot of things to help you do so. Id suggest this game and its series to anybody, it deserves all the praise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing, I've been playing it for years on different accounts and it's great to see a game like this still have such an active community. Nerf Tainted Lost.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute endless gameplay.  I don't see me ever stop playing this masterpiece and I highly recommend it for any rougelike gamer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to hate this game. A group of my friends showed me this game and they sped through it in 12 minutes. So I decided I would never touch the game again, my friend convinced me otherwise. \r\nPlaying through the game at my own pace, I cleared the save files and tried again. Binding of Isaac is now one of my favorite game and it has introduced me to how much I truly love rouge-lites.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Um dos melhores rougue-likes que já joguei na minha vida, tem problemas em quererem ficar balanceando jogo offline???????????? Mas no geral, isaac é um jogo realmente muito bom, porém, recomendo a compra com uma boa promoção e é claro... Com todas as dlcs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game, very good dungeon crawler game with a lot of good options for characters and a great choice of items you can get to change your attacking",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game after the Repentence+ expansion, my only skill issue is playing Jacob & Esau.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My personal favorite roguelike. I've played all iterations of this game and it keeps getting better. Even in 2025 it still gets updated. Insane replay value, amazing character design, and fun to figure out your own broken builds. I will always return to this absolute masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The binding of Issac has an unreal level or replayability and every run is entirely unique. Finding which items have the best synergy guarantees a high success rate against late game bosses. Would definitely recommend with all DLC content purchased as to ensure all your challenges and progression is saved.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Confident in claiming that this is genuinely one of the best roguelikes to have ever graced the genre. There is so much to this one, it is almost intimidating at this point. My review will be based off the full game with all DLCs, because you should honestly be playing with all of them for the best experience. Except maybe Repentance+, that one is up to your discretion as I normally don't play with it.\r\n\r\nGameplay is simple to start but incredibly satisfying to master as it becomes more complex. Learning how to approach enemies and situations, as well as manipulate your own luck to turn the tides in your favor is a skill unto itself. Don't get me wrong, there is plenty of randomness to the game and sometimes you will get absolutely shafted, but by-and-large it feels fair and wouldn't be as replayable without some bad runs here and there. \r\n\r\nBuild variety here is incredibly diverse. With over 700 different items and a massive amount of synergies between them, it will actually be quite rare that you have runs that feel the same. Plus, with such a massive repertoire of potential build paths, you can make almost any run a winner if you practice the main gameplay. Honestly, variety really is the name of the game here, not just with items. Trinkets, health types, enemies, bosses, special encounters, endings, hell the sheer amount of just room layouts in this game is STAGGERING. The majority of the characters are unique and offer very interesting ways to engage with build choice. Challenges are super fun and give you even more new ways to play, although I do feel like there could be more by this point. Bosses are fantastic for the most part and ending ones in particular can be quite challenging.\r\n\r\nVisuals in the game are phenomenal for the style, and in particular Repentance adds many new animations and crispness. Music is full of bangers and still slaps after over 500 hours. Of course, despite it not being the main focus of the game, the story is fantastic. I love the way that a lot of the bosses and items weave into the narrative. It is dark, witty, and at many moments quite sad and heart-wrenching. I still catch some feelings when ascending to Home.\r\n\r\nAlthough it is not a reflection of the game itself, I would be remiss if I didn't mention the modding community. A fantastic community of people who have made so many amazing mods for the game, ranging from QoL and visual upgrades, to hilarious animations and audio changes, to content packs that add EVEN MORE variety to the game, to gameplay and character mods that completely change the fundamentals of the game itself. Obviously I think it's best to stay vanilla at first and experience the game as intended, but the mods are absolutely worth diving into once you have.\r\n\r\nThis is THE quintessential roguelike experience, the pioneer. If you haven't at least tried it yet, you are absolutely missing out. One of my top games of all time, 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I learned of this game back in the day, way back when i didnt even have a steam account. Watched gameplay of an argentinian youtuber doing crazy shit and since then wanted to play it for myself, played it a very small amount but enjoyed it either way :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this back in Rebirth was new but i had to pirate it cause i was so poor so many good times now that i have money bought the game and its dlc officially and having a great time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Binding of Isaac is much like a bad ex, just when you think you're done with them it ropes you back in for more sessions of CBT\n\n10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A truly amazing game, arguably the best dlcs out of any game you can play Issac for hours upon hours and still unlock new things (gift me repentance pls)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Glad the game still receive updates til this day. The one game I've invested the most hours in. Nearly 67% in getting Death God on all three save files; time to lock in and git guud.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best roguelike game. Insane replayability, a lot to unlock and discover.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This always has something new to find, unlock, and  discover. Great game to loss yourself in and gives plenty to experiment with item combines.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and challenging rouge like game, it takes some time for it to actually be a lot better and progression wise as well. You unlock more stuff naturally as you go on as well!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Issac since I've been playing on the switch and bought it again on pc so I could mod it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never thought of playing a game about a naked kid running around in their parents basement would be so entertaining with so many synergies of tears and methods.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most extensive and fun rougelikes out there\r\nWill pretty much never stop being fun especially if it keeps getting updated like that",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If this game didn't spawn the \"action-roguelike\" genre, it certainly put it on the map.  Countless games have followed the blueprints laid out by Isaac, but none have felt as deep or complete.  There is just so much to achieve and unlock, and the loop is so fun to keep trying, that this game is meant to be enjoyed over years not hours.  It's got just enough difficulty and randomness that you come to realize there are no \"unfair\" runs.  You just should have made better decisions.  The cherry on top are the updates and balancing we still get after all these years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game will test you're patience. Many times will you rage. However when you finally understand and get a good run you will be the happiest person on earth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the single game that got me into rouge-likes, definitely buy if you like rouge-likes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I FREAKING LOVE AND HATE THIS MOTHERFUCKING GAME, IS LIKE GAMBLE, YOU GET IN, YOU GET ADDICTED, YOU LOSE YOUR HOUSE, YOUR DOG, YOUR GIRLFRIEND, YOUR KIDS, AND ABOVE ALL, YOUR SOCIAL LIFE. YOU FEEL LIKE GIVING UP, BUT YOU TRY AGAIN, AND YOU WIN. HONESTLY, FUCK THIS SHITTY GAME CREATED BY THE STUPEFIED GENIUS EDMUND MCMILLEN. 10/10 110% RECOMMENDED",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Co-Op is even more amazing than solo and solo is already absolutely addicting. One of the best games I have ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the most funest game every becuase it has lore and can be hard but fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most replayable, in depth games ever produced. Yet it's still so simple, it'd take 5 seconds for someone that never played it to start. Looks great, sounds amazing, plays like crack. Anyone that disagrees is commiting BLASPHEMY AGAINST THE HOLY SPIRIT. AND SO I TELL YOU, EVERY KIND OF SIN AND SLANDER CAN BE FORGIVEN, BUT BLASPHEMY AGAINST THE SPIRIT WILL NOT BE FORGIVEN!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fuck the bloat.\r\n\r\nOtherwise, great game with amazing replayablity.\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest games of all time, out of every game in my library I find myself gravitated to this one over and over again, even after long spurts of inactivity. I fail to find anything bad within the game play it... [i] or i hope you will, in your next time, a cow on a trash farm, you sucker. [/i]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What started as an indie flash game (I believe) has come far beyond most triple A titles today.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the OG game, works well, Co-Op a little buggy but overall can sink a lot of time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really fun wierd but funny i like the indie vibe and i recommend this to others",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "soooooooooooooooooooooo fun. i wanted the game for a long time and when i finally got it i was blown away. the thing i like most about this game is the fact that every run is different and it has like 600+ achievements and 3 DLC's and mods so its safe to say that you will never get bored. Also its not too easy but its also not too hard so right in the middle wich is also very good. So if you're looking for a chill but also action packet game this is for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So damn entertaining. Could literally play for hours and not get bored. Awesome gameplay and each dlc includes so much more content to make your game even better. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tons of replayability.  runs on a toster, lots of fun.  stiff learning curve",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dumbahh isacc baby ends up in a psycho lair with weird ass fuckin blobs flying around the place, best game for people who what to trip on a wavy cap.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sometime you just wanna punch the monitor but this is one of the best games ever created",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never ending entertainment. Constantly finding and understanding new items, and unlocking characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "seem like a nice game for an afternoon or two....aaaand it's digital nicotine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Best Roguelike: Game Score 10/10\n\nThe sequel that fixed pretty much everything that original Isaac was missing. The best thing about Binding of Isaac (BOI) is that every run is save able and winnable, there is very rarely a run that can not be beat and made to work with good play or a room that forces you to take damage if played correctly. The amount of characters, items and side routes especially with the DLC this game got means that playability is so vast that I may never 100% this game. BOI is one of the most complete roguelike experiences you can get. The most nuanced synergy system of items I've ever seen in a rogue like, almost every item interacts with each other in a way or another. The DLC and updates it receives consistently makes you always come back to it.\n\nThe gameplay of BOI is definitely the main hook of the game, but the art style and music in Isaac is different and interesting. The art style is sometimes grim, sometimes colorful and sometimes just silly. This art direction helps categorize and make items and item classes (devil items, mom items or angel items) much more recognizable and fun. The music and sound effects are nothing I would maybe listen to outside of playing the game, but nonetheless these pieces and effects fit perfectly to the atmosphere of the game and make the experience so much better and fuller.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that literally never gets boring. With over 2300 hours in this game, I still find myself discovering items and having challenges. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is nice, even tough it is repetitive but it has variation that make it feel non-repetitive. Would recommend to buy the DLC's tough, worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Apparently there is a glitch that just deletes all your steam achievements randomly. They knew about it for years and instead of fixing it they threw a bandaid on it with a button that just straight up gives you your save file unlocks all at the same time?? Whatever man, 400+ achievements and 5 years of memories gone",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "this game for no reason does open anymore i dont know why and i really want a explanation this is a fun game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Forced to play Greed Mode for unlocks stalls the enjoyment of the game.\nAfterbirth+ nerfing things in a singleplayer roguelike is baffling.\nAlt paths not very fun although there are some gem boss fights.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Edmund McMillen. You little fucker. You made a shit of piece with your trash Isaac. It’s fucking bad this trash game. I will become back my money. I hope you will in your next time a cow; on a trash farm, you sucker.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Base game 10/10 but then afterbirth and afterbirth plus make it so much worse repentance adds a lot of great stuff but just feels like ragebait 6/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Originally, this game was amazing. Absolutely stunning and one of my favorites, but for almost a year now I've been completely unable to play it. No matter what I do, it crashes upon start-up. I've tried everything, it's sad that my money has gone to waste for being unable to play this for as much as I wanted to, I never was even able to install mods. Fix this, please.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I tried to play the game but everything was just black and when I hit the space bar to get into the game everything minus what the rooms look like were black",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the Binding of Isaac, I just don't think any normal person should be subjected to this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game death after death only so close to glory this game is a sin and I hate it.\r\nHave I said that I hate this game yet?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly didnt get into it. It is a good game but soemthing just doesnt click for me. Definitively give it a try if its for sale but personally if i wanted to play a roguelike i find Hades much more fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controller input so unbelievably fucked that it rotates the joystick inputs by 90 degrees",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fix your game Edmund it's been more than 10 years man\n\nEdit: This game is actually a virus and disables your microphone",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought because it's an indie classic apparently, on the level of Hollow Knight and Undertale. It's funny if your five, genuinely gross. Repetitive af. enemies that are designed awfully like spiders. bosses that do like 2 things at best. and is unesicerily complicated, no visual indicator of breakable walls. dosn't tell you what half the stuff does, the stuff it does tell you it binds to a button it doesn't tell you how to use.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I no longer enjoy video games the same way,,,,,,,,its 10/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was going to wait until I 100%ed this game to review, as I often do, but I just cannot. This game has been one of my favorites for so long. It is what introduced me to one of my favorite genres of games, all that stuff. That is when I was bad at complex thought. This game is not good. This game seems to be almost entirely luck based, and unlike so many other games in the genre, there is no way to mitigate that fact. There is no way to increase the quantity or quality of items and quite literally nothing is reliable in this game. I can excuse that, to an extent, but what I cannot excuse is the genuine fucking torture that is the tainted characters. The tainted characters are fun a lot of the time, yes. They are also genuinely awful to deal with. Tainted lost is one of the worst gaming experiences I have ever had the displeasure of dealing with. I love risk vs reward characters, and this is a character that expands upon that from one of my favorite characters, base lost. Unlike base lost, however, this one is bullshit. You get one hit per run a lot of the time. Which yes, is the ultimate skill check, but also, in a game that is so built on the leniency of getting hit, considering the bullshit spawning mechanics, tainted lost is so dreadful to play with. There should not be a skill check character in a game that so heavily relies on luck for anything to get done. And on the topic of luck, one of the ONLY ways in which you can mitigate it is by minmaxing every single floor. Which is fine, I enjoy minmaxing because of something that is wrong with me. But of course, there are speedrun achievements, So that is just more luck. And that is compounded when you are playing the other most dreadful character, tainted cain. I like tainted cain in concept. He is just so unfun to play with. Any run with him will take about 3 times as long as a different characters, and you still need speedrun achievements while playing him, which either entails getting the singular crafting recipe that allows you to skip said time requirement, or just not have basically any items. Genuinely fucking dreadful. There are numerous other things I could mention, like a couple of the challenges, which McMillen has gone on record stating that one of them is straight up not fun. but one thing is the fucking price oh my god. If you want the \"full\" experience, you need to pay for so much dlc. The base game is fine, more enjoyable even, but attempting to move from console to pc or something like that costs so much money. Oh my god and the curses. The fucking curse. On hard mode, which is the main mode you will be using if you want to beat the game, you have a 1 in 3 chance to have a curse on each floor, and they are frankly just not fun. Curses affect information and movement, and only one is even remotely entertaining, the other are just a nuisance, especially curse of the blind. It isn't fun to have less information, all it does is take up more of your time in this timesink of a game. Finally, before i write another essay length review, I just do not like how many achievements there are. I love achievements, but there is an achievement for every single unlock. It feels cheap. I understand the reasoning, but having a game with 644 achievements skews my stats in a way that is simply not that fun. So even outside of the game it causes issues. But for the good, the atmosphere and music is great, as well as the fact that when you do get a good run, it is genuinely very fun (provided you don't get tapped by a random little guy as tainted lost and lose 3 hours of progress without any fault of your own). This is not a very unbiased review. Im just mad. I sure the game is slightly better than I have portrayed it, but none of my critiques have been even close to nitpicks (other than the amount of achievements). Overall, it is a fine game, fun even. Is it a good enough game to actually play? No.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Make sure you do your research on youtube. One of the worst games i paid 15 dollars for. should be 3 dollars. Rage inducing gameplay with little room for error. Same thing over and over. Refund please!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah bro im gatekeeping this shit its too good so good i cant reccomend i will be the 1 and only binding of isaac player",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The most overhyped shit on the planet earth. Not to mention all the startup crashes (no mods) entirely on the game design/dlc fault. (Apparently this issue is really old now)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so... YOU are telling ME??? that I pick a character, and then HAVE to play them?? you've gotta be joking.. please fix this :);)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overrated honestly, people glaze it just because its an indie game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely terrible game. What a complete waste of my time. And get this — when you die, you’re thrown all the way back to the beginning. Seriously? That’s not challenging, that’s just lazy programming. I’m telling you right now: do NOT play this game. Save yourself the frustration. 10/10  rex is a ginger and WE hate them .",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fix the hitboxes makes the game insufferable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so bad 200+ hours in and theres banban or jumboo josh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game dev diet consists of crayons, glue and chalk. makes dlc that breaks all previous mods. splits modders in half. pre dlc vs post dlc.  mmmmmm yummy crayon.,",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfun combat, I truly do not understand the hype.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a blight and a pox upon my spare time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "holy shit the online sucks edmund how long has this beta been out for",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "as soon as i bought the DLC's, the game couldn't open",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i honestly just really don't understand the hype behind this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Def over rated, never EVER had an ounce of fun..... totally",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant get brimstone so until i get brimstone ill keep this a no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dumass game ion get how yall mfs play ts",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unplayable after 2024 update",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not enough dead children on the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Get it when you can buy the DLC's if you want to mod it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks butt\r\nfuck needles",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just lost an r key run im fucking pissed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "u need good game u need all dlc at ones",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "will not let me play the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EDMUND MCMILLIN!!!! I WILL BECOME BACK MY MONEY!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't do it you'll be trapped in the basement forever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spiders suck",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'd refund If I could",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too much items",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Where the fuck is my hitbox!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "jacob and esau",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "jacob and esau",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SPIDER CAN BURN IN HELL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no fortnite :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "little too grindy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bloat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much going on.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "edmund",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jogo",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kinda mid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unfair BS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "peak",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hater",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i have aids",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "troll bomb",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "eh idkkkk",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "M",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Apparently there is a glitch that just deletes all your steam achievements randomly. They knew about it for years and instead of fixing it they threw a bandaid on it with a button that just straight up gives you your save file unlocks all at the same time?? Whatever man, 400+ achievements and 5 years of memories gone",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Please fix your multiplayer, its been a year of constant desyncs. Me and my boyfriend made a save file to do deadgod on and we can't play a session withou constant desyncs. \r\nbethany took so long because our runs would just end, and going back in the party doesn't fix it. you start with no items and don't get completion marks. \r\nthe machine on greedier is also impossible to get to ful with 2 people.\r\nplease at least fix your beta multiplayer that is so fun but the most deplorable thing at the same time. Runs with 40 to 50 min investment dont even end on death they end on desync.\r\nthere wasn't a time where we didn't rage quit after it happened",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the way this game is gatekept to new players through dlcs, obscure items/paths, and enemy attacks that are not telegraphed (EX: delirium) makes this really hard to recommend to a friend",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "tainted lost cant go in curse rooms\ntainted keeper cant go in curse rooms\noverall i wish i never found out this game existed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is definitely a great game, and if you enjoy the base version then the DLCs are absolutely worth it. With that said, if you like to 100% games, you could honestly do better than sinking your teeth into the bone and nail sandwich that is this game. This game will not respect your time, and 100% is frankly a ridiculous endeavor. So, let's perform a little science experiment on how long it could take you!\r\n\r\nLet's assume that you, a new player, are absolutely godly at this game, and never die. In order to complete one of the harder achievements in the game, you must beat one of the final bosses in under 20 minutes, which is no small feat by any means. But you? YOU can beat any final boss within 20 minutes! And seeing as there are 11 main endings to reach you begin your trek. So, you do this, and for that character with no deaths and a consistent fast pace can complete every mark in just 3 Hours and 30 minutes! (I'm shaving off some time here to make it easier to read and also because you are a God Gamer)\r\nNow for the 'compounding'. You have 16 other characters that you need to do the 11 endings with as well. Some of these characters have some fun gimmicks, but mostly are the same character, with a few notable exceptions. (The Forgotten and Lost my beloved)\r\nSo, 17 X 3 Hours and 30 Minutes would round up to 59 and a half hours, or 2 days and a half.\r\nThat isn't some small feat, mind you, if you were really gunning for 100% on other games you could probably complete them in around 10, maybe 20 hours, but you sunk your entire weekend nonstop and finally got through it all!\r\nAnd then you press the E button, and find yourself face to face with the OTHER 17 characters, each with their own unique play styles wildly different from the last! So, take your time and double it, 5 whole days. Now, if I played a game for roughly 100 hours, I'd maybe start to get bored of it. But since you are gunning for aiming for 100%, you stick with it, managing to flawlessly beat the two tainted characters that can die in one hit if you're being silly. No deaths!\r\nBut did you really beat all of those in one sitting? Of course not, you're not a psycho! You did it all across a month so you can get your Daily Run in!\r\nYou know, the Daily Run?\r\nThe one you had to \"attempt\" *run into the nearest fire within the first minute* every day for 31 days? With no tracker of how many days you've completed? God I HOPE you did, because logging in just to do that specifically would be annoying! And your reward for such *Dedication*?\r\nA pill that fires an explosive round that, unless you remember about that one pill out of other possible 48, will most likely hurt you if you are too close to a wall. God help you if you were about to fight the boss that teleports at random through the arena, moving faster than you can go at max speed without a shield as the character who dies in one hit without that said shield!\r\nBut you didn't, right? YOU beat them, first try, you legend! You managed to scrape by using only Bob's Brain, a pair of scissors, and the ability to spawn a single poop per room! You never reset the run, you just took what the game gave you! So what if you were missing a key for 3 straight floors and as soon as you open the treasure room are met with a fly that floats around your head to damage enemies? You can work with that!\r\nBut now you are prepared for the REAL fun: The Challenges, of course! All 45 of them, assuming 20 minutes, another 15 hours, no knock off your belt. \r\nEven the challenge which makes it so every item has an unknowable effect that could either make you God or summon 30 flies every time you pick up a coin was no issue.\r\nAnd same with the one that doesn't let you heal, makes all items invisible, and whose only legitimate accepted strategy in the entire community is to just reset until you have 2 specific items! And makes every enemy stronger, while expecting you to go down one of the longer routes of the game. Even the game developer said \"I never said it was fun\" when asked about the challenge REQUIRED for 100%.\r\nBut the game is perfect! The developer wouldn't do something sadistic or downright unfair JUST to make the player upset, right? Nah, you just need to Get Gud, play the game on the hardest difficulty (Because some items don't unlock if you don't play on the hardest difficulty) for almost an entire week FLAWLESSLY.\r\n(We'll just ignore the unspoke achievements as well, like the one where you have to use a specific pill 5 times in one run, of which it has a chance of not appearing, or not picking up any coins or hearts or bombs in one run)\r\nAnd now, for the final piece to bring it all together! Collecting EVERY single item in the game at least once, all 732 of them! Each with their own chance of spawning, some only in specific rooms, some with less than 1% of a rate to drop! But you would never reset, right? It's not how the game was meant to be played, the game even discourages it by making health run away from you if you do so too much! It takes a while, but you can finally say you 100% the game!\r\nAnd that's the official 100%!\r\nONLY the Official 100%!\r\nNo need to go looking otherwise at the 2 other save files, which, if you beat THOSE 100% then you'll get a neat little image on your save files for 300% completion!\r\nYou TOTALLY spent ONLY a week straight in the game and would call getting the OFFICIAL 100% as enough, right?\r\nYou ABSOLUTELY never went upwards of an hour on a run only for you to die in one hit because the game never makes its circular red bullets look different from YOUR circular red bullets, right?\r\nYou DEFINITELY DID NOT sink 22 WHOLE DAYS of your life on one save file to a game which asks you to come back every day for 31 days, RIGHT?\r\nTruly, this game is a blast, and is very fun if you plan on doing it casually. But for your own social life if you're a completionist do NOT buy this game. You're better off, trust.\r\n\r\nAnd Edmund I swear to GOD if you add another DLC I will become back my money.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game for no reason does open anymore i dont know why and i really want a explanation this is a fun game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Forced to play Greed Mode for unlocks stalls the enjoyment of the game.\nAfterbirth+ nerfing things in a singleplayer roguelike is baffling.\nAlt paths not very fun although there are some gem boss fights.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game really really suffers from Iterative Myopia. It's not objectively a bad game, but its fundamentally a nause to play. The game has had what seems like an obsessively bitter game developer, intentionally punishing his player base in recent years for enjoying his own IP. Filled with unnecessary bloat, annoying RNG and item slop. It can be fun at times, but as others have said the fun is dependant entirely on the luck of your run. Its too unforgiving and in the end annoying to play.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I feel bad for this game, I still like to play it but it need updates so badly.\nOver the years of adding contents, which for most is welcome, we can all agree that it made the game infinitely more complex, they doubled the amount of items, more than doubled the amount of trinkets, same for characters and enemies.\nAnd I'm not complaining about that but right now we have borderline beta content, bs rooms, old boss with awful patterns with newer mechanics in the same bundle and I hate that.\nTboi was unfair and rng for the sake of it and right now the game feels like it's entire content is conflicting with each other while before it was about completing 30 marks total now we have 10 times all of what it was, I need to beat this telefrag delirium mess AND beast in the same game, can we update old contents already?\n\nI have the same feelings with the new tainted character, I mostly enjoy all of them (that poop guy is disgusting, i hate it) but items feels not always very well adapted to them, item mechanics are straight up debuff or not working so while they implemented new mechanics to have a fresh new game-play the game still feels like a stats race... because yes, over the years who ever is handling the patches felt like nerfing all Q4 items (mega mush is in the game and solos anything btw) for the sake of it so now, we're no longer able to win with Q4 we also need to pile up damage stats that got a lot more rare to get with all the content they added.\n\nTo summarise what I mean, most of the content they added conflict with itself, messes up balance while we could add tons of synergies everywhere with what we already have, we need the old bosses to be updated (delirium, lamb, satan and some elite to name a few) and anything that would avoid me having to stop playing to open up a wiki.\n\nWe got item descriptions not long ago, couple enemies has brimstones warning to avoid getting hit across the room and pentagrams where enemies will spawn aswell! All of that are steps in the right direction and is welcome.\n\nTboi is getting complex and it's fun, I love when I have tons of stuff to do in my games but this one needs to evolve and adapt to it's expensive dlcs, it has SO MUCH to offer... Thanks for reading this far",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game when I was able to play, but ever since they removed mac support i havent been able to play. GIVE ME MAC COMPATIBILITY!!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Edmund McMillen. You little fucker. You made a shit of piece with your trash Isaac. It’s fucking bad this trash game. I will become back my money. I hope you will in your next time a cow; on a trash farm, you sucker.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Base game 10/10 but then afterbirth and afterbirth plus make it so much worse repentance adds a lot of great stuff but just feels like ragebait 6/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Originally, this game was amazing. Absolutely stunning and one of my favorites, but for almost a year now I've been completely unable to play it. No matter what I do, it crashes upon start-up. I've tried everything, it's sad that my money has gone to waste for being unable to play this for as much as I wanted to, I never was even able to install mods. Fix this, please.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I tried to play the game but everything was just black and when I hit the space bar to get into the game everything minus what the rooms look like were black",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the Binding of Isaac, I just don't think any normal person should be subjected to this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was going to wait until I 100%ed this game to review, as I often do, but I just cannot. This game has been one of my favorites for so long. It is what introduced me to one of my favorite genres of games, all that stuff. That is when I was bad at complex thought. This game is not good. This game seems to be almost entirely luck based, and unlike so many other games in the genre, there is no way to mitigate that fact. There is no way to increase the quantity or quality of items and quite literally nothing is reliable in this game. I can excuse that, to an extent, but what I cannot excuse is the genuine fucking torture that is the tainted characters. The tainted characters are fun a lot of the time, yes. They are also genuinely awful to deal with. Tainted lost is one of the worst gaming experiences I have ever had the displeasure of dealing with. I love risk vs reward characters, and this is a character that expands upon that from one of my favorite characters, base lost. Unlike base lost, however, this one is bullshit. You get one hit per run a lot of the time. Which yes, is the ultimate skill check, but also, in a game that is so built on the leniency of getting hit, considering the bullshit spawning mechanics, tainted lost is so dreadful to play with. There should not be a skill check character in a game that so heavily relies on luck for anything to get done. And on the topic of luck, one of the ONLY ways in which you can mitigate it is by minmaxing every single floor. Which is fine, I enjoy minmaxing because of something that is wrong with me. But of course, there are speedrun achievements, So that is just more luck. And that is compounded when you are playing the other most dreadful character, tainted cain. I like tainted cain in concept. He is just so unfun to play with. Any run with him will take about 3 times as long as a different characters, and you still need speedrun achievements while playing him, which either entails getting the singular crafting recipe that allows you to skip said time requirement, or just not have basically any items. Genuinely fucking dreadful. There are numerous other things I could mention, like a couple of the challenges, which McMillen has gone on record stating that one of them is straight up not fun. but one thing is the fucking price oh my god. If you want the \"full\" experience, you need to pay for so much dlc. The base game is fine, more enjoyable even, but attempting to move from console to pc or something like that costs so much money. Oh my god and the curses. The fucking curse. On hard mode, which is the main mode you will be using if you want to beat the game, you have a 1 in 3 chance to have a curse on each floor, and they are frankly just not fun. Curses affect information and movement, and only one is even remotely entertaining, the other are just a nuisance, especially curse of the blind. It isn't fun to have less information, all it does is take up more of your time in this timesink of a game. Finally, before i write another essay length review, I just do not like how many achievements there are. I love achievements, but there is an achievement for every single unlock. It feels cheap. I understand the reasoning, but having a game with 644 achievements skews my stats in a way that is simply not that fun. So even outside of the game it causes issues. But for the good, the atmosphere and music is great, as well as the fact that when you do get a good run, it is genuinely very fun (provided you don't get tapped by a random little guy as tainted lost and lose 3 hours of progress without any fault of your own). This is not a very unbiased review. Im just mad. I sure the game is slightly better than I have portrayed it, but none of my critiques have been even close to nitpicks (other than the amount of achievements). Overall, it is a fine game, fun even. Is it a good enough game to actually play? No.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I hate this game death after death only so close to glory this game is a sin and I hate it.\r\nHave I said that I hate this game yet?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly didnt get into it. It is a good game but soemthing just doesnt click for me. Definitively give it a try if its for sale but personally if i wanted to play a roguelike i find Hades much more fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controller input so unbelievably fucked that it rotates the joystick inputs by 90 degrees",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fix your game Edmund it's been more than 10 years man\n\nEdit: This game is actually a virus and disables your microphone",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought because it's an indie classic apparently, on the level of Hollow Knight and Undertale. It's funny if your five, genuinely gross. Repetitive af. enemies that are designed awfully like spiders. bosses that do like 2 things at best. and is unesicerily complicated, no visual indicator of breakable walls. dosn't tell you what half the stuff does, the stuff it does tell you it binds to a button it doesn't tell you how to use.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I no longer enjoy video games the same way,,,,,,,,its 10/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Make sure you do your research on youtube. One of the worst games i paid 15 dollars for. should be 3 dollars. Rage inducing gameplay with little room for error. Same thing over and over. Refund please!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah bro im gatekeeping this shit its too good so good i cant reccomend i will be the 1 and only binding of isaac player",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The most overhyped shit on the planet earth. Not to mention all the startup crashes (no mods) entirely on the game design/dlc fault. (Apparently this issue is really old now)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so... YOU are telling ME??? that I pick a character, and then HAVE to play them?? you've gotta be joking.. please fix this :);)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overrated honestly, people glaze it just because its an indie game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely terrible game. What a complete waste of my time. And get this — when you die, you’re thrown all the way back to the beginning. Seriously? That’s not challenging, that’s just lazy programming. I’m telling you right now: do NOT play this game. Save yourself the frustration. 10/10  rex is a ginger and WE hate them .",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fix the hitboxes makes the game insufferable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so bad 200+ hours in and theres banban or jumboo josh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game dev diet consists of crayons, glue and chalk. makes dlc that breaks all previous mods. splits modders in half. pre dlc vs post dlc.  mmmmmm yummy crayon.,",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}