{
  "positive": [
    {
      "review": "This isn’t Final Fantasy, it's DMC with a Final Fantasy veneer. While its heart isn't the epic world, it does have all the chess pieces. Chocobos. Crystals and Magic and The Empire. A moogle. Eikons/Eidolons/Espers/Summons. I can't say that it's not wearing Final Fantasy's costume well, but it's still lacking compared to entries including and before XIV: A Realm Reborn.\r\n\r\nYou can feel the bones of a great world under the surface, but the game never actually lets you live in it. It wants to show you a legend instead of letting you take part in one. Everything that used to make the series feel like a sprawling fable has been boiled down to a straight line with a fireworks show at the end.\r\n\r\nExploration doesn’t matter because the world doesn’t trust you with anything. Chests are meaningless, gear is flavor text, and sidequests mostly exist to remind you how sad everyone is while handing you rewards that don’t change a thing. There’s no sense of discovery, no delight in wandering off the beaten path, no moment where curiosity pays off. The game isn't built for players, it’s built for viewers.\r\n\r\nAnd the party system? It’s gone in everything but name. Characters orbit you like set pieces, occasionally shouting flavor lines while you do all the real work. It’s gorgeous, the combat feels good, and the presentation is immaculate, but it’s hollow in the places that used to matter. It’s a stage missing its ensemble, a story missing its world, a Final Fantasy missing its fantasy.\r\n\r\nFF16 is a well-made action game, sometimes even a thrilling one, but it’s not the next chapter in the series I grew up with. It’s something else wearing the coat, hoping the logo on the box will convince you otherwise. If you want spectacle, you’ll get it. If you want a world that feels alive, a story you inhabit, or an epic that rewards your curiosity the way this series once did, you’re going to feel the absence like a missing limb.",
      "voted_up": true,
      "votes_helpful": 483
    },
    {
      "review": "This game, for all intents and purposes, is good. Great, even. It's absolutely worth playing, and its common criticisms are either overblown or technically correct but avoidable/literally just inconsequential.\n\nHere's the longer review. No spoilers.\n\nFF16 is a game that spends around 10-15% of its runtime being literally the coolest game ever made. It divvies up the remaining ~90% being either a very good literal movie (seriously, there are some long cutscenes) or a questionable \"open-world\" game clearly designed by MMO-makers. Sidequests are essentially are \"Go here, do thing,\" and while I quite like simple MMO-type quest design, even I stopped really doing them around the 70% mark, despite the fact that the stories they tell are genuinely really, really good.\n\nThe story of this game is great, in my opinion, and given how divisive it is I don't really think I can give it a blanket \"do recommend\" versus \"don't recommend.\" It gets better the more you chew on it and its themes alongside HOW those themes are represented. It's a solid ride throughout, with some great emotional highs and never really any low points. Again, while I liked it, it's a story that appeals to my sensibilities, and it DOES take a pretty hard swerve in the back half that might sting if you live and breathe for the political shenanigans of the first half. I will say that despite how much I like the story, its execution and pacing does have issues. There's so many moments in the game where it randomly decides to slow things down and have you do errands, and while these moments are there so that you experience some worldbuilding/character interaction, it really doesn't feel that good to go from an insane visual spectacle of a kaiju battle to... needing to go fix a ship.\n\nGameplay-wise, it's also quite good. Solid if simplified DMC-inspired combat (with a smattering of Witch Time) where the bulk of your options come from the six (technically nine) cooldown-based abilities you choose to use in combat. Unlike DMC where you're mostly interweaving combo attacks with arcade-style inputs, this game has a grand total of one weapon, and to go with it, two weapon strings (one in the air, one on the ground) and basically no other options. It never really gets annoying, but combat when your Eikon abilities are on cooldown can get a bit boring because you really don't have many options when it comes to pure melee. Lots of criticisms come from players who say that there are optimal abilities to use and that they make every battle the same, and while it's true that you can optimize for damage, you can also do that in any DMC game by spamming Stinger over and over. Suffice to say that while you CAN treat every fight as a QTE to set up big damage (and honestly, with some of the pre-final boss mob encounters, you'd be hard-pressed not to), it's still up to you to try and be stylish. However, I do somewhat agree that most Eikon skills are kind of nothingburgers, sometimes visually but usually statistically. It feels really bad to use a skill that you think looks cooler only to find that it does way less damage or has way less utility than another skill, mainly because you only get 6 ability slots and the ability cooldowns are so long that it's only natural to want to maximize them.\n\nHilariously, none of the Eikons nor their skills really feel good to use when you first get them (aside from literally the first two, and that's because their Eikonic Feats are basically part of your basic combat skills rather than their own actual abilities). I honestly kind of suspect that the devs spent so long making their own game that they'd gotten used to the Eikons and not really realized that they all feel strange to use off the bat. \n\nWhen it comes to subsystems, you can customize your ability loadout, but aside from that... there's basically no RPG under the hood (which, may I say, is a flaw, but not the one people are making it out to be). The game gives you so many fucking crafting materials that you can't even use because there's nothing really to craft them with. You get 3 accessory slots that range from complete jokes of items (most of them) to actually pretty game-changing ones (though the majority of these are in the DLC). Weapons and armor don't do anything. At all. They make number bigger. Shining glowing items on the ground are basically useless because they're more crafting materials that you CAN'T USE. It's also why the world isn't worth exploring in the least -- it's pretty, sure, but there's nothing in it for you besides finding some neat environmental details and probably another 3 chunks of Wyrrite you have nothing to craft with. It is genuinely beyond me what the point of this gear system was. The game also has character stats that you cannot affect in any way beyond levelling up. The only time this ever comes into play is if you try taking on some Hunts (miniboss bounties) that are above your current paygrade, where a 15-level difference essentially puts the fight onto Nightmare mode. They're sometimes welcome challenges, but because the game has you on a level curve (XP grinding is a monumental waste of time), most of that challenge will be gone if you choose to just come back a couple hours later into the game.\n\nThe game is a visual masterpiece, enough said. The Eikon bosses are the best setpieces in any video game I've ever played, to say nothing of the regular story bosses (and even some minibosses!). If there's anything you'd get this game for, it's these absolute masterpieces. In addition, basically every area of the game is eye candy and the game does a really good job of conveying atmosphere no matter where you are. Same goes for music. The game's music is very good (when it wants to be) and immersive. Enough said, really.\n\nIn all, FF16 is a great game that is worth playing, though not without valid criticism of its many flaws (I feel a need to say that not being a turn-based Final Fantasy is decidedly NOT a flaw). Mindblowingly spectacular at times and unbelievably menial at others, I believe that this game's mountainous highs manage to shine so bright that some of its cavernous lows are entirely made up for.",
      "voted_up": true,
      "votes_helpful": 50
    },
    {
      "review": "If you like cutscenes you'll love this game. I quite liked the cutscenes. If you hate cutscenes, you'll hate about 40-50% of the game. The combat is great.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Hands down, before i even go into anything else, this is one of the best games i have ever played.\n\n+ The story telling of this game is better than most hollywood blockbusters. Thats without it already being over 50 hours long, the amount of effort that went into the plot is just astounding, possibly even unrivaled.\n\n+ Visually the game is stunning. There are a ton of areas I came across and just had to take in for a bit because they are so grand, or tranquil, or otherworldly, the people who put this game together seriously knew what they where doing. \n\n= The game is fairly priced, its literally 1$ per hour. Not counting dlcs. This is astounding when you consider the quality of the game. \n\n+ Gameplay was near seemless, i think i ran into 3 crashes, and i only lost a total of about 3 minutes of data. Other than that and some cutscenes loading weirdly, it was just really easy to get lost in the combat because I didn't run into any issues.\n\n+ Speaking of combat, I got so many flashy moves to pull, everything looks wild, the game is REALLY easy on normal, but thats part of what makes it so fun. It just feels satisfying to dispatch 20 or so enemies in one or 2 fell swoops. \n\n+ The amount of cinematics are insane. Again, this plays out like a movie, except even most high end movies aren't nearly this good. I really felt compelled by the plot, im currently taking an ethics class and this is really using ethics to its most extreme. Clive is blatantly an existentialist (Logos), who does not believe humans will is controlled by divinity, while the enemy in question is a god that see's all of humanity as a means to an end, they might as well just be taking directly from Sartre at that point .\n\n- I think my only problem was the dlcs, which gave me some nice weapons and such, but where pretty short, and the Rising Tide has some really shoddy plot lines. Like I feel like Rising Tide was made by completely different people, the views are amazing, but the plot is so bad.\n\nAlso.... if you get rising tide..... LEVIATHAN IS HARDER TO BEAT THAN THE ENTIRETY OF FINAL FANTASY 16 + ECHOES OF THE FALLEN + RISING TIDE (WITHOUT LEVIATHAN)\n\n^ like seriously, i died at least 7 times to that one boss, and i died 3 other times through the game. \n\nTo recap, other than fucking leviathan being a little shitty ass piece of shit who spams heavy attacks and is a shit. The game is extremely EXTREMELY fun, its very much worth your money. I can't think of a better game than this.",
      "voted_up": true,
      "votes_helpful": 53
    },
    {
      "review": "Genuinely a great game from start to finish. Very strong cast, good story and the combat is almost as good as DMC5's. Yes, the side quests are a slog to get through, but the game makes up for it in every other department.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "A game so good even a Devil May Clive. I've been hoping for decades for a true DMC/FF hybrid, and the Lord of DMC V combat himself oversaw the combat system. Just a few mods, and it plays wonderfully, a FF power fantasy with smokin sexy style. The plot is mature, and the game treats you accordingly. The plot, the emotional gut punches, the music, I have not played a FF title this good since X. BUY. THIS. GAME.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Finally completed the game after doing all the Side Quest and all the DLC.\n\nEnjoyed my time with the game.  Fantastic Soundtrack.  Although I did have a few GPU crashes with the game that were quite annoying.  Which caused me to have to redo some boss fights.  If you do get the DLC package, I recommend doing Rising Tide First (As you will get something that will be useful to you), then Echoes of the Fallen.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Whether you like it or not you can't deny it has BY FAR the best boss fights and cinematic scenes in any final fantasy, it is personally my second favourite final fantasy overall so far, every boss fight left me stunned and wishing they were all longer.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "FFXVI is a gorgeous game. It is a visual spectacle. The characters, environments, audio design: all of it combine to give a weighty epic opera-tic feel that is FINAL FANTASY. The world building is also a great fave of mine, a blend of vaguely european feudal kingdoms liberally interspersed with now standard FF tropes like chocobos and eikons. I feel immersed in a realm where men are real men, carving their own path. Who doesn't daydream of being some noble scion, with the hand of destiny upon you? \n\nOn the aspect of gameplay, combat is fluid, and forgiving. I'm sure battles will get tougher, but the game's prologue (which is about 2 hrs!) does a really good job to ease you into the controls and the plot itself. The english voice acting is EXCELLENT, and really sells the idea of a medieval soldier. \n\nFFXVI is a retelling of the ancient stories: the knight on a quest, the vengeful son who lived, the vagabond who awakens to his destiny... none of it is really new, but we love it all the same when true masters weave the tale.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "FINAL FANTASY XVI is an excellent game\n\n+Graphics(In terms of graphics, the game looks very good and everything is very detailed and well thought out.)(It looks so good that sometimes you feel like you're watching a movie and not playing a game.)\n\n+Gameplay(The gameplay mechanics are very easy to learn and the fights are fluid and the combat is good. The only downside is that the camera is sometimes chaotic.)\n\n+Story(The story is really good and will keep you in suspense until the end. It is well told and I really like it. There are some parts where it could be more developed, but otherwise it is excellent.)\n\n+Atmosphere(The atmosphere in this game fits perfectly, the medieval period is a good choice and everything fits very well.)\n\nFINAL FANTASY XVI is an excellent game that offers a new experience in this great franchise, it offers a lot and a very good story, just like in other games in the series, you will find new characters and a new world to explore, even if this time it is not open world and more linear.\n\n10/10 Must Play One off The Best(I recommend buying it at a discount or full price, it's worth the extra money, I recommend buying the COMPLETE EDITION)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is so crazy. The music, the boss battles everything. I would say this first, don't do the side quests, they are boring and a waste of time. Just focus on the main story and you will enjoy your time with the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Almost everything about this game is a 9/10 and that's high praise. story, graphics, combat, characters may be a weak point but then i see Cids face and hear his gravely voice. the cinematic of the boss fights is a 10/10 i wish it ran a bit better on my machine something was lost when my PC stutters on the poetic beauty that is almost every boss! but still again and again i said to my wife, WOW the beauty of this fight! do i wish it was less linear, sometimes but I also picked it up because I wanted a more directed story to get lost in.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game will forever hold a special place in my heart for teaching me how to hope again, the themes within this game have been essential towards helping me out of the trap of despair and depression life has thrown me into.  \n\nI resonate with this game because of how it tackles oppression, being a trans individual I connected with the struggles bearers go through and I love how the game tackles oppression in a realistic way but also offers glimpses of hope. \n\nPersonally one favourite quote of mine from this game is: \"I want to create a world where you're judged on who you are, and not what you are. But the world isn't ready for that yet, so until it is I use the power I've been given to show people there is hope.\".\n\nI embodied that quote into my mentality towards life, it used to make me mad depressed that I can't erase all the discrimination minority groups are subjected to. But what I am able to do is do what is within my power to show other trans individuals that there is hope, this was the driving force that shifted me from a mentality of wanting to inflict harm back onto my oppressors to wanting to help out as many trans individuals I can. Like Clive, I worked from shifting away from a heart of hate to a heart of love.  \n\nUntil the world is ready to accept trans individuals fully, what we can do is keep on using our power to make sure other trans individuals maintain a heart of hope instead of despair. I resonated with Clive so much in this regard that I actually made it my dream goal to do exactly that, if I can do my best to give hope to as many trans individuals as possible, I'd be happy with what I've done in my life. \n\nI love FF16's story telling, since even though I'm saying this specifically about trans people. All of what I've said can be applied to any oppressed group, which is why I consider FF16's story to be truly beautiful. \n\nI know a lot of people don't like FF16 due to issues the game has or because it strays away from turn based combat, but from a subjective stand point it changed who I am as an individual. Which I will always thank the FF16 dev team for. This review is more about my personal impact rather then trying to put up an argument that if FF16 is good or not, if you happen to go through similar mental struggles I think giving this game a shot might help. \n\nI've been playing FF16 while in severe depression and some of the story beats really hit me deep. It's better help me understand how depression can try to win us over and how to recognise those patterns, which in turn teaches me how to overcome it. \n\nProbably one other thing I really loved in this game is it just teaches you that being a softy around your friends isn't cringe, I think society has conditioned us to not be emotional around our friends or acknowledge how much of an impact they have on us because it's cringe.  \n\nI think one of the reasons the game had that type of impact on me, is because I see Clive as this super overpowered badass individual who I think is cool as fuck. So when I see this guy being kind and soft to his friends, I believe that is being cool as fuck. So now I'm growing softer to my friends since I think it's cool as fuck xD \n\nWhich in turn has also helps me better to start feeling emotions again, I know there was a shifting point where I started properly appreciating my friends, learning to better share my interests, my emotions, acknowledging how they're integral to my happiness. TBH, I think it all originally started with this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Visually beautiful game inspired by 14. Do not miss this game. its a blast to play with a good story",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Simplesmente amei esse jogo, do início ao fim, ele fica em segundo lugar pra mim (primeiro é do Final Fantasy VII).\r\nO final desse jogo me deixou de coração partido, apenas joguem.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have cried three times.... great game, great time. My only complaint is the amount of cutscenes and dialogue. It's not so bad if youre following the story. Even some of the filler side quests have good lore and add more depth to the story",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "On my 6th playthrough to get 100% completion across multiple platforms.\r\n\r\nGood story, great acting, beautiful environments, absolutely amazing character development and lore, beautiful music, and a near-perfect love letter to long-time Final Fantasy fans who enjoy trying new gameplay experiments with each new installment in the FF franchise.\r\n\r\nBattle system could use some polish, but for being the worst thing about the game, it was surprisingly fun with some customization; The cutscene-type abilities really slowed down the pace of the battle, as well as some of the Eikon Feats doing the same, so with the right ability setup, the battle system feels much more intuitive, responsive, fast, and fun. My favorite Eikon to use is Titan equipped with two counter-abilities--there's something about landing a three hit Titanic Block counter or Raging Fists counter that just feels so good! My least favorite Eikons to use are Ramuh and Bahamut because their pausing-type abilities feel so out of place in an action-focused game.\r\n\r\nOverall, if you can get around the quirks of the battle system, the game is well polished gem overall. I hope they either make a sequel/prequel or add more DLC after the two that were already released (Medicine Girl, you must have more of a purpose, don't you...)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's basically an action game wearing Final Fantasy clothes. Voice acting and music are fantastic. My biggest complaints with the game are the fact that its barely an RPG, there was an issue with black cutscenes that a mod fixed, and the second half of the game felt like a bit of a slog at times. I always heard that a lot of the quests were just back and forth between NPC's but they did a patch a while ago that let you teleport back to the quest giver almost instantly which made it far more enjoyable to do side quests. That being said, I still think it's a great game. Fingers crossed that maybe, JUST MAYBE with the success of Expedition 33, they might go back to turn based for a future installment.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Combat is bit repetitive but you just have to remove the ring of timely strikes and then you can go ape shit with the buttons, cutscenes are amazing but slow, I love the visuals and voice acting as well!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you're looking for a classical FFXIV, you won't find it here. If you want a Dark Fantasy Epic, that mixes Asuras Wrath scale combat boss battles with DMC5 (light) combat, and has around half of the game be a movie? Here it is. Enjoy, I know I have.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "CAREFUL: Your game will run very badly if you don't have 8 GB of VRAM or more. I sadly did not read that in the specs required and just said \"a 1070 is recommended, no way a 2060 won't run it!\". It did not. On the flipside, game looked stunning (at 20 fps) and the music was awesome. Shame I can't play it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall very good game\nPositives\nGood story \nwell written characters\nVery fun combat\nVery pretty environments\nVery cinematic\nGood length game full completion (Hunts, Sidequests , Story) is about 75-80 hours\nprobably around 50-60 hours for just story\n\nNegatives\n-sidequests were very monotone , all of them expand on side character stories but none of them feel unique almost as if they are mmo fetch quests\n-hunts were all variations of monsters/enemies you fought in the story which was kinda dissapointing\n-Equipment other than the accessories were just stat sticks there were a lot of things that they could have done to make equipment choosing more fun but they chose to do the bare minimum\n-Perfomance varies drastically between areas\n\n\nSIDENOTE\nIf your cutscenes run like a powerpoint and you do not know why its probably because you have CPU virtualization\nenabled in your bios , took me a while to figure out the solution ( i dont even know how the affect each other but that was the solution)\n\nOVERALL 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wished I never played this game so I can experience it all again for the first time. I never played any Final Fantasy games and this was my first one so I came in blind. I'm honestly out of words, truly breathtaking and amazing. Runs great on my system, jaw dropping graphics that made me stopped a few times (haven't done that in a while), my kind of gameplay, lots of cool effects, and lovely characters. I hope they continue to expand this universe but if not then I understand that its time to move on. Just AMAZING!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It made me cry one time. Its such a masterpiece. This the first FF game I've played. Can't wait to try the others.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game epic graphics love the combat very fluid best final fantasy i have played since ffx i am so drawn in by this game I struggle to put the game down I am enjoying it that much its apsolutely epic",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I honestly don’t understand many of the criticisms aimed at Final Fantasy XVI. Sure, it’s quite different from the traditional entries in the series, but to me that’s a huge strength. The Devil May Cry-style combat system is absolutely fantastic—fast, flashy, and incredibly fun!\nThe story grabbed me from start to finish, with intense moments and characters that really stick with you. Yes, some dialogues feel a bit heavy or drag on for too long, but it’s a minor issue when the rest of the game works this well.\nOverall, I think this is a game that absolutely deserves a chance. It’s different, yes, but in a good way: engaging, energetic, and full of memorable moments. If you give it a shot, it might surprise you just as much as it surprised me!\n\nPersonal rating: 8/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "See that mountain over there? \r\n\r\nYo- [10 minute cutscene] \r\n\r\nYou ca- [5 minute NPC interaction instructing you to pick up a piece of plywood 15 ft. away and bring it back to them]\r\n\r\nYou can cli- [tutorial on how to use a controller to move a character forward]\r\n\r\nYou can definitely clim- [you have leveled up in the middle of your combat encounter, pause everything for a stats screen]\r\n\r\nSeriously it's gonna be so sick when I finally let you climb that mountai- [15 minute cutscene of 'losing during the cutscene even tho I was winning in the actual battle']\r\n\r\nYou can climb it! [you actually can't climb it at all lmao but it looks pretty, doesn't it?]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing story with character writing that made me actually care about them.\n\nCombat system made me feel like a god, from early game all the way through the end.\n\nYOU CAN PET DA DAWG!!!!!\n\nAbsolute 10/10 game itself, I just wish they'd make a performance update to help with the occasional memory leak issues dropping the FPS.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "It's a very good entry into Final Fantasy, but it's not without its problems. I liked it a lot more than FF15. I would never pay full price for the experience, but if it's on sale, it'll be worth your money.\r\n\r\nPros:\r\n1) Very fun and customizable real-time combat system.\r\n2) Extremely impressive set-piece battles that are beautiful to look at.\r\n3) The prologue and Act 1 are well worth the price of admission. \r\n4) Side quests are designed to meaningfully build upon the world lore.\r\n\r\nCons:\r\n1) Exploration and crafting is extremely unrewarding.\r\n2) Money is worthless.\r\n3) Itemization very little impact on play outside of the \"accessibility\" items you start the game with.\r\n4) Acts 2 and 3 are riddled with pacing issues that severely undermine the narrative.\r\n5) Side quest structure, aside from narrative, is extremely repetitive. Go to x, talk to y, fight z. Maybe gather a.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It wasn’t as awful as everyone said it was. Is it the best Final Fantasy? No. Is it the worst? No. I’d say it’s somewhere in the middle, but it has some really great moments. I still had fun with it and enjoyed my time playing.\n\nI’ve been playing this series since playing it on the Super Nintendo, so I know what to expect. This one changes up the gameplay a little, but the story still holds up. If you’re a fan of the series, it’s worth trying. If you’re not, give it a few hours and see how you feel about it, or just keep it in your collection.\n\nI’ll keep this review short. Do your research and see if it’s something you’d like. The game is pretty cheap right now when on sale. I picked it up for thirty bucks, and honestly, that’s a good deal compared to a lot of the big games coming out today.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely adore this game. I would recommend it for those we enjoy story over combat. Both DLCs are decent and add a few interesting character moments for the cast if that has any appeal.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A pretty good FF game, good story and an enjoyable cast of characters.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is incredible, but is basically not a RPG..",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "not classic FF anymore, amazing game though , battles are super, story very good, side quests are a must",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got started on FF4, SNES, back when it was called FF2. So, I'm old. This review will mostly be taken in context of the other FF games within the series.\n\nTo me it feels like the game got budget-rushed bigtime. They spent the first 3 years working on the graphics, sound, and combat, then the next 3 months perfecting the combat, then the next 3 weeks writing the entire plot and characters, the next 3 days designing the map, the next 3 hours designing inventory/items/weapons, and the next 3 minutes putting it all together.\n\nPros:\nThe game is quite stable. No issues to report.\nThe graphics are great.\nThe sound is great.\nThe re-use of traditional elemental names like Ifrit, Shiva, Bahamut, and Ultima is very welcome. \nThe combat is REALLY great, as in an action game melee non RPG kind of a way. Visually stunning, without any complicated gameplay mechanics.\nThe plot could have been GREAT, it's still good, but there's SO much room for it to be better. So many unexplored rabbit holes throughout.\nWorks great on a MS-Xbox controller.\n\nSeriously though, I didn't buy this game for the combat but they really nailed this aspect of the game.\n\nCons:\nThe characters are developed just enough to keep me playing through the end, but not well enough for what I've come to expect from Square/Enix games. FF4, 5, 7, 8, 10, even 15 all had better character development. THIS IS WHY I PLAY FF games!!! Do better here, Square/Enix. Be the best again. \n\nFF4 had 10 times better character arcs than this. I teared up when Palom and Porum did what they did, all 30 pixels of them. \nThere is NO depth to these characters whatsoever by comparison.\n\nThe world is closed. Not open. Not even a little bit open. It's quite a beautiful hallway though.\n\nThere's no real difference between the elemental summons/Eikons. (Fire doesn't work against water any better than fire does).\n\nThere's literally no point to most of the inventory. It just sits there.\nI don't even need to sell that inventory because there's hardly anything to buy with all the money you accumulate.\nMuch like in real life, I spent my entire FF16 fortune on.... music records for the jukebox.\n\nThe enemies are far too easy. Most of the regular ones run straight into the path of my magic bullets and sit down to fry.\nNobody else but the main character has inventory. Or gear. Or specs. \nThe boss fights are supurb though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very Cinematic game.  Personally, I quite enjoyed it. No, it's not a perfect game, and the pacing may be a little all over the place, but I kind of think that added a bit to the charm of it. Great cast of characters, IMO, wonderful world building, IMO, and the combat is widely customizable to fit many different types of epic combos. I dunno, 8/10?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Great story. Action combat and not turn based.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's good if you’re into a big, cinematic action games. It has strong storytelling, super dramatic, well directed cutscenes, and characters that actually feel worth caring about. The world-building is also solid. Valisthea feels alive, and the political conflict behind the story adds weight to everything you do. \n\nCombat is fast, stylish, and fluid, especially if you enjoy pure action rather than traditional RPG systems. \nHowever it can sometimes feel a bit repetitive, don't expect deeper RPG elements—stats, build variety, or party-based strategy that pretty much non-existent. So, if you’re looking for a classic Final Fantasy tone—turn-based combat, wide exploration, or a more whimsical vibe, mind you this entry goes in a very different direction.\n\nHere comes the worst part; \n\n1. The Side Quest. God. All of those quest range from decent to “why am I doing this,” which can hurt pacing if you’re a completionist.\n\n2. Performance is awful. The minimum system req is absolutely lie.\n\nStill, as a whole, FFXVI delivers a polished, cinematic, and memorable experience, even if it doesn’t hit every traditional FF expectation",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Game feels, looks and sounds amazing. Reminds me of FFX, with the same life of the PS1 trio 7/8/9.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Incredible graphics, absolutely epic soundtrack and fast paced gameplay (sorry expedition 33, but I'm too old and can't stand turn based combat anymore). Also, finally, a somewhat more adult Final Fantasy: In the first 1-2 hours you get frequent swearing, you get people making out and you get some brutal and pretty explicit deaths. It's damn serious, and it's great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just like over 20 years ago when I first saw thr FFX: not the same gameplay, but feel so good and I can sympathize characters in the game. Hopefully, one day the game will be recognized in the future that this is a good game. I will miss this brand so much if SE won't create any new FF.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best JRPG's i have played. Recommend using the steam community guides to improve the graphical look of the game as well as adds widescreen support",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First thing to get out of the way, Yes the cinematics and story are very impressive. The best representations of the summons probably yet to date. This is unfortunately the least important part of making a video game.\r\n\r\nCombat is shallow and for the whole of your first run you are basically in a long tutorial and wont have access to everything until after your first run and both DLC are completed then you start NG+ Final Fantasy mode, which is where the real game begins. As much as I love DMC, this type of combat, though better than FF15, doesn't fit in this genre. Not only are you going to do a 50-60 hour tutorial just to unlock the full combat system, but it then just becomes about slowing down time/stagger using abilities that are on a cooldown. It's pretty much no combat and just using a few abilities off cooldown to wipe a boss in a single stagger. Even in NG+ Final Fantasy Mode I'm slaying marks 20 levels above me with no issue because the combat system is so shallow and easy. Clive's actual combat combos are virtually non existent and mostly useless. Also I thought we left cinematic QTE back in the PS3 era, unfortunately this game is LITTERED with QTE that ruins boss fights. They are flashy and cool to look at ONE TIME then all other playthroughs you will be ripping your hair out saying \"please just let this fight be over its so bad\" like when doing Titan for the second time and realizing the fight is literally 45 minutes of BS and not actually fighting. This is not respectful to the players time at all and wildly frustrating to know you have to do them each playthrough. You should be able too skip all of these fights, including the last fight, after beating them one time. QTE boss fights are soooooooooooo bad dude IDK how these even got past quality assurance testing. I'd be firing people for sure. \r\n\r\nThe gear and crafting system is so basic it mostly seems like a waste of time when you could have just put all the items as drops or loot. It's ok and doesn't ruin the game but the crafting and gear is so linear there is nothing impressive here.\r\n\r\nI'm not a JRPG or FF purist, and do not expect all games to be turn-based but the FF7 remakes combat and gear system is 1000% better than FF16 combat and gear. It's like with the FF7 remakes they said \"lets make a game\" and FF16 they said \"let's make a movie\". \r\n\r\nAll in all, the game is worth it on sale for the experience, or you could probably watch the game in movie form on youtube and you wont miss much. I paid $35 on sale for the base game and both DLC, I wouldn't pay much more than that. Most of your \"playtime\" you aren't actually playing. it's 50 hours of cutscenes and QTE boss battles that aren't actual fights. Though i do like that in NG+ Final Fantasy mode they do include more monsters in areas to make things a bit harder but it still falls flat and extremely easy, like I said I beat lvl 88 Atlas at lvl 68 with no problems and not even BIS gear for that part of the game. It was a joke honestly. If you buy this game know that you are mostly buying a movie. This is not DMC5, not even close.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story and gameplay are great... the cinematic pacing is a little too much for my taste. if the game had a function to speed up full cinematics I'd unreservedly love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great. And not too exepnsive for today's economy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was not expecting this level of gratuitous ultraviolence from a Final Fantasy game.\r\n\r\nDo more please.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is great. i love the story and the combat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Side quests give FF14 vibes and can be boring but the game is peak otherwise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's great! The combat is exhilirating. The story is well written, if not well-paced. The world feels empty at first, but will feel more alive as you play the sidequests (more like setting delivery system). In the first few hours, the game can feel odd because of the immense amount of dissonance: parts of you will expect a JRPG, the other parts expect a mature Western-style action RPG in the mold of Witcher 3, but this is neither (or rather a combination of both). When you finally shed off those expectation baggage, the game will be much more enjoyable as it's own thing. The only downside is the sidequest system (a little spoiler): you almost never 'discover' them. They're kinda being shoved in your face like optional content you can ignore at your peril. You can totally ignore them and just play the main story, but they're make up the bulk of the world building so the plot can feel a little unsatisfying. I just would rather have the player 'discover' these sidequests as you explore new areas to encourage some exploration in the semi-open world game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good, not great. 7/10\r\n\r\nBetter with mods that increase difficulty by a lot because it is fairly easy game. \r\n\r\nLacks customization, story falls off half way and drags on IMO, no good side quests. Combat is better with mods that up difficulty but not that great overall besides boss battles. voice acting good, visually good looking(especially some boss battles), the world and lore is interesting. \r\n\r\nWould have given a higher score had the story had as strong of a 2nd half as it did the first half, if combat wasn't so repetitive(besides boss battles) and I didn't have to get a difficulty mod, if it had better side quests/content and if it had more than the bare minimum in terms of customization.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Damn this game was good. Coming from someone who has never been able to get past 10 hrs of any other FF game, I'm glad i decided to play XVI demo. It kind of hooked me after seeing the first Giant Eikon battle. I just finished it but didn't buy any of the dlc.\n\nThe story is amazing and the combat is really fun. you unlock cool abilities as your progress to use in battle. The graphics and imagery in XVI are just incredible, especially during a crazy Eikon battle. There are a lot of cutscenes but its nowhere near the amount people make it seem. the people that say \"it's just an interactive movie\" are absolutely lying. There is way more actual gameplay and really fun combat vs cutscenes throughout. most of the cutscenes come after defeating a main boss off the story to sort of separate chapters if you will.\n\nCouple gripes i have are, for some reason after playing for a couple hours I'd get an error causing a crash. its not my system or drivers, I tried everything to no avail and it only happens here. It is a problem and caused me to have to redo long boss battles due to how long some of them are inevitably leading to a crash. I learned to save pretty constantly to combat it. Seen others have this same error thrown on forums with no fix.\n\nMy only other issue which is minor, there needs to be a sprint button. your character has a base run but it really isn't anywhere fast enough through the more open world area's. I ended up modding the game just to give him x2 speed. you do unlock a chocoboo halfway through but it isn't enough for me and isn't usable a lot of areas. \n\nAgain though, story, base gameplay, and visuals are awesome. I am glad I decided to buy it.\n\nMight try Reintegrade and rebirth again to see if I can get into it. I quit both of those in roughly 10 hrs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good story/characters, absolutely incredible spectacle bosses, and fantastic music by Soken dragged down by bland combat, repetitive level design, slow pacing, and bloated dialogue. You'll experience some of the most mind-blowing hype cutscenes you've ever seen accompanied by Soken's music blessing your ears during an eikon fight and then an hour later you're doing FFXIV levels of pointless boring quests in which you run around town and talk to 3 people and gather 3 items and then realize the actual plot hasnt progressed in the past hour. If you go in looking for essentially a playable movie with amazing spectacle and can put up with at times abhorrent pacing and bland combat, you will have an excellent time. If you are expecting an action game, look elsewhere. 7/10 would listen to Away again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, gets better with each story arc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very well written and extremely fun to play..., BUT\n\nThe game in itself is a lot of fun and i did enjoy my time with it, there are only 2 gripes i have about this game that make me refuse to say it's a masterpiece.\n\n1) the lesser of the two things are the side missions. They all ad world building, no doubt, but the amount is agonizing and most of them are somewhat repetitive.\n\n2) the second and most important thing to mention is the dreadfull performance, like holy shit is it bad.\nFor reference i have a rx 7900gre (somewhat equivalent to a 4070 super) at 1440p and it struggled to hit 60 FPS all time. The game looks pretty and is cinematic as fuck, but having to battle heavy frame drops and heavy stuttering in the beginning, due to shader compilation sours the experience a lot.\n\nOther than that i can just recomend the hell out of this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Waited for this game to come out on PC and go on sale so I could unlock the framerate in cutscenes. I also needed to download a mod of about 17GB worth of 60fps Prerendered Cinematics, too. Totally worth the wait to experience all moments of this Beautiful game at an acceptable framerate. Shame I still had to mod it to achieve such a thing...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Experienced peak, HIGHLY recommend this game. If i could vote for GOTY for 2025, I would. I should have bought this game sooner",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Devil may Fantasy, forget about open world. It's all about action babyy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not your typical Final Fantasy game but a really good action game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing story as the ff series is know for, great combat system and graphics, really enjoying it so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing Final Fantasy since 3.\r\nThis is the best Final Fantasy I have played since 7. As far as Final Fantasy is concerned, this has entered my top 3. \r\nIts story is mature and adult in just the right ways. Its drama is appropriate. Great storyline. Character arcs were well developed. The Eikons/Espers/Summons they are perfectly done. \r\nThe only way it could have gotten better is if it was open world.\r\nI can say this with all certainty though- if they did the next Final Fantasy online in THIS way. It would be absolutely amazing. Highly recommend this title if you like RPGs and especially if you like Final Fantasy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OK, I think this is a good game with some very annoying problems, graphics are great, no crash problems for me, combat is good if not a little to long in boss fights...having said that, I have never seen so may cut videos in a game in the last 25 years I have been playing, I ended up spamming two keys.....ESC + SPACEBAR a thousand times, annoying as hell...it reminded me of the saying about Russia....\"you don't play this game, game plays you\".......the price is right and I think most will have fun playing it....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First single player RPG I've enjoyed in years. Exactly what I've come to expect from Square Enix, immersive story and excellent graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game the only thing i don't like is that you barely get to use Ifrit when his combat sections are so cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so far liking the game played it on play station and got it on steam  with DLC loving the game on PC only thing i still feel its not optimized but it didnt hurt my experience  with the game would recommend to play on pc its alot better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has been many years since I have just wanted to sit down and play a game... This games has finally  done this for me! I am having a blast playing through this and it is something that I am going to finish.... its amazing, the story is absolutely captivating. Clives Character arc is something that I am soooo enjoying. Way to go Square! You hit this one out of the park!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is fantastic!\n   the gameplay has been great. i have always been a little more partial to the old turn based mechanics of older final fantasy games. but with this one and the ff7 remakes that has begun to change my opinion. action wise it is a very fun and action packed style of battle, and although doesn't lend itself to have a shit load of strategy to the gameplay, it is still difficult enough to keep it interesting. \n\nas far as visuals and graphics go the game is beautiful. it might not be the most interesting of Art styles but it is still a great looking game and it runs great on my computer. i am running it with a RTX 5080, 32 gigs of ram, and an AMD ryzen 9 3950X\n\ni am enjoying the story so far, and it may not be the best writing in the world. i still enjoy the characters and story, and i am very much invested in them. \n\ni would for sure recommend this to anybody who has any interest in playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mostly linear story driven game with light RPG elements.\r\nGood story.\r\nCombat is fun.\r\nGamer oozes AAA cinematic polish.\r\nGot this for 50% off with DLC. Wayyyy worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is a wonderful experience, currently trying to 100% it now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For starters, the port is garbage. Played it on PS5 and it run better than on PC with a better rig, unacceptable.\r\n\r\nCombat is fun and can be as simple or as deep as you want it to be. \r\nThe Eikon fights are simplistic in execution but between the spectacle of massive titans colliding in battle and Soken's masterful OST, they are just a treat.\r\n\r\nThe Prologue draws you in and tells you that anyone can die, that shit can, and will go wrong. Excellent.\r\nThe worldbuilding is on point, several countries, cultures and ways of life, clashing.\r\nSome quests are emotional, deep and very human. The plight of the bearers is delivered with emotion and gravitas, but... almost every single storyline in this game that deals with bearers can be summarized as \"bearers good, anyone else bad\". It's sad really, because it lacks nuance. Not a single bearer is remotely close to being resentful, vengeful, or outright evil, and the ones that hold a grudge, are swiftly convinced of letting go. \r\nIMO, huge wasted opportunity (in an M for Mature game btw) not encroaching in the territory of bearers being... more human, really. Some ideas out of the top my head: Groups turning into bandits to survive, freed bearers seeking bloody revenge against their former masters or organized bearers becoming a dark reflection of Clive and Cid's groups, that commit crimes or even atrocities in the name of freedom. There's nothing even remotely close to that, bearers are ALWAYS good, ALWAYS victims.\r\nIt feels idealized and, in a world that is so rich and grounded at times, almost childish, that bearers are just a vehicle for a simplistic and obvious meta-message: Slavery is wrong.\r\n\r\nThen in the later acts the game leans into the typical Final Fantasy tropes, lame, but expected. \r\n\r\n7/10, incredible potential story-wise, wasted. Still fun and enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 200hrs and 100% i can say its the one of the best games Ive ever played and i might just run this shit back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes this is a masterpiece. It is like a movie. The Eikron battle is great. After acquiring Garuda and then the limit break thing get more interesting. Then the plot and story is great. Highly recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sick game. Purists might not like it but it's fun and the story it pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Final Fantasy XVI is a truly magnificent and worthy entry in the series, even if it confidently breaks the mold with its darker, more mature world. The combat system has transitioned into a thrilling, high-octane slasher, drawing heavily from the Devil May Cry playbook. However, I believe this entire package works exceptionally well.\r\n\r\nThe experience is anchored by its unbelievably cinematic boss battles. After the first Eikon fight with Garuda, my jaw was literally on the floor. The sheer scale and spectacle are unmatched.\r\n\r\nThat said, the game does have its drawbacks. The primary culprits are the side quests, which feel lifted directly from an MMO—complete with an auto-teleport function upon completion, which is a bit jarring. Furthermore, there are some unnecessarily drawn-out secondary conversations and a few unskippable transition animations (for cutscene-to-gameplay shifts, or the experience/quest complete screens) that noticeably slow the pace.\r\n\r\nIn the end, the pros heavily outweigh the cons. FFXVI offers a stunning journey and an adrenaline rush that you won't soon forget. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun to play and the story line is excellent you wont regret getting this i swear. My only dislike and this could just be my computer is that this game will start to lag out randomly and itll force me to completely log out of the game and reload it fresh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game, the action is thrilling and the story is interesting too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big game where you can go WHOOSH and BOOM and SHING SHING with a sword and magic and stuff. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing Gameplay especially when you learn how to time magic bursts and sics and start using rift cancels and jump cancels. Best soundtrack of any game ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "2025.11.25 通关留念\r\n史诗级的宏大演出，顶级视觉和视听盛宴，非常爽的战斗体验，没有体力槽，让苦手也能战斗爽，是一款治愈了我的电子ed的良药",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fuckin PEAK what the hell. It drags in a couple of places, namely with the sidequests, but besides that it's great. Soken shows everyone who the king is once again, as well. Never disappoints.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just wanted to leave an initial review after picking up the game and playing it for a bit.\n\nMy first impression is that it’s genuinely a good game. And for me, initial impressions matter a lot — I need to know early on whether a game is worth investing my time into.\n\nThe combat is excellent — smooth, stylish, and honestly one of the best feeling systems I’ve played in a while. The storytelling is also top-tier, which is exactly what I expect from Square Enix. The first couple of hours had me completely hooked.\n\nHowever, despite all of that, the game felt way too linear for my taste. There were just too many cutscenes, and unless you push through a few solid hours (based on what I’ve read online), it doesn’t really open up. I prefer more freedom and exploration, and this one just didn’t scratch that itch for me.\n\nSo I just wanted to leave this here to give you guys a heads-up and help set reasonable expectations. If strong initial impressions are what keep you invested in a game, the story-heavy opening might burn you out before you get to the good parts.\n\nBut with that said, it’s still a recommended game for anyone who loves Final Fantasy or enjoys great combat and story-driven experiences.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story is good, boss fights are good, very hype. Everything else is MMO boring, fetch quests, too much mini boss hp. 7/10, the most 7/10 game in existence. Ben Starr is a GOAT though. Also i had 10 crashes in my playthrough. Unoptimised for pc for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're a fan of DmC you'll probably love this game. If you're a fan of great styory telling you'll probably love this game. if you're a fan who prefers the older style of combat from the days of 7 10 or 12 you might not enjoy this game. Grew up on old school turn based rpgs and still enjoy them a lot but i also grew up on the DmC games so the drastic change in combat here was a welcome change of pace and a massive improvement over what they did in 13. the games amazing when you dont let purists dictate what should be fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first final fantasy game and it is an absolute blast. The story and combat are a top-notch experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FF X was my first introduction to the franchise and while it is extremely different from the usual formula it breathes new life into the franchise. I do not understand the hate! I would put it up there with FF 12, and FF 15. And depending on what flavor of game you prefer - I could see FF 16 being an all time favorite for some.\r\nI love FF 16 and it is 100% in my top 5 FF games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone more new to the Final Fantasy-verse I cannot really say if this game feels \"Final Fantasy\" or not. However I can say that I thoroughly enjoyed this game very much - the music (shoutout to Soken) and voice acting was phenomenal, with the lead Ben Starr doing an incredible job. The combat was pretty fun, similar to that of DMC 5. The highlight of the combat were the awesome bosses, especially the Kaiju fights. The story was also pretty good but I think had a few pacing/padding issues within the middle of the game. I would also say my other gripe was that the side content such as quests could have been polished as I didn't feel the want or need to do them unless they were ones that I knew would directly benefit me (I.E the quests with a + marker). All in all, I had an extremely enjoyable time with this game and would highly recommend it to both those who aren't familiar with FF and those who are!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly perfect game for me. Ran extremely well on my midrange system despite all complaints about optimisation. Story is top tier with satisfying combat and character & boss design is some of the best ive seen in recent times. The only downside is that it ended way too bloody quickly. Or it felt that way after being heavily invested in it. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is flawed but still fun. Compared to what i wanted it to be (DMC) it's rather superficial and repetitive, but still, fun. Story's awesome if you love FF summons, not so great if you're into party dynamics and side characters. Visuals are stunning, but as with every Square Enix pc port, needs mods. Def worth it on sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've never had any problems running any new games until I played this. It's so bad, really bad porting. I couldn't enjoy the game and it forces me to upgrade my whole unit unnecessarily. I like this game overall. Graphics, story, mechanics, and artwork are very final fantasy. I still recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For the friends of adventure games and the fans of Final Fantasy.\r\n\r\n+Story\r\n+Lots of playable content, I did all of the side missions.\r\n+Easy battle mechanincs, if you don't have much time to play (like me, a working mother). I could just choose an option to push X on the controller and game would choose to best combos and such. And it would also automatically evade attacks. If you like real battles and learn battle mechanincs it is also possible, but I wanted an easy way out.\r\n+Beautiful landscapes and nature. \r\n+Easy to play with controller.\r\n+Worth of my money. I bought this for under 40 euros, and spend 90 hours adventuring the world back and forth.\r\n\r\n+ and - It was very easy to go to places, you just click on the map, and warp there. I am not used to this in Final Fantasy games, where you usually have to travel by foot/chocobo/car/something very big journeys.\r\n\r\n-First it was \"walking in a tube\" for a very long time. After that it got better.\r\n-First it was difficult to remember which \"house\"/kingdom was under which ruler, so the start of the game was a bit confusing (who is in was with who and why?)...\r\n-Basically all off the boss battles were mostly cinematic and you needed to press one button here and one button there. Cinematicly very nice, but also very boring. \r\n-No magic-skills and no 'aions' like there normally is in Final Fantasy games. Now you could only choose max. 3 \"aion skill trees\", and only 2 magic tricks of every skill tree.\r\n-It didn't matter if the opponent was fire and you fought it with fire.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game. Game mechanic is a step above from the rest of the franchise. FF16's combat director is awesome, having been involved in Devil May Cry, the combat mechanic is just reminiscent of that style. I hope that Square Enix will explore more into this style of combat in future installment.\r\n\r\nKenshi Yonezu's Moongazing was a kick to the gut when the game ended, it was truly a master gathering of talented artists in this game. The story telling is a little meh, Square Enix would benefit from letting go cutscene story telling.\r\n\r\nOverall, I would say to give this game a try. I would say it's the best entry point into Final Fantasy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In my top 3 games for sure, both DLCs are amazing and are absolutely worth it, and if you don't count the side quests it's a near perfect game.\r\n\r\nStrong points: \r\nCinematic and fun boss fights (The ones with the Eikons mostly)\r\nFlashy and fast combat \r\nAmazing graphics\r\nGreat story/narrative\r\nAwesome characters \r\n\r\nWeak points:\r\nThe game being too easy on a first playthrough because you are forced into an easy mode\r\nSide quests being tedious and a reason for not wanting to play NG+ \r\nSometimes feeling like a movie because of the long cutscenes and the quantity of them (not necessarily a bad thing if you are into that)\r\nLimited character customization (doesn't really matter tho)\r\n\r\nI would say this game really shines in NG+ FF mode because of the higher difficulty and expanded crafting but overall it scores a 9.7/10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ifrit is very cute.\r\n\r\nMom is very hateable (Which is good writing)\r\n\r\nClive has this vague vibe of being a bit of an endearing dumbass. He is clueless but tries his best.\r\n\r\nGameplaywise it did get a bit repetitive. It tries to be DMC combos/rhythm game, kinda. You might tend to fall back into really basic combos, they seem to be the most useful things rather than trying to actually juggle an enemy, though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll keep this short and sweet;\n\nIf you liked FFXII's story, you'll LOVE XVI's. If you enjoy fast paced combat, you will like this game. If you enjoy dark fantasy with emotionally painful moments, you'll love this game. Fast and flashy combat, dark and deep story, absolutely gorgeous open world, this is one of the best FF titles to date.\n\nHOWEVER\nThis game is NOT light on the GPU or CPU. I have an i9-9900KF, 3080, 64GB corsair vengeance RAM, and boy did FFXVI push them to the limits.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good game. The combat, art, music are all great. The problem is that it is a super linear movie game. There is 0 exploration and the enemy mobs are easy and don't pose any challenge so the whole experience feels like pressing forward until you hit the next cut scene. The quests are not hard but feel like chores that aren't worth doing. \n\nHaving just finished ff7 rebirth, it feels unsatisfying in comparison even though there is a lot to enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot different from most FF games in both tone and combat but so far I am really enjoying it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having finally actually played past the beginning (On xbox initially) I am so into the story, characters, lore, everything. It is soooo well crafted and pieced together. The constant mystery and how/when it's revealed or partially revealed is just amazing. The game runs great overall on mid settings, on high, it was lagging, especially in cut-scenes with the phoenix or big wars with lots of side characters in one scene. But it's such an amazingly incredible game! \n\nHad to add more:\nThe game and story were one of the best I have ever experienced in a game. This was just incredible and worth every penny to play such a perfectly crafted game. I have no issues with the game in any way. The gameplay is amazing, fun and interacting, the powers are diverse and so incredible. The characters and their backgrounds were done to a point perfect manner. The game is so exciting, tense, mysterious throughout, and heartbreaking all at the same time. Perfectly done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am saying to this game, I like it in general, but it could have been better as FF 7, this game to corridor like and too primitive in places. FF 15 was better, and FF 7 new one is much better. Still I can't put nay to this game as in general I have fun in it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A solid title. Technically enjoyable, the story is interesting, but perhaps a bit too long. I recommend it if you love the series, and even more so if you buy it during the sales.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, great game ...I played / finished it some years ago on my PS5, wanted to give it a run on PC, still, I find this game to be wonderful; though the cutscenes are way to long, but it is final fantasy. Overall, I give this game a 10 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really loved the story and the characters. Combat was fun but a bit repetitive at times. Feel like I got my monies worth. Tides dlc was fun and really not too difficult once you realized you needed to use all your abilties before the count down.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The tragedy of this is that the gameplay is SO GOOD! Twenty-three hours in you will only be playing for five to seven hours of that time. You are buying a movie with a myriad of playable hallways. The twenty-minute episode of exposition interrupted by the occasional playable hallway. \r\nThen you get to a boss fight and it is so epic that you will actually be roaring at your screen.\r\nThen walk down that hallway, again.",
      "voted_up": false,
      "votes_helpful": 284
    },
    {
      "review": "[h1][b]After >100hrs and 100% achievements, I feel I have a grasp on just about everything FFXVI has to offer, and I don't recommend it.\n\n\n↓TLDR FOUND BELOW.↓[/b][/h1]\n\n\n[h1][b][u]THE GOOD[/u][/b][h1]\n[*] The last DLC \"The Rising Tide\" is what I wished the main story was. A simple narrative with a simple message, executed well, that doesn't overstay its welcome.\n\n[*] Oddly enough I think the strongest aspect of FFXVI is its User Interface. SE must have thought so too because you can see many of the UI elements introduced in this game in the new FFT Remaster.\n\n\n[h1][b][u]THE MID[/u][/b][h1]\n[h2][b]VOICE ACTING[/b][/h2]\n[*] It's always aggravating when throwaway NPCs have better performances than the main characters, and this game is no exception. I didn't like Ben Starr (Clive Rosfield) or Susannah Fielding (Jill Warrick)'s performances, as the prior felt comically over-dramatic and sullen, and the latter felt comically apathetic and dry. I have a feeling this is due to direction and not acting talent though, especially after playing Expedition 33 and seeing Ben Starr play Verso. That being said there are one or two moments in FFXVI that stuck out to me where Starr's delivery was exceptional, and many people including me appreciate his passion for JRPGs. Ralph Ineson as [spoiler]Cid[/spoiler] was easily my favorite performance, [spoiler]I really wish we had more time with his character[/spoiler].\n\n[h2][b]MUSIC[/b][/h2]\n[*] Of course this is subjective, but I think Masayoshi Soken's soundtrack for FFXVI is the same as FFXIV: A very functional, serviceable OST with some amazing stand-out tracks.\n\n\n[h1][b][u]THE BAD[/u][/b][h1]\n[h2][b]NARRATIVE[/b][/h2]\n[*] I think the first act has a compelling setup, and the second act had me on the edge of my seat wondering how some of the biggest major conflicts would resolve. The game hits its peak at the end of act 2. There's a boss fight with some ridiculous over-the-top spectacle (in a good way), and all of the main character conflicts that I cared about were resolved. \n\nThen the game keeps going. \nAnd going. \nAnd going.\n\nTo say the final act is drawn out is a criminal understatement. Every scene is stretched out to its limit, information is constantly repeated because the audience can't be trusted to pay attention, and characters talk in circles. Any scene with [spoiler]Barnabas Tharmr aka Odin[/spoiler] made me want to blow my brains out, and they take up pretty much the entire third act. I really can't stress enough how drawn out the finale of this game is.\n\nI hate to use this word, but FFXVI's narrative is [b]pretentious.[/b] It acts as though it is telling the most grandiose, nuanced, deeply compelling story imaginable, when in reality it is the same gnostic slop we have been presented with for decades at this point. Having [spoiler]\"god\" actually be a lesser malevolent force[/spoiler] is nothing new to the FF franchise, in fact it's the plot of just about every game in the series. But man if FFXVI doesn't act like this is the first time it's ever been done, and that you should be in awe for it being so avant-garde. For being such a contrived plot, you'd think they would've been able to execute it with precision at least, but FFXVI falls short here as well. The point has been made but my feelings are only so strong because acts 1 and 2 were so promising, which made me feel even more disappointed with the lackluster finale that ultimately ended up being a huge waste of time.\n\n[h2][b]GAMEPLAY[/b][/h2]\n[*] Speaking of a huge waste of time, FFXVI's combat is repetitive and boring. You spam basic attacks until your abilities are ready, use said abilities, rinse and repeat for [b]100 HOURS[/b]. Every single enemy is a damage sponge. The combat does actually have a lot of depth in terms of how you can chain combos and abilities, but you are never incentivized to explore this depth, as you will ultimately end up doing less damage than if you had just done the aforementioned \"spam square until abilities are off cooldown.\" I think this repetitiveness could have been remedied by a DMC-style \"grading\" system that encourages players to actually use combos. Maybe give them a damage boost if combos are executed properly, then it feels like the enemies are sponges for a reason other than to waste your time.\n\n\n[h1][b][u]TLDR[/u]/FINAL THOUGHTS[/b][h1]\n[*] [b]TLDR: [/b]Play something else that interests you and respects your time more. Although FFXVI has some stand-out moments, I cannot recommend it due to its needlessly long playtime, disappointing final act and repetitive gameplay. \n\n[*] I'm screaming into the void saying this, but please stop making 30-40 hour RPGs 70-100 hours with pointless filler. I miss when FF games were 30-40 hours and told a succinct, compelling story with great characters that stayed with you long after the credits rolled.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "I bought FF16 because it was made by the same team as FF14. I LOVE FF14 and would sing its praises to anyone willing to listen. But that praise comes with the acknowledgement that FF14 is an MMO, and the understanding that MMO devs are limited in what they can do when it comes to gameplay and presentation. Despite those limitations, FF14 managed to craft one of the best stories I've ever experienced in gaming.\n\nWhile I wasn't expecting FF16 to reach the storytelling highs of Shadowbringers or Endwalker, I at least expected it to be fun and tell a good story. The devs somehow managed to fail at both. Horribly.\n\nPeople describe this game's story as \"FF meets Game of Thrones\" and that's only true on a surface level. It's dark and gritty with a plot that focuses heavily on politics and intrigue with the occasional kaiju battle mixed in. But the writing fails horribly at making any of it actually interesting or meaningful. Characters are paper thin, with Jill, the female lead, in particular being quite possibly the blandest FF character I've ever seen. Her sole character trait is \"Clive's girlfriend\" and has so little personality or agency, she may as well just be another accessory hanging off of Clive's belt. The political intrigue is also mostly set dressing, to give Clive a reason to revisit the same brown/grey town for the 10th time, but never actually give the player a reason to care about the wider world or the people in it. Cutscenes and dialogues are presented with bare bones, MMO-style cinematography that works fine for games like FF14 but has no business in a modern single-player RPG. The plot is also predictable as hell, embracing every \"dark fantasy\" trope in existence with little in the way of surprises or twists. You've seen this story a million times before.\n\nThe quest design ranges from boring fetch quests to main storyline quests that involve watching a dozen or so roundabout dialogue scenes before being sent down a linear corridor where you fight a group of the same reskinned enemies with the same shallow combat mechanics.\n\nThe combat system itself is pitifully bland at first, then gets fun after you unlock a few more abilities, then gets bland again once you realise those abilities are all flash and no substance. You can easily win any fight by just dodging and hitting things with your sword. The Eikon fights have potential at first, but they feel so janky to control and the fights drag on so long that they don't feel anywhere near as powerful and badass as they should. Not to mention most of them play out more like on-rails shooters and QTE fests than an actual combat system.\n\nEven the character and world design is a letdown. Final Fantasy has a reputation for crafting beautiful worlds that you want to get lost in, with memorable characters whose designs spark the imagination. But I think whoever was in charge of the art in this game forgot what franchise this is, because every environment you visit has the same washed out, grey/brown color palette. Character designs are equally as bland. Clive, for some reason, is the only character who even remotely looks like what you'd expect a FF character to look like. But because everyone else around him looks so painfully drab, he ends up looking like a cosplayer who got sent back in time. It's impossible to take him seriously. And the game really, really, wants you to take him seriously.\n\nIf there's one positive, it's in the sound department. The voice acting and music are top notch, but unfortunately neither can save an otherwise excruciatingly dull game.\n\nIf I could get a refund, I would.",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "This is really sad to say but it's a repeat offense. Walking and pressing one button does not a game make. The story is fine but predictable, the difficulty is laughable at best on the hardest, and the amount of cut scenes is just sad. If you want a story game this is for you, if you want a final fantasy game prob best to go play ff7 remake. \n\nWhen games like E33 and Elden ring exist, there is no excuse for there not to be a more open world. Hell even FF7 rebirth had wide open areas with places to explore, activities, side quests, and special monsters to find. This game took every single mechanic that made those games fun and tossed it in the trash. \n\nThe topper tho is the summons in the game, summons use to be cool helpful entities that help you fight in combat coming with their own move set. That's now been replaced with \"you can use this ability now\", nothing changes and 5 hours in and i haven't been able to do anything cool like in the cut scenes they show. it's just final fantasy the movie and every now again you get to press a button.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "What an incredibly terrible game. I'm like 15 hours in and 7 of them have been cutscenes. Got all these crafting mats with literally nothing to craft. I don't look forward to the combat or the cutscenes and the exploration is terrible and the loot you pick up is garbage.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "optimization is so bad i cant even play it sometimes 15-20fps with rtx3060 this is embarrassing and i very much regret spending my money on this",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Combat felt pretty repetitive and boring and gear is very barebones, honestly you'd be better off watching the cutscene compilation from youtube if you're interested (which was half of my playtime going by the video timer)",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I REALLY wanted to like FF16, but I just can't. The entire game has just really clearly been half-assed. This would be okay, if there wasn't almost 4000 people who worked on this game. \r\n\r\n4000 PEOPLE. \r\n\r\nAdditionally, the devs are mostly MMO devs, and it shows. FF16 is just soulless and hollow. \r\n\r\nThere are 2 things I like about this game, and both of them are short lived. \r\n\r\nFirst, I really liked the combat. It's really fun, until it isn't. Turns out, that's because the action combat was designed by the same guy who designed the combat in one of my favourite series; Dragon's Dogma. Sadly, because the devs are MMO mains, they forced combat into a loop of: \r\nMash Square > Dump all skills at prompt > Mash Square\r\nThat's literally it. There is nothing more to combat in the entire game, which really sucks when you realise that there is literally no reward for exploration. \r\n\r\nSecond, the game is pretty. It's very clear that about 80% of the textures budget went into bricks, grass, and combat effects. Prettiness does not cover up that the game itself is utterly garbage. \r\nFF16 is the closest game I've ever found to the phrase \"polishing a turd.\"\r\n\r\nTo get into specifics: \r\nTwo thirds of the game are cutscenes. \r\nTraversal mechanics and animations are directly ripped from God of War. \r\nThe story lowkey sucks. \r\nThe characters barely develop. \r\nThe musical score is often extremely inappropriate. A major deathscene had jaunty medieval backing music, as if we were playing dice in a pub and not watching a mentor figure die. \r\nAll cutscenes have that classic jank MMO dialogue where there are uncomfortable pauses before EVERY single dialogue line. \r\nAlso has that classic jank MMO camera style of panning down onto characters to introduce the scene. \r\nMy thumb hurts. \r\nLevels don't matter at all, you can take on an enemy 10 levels above you with no noticable difference in difficulty. \r\nIt thinks it's a Soulslike. \r\nThe game's producers have themselves said that they plagiarised God of War for broader appeal. \r\nThe style of the game died in 2014. \r\nNo open world. \r\nNo exploration rewards. \r\nNo point to doing optional combat, since levelling is not a consideration. \r\nWeapons and equipment MAY be upgraded 2 levels, but not if it's a high tier. \r\nHigh tier weapons automatically invalidate full upgraded alternatives, and both are given at the same time that one becomes available. \r\nIf you find money on the ground, you'll have to fight a wave of enemies for it, and it's usually only 2 bucks. No, I'm not joking. $2 pickups are the most common thing I've found. \r\nLiberal use of time skips. \r\nFrequent continuity errors. \r\nGraphical clipping and shadow rendering at distance. This wouldn't be so bad, if most of the game weren't rendered cutscenes at 40 FPS. \r\n\r\nAnd so many more that don't immediately come to mind whie writing a 5 minute review. \r\n\r\nSeriously. If you like ARPGs like Dragon's Dogma or the previous Final Fantasy games, you're probably gonna hate this one. If you're new to Final Fantasy, try FF15 instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am 30 h into the game and i just kept playing because I thought that there must be more.\nGuess it is not going to happen. The gameplay are fetching quests, killing some generic monsters and get some epic cinematic button smashing fighting scenes. It is a good looking game but that's about it. I also do not care about the charactersfor now. If you like vanilla, you will like that game: Sadly just a movie with some inputs you need to press.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Is the stuttering intentional? Probably a great game but it took me an hour to minimize the unplayable stutter while being far above the recommendations on hardware.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Combat is okay. Everything else is drab, boring, and lifeless. You should skip it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The story, cutscenes, and music are great, but it takes a tremendous amount of research and effort to get this game to sometimes get mediocre FPS on higher end rigs.\n\nThe combat in some areas slows to a crawl and accentuates the repetitive combat loop. The combo you learn in the beginning will be used in every combat sequence of the whole game. Having abilities that go on cooldown for long periods in between doesn't take away from the monotony.\n\nDo not buy. Just watch the cutscenes/story and listen to music on YouTube or something.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Got no problems playing other big named games out this year but for some reason this one is nothing but lag even when i went to the lowest settings available. As others have stated it's just practicality a movie with 'some' game play, it's lost the interactive play style like the older Final Fantasy games have",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The levels of cope this game has created is absurd.\n\nNo, the combat isn't meticoulesly crafted, it isn't deep. Building stagger is piss easy when there's 3 abilities that do the job for you.\nNo, the gameplay isn't skill based, you literally only press one button towards the end of the game, and that same button is used to build stagger.\nNo, this game doesn't have \"build variety\" as so many people claim. You don't build to make certain skills stronger, or to exploit elemental weaknesses which isn't even a thing in FFXVI. It's just a pick and choose system of what abilities fit your playstyle, and then figuring out how to make the most of them.\nIt's more comparable to a DMC game, if DMC was extremely easy and lacked combo variety.\n\nThe story is extremely dragged out, with too much slow and dull side stuff where you barely even get to play the game. It's more of a movie than a game with how long some of the cutscenes are in this, and you barely even get any character building besides main character screaming at the top of his lungs and wailing in agony while blaming himself for other peoples wrong doings.\n\nThis game is the perfect example of why you don't let someone like Naoki Yoshida run loose at creating a game. This game has so much potential to be a fantastic RPG with fantastic ARPG elements and potentially even rivaling DMC's combat, but all of this fell flat with the illusion of choice in your \"build variety\" and lack of items to help push you towards a certain build. People who claim this game has build variety, are stupid, you'd find more build variety in Minecraft.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As a long time Final Fantasy fan (first game final fantasy 7) this game is a massive disappointment.  This isn't a final fantasy game first of all.  It's just another bad hack and slash game with the final fantasy name stamped on there.  There is zero strategy to this game, zero build crafting, zero party management or any need to use your brain what so ever.  I have never been so bored playing a game in my life.  The story had me intrigued for a while but as soon as I got into a battle with a fire type enemy, and noticed that my fire spells did the exact same damage as my wind spells, I couldn't take anymore.  Like come on, they couldn't even be bothers to add some kind of elemental weaknesses or resistances to enemies!!  If this is the path Final Fantasy is going then it's a sad day for Final Fantasy fans.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I usually don't write reviews for games I haven't completed, but this game was painfully dull and irritating despite my best attempts to enjoy it, and I see no more reason to let this take up 125gb and potentially up to 30 more hours of my life if I'm disliking it this much. I don't have much history with this series (iffy on 7 Remake, generally enjoying what I've played of XV, VIII, and IX), and this one is quite different than the others, so I can assure you it's not a bias against the series as a whole-- honestly, the elements that were most clearly from Final Fantasy lore were maybe the MOST interesting parts of the game. \n\nComplaints: \n- a particularly mind-numbing combat system that has some potential for depth that is squandered completely by how pitifully easy it is even on Action-Focused. supposedly, New Game Plus has improvements, but considering how painfully bored I was in what is supposedly the first quarter of this game, I don't feel like it's worth playing 30 more hours just to MAYBE glimpse the \"good part.\"\n- the most offensively mindless, low-effort side content I've ever seen in a game with this much budget\n- a surprisingly lacking main story that absolutely hates exposition to the point the in-game encyclopedia is damn-near a requirement instead of a helpful supplement and equally hates employing music in cutscenes, making for consistently awkward sequences that undercut the quite good talent on display\n- aggressively full of character death in a manner that usually lacks gravity, which makes it particularly difficult to care about anyone (the core reason I couldn't trudge through more, I just couldn't bring myself to care)\n- many story beats lack stakes because they gloss over elements that should be highly foundational to characters, like how they barely touch on Clive's, y'know, 13 years in **slavery** throughout the significant portion I've played, because once again, the game despises exposition and letting its characters express anything out of turn\n- the worldbuilding is actually pretty interesting, but it's either delivered either so indirectly through the story that you can barely comprehend it and have to read the lore encyclopedia to actually learn anything about it or so unbelievably bluntly through the side content that it feels equally as irritating. This really wouldn't be as much of an issue if the game would bother to take time and exposit a bit, make even silhouettes of meaningful connections with characters and locations, but there is nowhere near enough of that here.\n\nNaturally, I do have some pros:\n- the game is gorgeous! it ran well on my PC, though I have a 4070, so I'm on the high end. Downloaded a mod that uncaps the cutscene FPS from 30 (seriously, this shouldn't need a mod...) and they could be downright jaw-dropping at the spectacle moments\n- the acting talent is quite great\n- when the music does kick in (which it often fails to even on the victory screens), it's pretty great\n- clive is HAWT (smash)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was writing an entire book about how I feel about this game as a review, but nobody's gonna read that crap.\r\n\r\nI want to be a fan of this game, but I can't. Ben Starr gives an absolutely killer performance as one of the better protagonists in modern games, but the overall tedium of it's open world / quest design and it's surface-level attempt at making a spectacle fighter bog down the good story, great music, and occasional epic Eikon fights. This is a 2/5 as a whole package for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "O mundo desse jogo é muito interessante, as lutas de eikon e os design dos mesmos são incriveis, mas, depois de uma certa parte do jogo tudo fica tão... massante, repetitivo, diversas quests principais são fetch quests, a maioria das secundarias são fetch quests, o combate é interessanre no começo mas se torna repetitivo e massante, vira um esperar cooldown de abilidade de eikon ou apertar os mesmos 2 botões pq nada mais compensa, fora o protagonista, o clive, poucos personagens são interessantes, as exeções são a benedikta, o cid e o dion, sinceramente não acho que esse jogo vale mais do que 80 reais.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Minimum GTX 1070 8GB to be able to play @30fps 720p...\n\nRTX 3070 8GB.... runs FANTASTIC one minute... then after nearly TWO HOURS... you can't run squat because the game uses MORE than 8GB VRAM, in certain sections of the game, than both the minimum and recommended GPU. This while lowering the settings to the minimum 30fps @720p. You'll want a GPU that is as good as a GTX 1070, just with 12GB or more VRAM.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I did like the prologue and was hyped for what to come.\nIn the end I was dissapointed because the gameplay is always the same and I was so annoyed by the (main) quest design which is basically one battle arena after battle arena after battle arena with easier enemies, then bigger enemies, then even bigger enemies.\nThe combat system is nice but there is no variation in the approach to fight enemies - every single enemy can be beaten the same way, it just takes shorter or longer.\nI was bored to hell at the end and just rushed to get through cause I wanted to see how the story ends (just an okay ending imo).\nThe cinematography of this game is awesome though. Esper fights are awesome to watch which is fun but (surprise) the gameplay is just the same as usual with a little bit less attacks to choose from. Graphics are also very nice over all.\nThe core story of Clive is okay but nothing special tbh. The characters are well written but again nothing too special and I wasn't invested in anyone.\nAll in all I had fun for 5-10 hours but after that it was boring for me.\nIf you look for a game with nice executed combat system and dont care too much for gameplay variation I think the game could be interesting for you. Otherwise I cannot reccomend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this game in a PS5 and its beautiful all what i needed to buy it on my computer but the optimization is the biggest piece of shit in this world really i need a fucking AMD 3 FSR have minimum 30 FPS in 720P and i have a Rx 7600, i know waht dont is the best graphic card but minimum must play all in high with 1080p and i cant play this game fine with all in medium.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i know the devs wont see this and probably dont care, but this is a VIDEO GAME. NOT a movie. i want to play. if i wat to skip over a cut scene or cut through dialogue it should be an easy button push. your forced action sequences in your boss fights are a joke. it takes away from the game an makes it imposible to lose. \n\nfinaly fantasy used to be challenging, ive played a good 10 or 12 of this series and i used to STRUGGLE to get to the end.  you moved in the right diredtion in my opinion getting away from the trned based fight sequences and having enemies actually be on the screen before you fight them but the ultimate thing is you cant lose this game and that sucks.\n\nthis automatic attack and defence with items is for babies. the saving grace is yuo can un equip that trash.\n\nthe graphics have improved over the years... you're still pretty cutting edge in that especially regarding the fx, but what you make a name for yourself in fx you lack in gameplay. no one buys a game to watch cutscenes.... thanks for the however many hour long movie i wont be watching the ending\n\nno conversation choices? in this day and age you want to pummel me with video instead of gameplay and i cant even pick dialogue options?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While the story seems good so far, the game constantly locks up. Forcing me to kill the task. It can crash right after loading in. Or it may take 10-15 minutes maybe if your lucky over an hour. I have had to replay fights, or reload the same area 3-4 times to get past certain areas. It loves to lock up on cuts scenes. It seems to be an issue with the PC version and I have tried every fix I could find. nothing works. I would avoid this on the PC, maybe the PS5 version is better. Save your money it isnt worth the hassle.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm going to stop playing before I get carpel tunnel in my right index finger, and before I develop epilepsy from all the flashing combat effects.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Final Game of Rings May Cry... er 3?\n\nA GPU-mangling hack n' slash, lovingly infused with the trademark village-burning, past-forgetting, chicken-riding, god-slaying, compound-word-molesting, particle-effect-ranching genre guff, only this time it thinks it's dark Western fantasy, which means your stock cast of paper-thin Vivienne Westwood models grumble their shounen angst in a zoo of British accents, and the story is a sheltered Japanese kid's attempt at Glen Cook or Steven Erikson, the result being a muddle of grimderp that basically fails to tell a proper, joined-up tale, even to the low standards of the series, and relies on an in-game wiki to fill you in.\n\nThe fighting seems built primarily to look good, and yes, it's facemelting, with set-pieces that rival/arguably impinge upon the copyright of Hollywood movies, but this cart-before-the-horse design has resulted in fight mechanics so open that they can feel shapeless, so that it doesn't really know the kind of mechanics it wants, only it wants them to look good. The addition of items that change combat from open-ended DMC to arcadey Arkham, to RPG command buttons and auto-dodging, has been celebrated as progress for accessibility and customisability, but criticised as a step backwards in standards of difficulty in video games, and for splitting the (traditionally singular) experience of a FF into a bunch of different experiences.\n\nI think the devs created this problem on their own. RPGs balance themselves, grind enough and anyone can beat anything (that's the promise of RPGs), but action games have hard, mechanical ceilings (that's the promise of action games). If it was a traditional FF, the items wouldn't be needed. If it was an action game outside the main franchise line, the items wouldn't be needed. But because it's this spectacle-first chimera, the devs had to hack their action game into an RPG game, just to please their main customers.\n\nFor what it's worth, I think they made the right decision putting the items in, but it's a band-aid on the backwards decision to turn FF into stroke-inducing fight scenes, and hang the mechanics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you are looking for a Final Fantasy game, go look somewhere else, perhaps Octopath Traveler. The Final Fantasy tropes are there but it's a movie with some gameplay within it. If you play the demo, you have already see the best the game can offer. However, if you are looking for a high budget low quality DMC clone, perhaps you will like it. I don't. It's the worst purchase I made in years.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "One of the worst FF games. Didn't finish and will never finish. Great movie, but not a great game and first thing that must be uttermost priority is to make gameplay interesting and addicting, not semi-passive watching. Story is ok, and for story I can use YT to watch it passively. And the last thing, this is not JRPG. Feels more like DMC copy-cat experience which I was never searching in FF game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything i hate about the assassins creed franchise with a final fantasy coat of paint over it. Not really worth getting.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this one gets a 4/10. visually its pretty good. the story so far is pretty basic and almost bland. The action is a lot of button mashing and quick time events. super linear game play with zero exploration and no sense of discovery. the party isnt a party, its more like a few buddies who hang out and pretend to help you work on your car over the weekend but really they are just there to chit chat and maybe hand you a wrench now and again. im gunna keep playing it but not because i really want to and more because i spent 40$ on this and i need to feel like im getting the bang for my bucks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I upgraded my PC just to play this game, and wow how disapointed I am...\n\nThis game is sooo booooriing.......\n\nI grew with FF since the 90's, so I've played almost all the series minus the MMORPG. And this is one of the weakest entry on the series...\n\nPROS :\n- Pretty visuals\n\nCONS :\n- The story is uninteresting and the pace is slow...Too many unimportant dialogues with what I described as \"99% cutscenes, 1% gameplay\". I took my phone and scrolls youtube and instagram everytime a dialogue or cut scene shows up\n- The battle is repetitive with no real strategy. You can win the game with just dodging and counterattack. \n- Linear story and gameplay. It's like watching a very bad Game of Thrones with button pressing once in a while....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really dont get why people like this. Like I really wanted to like this but it feels so bland and repetitive. Combat is extremly boring and the story is just as bad. A lot of stuff feels really pointless and uninteresting. The bigger boss fights felt epic which was fun but everything else is just not it. Future Final Fantasy games should do the FF7 Remake Gameplay for me or maybe consider something like Clair Obscur. Just button mashing with boring abilities in a bland story wont cut it for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I REALLY wanted to like FF16, but I just can't. The entire game has just really clearly been half-assed. This would be okay, if there wasn't almost 4000 people who worked on this game. \r\n\r\n4000 PEOPLE. \r\n\r\nAdditionally, the devs are mostly MMO devs, and it shows. FF16 is just soulless and hollow. \r\n\r\nThere are 2 things I like about this game, and both of them are short lived. \r\n\r\nFirst, I really liked the combat. It's really fun, until it isn't. Turns out, that's because the action combat was designed by the same guy who designed the combat in one of my favourite series; Dragon's Dogma. Sadly, because the devs are MMO mains, they forced combat into a loop of: \r\nMash Square > Dump all skills at prompt > Mash Square\r\nThat's literally it. There is nothing more to combat in the entire game, which really sucks when you realise that there is literally no reward for exploration. \r\n\r\nSecond, the game is pretty. It's very clear that about 80% of the textures budget went into bricks, grass, and combat effects. Prettiness does not cover up that the game itself is utterly garbage. \r\nFF16 is the closest game I've ever found to the phrase \"polishing a turd.\"\r\n\r\nTo get into specifics: \r\nTwo thirds of the game are cutscenes. \r\nTraversal mechanics and animations are directly ripped from God of War. \r\nThe story lowkey sucks. \r\nThe characters barely develop. \r\nThe musical score is often extremely inappropriate. A major deathscene had jaunty medieval backing music, as if we were playing dice in a pub and not watching a mentor figure die. \r\nAll cutscenes have that classic jank MMO dialogue where there are uncomfortable pauses before EVERY single dialogue line. \r\nAlso has that classic jank MMO camera style of panning down onto characters to introduce the scene. \r\nMy thumb hurts. \r\nLevels don't matter at all, you can take on an enemy 10 levels above you with no noticable difference in difficulty. \r\nIt thinks it's a Soulslike. \r\nThe game's producers have themselves said that they plagiarised God of War for broader appeal. \r\nThe style of the game died in 2014. \r\nNo open world. \r\nNo exploration rewards. \r\nNo point to doing optional combat, since levelling is not a consideration. \r\nWeapons and equipment MAY be upgraded 2 levels, but not if it's a high tier. \r\nHigh tier weapons automatically invalidate full upgraded alternatives, and both are given at the same time that one becomes available. \r\nIf you find money on the ground, you'll have to fight a wave of enemies for it, and it's usually only 2 bucks. No, I'm not joking. $2 pickups are the most common thing I've found. \r\nLiberal use of time skips. \r\nFrequent continuity errors. \r\nGraphical clipping and shadow rendering at distance. This wouldn't be so bad, if most of the game weren't rendered cutscenes at 40 FPS. \r\n\r\nAnd so many more that don't immediately come to mind whie writing a 5 minute review. \r\n\r\nSeriously. If you like ARPGs like Dragon's Dogma or the previous Final Fantasy games, you're probably gonna hate this one. If you're new to Final Fantasy, try FF15 instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am writing this after reaching the credits on the Action Focused difficulty and completing all available sidequests, all hunts and a few of the time trials. I do not have the DLC.\nThis is a linear action game. If you tried the demo, that includes the first few hours of the full game and another early stage. In my opinion, the early game is its strongest part. One of my favorite boss battles happens at the first crystal you visit. After that, intrigue gradually declines, and the last 20 hours are such a slog. You come to realize there are entire towns and cities that only exist in cutscenes, and visiting several places deletes them from relevance in the rest of the game. Eventually the game just does away with having people in its later areas (not without reason, but the reason doesn't really make it worth it). If you were drawn in by the notes of a Game of Thrones-style plot, well, it's nice while it's around.\nCombat was generally easy for me and had a hard time holding my interest. With little variation, Clive can disrupt what small enemies are doing and knock them down with the basic combo alone. Bigger enemies are fought by staggering them and inputting all of your skills at them. The bestiary is quite small, with variety coming from giving old enemies new tricks. I had something like 7 or 8 game overs, including a few deaths where I was trying to fight enemies just by countering everything. You get a decent drip of new techniques to try, but once I had more skills than slots, I just dumped some of my huge AP pool into maxing the fastest ones to use. There were glimmers of interesting encounter design around - I enjoyed fighting Dread Comet and Necrophobe, for instance.\nThis game does have many nice-looking places and vistas. Graphically, it generally seemed quite strong, and there are only a few quest-related conversations where I noticed something looking quite bad, like odd lighting on the characters.\nMusic is okay. Big moments have appropriately big compositions. There's a cataclysmic event that happens during the story, after which some weaker tracks really wear out their welcome.\nSidequest quality varies widely. The average sidequest is, someone tells you about a group of easy enemies and you fight them for an item, or you learn the location of an item but there happens to be a group of easy enemies there. A few late-game quests float an idea or two that might have gotten deeper exploration in a more interesting game.\nOverall, I could see some people enjoying their way slashing through this game just to see what's here, but I'd suggest waiting for a sale. I think it takes some fortitude to stick this whole game out without getting too bored.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like this franchise a lot and this looks epic but man the performance is literally ass like my pc meets with the requirement and I already have it on the lowest settings but it keeps crashing in and out of cutscenes it was not a fun experience I'd wait until they made a patch to fix the performance issue",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "one of THE worst performing games of all time.\nI have a 3070 and I'm hitting as low as 15fps in 720P and a high of 52.\nI've played cyberpunk on raytracing high 1440 at 52, how does this on the lowest of low hit 52?\nworst of all it performed WORSE in windowed, HOW?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "For a supposed \"Action RPG\", there's little to no RPG in it. Sure, you level up, but what you get is some health and a couple of points to your stats, which do barely nothing, especially in late game. You never feel like you get stronger anyway, not that there's that much to stats in it. You basically have attack and defence, that's pretty much it. Like yes, you can get points in stregth for example, but all that does is increase your attack so it's pointless. This also makes your weapons pretty useless as there's no unique skills or status effects in them. For example, later on I found a Masamune in a chest and was like sweet, but it was outclassed by my current weapon so the sword was useless. All that upgrading your weapons does is increase attack and how much you do stagger damage. All you do is watch what has a bigger number and that's it.\n\nThere's no elemental stregths or weaknesses either because that would of course get in the way of the combat. It just feels wrong to kill a Bomb with fire attacks and makes my brain hurt. No status effects either, the infamous Bad Breath just does damage. Everything is sacrificed for the DMC-like action, accessories mostly just effects your skills.\n\nThere's a bunch of sidequests to do, but the design of the game is kind of an MMOish, which makes sense judging by the people who made this. Mostly it's just going to a place to get three items and get back, or kill something, there's very little variety. There's not that much exploration either, empty fields with some enemies in them. And if you happen to stumble on to a chest, you mostly just get crafting materials. Then there's these battle stages which are pretty much just FFXIV dungeons, linear levels with trash mobs followed by a boss, rinse and repeat.\n\nThe story wants to be Game of Thrones so bad it comes out rather cheesy and corny instead of mature. Lots of swears are thrown around, some brief nudity, implied sex and blood flying around. But despite its 18 rating it never goes all out, it always cuts away or hides things, which makes the rating pointless. When it's not trying to be GOT, the story gets way better, but the pacing is way off. It's really slow and linear in the first 10ish hours, starts picking up after that and builds up to mid-point with what I'd consider one of the best boss fights in recent memory. After all that spectacle it understandably slows down, but the problem is that it never really picks up after that, leaving a pretty boring latter half.\n\nThe reason why I'm not recommending this is that it's pretty much just an action game. I mostly enjoyed my time with it, but this is not the mainline game I want in the series. Now if you like Devil May Cry then there's probably lot like about, but for a Final Fantasy game it focuses too much on flashy combat. Shouldn't been a numbered title, even Stranger of Paradise, a Team Ninja \"soulslike\", is better at being an RPG than this, and that's a lower budget spin-off. Final Fantasy XVI would've worked better as an 20 hour linear action game than whatever this is, just call it Final Fantasy Gaiden or something...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is just awful – I've never in my life seen so many dialogue cutscenes. The entire gameplay loop consists of watching dialogue cutscenes or going somewhere to watch cutscenes. There's only about 4 hours of actual gameplay in the game, and that part is good, with interesting bosses, except for the ones that are reused. The game is structured around building up to a climax and then the climax itself. Well, this buildup phase involves going to talk to 20 people – and I'm not exaggerating – each with roughly 2-3 dialogue cutscenes. So, to get to any action, you need to watch about 2 hours of cutscenes, then you'll play for about 40 minutes – that's the total time it takes to kill mediocre, boring mobs to reach the boss and defeat it. And after killing the boss, it all starts over again – welcome back to 2 hours of dialogue. I can't take it anymore. I played for 14 hours and I'm deleting the game. Those 14 hours include me skipping mediocre cutscenes, like talking to a farmer about his troubles in the field. In that time, I killed 4 bosses, meaning out of those 14 hours, I had only 2 hours and 40 minutes of gameplay. The rest? Run 700 meters to talk about why the farmer is sad, then run 700 meters to the gates, then you're not allowed through the gates, run 400 meters to talk to 4 villagers about why they're sad, then they'll complain to you about bandits, and you FINALLY go kill 10 bandits and run back 700 meters to the villagers, talk to 4 villagers with 2 cutscenes each about how grateful they are, and they give you a pass to the castle you weren't allowed into earlier, so you run 500 meters to this castle, and there you talk to 5 townspeople about why their lives are hard, and eventually, you reach some action that you no longer even feel like doing.\r\n\r\nMaybe I'm wrong because I'm not comparing it to JRPGs, but these are my impressions of this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the only game i had performance issues with a 5070. Very hard to recommend this to other people.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One of the most poorly optimized games I have ever seen. Story is painfully dull and drawn out over long cutscenes over and over. Gameplay feels extremely slow due to the abundant performance issues. Unplayable without mods or otherwise working around the performance issues",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So for the moment it's the exact disapointement I got from the demo.\r\nI would be acceptable as a 2015 game but we are in 2025.\r\n\r\nNo movement capture, poorly scripted interaction... well, it would go ok as a MMO but as other said, I cannot call a game of this quality a triple A nor what I would expect of a current state of a final fantasy.\r\nFF15 was already showing limits but it was not this bad.\r\n\r\nMaybe it's due to the fact of using a \"custom engine\" and not what we are currently use to \"Unreal\" ?\r\nDunno but interaction don't feel natural so I cannot immerse after 5h, like a budget anime.\r\n\r\nThe combat mechanics are good for the moment, nothing spectacular but pleasant... \r\nI'll check if it improve on the long run. I'm glad to have waited this long for sales.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game for what it is, but there's far too little of it to really call it final fantasy. Your loot is repetitive (materials for making things you've already made, occasional monster piece to make a weapon a hair's breadth stronger than the one you're using). Found a treasure in the wild? *More crafting mats, or 2 gil*. 2 gil, seriously? Talk about a slap in the face when you're level 30something. \nThe combat is fun, a lot of fun, honestly. However, there's no feel of progression. Everything you fight is either \"click button, win fight against swarm\", \"nickel and dime this thing to death because its HP is severely bloated\", or \"I'm going to run in a circle and hope you get close enough for me to attack without getting hit back\". \n1. Easy enemies are just annoying.\n2. Bigger enemies take dramatically too long to kill, especially wyverns. They don't get any easier no matter what equipment or abilities you have. \n3. Bosses are fun. That's it, no other comments. Worth it.\n\nAll in all, it's... not final fantasy. No varied equipment, no control over your party, can't equip your party, you're constantly stuck with a dog as a party member who does next to nothing, you have a hard limit on potions (all... what? 5 different ones there are? Maybe 6? Weak) \nI would rate this as the worst FF game I've ever played, and while I've avoided the first half dozen of them, I'll stand by this statement. \nIf you want to play this, I would recommend not treating it as what it claims to be, and treat it like a completely unrelated game that happens to talk about crystals and summons.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't know how I finished this twice on the PS5, and even platinumed it. Now replaying it on PC, it plays and looks like a mobile game.\n-\nMy original review for it at the time was SQUARE watched the entirety of Game of Thrones and Bridgerton and mixed it with FINAL FANTASY.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "No, this one wasn't fun.\n\n1: Trying to make me care about characters I only seen for a few minutes. All though they are not dead.\n2: It looks like it was made for a full party but they changed it so that you can only equip stuff on one character.\n3: The big fights are not that special.\n4: The Guards should no longer pose a threat to you after the prologue.\n5: The general story and how things goes by was just bad. \n\nThere are better Final Fantasy games to play than this one.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "5/10.  Good enough to forcefully finish, but lacking classic Final Fantasy gameplay.  Plays like an action adventure set in a Final Fantasy world.  Dialogue is decent but super slow and time consuming.  Gameplay system is okay fun for an action game.  The game lacks interesting magic interactions and the RPG element of upgrades/itemization is nowhere to be felt.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What a disappointment this game is.\nIt is nearly a walking simulator, with plenty of long overdrawn cinematics, and very numerable and forgettable boss fights.\nThe only two positives is that the graphics are pretty and the characters look good.\nBut if I wanted that, I'd watch a movie. And it seems whoever made FFXVI wanted it to be a movie, because it has very little game in it.\nThe worst offender is the combat, the sword strikes feel like they do nothing, the combat's difficulty is disguised by enemies with plenty of health that you have to gently shave away.\nThere's no snappiness in the fights, and regular world traversal is done by pressing forward and waiting.\nPretty sure this is a game made for the elderly trying to get into videogames.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "*I played this on PS5 alread*\n\nNot only is this the worst Final Fantasy to date, no it is also just a , at best, mediocre game.\n\nIf i had to describe this game with one word it would be flat.\n\n\nThe Characters are super shallow, oh this is the main character, he is punished and this is his girlfriend.\nThis is the woman that smokes cigarettes and likes bad boy's.\nThis is your mother, she has a son complex.\n\nBut the worst thing about that is that the game never goes any deeper than that or even finishes a story. Almost everything is left open ended to a degree. Even the main story.\n\nOh yeah there is slavery in this game, it is super bad. Atleast for the 30 minutes you are supposed to care about it. After that please forget about it, it doesnt matter anymore.\n\n\nThis game excells at literally nothing.\n\nI would argue the reason it is not a good Final Fantasy isnt even the Combat System or anything like that. No it is the horrible story and characters.\n\nBut the tragedy is, it is not even a good action game because the DMC Style Combat system is just a poor attempt at it, not even remotely good.\n\n\nIf you want to play a modern Final Fantasy please play FF7 Remake/Rebirth instead.\nIf you just want a good JRPG go buy Dragon Quest 11 or Persona 5.\n\n\nI hope Square Enix wont let that ff14 guy make another mainline Final Fantasy and will actually try to get the series back on track.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This is a very annoying game. It constantly pops up these informational things that are just a wall of text that you end up just not wanting to read after the first few times.  The first 4 hours or so (all that I played) was 90%+ cut scenes where characters just talk and talk and talk.  This is not how videogame story telling should be done.  The combat is not satisfying as far as I played this.  So many frikkin quicktime events. Just bad all around. There was absolutely nothing enjoyable about playing this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is unplayable even with a 5070 not worth the headache story was good the frustartion isnt",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is so boring but the soundtrack is one of the best in a long time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wish i could say i played the game for 2.1 hours but its just a movie. I bought it on discount and i'm thankful i didn't pay full price its not an open world when you leave the castle you get to a map and you click an icon. So far its not very enjoyable play wise the story seems some what interesting. I am unsure how Square Enix got the reviews it did.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "DO NOT BUYYYYYYYYYY. This game CTDs consistently and I cant get a refund from Steam because of the whole 6 hour thing. Cant even speak to a human to plead my case. Event though I spent over 3 hours trying to come up with a fix myself. What I was able to play was really fun, but it is unplayable as of now. Luckily I bought this on sale. 34 bucks down the toilet on this one. If anyone has any helpful tips - other than downgrading my driver to some 2024 version, I am all ears.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The gameplay is so outdated and a slog. I dont get it how it mostly have really good reviews.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I will no longer be supporting this company with their stance on AI replacing workers. \n\nDo not buy their games.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This was a hard game to play through and felt like an absolute grind.. \n\nThe ARPG is awful, pure button mashing, a few skills to choose from as most suck, overall combat is not tactical and just fun like classic FF games. \n\nThe story is Ok but has random swearing and sex scenes in which again don't match the classic FF style. \n\nThe world is plain and boring. \n\nI completed it as I love FF games & wanted to see it through but I won't be playing another if it is in this style, sadly for a while now I feel FF games have lost their magic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game, enemy ran out of battle field = heal full health x2 times. Not to mention the fcuking game crash issue. Stale combat system.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Final Fantasy XVI is a genuinely disappointing game in almost every aspect.\r\nThe combat is dull and repetitive, trying hard to imitate Devil May Cry but failing to capture what makes that style exciting. The visuals are underwhelming despite the high system requirements—environments look flat and lifeless, with nothing truly impressive or memorable to admire.\r\n\r\nThe story feels soulless, with poorly developed characters and an unengaging narrative that drags the same plot points on and on for far too long.\r\n\r\nWhat makes it even worse is the terrible PC optimization. My system exceeds the recommended specifications, yet the game constantly drops FPS, even during cutscenes. The performance issues are so severe that it ruins any enjoyment the game could have offered.\r\n\r\nOverall, this game is absolutely not worth paying a premium price for, only to end up frustrated. It fails on almost every front. I tried pushing through and managed to play halfway, but I eventually gave up because the unstable performance was just too much to tolerate.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not getting sucked into this trap. What a terrible introduction. Refunding.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is just a lesser version of dispatch/telltale games, Hopefully I could refund this game bc I've spent 3 hrs already (2 hrs on cutscenes alone). Ben star's performance is great tho.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game sadly is terribly made for PC, the game makers may not care about their American platforms. On my Nividia 1060 6GB it runs high 30FPS and and low 45- 59fps and kinda looks like Bloodborne on PS4. I was playing it still and it was using up large amounts deciated gpu, large amounts of memory and large amounts of cpu all at once but not fully using any. The game also now on profile load crashes. Sad because gameplay is simple and fun, art direction is great. Final Fantasy 15 looks better on my PC on high at about 69FPS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I seriously dislike how the protagonist sheathed his sword, it's ugly and unrealistic. I mean, why? Everyone else gets a realistic sword sheath in their waist, why not the main guy get a waist sword sheath too?\n\nI know this shouldn't be a reason not to play the game, and I heard it has a great story too, but Im tired these tropes of putting \"great\" sword in the back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a movie occasionally interrupted by gameplay. this franchise certainly has changed but not at all for the better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2024...or 2025 ...and the lazy devs cant even add Ultrawide monitor support ?\nTotal disappointment!\nDo not expect them to invest even the minimum of effort. You need to download mods with potential viruses to be able to play full screen ? pathetic!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a souls-like interactive movie and not my beloved ff that I know and grew up with.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really wanted to like this game, but about halfway thru it felt like such a slog to complete. Performance issues also hindered the experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game had great heights and serious lows. Clive's story made me ignore the easy combat, repetitive sidequests, and frankly broken Leviathan boss battle in the DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[quote] Please consider following my [url=https://store.steampowered.com/curator/41005226/]Curation page[/url]. I cover a wide range of genres both paid and unpaid, providing unbiased opinions as well as regular giveaway events. [/quote]\n\n\n[h2]Better Off Watching A Compilation[/h2]\nThis isn’t really a game, it’s more like a series of cutscenes interrupted by occasional \"Press X\" moments. The gameplay is limited to drawn-out, cinematic Quick Time Events that are so forgiving, that you wonder to yourself who is this directed towards, 5 year olds with the reaction time of a snail? It requires no effort. It’s a shame, because this game could’ve been so much more. Looking back at previous titles like Final Fantasy XIII, I find myself thinking, \"Wow, this was an open-world game!\" In contrast, this title has you walking for a couple of minutes, watching an endless stream of cutscenes, then slogging through repetitive mob fights where you just press X so you can get to the heart of the experience which is the boss fights... But they aren’t much better, you press X to land cool-looking cinematic strikes, and cinematic dodges in slow motion, while pressing X a lot.\n\nThere’s zero challenge. I am here literally playing with one hand tied behind my back. To make matters worse, there are amulets and rings you use in the base game that effectively turn the whole experience into an auto-pilot mode. It’s as if the game is playing itself. With this in mind, it's abetter to watch a compilation of all the cutscenes. You’ll save yourself money and see just how bland everything truly is.\n\nOh, and for the record, Cid is hot again. So I guess there's that?\n\n[h2]Issue[/h2]\nIt's a cinematic, not a game. I'd rather KILL CHAOS.\n\n[h2]Conclusion[/h2]\nFF16 is more of an interactive movie than a traditional Final Fantasy game, with an overemphasis on cinematics and scripted events. The world feels small and restricted, lacking the exploration and player control that someone like myself would love to have. The loss of freedom to roam and shape your adventure makes the game feel like it’s prioritizing spectacle over gameplay. This shift away from classic FF exploration and meaningful interaction with the world leaves me feeling disconnected and ready to pass out as I continue to mash (X) and lean back.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm biased against anything Enix related (ironically the only ff to give me ff vibes after 10 has been 14). Having said that I'll try to be objective about this game.\r\n\r\nI loved the demo which is what prompted me to buy this, although only at a massive discount. And even then I don't think i'ts worth it. The fun stops when the demo ends for the most part, there's still some cool moments, but the game becomes such a massive slog.... \r\n\r\nTo elaborate; playtime is bloated to achieve a desired goal, which I'm guessing it's some corporate bullshit. It could've been decent if it ran for 20h. But it runs for 60h if you rush it which makes it feel like you're doing chores most of the time. It feels padded with pointless combat, sidequests, mainquests that feel like sidequests, unnecessary dialogue, unnecessary systems, etc\r\n\r\nThen there's the writing, game starts strong with the demo bit, but then it goes into free fall, main characters don't evolve at all, they're boring and one dimensional throughout the game. Story is ok but uninspired, worldbuilding is also ok maybe even good, but wasted. On a sidenote It also weirdly seems to try to be dark fantasy a la GoT at some points which just doesn't work for me.\r\n\r\nThere¡s also almost no meaningful customization, all the supposed rpg elements are completely pointless, as progression is 100% on rails.\r\n\r\nSo if the game sticked to being a spectacle action combat game with the typical duration of 10-20h and was priced at 30-40 euros from the get go it would've been ok, but this attempt at action with some rpg decorations on top of it doesn't do it for me. And that paired with the feeling that my time wasn't respected leads to me Not recommending it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Terrible performance and constant frame shuttering in cutscenes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "probably a good game but i need a nasa pc to have enough fps to enjoy it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game keeps crashing at shader",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cut scenes running at 30FPS make my eyes bleed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a game made for rtx 7060 with 8 gb of vram",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible combat.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "terrible performance",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is not fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Expensive crap",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "“This isn’t how it’s meant to be.”\r\n\r\n~Clive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "szkoda prądu",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The tragedy of this is that the gameplay is SO GOOD! Twenty-three hours in you will only be playing for five to seven hours of that time. You are buying a movie with a myriad of playable hallways. The twenty-minute episode of exposition interrupted by the occasional playable hallway. \r\nThen you get to a boss fight and it is so epic that you will actually be roaring at your screen.\r\nThen walk down that hallway, again.",
      "voted_up": false,
      "votes_helpful": 284
    },
    {
      "review": "[h1][b]After >100hrs and 100% achievements, I feel I have a grasp on just about everything FFXVI has to offer, and I don't recommend it.\n\n\n↓TLDR FOUND BELOW.↓[/b][/h1]\n\n\n[h1][b][u]THE GOOD[/u][/b][h1]\n[*] The last DLC \"The Rising Tide\" is what I wished the main story was. A simple narrative with a simple message, executed well, that doesn't overstay its welcome.\n\n[*] Oddly enough I think the strongest aspect of FFXVI is its User Interface. SE must have thought so too because you can see many of the UI elements introduced in this game in the new FFT Remaster.\n\n\n[h1][b][u]THE MID[/u][/b][h1]\n[h2][b]VOICE ACTING[/b][/h2]\n[*] It's always aggravating when throwaway NPCs have better performances than the main characters, and this game is no exception. I didn't like Ben Starr (Clive Rosfield) or Susannah Fielding (Jill Warrick)'s performances, as the prior felt comically over-dramatic and sullen, and the latter felt comically apathetic and dry. I have a feeling this is due to direction and not acting talent though, especially after playing Expedition 33 and seeing Ben Starr play Verso. That being said there are one or two moments in FFXVI that stuck out to me where Starr's delivery was exceptional, and many people including me appreciate his passion for JRPGs. Ralph Ineson as [spoiler]Cid[/spoiler] was easily my favorite performance, [spoiler]I really wish we had more time with his character[/spoiler].\n\n[h2][b]MUSIC[/b][/h2]\n[*] Of course this is subjective, but I think Masayoshi Soken's soundtrack for FFXVI is the same as FFXIV: A very functional, serviceable OST with some amazing stand-out tracks.\n\n\n[h1][b][u]THE BAD[/u][/b][h1]\n[h2][b]NARRATIVE[/b][/h2]\n[*] I think the first act has a compelling setup, and the second act had me on the edge of my seat wondering how some of the biggest major conflicts would resolve. The game hits its peak at the end of act 2. There's a boss fight with some ridiculous over-the-top spectacle (in a good way), and all of the main character conflicts that I cared about were resolved. \n\nThen the game keeps going. \nAnd going. \nAnd going.\n\nTo say the final act is drawn out is a criminal understatement. Every scene is stretched out to its limit, information is constantly repeated because the audience can't be trusted to pay attention, and characters talk in circles. Any scene with [spoiler]Barnabas Tharmr aka Odin[/spoiler] made me want to blow my brains out, and they take up pretty much the entire third act. I really can't stress enough how drawn out the finale of this game is.\n\nI hate to use this word, but FFXVI's narrative is [b]pretentious.[/b] It acts as though it is telling the most grandiose, nuanced, deeply compelling story imaginable, when in reality it is the same gnostic slop we have been presented with for decades at this point. Having [spoiler]\"god\" actually be a lesser malevolent force[/spoiler] is nothing new to the FF franchise, in fact it's the plot of just about every game in the series. But man if FFXVI doesn't act like this is the first time it's ever been done, and that you should be in awe for it being so avant-garde. For being such a contrived plot, you'd think they would've been able to execute it with precision at least, but FFXVI falls short here as well. The point has been made but my feelings are only so strong because acts 1 and 2 were so promising, which made me feel even more disappointed with the lackluster finale that ultimately ended up being a huge waste of time.\n\n[h2][b]GAMEPLAY[/b][/h2]\n[*] Speaking of a huge waste of time, FFXVI's combat is repetitive and boring. You spam basic attacks until your abilities are ready, use said abilities, rinse and repeat for [b]100 HOURS[/b]. Every single enemy is a damage sponge. The combat does actually have a lot of depth in terms of how you can chain combos and abilities, but you are never incentivized to explore this depth, as you will ultimately end up doing less damage than if you had just done the aforementioned \"spam square until abilities are off cooldown.\" I think this repetitiveness could have been remedied by a DMC-style \"grading\" system that encourages players to actually use combos. Maybe give them a damage boost if combos are executed properly, then it feels like the enemies are sponges for a reason other than to waste your time.\n\n\n[h1][b][u]TLDR[/u]/FINAL THOUGHTS[/b][h1]\n[*] [b]TLDR: [/b]Play something else that interests you and respects your time more. Although FFXVI has some stand-out moments, I cannot recommend it due to its needlessly long playtime, disappointing final act and repetitive gameplay. \n\n[*] I'm screaming into the void saying this, but please stop making 30-40 hour RPGs 70-100 hours with pointless filler. I miss when FF games were 30-40 hours and told a succinct, compelling story with great characters that stayed with you long after the credits rolled.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "I bought FF16 because it was made by the same team as FF14. I LOVE FF14 and would sing its praises to anyone willing to listen. But that praise comes with the acknowledgement that FF14 is an MMO, and the understanding that MMO devs are limited in what they can do when it comes to gameplay and presentation. Despite those limitations, FF14 managed to craft one of the best stories I've ever experienced in gaming.\n\nWhile I wasn't expecting FF16 to reach the storytelling highs of Shadowbringers or Endwalker, I at least expected it to be fun and tell a good story. The devs somehow managed to fail at both. Horribly.\n\nPeople describe this game's story as \"FF meets Game of Thrones\" and that's only true on a surface level. It's dark and gritty with a plot that focuses heavily on politics and intrigue with the occasional kaiju battle mixed in. But the writing fails horribly at making any of it actually interesting or meaningful. Characters are paper thin, with Jill, the female lead, in particular being quite possibly the blandest FF character I've ever seen. Her sole character trait is \"Clive's girlfriend\" and has so little personality or agency, she may as well just be another accessory hanging off of Clive's belt. The political intrigue is also mostly set dressing, to give Clive a reason to revisit the same brown/grey town for the 10th time, but never actually give the player a reason to care about the wider world or the people in it. Cutscenes and dialogues are presented with bare bones, MMO-style cinematography that works fine for games like FF14 but has no business in a modern single-player RPG. The plot is also predictable as hell, embracing every \"dark fantasy\" trope in existence with little in the way of surprises or twists. You've seen this story a million times before.\n\nThe quest design ranges from boring fetch quests to main storyline quests that involve watching a dozen or so roundabout dialogue scenes before being sent down a linear corridor where you fight a group of the same reskinned enemies with the same shallow combat mechanics.\n\nThe combat system itself is pitifully bland at first, then gets fun after you unlock a few more abilities, then gets bland again once you realise those abilities are all flash and no substance. You can easily win any fight by just dodging and hitting things with your sword. The Eikon fights have potential at first, but they feel so janky to control and the fights drag on so long that they don't feel anywhere near as powerful and badass as they should. Not to mention most of them play out more like on-rails shooters and QTE fests than an actual combat system.\n\nEven the character and world design is a letdown. Final Fantasy has a reputation for crafting beautiful worlds that you want to get lost in, with memorable characters whose designs spark the imagination. But I think whoever was in charge of the art in this game forgot what franchise this is, because every environment you visit has the same washed out, grey/brown color palette. Character designs are equally as bland. Clive, for some reason, is the only character who even remotely looks like what you'd expect a FF character to look like. But because everyone else around him looks so painfully drab, he ends up looking like a cosplayer who got sent back in time. It's impossible to take him seriously. And the game really, really, wants you to take him seriously.\n\nIf there's one positive, it's in the sound department. The voice acting and music are top notch, but unfortunately neither can save an otherwise excruciatingly dull game.\n\nIf I could get a refund, I would.",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "This game is full of incredibly stupid design choices:\r\n\r\n- Watch 15min cinematic -> it lets you play -> walk literally two steps -> 15min cinematic\r\n\r\n- Watch another 20min cinematic -> game shows you map with fast travel, ALL points locked, you HAVE to click the only one that's available. Why don't you just load the zone?\r\n\r\n- Complete a side fetch quest, talk to NPC for 5minutes, game opens a pop up for you to select items to give to the npc to complete the quest. You HAVE to select all items individually  and click OK. You can't do anything else. Why is the popup even there?!\r\n\r\n- Open levels are incredibly empty, zero incentive to explore.\r\n\r\n- Tunel levels are empty as well, long corridors with couple of enemies. \r\n\r\n- Combat looks like a poor atempt at replicating DMC combat. Repetetive and spammy.\r\n\r\n- Outside of main story cinematics, NPCs are poorly animated. Just couple of moves away from t-posing...\r\n\r\n- Call a chocobo, ride it, find a treasure chest, get down and pick the treasure, chocobo is gone, need to summon it again... (minor but annoying)\r\n\r\n- Crafting system is worthless. Craft an item and five minutes later you find something better.\r\n\r\nIt's the most boring FF I have ever played. It wastes a lot of time with unnecessary button prompts, invasive popups and repetetive cinematics (which take about 50%-60% of the gametime).\r\n\r\nTo sum up, the story is Okish (cliche ancient evil coming to destroy the world vs \"a chosen one\"). Game looks good and cinematics are nice to look at, VA is ok. But for that you can watch the playthrough on youtube...",
      "voted_up": false,
      "votes_helpful": 133
    },
    {
      "review": "with a 4060, and on medium settings, the game ran as low as 20 fps at times, square please for the love of god fix your pc ports",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "This game is an embarrassment as a Final Fantasy, an RPG, an action game and a PC port. There is good things here, like crap sprinkled with gold, but overall it gets ruined by under-developed characters, horrible story pacing, horrible side content, mind-numbing combat systems, RPG mechanics that don't matter at all and a terrible PC release that as far as I can tell, has not had a single patch since its release a year ago.\r\n\r\nHere's a deeper outline into each of my points:\r\n\r\n* In my opinion, the two biggest selling points for a Final Fantasy should be its story, and its gameplay, FFXVI fails at both spectacularly. The story starts strong with a pretty visually impressive prologue and an easily digestible setting. But then the actual game starts, and it feels like to meet a quota on how long FF games should be, they added A LOT of filler that interrupts the pacing of the story to a halt. Save NPCs so they can clear your path, help merchants with random monsters, gather sand in some corner of the map...the list goes on. These are main story quest examples that did not have to be there and have negative impact on the characters, or the story as a whole. \r\n\r\n* Characters are a mixed bag of well built and one dimensional. Most of the main cast is the later, including the main character. Despite having emotional moments for the characters to grow, it doesn't feel believable or impactful in a way that makes them grow. And some of them even die before they get a chance to be explored more, or were some of the few good ones. The decisions of who lives and dies feels arbitrary and sometimes so out of the blue that you question what the point was at all.\r\n\r\n* The combat and RPG systems are as deep as a puddle, but also not very wide either. Most of the time you will be spamming one button to do your basic combo and doing your abilities on cooldown, it's not deep, and because there's nothing related to elemental resistances or weaknesses, the only difference between eikon powers is which ones do more damage than stagger, or viceversa. I cleared the whole game with the early set of eikons (Phoenix, Garuda, Titan) and never felt any need to upgrade or even change my abilities, you can roll the game with no thought or planning. The RPG elements like levels and equipment also feel tacked on with no deeper meaning than extra stats or meaningful changes other than increasing damage of skills or reducing cooldowns. It's all incredibly shallow through and through, at least most big boss battles are flashy but more of a spectacle than a challenge.\r\n\r\n* Lastly the PC port is absolutely horrendous, a high-end PC should NOT be struggling to keep even a 60 fps lock, the game eats Vram like a mukbang youtuber and you will have to exit back to title to refresh your session, in order to restore performance. It's honestly unacceptable that a year after you still have to use community fixes to make the game bearable, cutscenes locked at 30 fps in a cutscene-heavy game should not be a thing.\r\n\r\nI would recommend this game if you want a somewhat okay but ultimately lacking movie game, you will be sitting down through cutscenes more than playing, and even then, the playing won't be too great.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "This is really sad to say but it's a repeat offense. Walking and pressing one button does not a game make. The story is fine but predictable, the difficulty is laughable at best on the hardest, and the amount of cut scenes is just sad. If you want a story game this is for you, if you want a final fantasy game prob best to go play ff7 remake. \n\nWhen games like E33 and Elden ring exist, there is no excuse for there not to be a more open world. Hell even FF7 rebirth had wide open areas with places to explore, activities, side quests, and special monsters to find. This game took every single mechanic that made those games fun and tossed it in the trash. \n\nThe topper tho is the summons in the game, summons use to be cool helpful entities that help you fight in combat coming with their own move set. That's now been replaced with \"you can use this ability now\", nothing changes and 5 hours in and i haven't been able to do anything cool like in the cut scenes they show. it's just final fantasy the movie and every now again you get to press a button.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "What an incredibly terrible game. I'm like 15 hours in and 7 of them have been cutscenes. Got all these crafting mats with literally nothing to craft. I don't look forward to the combat or the cutscenes and the exploration is terrible and the loot you pick up is garbage.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "optimization is so bad i cant even play it sometimes 15-20fps with rtx3060 this is embarrassing and i very much regret spending my money on this",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Combat felt pretty repetitive and boring and gear is very barebones, honestly you'd be better off watching the cutscene compilation from youtube if you're interested (which was half of my playtime going by the video timer)",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game is a visual novel where once every 20 minutes, for a bout 5 or so minutes, you run through a hall way. In two hours of nonstop \"game play\", I only controlled a character for about 20 minutes total. the rest being cut scene after cut scene. The playable parts are bare bones. Highly disappointed as the story is really good... but I'm looking for a game to play, not a movie to watch that has extra steps.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Just not a very good game. Sad to see how far this series has fallen; this is a poor clone of a souls game without any of the heart we're used to from the FF series. 15 was a shitpost of a game that didn't take itself seriously and had some fun as a result; this is whiplash in the other direction and while the tone is improved, the execution is so flubbed this will likely go down as one of the worst entries in the series.\r\n\r\nWe've gone from vast RPG landscapes of FF7 to cramped, small maps on a small continent. Seriously, the chocobo is laughably slow because if it was any faster an entire map would take you about 15 seconds to traverse. Not that you have to -- the game lets you fast travel basically everywhere. Using the in-game distance calculator the entire continent is about 3km wide. The world is not nearly populated enough for any of its stakes to feel real. It projects a self-importance that its contents do not justify.\r\n\r\nThe characters are wooden, the plot derivative and the gameplay is frustrating because of non-responsive controls, but also too easy so that the poor controls don't make the game frustrating. The entire second act of the game (about 10-12 hours worth of content) feels like it could be reduced to a 2 minute cutscene and probably improve the pacing -- which is atrocious, with multiple time skips scattered throughout the game. Crafting is super shallow, combat is gimmicky and the side quests are so few, so inconsequential and take so little time to complete you wonder why they even bothered.\r\n\r\nI'm too far in to ask for a refund but I just find myself asking \"why should I complete this game?\" It feels like a chore with no payoff. I don't give a crap what happens to any of these characters.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The pacing of this game is dogshit and I would not have bought it if I had realized that this game took the FF14 approach of time-fillers between genuinely decent story beats. Alas I am unable to refund this game and have to resort to using a review to let off steam.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Absolutely unacceptable port from Square Enix. 30fps cutscenes, no ultrawide support. Poor optimization, and frequent crashes make this unplayable.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Final Fantasy in name only. Forgettable storyline, unoptimized slop. Music is also forgettable, graphics are about the only thing going for it, but overall, very disappointing.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I am 30 h into the game and i just kept playing because I thought that there must be more.\nGuess it is not going to happen. The gameplay are fetching quests, killing some generic monsters and get some epic cinematic button smashing fighting scenes. It is a good looking game but that's about it. I also do not care about the charactersfor now. If you like vanilla, you will like that game: Sadly just a movie with some inputs you need to press.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Is the stuttering intentional? Probably a great game but it took me an hour to minimize the unplayable stutter while being far above the recommendations on hardware.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Easily the most boring entry to the series to date. If you enjoy walking for 10 minutes, watching a cutscene for 10-20 minutes, walking some more, finally doing battle for 5 minutes, then 10 more minutes of cutscene, then fast travel to the next cutscene, this game might be for you\n\nYoshi needs to go back to making MMOs or maybe consider going into making movies instead of pretending to make games",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very poorly optimized. This game does not work on PC. It drops frames and freezes often, and crashes way more than can be justified by small bugs. I've heard the same from many other people I personally know, two of which have way better setups than me, which says a lot because mine is no joke itself. It's a shame because this really does seem like a great game, but it's nigh unplayable as it is now. If you want this game, you are better off playing it on console.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Two years after release, and over a year since its PC launch, this game still runs terribly on PC. I have a high-end system, and the only titles that give me trouble are ones that are poorly optimized—and unfortunately, this is one of them. I’ve tried every suggested fix and tweak to squeeze out better performance, but it still isn’t where it should be.\r\n\r\nOn top of inconsistent FPS, there are frequent technical issues. For example, the game has locked up multiple times simply from alt-tabbing.\r\n\r\nIt’s a great game at its core, but in its current state I can’t recommend it on PC.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a movie but sometimes you have to press a button.\nLet's start with the pros: the plot seems interesting and the graphics are very good.\nNow the cons: it's not really a game, everything is linear, you don't have to make any choice, there is no characterization or build system. Everything is as plain as it gets. The maps are literally just one line so there is no real exploration in this game. Combats are boring af nothing really needs for you to think of a strategy of any kind. \nI highly recommend watching a youtube video for the plot and call it a day.",
      "voted_up": false,
      "votes_helpful": 43
    }
  ]
}