{
  "positive": [
    {
      "review": "Og player returning after years, my childhood game on mobile, now on pc...",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Long time player since 2015, ever since they added the good ol' Secret Forces Rifle. I actually can commend the game now for being less P2W than 2017-2019 which imo was when the game peaked being P2W, however I greatly feel the game has lost its charm and just doesn't feel the same like how it did from 2015-2020.. Also, gawd dang we don't need 65% of this games weapons being mythics and legendarys. eh, this game barely scrapes a positive recommendation..",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "goated game but kinda ruined by all the p2w stuff but if u ignore that then its a good game",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "There is also a lot of p2w in this game, and it basically wants your money.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my fav childhood games, the love that I have for this game honestly can't be said by words. Me and my friends back in 2015 - 2020 would play this game 24/7 and love to compete with who gets the best weapon at that time first and grinding together, we would also meetup in our local mall where our dad's worked and play together after playing football. Its honestly one of my best memories and we still play it to this day. Man its been one of a journey with this beautiful game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nostalgic. pure nostalgia this game brought me so much memories. played it since 2018 maybe less. this game is just goated.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its one of my favorite childhood games ever. I first played this game in 2015 and was awesome back then.Now its a lot pay to win,not really i mean u can play the game and get a lot of OP things,but if u want something fast,put the card man.\nAn awesome game,one of my favorites till this day,i'm still playing it.\nits sad what Cubic did to this game,to make players quit,only for some money.\n\n9/10,awesome till this day.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game unlocked my third eye and gave me a new way of life. IO will forever be greatful for the experience this game has been able to give me. God bless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, hoped that they didn't destroy the game and have the game this p2w",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is really fun, and if you play for a bit, you'll be able to get the hang of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been playing for years even when I had a diffrent account its is fun to grind and get good and finally beat those no life menaces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game , FREE , sure it came out 2013 , but apart from microtransactions , aged well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pixel Gun 3D: PC Edition is a fun game that brings back the nostalgia of playing it on mobile when i was a kid. Glad i could do it once more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played it when I was a kid and it was a very cool game, but now it have too much p2w, nice game to play for like a hour or two in a month just to feel nostalgia",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pixel Gun 3D is a fun and fast-paced shooter that mixes Minecraft style visuals with arcade style action. The game offers a huge variety of weapons, maps, and modes, so it’s easy to jump in and always have something new to try. Whether you like competitive matches, co-op waves, or just messing around with creative loadouts, there’s a lot to enjoy. Progression can feel grindy at times, and balancing isn’t always perfect, but the gameplay is still addictive and satisfying. The customization options and constant updates keep the experience fresh. (Overall: 7.5/10) A fun, chaotic shooter that’s great for casual play and nostalgia.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Everyone says this game is p2w but it really isn't since I can still face other players that have spent money on this game as a f2w player. This game doesn't deserve it's downfall in my opinion so I recommend this to other players because it is still fun as heck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing public shooter game with minecraft graphics and amazing players and maps great nogstalgia",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game reminds me of that time when I was really feeling down, I can confidently say this game makes me want to uninstall it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Begrudgingly this game is still fun, but the economy could not be less new player friendly and I would highly discourage trying to play the PC edition without a mobile account. Morally this should be a thumbs down review.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game definitely nostalgic bunch of sweats tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pixel Gun 3D: PC Edition is what happens when someone looks at Minecraft and says:\n\n> “Cool blocks. Needs more bullets, battle passes, and 47 currencies.”\n\nIt’s a blocky online FPS where everyone is either:\n\n* Level 5 with starter gear\n* Or a neon demon with a rocket minigun, wings, a pet dragon, and Wi-Fi straight from heaven\n\nThere is no middle class.\n\n---\n\n### Pros\n\n* **Stupidly accessible chaos**\n  Boot up, pick a gun, spawn in, instantly get 360’d by a cube in a hoodie.\n\n* **Weapon variety is insane**\n\n  * Shotguns\n  * Snipers\n  * Laser rifles\n  * Stuff that looks like it was designed by a 9-year-old with sugar and no supervision\n    If it can shoot, explode, zap, or erase your dignity, it’s here.\n\n* **Game modes for every brain mood**\n\n  * Deathmatch\n  * Team fight\n  * Battle royale\n  * Duels\n  * Probably “stare at each other menacingly in a blocky corridor” somewhere in there too.\n\n* **Movement**\n\n  * Double jumps, gadgets, vertical maps\n  * Half the lobby is on the ground\n  * The other half is in the stratosphere raining chaos\n\n* **Peak “turn brain off and pew pew” game**\n  Perfect for when you’re done being a responsible adult and just want to be a square with a gun.\n\n---\n\n### Cons\n\n* Balance is… a suggestion.\n\n  * You: “I have a cute little rifle :D”\n  * Enemy: pulls out a gun that shoots miniature suns\n\n* Matchmaking sometimes looks like this:\n\n  * You (PC, keyboard, trying your best)\n  * Three mobile veterans with god-tier aim and anime clan tags\n\n* The number of upgrades, skins, gadgets, parts, modules, and currencies will make your wallet nervous even if you never spend a cent.\n\n* You will die to weapons you didn’t even see, from angles that don’t make sense, and just accept it as “Pixel Gun moment.”\n\n---\n\n### Peak Pixel Gun Moments\n\n* Spawning, taking two steps, immediately exploding from a weapon that sounds like a microwave transforming into a jet engine.\n\n* Getting a killstreak and feeling unstoppable… then walking around a corner into a guy with a one-shot hallway vacuum gun.\n\n* Unlocking a new weapon, reading the description like “huh, that seems busted,” then getting shredded by a *better* busted gun 0.3 seconds later.\n\n* Joining “fun casual match,” leaving emotionally damaged because a child called you trash while double-jumping over your corpse.\n\n---\n\n### Final Verdict\n\nIt’s loud, colorful, unbalanced, monetized, and absolutely unashamed about any of it.\nBut it’s also… fun. Like, *annoyingly* fun.\n\n**8.5/10**\nWould once again queue in with my sad little starter loadout, get vaporized by a glowing pay-to-flex cannon, and still hit “Play Again” because the cubes go pew and my brain likes it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice non-stop action game, i hade very fun burning other players behinds with that freaking baby dragon.\r\nFor simple fun, i recommand this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Used to be the best game, sadly ptw took over, the games still fun but the ptw players are too good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Need to learn 3cat spam to play ,pretty easy ,but you need good weapons ,so just watch ads and buy from trader van.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can't have ANY friends until you have 75 xp. I goon to this game everyday and my parents left me. I love men",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was better a long time ago but now its just fun to comeback to with friends every now and then",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game really brings back memories and yes it can be paid to win but i still enjoy it regardless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok First off this game is addicting. Second this is fun to play, Yes I do rage in this game sometimes but it is fun. I would overall recommend this game to play. I would rate this a 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have been playing this game for a while near since it released and it is a really fun shooter my only problem with the game is that you have to gamble to actually get good stuff but otherwise it is really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "w game i unlocked all primary how game works summarized, easy to learn, hard to master.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I do recommend this game, but i just payed 9.99 dollars for a mythical armor set and i didn't get it. Not very happy about that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this game all the time a few years back on my phone and this is just so nostalgic to finally be back",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun and all but the best is when you play with a friend it gets a hole lot more fun try it out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even if the games is full of competitive players\r\ni dont mind it at all on pc this game has its benefits (no ads and obv better graphics)\r\nfor someone who played pixel gun since 2018\r\ni have to say the game manages to hold up but poorly \r\neven the OG event didnt bring back any players\r\nit mostly gets to a point that this game cannot be revived.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game! Loads of fun to play with freinds or just in my free time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a generally pretty good game, not too different from the og pixel gun. Would recommend for nostalgia purposes, still pretty fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pixel Gun 3D: PC Edition brings the mobile game’s colorful, blocky FPS action to PC with smooth controls and plenty of content—maps, modes, and over 1,500 weapons. It’s a fun, casual shooter that’s perfect for nostalgia and multiplayer battles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, played it on mobile for a long time, and it was awesome that you could transfer your account over to steam!\nDefinitely recommend playing this, as it was a great way to pass the time.\n\nVerdict: 7.3/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its pretty fun its like counter strike call of duty minecraft and fortnite put together its pretty goof for a free game try it out",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its very fun! Theres different gamemodes that you can choose to play, theres team, red and blue, they verus each other. And, the weapon designs are cool!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as good as it used to be, but you can still get some fun out of it every so often",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "holy fuck this game has absolutely ruined its reputation, ai slop, pay to win, AND OH MY GOD just play cs2, the whole point was it was meant to be minecraft but awesome sauce this just makes me want to kill myself, yes i reccomend!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Jogo marcou muito a minha infancia de mapas e armas e muito divertido mais agora eu sinceramente eu nao vejo muito ponto em querer jogar mais pq eu enjoeei mais, deem uma chance pro jogo é bom!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun. The game is good\n\na lot of people complaining about it being pay to win, which I understand; but that's been very normalized in multiplayer gaming nowadays. \n\nIf you can overlook that, it's a simple and quick fps to enjoy from the comfort of your PC or Phone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "P2W? Yes\r\nDoes it resemble the old good times? IT STILL DOES.\r\nDId it advance a lot? Absolutely.\r\nCan it still be enjoyable? YES.\r\nStop crying about it being just an empty shell of what it used to be and get over. Everything will change sooner or later. Get good again and get the most out of this game. It is absolutely fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I fucked my first bih playinda game on da pc. it was mad chedda fr ts. love yall at da pixel gun mane yall made a dope ass game fo uh.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a good game just watch out for RED X he calls everyone a loser and/or a noob",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game and it was a part of my childhood and would want any age group to play this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Fantastic! 🔫🎯💥[/h1]\n[h2]I recommend this game to every gamer![/h2]\nPlaytime: 10+ hours • Countless matches completed\nAfter sinking over 10 hours into Pixel Gun 3D and grinding through countless matches, I can confidently say this is one of the most entertaining shooters ever made. What looks like a simple blocky FPS quickly reveals itself to be an incredibly addictive experience packed with content at every turn. Solo or with friends, this game is pure chaos in the best way.\n🎮 While it's absolutely a blast playing alone (you'll lose entire evenings in Battle Royale or Deathmatch), teaming up with friends creates some of the most hilarious and intense gaming moments. Coordinating strategies in Raids, dominating lobbies together, or just messing around with ridiculous weapon combos - it all works perfectly whether solo or with a full squad.\n[h3]Why This is Gaming Perfection[/h3]\n🎯 Incredible Variety: The sheer number of game modes is mind-blowing. Sniper? Rusher? Battle Royale survivor? Minigame enthusiast? Pixel Gun 3D accommodates every playstyle seamlessly.\n🏆 Weapon Collecting Done Right: This is genuinely rare - a game where unlocking new gear is actually exciting. The arsenal is absolutely massive, and experimenting with different loadouts keeps every session feeling fresh.\n🔄 Endless Replayability: Every match feels completely different thanks to diverse maps, weapon variety, and the chaos of online multiplayer. I've been playing this for years and still come back for more.\n🛠️ A True Classic: The fact this game has stayed relevant and keeps delivering content shows incredible staying power. It's earned its place as a mobile gaming legend.\n💡 Pro Tip\nJoin clans and participate in events for an extra boost of XP! The community aspect adds so much to the experience, and seasonal events drop some of the coolest exclusive rewards. Don't sleep on these - they'll accelerate your progression massively.\n🎯 Bottom Line\nThis isn't just a recommendation - it's essential gaming. Whether you want quick competitive matches, chaotic Battle Royale sessions, or to get lost in one of mobile gaming's most iconic shooters, Pixel Gun 3D delivers on every front. A CLASSIC that never gets old and is always ready for endless fun with or without friends.\nFINAL RATING: [h2]5/5⭐[/h2] - An absolute classic that somehow keeps pulling you back in for \"just one more match.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, I was playing it on my phone years ago, it may be PTW but you can get everything without paying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started playing this in 2015, Quiet Island was one of the most fun places to be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Og player returning after years, my childhood game on mobile, now on pc...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had fun while playing it, but also felt like I didnt want to continue. Its not for me but leaving it a thumbs up because I had a solid half hour of fun for free :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "finally realized that the pool map used to be my childhood, no wonder why the map looks kinda funky and nostalgic to me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like this game cuz its a dumb down version of minecraft, cod, and fortnite all in 1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, been playing since 2013 but ranked is filled with bots as of now...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "lwk boring asf, but fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's super cool and fun, worth your disk space",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not that good , but this game was my childhood,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very fun! not too easy, not too challenging! i def recommend this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mid, but I guess it's OG season was good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pixel Gun 3D is an amazing game. Unlike other Shooters, The game does not rely on constant grinding and micro-transactions. As a Mobile and PC player, I can see why people aren't happy about the price for packs (One is £23.59 for some guns and characters) but the game has multiple free items to give away, like keys, coins and diamonds. Another note is that the game is laggy on some servers but I can't say I have had this bug on PC much. There are many modes to offer such as Deathmatch, Battle royale and even Campaign! If you want a good experience multiplayer or singleplayer I'd say download this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Goated childhood game that went availible on PC to which is awesome! W",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a VERY good game, The best SHOOTER I have ever played. 👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun to play if you are ready to play against p2w players who one tap you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes i would def reccomend, great silly shooting game to pass the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its cool, brings back child memories",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has single Handedly changed my LIFE.... My wife didn't love me when i didnt play ts (ts as in this) game. Now that i have achieved a shitty rank my wife and kids FINALLY love me for who i am. and now my wifes boyfriend plays with me on the occassion!!! sometimes they let me watch their \"fun time\" while im on the game. 10/10 Would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been a w game since my childhood still wish they would give out more coins tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what a great pixel FPS game 10/10 would play this every night",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I have on steam... (Edit: I kind of love it and hate it)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun used to be the best on my mums phone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good i played it a lot back in 2019 but lost my account",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the greatest shooter game ive ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game in my entire life ever since my childhood",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game all the time on my phone in like 2012 but i had no idea that it went to pc, made the game soo much more fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is on red dead redemption's level",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IT IS VERY FUN, but doesn't hit the same vibe as when i was little",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Even better on pc! I love this game so much omg!!!!11!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is decent, isn't like how it was back in 2014.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is the BEST game ever made play it now plssssssssssss",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun good rip off fortnite",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, I've been loved this game. I met so many friends when I used to play this on my phone back when I was in 5th grade. Now I'm in my 3rd year of college, doing my thesis and the love I have for this game has not changed a single bit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been playing this game since i was 6 on and off. one of the best games of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Alright game, but way too p2w",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun times wacky guns Custom DeadPool Skin .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "have to play this game for two hours to say people are poo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a fun game to pass the time lots to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITs very fun but it kinda feels like fortnite in easy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak nostalgia game, I recommend playing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Theres free mode and lots",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good first shooter game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's still a fun game as it used to be, worth trying it out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Copywrites must go crazy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i used to play this back in 2016 still a banger",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it brings back a lot of old memories",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its minecraft fortnite",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "minecraft meets counterstrike decent on steamdeck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME EVER PLAYED BETTER THEN FORTNITE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the bast game i ever plaiyd",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "this used  to be one of the greatest childhood games of anybody with a device, but the greedy developers made it basically unplayable without spending money. they genuinely deserve to be put into debt by loan sharks and then jumped on the streets because of what they did to this game.\n\ntldr: game is garbage now, dont bother playing, i hope the developers have the worst life ever.e",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "a childhood memory unfortunately its plagued with alot of predatory monetization and its ridiculously pay to win. look how they massacred my boy",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "the game is way to much of a pay to win to acctualy enjoy the game back in 2018 it wasnt nearly this bad the game went from the best mobile game to most pay to win of all time the game had probably one of the worst downfalls in  my opinion",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "The game is not fun anymore, just P2W. Don't play since they're greedy.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "what the  f**k happened to this game? its literally all pay to win and not to mention that when i wanted some nostalgia and ive decided to play it it immidiately hit me with a server error, i couldnt play the game for 2 days and when it finally opened up and i played a match it would kick me out every 20 seconds each time i joined and my internet connection is stable. what the hell cubic games? people want to come back because of the 'og season' and this is the first thing we get hit with? great, just great. i used to love this game since i was a kid, i think its time to grow up.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i miss the days when Rilisoft still ran the game. the OG's only remember that name. i believe that was the peak of PG3D. the hill started facing downwards after that one chinese update that added chinese weapons/pets to the game. it was the last of the OG updates we'd ever see, and im sure most of us already saw this coming. the beginning of the end.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "for little kids who waste their fucking money on these stupid fucking guns I hate this fucking game its so fucking dogshit please delete this and ban this",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is the worst game i've ever seen or played, the only fun thing to do here is to be nostalgic about the past and trolling little kids, 90% of the comments under updates are saying that this game sucks and I agree, I keep seeing people with guns that kill instantly, I would not recommend playing this, unless you enjoy trolling OFC (this game is full of kids)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Every game has a certain aspect you remember it by, but all I get reminded in this game is getting one-shot by fancily skinned characters with OP weapon, the game is not unplayable if you can will through 7-10 deaths against enemies that have one shot kill or high DPS weapons. In team mode, more often there are players that will wipe your team single-handedly 2-3 times and you can only win if your entire team of peasants(including me/you) gang up on them and since its a team mode, the opposite team players wont sit by and watch, so you only get a big D in such match, D as in Defeat...\n \nLast but not least I have found myself pumping several magazines of bullet in opponents trying to laboriously whittle their health and them missing most shots and then one hit ends it all...\nWell, On a side note, You can indeed enjoy the game but, only after reaching higher levels and upgrading only some selected weapons as gold coins for upgrading weapons are high in requirement but are rewarded very pitifully when you win a match, so earning enough amount for upgrading can only be earned after hours of deaths, 100s of wins and game plays. \n\nConclusion, If you don't engage in micro transactions, Then this game will provide you with a cocktail of concentrated frustration and occasional entertainment. If you want to enjoy the game, then don't get curious about all weapons, select a few, stick to them, upgrade them as much as you can, have a very high skill level to hit your enemies with most shots and pray that your enemy doesn't hit you enough with his shots and be ready for eternal grind lol.\n\nFor me, This game is less of an enjoyment, rather is just a game where I am trying to 100% all achievements, after that I will uninstall and never visit again. \nWell sorry for the long context!\nand Happy Gaming!\n\n---------------------------------------------------------------------------------------------------\n\nFINAL EDIT - Played 50 Hrs as you can see, completed all except one achievement of reaching level 65, cant stick around that long for this game, feelings are mixed cuz if the game wasn't p2w, this would have been one of the great games as everything is fast paced... \n\nYou can enjoy the game if you get matched with players with your level weapon, if you get matched against event weapon holder then a good analogy that I can think of will be free2play players(normal foot soldier with basic combat gear) firing armor piercing bullets on a p2w player(Apache Helicopter), you can take down the Apache, you just need to respawn 5-6 times XD\n\nOverall, This game is a mixed bag with various pros and cons as the positive/negative reviews on steam already showcase, at the end, It will be on you, \"The Player\" to find out whether this game is more enjoyable for you or more frustrating...\n\nHappy Gaming fellas!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pixelgun after 2022 got so p2w that is just sucks, it was the best game but it became very p2w and the new things are just not good at all, i wish they kept it simple. and bring back judge",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "From a videogame perspective: No. dont play this game, its nothing but a cash grab and half the players are bots.\r\nFrom a nostalgic perspective: sure its fun",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i cant exploit in this game anymore to give myself the guns locked behind a paywall 0/10 also the game is hella money hungry but the guns are fun and the community is cool if this was 2018 i would reccomend but its not",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not recommended for the cassual gamers, theres someone with pay to win weapons and it has no good matchmaking because of that, just jumpers and high dmg weapons everywhere. \n\nThey should make a ground base game option inside the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck no\r\nthis game is buns but I need all the achievements so I will still play :sob:",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wow that is by far the worst monetized shit i have ever seen \nfalloff for the history books\nthis game sucks my balls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't bother after two matches it won't connect you to a server and it isn't just me it's happened to",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay of this game is decent but there are so many microtransactions that it becomes very overwhelming. If hate constant microtransactions then this game is not for you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game used to be peak, but unfortunately they prey upon younglings making them believe they too get to experience what once was peak youthful joy and whimsy. You only battle bots, and they expect you to spend shmoney on all the in app transactions for no necessary reason. Since you literally do not battle other players.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Another example of the great game killed by developer greed...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck this game it is terribe and shitty find something better this is just ai with players who exploit and the game does nothing dont buy this garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NEW GAME doesn't load. I played some game as a refresher on a fresh account since you need to have the app on you phone in order to transfer the account, after trying to link my account on the mobile version for a good while I decided to delete the fresh account I made in order to log in using my main account to see if it helps, after that the game keeps on telling me to type NEW GAME but when I do all you get is the screen that says restarting account. I tried letting it load on the background while I do some other things and it's still on the same screen after everything. I let it run on the background for at least 6 hours. DO NOT make an account if you don't have the game on you phone, i tried uninstalling it, removing it from my account but it's still the same thing. I tried to give this game a shot for some nostalgia but this process just sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game geinunely sucks, not only it is extremely bloated with pay to win stuff, the weapon system just sucks, the fact that theres a strategy that can ONE SHOT you if in the hands of a decent player (3catspam) and they DEADASS made a weapon set about this already say about how annoying and cheesy weapons you gonna have to deal with in the average match, if you want to play a fps game thats fun, play counter strike, pixel strike 3d or team fortress 2. 3/10, even back in the day, the game wasnt that fun, it was decent, definietly better than today pg3d. i dont recommend playing this garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please please please stop upping the resolution. You're really testing the definition of \"Voxel\" (which doesn't even look good in the first place anyway.) You guys have always been pay to win but make levels not outpace weapon levels or remove said weapons getting weaker every level.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "we all know this game suck balls, so i'm just gonna comment on how good i am at making pirate voice (currently sick)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thankfully, I didn't have to pay to leave this review.\nThis game is microtransaction hell, and any past memories from my childhood with this game have been ruined.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a good game but don,t pay money on this game a lot of weridos and pedos in this game its the sandbox mode werid asf",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is pay to win but that wont matter because this game is full of ipad kids who cant even aim",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've never seen a game this catered towards children that is so lacking in moderation. It feels like even Roblox doesn't feel as jam-packed with racist usernames and icons as this game. Even though I play this every-so-often, I've become used to seeing Hitler skins and swastika clan tags, alongside cheaters with speed hacks and chat spam that rivals a Valorant lobby. The lack of moderation is grossly negligent from a game who's player-base is primarily under-aged.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played back in the good days of PG3D. back in 2014. I'm maxed out, have good guns. But this game died many years ago now. It's completely P2W. Might be free, but even when you're in the beginner phase, all the bots have maxed out guns for their level. It's not fun and cubic doesn't care about making it better. RIP to a mobile legend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a really good game but the ;pay to win in this game is ridiculous it could be one of the biggest games if they removed all the pay to win stuff in the game and instead made people pay money for cosmetics e.g gun skins and kill effects otherwise my overall opinion on the game is that its a money hungry greedy piece of shit game thier's no way you play this game and have fun without spending real money. I really hope they do something about this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no dont ever play this game until its not p2w, its a good game but the prices ruin it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to be an amazing game.\r\nDevelopers started milking it and turned the game into p2w\r\nThey let pc players play together with mobile players.\r\nGame dead\r\nBot lobbies.\r\nOG Pixel Gun was amazing, fun while it lasted.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "just came back to the game almost everthing gone 2024 crimiss armor GONE just like that nothing left for me to come back to i dont recomend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is too easy with no real players. Everyone is a bot. Only fun part of the game is the lottery and thats just cause im a gambling addict",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The only thing that remains of this game is fond early childhood memories. This game is a fosil of its former self.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "micro-transactional fuckfest. bought gun = one tap gun. skill = not needed for this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game players used to praise no longer exists\r\n\r\nBack then it was also p2w, but it was to a certain degree. Today if you try to play for the first time youll get slapped with it. Battle passes, microtransactions, exciting features locked behind a paywall. Its frustating. EVEN when youre the \"rich\" player, the game is about who oneshots who first. Skill is not taken into question. More like reaction time.  I wish i could play this game normally but i just feel bad for every player i kill. I just dont feel i deserved that kill.  Better matchmaking could fix this but its like beating a dead horse at this point. \r\n\r\nOverall dont play this game. You will not enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game was good, until it wasn't. Pay to win patterns, such as \"battle\" passes that last for like a week, and the game being more competitive than it needs to be.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Went back for nostaliga was reminded why I left, p2w as always but it seems cheating is also a rampant issue. Dont even bother, also game is full of bots youll see like 3 real players in a whole match",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks full of p2w and cant even play the game since im stuck at 90%. stupid ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is verybad but better than fortnite so eh, i cant stop playing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "pay to win game . in short spech , its trash and suck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Completely unplayable on macOS,  locked at 60fps (even though most of the new macs have 120hz display and are capable of getting more FPS), input delay and severely worse visuals than the windows version, wouldnt recommend. Hope this changes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not as p2w as 2019 but mobile players fight against pc player and its usually botted servers anyway",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've played PG:3D since I played on my iPhone 4 back in 2013, and over the years, it's gotten stale with the constant popups, pay-to-win weapons, battle passes, weapon parts, and the lack of weapon balance within matchmaking. As someone who's played since I was 12, I'm seeing it become a corporate cash cow filled with aggressive advertising and microtransactions, which leave a bad taste in the community and for me, and it will never be the same since 2017. It's depressing that the solo dev was acquired under different aliases before becoming Cubic Games Studios. And now you're making a sequel after what you have done with the current state of the game? It's insulting..\n\nShame on you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is realy trash dont dawnload it or spend money ur just wasting money ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]Long since there is a lot of issues that just do before you release the sequel.[/b]\n[h1]Not bad. This still need improvements.[/h1]\n[h2] 🤗 The Good?[/h2]\n[list]\n[*] [b]It was so easy to even Headshot enemies on sight, comparably to emulators.[/b] Using a keyboard and mouse, decently for a few bucks, the only thing that blocks your super soldier status is input connection issues, such as loose cables.\n[*] [b]Bots make the match boring, but in return, they gives me a way to chill out.[/b] This is comparable to Duels, where finding a player would be a impossible mission. Deathmatch and TDM are for causals.\n[*] [b]You always have a fair range.[/b] You can rank top easily in Knife Party where controllers are ABSOLUTELY recommended, or try your aiming skills in other maps. The Lobby is also customizable, but you will need to go to Profile > Lobby Customization - any changes to the lobby will disable the Season Lobby.\n[/list]\n[h2] ❗ The Bad?[/h2]\n[list]\n[*] [b]Weapons must be leveled up for a price when the user levels up.[/b] This is a P2W technique found in many other games at the same airspace when PG3D releases. This repeated on Steam - that's no good. Pixel Gun 3D is 12 years old - they should've copied the tactic found on other indie devs on Google Play Store or iOS App Store when they did make a stunk on it. That triggered red lines: Steam top-ups. [i]One Steam Account purchase must be global to any account tied to the PC Edition copy on the Steam Account library, which is unlikely for such a game like PG3D. But atlas, they are NOT complicit on the problem of Lucky Patcher issue which defunded the whole game - glad they endured this.[/i]\nPay2win games are tended to be absolutely costly for existing Steam users and they will not like these. CG need to implement either an alternative, or else they would get the game taken down a whole.\n[*][b]UI design and the virtual cursor, as well as the HUD.[/b] The HUD isn't customizable on PC. The mobile-oriented design is carried over to Steam, making it a mismatch. You will need to click multiple time to get onto something you want to. Moreover, the HUD design is also complicit. Enemies who have double-spacebarring to the skies cannot be spotted because the HUD obstructed the line of sight already. That's it. For Ranked and Clan Wars, you had to tinker up DPI for a bit before you play. You need to fix the UI and the HUD with a total overhaul.\n[*][b]Problems with 4x scopes on a primary weapon.[/b] You're most likely to miss full auto, non-Sniper-class shots in Battle Royale and Sandbox the most time scoped rather than from the hip, because you only fire from the hip [~1.5x - 2x] rather than the 4x scope. [i]This is intentionally a widespread problem across all platforms, which explains how scoped Primary Weapons is totally broken, both FPP scope view in classic modes and TPP in modern Battle Royale and Sandbox gamemodes, encouraging Sniper-class weapon use.[/i]\n[/list]\n[h2]The only conclusion, is that Cubic Games forgot to even overhaul PC edition again before they broke another Pixel Gun 3D sequel twice. This just voided my Awards vote already - not deserved, but you can come back and improve the game for fairness. A bit more improvements and that would be goofy.[/h2] \nTest again with a real matchmake, Cubic Games. 🤙🤙🤙 You had enough funds to do that bold move.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "p2w bullshit i used to love this game as a kid i remember this being one of the first games i used to play as a kid and you went and fucked it like this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game suck. p2w. hackers. terrible balance\nDon't play it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is ass you better off playing minecraft with mods",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game was part of my childhood this game had one of the biggest downfalls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i used to played this on my phone more than 8 years ago when this game was good now it is just slop now and dead game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its bulshit and i have no fun by playing it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is actually the most pay-to-win game I've ever had the displeasure of playing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really hate the fact I'm always being put in the same matches every god damn time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pay2Win Trash\n\nThere are MANY instakill weapons, if you pay you can \"enjoy\" feeling like a hacker, but if you don't pay... enjoy getting demolished by a player with 6 different weapons that will insta kill you, or just don't let you play the game! There are weapons that just attack you through walls, impede movement, and... you cannot miss! That's just dumb...\n\nThe game HAD potential, but greed got in the way... I got a couple of games where you lose or win because of your skill only... but... if you fight a fat whale, you will get crushed.\n\nGetting the strong guns is in fact possible... but will you enjoy the LONG process? No.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "From playing on mums phone many years ago to typing this sad review about a game i played non stop. Everything in the reviews have been said no point ranting about it. \nPay to win, full of micro transactions and hundreds of useless guns. \nEven the old guns are useless, the ones that are the STAPLE of this game. \n- Buff your old guns \n- remove those garbage animations to them too \nand remove 80% of the weapons \nthat wont even save this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its just not the same anymore also its hella money hungry",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "changing my review to negitive because of all the ai being used in the new ads",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "for some reason, it keeps crashing for no reason, please help!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks. I am a grown adult. And yet...I cant stop.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bring back the maps D-Day and Airship",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is so pay to win play something else please",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another title that feels like a mobile heavy p2w game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not the same as before",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Almost lost my mind while playing these achievements.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "turned into a cashgrab 4 years ago... 😭",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is bad fuck you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash, P2W. give us back THE OG",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played it... just so you don't have to\nwhat a waste of time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game fucking garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game had so much potential",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THEY WONT LET ME MAKE A NEW ACCOUNT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck this dogshit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game used to be nice",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "p2w junk, fuck dis",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pay To Play enough said \"mic drop\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not Minecraft.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No good gam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They massacared my boy..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "why would you torture yourself with this\n2b's here though i guess that's cool",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "look how they massacred my boy",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Am too broke to become good",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "p2w, \"OG season\" has a p2w skin that is almost invisible",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no skibidi toilet me nevr play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fell off",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shi bombarded with paid shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its shit now",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very p2w heavy but not bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "rilisoft why did you sell your game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game was peak, back in my day",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its much p2w :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cash grab, p2w",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "почините подбор в кб",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pixel bot part 2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pay to win",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "p2w slop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bum",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hell",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}