{
  "positive": [
    {
      "review": "I’ve played Rust for over a thousand hours, but if you’re thinking of joining… don’t. I’m writing this as a warning, not advice. Because Rust isn’t a game. It’s a place. And once you set foot on that island, a part of you stays there forever—usually the part that sleeps peacefully.\r\n\r\nMy first night in Rust, I built a tiny shack. Four walls, a door, a campfire. I felt safe. I shouldn’t have. Because in Rust, safety is just silence before the storm.\r\n\r\nIt started with footsteps. Soft, circling. Then a whisper in voice chat:\r\n“Nice base you’ve got.”\r\n\r\nI didn’t sleep much after that.\r\n\r\nYou learn quickly that everyone on the island is either a hunter or prey, and you don’t get to choose which one you are. You’ll wake up to your base gone, your loot scattered, and a sign left behind saying something like “Thanks :)”—because Rust players like to smile while they take everything from you.\r\n\r\nYou’ll respawn naked. Again. And again. And again.\r\n\r\nAnd then you’ll start to change.\r\n\r\nYou’ll begin to hear phantom footsteps even when you aren’t playing. You’ll flinch at the sound of a helicopter. You’ll see piles of rocks on the side of the road and feel an urge—an instinct—to hit them with something. Anything. You’ll start checking bushes for movement. You’ll judge every structure you pass in real life by whether it can withstand 12 rockets.\r\n\r\nRust does that to you.\r\n\r\nAnd when you log in at 3AM just to “check on your base,” you’ll realize the truth:\r\nYou’re not playing Rust anymore. Rust is playing you.\r\n\r\nSo if you’re thinking of starting… don’t.\r\nBecause once you load in, once you swing that first rock, once you hear the first distant gunshot echo through the trees—\r\n\r\nthere’s no coming back.",
      "voted_up": true,
      "votes_helpful": 395
    },
    {
      "review": "honestly shit game, im addicted to it and i hate it but i cant stop playing it.",
      "voted_up": true,
      "votes_helpful": 33
    },
    {
      "review": "Of all the animals, man is the only one that is cruel. He is the only one that inflicts pain for the pure pleasure of doing it,\" - Mark Twain.",
      "voted_up": true,
      "votes_helpful": 70
    },
    {
      "review": "Such a good game, I would never recommend it but its so good.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "This game has its ups and downs. Spawn on beach naked get loot, die, do it all over. Hours make the difference.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Rust isn’t a game.\nRust is a lifestyle disease you willingly install.\n\nThe moment you spawn naked on the beach with nothing but a rock and crippling hope, the game whispers, “Say goodbye to your social life.” And you listen. Because you’re weak.\n\nRust consumes you slowly.\nFirst, you think, “I’ll just farm a little wood.”\nTen hours later, you’re still hitting trees like a deranged lumberjack, staring at your screen with the same thousand-yard stare as someone who has seen too much.\n\nYou build a base. You love your base.\nYou name it. You tuck it in at night.\nThen a group of 15 sweatlords shows up with rockets and deletes not just the base, but your will to live.\n\nYou log off to take a break.\nYou log back in to find your base gone, your loot stolen, and your soul spiritually repossessed by Chad, King of Oil Rig.\n\nTo get good at Rust, you must:\n\nIgnore sleep\n\nForget weekends exist\n\nSacrifice friends, hobbies, and possibly grades\n\nTrain your aim until your wrist cries for mercy\n\nLearn to accept betrayal as a natural weather phenomenon\n\nRust isn’t hard — it’s emotionally expensive.\n\nEvery wipe feels like a fresh start and also a fresh mistake.\nEvery raid feels like a victory and also a sign that you’ve gone too far to ever be normal again.\n\nRust doesn’t just suck your soul. It puts it in a small box, labels it “loot,” and lets someone else take it while laughing in global chat.\n\n10/10.\nWould respawn naked on the beach again.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Every victory feels legendary, winning a 1v3 with 12 HP, finding a decayed base loaded with loot, or successfully cooking food without burning it like a caveman disaster. Every loss feels personal and emotionally damaging in ways that should probably be studied by scientists.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game is so peak so many chances for hardcore players to have in game survival along with some of the best PvP I have ever experienced.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Fun game with frequent wipes which helps keeps things fresh",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I've played this game on and off for many years and overall, I love it. I do have some positive and not as positive things to say about the current state of the game though\n\nPositives: I love the game style, offering PvP and PvE content on different servers. This versatility is probably one of my most favorite thing about this game however the graphics have improved greatly over the years. Most holiday events are self explanatory to complete and the rewards are fairly good. The purchasable skins are also something I enjoy adding, and the cost of the items are reasonable, including purchases on the marketplace. Creatures in the game are challenging at the beginning of the wipe but once geared, are quite easy to defeat. Monuments are fun to explore and offer many hiding spots while participating in PvP. Over the years, they have added quite a bit of content and though I took breaks throughout the years, I would give Rust an overall positive rating. The environment is beautiful and the things they've done to improve the look has been phenomenal. On smaller servers, I've had the opportunity to create lifelong friends in other parts of the world, so I'd have to say this is probably my top favorite thing about this game.\n\nNegatives: I believe too much has been added to the game and somewhat takes away from the original vanilla Rust from the mid 2010s. Some items have been nerfed quite a bit so it makes game play quite different while also giving larger groups advantages that smaller groups or solo players may not have. For new players, this makes the game undesirable. Friends I've invited to play Rust with me have stopped playing for this reason. Why play a game that's impossible to learn while getting defeated within minutes at respawn? Playing on a PvE server can be fun, but doesn't quite offer the challenges that a PvP server has. The addition of blueprints has been something that I believe would have been good in theory, but in practice offers larger groups to benefit from right out the gate. I understand the point of teaming up in a PvP environment, but there is no benefit to playing on a large server as a solo or even a small team for the first time. An issue I've experienced is sometimes while dismounting a horse, you'll get stuck or kicked for anticlip if the horse is beside another one at the trough. This is one of a few issues I've seen which I expected would've been fixed by now, but it still seems to be an issue. \n\nIf you can ignore the negatives I've stated above, I still recommend this game. I play as often as possible and I've been playing again now for about a year. I've been officially playing Rust since about 2015 and it is still my favorite game despite the things I've listed as negatives. Happy hunting!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "the equivalent of being shot by a firing squad. 11/10, this game is among the best",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think its a good game and very fun but I don't have any friends who play, it's really hard and it seems like it takes a long time to make progress.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is for people who have a lot of time \nIf you are a casual player then it is not for you as your base will either decay or get raided\nThe only chance for you to play as a casual solo is to join PVE only servers\nThis game favours larger groups over solos",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Regarding this game, you should know that the first and most important thing is that you are playing with other people whom you do not know much about, so while you should consider their mental and physical conditions and even the quality of their system, you should also pay attention to the issue of trusting an unknown person in exchange for your own efforts. Here, betrayal means losing all your efforts.\nI suggest that you choose reliable teammates in every way, quality and harmony will increase over time, but trust once lost will never be regained, and this will make you distrust even good and new people. The second point is that this game requires a lot of time during the day to progress, so be careful not to let it hold you back from work and real life.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After more than 3,400 hours in Rust, I can honestly say:\nI love this game. It’s brutal, unforgiving, and sometimes completely insane but that’s exactly what makes it special. Every wipe creates new stories you write yourself, new encounters, new chaos, and new memories.\n\nThe freedom Rust gives you is incredible. Every decision matters, every moment can turn into something unforgettable. I’ve met so many people in this game, made friends, lost bases, won impossible fights and it never gets old.\n\nOn top of that, the developers have been pouring passion into Rust for years. The constant updates, improvements, and attention to detail show how much love goes into this world.\n\nFor me, Rust is simply one of the best games ever made.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I HATE THIS GAME I HATE THIS GAME I HATE THIS GAME I HATE THIS GAME I HATE THIS GAME... almost 1000 hours later.... I HATE THIS GAME I HATE THIS GAME",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Build a 2x2 in the middle of no where, Eight man pull's up and blows open the base. Start again... Great game will play again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very cool game, but lacks beginner friendly features.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "high skill ceiling, pve and pvp which i love \nlk reminds me of minecraft but realistic\nlove the modded servers\nhonestly a lot of stuff to do in game a lot of stuff to master\nyou can be as creative as you want with your base designs and traps\nalso idk why but i get clash of clans vibes but on pc and 1st person maybe its the clans or the base raiding or the satisfaction you get from getting loot\n[tips for anyone wanting to buy the game] if you buy this game i recommend starting off in a low-pop server closest to your region then build your rust knowledge off of pure gameplay just so you dont get annoyed by the other players\nbest played in a group or solo if your a hardcore player",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the worst game you can ever buy, dude in was just chilling and then a nuke dropped on my head\n\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My most reluctant recommendation ever (perhaps only after Ark). But I mean, with almost 3k hours there's got to be something to like there, right? ....Right?!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Rust is the purest form of digital survival ever created. It drops you into the world naked, cold, confused, and holding a rock, which coincidentally is the same way most people start their freshman year of college.\r\n\r\nFrom that moment on, the game drains your life energy in every direction. Hunger, thirst, radiation, temperature, other players, wolves, bears, and that one guy named “xXxToiletSniperxXx” who kills you the moment you craft your first pair of pants. Rust doesn’t just want you to survive. Rust wants you to suffer and maybe survive if it’s feeling generous.\r\n\r\nThe building system is great until someone raids you at 3 AM with enough explosives to qualify as a small military. Lose your base. Lose your loot. Lose your will to live. It is the full Rust experience.\r\n\r\nRust is brutal, hilarious, and best enjoyed with friends you can blame for everything. If you ever want to know what true survival feels like, Rust will teach you. It will also steal your lunch money while doing it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice game, you can find anything you’re interested in, from PvP to farming and building a cozy base.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you love playing games with friends this a good game. if you like to wake up pissed off sometimes this is the game for you. if your a grinder this is the game for you, i come from dayz and love this game as much as dayz. that says alot cause i love dayz so much.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its not that good 1.2/10\r\n \r\nanyway,\r\n\r\nabsolute peak player interactions and amazing pvp, exactly what I expected from valve, def recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you are a lifeless person, this is the game for you (I bought the game in early access, and when I see this state of the game, I only have to congratulate the production team)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’ve played Rust for over a thousand hours, but if you’re thinking of joining… don’t. I’m writing this as a warning, not advice. Because Rust isn’t a game. It’s a place. And once you set foot on that island, a part of you stays there forever—usually the part that sleeps peacefully.\n\nMy first night in Rust, I built a tiny shack. Four walls, a door, a campfire. I felt safe. I shouldn’t have. Because in Rust, safety is just silence before the storm.\n\nIt started with footsteps. Soft, circling. Then a whisper in voice chat:\n“Nice base you’ve got.”\n\nI didn’t sleep much after that.\n\nYou learn quickly that everyone on the island is either a hunter or prey, and you don’t get to choose which one you are. You’ll wake up to your base gone, your loot scattered, and a sign left behind saying something like “Thanks :)”—because Rust players like to smile while they take everything from you.\n\nYou’ll respawn naked. Again. And again. And again.\n\nAnd then you’ll start to change.\n\nYou’ll begin to hear phantom footsteps even when you aren’t playing. You’ll flinch at the sound of a helicopter. You’ll see piles of rocks on the side of the road and feel an urge—an instinct—to hit them with something. Anything. You’ll start checking bushes for movement. You’ll judge every structure you pass in real life by whether it can withstand 12 rockets.\n\nRust does that to you.\n\nAnd when you log in at 3AM just to “check on your base,” you’ll realize the truth:\nYou’re not playing Rust anymore. Rust is playing you.\n\nSo if you’re thinking of starting… don’t.\nBecause once you load in, once you swing that first rock, once you hear the first distant gunshot echo through the trees—\n\nthere’s no coming back.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it says i have 66 hours on record but i have 3000 actually. if you enjoy hard survival games and actually manage to build a base be ready for it to be destroyed in the next few hours after you hop off. also if you like getting jumped by 3 people with bows and spears this is the game for you",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun to play game with friends, and even as a solo, learning the game was fun, requires alot of skill and but is good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Rust is an amazing game, the developers are doing a great job of shuffling the meta, and changing progression to stop the game from being stale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It s like \"Minecraft\" but very realistic and whit guns so its very fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Playing Rust feels like signing up for a vacation in a war-torn sandbox where the only amenities are fear and emotional damage. Every login is a fresh opportunity to be touched un-consensually by the players of Rust, as if the entire server collectively agreed I’m the designated victim. I can’t even enjoy thirty seconds of peace before being heartlessly Double-Barreled while farming materials as I spawn in, still blinking sand out of my eyes as I spawn on the beach, naked and alone, pretending hope exists. And yet, despite the trauma, the betrayal, and the lingering scent of burning hemp fibers, I proudly give Rust a 10 star rating, because apparently I love the game I hate more than my enemies love offline raiding me.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Just for reference I've played this game a lot more on other platforms. I'm so impressed at how Rust is not only surviving, but thriving on it's way into the future! Even all these years later...\n\nAfter the downfall of Ark Survival: Evolved I needed somewhere to get my PVP survival crafting fix and the Rust community was waiting for me with open arms, a dumb toothy grin, and a knife behind their back. 10/10 would do it all over again!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "dont go for loot, theres only a little fun in that. instead make everyone else's experience of the game abysmal, only then will you reach peak rust",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "unemployment simulator set in a post-civilisation society setting",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "controversial recent changes aside that i hate the game is good and funny. new player experience sucks ass, as it should.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Get loot, lose loot, build base, lose base. Repeat.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "got raided on christmas people that play this game have nothing going on in their lives",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Actually a Good Game, The New updates is nerfing the solos. Other than that i cant complain. Oh and i do hate the game sometimes but i keep coming back. I Recommend the game to anyone.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Rast is a very interesting game, you can raid bases, shoot each other, raid clans, I advise everyone to play it...",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Rust is an awesome survival game — fun with friends, great for meeting new people on PvE servers, and full of chaos in PvP. You can build, explore, and survive together… or raid others and destroy their bases for loot. Every session feels different and exciting!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game if you hate having freetime and good relationships with people!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak gameplay, proxy chat is funny as fuck, raiding little kids bases after they shit talk, doubling a 30 year old man who just got home from his 9-5 job, Teabagging a redneck old dipshit who beats his wife and kids, and countering little shits who think theyre good. 10/10 would NOT recommend downloading the game if youre a bitch who reports people for cussing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once you play this game and experience the feeling of defending an online or 1v5ing a clan for aks, you will never feel that amount of dopamine in any other game. Rust will ruin your life if you arnt careful but it will all be worth it. Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive been here since the beginning in legacy and this game has been a cornerstone in my gaming adventures. I've grown 10years with this game and it still brings me back time and time again. The creators and devs really do care about creating a game that evolves with the times. \n\nI dont think there ever will be Rust 2 this game will always just get better and better every patch and addition to.the game and thats one thing I really appreciate compared to other creators that pay wall you into buying a bunch of remakes of the same game with slight upgrades and new skins. \n\nOverall if you haven't purchased this game yet but have watched or seen vidoes and it looks fun what are you waiting for? You wont regret your purchase and you wont meet another online community like this...... for the better or worse 🤣",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for a game that will change your life outside of the video game this is it it will make you hate life angry all the time and I couldve sworn i heard a code lock at the gas station the other day but its my favorite game idk what i would do without it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve played Rust for over 20 hours, but if you’re thinking of joining… don’t. I’m writing this as a warning, not advice. Because Rust isn’t a game. It’s a place. And once you set foot on that island, a part of you stays there forever—usually the part that sleeps peacefully.\r\n\r\nMy first night in Rust, I built a tiny shack. Four walls, a door, a campfire. I felt safe. I shouldn’t have. Because in Rust, safety is just silence before the storm.\r\n\r\nIt started with footsteps. Soft, circling. Then a whisper in voice chat:\r\n“Nice base you’ve got.”\r\n\r\nI didn’t sleep much after that.\r\n\r\nYou learn quickly that everyone on the island is either a hunter or prey, and you don’t get to choose which one you are. You’ll wake up to your base gone, your loot scattered, and a sign left behind saying something like “Thanks :)”—because Rust players like to smile while they take everything from you.\r\n\r\nYou’ll respawn naked. Again. And again. And again.\r\n\r\nAnd then you’ll start to change.\r\n\r\nYou’ll begin to hear phantom footsteps even when you aren’t playing. You’ll flinch at the sound of a helicopter. You’ll see piles of rocks on the side of the road and feel an urge—an instinct—to hit them with something. Anything. You’ll start checking bushes for movement. You’ll judge every structure you pass in real life by whether it can withstand 12 rockets.\r\n\r\nRust does that to you.\r\n\r\nAnd when you log in at 3AM just to “check on your base,” you’ll realize the truth:\r\nYou’re not playing Rust anymore. Rust is playing you.\r\n\r\nSo if you’re thinking of starting… don’t.\r\nBecause once you load in, once you swing that first rock, once you hear the first distant gunshot echo through the trees—\r\n\r\nthere’s no coming back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and chill game full of friendly people giving you good advice, like for example how to uninstall the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best survival game oat and super addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the game wish it was so toxic but still fun still learning how to play. I hate the new way about getting workbenches made though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so good game. so much fun to play as a solo. such big brain admins and players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but a lot of cheaters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the sole purpose of why I need to wear long sleeve shirts in public spaces do I don't get looks. Pure brilliance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "очень хорошая игра, спавнишься на море голым дерёшся с бомжами умираешь с 500 скрапа от челика с калашом на 1 часе вайпа и рейдят в оффлайне, отличная игра советую",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the game but i got vac banned for doing a glich by spamming a button that resets you graphics or somthing and it makes you fly if you jump and do it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very clear about what it is. Trust nobody, kill for the best loot. Monuments are fun, combat is fun. Makes my PC run like a snail. 11/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The greatest PVP survival game on the market right now.\r\n\r\nThe learning curve is steep, but trust me, it’s absolutely worth it! The early game can feel punishing, and I think that’s where a lot of players drop off before giving it a fair shot. Stick with it, though, and like most things, persistence pays off and you’ll end up hooked.\r\n\r\nFrom a developer standpoint, the support is fantastic. Updates aren’t just tiny bug fixes or overhyped tweaks, they’re meaningful improvements that actually matter. We’re talking quality-of-life changes, fresh content, and regular meta shake-ups to keep things exciting. New biomes, vehicles, weapons — all designed to prevent the game from ever feeling stale.\r\n\r\nThe community is, for the most part, great. Sure, the “survival of the fittest” and “every man for himself” mentality shines through at times, but honestly, that only adds to the immersion. It feels like a true survival experience where PVE and PVP blend seamlessly.\r\n\r\nBase building? Phenomenal. Whether you’re crafting a sprawling fortress or a humble 2x2 shack, the options are nearly endless. Add in the community-driven side of server ownership and customization, and you’ve got a game that feels limitless in how you can play.\r\n\r\nIf survival/PVP/base building and crafting is your genre, this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Besides the hours on top of hours just to be graped by some zerg and get offlined, this game is great for other players! If you like being touched on your butt by a zerg, I double suggest this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like this game and all but ppl grief and get annoying like sometimes i try be peaceful they not peacefuln and i wanna join clans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Очень хорошая игра, стоит своих денег, рекомендую.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you cant ever escape this game once you play it its like a curse no matter how much you say your done playing your never really done it will always come back...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game makes me wanna end my life, when i was just starting out the game i had a german guy run up to me on the beach and screamed the n word multiple times until i had to mute game chat,after that meet up happened i stopped playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game. Every fresh wipe is a great opportunity to meet new friendly faces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of updates, never know what can come next, amazing eras of gaming and some of my best gaming buddies I found in this game (and enemies as well XD)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Brutal and unforgiving open world survival game.  Skill and Decent Pc Specs Not included",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game offers endless fun, from building and fighting to farming and even caring for animals, with all the details connecting these elements. Furthermore, in-game purchases are limited to skins only; there are no items that, when purchased, give a player an advantage in winning or progressing through the game. It's worth noting that these packages are quite expensive and can even cost as much as the game itself (lol). Finally, the game studio's support for multiple languages is noteworthy.\n\nThe only downside to the game is the general perception of its players, which is, of course, true: all players are untrustworthy, and treachery is common in the game (lol).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Apart from the unavoidable offline raids this game is a blast especially with friends. New updates every month keeps things fresh and I am a sucker for building and decorating lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "woke up, beat a homeless woman with a rock and got shot\nthen I hopped on the game it was pretty cool I guess",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rust is pretty good just some offlines and people who beg for scrap in the outpost here and there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the ever changing nature of this game and how you can do something different every wipe.  Different Biome, monument, building, farming, electric, sorting, raiding...it's really endless!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is incredible, sadly it requires time..., Rust is one of the games i will keep playing for a long time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got called the n word and raided and lost everything to some Chinese guys this game is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game takes your life. So buy it and enjoy (the depression, halluzinations and addiction). Its really fun (sometimes). 2k hours btw and still playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "классная игра, мне нравится в нее играть, а еще бегать голым и наслаждаться пейзажами этой помойки, я люблю друзей и бравл старс, учусь хорошо",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ts is fun af ngli used to play console like 2 days ago then got a pc and..... i have 36 hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Welcome to Wust.\n\nThis isn’t just a game. It’s a chaotic ritual. A place where logic dies the moment someone shows up with a box of Twinkies, a warm bottle of Mountain Dew and a questionable squeeze of mustard. Mix those three together and Wust stops being entertainment. It becomes something else. Something louder. Something dumber. Something legendary.\n\nEvery match feels like it crawled out of a fever dream someone had at 3am after eating too much sugar. Physics doesn’t behave. Players make choices scientists would refuse to study. And somehow, all of it comes together into an experience that crushes every piece of fiction, media or game mankind has ever put out.\n\nIf you’re here, buckle up. Wust isn’t played. Wust is survived.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty goated game genuinly all the hate is from people whove never played so anyone reading this should give it a try and then ill respect your opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's really fun especially with friends. One of the best games I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game ruined my life i was a straight a student until i discovered spoonkid and zany on youtube which made me pick up the game after that everything was downhill, i stopped eating, i lost my friends, i lost my girlfriend, my parents hated me, but to me it was all worth it because i got revenge on my neighbors that door camped me for hours. Would 100% reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, active developers, the sheer amount of options of gameplay styles is amazing for the rust community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of a kind game, nevermind the blatant cheaters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just picked up RUST this year.  Alot of content and newer content updates, been having some good fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't buy this game whatever you do stay away at all costs this game is going to ruin your life and end all happy things you have going for you please listen and head this warning",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Arguably the best survival game I have ever played. Nearly 1200 hours after my last wipe and I plan to keep it going.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is such a fun game that has so many ways to play it. The developers are constantly making improvements to the game so the fun never runs out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game. I've deleted this game from my library probably 20 times.\r\nI've reinstalled it 21 times. \r\n\r\nNever trust anyone and learn to fly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games all around I've played in my 30+ years of gaming. I learn something new everytime I hop on. worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to play solo or even better with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Hate and love this game, highest highs you will ever have in video games along with the lowest lows",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wish i still had the time to grind this game, Used to play with a huge crew way back, Miss em. Always had fun at the end of day considering losing and winning was a constant.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "rust a game where you can be completely naked one second and the next your raiding every base on the server and have a massive compound.\np.s. rust has the nicest and most friendly community than any other game super family friendly.\n10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun if your a fast player and addicted to risk and fast come ups.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game too complicated for me but i still try  my best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Game ever made. I highly recommend this game if you can set aside a a lot of time do nothing else but play Rust. Only Playable / Enjoyable if you have nothing else going for you in life except this game. Do not play if you are easily offended but anything at all. Love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very time intensive, but and the chances of losing are high and plenty, but the chances of having fun are endless. There are regular small and large updates, so its worth picking up the game again even after breaks. Diffent servers/mods make it so every gamer can find its fit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are in to craft survival games and you have not played rust, you are missing out. This game is constantly changing and it provides for every style of player. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rust – это многопользовательская игра-симулятор выживания, в которой игроки оказываются на острове, где им приходится сражаться с природой, другими игроками и строить свои базы.\n\nИгра известна своим безжалостным миром, где нужно собирать ресурсы, крафтить предметы, создавать жилища и защищаться от других игроков, которые могут как помочь, так и напасть.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good and fun game, sometimes makes me want to do bad thing to myself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good survival game, very toxic userbase. Otherwise good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Top 5 best games i‘ve ever played, but you will probably have to wake up at 3 am and defend a raid against cheaters for 2 hours just to lose the raid defence.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "With the latest update including having to acquire Blueprint fragments, it makes it nearly impossible to play as a solo player. Such a huge disappointment. It also encourages those in larger clans to build near high tier monuments just to pick off the poor solo or duo players just trying to get BP frags just to get a Tier 3 workbench. Such a bad update. Its not encouraging me whatsoever to run the monuments when there's only a 10 percent chance that I'll even get an advanced BP frag. Do better FacePunch and stop wasting our time.",
      "voted_up": false,
      "votes_helpful": 84
    },
    {
      "review": "my most played game but also one of my least favorites because it's like being in an infinite dopamine loop. I could've been a successful goose farmer by now but instead I have anhedonia and a less functional prefrontal cortex.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "No linux support. Read PC Gamer article about how they said games that support Linux are not \"serious about anti-cheat\", which is a joke, because Rust has some of the worst cheaters of any game. I am moving to Linux so I will not be buying or playing any of their games ever again. I was sick of Rust anyway but you deserve this bad review for being full of shit and for the guns in Rust still feeling like ASS after 10 years. Git gud. Linux is the FUTURE of gaming, Gabe wills it and Gabe has spoken. Fuck around and find out.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Unfair False Positive Ban – Completely Frustrating\n\nI’ve been a dedicated Rust player, but my experience has been ruined by a false positive temporary gameban. I have never used cheats, scripts, or any unauthorized software, yet I was banned from all servers. This wasn’t due to anything I did, but apparently due to “abnormal activity” or playing on a server with cheaters — something completely beyond my control.\n\nThe support team eventually responded, but these automatic bans are overly aggressive and extremely frustrating for legitimate players. Being locked out of a game I’ve invested in, through no fault of my own, is completely unacceptable.\n\nFacepunch needs to seriously improve their ban detection system and provide faster, more transparent resolution. As it stands, their system punishes innocent players while leaving cheaters often unaffected. This experience has made me reconsider continuing with Rust.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game makes me nut uncontrollably, its not healthy to nut 20 times per hour",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love this game, I got 6k plus hours. And because I love it I have to give it a bad review after the latest scrap updates. It is non sense, kills the game. No more survival aspect. Starting to look more like a battlefield than a survival type game. Solo experience has been degrading for as long as I can remember, and this last update killed it. It's impossible to play solo anymore! Big groups take a 3rd of the time they needed before to wipe out the entire server. Ill delete my bad review after this update rolls back or they do something about it. Really sad to see the direction Rust is taking right now.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Unfair for new players, very toxic, Either the servers are dead or you can't even get a start because someone killed you. I'll try one more server but game is trash can't even get a start down.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I like(d) this game. I'd even considered to buy it for my relatives.\nUp until the latest blueprint fragments update that is. Now, solo players or small groups rarely can get their hands on enough blueprint fragments to stand any chance against the bigger groups. Also, the radiation on monuments after getting the loot is crazy. So now i can't even recycle because someone got access cards? The only thing i do in this game is play some modded servers... Hope to edit this review to a positive one someday.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's a fun game don't get me wrong---Rust will become your life if you let it. Unfortunately, FacePunch's adamant disregard towards Linux users' ability to play the game, and their continued excuse of \"cheaters using Linux\" as a \"get out of jail free card\" to not simply turn on EAC support for Proton with one button (it is seriously that easy) shows their true colors. Instead of working to make their server-side anticheat better, they instead blame the userbase, make people buy $15 worth of skins, and more---all so cheating continues to increase. This is completely unacceptable and hurts consumer's right to privacy (Windows is basically spyware)\r\n\r\nI hope FP wakes up and gives Linux-users an actual chance to play the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Zero idea why this game is so popular.\n\nVanilla PVE is a ghost town and boring as hell, PvP is full of broken souls who love griefing, seems like this game hoovered all of the griefers up like Jupiter does comets.\n\nBut thats not surprising seeing that every single design decision has been done so that Alpha teams can alpha really hard.  Facepunch is run by school yard bullies who seem think building a game focused on bullying people so that they have very very little chance to fight back is a good thing.\n\nThe modded servers are terrible, the \"bosses\" in the mods are trash.\n\nForcing people to wipe is such a shithead move from the dev's, there is nothing that stands out in this game that would keep you coming back at all, unless you want to grief people, thats all this game really has.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fucking shit game with a toxic schoolchildren",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the first game I’ve ever reviewed.\nAnd instead of writing another “funny Rust moment,” I want to be honest — because if you’re thinking about buying Rust, you should know what it actually feels like.\n\nRust is not a survival game anymore. It’s a full-time job simulator.\nIf you don’t play constantly, you fall behind.\nYou become weaker, you become walking loot, and your base disappears the moment you decide to sleep like a normal person.\n\nAnd the biggest issue becomes obvious very quickly: Rust is built for groups.\nIf you enjoy playing solo, chilling, exploring, or playing a reasonable 3–4 hours a day (which is not a small amount), the game punishes you for it.\nEverything becomes unfair the moment you join the server.\nTeams dominate the wipe before you even place your second door.\n\nEvery update seems to make solo players weaker.\nAnd the newest one — blueprint fragment changes — affects small groups and solo players far more than teams. Bigger groups barely notice it, but for solos it slows progression even more.\n\nSo playing solo becomes something that barely counts as playing.\nAvoid every fight unless it’s another unlucky solo, set your base where nobody wants to live, hide from every sound, and deliver free loot to 5-man teams at monuments when you’re just trying to get a blueprint.\n\nI remember one wipe where I spent almost 4 hours stuck in primitive just because I joined the wipe 30 minutes late. Teams already had revolvers and other guns, and even with perfect aim there was no realistic way to win a fight. That’s the true solo Rust experience.\n\nAnd what’s the “solution” people offer?\nGo play low-pop or PVE servers. Which is basically the equivalent of going to an amusement park and, instead of riding the roller coaster, sitting on the tiny kids’ train and pretending you’re having the same experience.\nSo you’re telling me the only way I can enjoy Rust… is by not playing Rust?\n\nInstead of improving, you end up searching for bigger groups, staying awake until 5 AM to save a base that shouldn’t require night shifts to protect.\n\nthis game is more fun to watch than it is to play.\nStreamers make it look amazing because they have thousands of hours, stacked teammates, gifted skins, and unlimited time. With that combination, any game would look incredible.\n\nAnd optimization isn’t any better. Rust runs like a jet engine attached to a bicycle.\nUnity is old, and the game has been duct-taped together for ten years instead of being rebuilt properly, so even high-end PCs drop FPS for absolutely no reason.\nA stable 80+ FPS is a fantasy for most players.\n\nI genuinely loved this game.\nIt’s one of the reasons I even bought a PC.\nAnd Rust could have been one of the greatest survival games ever made.\nBut at some point, Rust completely shifted its identity into what it is now.\n\nEarly Rust was magical. Discovery mattered. Solo was possible. Time investment wasn’t insane.\nNow nothing feels in the right place — and I honestly regret that I never got to experience that era. I arrived too late.\n\nSo congratulations, Facepunch. You’re losing the chill players.\nWhat will you gain?\n\nAn insane amount of 50-IQ players and below,\nMassive clans,\nNo-life grinders,\nCheaters with endless alt accounts,\nBut it’s all good for you — more people to buy your P2W skins!\n\nMany players still grind Rust mindlessly, chasing tiny dopamine hits without realizing what they’re sacrificing.\nAt least I figured it out. I’m giving myself a long, long break.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Every update they put out makes it harder to play as a solo/duo. The latest changes to workbench crafting is yet another example.\n\nI do not recommend it in its current state.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely love the concept of this game, but recent updates by the developers don't make sense and are lackluster, I believe this game is being mismanaged.\n\n**jungle update**\n  - doesn't make sense gameplay-wise, tier 0 biome right next to spawn beach yet has wildly unfair animal AI compared to other biomes\n  - doesn't offer any monuments other than ziggarat, it looks cool, but offers almost nothing for the amount of risk you have to go through.\n**meta shift**\n  - slows down progression (people complained that it's too fast) by adding blueprint fragments to various puzzles\n  - kind of works on low pop, a lot of players from my server complain that it's not fun to obtain\n  - you will be prim-locked forever as a solo / small team on high pop.\n  - fragments serve no purpose afterwards if you already have the corresponding workbench\n  - imo they tackled the wrong thing, they should've done something about unlocks, not workbenches\n**pivot or die**\n  - made tech tree costs stupidly low (why? didn't you just slow down progression?)\n  - removed workbench taxes by default (this is something that i believe should've been experimented with, reward players for finding items in-world with noticeable cost reductions, rather than completely locking them out of workbenches and then suddenly making lucky players with workbenches be able to progress at mach 4)\n**naval update**\n  - not out, but so far from staging branch seems like it'll have the same issue like the jungle biome where there's not enough value for the amount of effort and risk you have to go through to reach and stay afloat in the deep sea\n\nit just seems like they're changing stuff just for the sake of change and that they've ran out of ideas. although i've never played during this era, i believe that rust's content updates had more vision under Garry's leadership. every update served a purpose whereas a lot of newer updates under Alistair's leadership don't add anything interesting or even actively harm the game. there's also been a lot more focus on monetization to the point where I feel like I'm playing a F2P game, P2W items exist, they allow you to do things normal players can't do, there is literally a hazmat that changes stats for money. servers owners also lose a lot of control over their own servers with new EULA changes, you cannot even the odds between players by giving P2W items in any way (loot tables, ability to craft, etc) as a server owner, you cannot restrict players with P2W items from using them for any reason at all either, it's not a good look and just sucks for people who dislike having to spend money on microtransactions to compete on a game that's they've already paid for.\n\noptimization is also another issue, it uses an absurd amount of VRAM (6GB for eighth resolution, which is the lowest graphics preset) for a game that doesn't look as good as others which consume less memory, this could be a unity limitation for all i know but this is absurd and it was never this bad when i played a year ago. it also uses a ton of memory in general and 16GBs is not something you should be playing with. recent updates have also added a lot of buggy code and constant client errors which aren't seemingly being addressed.\n\ni also want to express my concerns about Linux support, as it would be really nice if you allowed EAC to work under Proton, it's a single checkbox that you can tick in the EOS dashboard and shipping linux EAC binaries. I know it's weaker but would it be that bad considering that most servers already moderate suspicious players? It won't stop me from playing as I've created a non-EAC server alongside a friend that's marginally successful, but it would be a nice gesture from Facepunch.\n\nyou've created an awesome game that I personally enjoy, there's nothing like it anywhere else in the entire game's industry but it has so many flaws that I cannot recommend it to new-comers in this state.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is terrible all u hear is racial slurs and e sex. the game made me lose thousands to gambling and took time from my life i will never get back, if you are thinking about gettinig this game do not get it you will regret it a year down the line, everyone try hards and ruins your self esteem and most importantly do not trust anyone on this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is always lagging and it is full of cheaters",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is not fun, barrel bashing while being exposed and constantly dying while collecting 1 hour wortth of barrel contents and starting all over again is not fun. The good items are locked behind almost impossible grind and getting there is task only those who have no life can achieve.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like to play survival games of this type. \nRust makes it very difficult to get started, however, veterans move from map to map and mow down every newcomer, while trying to get to know the game you are permanently killed. Sure, this is a cool game for veterans, but as a newbie I personally don't enjoy it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its fun for a little while but then after offline raiding, door camping and roof camping it becomes more of a chore then a game. it seems like the game is more depending on you being in a team then for solo people. otherwise your just constantly starting from scratch everyday and essentially farming materials for larger groups.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ive gained 250 pounds sitting home playing rust all day 24/7 it ruined my social skills and i cant talk to girls only dudes dont recomend dont play this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The hot dumpster garbage that the devs have let this infested wasteland of a game become is miserable. This used to be my favorite game, now NA servers are not NA, the anti cheat is a joke. I watch videos on the daily of people having a blast with their fun undetectable clients with esp and subtle aim bot. wipe after wipe this game gradually gets worse and worse. they make changes that make the game unbearable. reduce the damage of guns, great idea? time to kill in this game is not long or anything and ppl have infinite walls to hide behind. making things last long enough for the never ending 3rd party prison to start. dont take more than 20 seconds to lot and disappear off the map or someone with a db or ak will be right in your holes.  10/10 has become the worst game ever. use to be like 10 or 15 dollars too, 40 is a joke. servers are in constant lag and dsync. dont waste your time and money trust me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game of doom and despair,pls dont buy, creates depression and constanst fear of your base getting raided by unemployed fat 44 year olds at 3 am. So please for you sanity do NOT download this fuckass game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is so bad its just for fucking no life russians and you get 50fps on the worst graphics ever",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Meh, doesn't hold up to current times. I set up a personal server to play it because I'm not a PvP fan, was pretty easy to do but it wasn't all it's cracked up to be.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Isn't at all the game the game I purchased when it first come out, haven't played it in many many years, and never will. This is another game that belongs on my list of regretful purchases, I was younger and a lot dumber back then.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, it's a good game.  The thing is ; the experience can either be really good or really bad. I've certainly had good fun on this game, and i can see how so many people play this game. I can't see myself really recommending this game to anyone who is not a hardcore gamer. If you truly want to get good at the game, you have to poor hours and hours because other people put in their hours.  It's definitely NOT a beginner friendly game and i do not recommend playing this game blind for the first time with ought having an experienced friend to play with.\n\nI do understand however that it is a fun game. If you are ready to put in the hours, and get better, then i would recommend it. You can have fun interactions with other players and even make some friends. A big portion of Rust's player base is not so friendly, and will get mad at you even if you have done nothing wrong. KOS is also something people do, being kill on sight, so going in be prepared for that.\n\nOther then that, the base game is fun, the graphics are pretty good and the progression feels well balanced especially with new updates that force you to go to monuments, witch in turn forces player fights, and requires a higher level of skill.\n\nAll in all, i do think it's a fun game. I've had good experiences with it but i can't find myself recommending it to anyone. If you want to give it a shot, by all means, go for it. Just keep in minds the things I've said - as you might get pretty frustrated at first. Hope this review helped - and have a good day.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "when did this game get so bad cant even play for 2 hours keep getting kicked out and cant load back in at all i just wanna play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is so ahh it takes all your time and sucks the soul out of you also very addictive and will make ur gf break up with you...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Used to be good and some what runable, now its rammed full of so much crap its unplayable with a normal pc. \n\nThe devs dont give a s h i t about what the community think about there game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game with much to do. The player base player base may be the worst of any game I've seen. Constant cheaters and lack of support from devs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "got game banned fully and wasnt cheating. did the proper steps and was just sent and fourth between facepunch and the anticheat support. love the anti cheat banning actual players and not legitimate cheaters.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the worst game you will every play, each second you play your brain melts because every russian to ever live plays this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely ruined the game with the meta shift update, and its only going downhill. Sure they are adding some new cool stuff like boats but you wont be able to get it as a solo because it will take 50000 metal and stone to make on top of needing to get blueprint fragments that will be controlled by zergs, and sure you could play a solo server but why should I have to go out of my way to play a solo server? Why would I be driven away from playing an official Facepunch server. On top of all that they are slowly adding more and more dlcs, although not pay to win, it would be nice to have a true content update for months other than lets nerf solos and buff zergs because that's what this community really needs! Absolute trash deserves to be review bombed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rust has made a poor mistake completely changing the game without actually testing to see if people would enjoy it? I love this game and everything you can do. I have over 1200 hours and far too many skins in the game and you completeley flip the script? At least when you teased with medevil and hardcore you had separate servers set up to test them and see how much they were enjoyed. Why does every app every game now adays always feel like you have to change things. If its not broke don't fix it. I know clans have always been an issue but now they still are but there is no way for solo's to find a corner of the map and grind to get good stuff. Now you are perma stun locked by clans with guns and you can never make it past crossbow. 3/10 would not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just dont buy this game ur life would be much better without it. Femboys trying to find team, russian kids spamming \"We running the server\" after you kill him full team left. Offline raid... Yea these are fun aswell. Build in snow enjoy, 10 man team raid you the same night. Go low pop server get HS from other side of the map W just better players with ESP all g tho. My point is just dont buy this ass game go KYS better thanks for your attention. Ohh rope and chair are 50% off in Bauhof go get this combo and dont waste your money on rust.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its like if i was being butt fugged by a fistful of broken shards going elbow deep",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you have no othe friends to play rust with, do abolutely not purchase this game. Every server without a team limit you are at a absolutely fucked, as it feels like you are always fighting 20+ people. Even solo only servers are usually very shit, as its either people breaking that team limit rule, or the server has ass admins.\r\n\r\nAll in all:\r\n-Unless you have 0 life, you hate yourself and hate others, then like ig play this idk im not your mom.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I cannot believe that I spent 40 dollars on this waste. I am deeply appalled and disgusted with myself.\n\nThis game is made for no life individuals that spend every second of their lives grinding on this game, doing nothing with their pathetic sad lives. Not to mention that this game crashes every two seconds, and getting 40-50 fps on the lowest graphics.\n\nOne of the worst purchase that I've made on steam, and I wish I didn't spend 2 hours of my life in this game so I could get my 40 dollars back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Avg Rust Player is probably some random Discrod Moderator called Eugene. Now your avg experience in this game is you being diddled by some random Russian and You cursing against his whole bloodline. NOT RECOMMENDED.....unless you like being diddled.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Thought this game looked cool, ended up being lame. Outdated movement, graphics, and npc's auto target you faster than you can blink. The wildlife is overpowered, feels more like a death simulator more than a survival game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "yea this game straight dog shit maybe if devs knew how to fix there game instead of a new map update every time that just kills your fps more and more until shits unplayable bring back old recoil and take out all your map bullshit and your game would be fun and playable again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Back to Rust more than 10 years later and just like I concluded last time, it's simply not a good gaming experience. The core loop is not fun, it's so much based on luck and you have to \"git good\" just to be able to survive. Ain't got time to spend 100 hours in a game just to learn how to not get instantly reked.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shit ass fucking game\n\n-requires NASA pc for 60+ frames\n\n-even though half of your shots indicate they hit they sometimes choose to not do damage to players so goodluck\n\n-if you place down a fridge in your base other players might hear it and fly in with 369 c4 bricks so byebye home\n\n-you will occasionally freeze and your game will crash as you are flying a minicopter around the world\n\n-sometimes the server will decide to grant you the power of possessing 16000 ping to destroy all of your enemies\n\n-little kids running around screaming the nword\n\n-you might spend 10 hours building yourself up but just know your neighbor is still ahead of you AND if you get off the game at any point your base will be GONE by the time u get back on",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rust — The Game That Forgot What Survival Means\n\nI’ve got a ridiculous number of hours in this god-forsaken game, and honestly, it just keeps getting worse. I’ve seen Rust through every era — from legacy pits to the current “battle royale with extra steps.”\n\nEvery wipe is the same: join a server, build a base, run around collecting junk , and sooner or later you run into a giant clan or a cheater who guns you down like a dog. Then you start over, because that’s Rust, right? Grind, raid, rebuild, repeat… until the server dies with 20 people left.\n\nThe (recoil rework) killed solo skill. You can’t outplay clans anymore, you just avoid their zones and hope. The blueprint system had potential, but the latest patch ruined it. Big groups hit one cargo run and have AKs, rockets, and launchers within an hour of wipe. Progression’s gone, balance is gone.\n\nMy Fixes\n\n* Bring back real blueprints — you should (need a blueprint fragment to craft any gun)\n* Fragments come in three tiers (*small, medium, large*) \n* Guns should require fragments:\n\n  * Tier-2 guns → 1 fragment\n  * Tier-3 guns → 5 fragments\n* Blueprints fragments drop in about 20% of boxes and scientists .\n* Move rockets and launchers to Tier-3 bench only.\n* Delay cargo ships and locked crate events for the first 24 h after wipe.\n* Excavators? Scrap them — they’re just clan property at this point.\n* Add drone shops where you can buy items anywhere on the map (but no protection , if you get caught, good luck).\n* Give solos a chance — small caves or mini-monuments where they can actually build and survive.\n\nI don’t speak for any community  just a long-time player who’s seen it all. Rust used to be brutal but fair. Now it’s just exhausting.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is cancer got banned for apsolutely nothing at all the performance is ass and everybody is scripting and using esp if ur a bum and have no life buy it but if u dont wana get arse fingerd i recomend u dont buy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game over all some swearing and some toxic little guys buy over all great game to troll people",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "incredibly buggy un-optimized turd with upscaled graphics. The fact this game has a very positive rating is just insane. So many things about this game are broken and their solution is to just add more skins because toxic teenagers and inbreds still play this game. Even just playing in a personal server there's nothing to offer, the pve seems fun but the jank is insane, the game is clearly unfinished but the devs clearly don't give a shit. This game could've been so polished and optimized by now, they pulled it out of beta just to double the price tag and change nothing. To think this game is the pioneer of this kind of game is shocking but then again it makes sense that somebody else could use this gimic and make a game better in less time than a quarter of it's existence. Truly a shitty game and probably one of the worst you could ever buy. Kind of iconic though, I find everyone buys this game in their toxic teens then grows out of it so it just collects dust in your steam inventory for centuries. If you ever consider buying this game, save yourself the trouble and play something else, if you're reading this I love you and care about you, don't do this to yourself, you deserve better. <3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really irritates me that there is no offline mode so I have to play with weirdos I've never met if I want to play the gameplay loop even a little.  it's frustrating, not everyone has consistent internet to begin with.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you'd be interested in getting a lobotomy whilst 20 to 40 feral hogs rig you to shreds, this game is for you!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nunca jogue esse jogo na sua vida, vc vai dar de cara com uns cabra com 10 mil horas que tao ali so pra te fuder gostosinho e ainda ficar gritando na tua orelha",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pvp for 7 year olds... all other aspects are cool but pvp is most arcade thing ever... after 1600 hours i still dont get the pvp in this game, i think majority are just macro users every time you get sprayed from ak across whole map and every bullet hits you, controlling the spray ? not a chance you could spray control the spray and hit every bullet 500m away ........",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is the equivalent to being in a pork grinder, while having to do the, Wisconsin blow dryer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ive never actually gotten to play miuch of rust. whenever i try i get slaughtered iwthin 5 minutes or so, over and over agian. i kinda hate it and wish id never spent money on it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sadly a year ago my account got hacked and hacked on this game now my profile is stained and cannot do shit about it  \n\nthey always send an email like this:\n\n\nHello SKYLIMIT,\n \nThe ban is permanent.\n\nPlease read the policy governing game bans: a link.\n\nMaking a new Steam account after being game banned will result in that account being banned as well.  We do not condone ban evasion.\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game you`ll ever touch , dont get fooled by the big dog streamers or the big branching of the game in general. game aint worth even 1$ , been around since beta - game just gets worst , stupid ass updates for no reason , PLENTY of un-neccesary pay to win skins for the kids , CHEATERS are all over and yes this game is SO infested of them russian kids and spastic cheating psychos(ik every game has cheaters but been in a server with 150+ ppl and atleast 40+ cheats aint fun.new accounts with 2hours playtime been rekking u all over no matter official or not servers). this game gives no enjoyment nor fun unless you got 10+ friends to play with every time . lag and servers usually d-sync or have fps issues as the devs dont even bother investing some $ for new servers . this game was created and still exists just to be a content createror. farm 3hours so the cheating 1hour account shots u from 250 and insta rage bait you `get good,your mad`. .. \r\nIF you are a normal not retarted irl , STAY AWAY from this game dog-as-s so called Rust youll just save your health and some braincells out of this sh-itt as-ss community",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game sucks wouldn't recommend it to anyone. Tried it years ago and it sucked, Tried it again recently and it is even worst.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crazy addiction\r\nfun game but alot of cheaters",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game crashed 9 times before i got in, then i joined a server then crashed. 10/10 would recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit ass game wont even load and exploded my pc when i moved my mouse, the explosion killed my whole family and now im disabled do not recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have more than three thousand hours in Rust and for a long time it was my go to game. I loved the grind, the suspense of roaming with a full inventory, the rush of winning or losing a fight that actually mattered. It was brutal, but it felt fair most of the time, and the progression from primitive to late game was one of the most satisfying parts of the experience.\r\n\r\nThe recent changes to the workbench and blueprints completely killed that feeling for me. Progression used to feel like something you earned through smart decisions, good fights, and efficient farming. Now it feels like a chore and a punishment. The way you unlock and access items does not feel rewarding at all. It drags out the grind, takes away a lot of the creativity in how you progress a wipe, and makes every restart feel like the same boring checklist instead of a fresh run with new opportunities.\r\n\r\nI can handle Rust being hard. I can handle getting offline raided, roof camped, or zerged. That is all part of the chaos that makes the game memorable. What I cannot be bothered with is a progression system that feels like it is fighting me every step of the way. Right now it just feels clunky, restrictive, and honestly not fun. Instead of thinking about cool plays or new base ideas, I find myself thinking about how annoying it is to deal with the workbench and unlock system again.\r\n\r\nAt this point I will be spending my time in Battlefield 6. I never thought I would say that, but Rust in its current state is just not it. Hopefully the devs actually listen and rethink these changes, because under all this mess there is still an incredible game. As it stands though, the game is fucking horrible and it is a thumbs down from me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i thought i was playing alone, not the case. Its incredibly confusing to choose community or whatever and the servers, because there are no guidelines on that. I wanted to play an alone survival game an end up being killed naked with a rock in hand by some dude in full gear and a gun... what a dissapointment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5 years ago I would've said yes buy this 100%, but now they really just have messed it up. Not nearly as fun or rewarding as it once was.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game for years and loved every minute of it. I can return and leave whenever I feel like it. \n\nThem making a \"premium\" status for people that own $15 or more in skins on an account to join certain servers just doesn't sit well with me... \n\nSkins  serve no purpose to my gameplay and I've never had to buy them before. Now I'm gatekept by a skin purchase pay barrier. I've owned this game for YEARS and have supported server hosts FOR YEARS. \n\nI will not buy skins just to earn a half ass attempt to \"prevent cheaters\". THAT IS BS. I will not support those systems.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a fun game but you got to find the right server or host your own cause 90% of the servers are real toxic",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i have to say this is one of the worst games i have ever played.i hate this game so much because it ruined my friendship with my friends. i surely not recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Completly useless! very bad game as when you start, it's no point we survive 1 hr without getting kills",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game has so much bugs i cant even get in game says server time out and sometimes the guns at outpost will kill you randomly!!! Fix game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game Is Really Fun..... If you wanna play what's wrong with my PC simulator where if you think your going to be running smooth while playing might as well consider your brain smooth.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you dont have specs above a 4090 your fps will randomly drop and the game looks like you can play it on a unblocked website",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got permanently banned off of every server in this game and i never did anything wrong.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "40% cheaters, 60% Scripters 100% People who yell 35 Slurs per minute \r\n\r\n\r\nHas a sword tho",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Me and rust have a love hate relationship. Mainly hate with a sprinkle of love but this game will take your life. ruin you as a person and make you see life in a complete different manor..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games so terrible optimizing it takes longer then actually playing this dog shit game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As far as this game goes, I don't play it anymore because it's not even that good nowadays. There are many other titles that have been released since Rust's launch, and considering its price, you can find much better options for an AAA title. When you buy Rust, you're paying for the name and its reputation, not necessarily good gameplay.\n\nI haven't played this game in about six years, but I'm now very disappointed because someone hacked my account and gave me a permanent game ban, so I can never play it again. I now have the one and only game ban on record for this Steam account because of this, and it can't be revoked. Facepunch and Easy Anti-Cheat don't want to help, and for that, I have to say it's bull feces. They don't care about their players only money. If you own this game, you're at risk of being permanently banned through no fault of your own, just simply owning it can expose you to exploits.\n\nJust be careful. I'm removing this game from my account and want nothing to do with it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shitty ass game crash's every 5 seconds LITERALY, and I'm using ethernet and I have a GOOD pc i spent 40 dollars on this damn game for no fucking reason.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game with much thought process behind it. Sadly its the same as csgo, its full of fat losers who cheat because they are losers irl and in games. Unplayable. Cheaters in game = dead game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very addicting the only good part about this game is that there isnt a lot of jews",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit game can’t build a decent base unless you have miles of flat ground bc one bit of offset ground fucks your base and the games full of cheaters",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to recommend this game so badly. The core gameplay loop is addictive and satisfying, easily one of the best in the genre. However, the cheating problem has made it completely unplayable.\r\n\r\nAs a legitimate player, you accept that you might lose your gear to a better player, that's part of the game. But losing hours of farming and intricate building to someone using ESP who raids you in less than a minute? That isn't losing; that's being robbed of your time.\r\n\r\nRight now, playing legitimately just feels like you’re working a free job to feed the cheaters. 10/10 potential, unplayable state and it probably never be fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rust is a kind of difficult game, Very racist people, toxic people, annoying people that dont like to help, they always break the rules, they need to remove vc because nobody talks and almost nobody is ever in their base and servers are rapidly dying the game is falling apart as itt seems everyone is shifting to Arc Raiders",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Holy fucking balls Batman, hardware that's younger than this game still can't run it well",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so unbearable I would rather gouge my eyes out and feed them to my dog and the put my johnson into the oxem's gas station recycler.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The worst 50 hours of my entire life, edging for 50 hours straight would've been better, at least I would've climaxed, the climax in this game is waking up to everything you worked for being gone and swastikas painted on the walls. Not too euphoric. def gonna play more tho",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you close the game once it just wont open up again, steam says ''game already running'' when clicking STOP nothing happens just endless STOPPING text on the button, only way to fix it for one time is to restart steam, then it starts from beginning, close it once and never able to play again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blueprints don't get wiped enough. \nTired of entering games where players are leagues ahead in research or I have to wait an entire F**king month to start at the same level.  Instead I chose to uninstall and play Hunt: Showdown or Arc Raiders instead.  \n\nThe sweaty tryhards can enjoy circle jerking each other while the rest of us play other games, lol.\n\nHonestly wouldn't care if Rust dies in obscurity like Dune.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got ban from own server then I got banned logo on my profile, I like the game but this kill me forever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was good, now is mediocre at best. Prime game was between 2016-2020. Avoid it. The game will steal your time and money, it can be quite addictive.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is very bad for you its worse than drugs its a shit game but i keep going to it the addiction for rust is horrible please dont purchase this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game if you are unhappy, depressed and have a low will to live",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game genuenliy makes me wanna kys. Like the amount of times i have been ass fucked is so crazy. you cant comprehend ts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the single handedly the worst and best game i have ever played. One day im snowballing in a 2x wipe the next im getting raided by two 11 year olds that bought cheats with their moms credit cards and screaming at me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just a very toxic environment. each time i played i was met with people shouting racial slurs and killing me when i always had nothing and it always takes forever to even load into a game. just not my kind of game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Running around for 10 minutes trying to just get started  and establish...anything. to get killed and start all over again. I guess if you started the game when it first dropped it is OK, but heaven help anybody who tries it out now. An exercise in futility is the best I can describe it. Wasted money. only played for 7 hours total and asked for a refund. Nothing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun game. But if they are unwilling to support Linux/Proton, then I cant support this game. Windows is falling. It sucks. Of you cant figure out how to work an anti cheat on linux... well id say that says more about the devs than anyone else. Reading that article where the devs said 'games that support linux/Proton arnt serious about anticheat' makes me actually want to refund this. I wish I could take my money back if I had known the devs had this kind of thought process. If I cant vote with my wallet on this one, ill vote with my presence. I wont be playing this game again unless it gets support on Linux or Proton. And if it never does, I guess youll never see me in the player count for this game. So be it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Someone hacked my account simply to play Rust and get my account VAC banned from playing the game... I never really played rust so it's not the end of the world, But a false VAC ban on record is COMPLETE BULL. \n\nCLEARLY SOME RUST PLAYERS ARE SUCH CRETINS THEY HAVE TO STEAL ACCOUNTS JUST FOR ANOTHER FIX OF PLAYING AND GETTING BANNED.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ive seen so many reviews on this game, Its fully cursed but has to be so fun at the same time. There was not a single time where i didnt have a negative experience tbh. Every server just feels worse or just straight up garbage. Kinda fucked my school grades because i got addicted to it. Maybe if you have a lot of time on your hands you can try it out on sale and see if you enjoy. \r\nPlay at your own risk and dont question the 500 thousand times you get called the n word",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks ♥ a solo with 67 hours absolutely cooked a chinese group with over 6000 hours. They come and pound my base with a base pounder or whatever that is called!. I would recommend buying this game, its amazing if you have some really negative thoughts about yourself. Really makes one want to jump off the Westgate. ♥♥♥♥♥♥",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I see the appeal for people who grind, maybe I just had a bad experience but:\nHad this game since 2017 or 2018 I think but couldn't run this game for absolute ages which had already gave me a bad view on this game but then again my PC was ass.\nBut when I was able to run this game, yeah it was fun with mates (couldn't imagine playing solo, it's not my type of game tbh it's a lot of external learning) and we played for a few hours, got a base, the whack and then had guns. Went on a few expeditions to gather loot but there was like nobody there which is fine because free loot but I'm pure bravo 6ing the place out because I'm ass at the game. We get the loot, we get the setup, we're chilling for a while then get destroyed on our next expedition from a roof, rinse and repeat. \nHad this loop for around 50 hours tbh my playtime is inaccurate because most of my hours would be from my old PC and loading the game for a solid 30-40 minutes, crashing or getting in then crashing and repeating this cycle LOL.\nThe only joy I get is setting up base and whatnot but then after that it's when I kill nakeds but that makes me feel evil deep down because they are helpless, yet I am helpless against these roof campers.\nMaybe I could recommend trolling for fun or joining a 10x server would be fun because it's chaotic.\nBut for Vanilla or like modded 2x/3x servers, pretend everyone is the same skill level in the game starting from wipe, it's a game of who has their PC on longer / grinds more in my opinion because I don't see a goal.\nRather play CS.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely loved this game, having spent over 2000 hours in game so far. BUT, the most recent progression changes are biased against solos ( of which I'm one), and unless you spend your life in game ( yes, I know they exist) you will never keep pace with groups and will always be fodder. Having to do an uphill slog with blueprints every month only to be a victim very quickly each wipe isnt fun. ( its also not fun finding that all the BP's you have unlocked on your favorite servers have gone, and if you want to play on various servers you have to multiply the grind). Perhaps the developers are no longer interested in solos or that their goal is that solos are only team fodder, but just be honest. I wont be dumping the game completely, but it will no longer be an every month play - just perhaps a now and again. Also, thats the end of my skin purchases.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Imagine you want to play Rust for the first time. After you build the Workbench Level 1 your progression stopped. The blueprint fragments are hard to get. Those are available at monuments which are contested by groups.\nFarming in the ocean became useless because you are not getting any blueprint fragments there and you are stuck at some point.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}