{
  "positive": [
    {
      "review": "Funnily enough? a better tactics game experience than most. Yeah, gacha mechanics. No doubt. RNG gonna play a part in how much you'll enjoy the start of the game. BUT you get a free named character, free legendary one. You're good to go. \nLot of stuff to do and it seems daunting at first. But literally just pick a place an begin. No wrong answer. You literally don't have to spend a dime. I enjoyed the game so much I spent 35 dollars to get some of the basic packages. But that's just because I wanted to support the devs as I genuinely think they have pushed out a decent product here with fair balance. \n\nI do wish there were more hovering tooltips, and better menus. Some stuff I feel is hidden and I stumbled across some by accident. That said, I'd give it a solid 8/10 -- with 10, for me being Fire Emblem, 9 being FFT\nSo if that tells ya something. \n\nIs free to play, so no harm giving it a chance.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Played this out of respect for the artists who did the pixel art.\nCore game would be amazing if it was just story and not developed in style of a Gacha mobile game.\nFirst time i wanted to give up because of the absolute plague of UI and some of the splash art being made with Midjourney. But I stayed for the excellent pixel art and story. \nWorth playing but please for the love of god do not get hooked on the gacha mechanics and buy in game currency. You can absolutely finish the story mode without spending a single cent.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Love the game. Beautiful pixel art, character design!! The gacha feels fair, you can easily get pulls without spending. I spent a little to support the game, but you really don't have to.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fulfills that Final Fantasy Tactics need that's been lacking for years. Well thought-out and built game, totally fine as Free to Play, unless you want very special characters...\r\nOf course, there is a lot more to SoC than FFT; events and summons, levelling up gear, Spiral of Destinies (which allows altered play of main story lines to get different endings,) and more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "和巫师3联动的契机，正好以前国服的牢号不要了来国际服重开。\n\n数值碾压和SLG走位战略大概7比3.\n\n立绘好，游戏牢。",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like tactics, then this game is for you. there are 2 modes, The fools journey (classic with daily quest) and Spiral of destinies (rouge like and does not matter gatcha)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love tactical RPGs like FFT and TO, this is by far the best Freemium Tactical RPG currently available.\r\nJust remember it's almost always better to buy a game like Tactics Ogre than to spend money in a freemium game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't often write reviews but I feel like I have to support such an amazing game. While I would rather have the game without a gacha, the game is generous enough to always provide units with some tactical advantage. Even the \"trash\" units have utility. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I installed it just because of the Witcher 3 collab, but it’s actually fun and I really like the way the game looks. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "quite like that game besides that one bug where i couldnt enter the game a few months back which made me drop the game till now, Tried once more and still love this game, do wish you could go further the friendship meter than 5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game good graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love Final Fantasy Tactics, definitely give this game a shot. There are a few modes, one which is totally free to play and enjoy, and the other aspect which has gacha elements. The \"Spiral of Destiny\" mode is absolutely worth plaything through all of its story arcs, they are fantastic and hit the deepness seriousness of FFT, along with music that was created by the composer from the original game. Gameplay is strategic and looks fantastic. Most characters are very grounded and not hyper fantastical. The gacha element is surprisingly forgiving unlike most games in the genre. Overall fantastic experience and scratches the itch.\r\n\r\nPixel art is 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Know this - It's a free to play, gacha mechanic game with character and item draws. BUT!!!!! There's so much free stuff given away that you could enjoy this game without spending a penny.\n\nI have a lot of hours on this game. It's amazing.\n\nIt's going to seem slow at the start. You have to unlock different activities. You have to get a few characters. You have to get through the initial parts of the game to learn the gameplay and all that good stuff.\n\nThis is probably my favorite free to play game I've ever played. There's 3 modes - daily, challenge, and story. You can play the story mode all day and never get bored. There's legit 10+ different endings to explore. Challenge levels are always being added, but you won't finish the current ones for at least 3+ months of playing. Daily add items and equipment to power up, and you will need energy to do them.\n\nWant something you can play for an hour to kill time? Want to sit and play a game for 6 hours on your day off? This game gives it all. OH! And it's mobile, so you can download it to your phone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, gacha system pretty generous than most gacha out there. still i dont like gacha mechanic but this game is good overall. recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Normally I avoid playing gacha games, or give up on them after trying. But this game is very enjoyable. Story is interesting, characters, and progression is well thought. It's very F2P friendly. And NonoWill is very good at singing lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE STORYYYYYYYYYYYYYYYY is a 10/10 the fighting is amazing i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent tactical game design and character designs, nostalgic but modern pixel art, not too time consuming as a hobby.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Verily, I shall commend this noble game unto all who wander the path of the comment scroll.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s one of those games where you can really see the developer’s effort, and it makes you want to support them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty cool game with a nice story and cute characters.  I like that it's free and to build yourself better you can pay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First and foremost it is a gacha game. Always needs to be front of mind. However, from a purely free to play perspective its awesome fun. The story game modes are really well written. The complexity of the combat is very impressive and better than many ather SRPGs I've seen with similar models. The character designs are class, and the new player experience I'd say is fairly generous. I do find the account leveling being tied to an energy system to be annoying. However, the non-energy related content is massive and really fun to go through. \r\n\r\nOverall, if you want an SRPG that you can play casually on your PC and Phone with cool character designs and strong story focused content as well as higher tier challenges that Free To Play can complete along with Whales, then I highly recommend this game. Just make sure you are comfortable with a gacha game and gamble responsibly!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stop reading and download! You wont regret a second.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very chill and strategic games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game if you like tactics based  games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loop Stratagy is best seller Social APP!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for a gacha game\r\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its ok it has witcher",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fUCKI NG great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An extremely grudging yes I do recommend it.  This game should be a single player RPG that is sold for $30 to $60 with no microtransactions and if it was it would be a wonderful 9/10 experience.   The gacha mechanics are an absolute blight on the game's industry, there is no excuse for them.  But, fair is fair.  You can experience the game's story without engaging with them with an insignificant amount of grinding.  I only recommend the game as a singleplayer experience where you enjoy the story and do not pay a dime for loot boxes.  I will detail how you do that below.   \n\nSo... the story is a bit weird.  The RPG where you play a normal campaign, make your choices, and experience different endings is a mode called the Spiral of Destinies.  This mode is clean of any gacha mechanics, it is just a normal RPG.  You unlock this mode by playing through the tutorial and unlocking a hub dimension called the Elysium.  Here you will earn a currency that buys you keys that let you play the Spiral of Destinies campaign.  That's already kind of weird and confusing but ok... at least its not hard to grind up some currency.   \n\nThe Elysium has other modes and it's own story.  You're given a few free characters to play through these with.  If you want other characters or want to equip your Elysium characters with shiny loot, that's where you need to start opening your wallet and doing random pulls.   You do not need to do this to experience the story, so I recommend you do not do that.   Just upgrade your free characters as much as you can with rewards from doing Elysium missions.  You'll get what you need to level up your characters enough to continue the Elysium story.  And while doing that you'll earn what you need to play Spiral of Destiny runs, where the real meat of the game is.  Let the rest of the gacha infested game sit in the shame corner.   \n\nSword of Convallaria as a single player RPG is great.  I really wish that I could just pay the devs for their hard work, but I will not have any part of gambling mechanics.  Enjoy it for what it has to offer.  There's a good game in here.  It's just got mud on its face.",
      "voted_up": true,
      "votes_helpful": 55
    },
    {
      "review": "Funnily enough? a better tactics game experience than most. Yeah, gacha mechanics. No doubt. RNG gonna play a part in how much you'll enjoy the start of the game. BUT you get a free named character, free legendary one. You're good to go. \nLot of stuff to do and it seems daunting at first. But literally just pick a place an begin. No wrong answer. You literally don't have to spend a dime. I enjoyed the game so much I spent 35 dollars to get some of the basic packages. But that's just because I wanted to support the devs as I genuinely think they have pushed out a decent product here with fair balance. \n\nI do wish there were more hovering tooltips, and better menus. Some stuff I feel is hidden and I stumbled across some by accident. That said, I'd give it a solid 8/10 -- with 10, for me being Fire Emblem, 9 being FFT\nSo if that tells ya something. \n\nIs free to play, so no harm giving it a chance.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "TLDR; \r\nPROS: Graphics amazing, \r\nFree game and you get gacha currency for free by doing quests, \r\nStory is engaging, addicting and relaxing gameplay with endless content. \r\nCONS: It's mobile game so the UI doesn't work well with PC and no steam achievements booo \r\n\r\nThe graphics are beautiful and lovely and one of the main reasons I decided to try out the game. I’ve never played a turn-based combat or gacha game as much as this one. They don’t spam you with “buy this, buy that” pop-ups like most mobile games. The option to purchase gacha currency/characters are there in the background if you want it, but it’s never in your face.\r\n\r\nA huge plus: you can earn summon currency just by playing and completing quests. I found out it’s a mobile game, so the UI can be a bit tricky with a mouse, but it doesn’t really bother me since I’ve gotten used to it, and the menus are easy to understand.\r\n\r\nThe story is super engaging, has light humor, and the characters are all so likable and cute ^w^. As for the content and gameplay — it’s so good and feels almost endless from what I’ve played so far. It’s a relaxing and enjoyable game to keep on your phone and play when you want to unwind and spend some time grinding quests for new characters.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I had my eye on this game before it came out, played the demo, and did play a bit around release, and this game is actually really good for what it is, which is a gacha game. That said I haven't spent a cent yet nor have I felt like I had to. It really does scratch the tactics RPG itch, with some genuinely creative and engaging mechanics across various game modes and characters. That's one benefit of having a bunch of set characters as a gacha does instead of a job system; characters need to feel meaningfully different in how they play to justify taking up space in the character pool. Characters also have psuedo skill trees and you can nudge them towards certain playstyles that way, like making a spellcaster single target or AoE focused, or a bit of both as you unlock abilities with more levels.\nThe story is pretty solid, and there is a lot of it. I'm having a hard time even complaining about the \"limitations\" you have on play because using up one \"Spiral of Destiny\" key, the item you use to unlock a \"run\" of the campaign mode, took up hours of my time and you get two of them free per week and more from playing. There are branching story options that incentivize replaying this mode to see other possible endings to the plot. Another form of story progression that runs parallel to the Spiral of Destiny uses an energy system that will be immediately familiar to anyone who has played a mobile game, and that's eh, but with the time I have in my day and how many things there are in the game that don't use energy I don't really mind it much in the end.\nI mainly redownloaded the game to check out the Dungeon Meshi collab and they did a really good job with it honestly; characters felt well represented and the gameplay took inspiration from the concepts in the series in a way I thought was charming and creative. Absolutely a little upset only Falin/Marcille/Senshi were playable though. Chilchuck I get because he can't fight but no Laios? Really hoping they do a follow up event because there's a lot of potential there. They did a fantastic job making the event accessible to new players as well as it had its own progression system that wasn't reliant on you already having maxed out characters to be effective.\nSome mild criticisms are that the game technically has controller support but it's much easier to just use mouse and keyboard as it was designed for touch screen, the mouse is just easier. It has all the standard trappings of a modern gacha game and I hold the belief that \"it's a gacha\" is a valid enough reason to pass up on a game if that's not something you're cool with or you're the kind of person susceptible to the kinds of monetization patterns in that type of game.\nI'm now currently around account level 40 in the game and I believe 60 is the max, we'll see if it hits a point where it feels like I've truly hit a wall, but so far I haven't. It just doesn't feel like spending is necessary, you get a lot of free stuff including legendary characters, and legendary gear especially they seem to give out like candy. The recommended levels for things seem pretty generously tuned, like they probably balance it around the starter/free characters they give you. Even things like a daily log in bonus or battlepass I just find myself thinking \"I don't actually need that though.\" Character pulls have guarantees after a certain amount, saving up pulls seems pretty easy with events, the main thing I'd criticize is a lot of the FOMO stuff but that's also par for the course with anything live service.\nOverall actually really good, great tactics gameplay, some good and interesting challenge levels, and for the 40+ hours I've gotten so far, absolutely free.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Played this out of respect for the artists who did the pixel art.\nCore game would be amazing if it was just story and not developed in style of a Gacha mobile game.\nFirst time i wanted to give up because of the absolute plague of UI and some of the splash art being made with Midjourney. But I stayed for the excellent pixel art and story. \nWorth playing but please for the love of god do not get hooked on the gacha mechanics and buy in game currency. You can absolutely finish the story mode without spending a single cent.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "1300+ hours upon making this review.\n\nThe game is very fun, however there are some challenges that can be frustrating at times. There is gacha, and it does have pity system, however, if you plan ahead and save up for certain banners then you'll be fine. Just about any contents can be beat with any units, and there are some YT channels that does plenty of such for their content.\n\nThere's a story mode (Spiral of Destinies) which has alternate endings, a lot of people say it's good, most specially the night crimson story line, I've only done several SoD stories, but I have watched a friend do multiple runs, and the story is pretty good.\n\nThere is PvP but no one really takes it seriously, but there is real time PvP you can do should you decide to spar with a friend.\n\nJust do not FOMO, remember the contents can be beaten with lower rarity units. Take your time, and just enjoy the game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Not my type of game, but I can understand how it's game play and mechanics can be fun. It also has some of the best pixel art out there and really good music and sound effects! Story could also improve in my opinion. Nevertheless, I would recommend it if you enjoy this type of game.\n\nGame play: 7/10\nPixel Art: 10/10\nMusic: 10/10\nSound Effects: 8/10\nStory: 5/10\nOverall: 40/50 = 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the game. Beautiful pixel art, character design!! The gacha feels fair, you can easily get pulls without spending. I spent a little to support the game, but you really don't have to.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Awesome game! Literally FF Tactics with Gacha, nice events some cool collabs, nice cause the dailies don[t take long to finish.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Highly recommended for anyone who loves strategy, great pixel art, or simply losing track of time in the most enjoyable way possible",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "和巫师3联动的契机，正好以前国服的牢号不要了来国际服重开。\n\n数值碾压和SLG走位战略大概7比3.\n\n立绘好，游戏牢。",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fulfills that Final Fantasy Tactics need that's been lacking for years. Well thought-out and built game, totally fine as Free to Play, unless you want very special characters...\r\nOf course, there is a lot more to SoC than FFT; events and summons, levelling up gear, Spiral of Destinies (which allows altered play of main story lines to get different endings,) and more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I remember starting this game and then I left it for a little bit. I'm not very picky about the games I play. It's a great story with great characters and a pretty easy strategy to get ahold of. I haven't played a game like this in a very long time. It feels pretty easy but can feel a bit overwhelming at times.\r\n\r\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game itself i was skeptical about since it needed to be done properly with the way the stories go and it did just that the amount of times it can be played is very good as each time you want to start a new ending you get checkpoints if its the same path.\r\nIf you have ran out of keys you can get them easily in events or at the end of the week\r\nthe best part is its free to play and the character designs is awesome aswell as the recents collabs that have happened overall this game is very generous in my opinion and its great for those who like games with different endings even if its not the ending you want but hey some times you dont always get the good ending at the end of it all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Downloaded it because of the Witcher 3 collab. The quality is amazing, especially the collab event! And that comes from a seasoned gacha player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like tactics, then this game is for you. there are 2 modes, The fools journey (classic with daily quest) and Spiral of destinies (rouge like and does not matter gatcha)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love tactical RPGs like FFT and TO, this is by far the best Freemium Tactical RPG currently available.\r\nJust remember it's almost always better to buy a game like Tactics Ogre than to spend money in a freemium game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't often write reviews but I feel like I have to support such an amazing game. While I would rather have the game without a gacha, the game is generous enough to always provide units with some tactical advantage. Even the \"trash\" units have utility. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I installed it just because of the Witcher 3 collab, but it’s actually fun and I really like the way the game looks. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "quite like that game besides that one bug where i couldnt enter the game a few months back which made me drop the game till now, Tried once more and still love this game, do wish you could go further the friendship meter than 5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game good graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love Final Fantasy Tactics, definitely give this game a shot. There are a few modes, one which is totally free to play and enjoy, and the other aspect which has gacha elements. The \"Spiral of Destiny\" mode is absolutely worth plaything through all of its story arcs, they are fantastic and hit the deepness seriousness of FFT, along with music that was created by the composer from the original game. Gameplay is strategic and looks fantastic. Most characters are very grounded and not hyper fantastical. The gacha element is surprisingly forgiving unlike most games in the genre. Overall fantastic experience and scratches the itch.\r\n\r\nPixel art is 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Know this - It's a free to play, gacha mechanic game with character and item draws. BUT!!!!! There's so much free stuff given away that you could enjoy this game without spending a penny.\n\nI have a lot of hours on this game. It's amazing.\n\nIt's going to seem slow at the start. You have to unlock different activities. You have to get a few characters. You have to get through the initial parts of the game to learn the gameplay and all that good stuff.\n\nThis is probably my favorite free to play game I've ever played. There's 3 modes - daily, challenge, and story. You can play the story mode all day and never get bored. There's legit 10+ different endings to explore. Challenge levels are always being added, but you won't finish the current ones for at least 3+ months of playing. Daily add items and equipment to power up, and you will need energy to do them.\n\nWant something you can play for an hour to kill time? Want to sit and play a game for 6 hours on your day off? This game gives it all. OH! And it's mobile, so you can download it to your phone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, gacha system pretty generous than most gacha out there. still i dont like gacha mechanic but this game is good overall. recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Normally I avoid playing gacha games, or give up on them after trying. But this game is very enjoyable. Story is interesting, characters, and progression is well thought. It's very F2P friendly. And NonoWill is very good at singing lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE STORYYYYYYYYYYYYYYYY is a 10/10 the fighting is amazing i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent tactical game design and character designs, nostalgic but modern pixel art, not too time consuming as a hobby.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Verily, I shall commend this noble game unto all who wander the path of the comment scroll.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s one of those games where you can really see the developer’s effort, and it makes you want to support them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty cool game with a nice story and cute characters.  I like that it's free and to build yourself better you can pay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First and foremost it is a gacha game. Always needs to be front of mind. However, from a purely free to play perspective its awesome fun. The story game modes are really well written. The complexity of the combat is very impressive and better than many ather SRPGs I've seen with similar models. The character designs are class, and the new player experience I'd say is fairly generous. I do find the account leveling being tied to an energy system to be annoying. However, the non-energy related content is massive and really fun to go through. \r\n\r\nOverall, if you want an SRPG that you can play casually on your PC and Phone with cool character designs and strong story focused content as well as higher tier challenges that Free To Play can complete along with Whales, then I highly recommend this game. Just make sure you are comfortable with a gacha game and gamble responsibly!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good modern take with a nostalgic taste of Old Tactical RPGs, scratched my Final Fantasy Tactics itch better than FFT itself.\nThe only things you should be aware are : characters are class-gated ( cannot switch classes ) and the game is clearly adapted from mobile to PC, but works wonderfully.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best gacha game ive played in a while. Should be more popular than it is. If you want to be a F2P, I suggest choosing another genre though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, great characters and good story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good story with conflict and ideal , am a f2p i got almost every character in the game if you dont want to deal with gacha just play the story mode it give you free character to play with you wont regret it i recommed night crimson because you dont need to know any character to enjoy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've enjoyed my time playing Sword of Convallaria! The art + music is top notch and I like the tactics gameplay. It's a gacha so of course it has typical elements that come with those, but honestly I've found this one to be pretty f2p friendly. Several times I've not gotten a character I wanted on their debut banner only to be pleasantly surprised and pull them later on in another character's banner. Other gachas I've played the banners are limited and get very infrequent reruns, so I've appreciated that here characters aren't locked away after their debut banner is over. \n\nAlso - I really like the cast of characters in Sword of Convallaria. They have some thoughtful, well-written dynamics with one another and many of them have kits / playstyles that reflect their personalities and actions in the story. The character designs are great too, there's lots of cool women wearing PANTS. FINALLY. [i]PANTS[/i]!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Obvious port from mobile which has pros and cons depending on what kind of games you're into. Lots of story content and lots of content not tied directly to a \"stamina\" mechanic.\n\nThe main turnoff is the typical over-valuing of their digital market. Some of the translations seem dodgy. More free content than some AAA games these days though so, meh, pick your battles where you care.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sword of Convallaria is basically what happens when Final Fantasy Tactics goes to art school and starts dating a pixelated anime cast. You lead a mercenary group through a land full of magical minerals, cliffs, boulders, and more drama than a reality TV reunion. The battles are tactical, the heroes are ridiculously stylish, and the music by Sakimoto makes you feel like every turn is epic—even if your cat is sitting on your keyboard. 10/10, I’ve never felt so simultaneously strategic and emotionally manipulated by pixels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great tactical JRPG, especially in Spiral of Destinies mode which could be its own standalone gacha-less game. Phenomenal artwork, memorable characters and a solid storyline.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good game and story for people who prefer tactics and chill",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "9 hours each day of working plus dating schedule and also meeting up with peoples for work, playing this game calms the hectic brain, I love this tactic game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wow, did not expect for it to be such an exciting game! After a \"hiatus\" from gaming, this one has brought me quite some enjoyment.\r\n\r\nAs a Tactical RPG enjoyer, this has been a great experience so far. Considering that you can fully experience the story mode free of charge and unlock basically all Legendary characters also for free (although with some grind, logically as the game contains Gacha elements), it is a highly replayable game.\r\n\r\n72 hours in and I still have not finished the whole story. I'd recommend giving it a shot!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Solid tactical RPG with a charming pixel art style. Resource management can be tough, demanding careful planning. Enjoyable story and engaging characters make for a rewarding experience, even with inherent difficulties. A great indie title!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm a big fan of Final Fantasy Tactic, Tactic Advanced I and II and this game is my dream come true",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i just enjoy playing turn based RPG. the gacha is not that bad. you can still clear most of the chapters being f2p is you wanted to.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Nice stories overall and a different SoD version",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stop reading and download! You wont regret a second.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay reminds me of Final Fantasy Tactics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most F2P friendly gacha game out there. If you like SRPG, make sure to give this game a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I usually despise gacha games, but this one is different. It’s surprisingly generous with character star farming, and if you can resist the FOMO, you really don’t need to spend a dime. Still, I choose to spend a bit each month just to support the devs.\n\nTo those who love FFT, this one is a love letter.  Try it and see for yourself.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantasy Tactical RPG revitalizing the beloved Japanese turn-based & pixel art genre. Collect & train a roster of mercenaries, customize your squad, and use your own strategy to save the nation of Iria. Journey through a world of plot twists where every choice you make will reshape your destiny.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "(As a \"Free-To-Play\" supporter of this Game) \r\nI really enjoy the availability of Characters, Luxite(in game currency), gear and items. They dont seem to be very stingy with the free goodies you pick up along the way as you rank up to player lvl 60. I just got to LVL 60 Today and feel that i should make a comment. I almost every day have found a way to earn enough Luxite to Summon 1 ten pack of characters. I also have pulled legendary characters every single week, even multiple Legendary and Event Only Characters on a regular basis. \r\n\r\nI enjoy the nearly endless thing to do in game and this part is very important. Because, the game has a sort of \"Stamina Per Hour\" feature where if you burn through it all you are limited on what you can do to keep pushing forward. However, they have accomodated very well for people like me who have spent literally nothing but my time an energy to max out my account LVL for current game version. they include and often provide unquic events and daily/weekly exploration and story maps that i still have not even finished. i have not even past the chapter 6 story line which goes past 9.\r\n\r\nGreat Game, Wonderful Experience, Highly Reccommend for anyone into solo rpg stuff as there is very little guild and team play at this point for me to find. wonderful art and adorable characters with really fun combat.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very awesome game, love it! <3\r\nWas looking for something like this for years, finally found it \\^-^/",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Abysmal legendary rates. There are two main modes, one features quick, punchy battles, the main story involves some kingdom and resource management. The mission structure, character and level variety is excellent. And it's a free game. The first 2 hours were a little hand-holdy. There are gacha trappings like, at the start, endless screens to click \"claim\" on, and some screens with no \"claim all\". Good Japanese VA (one of the characters said the same thing every turn so I turned it off... maybe give us the option to reduce the rate of vocalisations.) Great pixel graphics. Combat slowly gains depth. Good sound design especially when moving between areas in town. Combat music repetitive after 20 hours. The cat... has a visible butthole! Edit, nitpicking: Investigate the mine pit, week 20 in SoC, Spiral of Destinies is poorly explained. The game should tell you that you need to move your characters next to a villager to evacuate them. Despite giving the player choices, the bottlenecks caused by vertical platforms in this area only make one play-style really plausible. I only had one brown assassin recruited at this point. Trap Master 6-16-1 is a trash map. There is a second solution but you just run out of turns even though your character is still alive. Birds of a Feather 2 - the mission description does not include a fail scenario after a certain number of turns, and yet, you lose if you take too long.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There is a lot to do. \r\nThe stories are good, there is always new stuff coming out (events)\r\n\r\nBut mostly this game keeps me coming back for the beautiful art style <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very chill and strategic games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "beautiful art and damn good game play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Normal Gatcha Tactics game.\r\n\r\nPros: Characters are felt to be unique and making your team requires a bit of thinking.\r\nWeapons, gear, materials can mostly be grinded for and there is an auto or sweep function to make it quick.\r\ndifficulty is balanced and the level cap seems accurate.\r\n\r\nCons: Drop rate for good characters is rather low and getting currency is hard to do summons.\r\nToo many currencies, the shop has about 10 different things you can use to buy the same stuff. would be alot better if it had 1 paid and non paid currency for all the items to avoid confusion.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game if you like tactics based  games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would crack that cat\nEdit: YOU CAN NAME IT :smiling_imp:\nEdit 2: she reminds me of Rin from LB",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and laid back",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game  remind me of final fantasy tactics",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "it seemed like the perfect alternative to paying an insane price tag for some certain kind of remake - it is not.\nit is a fricken gacha mobile game.\n\n- always-on policy with social logins (but not a single bit of multiplayer or social features)\n- all the usual gacha poison\n   - lootbox system\n   - ingame shop (well, that one was mentioned, but I didn't know it would be ALL the usual GACHA stuff)\n   - uncountable \"collectible rewards\"\n   - rewards being their several frickin currency\n \nwhen it threw me into the usual mobile gacha \"main screen\" after the tutorial, I just had to quit. \n\nI couldn't word it better than T O M O said it:\n\"What makes this worse is how much Sword of Convallaria wastes your time. Repetitive grinding, recycled missions, and shallow events make even the combat feel like a chore. You can feel the monetization loop taking priority over pacing, exploration, or creativity.\"\n\nI already have \"chores\" and get exploited at my full-time job - thanks, you guys, for this piece of gaming cancer.\n\nthe art style is pretty nice, but unfortunately you decided you want to be drug dealers and gambling scammers instead of game devs.\n\n---\n\nto people cheering about \"being able to purchase\" characters with some \"easily earned in-game currency\": you should play the Suikoden series.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "A Hollow Echo of Better Tactics Games\n\nSword of Convallaria tries to channel the spirit of classic tactical RPGs, but it quickly becomes clear that the game does not respect your time. Beneath its polished visuals and nostalgic presentation lies a hollow experience driven more by monetization than genuine design passion.\n\nThe characters feel lifeless. Many of them appear to be generated or assisted by AI tools like Midjourney, which explains why they look detailed but lifeless, missing the spark that makes tactical RPG Anime casts memorable. There is no emotional depth, no lasting connection, just templated voices and predictable arcs.\n\nThe gacha system is another misstep. Pull rates are punishing, progression is slow, and the design heavily pushes you toward spending. It feels like the developers treat players as resources to extract instead of fans to engage.\n\nWhat makes this worse is how much Sword of Convallaria wastes your time. Repetitive grinding, recycled missions, and shallow events make even the combat feel like a chore. You can feel the monetization loop taking priority over pacing, exploration, or creativity.\n\nThere are far better tactical games out there, ones that actually value your effort and time investment. Sword of Convallaria may look the part, but it is an empty imitation of the genre it tries to honor.\n\nVerdict: A stylish shell with no soul. Skip it.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "I’ve been a Steam user for 12 years in this account, had played many RPGs, tatical RPGs, some gachas, ps1, SNES, many many games, on my ancestors like atary, msdos and many others, and I rarely write reviews, but my experience with Sword of Convallaria needs to be documented. The game itself is beautiful, with excellent tactical gameplay and strong artistic direction. However, my overall experience has been severely damaged by two major issues that directly affected my account, progression, and trust in the developers.\n\n1. Ambiguous Dual Banner (Taair & Caris)\nThe dual banner presentation was unclear and ambiguous about the pull rates and guarantees. Based on the description, I made decisions that turned out to be misleading once I used my resources. I provided screenshots, dates, and proof, but support offered nothing beyond generic responses. No compensation, no clarification.\n\n2. Incorrect Description of a Rare, High-Value Item\nThe “Astral Forge Treasury,” an extremely rare item that does not appear in the shop and shows up only occasionally, had an incorrect description.\nThe text suggested a cost of 1 instead of 15, and its rewards implied something close to 15 Astral Gear or 200 Astral Shards, but I received only 1 Astral Gear. Support admitted the description was wrong, yet still claimed no compensation exists, even though the error came from their side.\n\n3. Lack of Care for New Players and the Game’s Economy\nBoth problems happened within a short period, and both had real impact on my progression. Still, the support team responded with copy-pasted apologies and no real solutions. For a gacha game that involves real-money purchases, transparency and accuracy are essential. These errors and the lack of proper follow-up seriously damage player trust.\n\nFinal Verdict\nSword of Convallaria has incredible potential, but the lack of clarity, inaccurate descriptions, and ineffective support make it very hard to recommend right now. A game that relies on trust cannot afford mistakes like these.\n\nIf the developers fix these issues and improve communication, I’ll gladly update my review. Until then, I hope this helps other players understand what they might encounter.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "You will reach endgame and discover that there is zero content to do, except the occasional limited buggy release with months between them like Tower of Adversity. I can auto everything else in the game with half a built team, so it begs the question why am I playing just to watch numbers go up when I could play any other idle game to do so?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Was a Great Game but Lost me to collabs / forced mechanics for certain units good luck summoners,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dear Voyagers,\n\nAs stated in the in-game Fixes & Issues notice, our team is aware of the current ToA bug and has already prepared a fix.\nHowever, applying the fix right now may affect fairness for both players who have already completed the bug-related stages and those who have not. To ensure a consistent and fair experience for everyone, the fix will be implemented after this ToA ends.\n\nWe will provide the fix schedule and additional details in future announcements, so please stay tuned.\n\nThank you very much for your understanding and patience!\n\n\n--stupidest game announcement i've ever seen in my entire live service gaming life. imagine being aware of a bug and not fixing it then say you're going to implement the fix when it doesn't even matter anymore. before this, they also had a literal game breaking bug in the same event - so game breaking that people were holding off doing this time-limited event because they were going to get soft locked inside the stage and wouldn't be able to do anything else. took them DAYS to fix it. they make it sound like they're concerned for 'fairness' when its just childish glorification of who finished the event WITH the bug and not think that these same people would want to optimize strategies without it. fuck these devs, they do NOT respect their playerbase and most definitely, their time. people waited for a fix and an announcement about it only to say, \"we know theres a bug and we have a fix but we are not going to do anything about it anyway haha\" ITS SO BAD.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Scam game. Free Witcher collab was a lie. You have to pay to play with OP characters from The Witcher universe. Click bait game. I am going to remove from my account",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Its a pixel art GACHA game. If thats not your thing then dont bother installing. Too bad since it looked kinda fun at the beginning.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game will not work on the steam launcher, had to install from their site. This game still won't install. Literally stuck on updating assets.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bullshit taiwain handmedown FFT, F2p/P2P/P2W/omgwtfbbq . Extreme malware levels of gacha cancer everywhere. First of all, this game is just Brown Dust, if you ever played that. It's Brown Dust by the same company, who cant even put a volume adjustere in their \"pc app\" . All they did was finish the tactics battle system, strip out some of the surface \"koreanism\" and called it a new game. At it's heart its still just Brown Dust, or maybe the sequel, The Shit That Came Out.\nI've never played a game so stupid and pointless. Holy mother of god the rates on everything are abysmal.\n\nIf youre a huge weeb and just have some mental deficiency which causes you to play this, you must make sure you reroll for at least a week, to get the uber SSS++ which will be obsolete in 2 months, or else it's not even worth playing because they havent inventeded math and balance yet. I am dead serious, you are wasting your time playing with a subpar \"unlucky\" account, this game is not fun and its not meant to be played. Its meant to bring them money and you will find RIGGED battles where you cant win if you didnt pay or if you dont have \"premium, $$$ only units\" no matter how much you grinded aka \"had fun\" \n\nOnce you get to nitpicking, there is just so many things wrong and its so weird and alien. From bad pixel graphics in 2026 when NO ONE owns a CRT monitor. To incomprehensible UI which needs a companion GPS app to navigate. The game itself is so stupid and shallow, like POE. Just get the uber character and one shot everything on the screen on AUTO, no real \"game\" per se. Just pure mindless farm. And you get the PRIVILEDGE of \"farming\" the character shards for 3 fuckin months tg093e4tas34;lerjf;lasdjfjklsdgsd 3 fuckin months before you can play a character you PAID FOR or rerolled for a week for. This is a fucking joke. Please kill this cursed genre for retards. I was celebrating when WotV announced end of service, I was hoping the world moved on. But no, here comes Brown Dust 3 to the rescue of the worst genre with the most brown-most entry yet. You have got to be kidding me. When will this become illegal?\n\nOn day 3 of log in you get a \"free legendary\" literally a character which does no damage even in basic story, and they NAMED HIM FECAL. Are you KIDDING ME?! This is how much they care about \"players\" and dont want to see you again if you dont bring them money. Could care less about the game they made cause they named it \"Piece of Shit, Toilet App\".\n\nAfter 3 months of grinding 1 character, you will simply learn (SPOILER) that the game is actually A POPULAR HARDCORE PVP ESPORT in Korea or Taiwain etc so of course you are wasting your time even playing it and 3 months will amount to nothing when a new character is realease which is a copy paste of your character with slightly higher stats (they are all identical.) There is truly no redeeming this type of game. \n\nBeware of this mobile phonegame scam disguised as a \"game\" or \"game as service\" on steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gacha Salty as F***. Less Contain for Grinding. No Update SoC and FJ for long. No Story act for New Characters.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game won't start stuck at from=steam server=us-prod loop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A beautiful looking and sounding game that does everything in its power to not let you play it. There are so many excessive menu's and pop-ups all the time. You think any of those would be for playing the branching story mode, like a Tactics Ogre game, but no, they all open different kind of shop windows, and it is just disheartening. \n\nIf the top steam guide for the game starts off with how to open multiple phone emulators to get simultaneous rerolls going to get a good starting team, what have you even made?\n\nI feel like this could have been a lovely IP on its own, that people could enjoy and bond over, and then later have its Gatcha exploitation phase, like Squire Enix has done with some Final Fantasy things. Problem is, you need to make something people like first as well. \n\nI tried this again a few months later, and it is a chore to even try to find how to play the next story mission. Locked behind gatcha daily farmable currency-gated. This is not for me, and I think it should be for no-one.",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "This game has a lot going wrong so lets start\n1: It's a blatant mobile game, no effort was made for the game to even look good for PC, even touch feedback on screen was left on.\n2. Startup menu has UNCAPPED FPS and god's willing it will reach thousands, so watch out to not burn your GPU.\n3. It's a gacha and a very predatory one with :\n- 4 Banners to start\n- A weapon Banner\n- Soft Pity is at 100 Summons ( 100 Summons is 99.99$ ) [50/50 to get the banner hero or a random one]\n- Hard Pity is at 180 Summons that guarantees the featured hero\n- There is a banner with two featured heroes, so even on hard pity you might not get both heroes.\n- A system for dupe heroes that goes up to 5 stars and requires god knows how many dupes to get maxed (The game doesn't tell how many dupes only how many for the next star).\n- A million different currencies to confuse the player\n- A double time gate, one for the grind part of the game (Energy based) and other for the actual story (Consumable key based).\n- Keys to use on story mode actually disappear if you don't use them.\n- Only two of said key per week.\n- Leveling your account will not give you more energy\n- Full energy refill takes almost a full day.\n4. Combat is as simplistic as it gets, paper rock scissors type and the biggest enemy is the terrain, as enemies will be behind the isometry and good luck trying to find the magic pixel to click.\n5. Plot : It's just some time travel shenanigans, go change the horrible past and such.\n6. And to close it off, there's already TWO paid battle passes AND A SURVEY that's just a google docs.\nConclusion: Avoid this game like the plague.",
      "voted_up": false,
      "votes_helpful": 104
    },
    {
      "review": "it seemed like the perfect alternative to paying an insane price tag for some certain kind of remake - it is not.\nit is a fricken gacha mobile game.\n\n- always-on policy with social logins (but not a single bit of multiplayer or social features)\n- all the usual gacha poison\n   - lootbox system\n   - ingame shop (well, that one was mentioned, but I didn't know it would be ALL the usual GACHA stuff)\n   - uncountable \"collectible rewards\"\n   - rewards being their several frickin currency\n \nwhen it threw me into the usual mobile gacha \"main screen\" after the tutorial, I just had to quit. \n\nI couldn't word it better than T O M O said it:\n\"What makes this worse is how much Sword of Convallaria wastes your time. Repetitive grinding, recycled missions, and shallow events make even the combat feel like a chore. You can feel the monetization loop taking priority over pacing, exploration, or creativity.\"\n\nI already have \"chores\" and get exploited at my full-time job - thanks, you guys, for this piece of gaming cancer.\n\nthe art style is pretty nice, but unfortunately you decided you want to be drug dealers and gambling scammers instead of game devs.\n\n---\n\nto people cheering about \"being able to purchase\" characters with some \"easily earned in-game currency\": you should play the Suikoden series.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "It is a beautiful game. If it weren't for the money pit gatcha system asking hundreds of dollars for practically nothing I would still be playing.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "A Hollow Echo of Better Tactics Games\n\nSword of Convallaria tries to channel the spirit of classic tactical RPGs, but it quickly becomes clear that the game does not respect your time. Beneath its polished visuals and nostalgic presentation lies a hollow experience driven more by monetization than genuine design passion.\n\nThe characters feel lifeless. Many of them appear to be generated or assisted by AI tools like Midjourney, which explains why they look detailed but lifeless, missing the spark that makes tactical RPG Anime casts memorable. There is no emotional depth, no lasting connection, just templated voices and predictable arcs.\n\nThe gacha system is another misstep. Pull rates are punishing, progression is slow, and the design heavily pushes you toward spending. It feels like the developers treat players as resources to extract instead of fans to engage.\n\nWhat makes this worse is how much Sword of Convallaria wastes your time. Repetitive grinding, recycled missions, and shallow events make even the combat feel like a chore. You can feel the monetization loop taking priority over pacing, exploration, or creativity.\n\nThere are far better tactical games out there, ones that actually value your effort and time investment. Sword of Convallaria may look the part, but it is an empty imitation of the genre it tries to honor.\n\nVerdict: A stylish shell with no soul. Skip it.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "Cash grab gacha game.\n\nWould have had potential if it was a single player game like Triangle strategy.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Nice visuals, but...\n\nFirst thing that i want to see in game...\nIt's not story. It's not battles. It's not gacha.\nIt's SETTINGS.\nAnd in settings (you can see them at last after unskippable story~tutorial) there are only two options for UI: mobile and console. No PC. That means for example inverted mouse-scroll zoom (no option to make it normal) and non-PC controls for movement. For me that was enough to drop.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Dear Voyagers,\n\nAs stated in the in-game Fixes & Issues notice, our team is aware of the current ToA bug and has already prepared a fix.\nHowever, applying the fix right now may affect fairness for both players who have already completed the bug-related stages and those who have not. To ensure a consistent and fair experience for everyone, the fix will be implemented after this ToA ends.\n\nWe will provide the fix schedule and additional details in future announcements, so please stay tuned.\n\nThank you very much for your understanding and patience!\n\n\n--stupidest game announcement i've ever seen in my entire live service gaming life. imagine being aware of a bug and not fixing it then say you're going to implement the fix when it doesn't even matter anymore. before this, they also had a literal game breaking bug in the same event - so game breaking that people were holding off doing this time-limited event because they were going to get soft locked inside the stage and wouldn't be able to do anything else. took them DAYS to fix it. they make it sound like they're concerned for 'fairness' when its just childish glorification of who finished the event WITH the bug and not think that these same people would want to optimize strategies without it. fuck these devs, they do NOT respect their playerbase and most definitely, their time. people waited for a fix and an announcement about it only to say, \"we know theres a bug and we have a fix but we are not going to do anything about it anyway haha\" ITS SO BAD.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I’ve been a Steam user for 12 years in this account, had played many RPGs, tatical RPGs, some gachas, ps1, SNES, many many games, on my ancestors like atary, msdos and many others, and I rarely write reviews, but my experience with Sword of Convallaria needs to be documented. The game itself is beautiful, with excellent tactical gameplay and strong artistic direction. However, my overall experience has been severely damaged by two major issues that directly affected my account, progression, and trust in the developers.\n\n1. Ambiguous Dual Banner (Taair & Caris)\nThe dual banner presentation was unclear and ambiguous about the pull rates and guarantees. Based on the description, I made decisions that turned out to be misleading once I used my resources. I provided screenshots, dates, and proof, but support offered nothing beyond generic responses. No compensation, no clarification.\n\n2. Incorrect Description of a Rare, High-Value Item\nThe “Astral Forge Treasury,” an extremely rare item that does not appear in the shop and shows up only occasionally, had an incorrect description.\nThe text suggested a cost of 1 instead of 15, and its rewards implied something close to 15 Astral Gear or 200 Astral Shards, but I received only 1 Astral Gear. Support admitted the description was wrong, yet still claimed no compensation exists, even though the error came from their side.\n\n3. Lack of Care for New Players and the Game’s Economy\nBoth problems happened within a short period, and both had real impact on my progression. Still, the support team responded with copy-pasted apologies and no real solutions. For a gacha game that involves real-money purchases, transparency and accuracy are essential. These errors and the lack of proper follow-up seriously damage player trust.\n\nFinal Verdict\nSword of Convallaria has incredible potential, but the lack of clarity, inaccurate descriptions, and ineffective support make it very hard to recommend right now. A game that relies on trust cannot afford mistakes like these.\n\nIf the developers fix these issues and improve communication, I’ll gladly update my review. Until then, I hope this helps other players understand what they might encounter.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was a Great Game but Lost me to collabs / forced mechanics for certain units good luck summoners,",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You will reach endgame and discover that there is zero content to do, except the occasional limited buggy release with months between them like Tower of Adversity. I can auto everything else in the game with half a built team, so it begs the question why am I playing just to watch numbers go up when I could play any other idle game to do so?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "lmao the rate is abysmal ,and also this game has no balance team you pull for the latest champ or you will get rekt , i have to uninstall this dogshit , bye guys hope the game is ESO soon",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Charming pixel art artstyle, good story and fun tactics gameplay. But awful devs who filled the game with FOMO practices, terrible powercreep, and greedyness. Don't play this.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Scam game. Free Witcher collab was a lie. You have to pay to play with OP characters from The Witcher universe. Click bait game. I am going to remove from my account",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Its a pixel art GACHA game. If thats not your thing then dont bother installing. Too bad since it looked kinda fun at the beginning.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bullshit taiwain handmedown FFT, F2p/P2P/P2W/omgwtfbbq . Extreme malware levels of gacha cancer everywhere. First of all, this game is just Brown Dust, if you ever played that. It's Brown Dust by the same company, who cant even put a volume adjustere in their \"pc app\" . All they did was finish the tactics battle system, strip out some of the surface \"koreanism\" and called it a new game. At it's heart its still just Brown Dust, or maybe the sequel, The Shit That Came Out.\nI've never played a game so stupid and pointless. Holy mother of god the rates on everything are abysmal.\n\nIf youre a huge weeb and just have some mental deficiency which causes you to play this, you must make sure you reroll for at least a week, to get the uber SSS++ which will be obsolete in 2 months, or else it's not even worth playing because they havent inventeded math and balance yet. I am dead serious, you are wasting your time playing with a subpar \"unlucky\" account, this game is not fun and its not meant to be played. Its meant to bring them money and you will find RIGGED battles where you cant win if you didnt pay or if you dont have \"premium, $$$ only units\" no matter how much you grinded aka \"had fun\" \n\nOnce you get to nitpicking, there is just so many things wrong and its so weird and alien. From bad pixel graphics in 2026 when NO ONE owns a CRT monitor. To incomprehensible UI which needs a companion GPS app to navigate. The game itself is so stupid and shallow, like POE. Just get the uber character and one shot everything on the screen on AUTO, no real \"game\" per se. Just pure mindless farm. And you get the PRIVILEDGE of \"farming\" the character shards for 3 fuckin months tg093e4tas34;lerjf;lasdjfjklsdgsd 3 fuckin months before you can play a character you PAID FOR or rerolled for a week for. This is a fucking joke. Please kill this cursed genre for retards. I was celebrating when WotV announced end of service, I was hoping the world moved on. But no, here comes Brown Dust 3 to the rescue of the worst genre with the most brown-most entry yet. You have got to be kidding me. When will this become illegal?\n\nOn day 3 of log in you get a \"free legendary\" literally a character which does no damage even in basic story, and they NAMED HIM FECAL. Are you KIDDING ME?! This is how much they care about \"players\" and dont want to see you again if you dont bring them money. Could care less about the game they made cause they named it \"Piece of Shit, Toilet App\".\n\nAfter 3 months of grinding 1 character, you will simply learn (SPOILER) that the game is actually A POPULAR HARDCORE PVP ESPORT in Korea or Taiwain etc so of course you are wasting your time even playing it and 3 months will amount to nothing when a new character is realease which is a copy paste of your character with slightly higher stats (they are all identical.) There is truly no redeeming this type of game. \n\nBeware of this mobile phonegame scam disguised as a \"game\" or \"game as service\" on steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game will not work on the steam launcher, had to install from their site. This game still won't install. Literally stuck on updating assets.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1 hour playing this game and the tutorial was unbearable, insted of just telling you what to do and let you do it, they make you just press the button over and over...\r\nAnd the game \"hub\" is filled with so many adds that you can barely find out what you are suppose to be looking at.\r\nI understand that this is a free game, no problem with they wanting to sell me stuff, but at least make the UX usable insted of making me want to gauge my eyes out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this wanting more final fantasy tactics advance, what I got was Umamusume with rock paper scissors.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Gacha Salty as F***. Less Contain for Grinding. No Update SoC and FJ for long. No Story act for New Characters.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "failed to check launcher version on first launch. garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its mid.\ngood artstyle, story etc.\nI hope this is not a FOMO game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game won't start stuck at from=steam server=us-prod loop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game wont start - cant login!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "update not work !!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mobile game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A beautiful looking and sounding game that does everything in its power to not let you play it. There are so many excessive menu's and pop-ups all the time. You think any of those would be for playing the branching story mode, like a Tactics Ogre game, but no, they all open different kind of shop windows, and it is just disheartening. \n\nIf the top steam guide for the game starts off with how to open multiple phone emulators to get simultaneous rerolls going to get a good starting team, what have you even made?\n\nI feel like this could have been a lovely IP on its own, that people could enjoy and bond over, and then later have its Gatcha exploitation phase, like Squire Enix has done with some Final Fantasy things. Problem is, you need to make something people like first as well. \n\nI tried this again a few months later, and it is a chore to even try to find how to play the next story mission. Locked behind gatcha daily farmable currency-gated. This is not for me, and I think it should be for no-one.",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "This game has a lot going wrong so lets start\n1: It's a blatant mobile game, no effort was made for the game to even look good for PC, even touch feedback on screen was left on.\n2. Startup menu has UNCAPPED FPS and god's willing it will reach thousands, so watch out to not burn your GPU.\n3. It's a gacha and a very predatory one with :\n- 4 Banners to start\n- A weapon Banner\n- Soft Pity is at 100 Summons ( 100 Summons is 99.99$ ) [50/50 to get the banner hero or a random one]\n- Hard Pity is at 180 Summons that guarantees the featured hero\n- There is a banner with two featured heroes, so even on hard pity you might not get both heroes.\n- A system for dupe heroes that goes up to 5 stars and requires god knows how many dupes to get maxed (The game doesn't tell how many dupes only how many for the next star).\n- A million different currencies to confuse the player\n- A double time gate, one for the grind part of the game (Energy based) and other for the actual story (Consumable key based).\n- Keys to use on story mode actually disappear if you don't use them.\n- Only two of said key per week.\n- Leveling your account will not give you more energy\n- Full energy refill takes almost a full day.\n4. Combat is as simplistic as it gets, paper rock scissors type and the biggest enemy is the terrain, as enemies will be behind the isometry and good luck trying to find the magic pixel to click.\n5. Plot : It's just some time travel shenanigans, go change the horrible past and such.\n6. And to close it off, there's already TWO paid battle passes AND A SURVEY that's just a google docs.\nConclusion: Avoid this game like the plague.",
      "voted_up": false,
      "votes_helpful": 104
    },
    {
      "review": "it seemed like the perfect alternative to paying an insane price tag for some certain kind of remake - it is not.\nit is a fricken gacha mobile game.\n\n- always-on policy with social logins (but not a single bit of multiplayer or social features)\n- all the usual gacha poison\n   - lootbox system\n   - ingame shop (well, that one was mentioned, but I didn't know it would be ALL the usual GACHA stuff)\n   - uncountable \"collectible rewards\"\n   - rewards being their several frickin currency\n \nwhen it threw me into the usual mobile gacha \"main screen\" after the tutorial, I just had to quit. \n\nI couldn't word it better than T O M O said it:\n\"What makes this worse is how much Sword of Convallaria wastes your time. Repetitive grinding, recycled missions, and shallow events make even the combat feel like a chore. You can feel the monetization loop taking priority over pacing, exploration, or creativity.\"\n\nI already have \"chores\" and get exploited at my full-time job - thanks, you guys, for this piece of gaming cancer.\n\nthe art style is pretty nice, but unfortunately you decided you want to be drug dealers and gambling scammers instead of game devs.\n\n---\n\nto people cheering about \"being able to purchase\" characters with some \"easily earned in-game currency\": you should play the Suikoden series.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "It is a beautiful game. If it weren't for the money pit gatcha system asking hundreds of dollars for practically nothing I would still be playing.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "A Hollow Echo of Better Tactics Games\n\nSword of Convallaria tries to channel the spirit of classic tactical RPGs, but it quickly becomes clear that the game does not respect your time. Beneath its polished visuals and nostalgic presentation lies a hollow experience driven more by monetization than genuine design passion.\n\nThe characters feel lifeless. Many of them appear to be generated or assisted by AI tools like Midjourney, which explains why they look detailed but lifeless, missing the spark that makes tactical RPG Anime casts memorable. There is no emotional depth, no lasting connection, just templated voices and predictable arcs.\n\nThe gacha system is another misstep. Pull rates are punishing, progression is slow, and the design heavily pushes you toward spending. It feels like the developers treat players as resources to extract instead of fans to engage.\n\nWhat makes this worse is how much Sword of Convallaria wastes your time. Repetitive grinding, recycled missions, and shallow events make even the combat feel like a chore. You can feel the monetization loop taking priority over pacing, exploration, or creativity.\n\nThere are far better tactical games out there, ones that actually value your effort and time investment. Sword of Convallaria may look the part, but it is an empty imitation of the genre it tries to honor.\n\nVerdict: A stylish shell with no soul. Skip it.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "Cash grab gacha game.\n\nWould have had potential if it was a single player game like Triangle strategy.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Nice visuals, but...\n\nFirst thing that i want to see in game...\nIt's not story. It's not battles. It's not gacha.\nIt's SETTINGS.\nAnd in settings (you can see them at last after unskippable story~tutorial) there are only two options for UI: mobile and console. No PC. That means for example inverted mouse-scroll zoom (no option to make it normal) and non-PC controls for movement. For me that was enough to drop.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Dear Voyagers,\n\nAs stated in the in-game Fixes & Issues notice, our team is aware of the current ToA bug and has already prepared a fix.\nHowever, applying the fix right now may affect fairness for both players who have already completed the bug-related stages and those who have not. To ensure a consistent and fair experience for everyone, the fix will be implemented after this ToA ends.\n\nWe will provide the fix schedule and additional details in future announcements, so please stay tuned.\n\nThank you very much for your understanding and patience!\n\n\n--stupidest game announcement i've ever seen in my entire live service gaming life. imagine being aware of a bug and not fixing it then say you're going to implement the fix when it doesn't even matter anymore. before this, they also had a literal game breaking bug in the same event - so game breaking that people were holding off doing this time-limited event because they were going to get soft locked inside the stage and wouldn't be able to do anything else. took them DAYS to fix it. they make it sound like they're concerned for 'fairness' when its just childish glorification of who finished the event WITH the bug and not think that these same people would want to optimize strategies without it. fuck these devs, they do NOT respect their playerbase and most definitely, their time. people waited for a fix and an announcement about it only to say, \"we know theres a bug and we have a fix but we are not going to do anything about it anyway haha\" ITS SO BAD.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I’ve been a Steam user for 12 years in this account, had played many RPGs, tatical RPGs, some gachas, ps1, SNES, many many games, on my ancestors like atary, msdos and many others, and I rarely write reviews, but my experience with Sword of Convallaria needs to be documented. The game itself is beautiful, with excellent tactical gameplay and strong artistic direction. However, my overall experience has been severely damaged by two major issues that directly affected my account, progression, and trust in the developers.\n\n1. Ambiguous Dual Banner (Taair & Caris)\nThe dual banner presentation was unclear and ambiguous about the pull rates and guarantees. Based on the description, I made decisions that turned out to be misleading once I used my resources. I provided screenshots, dates, and proof, but support offered nothing beyond generic responses. No compensation, no clarification.\n\n2. Incorrect Description of a Rare, High-Value Item\nThe “Astral Forge Treasury,” an extremely rare item that does not appear in the shop and shows up only occasionally, had an incorrect description.\nThe text suggested a cost of 1 instead of 15, and its rewards implied something close to 15 Astral Gear or 200 Astral Shards, but I received only 1 Astral Gear. Support admitted the description was wrong, yet still claimed no compensation exists, even though the error came from their side.\n\n3. Lack of Care for New Players and the Game’s Economy\nBoth problems happened within a short period, and both had real impact on my progression. Still, the support team responded with copy-pasted apologies and no real solutions. For a gacha game that involves real-money purchases, transparency and accuracy are essential. These errors and the lack of proper follow-up seriously damage player trust.\n\nFinal Verdict\nSword of Convallaria has incredible potential, but the lack of clarity, inaccurate descriptions, and ineffective support make it very hard to recommend right now. A game that relies on trust cannot afford mistakes like these.\n\nIf the developers fix these issues and improve communication, I’ll gladly update my review. Until then, I hope this helps other players understand what they might encounter.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was a Great Game but Lost me to collabs / forced mechanics for certain units good luck summoners,",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You will reach endgame and discover that there is zero content to do, except the occasional limited buggy release with months between them like Tower of Adversity. I can auto everything else in the game with half a built team, so it begs the question why am I playing just to watch numbers go up when I could play any other idle game to do so?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "lmao the rate is abysmal ,and also this game has no balance team you pull for the latest champ or you will get rekt , i have to uninstall this dogshit , bye guys hope the game is ESO soon",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Charming pixel art artstyle, good story and fun tactics gameplay. But awful devs who filled the game with FOMO practices, terrible powercreep, and greedyness. Don't play this.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Scam game. Free Witcher collab was a lie. You have to pay to play with OP characters from The Witcher universe. Click bait game. I am going to remove from my account",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Its a pixel art GACHA game. If thats not your thing then dont bother installing. Too bad since it looked kinda fun at the beginning.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bullshit taiwain handmedown FFT, F2p/P2P/P2W/omgwtfbbq . Extreme malware levels of gacha cancer everywhere. First of all, this game is just Brown Dust, if you ever played that. It's Brown Dust by the same company, who cant even put a volume adjustere in their \"pc app\" . All they did was finish the tactics battle system, strip out some of the surface \"koreanism\" and called it a new game. At it's heart its still just Brown Dust, or maybe the sequel, The Shit That Came Out.\nI've never played a game so stupid and pointless. Holy mother of god the rates on everything are abysmal.\n\nIf youre a huge weeb and just have some mental deficiency which causes you to play this, you must make sure you reroll for at least a week, to get the uber SSS++ which will be obsolete in 2 months, or else it's not even worth playing because they havent inventeded math and balance yet. I am dead serious, you are wasting your time playing with a subpar \"unlucky\" account, this game is not fun and its not meant to be played. Its meant to bring them money and you will find RIGGED battles where you cant win if you didnt pay or if you dont have \"premium, $$$ only units\" no matter how much you grinded aka \"had fun\" \n\nOnce you get to nitpicking, there is just so many things wrong and its so weird and alien. From bad pixel graphics in 2026 when NO ONE owns a CRT monitor. To incomprehensible UI which needs a companion GPS app to navigate. The game itself is so stupid and shallow, like POE. Just get the uber character and one shot everything on the screen on AUTO, no real \"game\" per se. Just pure mindless farm. And you get the PRIVILEDGE of \"farming\" the character shards for 3 fuckin months tg093e4tas34;lerjf;lasdjfjklsdgsd 3 fuckin months before you can play a character you PAID FOR or rerolled for a week for. This is a fucking joke. Please kill this cursed genre for retards. I was celebrating when WotV announced end of service, I was hoping the world moved on. But no, here comes Brown Dust 3 to the rescue of the worst genre with the most brown-most entry yet. You have got to be kidding me. When will this become illegal?\n\nOn day 3 of log in you get a \"free legendary\" literally a character which does no damage even in basic story, and they NAMED HIM FECAL. Are you KIDDING ME?! This is how much they care about \"players\" and dont want to see you again if you dont bring them money. Could care less about the game they made cause they named it \"Piece of Shit, Toilet App\".\n\nAfter 3 months of grinding 1 character, you will simply learn (SPOILER) that the game is actually A POPULAR HARDCORE PVP ESPORT in Korea or Taiwain etc so of course you are wasting your time even playing it and 3 months will amount to nothing when a new character is realease which is a copy paste of your character with slightly higher stats (they are all identical.) There is truly no redeeming this type of game. \n\nBeware of this mobile phonegame scam disguised as a \"game\" or \"game as service\" on steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game will not work on the steam launcher, had to install from their site. This game still won't install. Literally stuck on updating assets.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1 hour playing this game and the tutorial was unbearable, insted of just telling you what to do and let you do it, they make you just press the button over and over...\r\nAnd the game \"hub\" is filled with so many adds that you can barely find out what you are suppose to be looking at.\r\nI understand that this is a free game, no problem with they wanting to sell me stuff, but at least make the UX usable insted of making me want to gauge my eyes out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this wanting more final fantasy tactics advance, what I got was Umamusume with rock paper scissors.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Gacha Salty as F***. Less Contain for Grinding. No Update SoC and FJ for long. No Story act for New Characters.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "failed to check launcher version on first launch. garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its mid.\ngood artstyle, story etc.\nI hope this is not a FOMO game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game won't start stuck at from=steam server=us-prod loop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game wont start - cant login!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "update not work !!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mobile game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A beautiful looking and sounding game that does everything in its power to not let you play it. There are so many excessive menu's and pop-ups all the time. You think any of those would be for playing the branching story mode, like a Tactics Ogre game, but no, they all open different kind of shop windows, and it is just disheartening. \n\nIf the top steam guide for the game starts off with how to open multiple phone emulators to get simultaneous rerolls going to get a good starting team, what have you even made?\n\nI feel like this could have been a lovely IP on its own, that people could enjoy and bond over, and then later have its Gatcha exploitation phase, like Squire Enix has done with some Final Fantasy things. Problem is, you need to make something people like first as well. \n\nI tried this again a few months later, and it is a chore to even try to find how to play the next story mission. Locked behind gatcha daily farmable currency-gated. This is not for me, and I think it should be for no-one.",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "This game has a lot going wrong so lets start\n1: It's a blatant mobile game, no effort was made for the game to even look good for PC, even touch feedback on screen was left on.\n2. Startup menu has UNCAPPED FPS and god's willing it will reach thousands, so watch out to not burn your GPU.\n3. It's a gacha and a very predatory one with :\n- 4 Banners to start\n- A weapon Banner\n- Soft Pity is at 100 Summons ( 100 Summons is 99.99$ ) [50/50 to get the banner hero or a random one]\n- Hard Pity is at 180 Summons that guarantees the featured hero\n- There is a banner with two featured heroes, so even on hard pity you might not get both heroes.\n- A system for dupe heroes that goes up to 5 stars and requires god knows how many dupes to get maxed (The game doesn't tell how many dupes only how many for the next star).\n- A million different currencies to confuse the player\n- A double time gate, one for the grind part of the game (Energy based) and other for the actual story (Consumable key based).\n- Keys to use on story mode actually disappear if you don't use them.\n- Only two of said key per week.\n- Leveling your account will not give you more energy\n- Full energy refill takes almost a full day.\n4. Combat is as simplistic as it gets, paper rock scissors type and the biggest enemy is the terrain, as enemies will be behind the isometry and good luck trying to find the magic pixel to click.\n5. Plot : It's just some time travel shenanigans, go change the horrible past and such.\n6. And to close it off, there's already TWO paid battle passes AND A SURVEY that's just a google docs.\nConclusion: Avoid this game like the plague.",
      "voted_up": false,
      "votes_helpful": 104
    },
    {
      "review": "it seemed like the perfect alternative to paying an insane price tag for some certain kind of remake - it is not.\nit is a fricken gacha mobile game.\n\n- always-on policy with social logins (but not a single bit of multiplayer or social features)\n- all the usual gacha poison\n   - lootbox system\n   - ingame shop (well, that one was mentioned, but I didn't know it would be ALL the usual GACHA stuff)\n   - uncountable \"collectible rewards\"\n   - rewards being their several frickin currency\n \nwhen it threw me into the usual mobile gacha \"main screen\" after the tutorial, I just had to quit. \n\nI couldn't word it better than T O M O said it:\n\"What makes this worse is how much Sword of Convallaria wastes your time. Repetitive grinding, recycled missions, and shallow events make even the combat feel like a chore. You can feel the monetization loop taking priority over pacing, exploration, or creativity.\"\n\nI already have \"chores\" and get exploited at my full-time job - thanks, you guys, for this piece of gaming cancer.\n\nthe art style is pretty nice, but unfortunately you decided you want to be drug dealers and gambling scammers instead of game devs.\n\n---\n\nto people cheering about \"being able to purchase\" characters with some \"easily earned in-game currency\": you should play the Suikoden series.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "It is a beautiful game. If it weren't for the money pit gatcha system asking hundreds of dollars for practically nothing I would still be playing.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "A Hollow Echo of Better Tactics Games\n\nSword of Convallaria tries to channel the spirit of classic tactical RPGs, but it quickly becomes clear that the game does not respect your time. Beneath its polished visuals and nostalgic presentation lies a hollow experience driven more by monetization than genuine design passion.\n\nThe characters feel lifeless. Many of them appear to be generated or assisted by AI tools like Midjourney, which explains why they look detailed but lifeless, missing the spark that makes tactical RPG Anime casts memorable. There is no emotional depth, no lasting connection, just templated voices and predictable arcs.\n\nThe gacha system is another misstep. Pull rates are punishing, progression is slow, and the design heavily pushes you toward spending. It feels like the developers treat players as resources to extract instead of fans to engage.\n\nWhat makes this worse is how much Sword of Convallaria wastes your time. Repetitive grinding, recycled missions, and shallow events make even the combat feel like a chore. You can feel the monetization loop taking priority over pacing, exploration, or creativity.\n\nThere are far better tactical games out there, ones that actually value your effort and time investment. Sword of Convallaria may look the part, but it is an empty imitation of the genre it tries to honor.\n\nVerdict: A stylish shell with no soul. Skip it.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "Cash grab gacha game.\n\nWould have had potential if it was a single player game like Triangle strategy.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Nice visuals, but...\n\nFirst thing that i want to see in game...\nIt's not story. It's not battles. It's not gacha.\nIt's SETTINGS.\nAnd in settings (you can see them at last after unskippable story~tutorial) there are only two options for UI: mobile and console. No PC. That means for example inverted mouse-scroll zoom (no option to make it normal) and non-PC controls for movement. For me that was enough to drop.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Dear Voyagers,\n\nAs stated in the in-game Fixes & Issues notice, our team is aware of the current ToA bug and has already prepared a fix.\nHowever, applying the fix right now may affect fairness for both players who have already completed the bug-related stages and those who have not. To ensure a consistent and fair experience for everyone, the fix will be implemented after this ToA ends.\n\nWe will provide the fix schedule and additional details in future announcements, so please stay tuned.\n\nThank you very much for your understanding and patience!\n\n\n--stupidest game announcement i've ever seen in my entire live service gaming life. imagine being aware of a bug and not fixing it then say you're going to implement the fix when it doesn't even matter anymore. before this, they also had a literal game breaking bug in the same event - so game breaking that people were holding off doing this time-limited event because they were going to get soft locked inside the stage and wouldn't be able to do anything else. took them DAYS to fix it. they make it sound like they're concerned for 'fairness' when its just childish glorification of who finished the event WITH the bug and not think that these same people would want to optimize strategies without it. fuck these devs, they do NOT respect their playerbase and most definitely, their time. people waited for a fix and an announcement about it only to say, \"we know theres a bug and we have a fix but we are not going to do anything about it anyway haha\" ITS SO BAD.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I’ve been a Steam user for 12 years in this account, had played many RPGs, tatical RPGs, some gachas, ps1, SNES, many many games, on my ancestors like atary, msdos and many others, and I rarely write reviews, but my experience with Sword of Convallaria needs to be documented. The game itself is beautiful, with excellent tactical gameplay and strong artistic direction. However, my overall experience has been severely damaged by two major issues that directly affected my account, progression, and trust in the developers.\n\n1. Ambiguous Dual Banner (Taair & Caris)\nThe dual banner presentation was unclear and ambiguous about the pull rates and guarantees. Based on the description, I made decisions that turned out to be misleading once I used my resources. I provided screenshots, dates, and proof, but support offered nothing beyond generic responses. No compensation, no clarification.\n\n2. Incorrect Description of a Rare, High-Value Item\nThe “Astral Forge Treasury,” an extremely rare item that does not appear in the shop and shows up only occasionally, had an incorrect description.\nThe text suggested a cost of 1 instead of 15, and its rewards implied something close to 15 Astral Gear or 200 Astral Shards, but I received only 1 Astral Gear. Support admitted the description was wrong, yet still claimed no compensation exists, even though the error came from their side.\n\n3. Lack of Care for New Players and the Game’s Economy\nBoth problems happened within a short period, and both had real impact on my progression. Still, the support team responded with copy-pasted apologies and no real solutions. For a gacha game that involves real-money purchases, transparency and accuracy are essential. These errors and the lack of proper follow-up seriously damage player trust.\n\nFinal Verdict\nSword of Convallaria has incredible potential, but the lack of clarity, inaccurate descriptions, and ineffective support make it very hard to recommend right now. A game that relies on trust cannot afford mistakes like these.\n\nIf the developers fix these issues and improve communication, I’ll gladly update my review. Until then, I hope this helps other players understand what they might encounter.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was a Great Game but Lost me to collabs / forced mechanics for certain units good luck summoners,",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You will reach endgame and discover that there is zero content to do, except the occasional limited buggy release with months between them like Tower of Adversity. I can auto everything else in the game with half a built team, so it begs the question why am I playing just to watch numbers go up when I could play any other idle game to do so?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "lmao the rate is abysmal ,and also this game has no balance team you pull for the latest champ or you will get rekt , i have to uninstall this dogshit , bye guys hope the game is ESO soon",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Charming pixel art artstyle, good story and fun tactics gameplay. But awful devs who filled the game with FOMO practices, terrible powercreep, and greedyness. Don't play this.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Scam game. Free Witcher collab was a lie. You have to pay to play with OP characters from The Witcher universe. Click bait game. I am going to remove from my account",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Its a pixel art GACHA game. If thats not your thing then dont bother installing. Too bad since it looked kinda fun at the beginning.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bullshit taiwain handmedown FFT, F2p/P2P/P2W/omgwtfbbq . Extreme malware levels of gacha cancer everywhere. First of all, this game is just Brown Dust, if you ever played that. It's Brown Dust by the same company, who cant even put a volume adjustere in their \"pc app\" . All they did was finish the tactics battle system, strip out some of the surface \"koreanism\" and called it a new game. At it's heart its still just Brown Dust, or maybe the sequel, The Shit That Came Out.\nI've never played a game so stupid and pointless. Holy mother of god the rates on everything are abysmal.\n\nIf youre a huge weeb and just have some mental deficiency which causes you to play this, you must make sure you reroll for at least a week, to get the uber SSS++ which will be obsolete in 2 months, or else it's not even worth playing because they havent inventeded math and balance yet. I am dead serious, you are wasting your time playing with a subpar \"unlucky\" account, this game is not fun and its not meant to be played. Its meant to bring them money and you will find RIGGED battles where you cant win if you didnt pay or if you dont have \"premium, $$$ only units\" no matter how much you grinded aka \"had fun\" \n\nOnce you get to nitpicking, there is just so many things wrong and its so weird and alien. From bad pixel graphics in 2026 when NO ONE owns a CRT monitor. To incomprehensible UI which needs a companion GPS app to navigate. The game itself is so stupid and shallow, like POE. Just get the uber character and one shot everything on the screen on AUTO, no real \"game\" per se. Just pure mindless farm. And you get the PRIVILEDGE of \"farming\" the character shards for 3 fuckin months tg093e4tas34;lerjf;lasdjfjklsdgsd 3 fuckin months before you can play a character you PAID FOR or rerolled for a week for. This is a fucking joke. Please kill this cursed genre for retards. I was celebrating when WotV announced end of service, I was hoping the world moved on. But no, here comes Brown Dust 3 to the rescue of the worst genre with the most brown-most entry yet. You have got to be kidding me. When will this become illegal?\n\nOn day 3 of log in you get a \"free legendary\" literally a character which does no damage even in basic story, and they NAMED HIM FECAL. Are you KIDDING ME?! This is how much they care about \"players\" and dont want to see you again if you dont bring them money. Could care less about the game they made cause they named it \"Piece of Shit, Toilet App\".\n\nAfter 3 months of grinding 1 character, you will simply learn (SPOILER) that the game is actually A POPULAR HARDCORE PVP ESPORT in Korea or Taiwain etc so of course you are wasting your time even playing it and 3 months will amount to nothing when a new character is realease which is a copy paste of your character with slightly higher stats (they are all identical.) There is truly no redeeming this type of game. \n\nBeware of this mobile phonegame scam disguised as a \"game\" or \"game as service\" on steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game will not work on the steam launcher, had to install from their site. This game still won't install. Literally stuck on updating assets.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1 hour playing this game and the tutorial was unbearable, insted of just telling you what to do and let you do it, they make you just press the button over and over...\r\nAnd the game \"hub\" is filled with so many adds that you can barely find out what you are suppose to be looking at.\r\nI understand that this is a free game, no problem with they wanting to sell me stuff, but at least make the UX usable insted of making me want to gauge my eyes out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this wanting more final fantasy tactics advance, what I got was Umamusume with rock paper scissors.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Gacha Salty as F***. Less Contain for Grinding. No Update SoC and FJ for long. No Story act for New Characters.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "failed to check launcher version on first launch. garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its mid.\ngood artstyle, story etc.\nI hope this is not a FOMO game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game won't start stuck at from=steam server=us-prod loop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game wont start - cant login!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "update not work !!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mobile game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A beautiful looking and sounding game that does everything in its power to not let you play it. There are so many excessive menu's and pop-ups all the time. You think any of those would be for playing the branching story mode, like a Tactics Ogre game, but no, they all open different kind of shop windows, and it is just disheartening. \n\nIf the top steam guide for the game starts off with how to open multiple phone emulators to get simultaneous rerolls going to get a good starting team, what have you even made?\n\nI feel like this could have been a lovely IP on its own, that people could enjoy and bond over, and then later have its Gatcha exploitation phase, like Squire Enix has done with some Final Fantasy things. Problem is, you need to make something people like first as well. \n\nI tried this again a few months later, and it is a chore to even try to find how to play the next story mission. Locked behind gatcha daily farmable currency-gated. This is not for me, and I think it should be for no-one.",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "This game has a lot going wrong so lets start\n1: It's a blatant mobile game, no effort was made for the game to even look good for PC, even touch feedback on screen was left on.\n2. Startup menu has UNCAPPED FPS and god's willing it will reach thousands, so watch out to not burn your GPU.\n3. It's a gacha and a very predatory one with :\n- 4 Banners to start\n- A weapon Banner\n- Soft Pity is at 100 Summons ( 100 Summons is 99.99$ ) [50/50 to get the banner hero or a random one]\n- Hard Pity is at 180 Summons that guarantees the featured hero\n- There is a banner with two featured heroes, so even on hard pity you might not get both heroes.\n- A system for dupe heroes that goes up to 5 stars and requires god knows how many dupes to get maxed (The game doesn't tell how many dupes only how many for the next star).\n- A million different currencies to confuse the player\n- A double time gate, one for the grind part of the game (Energy based) and other for the actual story (Consumable key based).\n- Keys to use on story mode actually disappear if you don't use them.\n- Only two of said key per week.\n- Leveling your account will not give you more energy\n- Full energy refill takes almost a full day.\n4. Combat is as simplistic as it gets, paper rock scissors type and the biggest enemy is the terrain, as enemies will be behind the isometry and good luck trying to find the magic pixel to click.\n5. Plot : It's just some time travel shenanigans, go change the horrible past and such.\n6. And to close it off, there's already TWO paid battle passes AND A SURVEY that's just a google docs.\nConclusion: Avoid this game like the plague.",
      "voted_up": false,
      "votes_helpful": 104
    },
    {
      "review": "it seemed like the perfect alternative to paying an insane price tag for some certain kind of remake - it is not.\nit is a fricken gacha mobile game.\n\n- always-on policy with social logins (but not a single bit of multiplayer or social features)\n- all the usual gacha poison\n   - lootbox system\n   - ingame shop (well, that one was mentioned, but I didn't know it would be ALL the usual GACHA stuff)\n   - uncountable \"collectible rewards\"\n   - rewards being their several frickin currency\n \nwhen it threw me into the usual mobile gacha \"main screen\" after the tutorial, I just had to quit. \n\nI couldn't word it better than T O M O said it:\n\"What makes this worse is how much Sword of Convallaria wastes your time. Repetitive grinding, recycled missions, and shallow events make even the combat feel like a chore. You can feel the monetization loop taking priority over pacing, exploration, or creativity.\"\n\nI already have \"chores\" and get exploited at my full-time job - thanks, you guys, for this piece of gaming cancer.\n\nthe art style is pretty nice, but unfortunately you decided you want to be drug dealers and gambling scammers instead of game devs.\n\n---\n\nto people cheering about \"being able to purchase\" characters with some \"easily earned in-game currency\": you should play the Suikoden series.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "It is a beautiful game. If it weren't for the money pit gatcha system asking hundreds of dollars for practically nothing I would still be playing.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "A Hollow Echo of Better Tactics Games\n\nSword of Convallaria tries to channel the spirit of classic tactical RPGs, but it quickly becomes clear that the game does not respect your time. Beneath its polished visuals and nostalgic presentation lies a hollow experience driven more by monetization than genuine design passion.\n\nThe characters feel lifeless. Many of them appear to be generated or assisted by AI tools like Midjourney, which explains why they look detailed but lifeless, missing the spark that makes tactical RPG Anime casts memorable. There is no emotional depth, no lasting connection, just templated voices and predictable arcs.\n\nThe gacha system is another misstep. Pull rates are punishing, progression is slow, and the design heavily pushes you toward spending. It feels like the developers treat players as resources to extract instead of fans to engage.\n\nWhat makes this worse is how much Sword of Convallaria wastes your time. Repetitive grinding, recycled missions, and shallow events make even the combat feel like a chore. You can feel the monetization loop taking priority over pacing, exploration, or creativity.\n\nThere are far better tactical games out there, ones that actually value your effort and time investment. Sword of Convallaria may look the part, but it is an empty imitation of the genre it tries to honor.\n\nVerdict: A stylish shell with no soul. Skip it.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "Cash grab gacha game.\n\nWould have had potential if it was a single player game like Triangle strategy.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Nice visuals, but...\n\nFirst thing that i want to see in game...\nIt's not story. It's not battles. It's not gacha.\nIt's SETTINGS.\nAnd in settings (you can see them at last after unskippable story~tutorial) there are only two options for UI: mobile and console. No PC. That means for example inverted mouse-scroll zoom (no option to make it normal) and non-PC controls for movement. For me that was enough to drop.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Dear Voyagers,\n\nAs stated in the in-game Fixes & Issues notice, our team is aware of the current ToA bug and has already prepared a fix.\nHowever, applying the fix right now may affect fairness for both players who have already completed the bug-related stages and those who have not. To ensure a consistent and fair experience for everyone, the fix will be implemented after this ToA ends.\n\nWe will provide the fix schedule and additional details in future announcements, so please stay tuned.\n\nThank you very much for your understanding and patience!\n\n\n--stupidest game announcement i've ever seen in my entire live service gaming life. imagine being aware of a bug and not fixing it then say you're going to implement the fix when it doesn't even matter anymore. before this, they also had a literal game breaking bug in the same event - so game breaking that people were holding off doing this time-limited event because they were going to get soft locked inside the stage and wouldn't be able to do anything else. took them DAYS to fix it. they make it sound like they're concerned for 'fairness' when its just childish glorification of who finished the event WITH the bug and not think that these same people would want to optimize strategies without it. fuck these devs, they do NOT respect their playerbase and most definitely, their time. people waited for a fix and an announcement about it only to say, \"we know theres a bug and we have a fix but we are not going to do anything about it anyway haha\" ITS SO BAD.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I’ve been a Steam user for 12 years in this account, had played many RPGs, tatical RPGs, some gachas, ps1, SNES, many many games, on my ancestors like atary, msdos and many others, and I rarely write reviews, but my experience with Sword of Convallaria needs to be documented. The game itself is beautiful, with excellent tactical gameplay and strong artistic direction. However, my overall experience has been severely damaged by two major issues that directly affected my account, progression, and trust in the developers.\n\n1. Ambiguous Dual Banner (Taair & Caris)\nThe dual banner presentation was unclear and ambiguous about the pull rates and guarantees. Based on the description, I made decisions that turned out to be misleading once I used my resources. I provided screenshots, dates, and proof, but support offered nothing beyond generic responses. No compensation, no clarification.\n\n2. Incorrect Description of a Rare, High-Value Item\nThe “Astral Forge Treasury,” an extremely rare item that does not appear in the shop and shows up only occasionally, had an incorrect description.\nThe text suggested a cost of 1 instead of 15, and its rewards implied something close to 15 Astral Gear or 200 Astral Shards, but I received only 1 Astral Gear. Support admitted the description was wrong, yet still claimed no compensation exists, even though the error came from their side.\n\n3. Lack of Care for New Players and the Game’s Economy\nBoth problems happened within a short period, and both had real impact on my progression. Still, the support team responded with copy-pasted apologies and no real solutions. For a gacha game that involves real-money purchases, transparency and accuracy are essential. These errors and the lack of proper follow-up seriously damage player trust.\n\nFinal Verdict\nSword of Convallaria has incredible potential, but the lack of clarity, inaccurate descriptions, and ineffective support make it very hard to recommend right now. A game that relies on trust cannot afford mistakes like these.\n\nIf the developers fix these issues and improve communication, I’ll gladly update my review. Until then, I hope this helps other players understand what they might encounter.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was a Great Game but Lost me to collabs / forced mechanics for certain units good luck summoners,",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}