{
  "positive": [
    {
      "review": "worst game ever.\n\nBring trade back and then we put best game ever.",
      "voted_up": true,
      "votes_helpful": 34
    },
    {
      "review": "Sometimes, the cars go so fast and yes then they slow.\n\nPaced very fast, but then it slow.\nExcitement and fun, but then it slow.\nBoost into the one airtime, but then it slow.\n\nHave lot of happiness, but then it slow.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I’ve been playing this since the “early-days-when-no-one-knew-what-the-hell-they-were-doing” era, and somehow I’m still not good enough to justify the years I’ve put into it. One match I’m a mechanical god; the next, I can’t hit a stationary ball if my life depended on it.\n\nBut that’s the charm. It’s the perfect blend of “I hate this game” and “queue up again,” and I keep coming back like I’ve got something to prove. Spoiler: I don’t. But here I am anyway.\n\nWhen it’s good, it’s electric. When it’s bad, it builds character. Either way, it’s been part of my routine for so long that quitting now would feel like abandoning a childhood pet.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Rocket League – Fast, Fun, and Still One of the Best Multiplayer Games Out There\n\nRocket League remains one of the most addictive and downright fun games ever made. The concept alone—soccer with rocket-powered cars—sounds wild, but once you’re boosting across the arena, flying through the air, and pulling off insane saves, it becomes clear why the game has kept such a massive following for years. Every match feels fast, energetic, and packed with memorable moments.\n\nThe soundtrack is fantastic, too. Rocket League has always had a knack for putting together high-energy tracks that perfectly match the speed and intensity of each game. Whether you're grinding ranked matches or warming up in free play, the music keeps the adrenaline flowing.\n\nOne of Rocket League’s greatest strengths is how much you can make the game your own. The amount of car customization is unbelievable—decals, boosts, wheels, goal explosions, toppers, trails, and more. It lets you create a ride that feels uniquely yours, no matter your playstyle.\n\nThere’s also no shortage of ways to play. Standard modes, Rumble, Drop Shot, Hoops, Snow Day, tournaments, casual, competitive—the variety keeps things fresh, especially if you jump between modes with friends. And thanks to full cross-platform play, it’s easier than ever to team up no matter what system everyone’s on. That alone makes Rocket League feel more accessible and community-driven than ever.\n\nIf there’s one downside, it’s that the game was even better before the introduction of season passes. The older progression system felt more straightforward and rewarding. Still, despite the shift toward the seasonal model, the core gameplay remains as tight, thrilling, and endlessly replayable as it’s always been.\n\nOverall, Rocket League is a masterpiece of competitive fun—easy to pick up, tough to master, and packed with personality. Even after all these years, there’s nothing else quite like it.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Game is fun and i like it, but there has to be something done for the very toxic people playing the game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I 100%'d the game with all achievements and \"Grand Champion\":\n\nEpic Games is really starting to piss me off.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun game to play with friends. Can get sweaty if you want, or you can just chill. Used to cost to buy but now free to play is great!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Rocket League might be the most fun I had with a game ever. That be playing solo or with family/friends, I have so many memories with this game, thank you Psyonix <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have played 1927 hours of this game but never bothered reviewing it.\r\n\r\nIt's a great game, it looks simple but is incredibly hard to master. It is fairly toxic in term of community so brace yourselve or mute the chat but beside that it's great fun.\r\n\r\nI will never give any money to Psyonix because they removed trading in the game. I bought this game a long time before it was bought by Epic and I can't believe they can remove full features like that without any warning. I bought RL in a small part because I enjoyed a lot trading items with other players. So f*** Epic and their greed. Don't reward them with microtransactions.\r\n\r\nStill an amazing game very dear to me it just happens to be currently owned by assh*les...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its really competive and fun and make sure you have sportship and good teamembers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rocket League is the game you play when you just got off work. The wife is yelling at you, the kids always want something, but you know what the grind of Rocket League to become GC is one of the most rewarding things you can do. It takes pure dedication. I would always recommend people to play this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever to have landed on earth apart from cheats",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's great but Epic kinda killed most of the fun when they took over. Too much micro-transaction crap, bugs, toxic players. But, still fun to play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game. Spent hours on it. Physics is amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "genuinely do not play this game, its not worth it, worst tm8s oat. tm8s should all just never play again. absolute horrid matchmaking system and every other game you get a bot in your game that somehow still isnt patched yet.. removed trading. everytime i get into a game thinking im going to have a good time i just get a tm8 who rams me at 100 mph and opponents who just brainlessly chase me instead of the ball. game is trash",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is fun! Sometimes it can be a bit toxic, but it’s still a good way to have fun — especially with friends in a custom match.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you're reading this and you don't already have this game...... IDK what to say, i paid money for this before the Epic aquisition....... its amazing. i have friends with over 3K hours.  there will never be another like it. its free now. what are you waiting for?!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great casual game! :) Recommended by millions. Nice and simple E-sports title.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is good until you reach Dimond. Then you will regret the idea of playing this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun to play 3V3 or 2V2 in any field.\r\nI usually listen to music and chill out during the game.\r\nIn game chats are also great.\r\nWould definitely recommend RL for fun and chilling out and making friends online :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "unique game ! feels like playing a real sport, skill is the main component of the game and no one starts out good playing this. you have to earn the wins or get carried lol. The game has lots of creative designs, the mechanics of the game are refreshingly satisfying, the game can be played just for fun or for competition. u can play anyway you want and there are lots of modes.  Negatives is that the game has smurfs ALOT, the game needs a bigger player base and , game needs trading back asap, mmr system needs to be updated because d3 to c2 lobbies are very inconsistent , needs a phone number system to help comp integrity. Overall the game is epic but the way its being handled rn needs some change.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game was great until it was bought out. Servers shit, tournament sign up and penalties due to their own server disconnects, = shit. Do i still clown people quick chatting What a save! ? Yes. 8/10 game. would be 11 if Epic didn't own it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game good, epic dont care about it though. they bought it and just add battlepasses",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, Somewhat toxic. That being said I bought my first copy from a website epic games. I quickly learned that this version was a scam. It was fortnite but with vehicles. ONLY BUY THE STEAM VERSION!!!!!!! The first version from that weird website didnt work!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game feels light, easy to get into, and just a fun romp I enjoyed my time.  Find some friends and just ride around booping the ball all over the field.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "once you get passed the learning curve of flying!!! it becomes a very fun game!! stick with it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is game you'll play forever, but it takes forever to start playing the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After almost ten years I still find myself coming back to this game. Even after all that time they're still adding things. Great game to jam out to music too or play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rocket League can be a super casual game to play with your friends. You'll spend hours laughing and trying your best to hit the ball just to whiff but you keep coming back for more. It is fun for the whole family. \n\nThen you try and get better, and you think you're getting really good at the game. When you get better at Rocket League you realize just how bad you truly are. The skill ceiling is unbelievably high. Watch a few RLCS matches and you will see that there really is no skill ceiling. Players keep getting better with every passing year. \n\nFor me, Rocket League is a 10/10 game. I started playing the game on a free play weekend on Xbox in 2017. I started the game not expecting much. But that weekend with friends was the most fun I've had on a game in a long time. I was instantly hooked. We would talk about Rocket League while at work all day, anxiously waiting to get home to hop on the game and play for hours on end. We organized tournaments with friends at work to determine who was the \"best\" Rocket League player. \n\nAfter several hundred hours on Xbox I made the switch to PC. I fell in love with trading items and improving my rank. The switch to PC instantly improved my performance. I jumped an entire rank just from the increase in frame rate and input delay. I was having a blast with this game. \n\nEpic Games purchased Rocket League and eventually removed trading and turned the game free-to-play. I was disappointed in the removal of item trading, but the change to free-to-play was a welcome one. I had many more friends try the game and enjoy it. The game in its current state is a shell of its former self. I still highly recommend the game to new players. Its worth the time to check it out!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very very very very very very very very very very very very very very very very very very very very very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best game ever made, it combines my two favorite things which is cars and soccer. Blessed be the gods who built this game. It is the strongest drug in the world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay, so after 10 years of playing this game, i just love it, this game is really insane, no buggy, no cheaters, no Macroes, No DDOSERS. Like it's an incredible game. I like it alot !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i recommend this game if you're a good gamer and just want to have some fun\r\ni don't recommend this game if you're a toxic gamer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is purely skill based. No metas, no special loadouts, just pure player skill.  I know, I know. Every game has its cheaters, bots and ddos'ing issues but this isn't about that. It's free now but I'd pay for it again if I had to. GLHF and What a Save!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is good but the DLC characters have an advantage. with some experience in auto battlers you can stomp the game for the most part, but every time a dlc enemy pops up they will win 80% of the time. for obvious reasons",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The time to play on this game is second to none, you can get beat 3-0 and be playing a new game within a minute, a great game-filler if you, like myself & friends, have a few games to play in rotation. Rocket League is always the game to fall back on, very addictive & fun to improve skills.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cars. Soccer. Physics that make no sense but somehow feel perfect. One minute you’re a god, next you miss an open goal and uninstall.\n\n9/10 ⭐ – mechanical skill meets emotional damage.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "car and balls, what better combo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun, great fun game to play! I love dancing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So good, the toxic players is what brings me back",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't explain why cars hitting footballs is fun, but it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun blowing up cars! Cool vehicle combat!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is insane, community is bad ash",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Will cause you physical and emotional pain, highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I still need to learn the maps, but it's a pretty nice game. ;)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like the game, I dislike microtransactions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good one. Great with friends or alone. Grinding or just vibing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very good, the only problem is that you need an EG account to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "makes you feel like car football's lebron james and also simultaneously makes you wanna hang from a tree",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is good but sold cause Psyonix sold to epic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if u blame ur teamates for every loss u should be able to keep ur sanity for a while",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "car hit ball. ball go wooosh. ball go in goal. goal. trashtalk enemies. life gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is very much its own thing. Once you start you cannot stop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is awesome, please play frequently if your into soccer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good to play and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best game of all time, it deserves everything.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The way i keep coming back to this game has gotta be what its like to be a addict",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, bad dev choices",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely worst fucking game ever. man i love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS PEAK!\n\nBut it will also make you question your sanity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Frustratingly fun. Rotate people, rotate!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "shame its owned by epic now but still a fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun casual car-soccer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the worst games i've ever played in my life\n\ni can't stop playing it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "rocket league = no girlfriend\r\nrocket league > girlfriend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not truly sure.. just need a little more time to set up my mind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has the best music out of all the games I've played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only downside is there are no more crates and no trading :/",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i miss when this game was good (ps its fun now, just not like the older game was!)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game needs more sex scenes tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I CANNOT STOP PLAYING! Great game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hardest esport game to get to pro level.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think I can finally pass judgement on this game.\r\n\r\nIt's very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only real sports video game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IF would knew it will be free wouldnt buy it ,,,,,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is so fun hit ssl in 500 hours gg",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "satisfying improvement loop.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best \"sports\" ultiplayer game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game. Highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it makes me wanna kick a fat kid at K-Mart",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game needs to be back on STEAM",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Pretty fun. Pretty fair.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Astonishing game!!!\nwould DEFINITELY RECOMMEND",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun to carry my teammates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good , learn how to hit opens and you will be ssl in no time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game will piss you off... 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Funny car go varoom varoom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W game best comunity",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Games trash.\nRecommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Highest skill ceiling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it takes ages to be any good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Makes me wanna die faster 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Just really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i flip with my car, nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Is fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please fix the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best game ever !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Generational game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after 5k hours i'm still on the fence",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and relaxing game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Trаsh game, trаsh players, trаsh balance, trаsh servers, trаsh policy, trаsh 15 y.o. engine, trаsh physics, trаsh graphics, trаsh trading system, trаsh community, trаsh moderators, trаsh devs, trаsh tim piggy.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Ever since Epic bought Psyonix, the game has only gotten worse. It’s a shame. Epic games is a shitty company.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "No, I'm not creating an Epic account to play a game that used to work without an Epic account.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is a joke now. I’ve been playing Rocket League since 2015, back when Psyonix ran it and it actually felt like a passion project. The moment Epic Games took over, the whole thing started going downhill fast.\n\nFirst, they shove Epic account linking down your throat. If anything goes wrong, you get dumb errors about your account already being linked, progress not syncing, connection issues, all that nonsense. You don’t even feel like you own your damn account anymore – Epic does.\n\nThen they killed trading. One of the best parts of the game – building an inventory, trading with friends, and actually feeling rewarded for grinding – just deleted so it fits their precious item shop system. Whole trading community wiped for “business reasons.” Zero respect for the players who kept this game alive.\n\nThe Blueprint / Item Shop system is pure greed. Prices are ridiculous, everything is overvalued, and it’s obvious they care more about squeezing money out of skins than fixing the game. It doesn’t feel like a fun game with cosmetics anymore; it feels like a store with some outdated gameplay attached.\n\nAnd the actual matches? Trash. Bots everywhere, smurfs every rank, cheaters, and people abusing the report system. You can get banned off spam reports while griefers and toxic clowns keep playing. Ranked doesn’t feel competitive; it just feels rigged and low-effort.\n\nThe servers and ping are embarrassing. Random lag spikes, input delay, hit detection feeling off, and half the time you’re fighting the server more than the other team. For a game this old and this big, it shouldn’t run like some free mobile rip-off.\n\nRocket League under Psyonix felt special. Rocket League under Epic feels like a cash-grab zombie being kept alive just long enough to milk the shop dry. If you’re a new player, you’ll never know how good this game used to be. If you’ve been here since 2015, you know exactly how hard they ruined it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Genuinely, I used to love the game. I knew Epic Games bought it a while ago, and I also know we were still able to play through steam.\n\nI tried logging in today only to realise that I have to log into the Epic Games online services, and connect it to an Epic Games account. Something that in and off itself is annoying, but not something deal breaking. When I realise that I can not connect it to my existing account, because the account I try to connect RL to is already an existing account (of course, I am trying to connect it to something existing), and have to create a new account, I can't deal with it. Especially with how Epic Games runs their company and gaming platform.\n\nSad to say, I can no longer play Rocket League. Shame. It is a really fun game that I wanted to get back into.\nWell, there are plenty of good games, but a childhood favourite will always hold a special place in one's heart.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They're not supporting Linux - Big L for a good game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst online community and money grabbing developers. Was good years ago but now its just bad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Epic Games bought this game a while ago and surprise surprise, it's now a steaming pile of garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has gone downhill. No more trading. Community is toxic as hell. If you aren't up to their satisfaction then you get heckled and harassed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rocket League is the perfect game if you enjoy questioning every life choice that led you to this moment. You’ll queue up thinking, “Hey, maybe this time I’ll have competent teammates,” only to be immediately paired with someone who treats the ball like it’s allergic to their car and they think they’re top-tier while performing like they’re in the tutorial.\n\nYou can spend hundreds of hours mastering mechanics and none of it matters when your teammates triple commit and then they backflip into the ball and own goal for the third time. \"What a Save!\"\n\nThe other team will play like they’re scrimming for the RLCS redirecting passes with pixel-perfect precision while being unranked.\n\nAnd don’t get me started on the ranked system. You win five games in a row? Congrats, +1 MMR. Lose once because someone decided they’re now a freestyler? Boom, -900 MMR and you’re back in Plat with people still trying to figure out how to hit the ball on kickoff. \n\nBut you know what? You’ll keep playing. Because every once in a while, you hit that one clean double-tap and suddenly you believe again. That’s the most toxic part of all — the hope.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So ass! I only ever get blues from the packs ... makes the game unplayable. I need good cosmetics to play well, how else will i ever get to grand champ?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Shit game, fucking epic onlu cares about money and doesnt fix the fucking game, everything above 30 ping is over for you. 0 sense game. retarded company",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Probably one of the most TOXIC games I have ever played. Has the ability to be amazing but the way its managed has made this game VERY TOXIC. People just seem to play this game just to annoy other people and get them banned. Needs a serious look at to reduce the TOXICITY.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dogshit game after epic destroyed it nothing but sweaty little kids fucking snorting gfuel thinking theyre the next squishymuffinz!!!!!!!!! game has lost the ability to be fun anymore!!!!!!!! was an amazing game back when psyonix owned!!!!! servers are trash and these fucks at epic are way to sensitive in a world where you gotta have balls!!!!!! i bet their head of game development thinks theyre a fucking cat or some shit!!!!!!! fix your shitty game please or give it back to psyonix cuz epic is dogshit in every aspect all you care about is what can you colab with next and that aint any shit that we want to begin with atleast on the rocket league side of things!!!!!!!!!! FUCK YOU EPIC!!!!!!!!!!! Have a nice day",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a CIA psychological torture experiment.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't bother unless you have friends that are gamers and want to put thousands of hours into it with you to get anywhere. If you ever solo que a mode, it'll just be you and some bots on your team vs 2/3 stacks of people with 15000 hours on their 15th smurf account. People now start flip resetting in plat+ because the only people left playing this game are smurfs and the company doesn't do anything for the game. No solo q modes, no smurf bans, no UE engine update, no updates at all its pointless. Just let it die.\n\nTLDR If you don't have friends that are willing to put in thousands of hours with you, don't bother anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game went to shit after they took out trading, Bad game, community is awful, cash grab ahh game, stupid ahh game, wouldn't even let my enemies play this game, poopoo game, ew",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ever since EPIC bought the game its absolute trash. Constantly removing features and adding bullshit no one wants or asks for. F2P demolished the game. Only recommend if you just wanna face smurfs every game on shitty servers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't sign in. Launching the game takes me to EPIC's website and then doesn't let me finish setting up my account. Epic are retarded don't get this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Will recommend when I can play the game I own without doxxing myself to Epic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Brain too small for the game. After 50 hours I still suck. I didn't even get slightly better :D",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is bullshit and not at all a skill issue. 90% of it is watching your shots rim out and your opponents shots hitting every corner of the map to ricochet into the center of your goal. The other 10% I don't know what happens because it just disconnects me in the middle of the match. I hate Epic Games, Rocket League, and Fortnite",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved that game before it was taken over by Epic Games. Now im unable to play the game because I'm stuck in a loop of connecting my Steam account to my Epic Games account which just won't work. I'm done!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "save yourself the stress. shi is trash but im addicted like crack. dumb ahh game smh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit\nremoved trading\nstill lets ddosing happen for years\nlet smurfs in to comp for completely free after free to play.\nepic games acquisition.\n\nL Psyonix. This game going downhill was so avoidable yet earned by EG and Psyonix.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A whole lot of toxic players. Don't play this game solo, but play it with some friends. You'll have a blast. Otherwise just don't touch this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cannot sign into my epic account with my email, which Epic has no problem sending to for recovery. I cannot contact support because it does not accept my email address. I have spent 30 minutes doing circles trying to find some way to play the game I bought. This game is absolutely ruined by Epic Games garbage services.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is great but if you are new good luck ranking up.. unless you're like a top 5-10% talent (which 90% of you obviously are not) you better find a friend real quick bc the trolls are all over the place. The trolls will dislike you if you play too well or if you're bad. Cut them off once in 5 min? They will stop playing or starting throwing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fix ur god damn game, only game in where there are more ddossers and bots than player, and cant even fix, this is just unbelievable from a multi-billion dollar company. Spend some money to do something useful for this game instead of care just about Fortnite. Cant even play at tourney just bc its full of ddossers, ddossers who have not been banned after 3 days of playing tournaments. Cmon u cant even ban someone who \"cheats\" on ur fkin game. This game is just dying and u and you don't even tell us. \"We're working on ddos\" i just read on a patch note from months ago, and in November 2025 there are still ddossers who can play normally. The only way is that everyone should have the ddos tool just to beat them or atleast let the server crash, bc is unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "J--em celú túto hru aj s jej prijeba--mi vývojarmi. Všetci by sa mali vy-rať na robenie hier a mali by ísť pracovať do pekla ako hlavní radcovia pre Diabla. Aj z tadiaľ by ich vyhodili kvôli tomu aký su zmrdi",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Epic just ruins games, stop, let me play a game I've paid money for, and trade items I spent time earning",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is the worst game currently on steam, and I mean that. \n\nPsyonix sold to a whale of a company, lost all interest in keeping this game alive as what it was. Now, its F2P, smurfs, toxic community, and chaos. I used to say rocket league was a 10/10. RLCS events, majors, etc was like fire when you truly love this game. \n\nSince it's been taken over by 13 year olds that make 22 accounts, and have the ego of a 6'4\" Prison guard, it's been absolutely trashed, and not even fun to play anymore.\n\n2018? rate: 14/10\n\n2025? rate: 2/10 Only even giving it 2, because the mechanics haven't changed, and some of the original hardcore players still live to make history and contribute to the success of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is only played when nothing good is going on in your life. Its miserable to play, to be apart of the community. 730 hours for nothing. This game only brings pain. Absolute pain..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game and devs who ultimately sold out to lil piggy sweeney. Move on, it's all greed and data harvesting now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very lovely to see epic games doing something about all the ddos and botting in this game, just played 2 games and got 3 bots in both of them",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rocket League's update quality has only worsened since Epic games acquisition. Latest bug that hasn't been fixed in months: Tournaments don't load in unless a game restart occurs. Even that doesn't fix it sometimes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After hitting GC3 for the 3rd time now my opinion STILL doesn't change. Bring back Trading or the game's gonna be dead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Writing a review for something like this is like recommending a local restaurant to your friend that lives across the country. Yeah, you can go to it, but you gotta go somewhere else to enjoy it. \n\nI remember when Rocket League launched, back before it was free to play, I got it free with PS+ back then. I grinded it for hours, got the Platinum trophy even. I really liked it, never anticipated it becoming a huge esport. \n\nNow a days, I can't really see myself playing it anymore. From what I have played, it doesn't feel too different from launch, but I also haven't tried any of its other stuff outside of the usual game mode. (if there even are other modes I don't even know anymore) Even then though, the game just isn't compelling to me anymore and I can't even think of recommending it to friends so why would I recommend it to strangers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i lost to a team of bots in 3v3 ranked so i uninstalled the game and im never gonna play it again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i could never spend more then 100 hours on this game in a lifetime, this is crap. Never enjoyed it, honestly only played it once or twice.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game seriously feels like one of the worst things ever created sometimes. The matchmaking alone is enough to drive you insane, one match you get teammates who can’t hit an open net, and the next you’re up against people who play like they’re in a world championship.  \n\nWhat makes it even worse is how the actual gameplay punishes you for trying to play correctly. You can be the better player in every way, but you still end up losing to people who just mindlessly demo, ball-chase, and fling themselves at every challenge without thinking for even half a second. They don’t rotate, they don’t position, they don’t do anything remotely smart… but somehow it works. And it’s infuriating.\n\nMeanwhile, the moment you try to play with some structure, the game finds a way to screw you over. The ball bounces the worst way possible, your teammate misses the simplest touch on earth, and the opponents get some miracle 50/50 that sends the ball straight into your net. It feels like the game is actively working against you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rocket League is such a fun concept and a really neat way to transfer the \"driving\" controller skill-set into something that isn't just racing on a track. I really had fun playing it and I think it's absolutely worth purchasing for most users -- however...\r\n\r\nSupport for my platform has been discontinued, so I'm no longer able to play online. Playing online is by far the funnest way to play this game - human players are so much better and more interesting to compete against than the bots. It's such a bummer to have been able to play online in the past, but to now not be able to play online.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a stupid ass game that bans you for reporting others and there are tpxoc idiots everywhere mrs u picku materinu jebem vas u usta pshyonix mrs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you into playing with toy cars with 12 year old this is for you. not beginer freindly, you got 10 year olds typing in chat. dont reccomend poor game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ranked play has gone downhill lately. Mostly Plat. and Diamond. I was a Champ and got dragged down to Diamond. The players play so similar you cant even dig yourself out of the grave. Doesn't matter how good you are, You have an extremely low chance of scoring due to the vast playstyle of your opponents.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Best Played:\n[x] Fine to play solo\n[x] Better with Friends\n\nGraphics:\n[] Horrible\n[] Okay\n[] Good\n[x] Great\n\nOptimization:\n[x] Runs well\n[] Check spec requirements\n[] Potato\n\nStory:\n[x] No lore\n[] Very little story\n[] Good story line\n[] Engaging story\n\nPrice vs Value:\n[] Would pay full price\n[] Would only buy if on sale\n[x] Would only buy if huge sale\n[] Would not buy at all\n\nCore Mechanics:\n[] Fun\n[x] Repetitive\n[] Innovative\n[x] Trash\n\nDifficulty:\n[] Easy\n[x] Medium\n[] Hard\n[] Takes real skill\n\nReplayability:\n[] High\n[] Medium\n[] Low\n[x] Wish I could refund this\n\nBugs/Glitches:\n[] Non-existent\n[x] Minor\n[] Major\n[] Game breaking\n\nPlayer Base:\n[x] Active\n[x] Toxic\n[] Dead\n\nVoice Acting:\n[] Cheesy\n[] Memorable\n[] Good\n[x] N/A\n\nPersonal Verdict: \nBest Part: I hate this game, it was good back in like 2016, but now it's just trash.\nWorst Part: The community is keeping this game alive... but the store is atrocious. \nWho Would Enjoy It: Kids+\nWould You Recommend It: I would not as it consumes by boyfriends life.\nFinal Rating: Trash.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "epic player support more like epic supports players wanting to kill themselves jesus christ",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have lost countless hours to this addictive butt fucker of a game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dead ass game\r\nno fun and purpose in competition\r\nalso $*#( epic games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cheating and elo boosting realy problem for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Johnny is the worst fucking teammate lost in the semi finals fuck you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game but ruined by toxic players who instantly get on your back for a mistake. Fun up until about rank d2 anything above is pointless as 75% of people are toxic.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "riktigt coolt förutom att dom sålde ut !! !\nnedrans epic games! !! ! !!  !!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i hate this game with every ounce of my soul. fuck you epic, sincerely.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate how I keep getting \"What's New\" about this game here on Steam when I can't buy those things here.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Holy shit, nothing like driving a car in real life. 1/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the devs must be a bunch of retards",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game makes me question every aspect of my life",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Became shit since EPIC GAMES acquired Psyonix!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is biased towards pay to wins",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "0-1 \r\nForfeit\r\nFails?\r\nDont play\r\nBe salt\r\nTeam bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "what happend to this game....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very  shit  game. still very bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too much time for little reward, but **** it I'm still here...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "epic ruined this fuck ass game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game makes you crazy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i fucking suck at this game, and I hate it because of that",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "epic lowkey ruined this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ive lost 1913 hours of my life to this game. do not recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ranked is Rigged. Change my mind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game ruined my life.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is ass even after 1700 hours",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You're telling me that cars are expensive?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is very unfair",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Best game, worst servers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Epic games merda.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "4600 Hours, awful game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Requires a third party account to play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "stupid srupid game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "after this many hours im still hardstuck gc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "literally unbuyable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game dosen't work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Still in doubt if this was worth the money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "why would you rremove linux support!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "servers suck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not good",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad teammates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Toxic as hell",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i dont like it tbh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is utter shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unplayable f u",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just don't",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fuck this",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}