{
  "positive": [
    {
      "review": "When this game launched, i excitedly flung myself into it and immersed myself. A beautiful game, with an excellent tactical gameplay loop which hooked me! I was addicted... Which brings me to my 2 issues. The game's runs are simply too long to FEEL like a roguelike, instead it feels like i'm playing through an incredibly long story segment out of a larger story, only to lose later on and be forced to repeat that. This was my first major qualm. As for my second, it would definitely be that upgrades feel... Near meaningless. I can't CC bosses, so some of them are relatively useless for boss fights, i can't 1 shot most enemies despite heavily focusing on 1 character, so it feels like the upgrades are simply a means to an end. When i have 4-5 Red skills and upgrades on a character, i hope for a frankly broken, absurd build to be formed. Instead, what i end up with, is a character with an extra skill that i will very seldom choose to use, and it just feels a bit underwhelming to get the rarest upgrades. \n\nAs of writing this review and getting this all out, the Devs have stated they're working on these 2 issues, and i'm so SO excited to see what they do to improve this, as i truly ADORE this game, it oozes personality, and it's the perfect thing to tide me over, especially if they do manage to reduce run times. It's extremely refreshing to see devs listen to criticism and seek to improve the faults within their games, and i'm so very excited to see what they do going forward.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "i really don't understand how this game isnt higher rated. It is a tactical roguelite with amazing decision making and meta progression . There are so many unique talents and upgrades in a really polished game.\n\nStop reading reviews and try the demo and see for yourself!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Lost Eidolons can be pitched with \"It's Fire Emblem but without the Anime Bullshit\". Lost Eidolons: Veil of the Witch that same thing but in a Rogue lite format that takes the well crafted combat of the original game and puts it in a session based structure. If you want to try a tactical rpg in a fantasy setting but have been turned off of modern Fire Emblem aesthetics and the 50+ hour runtime of the original Lost Eidolons, this might be a good option to try the genre. I rolled credits on the true ending after ~13 hours. That being said the progression is generally vertical both inside a run and the run to run progression. I would have loved to see more buildcraft which is something the Main game did very well. The game also has a cheap or budget feel to it that wasn't present in the original. I'd recommend waiting for a sale to grab it for 10-15$.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game is very good, fun to play and for around 30$ it's entirely worth it.\nOverall I like the flow of the game and the strategy.\n\nI will say that the game is very short though. There is only one expedition that you redo continually. You'll have burned through the random events very fast. it would've been fun to have a longer story, with maybe more expeditions route, or something.\n\nThe game is still good, and I do recommend it for people who like this kind of games, but you have to know that it's mostly one single loop.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "More fun and addictive than expected. Recommend!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "[h1] Great game for many reasons, with something to improve. [/h1]\n\nThe best things this title has to offer are:\n[list]\n[*] the fight system, which is excellent & offers a lot of tactical possibilities;\n[*] the Hero development: there are 9 different heroes, and the protagonist will unlock a total of 9 classes. So, the real total are 17 characters, though some skills are repetead among them;\n[*] the plot (sad, but beautiful) & dialogues (which are both fun and deep) + EN dubbing (which is superb).\n[/list]\n\nThe things I'd like to be improved with future patches are:\n[list]\n[*] the bestiary: there are few types of enemies, and the fact that they have various skins doesn't fix the problem. The enemies types should be at least doubled;\n[*] the bosses: there are only 5  of them (all of them great, and 3 of them with 3 variants each). I'd like alternative new bosses, with proper plot + dialogues associated.\n[/list]\n\nMy actual rank is a solid 8,4/10. Could become 9 or more if the developers followed my suggestions.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A really fun roguelike tactical RPG. The combat feels good, the upgrades feel rewarding, and the bosses are satisfyingly difficult. One of my favourite games of the year.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Final Fantasy Tactics + Slay the Spire + Dungeons & Dragons\n\nThis is my new favorite game. I do agree with others that it has a bit of a mobile game feel and I hope it comes to android in the future. So I bought it for the Nintendo Switch after 14.7 hours playing on my laptop. I love that I can play it on the bus, in the cafe, waiting in line, on the pooper. I love the replayability, the art style, the characters, the story. Just everything. High fantasy is my also favorite genre. Death builds up to a slow crawl of getting stronger and I enjoy the randomness of cards and dice rolls. I never thought I'd be so into an offline 1-player game again. I feel like a young adult discovering Final Fantasy Tactics all over again. -- I can predict when the gameplay will get stale but hopefully they come out with new expansions/adventures and more main characters in the future.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Focusing only the gameplay flow - it is the next step in evolution of turn based. \nThe tutorial flows smooth too.\n\nJust an QOL - make the enemy unit info panel hover as a choice, rather than have to press a key.\n\nNot commenting on anything else, as I do not care.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First impressions around 4-5hrs: The primary gameplay is turn based strategy a-la fire emblem packaged into a slay-the-spire-esque run progression. The meta progression is more like hades, as is the story presentation. So far the gameplay and run progression are its greatest strengths, story presentation does not lack, but I wouldn't laud over it. It has made a good first impression on me. Feeling like you have a 'build' going in a fire-emblem game is a weird feeling, but its fun.\n\nUpdate at 14hrs: Fun game, haven't beaten it, but the combat feels a bit too easy after a run or two of meta progression. You get 3 undos each fight, but I rarely use them for anything but misclicks on the hardest difficulty. The boss fights have been challenging enough that I need to use the undos, but hallway fights feel easily solvable without them. Fun game, wants more challenge imo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its a great turn based game but the difficulty is not that hard. I completed the main story in 3 runs. I was honestly expecting it to take more so I could get myself more into the story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a fun game, but it is not as true to its roots as Lost Eidolons 1. The battle system similar to the first one and the additions of skill upgrades offers more customization for your characters. The story feels more grand-scale versus the more personal conflicts driving the first game's plot. I overall like the first game better because it felt more like a Fire Emblem story with mature themes. This games feels more like an epic adventure.  I also have to note that the regular battles feel more difficult versus first game.  This is a good tactical RPG if that is what you are looking for, but you may be disappointed if you were a bigger fan of the storyline and atmosphere of the first game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "All the characters feel unique in their play style and all in all just nice casual fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I didn't play the first one, but this Lost Eidolons ended up being exactly what I was looking for. It reminds me highly of one of my all time favorite turn-based tactics games, Fire Emblem: Paths of Radiance. This has less story, but if you enjoy replaying tactics battles, too much story can end up tedious sometimes. I felt this had just enough of a story to not be in the way. I appreciate some QoL stuff like indicating which weapon works best on what armor with good icon use. No guesswork here. Some people have said it's more like a puzzle than a battle, but it doesn't feel that way to me at this point and I am currently doing a trial 3 run. \nI like the roguelike map choices, not every choice is combat. I like the amount of characters to mix up the party formations with and I appreciate that they are simple of enough to not need to micromanage skill points or such, but interesting enough to play with. For me it is a good balance of enough choices on each run and not too many. It feels a tad grindy here and there since there are only so many map types and enemy types, but I have really enjoyed my time with this game. I also appreciate the amount of post game or new game plus or whatever you call that to keep replayability up.\nThe demo was plenty informative enough for me to decide to purchase.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cool adventure. Characters looking good, every of them plays different. Plus solid voice acting performance. Sometime grindy-repetitive cuz rogue style of game. But still new stuff show during 70h.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun combat, nice art and voice acting, interesting story. After the 20 hours mark I have seen all the events but still have more story and things to do so wish it had more variety that is my only complaint.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Underated, gameplay is fun, buy it if you like tactics kind of game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice game, though I prefer the more story-heavy original Lost Eidolons.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun. \nYou play through with 5 mates and level up. \nWhen you die it resets\nYou get items to upgrade some stuff permanently \n\nBut after you get all that ( with in 15 hours ) its just boring and you cant get any stronger\n\nI filled up the board and got 1 greater upgrade and thats cool, but i cant get any stronger so i lost interest. \n\nI wish when you changed jobs and maxed them out, you got some kind of permanent buff, but you dont. Was a bummer. Fun game for 15 hours though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's been a while since I had fun from a modern RPG game. I think it's a great game with a good potential. The only down side to me is that you have to start the loops from the beginning. Still had really fun playing so far. A well balanced game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like this game, the devs have responded quickly and made nice balance changes for the progression and heroes you use.  Its also very hard for most of the boss fights which require more puzzle, specific tactics, and/or builds to overcome them.  That said, I did stop after 30ish hours mostly because I found a new game to play.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's pretty good. It scratches a bit of the Fire Emblem itch, but it's roguelike. \n\nI think maybe the biggest flaws are that there isn't enough variety to make the repeated campaigns fun. It takes a little bit to get new characters and new classes for your main character. Starting a new campaign is like \"Oh yeah this character doesn't have this cool skill yet.\" which kind of feels like a bummer. The encounter and map designs are OK at best. The art and animation are competent, not bad at all, though do feel a bit generic like stock art or AI. I haven't paid attention to the story at all so I can't really judge it on that. \n\nI think it's worth buying/playing, but it won't be your favorite game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just as interesting and distinctive as their previous game. Classic turn-based strategy and a well-written story.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its a bit repetative, i do'nt like that there are only so few maps, the goal was very short. it was a short and sweet game, not a lot of replay value but i enjoyed it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I want to start off by saying that I really enjoyed this game. It plays similarly to the first game, but you unlock skills as you go similar to Hades. You lose those skills when you die but keep some things to create upgrades for your next expeditions such as improved weapon strength. I love the skills and relics that are unlocked as you progress, as they are pretty unique for the genre.  However, it is a little deflating to start a new run without some of the skills that you get used to using. Seeing that a full run, can take over six hours, you get attached to some of the skills you collect. I feel like what is accomplished in a run is not rewarded quite as much as I would like. Having to start basically from square one is a little annoying. To be fair, that is standard with roguelikes, so the game is as advertised.\n\nIt is more combat focused, but there is a story that ties in really well to the first game which I found enjoyable.  There is a good variety of maps and objectives. The boss battles are challenging but fair.  The undo mechanic is helpful as one mistake that could end an entire run can  be undone. Voice acting is good and the characters are well-written. \n\nWhat did leave me deflated is that it ends after Chapter 3 with credits. Then it reveals a Chapter 4, but it makes me start back at the beginning to play through again. I felt like I was really starting to get invested in the game, and then it just cuts off. I understand that they want you to go through again, but being cut off like that was really annoying.\n\nAll of this being said,  I really enjoyed my time with it. I hope they take a lot of the mechanics from this game and implement them in a new Lost Eidolons game that is not a roguelike. I highly recommend this game if you enjoy Fire Emblem-like games but would prefer less of an anime aesthetic and a more mature plot. However, I would temper my expectations based on the length of the game. To be fair, I think it is priced accordingly.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game is solid, and the loop is fun.\nThey continue to add features, and the base game was already fun as it is.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I spent like 70 hours into this game. The zones do start to get repetitive, but i just kept wanting to play them over and over.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty fun game and stays interesting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game, rng dependable but easily to beat it at first until you start unlocking difficulties",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun little game. Less narratively driven than the original game in the series, but the new roguelike elements provide really great replayability.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice combination of turn based tactics with roguelike experience. You can complete a run in 3-4 hours, and I needed at least 10 to complete the \"full\" story and unlock all playable characters... and there is still some new stuff to do. Only complain is that maps may become a bit repetitive. 8/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun rogue-lite with quite a lot of progression systems. Plays very fast and runs very well. I wasn't expecting this combination to be fun, but it is very good.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Story rich rougelike TRPG that is creative with it's presentation and overall a nice game. Also I like what Ocean Drive Studio are doing with the Lost Eidolons world. Would like to see them build more on this setting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Although this game shares many similarities with Lost Eidolons, it is much simpler in scope. Whereas Lost Eidolons had quite a gripping main story, this one has almost none. It is a series of battles between rest points. There is very little to do at the rest stop/camp fire. In Lost Eidolons, about half the game took place at the base campe with many missions to accomlpish, both main and side. So I got bored fairly quickly. I still give it a positive review because it is a quality game, just not for me. 55/100",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I had fun with this game for almost 30 hours before I put it down, which is reasonable. I have mixed feelings about this game, but overall I think it's pretty alright.\n\nThere seems to be a lot of people who have trouble completing the game, but I had the opposite problem. As someone who enjoys and plays a lot of tactics games, I ended up beating the game on my first run. I cleared act 4 on my 3rd run. I think my only failed run I've ever had was my second where I got surprised by a mechanic on the second boss. As someone who easily cleared the game, it only got easier with each run as I got more and more features to make it easier. I mostly stuck around to finish the story and unlock the extra characters (who I did not even start unlocking until after I cleared the 4th act, and had not even finished unlocking by the time I was done with the story).\n\nI probably could have made my run time longer by turning up the difficulty by adding more modifiers to the runs, but I'm just not sure that it would add much needed variety to the runs. \n\nIf you enjoy tactics games and roguelites, this game could be for you, but if you consider yourself a veteran of both or either, you might find it a bit too easy (and this was before the recent patch that turned down the difficulty, which I haven't played on yet)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'll give it a recommend but only when on sale.\n\nThe gameplay is very solid but what kills this game is deciding to be a roguelite. The roguelite elements gut this game's ability to tell a story (you don't get much until you start losing cause nothing is really explained) and you hardly get to learn anything about the characters at a meaningful pace. I don't think a turn based tactics style works well with this type of roguelite",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I wish there were more grid-based roguelites like this game. It really nails the formula down. \n\nAs a spin-off, quasi-sequel to Lost Eidolons, you dont *have* to have played that one to know the story. Dude wakes up on an island, meets some other allies, and goes on a quest. Then dies. Rinse and repeat. But each time, you acquire more resources and relationship points between the characters. The voice acting is done well, as it was in Lost Eidolons. The story, however, is a bit thin. There really isn't much beyond the main character's backstory. If you've played Lost Eidolons, there are references to characters and events that fill in the gaps in the timeline in the partner conversations, but I feel like there could have been more fleshing out of your allies through the runs, events and whatnot connected to each. Just feels like a missed opportunity.\n\nThe gameplay itself is addictive, even if the runs are a bit too long. The maps are varied, and I enjoyed the different scenarios you encounter. Upgrading your characters throughout a run is mostly random chance, but I never felt like any one unit was a weak spot - unless they got some truly horrendous rolls for Resonance Stones (upgrade materials).\n\nRuns get fairly interesting once accessories are unlocked, but you have to beat the game once for those to unlock and then do successive runs on higher difficulties to gather materials to craft and upgrade them. I wish those had been unlocked from the beginning and were easier to collect materials for, as they add a fun spin to runs with the various abilities they provide. \n\nOverall, there's a decent amount of content here. Of course, it's nowhere near the level of other roguelite legends, but it's an enjoyable game for what it's priced at. I'm curious to know where else this franchise goes, now that the developer have waded into the roguelite waters. This is a pretty impressive first attempt at the genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "turn-based strategy roguelike, oddly fun mix of genres.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great Game Yet Addicting. Look out!  1 run of the game and hours pass by without you noticing.  Lots or lure and voice stuff to go through and enjoy. After 50 hours of this game I still want to play more going through unlocking all of the story.  This Rogue lite game you go through and collect items to boost your characters and make more things easier to access as you find more characters along the way. \n\nI currently give this game a 9 out of 10 but I feel that is also because even after beating the game I feel there is more i need to explore so that may go higher.\n\nUpdate: I played it more and yes a lot more after beating the game.  I can't give this game a 15 as it is 1-10 so I guess I will settle for a 10. There is so much more and more things to unlock changing difficulties.  Enjoy and GOOD LUCK!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "but chapter 2's difficulty spike feels arbitrary",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good story, nice gameplay",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "solid tactics dnd5e style with roguelite runs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is fun roguelite tactical rpg :D",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "a game well worth the price.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games I played, heroes like",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you love RTS this is a great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice Game!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome ! not bad !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is a nice tactical RPG with roguelike elements. It is pretty tough with quite a lot of grind, but with a lot of different weapons and skills plus artifacts. Furthermore, it takes the same principle of their first game but enriches it.\nThe bosses are fun to discover and to beat. (You are going to get crushed the first time if you don't read enough about the passives.)\nI am looking forward to seeing the end of the story.\n\nMy only gripe with the game is that you have to sacrifice the efficiency of your run to get resources to upgrade your town and that maxing takes quite a long time. I am 80 hours in, and only my main character is friends with everyone. Also, I wish I could switch greater blessings without paying resources.",
      "voted_up": true,
      "votes_helpful": 43
    },
    {
      "review": "Game released officially today, I came back to it, started a new save, and the game crashes when I choose my first path (a battle offering gold). Didn't have crash problems before, but as of right now, it's unplayable for me.\n\nEdit: If anyone else coming back from EA has the problem: verifying game files fixed it for me. I'm changing the review to positive and leaving it up in case anyone else is having trouble and could benefit from it.",
      "voted_up": true,
      "votes_helpful": 39
    },
    {
      "review": "If there is a Medium rating comment option,  i would go with that. Since i got this game since the EA stage, i've gone through 87 hours till this day.Even with a little help of CE, i still can't win enough resources to unlock optional class for my ASHE. This is insane, because you have to upgrade relationship with certain teammates to at least level 3 to  unlock a new class, and the only way to upgrade your relationship with your teammates is playing the game over and over again(80+ hours only get me 3 level 2-relationship teammates) and choosing the comping paths.\nSo generally speaking, if you like repeating tiresome quests, this will suit you. The first 20 Hours play is good, and the stories in memories of Ashe are decent too.\n\nSome suggestions:(Forgive me, i'm not a native English Speaker, so i make suggestions in my mother tongue)\nEA期间就3章，正式版加了1章+1Boss， 我EA玩了80小时，估计不用CE再刷80小时也不一定能凑起首饰进入第4章，然而刷玩80小时真不想再刷了。\n几个建议：1，战斗中需要能存档；2，战斗开始人物该能一定能区域内选择上阵位置和队友；3，换主角职业这种东西该一开始就能直接选择，不该在这上面增加肝度，谁有时间为了换个主角职业刷几十个小时队友好感啊？",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "I've played a little over 10 hours and I'm enjoying it! It really is Fire Emblem mixed with Darkest dungeon in a good way. I really like the art style and the gameplay loop. The story and dialogue can feel a little drawn out but the voice acting is pretty good so it's not terrible to sit through. Some small QoL would be to fleshout some of the abilities and their effects in the tooltips to clearly layout what they do. Would recommend if you're into strategy RPGs and don't mind roguelite elements. Looking forward to playing more!\n\nFinished the game after nearly 30 hours. Pretty decent experience. For the price, my expectations were pretty open ended and I'm happy with the time I spent playing. Definitely consider picking up on sale. I really love the artstyle but the repetitve maps, dialogue and lengthy runs are things that will stop me from second playthrough.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "This should be the gold standard rogue-lite strategy games should strive for, meaningful upgrades on top of easier to obtain stat buffs, none of which needed to beat the game (but certainly not a cake walk.) Veterans will struggle much less, and I would encourage them to simply not worry about trying to grab every win percentage point, If you only play characters until they are maxed, and only cycle one character into the lineup without adding proper difficulty modifiers, it will get too easy. I find that just grabbing any five characters and then adjusting the difficulty to suit what I'm feeling keeps me engaged. I think those newer to the genre will have a wonderful curve of an experience, I've bought so many roguelikes/lites and been disappointed as the meta falls apart or its use the best strat or suffer. I have not found a combo of characters I can't win with, on one tier below the current max difficulty. That is astounding. Please check this game out,  Truly an enjoyable experience for every hour I have and the many more I look to gain on release. Also as someone who was disappointed with the FFT voice acting, its nice to see a voice cast with some experience, and it shows.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "What a delightful game. Takes the fun, interesting mechanics from a game like Slay the Spire but paces it into a tactical turn based. And even better yet, the more you play the more advanced features unlock, making runs feel refreshing. This is a great deal, highly recommend this for those who enjoy tactical RPGs, the roguelike approach of Slay the Spire.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "This solid tactical RPG blends together features from fan favorites in the genre, with gameplay in the style of Fire Emblem, mission structure modeled after Darkest Dungeon 2, and upgrade/story progression borrowed from Hades. \n\nThe standards of the genre apply here, including re-playable missions with variations to keep them feeling fresh, and various challenge modes you can enable to increase the difficulty for more rewards. The roster of playable characters also means that your party composition can change in different runs, creating a very different feel and different strategy for every group. Whether you want to lean heavily into magic, or brawling, or stealth, or range, is all up to you - or you can just grab one of each and see how it plays out.\n\nThe narrative borrows from Hades, in the sense that when you die and fail a run, the game doesn't just end and start over. The death is canon, and you get revived to try again, and your character is aware that he keeps dying and trying.\n\nThe voiceover work is surprisingly competent, despite featuring mostly lesser known names. The script, however, does sound oddly modern for a fantasy game. It works here thanks to a mostly straight-faced delivery, but if you are expecting some shakespearean style of medieval talk, it isn't here. These characters sound like millenials.\n\nSome of the other reviews here mention the difficulty spikes and boss mechanics as negatives, but for me, the bosses were a fun challenge. They wildly change up the gameplay and force you to approach with care; you cannot stat-check the bosses by having one overpowered character. Instead, the fight mechanics require that you hit the boss from different sides and with different weapons to break through their defenses, and the whole experience does a great job of making you feel like you're a D&D party working together to take down a big monster.\n\nAs for negatives, there are certainly a few:\n-Only about 40% of the dialogue is actually voiced, the less important scenes and side characters don't bother. Instead you just get single words, or grunts.\n-The UI still needs work in a few areas, such as being able to hover over terms being used and see the definition rather than having to navigate to a different page to find it.\n-The damage preview numbers aren't always accurate, since there is always a chance the enemy may block your attack. But that block % isn't shown anywhere, so you might think you have the perfect play, only to get denied by RNG that you couldn't account for or predict. RNG is part of the genre, but it would be nice to see these block% numbers so we know whether it's worth taking the risk.\n-Stiff animations during transitional sequences and such. Mostly minor complaints.\n\nThe party members are already made, you just pick the 5 you like the most and go. Aside from picking male or female for the lead hero, there is no character creation here. This can be a pro or a con, depending on your preference. Some people like strong writing for defined characters (think Geralt of Rivia), while other people like making their own heroes from scratch. In this game though, you pick from the existing 10 and that's that.\n\nSome games have core flaws that cannot really be fixed without overhauling the entire system, but thankfully, that isn't the case here. Most of this game's shortcomings can be easily fixed with a few layers of development paint and a bit more time.\n\nOverall, an extremely solid strategy RPG effort, and easily worth grabbing for fans of the genre.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "This game is criminally underrated by reviews. It looks like most of the negative reviews I've read are comparing this game in some way to a previous Lost Eidolons game, which I never played. \n\nIf you love Fire Emblem, as in absolutely love Fire Emblem, do yourself a favor and buy this game. I've been waiting for years, and searching hard to find ANY game on steam that scratched that Fire Emblem itch, and this is it. \n\nImagine a roguelite Fire Emblem with (light) metaprogression, an enticing voice acted story, and innovate leveling mechanics that incorporate DnD tropes (rolling a D12 for pathing, level 20 cap, etc.)\n\nI'm going to be playing this game for a while, and am in love with it. The negative reviews I think are unfair.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "A surprisingly solid and well polished strategy RPG roguelite. Fire Emblem + Hades is clearly what the devs were going for and they did largely pull it off.\r\n\r\nThat said, while it is well made and I've enjoyed playing it, I am already starting to feel the grind at about 15-20 hours in. I don't think I have it in me to commit the time required to see the true ending.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Edit: Sorry I am a little aggressive at times in this review. I was caught up in reading negative comments/reviews and wrote this from a negative place rather than a helpful place. Leaving the review as is though.\n\n2nd Edit: I decided to visit the game forum again and immediately went back to that negative place.\n\nThe original review was written at 22.5 hours, first edited at 44.5, and now again at 53. This does not count the 6 hours played in the demo.\n\n[h1] My review is from the perspective of someone who never played the first game and had not heard of this game until I saw the demo available on Steam. The review is half a defense of the game/attack on players leaving negative reviews and half actual useful information about the game. [/h1]\n\nThis game has me hooked. Played the demo, made it to Act II boss first run, and had to buy the game to see how that fight played out. Well, I got my ass handed to me and then it took a few runs to even get past the first boss again. And I loved it.\n\n[h2] Now right off the bat, for those of you who can't read: [/h2]\n\"adapt to ever-shifting events, and grow stronger with every run.\"\n\nThis is a roguelite, you will start from level 0 after death, repeat the same core game play loop, face the same encounters, and you WILL die at a boss a number of times before you clear your first expedition. There ARE persistent upgrades, plenty of them. Power, armor, luck, shop upgrades, new skills, new relics, new systems, etc.\n\n[b] DOWNLOAD THE DEMO FIRST. [/b] If you don't enjoy this core game play loop then do not buy the game. And if you can't read, you are going to have a bad time in this game. Read your skills, read the enemy skills, turn on threat range, play strategically, pay attention to the hints the game provides and revisit them in the guide if you need to. The number of reviews and discussions I have seen w/ players not understanding what this game is or how a system works (that was very clearly explained), and then rating it poorly is kind of absurd.\n\nYou WILL be frustrated by spell range, lack of AOE, bad rolls, etc.\nYou WILL experience encounters that you swear are unfair and you will complain about the game.\n\nthen...\n\nYou WILL have a break through in some form. Maybe it is a new Mythic ability, a new character unlock, a new synergy, a new relic, or maybe you finally pay attention to enemy abilities and threat range and play around that.\nYou WILL have a run where you are feeling great and steam rolling and you don't want to end. And you WILL get your ass kicked :)\n\nADAPT. GROW STRONGER.\nIf you are unwilling to adapt based on what the run is giving you and you throw in the towel after a few runs, then ggs, this isn't for you.\n\n[h2] Level setting expectations for your first 10 runs or so: [/h2]\n\nThrough 30 hours (including 6 in the demo), I have gone on 7 expeditions and cleared Act III once. The first time I made it to Act III I was able to beat the boss. I don't expect to make it to Act III now every time just because I did it once.\n\nThat 30 hours was spent reading/listening to every bit of dialogue (save a few scenes from repeat encounters), reading skills + upgrades, inspecting characters before a turn to check on status effects, plan out enemy movement, interacting with every out of combat system, etc.I prefer to be thorough and understand a game and its systems and I try to ward off tiktok brain by letting the conversations play out naturally rather than skipping through them. I expect most players will get more than 7 runs in during their first 30 hours, but this is how I choose to play the game.\n\nMy first run was a fluke where a single character hard carried me through the first boss, leveled up a ton, and carried me to the Act II boss. Runs 2-5 had varied levels of success, but always progression. The run may have been shorter, but I got resources to purchase upgrades at the Altar of Fire or to unlock shop upgrades. I promoted my character's classes and changed up my party. These runs never felt bad to me.\n\nRuns 6+7 I started to feel strong. Run 7 saw me hitting damage numbers 3x higher than in previous runs, exploring new play styles, and genuinely having a blast. I earned enough resources in this run to promote 5 character's classes and take my altar to level 7. There is still SO much to unlock and I'm expecting mixed results from my next 3 runs as I experiment with two more new characters and different play styles.\n\n\n[h2] Story, Art, Voice Acting [/h2]\nYou will uncover bits of the story with each run, specifically after dying a couple of times and then your first boss victories. You also earn currency that unlocks memories that play out as little scenes from your past. Leveling up your relationships between characters also unlocks dialogue and you will spend a decent amount of time reading/clearing these conversations from The Lodge. I can't say that I was immediately drawn in by the story, but that probably had more to do with the fact that I was playing the demo to see if I enjoyed the game and didn't want to spend the mental energy to get into another story that I may not stick with. As the game has gone on and the story unfolds, I am finding myself a little more interested in it. I can at least give you a summary of major events and key characters and I'm not skipping dialogue, but the story isn't a major concern of mine.\n\nI will say that it is a bit odd to be going on these expeditions with your party, have bonding moments during the run, advance your relationship, and then the conversations you unlock afterwards seem to walk the relationship back. I always check for new convos after every run and they feel slightly out of order or inconsistent/misplaced for where I am at in the story.\n\nI really enjoy the art style, the voice acting is pretty good (I am playing as the female main character), and the combat animations are good enough for me. I'm not very particular about any of these as the combat and core game play are what I am most interested in, but it is an added bonus that I enjoy them. There are some parts of the game without any voice lines and bits and pieces where what is spoken doesn't exactly match the text, but nothing major.\n\n\n[h2] TLDR [/h2]\n100% recommend if you are into turn based tactical game play WITHIN A ROGUELITE. Combat, tactics, upgrades are all great IMO. There is enough story and out of combat content to keep things progressing along and break up the runs, but you can skip through dialogue if you'd like.\n\nNo like start over after die? SKIP THIS.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "It's a solid tactical \"RPG\" (no real choices, just character stats). Plot is meh but good enough to keep you running, combat very solid. My only gripe is that it's too easy. There are Trials you can use to impose more difficulty on your runs, but I finished the game on Trial 1 first try and was a walk in the park. Wish we could tweak the options some more, but still a very good game.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "When this game launched, i excitedly flung myself into it and immersed myself. A beautiful game, with an excellent tactical gameplay loop which hooked me! I was addicted... Which brings me to my 2 issues. The game's runs are simply too long to FEEL like a roguelike, instead it feels like i'm playing through an incredibly long story segment out of a larger story, only to lose later on and be forced to repeat that. This was my first major qualm. As for my second, it would definitely be that upgrades feel... Near meaningless. I can't CC bosses, so some of them are relatively useless for boss fights, i can't 1 shot most enemies despite heavily focusing on 1 character, so it feels like the upgrades are simply a means to an end. When i have 4-5 Red skills and upgrades on a character, i hope for a frankly broken, absurd build to be formed. Instead, what i end up with, is a character with an extra skill that i will very seldom choose to use, and it just feels a bit underwhelming to get the rarest upgrades. \n\nAs of writing this review and getting this all out, the Devs have stated they're working on these 2 issues, and i'm so SO excited to see what they do to improve this, as i truly ADORE this game, it oozes personality, and it's the perfect thing to tide me over, especially if they do manage to reduce run times. It's extremely refreshing to see devs listen to criticism and seek to improve the faults within their games, and i'm so very excited to see what they do going forward.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I'll admit that I was one of the players of Lost Eidolons that is not particularly glad of the shift from the first game. The first Lost Eidolons game was a flawed gem but I thoroughly enjoyed it despite that - and I do miss Eden, fun character. I was willing to give Veil of the Witch a chance because one, I'd like more from the series, and two, I also want to see the dev studio grow and see what direction they'll take and adventures and stories they'll provide us.\r\n\r\nWith my short time on this game, as of the time of this review, I'd gladly say that my skepticism of the gameplay formula change is mostly assuaged and I've enjoyed my time with it thus far. While I miss the bombastic cinematic experience of the first game, the artwork and style is as beautiful as ever and voice acting is entertaining - so still enough of presentation to enjoy for lovers of the craft of art and voice overs. And the devs delivered on their promise of snappier combat because it indeed is, making things fast paced. The game is rather addicting too with its constant flow of risks and rewards and managing and shuffling abilities and enemy aggro.\r\n\r\nIn short, Lost Eidolons: Veil of the Witch is an enjoyable, addicting high-fantasy tactical RPG rogue-lite. Fans and skeptics from the first game should at least give this game a chance and form their own opinion on its drastic changes.\r\n\r\nMy only - but subjective - gripe, and it was something I suggested during early Early Access, was the lack of an alternate portrait option to have male Ashe's portrait without facial hair. Just personally not a fan of it. But if it's within the artistic and design vision for the character, then I can live with it - no biggie.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "it's a great game, to be honest. It started out super slow until you unlock a few more characters and some upgrades, and that alone could take 10+ hours. The final boss is quite hard, and some other monsters have gimicky mechanics, but I did beat the game. Towards the end, I played for 4-5 hours straight because I knew I made some bad moves and I could beat those bosses.\nStory is not too complicated, a bit predictable, no fancy cut scenes but extremely well written. It has a lot of souls in it, and I grew to care about those characters, and their little stories towards the end.\nprogression system is very rewarding, but quite grindy since the resources you collect is a bit stingy, but you can up the difficulty a bit to gain more. I enjoy it, but some people might find it a bit of a turnoff.\nThe undo system is quite generous to compensate for some brutal fights.\nI adore the art style, but graphic is sort of on the indie side of things.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I bought LEVotW honestly not expecting to enjoy it. I'm not a huge roguelike player, and while I enjoyed the first game, there were pacing issues that have deterred me from a second playthrough. But, I like the direction the studio is headed, so I picked this one up and I'm very glad I did. A few pros : \nCombat is engaging and _very_ fast paced, not the slogfest that some of these games can be. \nVoice acting is solid, and some of the characters are a lot of fun. (Looking at you, Raven.) \nThe story arc makes sense as a repeated gameplay loop, more than a lot of entries into the genre. \nProgression is valuable without being overpowering - every run I'm excited to try out something new that I didn't have before.\nCharacter diversity allows for excellent team building options (The class variability for Ashe is an excellent touch) without being SO broad that its overwhelming.\n\nNo real \"Cons\" to speak of for me. The only things I don't like are traits of the genre or reasonable limitations for the size and budget of the game. Sure I'd love to have all the Allied characters eventually be full-fledged companions, but I'm not mad at it. (I'd totally pay for the expanded companion DLC though, hint hint.)\n\nAll in all, a great sophomore effort in the Lost Eidolons journey. I'd vote for a more standard story driven version for game three, but I'll pick it up in any case. Keep up the great work!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "i really don't understand how this game isnt higher rated. It is a tactical roguelite with amazing decision making and meta progression . There are so many unique talents and upgrades in a really polished game.\n\nStop reading reviews and try the demo and see for yourself!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "More fun and addictive than expected. Recommend!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fire emblem with roguelike elements. My biggest complain is the extremely slow progression. I finish act 4 (the last act) in my first ultimate 1 run, but I still haven't unlocked all characters, and I am not able to unlock any of the MC class. Although the game is a combination of Fire emblem and roguelike, it falls short in both side. It lacks a fulfilling story (and way too short) story as a RPG, it also lacks enough enemy and build varieties as a roguelike. However, the art, music, and overall atmosphere is great, overall a serviceable 6/10 game. I will probably not going back to grind more after finishing the story.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Solid rogue lite with a decent story.\n\nI played Lost Eidolon which was decent until the boss mechanic \"invulnerable until mobs are cleared\" kicked in.\n\nWith the combat streamlined and without this totally messed up mechanic (due to which I quit Lost Eidolon) game is enjoyable and the Voice Over as well as variation is good for a rogue lite.\n\nYou do not need to have played Lost Eidolon to enjoy the story.\n\nBut it helps to have some deeper experience.\n\nHope they expand on the game a bit and have success.\n\nI would go for a DLC for this one.\n\nAnd with success take what they changed in character progression and combat to make a Lost Eidolon 2\n\nThumbs pressed there.\n\nI can recommend it.\n\nFor the money you spend you get a decent experience.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Disclaimer: I did not play the first game, and therefore didn't have expectations about how it should be.\n\nI've seen a lot of reviews(mostly by people who played lost eidolons) sayings its grindy and there is no/little progression, i'd disagree. But its different than one sees in other games.\n\nThere is a grind, in the sense that its a randomized(with choices) set of 30ish \"mission maps\" per run (if you complete).\nYou can unlock new character classes, but you do so by searching for a new character that has that class, and then when you get their relations up to 2 (starts at one, maxes at 4, so its decently quick), then you can change your characters class to the class of the unlocked character.\nThe story does progress, so even though you have completed the first run, doing the same run is not...the same.\nDifferences being social stuff like how NPCs and bosses will react to you, you also get more boss levels, but also game mechanically, different stuff simply happens, the bosses and their minions have different skillsets and map setups every time (i've completed maybe 3 runs now i think, so far it's been different every time).\nAnyway, so progression also works by upgrading both your own characters class, and the companions - and despite your own character \"learning their profession\" its not the same one - you get your own unique version of it.\nThe class choice affects your equipment as well, which affects your available skill choices.\nThere is a \"perk tree\" of sorts, which the game very honestly informs you - simply makes the game easier - you get more hp, more damage etc. So it just makes it easier, and eventually you get a \"greater rune\" that really changes the way your party is aspected.\nI'd say the first few runs i had, were a bit hard, the first boss on the first run is pretty nasty until you figure out how to deal with her and her minions, but i was prepared to simply fail and start a new run, so it didn't really bother me much. \nWhen you fail you get lectured by sable (patron of sorts) about how much you suck and should do better, which is exactly how it should be ;)\n\nFinally, each run is a bit different because its randomized what skills and upgrades you get to choose from.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is an interesting roguelite that does things pretty well for the most part.  Each run consists of you moving through 3-4 zones (depending on your progress through the story) with encounters in each zone, those encounters being either fights or various events (some of which involve random dice rolls).  Fights can have various objectives or conditions (protect some villagers, poison mist slowly creeping across the map etc) but most of the time just killing all enemies will achieve the objective.  Run progression involves getting random skills on level up for your characters as well as upgrading their equipment which gives both passive and active skills.\r\n\r\nThere is a decent amount of meta progression and unlocks, including getting new party members, improving the merchant you encounter in runs, unlocking new relics and artifacts etc.  The main character's personal story is decent and you do get additional lore and story tidbits here and there even after beating the main bosss.  I'd say the one issue with this game is that runs tend to be quite long, several hours (there's even an achievement for doing a full run in less than 5 hours although that wasn't really hard to get but it gives you an idea of how long they can be).  Given that in order to max out things like relationships between your party members or unlocking various side endings requires multiple runs this really makes you feel the run lengths as time goes on.\r\n\r\nThat said, the game is solid, it's done a good job of blending TTRPG and roguelite and I've enjoyed my time with it so far although I doubt I'll try and 100% the game simply due to having to do a lot more runs.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Nice game! I like Turn based strategies so maybe I am just good at them, but I won second try, with first being ending with undos available because I wanted to see what the town upgrades looked like.\n\nFirst, the talent for the boar guy that lets you use a stance and NOT end turn is kinda broken, he can skyrocket EXP by swapping and attacking in same turn.  Very easy to become overleveled.  Maybe make only the first action each turn give exp?  \n\nAlso, unlocking new classes takes way too long, After I the first game I was able to track, Maybe because I played demo first I couldnt before.  Then I won the next game, fulll research done, but I now have to do a 3rd to unlock them, then a 4th to really change up gameplay.  With how long each run takes its a bit crazy.  Maybe having 7 at start so I can change comp from start?\n\nThe amount of talents is actually good compared to other Roguelike Fire Emblems, buut variety still feels a little meh.  Each person doing 1 of 2 things usually with some blend does make them seem similar from runs.  The rogue guy stealths and crits.  His weps give good armor coverage, but im still stealthing and criting regardless of what he specs into.  It would be nice to have more niche skills / utilities on a lot of characters and maybe pick 1 of 3 on levelup so you feel a bit more specced or different?\n\nMap variety feels great!  The amount of random events feels awesome, maps have variety in events, enemies, win condition.\n\nTBH its easy to get EXP or stall fights.  With how long each run is, I think itd feel a little better with 5-8% increased EXP and -1 map point to speed up runs.\n\nBug-ish-  what does improved conceal for rogue do?  Description doesnt elaborate on whats different.\n\nAlso paths matter, but not that much IMO.  Relics giving bonuses and negatives mean I dont really go out of my way for them.  Some of them Id rather not deal with at all, like the chaos orb thing.  Camps upgrading a skill seems to be strongest for me, but even then its still a negative for lack of exp.  In short I dont think my run would change all that much if it auto-random picked which paths I go.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Lost Eidolons can be pitched with \"It's Fire Emblem but without the Anime Bullshit\". Lost Eidolons: Veil of the Witch that same thing but in a Rogue lite format that takes the well crafted combat of the original game and puts it in a session based structure. If you want to try a tactical rpg in a fantasy setting but have been turned off of modern Fire Emblem aesthetics and the 50+ hour runtime of the original Lost Eidolons, this might be a good option to try the genre. I rolled credits on the true ending after ~13 hours. That being said the progression is generally vertical both inside a run and the run to run progression. I would have loved to see more buildcraft which is something the Main game did very well. The game also has a cheap or budget feel to it that wasn't present in the original. I'd recommend waiting for a sale to grab it for 10-15$.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fun game, snappy addictive combat. So much potential if the combat can be implemented to the main stream Most Eidolons game. Huge improvements in graphics and combat.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Great follow-up from Ocean drive, while I would consider myself to be more drawn by more story focused games this  one bridges the gaps like Hades 1/2 in being a roguelike but also having a solid narrative/character  backbone to keep people engaged.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "This game is very good, fun to play and for around 30$ it's entirely worth it.\nOverall I like the flow of the game and the strategy.\n\nI will say that the game is very short though. There is only one expedition that you redo continually. You'll have burned through the random events very fast. it would've been fun to have a longer story, with maybe more expeditions route, or something.\n\nThe game is still good, and I do recommend it for people who like this kind of games, but you have to know that it's mostly one single loop.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Edited after more hours into this.\n\ntldr; This is a full letter grade improvement over previous title and worth your time if you enjoy turn-based strategy.\n\n\nGameplay itself showcased the strongest improvement overall; we have evolved past a shallow fire emblem clone into becoming its own unique experience. Classes now process their own identities and have different builds to explore. Skills have bombastic presentation and passives augment play style rather than just increase stats.\n\nThe roguelike aspect is fairly solid. You feel progression with each attempt, experience different possible outcomes, and there are enough game changers to throw you off. \n\nThe downsides I see are map enviroments and length of each run, the negative aspects of each amplifying one another. Battle maps are boring, flat, and will be the same layout depending on the battle encounter. Runs can be between 2 - 3 1/2 hours, so you can get burnt out in an extend play sessions with a sense of deja-vu. \n\nThe story and characters were the blemishes on the previous entry. It encompassed such a large portion of the experience that its mediocrity blackened out the positives. I think they are finding their strides now and realized their limitations to make a better narrative experience. These characters have more depth and while not amazing, are leagues better than the blandness we had before. While the story is limited by the nature of being a roguelike, I think it was acceptable and well-paced.  Voice direction was on point this time around and also showed a massive spike in improvement.\n\nWhile the visuals have experienced a downgrade, I think it is a better presentation and has style that is enjoyable. The awkward cutscenes and horrendous facial animations are thankfully gone in favor of portraits and visual novel dialogue scenes. \n\n\nI think Ocean Drive as a whole are improving and this outing is a much better product despite its scope being smaller. I'd like to see more from this developer and Lost Eidolons as an IP with the lessons they've learned.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Fun game and very challenging to where you have to really think on your tactics before making moves.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "A surprisingly great mash of roguelite and grid movement strategy. Honors the story and mechanics of its predecesor and brings new ideas into the mix. Overall a great time!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "An excellent, really entertaining game which puts up a clear example of what outstanding results small studios with small budgets can aim at and achieve.\r\nIf you are familiar with the prequel a lot of the game mechanics and rules will be immediately familiar but the rogue-lite touch adds a very enjoyable added twist.\r\nThe game does a good job with both explaining and implementing the rogue-lite specific repetitiveness of the plot and the unlocks, new discoveries and piling up experiences make the constant repetition a lot less painful.\r\nThere is not much story and writing involved but the amount done is excellent, [spoiler]I strongly suggest locking out all the memories and playing the game all the way through (beyond playing the first 3 chapters which is already considered a form of victory) especially if you are not afraid of really sad but equally uplifting endings.[/spoiler]\r\nGraphics, especially the hand-drawn pics are remarkable (just as with the previous Lost Eidolons iteration), music can be familiar (there are new tracks but some of them just reused from the previous game), voice acting is really good, done by professionals and no AI was involved.\r\nThe tactical game play is more-or-less the same as before, whit a few nice added twists and sprinkle on top, combat is fun, skills are well-thought-out and well balanced.\r\nI strongly recommend playing this one (and if you are new to the Eidolons series, start with the first one).",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "very good and extensive demo. If you enjoy the demo then you will enjoy the game. There are additional aspects that you dont get to see in the demo but those are bonuses and the core of the game is still felt in the demo. \n\nOverall a great turn based game with interesting mechanics in the way of Blessings and Curses, the Resonance stone mechanic is neat, with a bit of RNG throughout the game in the form of rolls as well as rarity of stone unlocks. There a little bit of everything for turnbased rpg players and overall enjoyable. The plot is very straightforward and tropey but well exceuted making it enjoyable. Key cutscene voice acting is also very nice and the variety of classes which require different playstyles is fun. \n\nI instantly bought it after i capped out the demo and havent regretted it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I was pleasantly surprised by this one. It's not going to set the world on fire but I enjoyed my time with it.\n\nThe main plot is not as complex as I would have liked, but I found the character interactions to be funny, endearing and heartfelt. The party members were fun to be around and the voice acting really brings them to life.\n\nGameplay wise, the game does a good job of distilling the longer form battles of the main game into five to ten minute skirmishes. There's a good variety of character classes and abilities that are fun to play around with. Some of the boss fights do drag though. That being said, while fun. the runs do get a bit repetitive. More encounter types and relics would have helped alleviate this issue. The meta progression is pretty deep and the game adds layers to it at a decent pace.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[Updated review]\nJust finished a run against the \"true boss\" after roughly 6 tries. I definitely recommend the game, even at full price. It was a solid good time from beginning to end. New mechanics and characters steadily get unlocked to keep things fresh but not overwhelming. The story is your run of the mill \"defeat the bad guys terrorising the island\", but what elevates it was the voice acting and writing. The delivery and the banter between characters really worked for me, without which, it would have been a solid, but generic xcom-like.\n\nThere is nothing here an xcom and/or roguelite veteran hasn't seen before. However, every mechanic, ability and class/character complement one another well. Everything clicks together well to give you a good time.\n\nThe developers have announced more content to be released, and with the solid updates released so far, I am excited for the content to come.\n\n[strike] [Ongoing playthrough] [/strike]\n\nThe game feels great. Having good voice acting and more voiced dialogue than I expected was a very pleasant and welcome surprise. I'm only on my first run, but am enjoying the tactics and options so far. Good variety, skills and environmental effects. I see where the rogue lite elements are going and am looking forward to it. Really enjoying the game and leaving a review for support\n\nOnly nitpicks I have so far:\n[olist]\n[*] (Animation) The transition from choosing your next path to loading screen and then into the stage feels jarring. I think it can be smoother, because we will be going through this a lot, and even on my first run it doesn't feel smooth.\n[*] (Animation)  The enhancing stones upgrade page animations can be tightened up. Once again, we'll be on this screen a lot so making it smoother (The animation from selecting which stone to the actual upgrade page could be faster).\n[*] (Relic description) I came across 2 relics that on battle start turn 1 boost movement/magic range. I'm overthinking it, but I couldn't tell if it meant (1) boost the range for 1 turn on battle start or (2) on turn 1, receive a boost to range for the rest of battle.\n[/olist]",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really great tactical roguelight RPG. Highly recommend to anyone who enjoys the genre. A full run takes around 3-6 hours depending on how long you are thinking about your turns. Has solid replay value, and good challenges for difficulty scaling.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is amazing and has the potential for even more. If i had one feedback, it is to keep adding. This game is on the cusp of greatness.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I like turn-based combat games.  This game is very repetitive - there are only so many missions.  But they all play a little differently based on the skills and upgrades you acquire.  It's fun to put together new combos and see how they play out.  Also, one fight doesn't take very long so it's easy to jump in, have a quick fight and then leave.  I like that flexibility.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Final Fantasy Tactics + Slay the Spire + Dungeons & Dragons\n\nThis is my new favorite game. I do agree with others that it has a bit of a mobile game feel and I hope it comes to android in the future. So I bought it for the Nintendo Switch after 14.7 hours playing on my laptop. I love that I can play it on the bus, in the cafe, waiting in line, on the pooper. I love the replayability, the art style, the characters, the story. Just everything. High fantasy is my also favorite genre. Death builds up to a slow crawl of getting stronger and I enjoy the randomness of cards and dice rolls. I never thought I'd be so into an offline 1-player game again. I feel like a young adult discovering Final Fantasy Tactics all over again. -- I can predict when the gameplay will get stale but hopefully they come out with new expansions/adventures and more main characters in the future.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1] Great game for many reasons, with something to improve. [/h1]\n\nThe best things this title has to offer are:\n[list]\n[*] the fight system, which is excellent & offers a lot of tactical possibilities;\n[*] the Hero development: there are 9 different heroes, and the protagonist will unlock a total of 9 classes. So, the real total are 17 characters, though some skills are repetead among them;\n[*] the plot (sad, but beautiful) & dialogues (which are both fun and deep) + EN dubbing (which is superb).\n[/list]\n\nThe things I'd like to be improved with future patches are:\n[list]\n[*] the bestiary: there are few types of enemies, and the fact that they have various skins doesn't fix the problem. The enemies types should be at least doubled;\n[*] the bosses: there are only 5  of them (all of them great, and 3 of them with 3 variants each). I'd like alternative new bosses, with proper plot + dialogues associated.\n[/list]\n\nMy actual rank is a solid 8,4/10. Could become 9 or more if the developers followed my suggestions.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "fire emblem like battles, with rogue like Hades-esque progession of upgrades between runs\r\nthe runs are long so battles and upgrades during the runs feel really\r\nthe writing is actually pretty good, much like the first game\r\nwould recommend if you like any kind of tactics games",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very fun, love the voice acting, been playing great on my steam deck!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun spinoff of the original game.\n\nI just wish it had more customization like sub-classing companions or changing loadouts of MC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game's in early access so keep that in mind if that makes you skittish, but the devs have been slowly and steadily updating things gearing up for a version 1.0 in the near future.\n\nThe game itself is a very solid turn-based strategy roguelike, with a couple of flaws around the metaprogression. \n\nCombat is a streamlined version of the dev's first game: Lost Eidolons (which is also worth a pickup!) and a little on the easier side due to how broken each playable character can get with various upgrades. However a low based difficulty is fixed by a heat/trial system which seems like it will get new and more challenging buffs for enemies. But it's still satisfying to put together and use these broken kits, and it never gets so easy that you can just brain-off a map.\n\nThe main metaprogression is a little shallow. You obtain currency each run to upgrade the altar of flames, but the upgrades are pretty insiginificant stat upgrades with a couple of actually impactful ones here and there. Devs have mentioned changing it but that was quite a few patches ago so I think it's here to stay.\n\nAs for story and characters, I think they've done a really good job of continuing on the world they built in their previous game, without totally tying themselves to the original cast of characters. And it's all told to the player by a very great cast of VA's that are a relatively new addition. I want to learn more about the characters and want to listen to them talk.\n\nAll in all I recommend the game as-is as far as mechanics and design go, and am excited to see the story completed in the release version.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Lost Eidolons: Veil of the Witch is a strong follow-up to the original. The gameplay feels noticeably tighter and more refined compared to Part 1 — combat flows better, and the new mechanics make every battle more engaging.\n\nWhat really stands out this time are the boss fights — they’re far more dynamic and strategic than what you’d find in Fire Emblem, giving every major encounter a sense of weight and danger.\n\nOverall, Veil of the Witch is a very good game and a worthy continuation of the series.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's like a roguelite Fire Emblem. I like it a lot.\n\nEdit: It doesn't seem to be the most ambitious with the amount of content and the quality of textures and animations, but for $20 that's okay. I would much prefer to play a more ambitious $40 or $60 game, though. Seems to be some sloppy work and lack of polish as well as questionable design choices. But overall I recommend if you're into Fire Emblem type games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Super ultimate tactic RPG game! This is what I wait for a long time\nDie and die again but still not get bore! No need to play other game anymore!\nHope that it will have more content, DLC and take my money",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I run an SRPG Youtube channel, I've played more games in the genre than almost anyone and this is genuinely one of the best I've ever played. The runs are perfect length, the story is great, I love the character design and most of all, it just feels good to play. Moving the units around the map and hitting stuff just feels better than most other games in the genre. \n\nYou should definitely pick this one up!",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "I really Like Ocean drive, and them making this fun sequel to their past game. Its a phenominal experience for those who like SRPGs, and Roguelikes!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "It’s still early in the game, but the overall experience — including combat, story, and character progression — is really fun.",
      "voted_up": true,
      "votes_helpful": 4
    }
  ],
  "negative": [
    {
      "review": "[h3]I feel bad leaving a negative review and would choose neutral if that were possible. [/h3]\n\nNever tried the original game. This opinion is from someone who just likes tactics, roguelites and interesting art style.\n\nI liked the game overall — it's challenging and rewarding. I love the animations and the art style. The writing is annoying, and the voiceovers make it even worse, but it’s bearable. What ruined the experience for me was the lack of map variety. Obstacles and enemies are always in the same positions, and the dialogues before battles are the same too. The roguelite mantra is: repeat the same, but make it different. Unfortunately, Vail of the Witch fails to follow it — with “the same” being too much and “different” being too little.\n\nI still think you should try the game if it looks appealing to you and if you like turn-based tactics — especially if you’re used to the Western style and have never tried an Asian take on it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really wanted to recommend this game because it has a lot of good things, but unfortunately the lack of longevity and the combat system blunders are just to much for me to ignore. It might be better suited for those that love random events and progression or for those that like the slay the tower type of games, but it's definitely not designed for those that love strategic combat, character progression and non linear stories.\n\nThe threat zones are a disappointment as sometime they work sometime they don't, meaning that if an enemy has to enter one then they have to stop, but if they are already inside one they can just more freely wherever they want.\n\nThe lack of movement after the attack option is a major blunder, you can move and attack but you cannot attack and then move, this makes no sense to me.\n\nThe talents are rolled at random, you cannot really build a character, but you just have to accept the random cards you get. Also at the end of the expedition you go back to level 1 and have to do it again, which kills the sense of progression. It would have made much more sense if you could have kept some of the talents while forgetting others, and still have some character progression.\n\nAlso the lack of real 3d is another dealbreaker, you can only move in 2 dimensions (up, down, left right, that's it), which severely impacts the strategy of all turn based games.\n\nThe plot is also very bland and linear. with just some voice acting to keep you a bit immersed, too little. In the end this might be a fun game to play for few hours, but not enough to get you hooked IMHO. It's a missed opportunity though, because the engine is good and there's a certain balance that could have used much, much better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I wanted to like this game, but I don't.\n\nThis game is what XCOM: Chimera Squad is to XCOM2. It's charming, but it does not live up to its predecessor by any means except combat. It's also comparable to what Darkest Dungeon 2 is to DD1. I really hate this trend in gaming of making bogged down phone and tablet spin-offs of highly successful games. \n\nPROS:\n- The characters are in line with the original series. They're not very complicated, but likeable.\n- The combat is mostly an improvement to the original, but with a few hiccups.\n- I like some of the new trinkets.\n- The missions are mostly pleasant, although small scale versions of the original.\n\nCONS:\n- The repetitive, rogue-like structure of the game is not satisfying. I recommend Hades instead.\n- The game is meant to be failed, like most other rogue-likes, but this game fails to realise that the charm of rogue-likes is that you get to develop your characters, strengthen them, meet familiar characters with new dialogue and build a better HQ like in Darkest Dungeon. \n- There is very little improvement for each new round of failure. It's a steady grind. I like grinds, but this is way too much gameplay for too little of a reward. Playing Tetris on repeat at least gives you the goal of beating your own score. This game doesn't even do that.\n- They completely removed many features of the original game, which is what made Lost Eidolons great to begin with, like a character system with building relationships, and training for classes and improving armour. These systems are already made. I don't know why they couldn't just have implemented them into the game.\n\nThe only reason to buy this game is to support the studio so they can make a Lost Eidolons 2.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ist ehrlich in Ordnung, aber der Gameplay Loop wird sehr schnell \"anstrengend\". Die Charakter Upgrades scheinen auch nicht unglaublich unterschiedlich zu sein, sodass sich die Runs schnell gleich anfühlen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I received this game for free via Keymailer. I do not like this game. I am all for a game that's difficult or makes the choices you've made feel like they have weight, but this isn't that. A lot of the battles feel unwinnable or like they are forcing you to run away or wait for the enemies to kill each other off. You are better off playing ranged than ever getting close and constantly skirting outside of your enemies attack range. Then when you die you just go back to town, get a few upgrades, and do it all over again. I do somewhat like that I get a second chance but I'd rather have a fighting chance than feel like every enemy does significantly more damage than me, die and start from scratch than play this game as it is. On the positive note, there is tons of voice acting and the story is legitimately interesting. I might try and slog through it just for the story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Combat is the same but it removes the strategy element of choosing your upgrades and skills and replaces it with a RNG/card mechanic.  For that, I have to down vote.\n\nYou may like more content.  It does have story elements and such.\n\nIt is a bit grindy as you replay the same thing , same map multiple times.  You an make it more difficult by choosing restrictions and such which is nice but that does not make up for loss of the strategy / RPG elemement.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wish there was a mixed option in Steam. This game has decent bones, but the runs are just a slog. They take so long and do not have much variety once you start your 3rd one. I like the characters and the idea, but the  individual areas just become a chore to get through.\n\nUpdate. I'm very happy to hear the developer take criticism and work towards better the product. This game had loads of potential, and I look forward to revisiting it in the future.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately, all this game does is make me wish a proper sequel for lost eidolons came out instead. The range of combat tools has improved (once you've progressed enough) but all other aspects feel worse. \n\nThe roguelite aspect bogs it down in repetitive combat scenarios with absolutely minimal payoff. \n\nIn the campaign of the first game relationships build at a good pace and feel natural, here you get a sentence or two every 30 mins, making it very disjointed. \n\nLevelling up weapons and armour in the first game felt satisfying as you were building up your strength through using those weapons, to benefit the rest of the campaign, but here you know you're just going to lose it all once the small repetitive run is over. \n\nAll the long term progress is diverted to resource collection overload for the abstract exchanges in base between runs.\n\nI really hope the studio goes back to the ambition of their first game for any other projects down the line.\n\n\n\nEdit: I really didn't expect the dev response. The moment you guys go back to a campaign like the first game, in another game (sequel or otherwise) i'll be there! Thanks for the response. In terms of making this specific game better, the number one thing for me would be making relationship development MUCH faster, with opportunities for that banter to occur frequently during the runs, rather than just a big list of unlocked options at base. Right now the runs feel very empty in that regard, apart from the occasional ally you get to pick up for a bit.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "I can't quite put my finger on it, but the tactical battles are just not fun, zoc mechanic is weird and I still haven't figured it out, enemies randomly decide to attack my squishies while right next to my tankier guys with no consequences. \n\nSo, instead of real tactics, or using environment/los you just end up trying to find a position where they can't reach you. On this note, the maps are non existent, a few bumps and some water holes don't qualify as a combat map. You need stuff like high low ground, los elements and more visual variety. \n\nThe game would be much more fun if the partnership effects were more pronounced so you could actually use them in combat instead of getting them randomly and that rarely.\n\nAs it stands, for me at least, combat needs quite a few changes to make it work. The rest of the game is fine, I like the art and the rogue lite aspect is OK, not all games need a story/campaign. If the fights were fun I'd play more. May check back in the future.\n\nPs Laurent range is ridiculous, he's supposed to be wizard but has the range of a spearman?",
      "voted_up": false,
      "votes_helpful": 118
    },
    {
      "review": "[h3]I feel bad leaving a negative review and would choose neutral if that were possible. [/h3]\n\nNever tried the original game. This opinion is from someone who just likes tactics, roguelites and interesting art style.\n\nI liked the game overall — it's challenging and rewarding. I love the animations and the art style. The writing is annoying, and the voiceovers make it even worse, but it’s bearable. What ruined the experience for me was the lack of map variety. Obstacles and enemies are always in the same positions, and the dialogues before battles are the same too. The roguelite mantra is: repeat the same, but make it different. Unfortunately, Vail of the Witch fails to follow it — with “the same” being too much and “different” being too little.\n\nI still think you should try the game if it looks appealing to you and if you like turn-based tactics — especially if you’re used to the Western style and have never tried an Asian take on it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Note that this title has outside of combat mechanics, no other gameplay element that is similar to Lost Eidolons, and is simply a roguelike set in the same world narratively. Even narratively, there are very little references back to the original, and should be considered a spin-off.\r\n\r\nAs a roguelike it doesn't add anything new to the formula, with pathings similar to wartorn.\r\nFights are very repetitive, with boss fights as hard gates to your runs. Every failure will see you got to slog thru all the nodes again with random level up upgrades.\r\n\r\nStrongly recommend this game if you do not have better use of your time (like to explore what other titles steam got to offer)",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Boring and very repetitive game. The first one was way better. The roguelike formula doesnt work. U just keep doing the same thing over... and over... again, and from the start. Character progression is none almost... map design? inexistent - all flat, no tangible originality between them. The story or at least how is told... meh.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game helped me realize I don't like Roguelites/likes. I don't want to play Lost Eidolons: Hades. I don't need developers to waste my life with meaningless grind while they drip-feed a short story to me over 50 hours of tedium. This should have been a mobile game. They'd have made more off of it to put toward the next real project and the people who would have bought it are actually looking to have their time/life wasted. I wish I could refund this. On principle.\n\nNow, with this newfound realization, I have a wishlist to prune.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "TLDR: The game becomes a chore.\n\nThe game is fun...for the first 2-3 runs. The mechanics are fine for TRPG and a roguelite, but there is such very little incentive to motivate you for doing repeated runs. The maps and content get very old very fast, and the only real things that can change are:\n- Making the run harder for yourself (you get more upgrade materials to be stronger in future runs)\n- Artifacts/upgrades to make your runs easier to deal with said difficulty mods mentioned above\n\nThere is a true end to the story, and some new units and story you can unlock, but the progress for them is so slow you'll feel like the gameplay is a chore by the time you unlock everything...AND THEN DO IT AGAIN TO USE THE UNLOCKABLES. \n\nFinally, the story and voice acting is fine, but music is pretty forgetable. The game is fine for 20USD, but definitely not for everyone.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is awful. I wanted to give it a shot because I normally love turn-based RPGs, but now I really regret not refunding, even though I got it on sale.\n\nI play A LOT of turn-based games, and this is just so bare bones. If this game was made by a single dev, I might not be so harsh...but it's from a studio.\n\nUnits do not have engagement, so there are no attacks of opportunity no matter how many enemies run right past your front line units. This means that you cannot limit movement of enemy units with positioning. You cannot have tank units control the battlefield at all. Enemies run around anywhere they want almost any time they want. Because there are ZERO penalties for running right past your units, the enemy always gangs up on single units at a time, killing them quickly.\n\nSo far...zero Area of Effect (AOE) attacks or spells. Your gigantic ax or massive two-handed sword can hit exactly ONE enemy per turn. No sweeps. No spins. Your fireball spell affects ONE enemy. Your lightning bolt hits ONE enemy...no lining up shots to punish the enemy in groups. My big crushing special attack with my main character does exactly 2 points more damage than a normal attack...so basically 38 points of damage versus WHOA 40. \n\nBows are virtually useless. They have a range of fire that is only one single square beyond a unit using a spear, so their range is basically 10 feet or so....TOTAL. Spells are equally short ranged. What game has bows limited to a range of 10 feet?\n\nMaps are so BORING. Very little variation. No differences in elevation. Some water. Some poison clouds. Otherwise, you are fighting on a big open map with maybe a rock formation or two.\n\nWAY too much talking! It seems like half of the game is clicking through boring conversations just so you can do something other than listen to some dumb tale for 10-20 minutes real time.\n\nThe voice actor for the main character (played as a male) is not the guy for this job. He sounds totally out of place, like some hipster slinging pick-up lines in a nightclub...not a warrior and champion who deals death to his foes. This may seem like a petty issue, but you have to listen to SO MUCH TALKING that it eventually starts to grate. I think that the appropriate description here is \"smarmy,\" and that is not a term I bust out often.\n\nThe nail in the coffin is the fact that everything is stacked against you in the first boss battle. They make you grind and grind to get enough permanent upgrades to advance. There is no way to progress without grinding, no matter how well you play. They FORCE the grind on you and you absolutely cannot win until you grind out the upgrades you need to advance. I just keep asking myself, \"Why am I doing this rather than doing something I actually enjoy?\"",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "A vary bare-bones game. I hoped it would become more interesting the more I played, but I found it to be pretty boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I honestly really want to like this game but like it's predecessor they really do not know how to balance bosses. Just like with Lost Eidolons the original game every thing is, generally speaking, fine until you get to a boss and then they just throw in mechanics and abilities that are on a whole other level. I feel like I'm going from a tactical game to a half baked stupid MMO boss encounter that just ruins the whole vibe of the game for me. I'll keep playing from time to time but as much as I really want to love this game it just becomes not fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really wanted to recommend this game because it has a lot of good things, but unfortunately the lack of longevity and the combat system blunders are just to much for me to ignore. It might be better suited for those that love random events and progression or for those that like the slay the tower type of games, but it's definitely not designed for those that love strategic combat, character progression and non linear stories.\n\nThe threat zones are a disappointment as sometime they work sometime they don't, meaning that if an enemy has to enter one then they have to stop, but if they are already inside one they can just more freely wherever they want.\n\nThe lack of movement after the attack option is a major blunder, you can move and attack but you cannot attack and then move, this makes no sense to me.\n\nThe talents are rolled at random, you cannot really build a character, but you just have to accept the random cards you get. Also at the end of the expedition you go back to level 1 and have to do it again, which kills the sense of progression. It would have made much more sense if you could have kept some of the talents while forgetting others, and still have some character progression.\n\nAlso the lack of real 3d is another dealbreaker, you can only move in 2 dimensions (up, down, left right, that's it), which severely impacts the strategy of all turn based games.\n\nThe plot is also very bland and linear. with just some voice acting to keep you a bit immersed, too little. In the end this might be a fun game to play for few hours, but not enough to get you hooked IMHO. It's a missed opportunity though, because the engine is good and there's a certain balance that could have used much, much better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its fine game for couple runs but then it gets very grindy with very tough bosses with little variety between the runs. It didn't didn't need to be roguelike.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's a good concept and the gameplay offers a nice mix of roguelite and fire emblem / TRPG mechanics, but the biggest sticking point is a severe lack of variety in the battle maps and scenarios. For a roguelite, there just needs to be more than the 10 or so battle scenarios that the game currently offers, and the very limited number of bosses as well. It grows stale very quickly, and leaves you wanting more. I would wait on this one until they potentially create more content",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I feel like this game should have been right up my ally. Unfortunately, it doesn't deliver what I wanted from it.\r\n\r\nIt implement turn based tactical game play well. It may be a tad too forgiving with the rewind mechanics, and a tad too easy baseline. Out of 5 runs I only lost the first at the final boss of that run. After beating the story on the second and third run, adding on the levels of post game difficulty scaling options. This mostly made the runs a bit slower, but not wildly different than before. \r\n\r\nNone of that really means it's a bad game. The point that I feel does edge it towards that direction is the fact that over the course of these runs, I never unlocked any of the four additional characters. I only even started meeting one of them. It seems like the game expects you to do a lot more runs than I did to even begin their stories, and that's a problem when runs mostly feel the same and take several hours to complete. \r\n\r\nThe meta roguelike mechanics just mesh poorly with the rest of the design of the game since they require many runs to unlock, the time required for each run is so long, and each run mostly feels the same.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For Reference, I did play the first game and loved it. I was expecting this game to at least be similar to the first. \r\nFirst complaint: \"Camp\" is underwhelming, even taking into account that they were trying to make the game run smoother compared to the first. People don't necessarily care about walking around a physical camp as much as they do about mechanics that are fun and interesting. This part was not.\r\nSecond complaint: Making it a Roguelike game kind of hurt the unique charm of the original. Since with roguelikes you have a limit to map generation ability. This makes the combat maps boring. In the original they had many unique battles while the boss fights are the only ones that feel unique in this one. Also, bringing in the same or similar bosses to the original game means that the quality of this one is lessened. The devs couldn't even come up with something new and fun? That makes this feel like a shameless cash grab and not something that a group of people lovingly made like the first game.\r\nThird complaint: The relationships between the characters are, at best, boring. They lack substance, the motivations of the main character, even after unlocking more of the story are flimsy. The unknown entity that throws you into this doesn't seem to have an actual agenda that makes any sense until (presumably) you get very far into the game. My best guess is really that they are forcing you into a proxy war against another similar entity, since I haven't made it that far. But now I probably won't. The story is a large part of why I play tactical RPG's, and the story here falls short. It feels like it was thrown together in 5 minutes by a group of people who are just trying to milk the success of the first game. \r\nFourth complaint: No new classes, and only a couple new abilities compared to the original. Even the Mercenaries series games, which re-use many of their classes and abilities, was more worth playing than this because they actually made the characters feel unique and fun, while this game did not. Even other roguelike tactical rpg's feel better than this because they were, at their core, roguelikes. If you were going to switch, you should have really improved the roguelike aspects, and make each playthrough feel unique and fun, but it fails to even do that. Part of the charm is that each round feels like your characters have still improved in some way, even if they haven't reached their end goal. I've played phone games that do a better job than this. \r\n\r\nI may be biased after the first game, but I will probably uninstall and never touch this again. Waste of my money and time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to like this game, but I don't.\n\nThis game is what XCOM: Chimera Squad is to XCOM2. It's charming, but it does not live up to its predecessor by any means except combat. It's also comparable to what Darkest Dungeon 2 is to DD1. I really hate this trend in gaming of making bogged down phone and tablet spin-offs of highly successful games. \n\nPROS:\n- The characters are in line with the original series. They're not very complicated, but likeable.\n- The combat is mostly an improvement to the original, but with a few hiccups.\n- I like some of the new trinkets.\n- The missions are mostly pleasant, although small scale versions of the original.\n\nCONS:\n- The repetitive, rogue-like structure of the game is not satisfying. I recommend Hades instead.\n- The game is meant to be failed, like most other rogue-likes, but this game fails to realise that the charm of rogue-likes is that you get to develop your characters, strengthen them, meet familiar characters with new dialogue and build a better HQ like in Darkest Dungeon. \n- There is very little improvement for each new round of failure. It's a steady grind. I like grinds, but this is way too much gameplay for too little of a reward. Playing Tetris on repeat at least gives you the goal of beating your own score. This game doesn't even do that.\n- They completely removed many features of the original game, which is what made Lost Eidolons great to begin with, like a character system with building relationships, and training for classes and improving armour. These systems are already made. I don't know why they couldn't just have implemented them into the game.\n\nThe only reason to buy this game is to support the studio so they can make a Lost Eidolons 2.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really should put Rogue-like in the game tags and absolutely mention it as one of the first things around the game. The previous Lost Eidolons game wasn't RogueLike and so i didn't think this one was either until I lost a fight and was surprised to learn it was RogueLike as it's not in the tags which I always scan for as I don't like RogueLike games at all lol, just seems a cheap way to add length to games instead of actually working on real growth and opponent scaling in a game which is exactly how this feels. Same bosses over and over, same skills over and over. I play strategy games for the strategy of them and the growth throughout the game and the building of your characters and stats and development. RogueLike generally ruins all this. Wouldn't have bought it if I knew it was RogueLike and was properly tagged as such and can't refund it because I played longer than an hour and so will play a bit until I get so sick of the awful RogueLike mechanics i quit. Too bad cause I did enjoy the storyline very much and loved the first Lost Eidolons game but won't be playing this one for too much longer sadly. Update: played a few more hours and am done with the game, you barely carry anything over from run to run and the Rogue-like just makes it unpleasant to play when you find a build you like and then lose it all at the end of a run and just have to hope you get the same skills next time or be frustrated you're back at square one.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I liked this game, but after 20 hours or so, i Realised that I've played every combat scenario. There's like, 10? of them? \r\n\r\nFor a roguelike, this is quite unnacceptable, as every playthrough should be different. The only fun parts are going against bosses, but it's a total slog getting there. \r\n\r\nGet this game for like $10 tbh\r\n\r\nVoice acting is awesome tho~",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ist ehrlich in Ordnung, aber der Gameplay Loop wird sehr schnell \"anstrengend\". Die Charakter Upgrades scheinen auch nicht unglaublich unterschiedlich zu sein, sodass sich die Runs schnell gleich anfühlen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Slow progress, way too few different encounters and enemies, it is extremely repetitive, the story is uninspired, boring and downright bad, bad acting, items are incredibly boring, most of the trinkets are just bad because they are too limited, would be better if they were all passives, there are too many active skills which you can only use once per turn, but most of them are just the same skill on different characters, it's incredibly unbalanced, ie. one skill gives you 30%(45%) chance to negate a debuff, another gives you 30%(45%) to reflect a debuff, rarity of skills does not seem to have any value either in strength or how hard they are to get.\r\n\r\nBut the worst thing of all by a large margin is the stat system, you can choose a stat card on most levelups, but if you choose to invest a lot in one skill there seems to be a system i place to make sure you get less and less of that stat as it grows, making it nearly impossible to actually build a character as you want, the game will auto balance you into the character they think you should play.\r\n\r\nNot worth buying, they should pay us to waste our time, I wholeheartedly regret wasting time and money on both this and the first game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a hard no from me.\n\nI find the tactics lacking, no zone of control, too many enemies taking too long to defeat despite not providing much challenge.\n\nIt is a war of attrition where simple numbers slowly wear your your HP down over time.\n\nLevel ups are boring providing things such as +3% to critical chance or  +4% to guard ECT ect \n\nBoring .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Little too easy? Ended up beating game 3rd time and haven't lost a run since. \nThere are only a few maps. The missions are all the same but in a different order. Once you solve it once it is solved for life. The bosses. \n\nAt half a price it is a good deal.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It maybe ok, not sure I die and then get taken back to base and have to start all over. Ok, so lose levels, equipment bonus etc.. that's fine. But if I choose to go back to base... i die... lose everything... makes no sense from game or story.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bought this game because I really enjoyed Lost Eidolons. Played it extensively in beta. Even wrote up the start of a guide/compendium for the game. Then I found out they were casting Shara Kirby for the voice roles. Shara Kirby, who participated in the organized harassment of Jacob Takanashi, like the classless individual she is.\r\n\r\nI can't change that they made this choice. I can stop supporting the studio, though. Maybe in the future they'll choose not to hire awful people who abuse and harass others, but for now, they've lost my support. I probably won't buy anything else from them, either, since even if they never hire another abusive jerk again, her voice is still in this game. The game had real potential. Sorry to see them embrace abuse and harassment so openly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I received this game for free via Keymailer. I do not like this game. I am all for a game that's difficult or makes the choices you've made feel like they have weight, but this isn't that. A lot of the battles feel unwinnable or like they are forcing you to run away or wait for the enemies to kill each other off. You are better off playing ranged than ever getting close and constantly skirting outside of your enemies attack range. Then when you die you just go back to town, get a few upgrades, and do it all over again. I do somewhat like that I get a second chance but I'd rather have a fighting chance than feel like every enemy does significantly more damage than me, die and start from scratch than play this game as it is. On the positive note, there is tons of voice acting and the story is legitimately interesting. I might try and slog through it just for the story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Combat is the same but it removes the strategy element of choosing your upgrades and skills and replaces it with a RNG/card mechanic.  For that, I have to down vote.\n\nYou may like more content.  It does have story elements and such.\n\nIt is a bit grindy as you replay the same thing , same map multiple times.  You an make it more difficult by choosing restrictions and such which is nice but that does not make up for loss of the strategy / RPG elemement.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wish there was a mixed option in Steam. This game has decent bones, but the runs are just a slog. They take so long and do not have much variety once you start your 3rd one. I like the characters and the idea, but the  individual areas just become a chore to get through.\n\nUpdate. I'm very happy to hear the developer take criticism and work towards better the product. This game had loads of potential, and I look forward to revisiting it in the future.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately, all this game does is make me wish a proper sequel for lost eidolons came out instead. The range of combat tools has improved (once you've progressed enough) but all other aspects feel worse. \n\nThe roguelite aspect bogs it down in repetitive combat scenarios with absolutely minimal payoff. \n\nIn the campaign of the first game relationships build at a good pace and feel natural, here you get a sentence or two every 30 mins, making it very disjointed. \n\nLevelling up weapons and armour in the first game felt satisfying as you were building up your strength through using those weapons, to benefit the rest of the campaign, but here you know you're just going to lose it all once the small repetitive run is over. \n\nAll the long term progress is diverted to resource collection overload for the abstract exchanges in base between runs.\n\nI really hope the studio goes back to the ambition of their first game for any other projects down the line.\n\n\n\nEdit: I really didn't expect the dev response. The moment you guys go back to a campaign like the first game, in another game (sequel or otherwise) i'll be there! Thanks for the response. In terms of making this specific game better, the number one thing for me would be making relationship development MUCH faster, with opportunities for that banter to occur frequently during the runs, rather than just a big list of unlocked options at base. Right now the runs feel very empty in that regard, apart from the occasional ally you get to pick up for a bit.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "I can't quite put my finger on it, but the tactical battles are just not fun, zoc mechanic is weird and I still haven't figured it out, enemies randomly decide to attack my squishies while right next to my tankier guys with no consequences. \n\nSo, instead of real tactics, or using environment/los you just end up trying to find a position where they can't reach you. On this note, the maps are non existent, a few bumps and some water holes don't qualify as a combat map. You need stuff like high low ground, los elements and more visual variety. \n\nThe game would be much more fun if the partnership effects were more pronounced so you could actually use them in combat instead of getting them randomly and that rarely.\n\nAs it stands, for me at least, combat needs quite a few changes to make it work. The rest of the game is fine, I like the art and the rogue lite aspect is OK, not all games need a story/campaign. If the fights were fun I'd play more. May check back in the future.\n\nPs Laurent range is ridiculous, he's supposed to be wizard but has the range of a spearman?",
      "voted_up": false,
      "votes_helpful": 118
    },
    {
      "review": "[h3]I feel bad leaving a negative review and would choose neutral if that were possible. [/h3]\n\nNever tried the original game. This opinion is from someone who just likes tactics, roguelites and interesting art style.\n\nI liked the game overall — it's challenging and rewarding. I love the animations and the art style. The writing is annoying, and the voiceovers make it even worse, but it’s bearable. What ruined the experience for me was the lack of map variety. Obstacles and enemies are always in the same positions, and the dialogues before battles are the same too. The roguelite mantra is: repeat the same, but make it different. Unfortunately, Vail of the Witch fails to follow it — with “the same” being too much and “different” being too little.\n\nI still think you should try the game if it looks appealing to you and if you like turn-based tactics — especially if you’re used to the Western style and have never tried an Asian take on it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Note that this title has outside of combat mechanics, no other gameplay element that is similar to Lost Eidolons, and is simply a roguelike set in the same world narratively. Even narratively, there are very little references back to the original, and should be considered a spin-off.\r\n\r\nAs a roguelike it doesn't add anything new to the formula, with pathings similar to wartorn.\r\nFights are very repetitive, with boss fights as hard gates to your runs. Every failure will see you got to slog thru all the nodes again with random level up upgrades.\r\n\r\nStrongly recommend this game if you do not have better use of your time (like to explore what other titles steam got to offer)",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Boring and very repetitive game. The first one was way better. The roguelike formula doesnt work. U just keep doing the same thing over... and over... again, and from the start. Character progression is none almost... map design? inexistent - all flat, no tangible originality between them. The story or at least how is told... meh.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game helped me realize I don't like Roguelites/likes. I don't want to play Lost Eidolons: Hades. I don't need developers to waste my life with meaningless grind while they drip-feed a short story to me over 50 hours of tedium. This should have been a mobile game. They'd have made more off of it to put toward the next real project and the people who would have bought it are actually looking to have their time/life wasted. I wish I could refund this. On principle.\n\nNow, with this newfound realization, I have a wishlist to prune.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "TLDR: The game becomes a chore.\n\nThe game is fun...for the first 2-3 runs. The mechanics are fine for TRPG and a roguelite, but there is such very little incentive to motivate you for doing repeated runs. The maps and content get very old very fast, and the only real things that can change are:\n- Making the run harder for yourself (you get more upgrade materials to be stronger in future runs)\n- Artifacts/upgrades to make your runs easier to deal with said difficulty mods mentioned above\n\nThere is a true end to the story, and some new units and story you can unlock, but the progress for them is so slow you'll feel like the gameplay is a chore by the time you unlock everything...AND THEN DO IT AGAIN TO USE THE UNLOCKABLES. \n\nFinally, the story and voice acting is fine, but music is pretty forgetable. The game is fine for 20USD, but definitely not for everyone.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is awful. I wanted to give it a shot because I normally love turn-based RPGs, but now I really regret not refunding, even though I got it on sale.\n\nI play A LOT of turn-based games, and this is just so bare bones. If this game was made by a single dev, I might not be so harsh...but it's from a studio.\n\nUnits do not have engagement, so there are no attacks of opportunity no matter how many enemies run right past your front line units. This means that you cannot limit movement of enemy units with positioning. You cannot have tank units control the battlefield at all. Enemies run around anywhere they want almost any time they want. Because there are ZERO penalties for running right past your units, the enemy always gangs up on single units at a time, killing them quickly.\n\nSo far...zero Area of Effect (AOE) attacks or spells. Your gigantic ax or massive two-handed sword can hit exactly ONE enemy per turn. No sweeps. No spins. Your fireball spell affects ONE enemy. Your lightning bolt hits ONE enemy...no lining up shots to punish the enemy in groups. My big crushing special attack with my main character does exactly 2 points more damage than a normal attack...so basically 38 points of damage versus WHOA 40. \n\nBows are virtually useless. They have a range of fire that is only one single square beyond a unit using a spear, so their range is basically 10 feet or so....TOTAL. Spells are equally short ranged. What game has bows limited to a range of 10 feet?\n\nMaps are so BORING. Very little variation. No differences in elevation. Some water. Some poison clouds. Otherwise, you are fighting on a big open map with maybe a rock formation or two.\n\nWAY too much talking! It seems like half of the game is clicking through boring conversations just so you can do something other than listen to some dumb tale for 10-20 minutes real time.\n\nThe voice actor for the main character (played as a male) is not the guy for this job. He sounds totally out of place, like some hipster slinging pick-up lines in a nightclub...not a warrior and champion who deals death to his foes. This may seem like a petty issue, but you have to listen to SO MUCH TALKING that it eventually starts to grate. I think that the appropriate description here is \"smarmy,\" and that is not a term I bust out often.\n\nThe nail in the coffin is the fact that everything is stacked against you in the first boss battle. They make you grind and grind to get enough permanent upgrades to advance. There is no way to progress without grinding, no matter how well you play. They FORCE the grind on you and you absolutely cannot win until you grind out the upgrades you need to advance. I just keep asking myself, \"Why am I doing this rather than doing something I actually enjoy?\"",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "A vary bare-bones game. I hoped it would become more interesting the more I played, but I found it to be pretty boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I honestly really want to like this game but like it's predecessor they really do not know how to balance bosses. Just like with Lost Eidolons the original game every thing is, generally speaking, fine until you get to a boss and then they just throw in mechanics and abilities that are on a whole other level. I feel like I'm going from a tactical game to a half baked stupid MMO boss encounter that just ruins the whole vibe of the game for me. I'll keep playing from time to time but as much as I really want to love this game it just becomes not fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really wanted to recommend this game because it has a lot of good things, but unfortunately the lack of longevity and the combat system blunders are just to much for me to ignore. It might be better suited for those that love random events and progression or for those that like the slay the tower type of games, but it's definitely not designed for those that love strategic combat, character progression and non linear stories.\n\nThe threat zones are a disappointment as sometime they work sometime they don't, meaning that if an enemy has to enter one then they have to stop, but if they are already inside one they can just more freely wherever they want.\n\nThe lack of movement after the attack option is a major blunder, you can move and attack but you cannot attack and then move, this makes no sense to me.\n\nThe talents are rolled at random, you cannot really build a character, but you just have to accept the random cards you get. Also at the end of the expedition you go back to level 1 and have to do it again, which kills the sense of progression. It would have made much more sense if you could have kept some of the talents while forgetting others, and still have some character progression.\n\nAlso the lack of real 3d is another dealbreaker, you can only move in 2 dimensions (up, down, left right, that's it), which severely impacts the strategy of all turn based games.\n\nThe plot is also very bland and linear. with just some voice acting to keep you a bit immersed, too little. In the end this might be a fun game to play for few hours, but not enough to get you hooked IMHO. It's a missed opportunity though, because the engine is good and there's a certain balance that could have used much, much better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its fine game for couple runs but then it gets very grindy with very tough bosses with little variety between the runs. It didn't didn't need to be roguelike.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's a good concept and the gameplay offers a nice mix of roguelite and fire emblem / TRPG mechanics, but the biggest sticking point is a severe lack of variety in the battle maps and scenarios. For a roguelite, there just needs to be more than the 10 or so battle scenarios that the game currently offers, and the very limited number of bosses as well. It grows stale very quickly, and leaves you wanting more. I would wait on this one until they potentially create more content",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I feel like this game should have been right up my ally. Unfortunately, it doesn't deliver what I wanted from it.\r\n\r\nIt implement turn based tactical game play well. It may be a tad too forgiving with the rewind mechanics, and a tad too easy baseline. Out of 5 runs I only lost the first at the final boss of that run. After beating the story on the second and third run, adding on the levels of post game difficulty scaling options. This mostly made the runs a bit slower, but not wildly different than before. \r\n\r\nNone of that really means it's a bad game. The point that I feel does edge it towards that direction is the fact that over the course of these runs, I never unlocked any of the four additional characters. I only even started meeting one of them. It seems like the game expects you to do a lot more runs than I did to even begin their stories, and that's a problem when runs mostly feel the same and take several hours to complete. \r\n\r\nThe meta roguelike mechanics just mesh poorly with the rest of the design of the game since they require many runs to unlock, the time required for each run is so long, and each run mostly feels the same.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For Reference, I did play the first game and loved it. I was expecting this game to at least be similar to the first. \r\nFirst complaint: \"Camp\" is underwhelming, even taking into account that they were trying to make the game run smoother compared to the first. People don't necessarily care about walking around a physical camp as much as they do about mechanics that are fun and interesting. This part was not.\r\nSecond complaint: Making it a Roguelike game kind of hurt the unique charm of the original. Since with roguelikes you have a limit to map generation ability. This makes the combat maps boring. In the original they had many unique battles while the boss fights are the only ones that feel unique in this one. Also, bringing in the same or similar bosses to the original game means that the quality of this one is lessened. The devs couldn't even come up with something new and fun? That makes this feel like a shameless cash grab and not something that a group of people lovingly made like the first game.\r\nThird complaint: The relationships between the characters are, at best, boring. They lack substance, the motivations of the main character, even after unlocking more of the story are flimsy. The unknown entity that throws you into this doesn't seem to have an actual agenda that makes any sense until (presumably) you get very far into the game. My best guess is really that they are forcing you into a proxy war against another similar entity, since I haven't made it that far. But now I probably won't. The story is a large part of why I play tactical RPG's, and the story here falls short. It feels like it was thrown together in 5 minutes by a group of people who are just trying to milk the success of the first game. \r\nFourth complaint: No new classes, and only a couple new abilities compared to the original. Even the Mercenaries series games, which re-use many of their classes and abilities, was more worth playing than this because they actually made the characters feel unique and fun, while this game did not. Even other roguelike tactical rpg's feel better than this because they were, at their core, roguelikes. If you were going to switch, you should have really improved the roguelike aspects, and make each playthrough feel unique and fun, but it fails to even do that. Part of the charm is that each round feels like your characters have still improved in some way, even if they haven't reached their end goal. I've played phone games that do a better job than this. \r\n\r\nI may be biased after the first game, but I will probably uninstall and never touch this again. Waste of my money and time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to like this game, but I don't.\n\nThis game is what XCOM: Chimera Squad is to XCOM2. It's charming, but it does not live up to its predecessor by any means except combat. It's also comparable to what Darkest Dungeon 2 is to DD1. I really hate this trend in gaming of making bogged down phone and tablet spin-offs of highly successful games. \n\nPROS:\n- The characters are in line with the original series. They're not very complicated, but likeable.\n- The combat is mostly an improvement to the original, but with a few hiccups.\n- I like some of the new trinkets.\n- The missions are mostly pleasant, although small scale versions of the original.\n\nCONS:\n- The repetitive, rogue-like structure of the game is not satisfying. I recommend Hades instead.\n- The game is meant to be failed, like most other rogue-likes, but this game fails to realise that the charm of rogue-likes is that you get to develop your characters, strengthen them, meet familiar characters with new dialogue and build a better HQ like in Darkest Dungeon. \n- There is very little improvement for each new round of failure. It's a steady grind. I like grinds, but this is way too much gameplay for too little of a reward. Playing Tetris on repeat at least gives you the goal of beating your own score. This game doesn't even do that.\n- They completely removed many features of the original game, which is what made Lost Eidolons great to begin with, like a character system with building relationships, and training for classes and improving armour. These systems are already made. I don't know why they couldn't just have implemented them into the game.\n\nThe only reason to buy this game is to support the studio so they can make a Lost Eidolons 2.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really should put Rogue-like in the game tags and absolutely mention it as one of the first things around the game. The previous Lost Eidolons game wasn't RogueLike and so i didn't think this one was either until I lost a fight and was surprised to learn it was RogueLike as it's not in the tags which I always scan for as I don't like RogueLike games at all lol, just seems a cheap way to add length to games instead of actually working on real growth and opponent scaling in a game which is exactly how this feels. Same bosses over and over, same skills over and over. I play strategy games for the strategy of them and the growth throughout the game and the building of your characters and stats and development. RogueLike generally ruins all this. Wouldn't have bought it if I knew it was RogueLike and was properly tagged as such and can't refund it because I played longer than an hour and so will play a bit until I get so sick of the awful RogueLike mechanics i quit. Too bad cause I did enjoy the storyline very much and loved the first Lost Eidolons game but won't be playing this one for too much longer sadly. Update: played a few more hours and am done with the game, you barely carry anything over from run to run and the Rogue-like just makes it unpleasant to play when you find a build you like and then lose it all at the end of a run and just have to hope you get the same skills next time or be frustrated you're back at square one.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I liked this game, but after 20 hours or so, i Realised that I've played every combat scenario. There's like, 10? of them? \r\n\r\nFor a roguelike, this is quite unnacceptable, as every playthrough should be different. The only fun parts are going against bosses, but it's a total slog getting there. \r\n\r\nGet this game for like $10 tbh\r\n\r\nVoice acting is awesome tho~",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ist ehrlich in Ordnung, aber der Gameplay Loop wird sehr schnell \"anstrengend\". Die Charakter Upgrades scheinen auch nicht unglaublich unterschiedlich zu sein, sodass sich die Runs schnell gleich anfühlen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Slow progress, way too few different encounters and enemies, it is extremely repetitive, the story is uninspired, boring and downright bad, bad acting, items are incredibly boring, most of the trinkets are just bad because they are too limited, would be better if they were all passives, there are too many active skills which you can only use once per turn, but most of them are just the same skill on different characters, it's incredibly unbalanced, ie. one skill gives you 30%(45%) chance to negate a debuff, another gives you 30%(45%) to reflect a debuff, rarity of skills does not seem to have any value either in strength or how hard they are to get.\r\n\r\nBut the worst thing of all by a large margin is the stat system, you can choose a stat card on most levelups, but if you choose to invest a lot in one skill there seems to be a system i place to make sure you get less and less of that stat as it grows, making it nearly impossible to actually build a character as you want, the game will auto balance you into the character they think you should play.\r\n\r\nNot worth buying, they should pay us to waste our time, I wholeheartedly regret wasting time and money on both this and the first game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a hard no from me.\n\nI find the tactics lacking, no zone of control, too many enemies taking too long to defeat despite not providing much challenge.\n\nIt is a war of attrition where simple numbers slowly wear your your HP down over time.\n\nLevel ups are boring providing things such as +3% to critical chance or  +4% to guard ECT ect \n\nBoring .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Little too easy? Ended up beating game 3rd time and haven't lost a run since. \nThere are only a few maps. The missions are all the same but in a different order. Once you solve it once it is solved for life. The bosses. \n\nAt half a price it is a good deal.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It maybe ok, not sure I die and then get taken back to base and have to start all over. Ok, so lose levels, equipment bonus etc.. that's fine. But if I choose to go back to base... i die... lose everything... makes no sense from game or story.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bought this game because I really enjoyed Lost Eidolons. Played it extensively in beta. Even wrote up the start of a guide/compendium for the game. Then I found out they were casting Shara Kirby for the voice roles. Shara Kirby, who participated in the organized harassment of Jacob Takanashi, like the classless individual she is.\r\n\r\nI can't change that they made this choice. I can stop supporting the studio, though. Maybe in the future they'll choose not to hire awful people who abuse and harass others, but for now, they've lost my support. I probably won't buy anything else from them, either, since even if they never hire another abusive jerk again, her voice is still in this game. The game had real potential. Sorry to see them embrace abuse and harassment so openly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I received this game for free via Keymailer. I do not like this game. I am all for a game that's difficult or makes the choices you've made feel like they have weight, but this isn't that. A lot of the battles feel unwinnable or like they are forcing you to run away or wait for the enemies to kill each other off. You are better off playing ranged than ever getting close and constantly skirting outside of your enemies attack range. Then when you die you just go back to town, get a few upgrades, and do it all over again. I do somewhat like that I get a second chance but I'd rather have a fighting chance than feel like every enemy does significantly more damage than me, die and start from scratch than play this game as it is. On the positive note, there is tons of voice acting and the story is legitimately interesting. I might try and slog through it just for the story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Combat is the same but it removes the strategy element of choosing your upgrades and skills and replaces it with a RNG/card mechanic.  For that, I have to down vote.\n\nYou may like more content.  It does have story elements and such.\n\nIt is a bit grindy as you replay the same thing , same map multiple times.  You an make it more difficult by choosing restrictions and such which is nice but that does not make up for loss of the strategy / RPG elemement.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wish there was a mixed option in Steam. This game has decent bones, but the runs are just a slog. They take so long and do not have much variety once you start your 3rd one. I like the characters and the idea, but the  individual areas just become a chore to get through.\n\nUpdate. I'm very happy to hear the developer take criticism and work towards better the product. This game had loads of potential, and I look forward to revisiting it in the future.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately, all this game does is make me wish a proper sequel for lost eidolons came out instead. The range of combat tools has improved (once you've progressed enough) but all other aspects feel worse. \n\nThe roguelite aspect bogs it down in repetitive combat scenarios with absolutely minimal payoff. \n\nIn the campaign of the first game relationships build at a good pace and feel natural, here you get a sentence or two every 30 mins, making it very disjointed. \n\nLevelling up weapons and armour in the first game felt satisfying as you were building up your strength through using those weapons, to benefit the rest of the campaign, but here you know you're just going to lose it all once the small repetitive run is over. \n\nAll the long term progress is diverted to resource collection overload for the abstract exchanges in base between runs.\n\nI really hope the studio goes back to the ambition of their first game for any other projects down the line.\n\n\n\nEdit: I really didn't expect the dev response. The moment you guys go back to a campaign like the first game, in another game (sequel or otherwise) i'll be there! Thanks for the response. In terms of making this specific game better, the number one thing for me would be making relationship development MUCH faster, with opportunities for that banter to occur frequently during the runs, rather than just a big list of unlocked options at base. Right now the runs feel very empty in that regard, apart from the occasional ally you get to pick up for a bit.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "I can't quite put my finger on it, but the tactical battles are just not fun, zoc mechanic is weird and I still haven't figured it out, enemies randomly decide to attack my squishies while right next to my tankier guys with no consequences. \n\nSo, instead of real tactics, or using environment/los you just end up trying to find a position where they can't reach you. On this note, the maps are non existent, a few bumps and some water holes don't qualify as a combat map. You need stuff like high low ground, los elements and more visual variety. \n\nThe game would be much more fun if the partnership effects were more pronounced so you could actually use them in combat instead of getting them randomly and that rarely.\n\nAs it stands, for me at least, combat needs quite a few changes to make it work. The rest of the game is fine, I like the art and the rogue lite aspect is OK, not all games need a story/campaign. If the fights were fun I'd play more. May check back in the future.\n\nPs Laurent range is ridiculous, he's supposed to be wizard but has the range of a spearman?",
      "voted_up": false,
      "votes_helpful": 118
    },
    {
      "review": "[h3]I feel bad leaving a negative review and would choose neutral if that were possible. [/h3]\n\nNever tried the original game. This opinion is from someone who just likes tactics, roguelites and interesting art style.\n\nI liked the game overall — it's challenging and rewarding. I love the animations and the art style. The writing is annoying, and the voiceovers make it even worse, but it’s bearable. What ruined the experience for me was the lack of map variety. Obstacles and enemies are always in the same positions, and the dialogues before battles are the same too. The roguelite mantra is: repeat the same, but make it different. Unfortunately, Vail of the Witch fails to follow it — with “the same” being too much and “different” being too little.\n\nI still think you should try the game if it looks appealing to you and if you like turn-based tactics — especially if you’re used to the Western style and have never tried an Asian take on it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Note that this title has outside of combat mechanics, no other gameplay element that is similar to Lost Eidolons, and is simply a roguelike set in the same world narratively. Even narratively, there are very little references back to the original, and should be considered a spin-off.\r\n\r\nAs a roguelike it doesn't add anything new to the formula, with pathings similar to wartorn.\r\nFights are very repetitive, with boss fights as hard gates to your runs. Every failure will see you got to slog thru all the nodes again with random level up upgrades.\r\n\r\nStrongly recommend this game if you do not have better use of your time (like to explore what other titles steam got to offer)",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Boring and very repetitive game. The first one was way better. The roguelike formula doesnt work. U just keep doing the same thing over... and over... again, and from the start. Character progression is none almost... map design? inexistent - all flat, no tangible originality between them. The story or at least how is told... meh.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game helped me realize I don't like Roguelites/likes. I don't want to play Lost Eidolons: Hades. I don't need developers to waste my life with meaningless grind while they drip-feed a short story to me over 50 hours of tedium. This should have been a mobile game. They'd have made more off of it to put toward the next real project and the people who would have bought it are actually looking to have their time/life wasted. I wish I could refund this. On principle.\n\nNow, with this newfound realization, I have a wishlist to prune.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "TLDR: The game becomes a chore.\n\nThe game is fun...for the first 2-3 runs. The mechanics are fine for TRPG and a roguelite, but there is such very little incentive to motivate you for doing repeated runs. The maps and content get very old very fast, and the only real things that can change are:\n- Making the run harder for yourself (you get more upgrade materials to be stronger in future runs)\n- Artifacts/upgrades to make your runs easier to deal with said difficulty mods mentioned above\n\nThere is a true end to the story, and some new units and story you can unlock, but the progress for them is so slow you'll feel like the gameplay is a chore by the time you unlock everything...AND THEN DO IT AGAIN TO USE THE UNLOCKABLES. \n\nFinally, the story and voice acting is fine, but music is pretty forgetable. The game is fine for 20USD, but definitely not for everyone.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is awful. I wanted to give it a shot because I normally love turn-based RPGs, but now I really regret not refunding, even though I got it on sale.\n\nI play A LOT of turn-based games, and this is just so bare bones. If this game was made by a single dev, I might not be so harsh...but it's from a studio.\n\nUnits do not have engagement, so there are no attacks of opportunity no matter how many enemies run right past your front line units. This means that you cannot limit movement of enemy units with positioning. You cannot have tank units control the battlefield at all. Enemies run around anywhere they want almost any time they want. Because there are ZERO penalties for running right past your units, the enemy always gangs up on single units at a time, killing them quickly.\n\nSo far...zero Area of Effect (AOE) attacks or spells. Your gigantic ax or massive two-handed sword can hit exactly ONE enemy per turn. No sweeps. No spins. Your fireball spell affects ONE enemy. Your lightning bolt hits ONE enemy...no lining up shots to punish the enemy in groups. My big crushing special attack with my main character does exactly 2 points more damage than a normal attack...so basically 38 points of damage versus WHOA 40. \n\nBows are virtually useless. They have a range of fire that is only one single square beyond a unit using a spear, so their range is basically 10 feet or so....TOTAL. Spells are equally short ranged. What game has bows limited to a range of 10 feet?\n\nMaps are so BORING. Very little variation. No differences in elevation. Some water. Some poison clouds. Otherwise, you are fighting on a big open map with maybe a rock formation or two.\n\nWAY too much talking! It seems like half of the game is clicking through boring conversations just so you can do something other than listen to some dumb tale for 10-20 minutes real time.\n\nThe voice actor for the main character (played as a male) is not the guy for this job. He sounds totally out of place, like some hipster slinging pick-up lines in a nightclub...not a warrior and champion who deals death to his foes. This may seem like a petty issue, but you have to listen to SO MUCH TALKING that it eventually starts to grate. I think that the appropriate description here is \"smarmy,\" and that is not a term I bust out often.\n\nThe nail in the coffin is the fact that everything is stacked against you in the first boss battle. They make you grind and grind to get enough permanent upgrades to advance. There is no way to progress without grinding, no matter how well you play. They FORCE the grind on you and you absolutely cannot win until you grind out the upgrades you need to advance. I just keep asking myself, \"Why am I doing this rather than doing something I actually enjoy?\"",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "A vary bare-bones game. I hoped it would become more interesting the more I played, but I found it to be pretty boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I honestly really want to like this game but like it's predecessor they really do not know how to balance bosses. Just like with Lost Eidolons the original game every thing is, generally speaking, fine until you get to a boss and then they just throw in mechanics and abilities that are on a whole other level. I feel like I'm going from a tactical game to a half baked stupid MMO boss encounter that just ruins the whole vibe of the game for me. I'll keep playing from time to time but as much as I really want to love this game it just becomes not fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really wanted to recommend this game because it has a lot of good things, but unfortunately the lack of longevity and the combat system blunders are just to much for me to ignore. It might be better suited for those that love random events and progression or for those that like the slay the tower type of games, but it's definitely not designed for those that love strategic combat, character progression and non linear stories.\n\nThe threat zones are a disappointment as sometime they work sometime they don't, meaning that if an enemy has to enter one then they have to stop, but if they are already inside one they can just more freely wherever they want.\n\nThe lack of movement after the attack option is a major blunder, you can move and attack but you cannot attack and then move, this makes no sense to me.\n\nThe talents are rolled at random, you cannot really build a character, but you just have to accept the random cards you get. Also at the end of the expedition you go back to level 1 and have to do it again, which kills the sense of progression. It would have made much more sense if you could have kept some of the talents while forgetting others, and still have some character progression.\n\nAlso the lack of real 3d is another dealbreaker, you can only move in 2 dimensions (up, down, left right, that's it), which severely impacts the strategy of all turn based games.\n\nThe plot is also very bland and linear. with just some voice acting to keep you a bit immersed, too little. In the end this might be a fun game to play for few hours, but not enough to get you hooked IMHO. It's a missed opportunity though, because the engine is good and there's a certain balance that could have used much, much better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its fine game for couple runs but then it gets very grindy with very tough bosses with little variety between the runs. It didn't didn't need to be roguelike.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's a good concept and the gameplay offers a nice mix of roguelite and fire emblem / TRPG mechanics, but the biggest sticking point is a severe lack of variety in the battle maps and scenarios. For a roguelite, there just needs to be more than the 10 or so battle scenarios that the game currently offers, and the very limited number of bosses as well. It grows stale very quickly, and leaves you wanting more. I would wait on this one until they potentially create more content",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I feel like this game should have been right up my ally. Unfortunately, it doesn't deliver what I wanted from it.\r\n\r\nIt implement turn based tactical game play well. It may be a tad too forgiving with the rewind mechanics, and a tad too easy baseline. Out of 5 runs I only lost the first at the final boss of that run. After beating the story on the second and third run, adding on the levels of post game difficulty scaling options. This mostly made the runs a bit slower, but not wildly different than before. \r\n\r\nNone of that really means it's a bad game. The point that I feel does edge it towards that direction is the fact that over the course of these runs, I never unlocked any of the four additional characters. I only even started meeting one of them. It seems like the game expects you to do a lot more runs than I did to even begin their stories, and that's a problem when runs mostly feel the same and take several hours to complete. \r\n\r\nThe meta roguelike mechanics just mesh poorly with the rest of the design of the game since they require many runs to unlock, the time required for each run is so long, and each run mostly feels the same.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For Reference, I did play the first game and loved it. I was expecting this game to at least be similar to the first. \r\nFirst complaint: \"Camp\" is underwhelming, even taking into account that they were trying to make the game run smoother compared to the first. People don't necessarily care about walking around a physical camp as much as they do about mechanics that are fun and interesting. This part was not.\r\nSecond complaint: Making it a Roguelike game kind of hurt the unique charm of the original. Since with roguelikes you have a limit to map generation ability. This makes the combat maps boring. In the original they had many unique battles while the boss fights are the only ones that feel unique in this one. Also, bringing in the same or similar bosses to the original game means that the quality of this one is lessened. The devs couldn't even come up with something new and fun? That makes this feel like a shameless cash grab and not something that a group of people lovingly made like the first game.\r\nThird complaint: The relationships between the characters are, at best, boring. They lack substance, the motivations of the main character, even after unlocking more of the story are flimsy. The unknown entity that throws you into this doesn't seem to have an actual agenda that makes any sense until (presumably) you get very far into the game. My best guess is really that they are forcing you into a proxy war against another similar entity, since I haven't made it that far. But now I probably won't. The story is a large part of why I play tactical RPG's, and the story here falls short. It feels like it was thrown together in 5 minutes by a group of people who are just trying to milk the success of the first game. \r\nFourth complaint: No new classes, and only a couple new abilities compared to the original. Even the Mercenaries series games, which re-use many of their classes and abilities, was more worth playing than this because they actually made the characters feel unique and fun, while this game did not. Even other roguelike tactical rpg's feel better than this because they were, at their core, roguelikes. If you were going to switch, you should have really improved the roguelike aspects, and make each playthrough feel unique and fun, but it fails to even do that. Part of the charm is that each round feels like your characters have still improved in some way, even if they haven't reached their end goal. I've played phone games that do a better job than this. \r\n\r\nI may be biased after the first game, but I will probably uninstall and never touch this again. Waste of my money and time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to like this game, but I don't.\n\nThis game is what XCOM: Chimera Squad is to XCOM2. It's charming, but it does not live up to its predecessor by any means except combat. It's also comparable to what Darkest Dungeon 2 is to DD1. I really hate this trend in gaming of making bogged down phone and tablet spin-offs of highly successful games. \n\nPROS:\n- The characters are in line with the original series. They're not very complicated, but likeable.\n- The combat is mostly an improvement to the original, but with a few hiccups.\n- I like some of the new trinkets.\n- The missions are mostly pleasant, although small scale versions of the original.\n\nCONS:\n- The repetitive, rogue-like structure of the game is not satisfying. I recommend Hades instead.\n- The game is meant to be failed, like most other rogue-likes, but this game fails to realise that the charm of rogue-likes is that you get to develop your characters, strengthen them, meet familiar characters with new dialogue and build a better HQ like in Darkest Dungeon. \n- There is very little improvement for each new round of failure. It's a steady grind. I like grinds, but this is way too much gameplay for too little of a reward. Playing Tetris on repeat at least gives you the goal of beating your own score. This game doesn't even do that.\n- They completely removed many features of the original game, which is what made Lost Eidolons great to begin with, like a character system with building relationships, and training for classes and improving armour. These systems are already made. I don't know why they couldn't just have implemented them into the game.\n\nThe only reason to buy this game is to support the studio so they can make a Lost Eidolons 2.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really should put Rogue-like in the game tags and absolutely mention it as one of the first things around the game. The previous Lost Eidolons game wasn't RogueLike and so i didn't think this one was either until I lost a fight and was surprised to learn it was RogueLike as it's not in the tags which I always scan for as I don't like RogueLike games at all lol, just seems a cheap way to add length to games instead of actually working on real growth and opponent scaling in a game which is exactly how this feels. Same bosses over and over, same skills over and over. I play strategy games for the strategy of them and the growth throughout the game and the building of your characters and stats and development. RogueLike generally ruins all this. Wouldn't have bought it if I knew it was RogueLike and was properly tagged as such and can't refund it because I played longer than an hour and so will play a bit until I get so sick of the awful RogueLike mechanics i quit. Too bad cause I did enjoy the storyline very much and loved the first Lost Eidolons game but won't be playing this one for too much longer sadly. Update: played a few more hours and am done with the game, you barely carry anything over from run to run and the Rogue-like just makes it unpleasant to play when you find a build you like and then lose it all at the end of a run and just have to hope you get the same skills next time or be frustrated you're back at square one.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I liked this game, but after 20 hours or so, i Realised that I've played every combat scenario. There's like, 10? of them? \r\n\r\nFor a roguelike, this is quite unnacceptable, as every playthrough should be different. The only fun parts are going against bosses, but it's a total slog getting there. \r\n\r\nGet this game for like $10 tbh\r\n\r\nVoice acting is awesome tho~",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ist ehrlich in Ordnung, aber der Gameplay Loop wird sehr schnell \"anstrengend\". Die Charakter Upgrades scheinen auch nicht unglaublich unterschiedlich zu sein, sodass sich die Runs schnell gleich anfühlen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Slow progress, way too few different encounters and enemies, it is extremely repetitive, the story is uninspired, boring and downright bad, bad acting, items are incredibly boring, most of the trinkets are just bad because they are too limited, would be better if they were all passives, there are too many active skills which you can only use once per turn, but most of them are just the same skill on different characters, it's incredibly unbalanced, ie. one skill gives you 30%(45%) chance to negate a debuff, another gives you 30%(45%) to reflect a debuff, rarity of skills does not seem to have any value either in strength or how hard they are to get.\r\n\r\nBut the worst thing of all by a large margin is the stat system, you can choose a stat card on most levelups, but if you choose to invest a lot in one skill there seems to be a system i place to make sure you get less and less of that stat as it grows, making it nearly impossible to actually build a character as you want, the game will auto balance you into the character they think you should play.\r\n\r\nNot worth buying, they should pay us to waste our time, I wholeheartedly regret wasting time and money on both this and the first game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a hard no from me.\n\nI find the tactics lacking, no zone of control, too many enemies taking too long to defeat despite not providing much challenge.\n\nIt is a war of attrition where simple numbers slowly wear your your HP down over time.\n\nLevel ups are boring providing things such as +3% to critical chance or  +4% to guard ECT ect \n\nBoring .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Little too easy? Ended up beating game 3rd time and haven't lost a run since. \nThere are only a few maps. The missions are all the same but in a different order. Once you solve it once it is solved for life. The bosses. \n\nAt half a price it is a good deal.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It maybe ok, not sure I die and then get taken back to base and have to start all over. Ok, so lose levels, equipment bonus etc.. that's fine. But if I choose to go back to base... i die... lose everything... makes no sense from game or story.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bought this game because I really enjoyed Lost Eidolons. Played it extensively in beta. Even wrote up the start of a guide/compendium for the game. Then I found out they were casting Shara Kirby for the voice roles. Shara Kirby, who participated in the organized harassment of Jacob Takanashi, like the classless individual she is.\r\n\r\nI can't change that they made this choice. I can stop supporting the studio, though. Maybe in the future they'll choose not to hire awful people who abuse and harass others, but for now, they've lost my support. I probably won't buy anything else from them, either, since even if they never hire another abusive jerk again, her voice is still in this game. The game had real potential. Sorry to see them embrace abuse and harassment so openly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I received this game for free via Keymailer. I do not like this game. I am all for a game that's difficult or makes the choices you've made feel like they have weight, but this isn't that. A lot of the battles feel unwinnable or like they are forcing you to run away or wait for the enemies to kill each other off. You are better off playing ranged than ever getting close and constantly skirting outside of your enemies attack range. Then when you die you just go back to town, get a few upgrades, and do it all over again. I do somewhat like that I get a second chance but I'd rather have a fighting chance than feel like every enemy does significantly more damage than me, die and start from scratch than play this game as it is. On the positive note, there is tons of voice acting and the story is legitimately interesting. I might try and slog through it just for the story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Combat is the same but it removes the strategy element of choosing your upgrades and skills and replaces it with a RNG/card mechanic.  For that, I have to down vote.\n\nYou may like more content.  It does have story elements and such.\n\nIt is a bit grindy as you replay the same thing , same map multiple times.  You an make it more difficult by choosing restrictions and such which is nice but that does not make up for loss of the strategy / RPG elemement.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wish there was a mixed option in Steam. This game has decent bones, but the runs are just a slog. They take so long and do not have much variety once you start your 3rd one. I like the characters and the idea, but the  individual areas just become a chore to get through.\n\nUpdate. I'm very happy to hear the developer take criticism and work towards better the product. This game had loads of potential, and I look forward to revisiting it in the future.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately, all this game does is make me wish a proper sequel for lost eidolons came out instead. The range of combat tools has improved (once you've progressed enough) but all other aspects feel worse. \n\nThe roguelite aspect bogs it down in repetitive combat scenarios with absolutely minimal payoff. \n\nIn the campaign of the first game relationships build at a good pace and feel natural, here you get a sentence or two every 30 mins, making it very disjointed. \n\nLevelling up weapons and armour in the first game felt satisfying as you were building up your strength through using those weapons, to benefit the rest of the campaign, but here you know you're just going to lose it all once the small repetitive run is over. \n\nAll the long term progress is diverted to resource collection overload for the abstract exchanges in base between runs.\n\nI really hope the studio goes back to the ambition of their first game for any other projects down the line.\n\n\n\nEdit: I really didn't expect the dev response. The moment you guys go back to a campaign like the first game, in another game (sequel or otherwise) i'll be there! Thanks for the response. In terms of making this specific game better, the number one thing for me would be making relationship development MUCH faster, with opportunities for that banter to occur frequently during the runs, rather than just a big list of unlocked options at base. Right now the runs feel very empty in that regard, apart from the occasional ally you get to pick up for a bit.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "I can't quite put my finger on it, but the tactical battles are just not fun, zoc mechanic is weird and I still haven't figured it out, enemies randomly decide to attack my squishies while right next to my tankier guys with no consequences. \n\nSo, instead of real tactics, or using environment/los you just end up trying to find a position where they can't reach you. On this note, the maps are non existent, a few bumps and some water holes don't qualify as a combat map. You need stuff like high low ground, los elements and more visual variety. \n\nThe game would be much more fun if the partnership effects were more pronounced so you could actually use them in combat instead of getting them randomly and that rarely.\n\nAs it stands, for me at least, combat needs quite a few changes to make it work. The rest of the game is fine, I like the art and the rogue lite aspect is OK, not all games need a story/campaign. If the fights were fun I'd play more. May check back in the future.\n\nPs Laurent range is ridiculous, he's supposed to be wizard but has the range of a spearman?",
      "voted_up": false,
      "votes_helpful": 118
    },
    {
      "review": "[h3]I feel bad leaving a negative review and would choose neutral if that were possible. [/h3]\n\nNever tried the original game. This opinion is from someone who just likes tactics, roguelites and interesting art style.\n\nI liked the game overall — it's challenging and rewarding. I love the animations and the art style. The writing is annoying, and the voiceovers make it even worse, but it’s bearable. What ruined the experience for me was the lack of map variety. Obstacles and enemies are always in the same positions, and the dialogues before battles are the same too. The roguelite mantra is: repeat the same, but make it different. Unfortunately, Vail of the Witch fails to follow it — with “the same” being too much and “different” being too little.\n\nI still think you should try the game if it looks appealing to you and if you like turn-based tactics — especially if you’re used to the Western style and have never tried an Asian take on it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Note that this title has outside of combat mechanics, no other gameplay element that is similar to Lost Eidolons, and is simply a roguelike set in the same world narratively. Even narratively, there are very little references back to the original, and should be considered a spin-off.\r\n\r\nAs a roguelike it doesn't add anything new to the formula, with pathings similar to wartorn.\r\nFights are very repetitive, with boss fights as hard gates to your runs. Every failure will see you got to slog thru all the nodes again with random level up upgrades.\r\n\r\nStrongly recommend this game if you do not have better use of your time (like to explore what other titles steam got to offer)",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Boring and very repetitive game. The first one was way better. The roguelike formula doesnt work. U just keep doing the same thing over... and over... again, and from the start. Character progression is none almost... map design? inexistent - all flat, no tangible originality between them. The story or at least how is told... meh.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game helped me realize I don't like Roguelites/likes. I don't want to play Lost Eidolons: Hades. I don't need developers to waste my life with meaningless grind while they drip-feed a short story to me over 50 hours of tedium. This should have been a mobile game. They'd have made more off of it to put toward the next real project and the people who would have bought it are actually looking to have their time/life wasted. I wish I could refund this. On principle.\n\nNow, with this newfound realization, I have a wishlist to prune.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "TLDR: The game becomes a chore.\n\nThe game is fun...for the first 2-3 runs. The mechanics are fine for TRPG and a roguelite, but there is such very little incentive to motivate you for doing repeated runs. The maps and content get very old very fast, and the only real things that can change are:\n- Making the run harder for yourself (you get more upgrade materials to be stronger in future runs)\n- Artifacts/upgrades to make your runs easier to deal with said difficulty mods mentioned above\n\nThere is a true end to the story, and some new units and story you can unlock, but the progress for them is so slow you'll feel like the gameplay is a chore by the time you unlock everything...AND THEN DO IT AGAIN TO USE THE UNLOCKABLES. \n\nFinally, the story and voice acting is fine, but music is pretty forgetable. The game is fine for 20USD, but definitely not for everyone.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is awful. I wanted to give it a shot because I normally love turn-based RPGs, but now I really regret not refunding, even though I got it on sale.\n\nI play A LOT of turn-based games, and this is just so bare bones. If this game was made by a single dev, I might not be so harsh...but it's from a studio.\n\nUnits do not have engagement, so there are no attacks of opportunity no matter how many enemies run right past your front line units. This means that you cannot limit movement of enemy units with positioning. You cannot have tank units control the battlefield at all. Enemies run around anywhere they want almost any time they want. Because there are ZERO penalties for running right past your units, the enemy always gangs up on single units at a time, killing them quickly.\n\nSo far...zero Area of Effect (AOE) attacks or spells. Your gigantic ax or massive two-handed sword can hit exactly ONE enemy per turn. No sweeps. No spins. Your fireball spell affects ONE enemy. Your lightning bolt hits ONE enemy...no lining up shots to punish the enemy in groups. My big crushing special attack with my main character does exactly 2 points more damage than a normal attack...so basically 38 points of damage versus WHOA 40. \n\nBows are virtually useless. They have a range of fire that is only one single square beyond a unit using a spear, so their range is basically 10 feet or so....TOTAL. Spells are equally short ranged. What game has bows limited to a range of 10 feet?\n\nMaps are so BORING. Very little variation. No differences in elevation. Some water. Some poison clouds. Otherwise, you are fighting on a big open map with maybe a rock formation or two.\n\nWAY too much talking! It seems like half of the game is clicking through boring conversations just so you can do something other than listen to some dumb tale for 10-20 minutes real time.\n\nThe voice actor for the main character (played as a male) is not the guy for this job. He sounds totally out of place, like some hipster slinging pick-up lines in a nightclub...not a warrior and champion who deals death to his foes. This may seem like a petty issue, but you have to listen to SO MUCH TALKING that it eventually starts to grate. I think that the appropriate description here is \"smarmy,\" and that is not a term I bust out often.\n\nThe nail in the coffin is the fact that everything is stacked against you in the first boss battle. They make you grind and grind to get enough permanent upgrades to advance. There is no way to progress without grinding, no matter how well you play. They FORCE the grind on you and you absolutely cannot win until you grind out the upgrades you need to advance. I just keep asking myself, \"Why am I doing this rather than doing something I actually enjoy?\"",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "A vary bare-bones game. I hoped it would become more interesting the more I played, but I found it to be pretty boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I honestly really want to like this game but like it's predecessor they really do not know how to balance bosses. Just like with Lost Eidolons the original game every thing is, generally speaking, fine until you get to a boss and then they just throw in mechanics and abilities that are on a whole other level. I feel like I'm going from a tactical game to a half baked stupid MMO boss encounter that just ruins the whole vibe of the game for me. I'll keep playing from time to time but as much as I really want to love this game it just becomes not fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really wanted to recommend this game because it has a lot of good things, but unfortunately the lack of longevity and the combat system blunders are just to much for me to ignore. It might be better suited for those that love random events and progression or for those that like the slay the tower type of games, but it's definitely not designed for those that love strategic combat, character progression and non linear stories.\n\nThe threat zones are a disappointment as sometime they work sometime they don't, meaning that if an enemy has to enter one then they have to stop, but if they are already inside one they can just more freely wherever they want.\n\nThe lack of movement after the attack option is a major blunder, you can move and attack but you cannot attack and then move, this makes no sense to me.\n\nThe talents are rolled at random, you cannot really build a character, but you just have to accept the random cards you get. Also at the end of the expedition you go back to level 1 and have to do it again, which kills the sense of progression. It would have made much more sense if you could have kept some of the talents while forgetting others, and still have some character progression.\n\nAlso the lack of real 3d is another dealbreaker, you can only move in 2 dimensions (up, down, left right, that's it), which severely impacts the strategy of all turn based games.\n\nThe plot is also very bland and linear. with just some voice acting to keep you a bit immersed, too little. In the end this might be a fun game to play for few hours, but not enough to get you hooked IMHO. It's a missed opportunity though, because the engine is good and there's a certain balance that could have used much, much better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its fine game for couple runs but then it gets very grindy with very tough bosses with little variety between the runs. It didn't didn't need to be roguelike.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}