{
  "positive": [
    {
      "review": "This is the best video game story I've ever had the privilege of experiencing, I didn't think it was possible to cram so much emotional depth into a video game. This is 100% my current benchmark for story-driven single player games, in both game mechanics and narrative.\n\nThanks a million Naughty Dog, I can't wait for your next masterpiece.",
      "voted_up": true,
      "votes_helpful": 71
    },
    {
      "review": "The Last of Us part 2 is a third person survival horror game, set five years after the events of the first game. Joel and Ellie are now living in Jackson, but when a group of soldiers attack the town, Ellie must follow them to Seattle, where she finds herself caught in the middle of a war between two factions.\r\n\r\nI watched season 2 of the TV show a few months ago, which adapted the first half of this game. I thought it was much weaker than season 1 / the first game, but at least it prepared me for some of the game’s controversial story choices.\r\n\r\n[h1]Gameplay (high quality)[/h1]\r\n\r\n•\tSurvival horror gameplay is similar to the likes of Resident Evil, Dead Space, and Evil Within. Each individual enemy can be dangerous if you’re not careful, and some can even instakill you. Meanwhile, ammo and healing supplies are limited. Or at least, your carrying capacity is limited. You’ll find loads of stuff lying around, but I had to leave so many supplies uncollected. (I wish I could craft a bigger bag).\r\n\r\n•\tThe game has much more action than the TV show, with many lengthy combat encounters against several different types of infected, and soldiers from two different factions, which makes the world feel much more dangerous.\r\n\r\n•\tAvailable weapons include pistol, shotgun, rifle, crossbow, flamethrower, SMG, and craftable trip mines, molotovs and pipe bombs. You can also pick up various melee weapons which break after a few hits, but it never takes long to find another.\r\n\r\n•\tThe player can use walls, parked cars, and long grass as cover to sneak up behind enemies and stealth kill them. You can also perform ranged stealth kills by crafting a silencer for the pistol, or using a bow which is naturally silent. \r\n\r\n•\tIn many scenes, you’ll travel with an ally who will help you to fight, and can also perform stealth kills. Meanwhile, in some areas you can get soldiers and infected to attack each other.\r\n\r\n•\tThe biggest difficulty during combat is being outnumbered and flanked by soldiers with guns. Most of the infected are easy to deal with once you’re comfortable with the stealth mechanics.\r\n\r\n•\tThe city has some open areas to explore, with multiple paths to progress through, and ruined buildings where you can scavenge supplies such as ammo, crafting materials, weapon components to upgrade your guns at workbenches (stability, damage, zoom scope, magazine capacity, fire rate), and pills which can be spent to acquire various character skill upgrades.\r\n\r\n•\tThe player has manual flashlight control at all times, allowing you to see properly at night or when underground. I appreciate this, because not every game gives you this ability.\r\n\r\n[h1]Story (low quality)[/h1]\r\n\r\n•\tStory had potential to be interesting, featuring themes of family and revenge, but ultimately I think the writers made several mistakes with the structure and content which hurt its overall quality.\r\n\r\n•\tVoice acting is excellent from the whole cast, but especially for the main characters. Troy Baker as Joel, Ashley Johnson, whose performance makes Ellie much more likeable than Bella Ramsey, and Laura Bailey (who is amazing in so many other games I’ve played) as Abby.\r\n\r\n•\tI’ve never been a huge fan of non-linear stories that jump back and forth in the timeline, in any media (TV, film, games). This is a problem for TLOU2 with the second act of the story being a lengthy flashback from a different character’s perspective, which means that I didn’t care about certain characters, having already seen how their story ends during the first act.\r\n\r\n•\tStory lacks the presence of an important character who has a reduced role, with other characters not being interesting enough to fill the void.\r\n\r\n•\tIts the kind of story where you have to believe that your character will happily kill thirty random soldiers while achieving a mission objective, but then absolutely freak out with guilt about killing one specific person.\r\n\r\n•\tEnding features not one, but two massive anticlimaxes. Honestly, even without knowing any spoilers before playing, I did kind of expect the story to end that way, but it was still annoying to actually see it happen.\r\n\r\n•\tI was also quite confused by one specific cutscene towards the end. [spoiler]A character clearly gets shot in the head, but a couple of scenes later, they’re totally fine, and they provide information which sets up the final act of the story. I was already feeling like this second scene was wrong somehow, like the tone was too perfect, so as soon as this character walked in to the room I was like “oh, this isn’t real. He’s dead, so this is a dream, and any minute now we’re going to wake up back to reality”. But then the story continued on long enough for me to start thinking “wait, is this real? This doesn’t make sense”.[/spoiler] I was so confused that I had to pause the game and watch the first cutscene again on Youtube, to confirm that yes, I definitely saw what I thought I saw. Honestly, after this, I kinda lost interest in the last part of the story.\r\n\r\n[h1]Technical (low quality)[/h1]\r\n\r\n•\tIt took me 25 hours to complete the story.\r\n\r\n•\tEnvironmental graphics look great, as your journey takes you through ruined buildings overgrown with plants, underground tunnels covered in fungus, and large forests.\r\n\r\n•\tControls are fully rebindable and feel great with mouse and keyboard.\r\n\r\n•\tThe game was very unstable for me, as I experienced 8 crashes, with the only consolation being the fact that autosaves are very frequent, so I never lost more than a couple of minutes progress.\r\n\r\n•\tWhile I had a constant 60 FPS with most graphics settings on high (RTX 3080, i7-12700K, 32GB DDR4, 1440p), unfortunately I also experienced a significant amount of stuttering. Thankfully it didn’t seem to happen during combat, and I played long sections without any stuttering, but it was very noticeable while exploring some parts of the world.\r\n\r\n•\tTowards the end of my playthrough I started to wonder if the performance issues were related to how long I’d been playing, like some kind of memory leak. I mostly played in sessions of 2-3 hours, and I think its possible that the first 60-90 minutes of each session were fine, with performance getting worse after that, starting with stuttering and eventually leading to a crash. But I can’t say for certain if that theory is correct. Maybe specific areas of the map are just poorly optimised.\r\n\r\n[h1]Recommendation[/h1]\r\n\r\nDespite some technical issues and a weak story, The Last of Us part 2 is worth playing for fans of survival horror games, because of its entertaining combat systems, but I would advise waiting for a big sale.",
      "voted_up": true,
      "votes_helpful": 52
    },
    {
      "review": "“10/10 Would Cry Again”\n\nHours played: 35 (and about 12 of those were spent staring into the void).\n\nThis game emotionally suplexed me, then hugged me afterward. I came for the action and stayed for the heartbreak, the guitar solos, and the emotional damage. Every stealth kill felt like therapy, every cutscene felt like a breakup.\n\nThe story punches you in the soul, the visuals make your GPU sweat, and the sound design had me checking over my shoulder IRL. By the end, I wasn’t sure if I’d beaten the game or if it had beaten me.\n\nWould absolutely relive the trauma again. 10/10 — highly recommend if you enjoy beautiful narrative in 4K. 👍",
      "voted_up": true,
      "votes_helpful": 76
    },
    {
      "review": "I replayed the second part after years, and honestly, it reminded me why this series is on another level. From the very first moments, the atmosphere grabs you again! darker, quieter, and filled with emotions that you feel even when nothing is being said. It’s that kind of game where the world itself speaks to you.\r\nThe story this time goes deeper. It’s heavier, more personal, and hits you in places you didn’t expect. Every step, every encounter, every silence feels like it carries a meaning. And even though I knew what was coming, it still managed to make me feel it, again\r\n\r\nGameplay is smooth and satisfying, stealth, exploration, and combat blend together beautifully. And the animations, voice acting, and small details make everything feel alive. More than once I caught myself stopping just to absorb the scene in front of me.\r\nAfter all these years, the game still stands strong. It’s emotional, intense, and unforgettable in its own way.\r\nSo yeah, fellas, replaying it on PC Master Race just reminded me how special this masterpiece truly is.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Amazing game I love the Last of Us Part 2 :)\n\nIt has an excellent story it is a bit of a rollercoaster it tells the game from two points of view, between two characters called Ellie and Abby, who you will switch between throughout the game. I like Ellie who of course is from the first game she is always my fav, then there is Dina another main character who is awesome too love her and in fact by the end of the game I even began to like Abby, I thought she was a cool new character to play as despite, what she does to Joel at the beginning of the game which was crazy. I could understand the story from both sides I did wonder, if it was worth all the hassle the characters went through, once it was over I felt like the ending was kinda bleak in my opinion a bit like all that for that? I hope there is a sequel.\n\nThe gameplay is top notch I felt like it was generally quite linear, but sometimes there are parts of the game where you have to search around various locations, the scenery is awesome for the setting and surroundings, the buildings, grass, weather, dirt and effects are really good, the graphics look very real and performance wise the game runs fine for me. Sometimes you do feel like you are actually there in side that stadium, hotel or house etc it can be nice to look around and appreciate the atmosphere it is very believable, the characters who accompany you will sometimes say things and make a comment whilst wondering about, there is always plenty to admire in the game and it does have the post apocalyptic feeling.\n\nYou are allowed to choose if you want to use stealth by crawling around in the bushes, sneaking up on people or zombies, using silencers, arrows or distractions etc, the game includes a listen mode which is also very useful, alternatively however there will be encounters where you have to go loud, using shotguns and rifles along with molotovs and pipe bombs etc. The crafting and equipment are excellent and enjoyable to use, I liked being able to find manuals that were scattered randomly, throughout the game and learning better skills which can be quite satisfying, then gathering enough parts to upgrade your guns which is very exciting too. \n\nThe zombies are awesome and exactly what you would expect, in a zombie apocalypse world that has been left in decay for so many years, you get ordinary zombies called the infected, then there is bloaters, stalkers, clickers that sort of thing. The Bad guys you meet are typical and always intense it is great to fight them and I do find the gun battles are great and very intense, again throwing molotovs and pipe bombs etc is awesome lol. The game is a third person and does have elements of duck and cover at times, but it is done really well and doesn't deteriorate from the gameplay, as you enter new areas you will get autosave checkpoints and areas to stop resupply, use workstations and heal etc, the game also allows you pause and save the last checkpoint manually if you want and the controller support is fantastic, it works well with my Xbox and PS5 Dual sense controllers.\n\nAs it is a story game something I didn't like so much was the quick time events, sometimes they can be a little tricky and you have to pay attention and there is similar sort of parts, where you don't have guns and to use melee and fist fight I always ended up dieing, when it came to these and it would be done in a sort of cinematic camera style a bit of trial and error when you get to them, though with that being said I still ultimately loved the game from start to finish. The No Return mode is excellent too, I like that you can go for a run and see how far you can get, these tend to vary between surviving waves, lasting a certain time and you know killing so many monsters etc a bit like that, it would be at different places you would get the chance to upgrade and craft stuff, then you earn credits in between making it back and using them as a reward for new weapons or items. All of which is separate from the main story and you can play as any character you want too, as long as you have unlocked them as a playable skin, though I do wish it had coop mode sadly it seems to be single player only.\n\nIt is worth mentioning the game is very long or at least I thought it was, I mean it took me about roughly 90 hours according to steam to actually finish the game so yea, this never really bothered me though I always liked the fact I had the game to resume as something else to play, I was gutted when I finally finished it and I hope eventually there is a third game I would love to play that as well. I think the game is excellent for its story to me that was the highlight of the game or the best part, sometimes it did feel like I was watching another movie or show, it keeps you very on edge most of the time, I was always desperate to know what happens next. \n\nI can safely say this is a game everyone should play it is super awesome and very high quality, I would say it is worth the full price it is great all around to play and if I had to score it, I would say a solid 10 out of 10 one of my favorite games on Steam and PlayStation, if you are looking for a proper zombie game get this one and make sure to give the first game a go before playing this, that game is amazing too and should not be missed either.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "holy fuck, dude. this might be the BEST game ive ever played. words cannot describe the amount of PEAK this game is. this is the best part 2 to any game ever. it was worth every last fucking penny",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "Damn, no matter what, this game makes you want to live it, not just play it.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "The Last of Us Part II is an emotional, beautifully crafted experience. The story hits hard, the characters feel real, and the gameplay is smooth and engaging. It’s one of those games that stays with you long after you finish it. An absolute must-play. Emotional, bold, and beautifully made definitely one of the most memorable gaming experiences I’ve ever had.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I avoided The Last of Us II when it originally released on PlayStation due to the controversy that surrounded it, and I continued to avoid it when a Vice article detailing the games supposed problematic politics regarding real world conflicts further put me off. But having been such a big fan of the first game, I finally decided that if the game's narrative themes made me uncomfortable, it was okay because games are art, and art isn't always supposed to make us comfortable. It's supposed to tell us something about the human psyche and I wanted to experience this game at least once.\n\nAfter finishing the game, The Last of Us II delivered. I feel like that Vice article was clutching at straws with some of its assertions, and while I understand some of the controversy that surrounded the game at launch, much of it was unwarranted or turned out to be outright untrue, and I wonder if some of those people actually played the game. This was truly a brilliantly told story and I'm glad I finally got to play this masterpiece. I now feel incredibly stupid for giving any of the outside noise credence and not playing it sooner.\n\n\n[h3]Performance[/h3]\nThis was however an experience I still almost never got to have. After the game crashed twice within the first 2 hours, I strongly considered getting a refund, given Nixxes' reputation for awful PC ports, and how poorly the port of the first game performed. Against my better judgement I pushed on and, fortunately, the game only crashed one other time during my 47+ hour playthrough and the game performed ridiculously smooth. For the record, I played this on a 4080, Ryzen 9 5950x, with 64GB of RAM, so I can't comment on how it performs on different systems.\n\n[h3]Story (MAJOR SPOILERS)[/h3]\nThe game does a great job of making you empathise with Ellie and hating Abby who is initially the game's antagonist. I was hesitant to continue playing the game when it transition to Abby's perspective, and I put down the game for a few days. But, when I jumped back in, to my surprise, the game did an equally great job of helping you to empathise with Abby to the point of almost hating even Ellie! You grow to love so many of the characters, some of whom die by the other's hand, and I sobbed like a baby all throughout the [spoiler]final showdown, not knowing who to root for. It was such a rollercoaster of emotions as I was yelling for Ellie \"kill her!\", but reeling as I came to the realisation that Abby might actually die as I held her head beneath the water. I felt everything Ellie felt in that moment.[/spoiler] The crying didn't stop until some time after the credits had finished rolling, which I sat through in its entirety as I processed what I had just experienced. 10/10\n\n[h3]Grounded Mode[/h3]\nThis was tough to get through in the best and worst of ways. As a veteran of grounded mode who Platinumed the first game, I thought I was ready to jump straight into the deep end with this one. I was not. I'm not sure if it's that much harder than the first game, or if my age as a gamer is catching up to me, but Grounded can be extremely punishing and genuinely stressful at the best of times. Being too stubborn to turn down the difficulty, I had to take breaks that sometimes lasted weeks to avoid the stress of another session in Grounded Mode, but always found myself coming back. I had to constantly restart from the last checkpoint, as I would always be caught by the first or second enemy on any given encounter. This padded my playtime significantly, and checkpoints being unreliable, and seemingly random, was a cause for much frustration. All that being said, I wouldn't have played it any other way. This feels like the definitive way this game should be played as it adds so much tension to the experience. Conservation of resources is king and stealth is the only viable option. It's incredibly rewarding when you finally beat that boss using every last bit of your resources, or escape an encounter by the skin of your teeth.\n\n[h3]Pacing[/h3]\nOne thing this game does great is how it breaks up the up the action and takes you away from the stressful encounters to give you a moment to catch your breath. This gives you a chance to get to know the characters more deeply and understand what motivates them during the action-packed combat/stealth sequences. These moments always gave me a sense of relief and often put a smile on my face, how even in the face of such adversity, these characters could still have a laugh. Though, even through some of these sequences I was on edge, oftentimes for no reason... I guess another thing this game does great is making you expect danger when you least expect it!\n\n[h3]Audio[/h3]\nThey went full Hollywood on this one. You never go full Hollywood when it comes to audio. Balancing is neither speaker or headset friendly, with gunshots, explosions and music cranked up to the max, and dialogue turned down so low, it's barely a whisper. There are volume sliders in the settings, including a \"dialogue\" slider, but this only affects dialogue during gameplay. Dialogue in cutscenes is handled by a separate \"cinematics\" slider, but this is an all-encompassing slider that also handles the volume for gunshots, explosions and music in these cutscenes, so there's no way to rebalance cutscenes so dialogue is audible. Subtitles are a must unless you're happy to blow either your speakers or eardrums, or wake up the neighbours during your late night sessions. If not subtitles, at the very least thick walls.\n\n[h3]Conclusion[/h3]\nMy verdict is that Naughty Dog doesn't miss. As the game is currently on sale, I can't recommend enough. Play the game, enjoy, and thank me later.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "The story and gameplay is fantastic, 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Yes yes yes!!! I love the game and graphics are awesome!!!Yes yes yes!!!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Well here we go . The graphics? Absolutely stunning  like really just wow .  What I wasn`t fan of was  Abby’s section. Yeah, I get it, it’s her side of the story, character growth, narrative depth, blah blah ,,, but it honestly felt like I played more as her than Ellie. I just wish I’d gotten to play more as Ellie, honestly.  And also  still, I was kinda shocked by what happened at the end (don’t worry, I won’t spoil it for you).\n!!! Joel exists in my brain rent-free, thanks to this game. !!!\nStill i`d say give it a go if you have not played it !!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "there were some major improvements done for this port compared to the port for part 1. it ran flawlessly for me. the story is brutal and violent, just like the combat. it has some really thought provoking messages about the cycle of violence. however, this game is not meant for everyone. it is not meant for people who confuse emotional discomfort for bad writing. it is also not meant for those who deliberately ignore thematic symmetry. and perhaps most importantly, it is not meant for people who think that that realism is an agenda. i often get caught up talking about how much i love part 2's story, but the combat truly is something special. adding chronological mode was a great addition for replayability as well as No Return, letting you demolish enemies in a roguelike survival mode. this wasnt included in the original release, and it is siiiiick. being able to play as bill, manny, or even yara makes it all that cooler. for those who played the original release of the last of us 1, you will enjoy the Capture mode especially, as it brings back feelings of playing Interrogation mode in Factions MP. \"i would do it all over again.\"",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My time played probably says it all. I really enjoy this game. The story is heart wrenching, the combat (especially the gunplay) is something I wish other games would copy, and if I can make one recommendation as someone who doesn't usually play games on their hardest difficulty, this is a game that you really should consider playing on Grounded.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great storytale, blessed gameplay with realistic killing system, lovely",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best story-driven games out there imo. It constantly makes you question events, rethink the ploat, and analyze characters' decisions throughout a fairly long playthrough. Even months after finishing it, you may still find yourself simply wondering how things could have gone differently.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Experience it and forget about the online arguments...\n\nThe gameplay is way better than the first one. The combat feels so heavy and brutal, you actually have to dodge now, and the stealth is tense AF. Every fight feels like a desperate struggle, exactly how it should feel in the apocalypse.\n\nNow the story. It's not the story you wanted but it's a huge, emotional punch to the gut. Honestly, it satisfied me!\n\nYou Need To Play This. Seriously.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yeah the game is good, its really fun to play the no return game mode, it gives a LOT of replay value as the story has a lot of moments where you are walking and talking, that stuff is good but sometimes i just want to go in and kill some zombies\n\nstory is good, i like it, i think some things could of been moved around so the story felt better [spoiler] playing as Abbs after playing as ellie feels like poop, i get thats what they was going for with giving you the other side of the story but i felt like it would of been better to go back and forth with each character [/spoiler]\n\nbut it is a good story and it feels good to play, just expect long parts of the game where you walk and talk, with the gameplay part taking a backseat",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the emotions and bond i feel for this game is incredible. everything from characters, visuals, music to the story itself is perfect. it might sound silly saying that a game means literally everything to me but it is true. i am so deeply bonded with this game that i can't even explain it. seeing the character development left me heart broken, especially in ellies case. this game offers so many emotions such as sadness, happiness, anger and guilt while going through all the locations, killing people / infected, sneaking around collecting collectibles and resources, reading all the letters left behind.  never played a better  game and nothing will ever change my mind",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best game I've ever played. I don't there is better stealth game than this in terms of realism in both gameplay and AI of Npc. It is still surprising that no body else have such realistic Npc AI other than rockstar games. The optimization is very good (not as good as it is on playstation but definitely better than first part on pc). The Graphics are still good enough to match the latest games visual quality.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The part two has a stronger battle system than the part one, but its plot is inferior to the part one",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The gameplay was phenomenal and story had me crying, laughing and on edge. Naughty Dog delivered.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is emotional. A heavy story of revenge and loss. Incredible visual style and detail. Everyone must immerse themselves in this story. A game that is timeless.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing sequel!! With the controversy of the fan base for Part 2 for me its a must play and i loved it. Ellie's character growth really shines in the story. I also enjoyed playing as Abby and experiencing her story as i think shes a well written character. The only thing that i will say is I wish Joel could of been more involved in the present story as i felt he was killed off a little to early. The flash backs with Ellie and Joel are some of the best gaming experience that i ever played and it makes up for Joel being killed off so quickly. If your looking for a sequel to an amazing game The Last Of Us Part 2 is a great choice. You won't be disappointed!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "An absolute masterpiece... not much else to say\nshame it doesnt have fractions multiplayer from TLOU part 1 on ps4",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First time leaving a review for a game on steam, because it's very very well deserved. I've played games from Half-life, GTA, The Witcher 3 etc.. and let me tell you this game is a literal MASTERPIECE. Not sure what the comments about this game narrative having potholes are on about, but I thought the story line was phenomenal. The visuals and atmosphere are unreal. I know I'm not a gaming critic per se but I can confidently say this is one dang good game and it's worth every penny I paid. Hella recommend",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The Last of Us Part II Remastered takes an already divisive but undeniably ambitious game and gives it the treatment it always deserved. This isn’t a simple resolution bump; it feels like a definitive edition that respects both the original vision and the players who loved (or struggled with) that vision.\n\nOn PS5, the first thing that hits you is how clean everything feels. The higher resolution, smoother performance, and faster loading make replaying the story far more immersive. Seattle’s ruined streets, dense foliage, interiors choked with dust and decay – it all feels sharper and more alive. The improved fidelity doesn’t just make the game prettier; it makes the violence, the quiet moments, and the environmental storytelling land harder.\n\nThe new No Return roguelike mode is a surprise highlight. What could have felt like a throwaway extra is actually dangerously addictive. Cycling through encounters, experimenting with different characters and builds, and getting dropped into tense combat sandboxes gives the already excellent gameplay a new, replayable structure. It leans into what Naughty Dog does best – tight, high-stakes encounters – but lets you enjoy them without the emotional weight of the full narrative every time.\n\nThe Lost Levels and behind-the-scenes content are a love letter to people who care about how games are actually made. Seeing unfinished spaces, playing through cut content, and listening to developer commentary turns the remaster into a mini interactive documentary. It doesn’t undercut the main story; it deepens your appreciation of why certain choices were made.\n\nThe guitar free play mode is another small but meaningful addition. It takes what was a cool in-game detail and turns it into a little creative sandbox. It’s the kind of feature that shows a studio paying attention to what players latched onto the first time around.\n\nStory-wise, nothing fundamental has changed – and that’s good. Part II is still bold, uncomfortable, sometimes exhausting… and that is exactly why it works. It’s a game about consequences, cycles of violence, and the ways grief rots people from the inside. You don’t walk away “happy,” you walk away affected. In Remastered form, with the added modes and the technical polish, it’s easier than ever to appreciate the risk and craft behind it.\n\nIf you hated the story the first time, this version probably won’t change your mind. But if you were on the fence, curious, or already loved it, The Last of Us Part II Remastered is the best way to experience it: technically refined, feature-rich, and packed with smart extras that respect your time and your curiosity.\n\nVerdict: A brutal, beautiful, fully realized version of one of the most daring games of the last decade. If you’re willing to be challenged emotionally, this remaster is absolutely worth your time.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A strong opening that slowly tapers off, with the narrative becoming less cohesive over time and an ending that ultimately feels underwhelming. From a technical standpoint, though, the PC port is a significant improvement over Part I — far better optimization, more consistent frame pacing, noticeably fewer streaming issues, and overall higher stability. If you appreciated the first game, this installment is absolutely worth playing, even if the story quality fluctuates.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The last of us part 2 is the best game ive played this year,\r\nthe graphics and the mechanics are the best ive seen in a video game, the story is fantastic and people who say otherwise arent telling the truth, if people are trying to tell you not to play this game, DO NOT LISTEN, this is genuinaly a top 10 game for me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I LOVED Tlou 1 so much, and played it like 17 times in a row, the story and emotion just merge so well and make u feel for the game, this one was just as good, a little boring at times but i accept, THO i HATE the ending, the make it cut way to fast and left a lot out about what happened",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is it, the sequel of the greatest game of all time, it doesn't disappoint one bit it's a masterpiece, you must play this, period. Also runs like a dream on a 9800X3D + RTX 4080.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good gameplay, terrible story. Get it for free, it has no DRM.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wow. Game was incredible. The graphics were awesome with the remaster, the story from beginning to end was immeasurably satisfying, the voice acting... 10, the fight scenes 10, the choices were linear but felt like you were making your own decisions, and a LOT of surprising moments that left me breathless. I say all the time I wish I could find a game that would make me feel something and this game is definitely it. I picked this up during a sale but would 1000% pay full price for this game, which is a very rare statement now-adays. I can't remember a time I was this impressed with a game and can't recommend it enough. 5 stars.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Visually stunning with a super engaging story. Playing this game now I truly don't understand some of the hate this game recieved when it released. I feel that this was an outstanding follow up to the first game!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Stunning graphics, very smooth game mechanics and story is a masterpiece. \nDo not watch HBO series before playing, this game is way more better :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really love this game. I waited a long time to play this franchise on PC and I'm glad I was finally able to.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games out there that has a real apocalyptic atmosphere that I want to be in, the story is just a bonus.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can only review the base game as of now because I haven't played through this PC remaster, just the original PS4 release.\n\nPhenomenal game. Perhaps the best cinematic and interactive storytelling experience in video game history. It's chock full of themes related to different types of communities, religion, war, violence, imperialistic miliatarism, friendship, revenge, and much, much more. Amazing characters, soundtrack, and other production values. Some of the best voice acting in games ever. I give it a 10/10. This PC version seems like it's even better with the No Return mode and updated graphics.\n\nIf you like drama and challenging emotional narratives this is a game for you. It's a grief-machine, your favorite characters are always at risk of losing someone or themselves....",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Last of Us Part II is a brutal and unflinching experience that's as emotionally devastating as it is technically impressive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i played this game on the ps4 when it came out and i had to buy it on pc, i don't understand the hate for this game personally is my favorite of all time. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is one of my favourites. It is a true masterpeace that isnt a revenge story but a grounded story of trauma and loss with inability to cope with it while experiencing consequences for coping in that way [spoiler] along with continuing living and growing when our parental/caretaker figures are taken away. Killing off important charater doesnt ruin this but makes this deep and grounded story that makes sense. [/spoiler]  Gameplay is the most satisfying loop i have ever played. It is worth every penny !",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "There are games that entertain you.\r\nThere are games that impress you.\r\nAnd then there are games like The Last of Us Part II — the ones that wreck you and make you sit in silence staring at the credits, wondering how the hell you’re supposed to feel",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "great story and the game doesn´t crash randomly anymore",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the last of us part 2 vale a pena se você não liga pra oque falar do jogo, sobre falarem que o jogo é ''lacração'' ou ''forçado'', o jogo realmente é forçado graças ao Neil Druckmann, a facção da abby é uma piada, o jogo tenta te fazer sentir empatia pela abby porque ela é a ''garota dos cachorros'' e a ellie é a ''garota que mata cachorros'', se você só jogar por jogar, vale a pena, mas se você presta atenção nisso, você acha o jogo ridiculo, espero que não tenha um the last of us part 3, a historia ja esta fechada e não tem muito pra que continuar sem ficar algo mais forçado que o part 2\n\nengraçado como o ''pior'' the last of us tem a melhor gameplaY",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "May i stand unshaken\nAmidst amidst a cruel world\n\nWait, it's the wrong game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "💔There are few games like this one, it's clear that the developers have done a good job💔\n💔I bought this game with a 20% discount and I don't regret it at all, it's totally worth the money💔\n💔You are faced with a choice, what is more important: money or emotions?💔\n[spoiler]💔I despise pirated games💔[/spoiler]",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Great game, story is not as bad as the internet wanted me to believe.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Clearly, the egg (the game) came first! The HBO seasons are just like the chicken poking around with more dirty stuff…",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Please play it in Grounded mode. \r\n\r\nYeah the writing might've made me scratch my head a couple times, but this game is the greatest stealth experience I've ever had, extremely intense and engaging.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It took me over 75 hours to get all the achievements to pop on my profile, the run on [b]grounded + permadeath difficulty[/b] took most of the time for me (and yes, I died. A lot.), but it was worth it. As a fan of the series, [b]The Last of Us Part 2[/b] is awesome.\n\nThe story is good, interesting, and really drives home its central theme: [i]when you walk the path of revenge, there are no real winners[/i]. It's a heavy narrative that sticks for a long time after beating the game.\n\nThe gameplay is challenging, especially on harder settings, and the game has some genuinely scary sections that keep you on edge. I also spent time with the [b]'No Return' mode[/b]. It's a lot of fun and a great addition, but I did find it becoming repetitive after a while. Importantly, I didn't encounter a single bug, making for a very polished experience (unlike my time with the first game).\n\nOverall, Part 2 is a great game. It's an emotional journey that delivers a powerful story and solid gameplay. [b]Definitely recommended.[/b]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "First off, incredible game, mostly pretty good port aside from a few visual and one rare audio bug. Very rarely, the world would flash white for a second, audio would be slightly de-synced from what was happening, Ellie/Abby would contort weirdly for a brief second in cinematics before returning to normal and blood disappearing in some cutscenes (notably in the one where Owen and Mel meet their end + Ellie is laying on the ground choking blood). I've had a couple bugs in my first playthrough, which was disappointing, but they didn't bring down my game experience overall. They didn't happen often, but they happened enough.\n\nIt is incredibly refreshing to see a big piece of media tackle the topic gender roles, sexuality and trans identity with actual care, and somehow make it look easy. It has the guts to actually say something, be daring and boundary pushing while also not letting it overcrowd the narrative, only add to it in monumental ways. At the end of the day, this is a story about people. Trauma and loss, how it affects us and shapes us as people. Love, the pretty and downright heinous parts of it, what we will do for the ones we love, how blinded we can be from love, how love turns to hate. The focal point of TLOU2 are the people who inhabit its world, and every single one of them is incredibly striking both in their depth and their performances.\n\nGameplay is some of the best Naughty Dog has ever done. It nails the frantic, fast paced \"fight for your life\" nature of the first game even more so here, and the slow and methodical stealth gameplay from the original, with more additions to your arsenal that fits both like a glove.\n\nI've been a huge fan of this game since it released 5 years ago, and going back to it has consistently been a fantastic experience all the way through. 2 games in one, and if I were to pick a favourite, Abby's game is my favourite. You get the same kind of shtick they did with Joel (distant person learns to become human), but with even bigger standout moments that go toe-to-toe with the original's finest moments. The Bridge, Rat King, most of the scenes between Abby and Owen and the Seraphite Island are fantastic.\n\nEllie, Dina, Joel, Tommy, Jesse, Abby, Lev, Yara, Owen, Mel, Manny and so SO many more are extremely memorable, amazingly written and portrayed to near perfection by their actors.\n\nThis is a top 3 game for me. I love, and will always love, Last of Us 2. One of the greatest, boldest sequels of the 21st century.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "WOW! This game is AMA---ZING!!. What a brilliant game. \n\nAfter playing the first game,  I went straight ahead and bought this one (second game). I just finished the game and this was a superb and brilliant game. If I were to award The Last of Us™ Part II, I would. THIS IS DEFINITELY GAME OF THE YEAR for me. \n\nPlaying the game, story and getting to know the characters is amazing. Only one drawback is going back and forth in time (forward and backwards in time) which I did like but did not mind it. I would have preferred a continued timeline. \n\nEnough said but BE WARNED: This game has a lots of dark places with only your torch that is creepy and scary which keeps you on guard. Make sure your weapons is fully loaded and upgraded where possible. A bit like Dead Space where you have to keep your weapons loaded at all times. \n\nFinally PLEASE play the first game then come to this one as there are lots of references to the first game. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is absolutely incredible. Phenomenal story, gameplay, graphics, everything. I personally don't understand the criticism of the story at all, its an immensely powerful tale of revenge, grief, and redemption and is the sort of story that only a video game can tell. Each character (even the \"side\" characters) are wonderfully fleshed out and you truly connect with each of them. I cannot recommend this game enough.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The hate for this game honestly feels forced. It’s easily one of the most overhated games in recent memory. A lot of people seem to dislike it just because the story didn’t go the way they wanted, but that doesn’t make it a bad story. Personally, I think it’s actually better than the first one in a lot of ways. It’s darker, riskier, and has way more emotional highs and lows. There are some pacing issues especially with the Abby sections of the game but it is nothing too serious.\n\nStory aside, the gameplay here is incredible. Every bullet, every swing, every dodge feels weighty and satisfying. The combat is brutal, intense, and super polished. And those facial animations? Top-tier — something Naughty Dog continues to absolutely nail. You can feel every emotion in the characters’ faces, and it adds so much to the immersion.\n\nThe new roguelike mode is one of the main reasons I bought this game again after playing it back in 2020 on the PS4. It’s such a smart addition that keeps me coming back just to experience one of my favorite combat systems in gaming again and again.\n\nAll in all, this game doesn’t deserve half the hate it gets. It is a gaming masterpiece, one of ND best work and can't wait to see what they do next.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought a PlayStation back in the day just to play the first Last of Us — that’s how much I loved it. Sadly, by the time Part II came out, I no longer owned a console. And to be honest, all those “woke,” “bad writing,” “ruined the series” reviews I kept seeing online made me hesitate.\n\nBut wow… what a mistake that was.\n\nAfter finally playing it, I can confidently say: The Last of Us Part II is a masterpiece. Naughty Dog has once again crafted an incredibly emotional journey that hit me harder than I expected. More than once, I had tears in my eyes — this game truly moved me on a deep level.\n\nAnd you know what? I actually like Abby even more than Ellie. How could you not? She’s strong, compassionate, and, despite everything she’s been through, she still chooses mercy — even letting her enemies live multiple times. That takes real strength.\n\nThis isn’t just a game. It’s a raw, painful, and beautiful story about loss, revenge, forgiveness, and humanity.\n\nThank you, Naughty Dog, for creating something so powerful.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "An emotional giant. This isn’t just a sequel to one of the best games ever made, it’s a full confrontation with what that legacy means. It’s darker, bigger, angrier, and more human. Few games even attempt this kind of depth.\n\nThis game absolutely broke me. Where Part I constantly tugged at my heart, Part II completely ripped it open. The final stretch had me in tears for minutes. pure, raw emotional payoff. It’s a story about obsession, revenge, and the impossible weight of forgiveness. Ellie’s arc is devastatingly personal; Abby’s, reluctant and redemptive. The writing dives into trauma, consequence, and perspective in a way no other AAA game has dared. It’s brutal and sensitive at once, and that balance is what makes it so powerful. Ellie’s arc feels more mature, more internalized. You feel the mental toll, the anger, the fragility, all with that haunting Naughty Dog realism. The side characters also all feel human and layered. Nobody’s filler here. Every name adds something.\n\nMechanically, it’s a huge leap from Part I. The fluidity of movement, dynamic combat, stealth, gunplay, everything just feels good. Encounters are unpredictable and cinematic without ever breaking immersion. It’s still survival horror at its heart, but it’s more open and expressive. Bigger spaces, multiple approaches, more environmental storytelling. Seattle is dense and alive in its decay. Rain, overgrowth, light, it’s all insane. Every area feels handcrafted, whether it’s a crumbling theatre, a flooded street, or a quiet moment of peace. It’s less subtle than Part I’s world, but far more expansive. The attention to detail is unreal. Gorgeous visuals, flawless animation, and haunting sound design. The score moves between melancholy and dread effortlessly.\n\nThe dual narrative works. It’s jarring at first, intentionally, but by the time it all circles back, it hits like a truck. A few segments drag slightly, but the emotional rhythm and sheer polish carry everything.\n\nIf Part I was tight and focused, Part II is sprawling and ambitious, and it earns that scope. This is gaming at its most cinematic and emotionally exhausting, but also its most rewarding. It’s rare for a sequel to match, let alone deepen, a masterpiece. But this one does. It doesn’t just follow up on Part I, it dares to question it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is phenomenal, truly a perfectly crafted game, from the combat to the well crafted environments and then there is the NPC AI being the best I've ever experienced in any game.\r\n\r\nThe only thing TLOU 1 has over 2 is the story but that isn't to say TLOU 2 has a bad narrative and to the all the TLOU 1 glazers if you think the story doesn't make sense then your media literacy capabilities are that of a kitchen sink and you should replay both games.\r\n\r\nThis game received far too much hate and deserved that Game of the year in 2018. \r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "start to finish this is a must also the 1st one  its all one story really rather then a second game so i recommend playing the first aswell.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "story is straight up garbage but gameplay is super cool",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's been a while since I have been this impressed by a game. The graphics and setting are superb (a highlight so far is when you first enter the abonded city of Seatle), the story is entertaining, and the gameplay is the best you can get in the action game genre in my opinion. An absolute must buy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“The Last of Us Part II” is a powerful, daring, and technically stunning experience that stays with you long after the credits roll. Naughty Dog has created a game that not only expands on the original story but also takes bold narrative risks rarely seen in major AAA titles. It’s a tale of loss, revenge, and the consequences of our actions – a story that’s challenging, but incredibly mature.\r\n\r\nThe visual and audio presentation is exceptional. Facial animations, environmental details, and the atmosphere of the ruined world are breathtakingly realistic. Gustavo Santaolalla’s music, along with additional compositions, adds emotional depth to every moment. This is a game that grips you with its intensity just as often as it impresses with its artistic quality.\r\n\r\nFrom a gameplay perspective, “Part II” is a major step forward. Fluid combat, an excellent stealth system, and intelligent enemies make every encounter tense and rewarding. The world is rich in detail, encouraging exploration, and the non-linear storytelling keeps the player emotionally invested throughout the journey.\r\n\r\nBut the game’s greatest strength is its fearless storytelling. The developers aren’t afraid to tackle difficult themes or place the player in uncomfortable situations, prompting reflection on the characters’ motivations and choices. This makes “The Last of Us Part II” not just entertainment, but a deeply human experience.\r\n\r\nIn summary:\r\nIt’s one of the most mature, ambitious, and emotionally impactful games of the last decade. If you’re looking for a title that engages both mechanically and narratively, this is a game you absolutely shouldn’t miss.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This second part delivered an emotional punch I didn't expect. Stunnig visuals, unforgettable characters, and a story that stays with you long after the credits roll. An absolute masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After being chased away by all the negative stuff surrounding this game on release, i finally played it. It pretty much immediately became my favorite video game story of all time. #teamAbby",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game first on the ps4, playing this game again this time on pc is amazing. I prefer gameplays on pc, so far so good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worse than part I, the plot is a train wreck. Graphics and gameplay are good. 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Other then visual artifacts here and there, it's been a really enjoyable game so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am only part way through the game and it slaps. The actual gameplay is mediocre to good I would say, its nothing insane or unseen before but it makes up for this with excellent storytelling and characters. It is like you are playing a film, is the best way I would describe it, its like a story that you are playing and it is amazing. 10/10 must play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nothing is black and white. Masterpiece of a game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "+ Fun gunplay\r\n+ fun melee combat\r\n+ like the first game but also different enough\r\n+ good story\r\n+ beautiful graphics (dayum the water!)\r\n\r\n- Repetitve gameplay\r\n\r\nOverall a really fun game, worth the 40 euro's i paid imo\r\n8,5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worth checking out, despite the original flack the game got for its story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MEH I liked the first one more to be Honest, I didn't hate this one but it was more cinematic driven and less Action for me that seem to drag IMO, If they decide on a third one lets see more Action and less clips by the end of the game I was hoping the two girls would kill each other lets branch off to another character IMO, wait until prices go down to Buy IMO :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Last Of Us Part II is a amazing game that has an intense mix of emotional storytelling and tense gameplay. Its narrative explores revenge and loss with raw honesty, while the stealth and combat systems keep every encounter gripping.\n\n10/10 !!!! love this game, thanks naughty dog.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Last of Us Part II е изключително силно и емоционално преживяване, което надмина очакванията ми. Играта впечатлява с невероятно качествена графика, детайлни анимации и атмосфера, която буквално те поглъща. Историята е дълбока, смела и пълна с морални дилеми, които те карат да мислиш дълго след като си изключил конзолата. Бойната система е по-гъвкава и интензивна от всякога, а светът – мрачен, жив и опасен. Герои като Ели и Аби са представени с рядко срещана психологическа дълбочина. Това е игра, която не просто се играе, а се преживява. Един истински шедьовър на Naughty Dog.“",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly this is a really good port for a very good game, I recomend not reading any spoilers before getting into this franchise. Highly recomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As much as I loved part 1. Part 2 was way better story wise [spoiler] if you can get over Joel's death,[/spoiler]  in my subjective opinion. Also character development was top notch. So much so I could not get myself to watch the TV adaptation.\nI've encountered no gameplay or technical issues. \nOverall game is well worth the full price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 ถึงเเม้จะเป็นเกมเสียงแตก ส่วนตัวคือชอบ บททำออกมาได้ดีเข้มข้น มีเเค่บางฉากที่ยาวนานเกินจนทำให้เกมเอื่อยเเละน่าเบื่อ ระบบเกมเพลทำมาดีมาก คุ้มค่ากับการเปิดใจลองเล่น",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an amazing game. The best storyline i've ever experienced in a video game. WOW",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐ A Stunning, Emotional, Brutal, and Beautiful Experience — 10/10 ⭐\r\n\r\nThe Last of Us Part II is honestly one of the most unforgettable gaming experiences I’ve ever had. The story is absolutely fantastic with breathtaking moments, emotional highs and lows, and character arcs that hit hard. Whether it’s the quiet scenes that break your heart or the intense sequences that leave you glued to the screen, the narrative never misses.\r\n\r\nThe combat feels incredible too. Every encounter feels weighty, brutal, and grounded. Stealth, crafting, gunplay—they all blend together so smoothly that even small fights feel cinematic. I’m really hoping they announce Part III someday, because the world and characters still have so much potential, and this game proves it.\r\n\r\nWould of been great if this version included the classic Factions multiplayer. It was such a fun mode back on PS4, and it would’ve been amazing to see it return here. On the bright side, the new Survival Mode is a blast. Being able to play as iconic characters from across the series while fighting to survive is insanely fun and adds a ton of replay value. Overall, this is a masterpiece—bold, emotional, beautifully crafted, and absolutely worth playing.\r\n\r\nHighly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A divisive and narratively ambitious game, but it had to be to have any chance of following Part I. While not quite as good as Part I, I still enjoyed it a lot.\n\nCriticism of the game is split into two halves. Make sure you can tell the difference when engaging with it.\n\n[*] A vocal minority with extreme internet opinions\n[*] Normal people with reasonable takes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gollie it feels silly to say this is my 2025 goty for steam because its really a 2020 game releasing on a platform I have for the first time now in 2025 as a remaster but I enjoyed it more than anything else that came out this year and I enjoyed it immensely. I had already seen a full playthrough when it came out in 2020 of someone who I enjoy watching but who did not enjoy the story. The gameplay just all around improves upon the first game with better stealth, better levels, and more tools, the story is less straight forward but I think it makes for a more compelling story or at least one I think about and want to replay more. No return is good fun and as always I'm a sucker for a game with good difficulty and grounded and grounded+ do it well. I might recommend a fan of this game to go play the 2 plague tale games or honestly just play the 2nd game (probably gamepass is the cheapest way but they also get bundled together for like 25 bucks)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This right here is a piece of art that was blessed upon us from the gods of heaven, absolute masterclass, totally recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would recommand this game to anyone who played the first part and the second part is just entertaining as the first",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun story. Longer than the first a brings a twist with this game. Introduced some characters that at first I was like this sucks but than you actually get their perspective and storyline and it ended up being pretty solid at the end making this game all around good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, 2 sex scenes abby helped husband cheat, not fun. Ellie gay, cool beans. Good game, recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No Return alone makes this worth buying, phenomenal game mechanics too. Story mode is alright.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a very beautiful game in my opinion and nice graphs and lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A 10/10 game for me. I really enjoyed the story and the tragedy behind it, a story that now left me empty. I enjoyed playing both as Ellie and as Abby (yes, what she does at the start is awful) and to see how they try to grow only to be hunted by the circle of revenge.\n\nI really hope for a part III just to see how the story unfolds for them, or at least Ellie, in case any of them will still be in that game if they make it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy the scenery and story of the game and the battle sciences are always make me feel excited!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☐ Fast\n☑ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☑ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☑ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Creative gameplay is huge here, loved the crazy story as I haven't ever been this invested in a story game. Actually all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought the game when it originally released and still have the special edition & the steelbook, i played through blind and enjoyed it for the most part but of course it has its flaws. I never really got the hate behind the game or certain characters because i understood the story and certain character motivations well, the gameplay itself is chefs kiss and is a lot more versatile than the first, you play as both Ellie and Abby and each have their own skills and weapons, It looks amazing and has a lot of small details like certain characters phobias being represented.\n\nThe story itself though good might make it or break it for you, the acting is top notch and the story more or less is your run of the mill revenge story with a separate story inserted beside it which may break it for you but stick with it because it does pay off although it might of been better if it were its own game. But you get what you pay for and that's a movie standard experience with awesome gameplay. \n\nAs for the game itself it has its flaws like some audio issues especially when streaming to discord or recording but this is also a problem on part 1 too and I've yet to find a fix.\n\nAt the end of the day if you enjoy playing as two badass women with a knack for killing all sorts of monsters, sneaking around and surprising enemies surviving with the hefty arsenal of tools you can find in game then this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is so good and rich pictures make you feel you are in the game,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The visuals, the story, the gameplay feel really good. I hated the story at first but once i gave it a chance i loved every single second i spent playing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such an immersive game and full of mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an awesome balance on game play, visuals and sounds. I really loved the story and got so immersed in it that i lost track of time so many times. I will play through this again a few times like i did with the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Last Of Us Part II might have some of the most thrilling fight-or-flight gameplay I've played in a long time. Rarely does a game make me feel like I've narrowly escaped every other encounter by the skin of my teeth, and provide such a weird euphoric hit of eustress and dopamine for doing so.\n\nIt's one of those kinds of games where once I beat it, I felt so affected by it I found myself staring out a window for about ten minutes or so. The games that simply scare me don't stick around as well in my mind as much as the games that somehow still actively haunt my thoughts occasionally long after I've played them, and I'm glad that this game'll occupy that kind of mental shelf space.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games of all time! The gameplay alone is so fun and cinematic!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm glad I gave this and the 1st game PC port a try! The chuds during COVID gave this game a really bad rep but its honestly amazing. the story, characters and overall gameplay loop are phenomenal :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally got around to playing this franchise.\nI thoroughly enjoyed both of them.\n\nThis latest one was a great leap and refinement in technical and visual presentation.\nThe story didn't ward me off the game, as it did to some.\nNew Game+ and other modes offer a vast range of replay-ability especially with the rogue-like mode \"Left Behind\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Story Where Love Becomes Both Weapon and Wound.\n\nThe Last of Us Part II is a rare narrative experience that dares to dismantle its characters piece by piece, not out of cruelty, but out of a profound commitment to exploring love in all its contradictory forms. While the game is often remembered for its brutality, at its core lies a deeply human story about how love—protective, obsessive, redemptive, destructive—shapes every choice its characters make.\n\nThe narrative’s greatest achievement is its refusal to present love as something clean or heroic. Instead, it portrays love as a force that can both inspire tenderness and ignite devastation. Ellie’s journey is driven by a love born of grief, a love so ruptured that it twists into a need for resolution at any cost. Her pursuit is painful to watch not because it is senseless, but because it is so heartbreakingly human. The game forces players to sit with the uncomfortable truth that love can harden into vengeance just as easily as it can soften into compassion.\n\nSimilarly, Abby’s story reframes the concept of love from the other side of the cycle. Her actions, while initially difficult to accept, emerge from the same well of devotion that motivates Ellie—proof that love is not the domain of heroes or villains but simply of people. By giving equal weight to both perspectives, the game skillfully transforms empathy from a passive idea into an active challenge. You are not asked to agree with every character—but you are asked to understand them.\n\nThe game’s quieter moments are what make its emotional weight so powerful. A guitar shared in silence, a joke book opened to ease tension, a glimpse of life that might have been—these scenes remind us that even in a world scarred by violence, love continues to bloom in unexpected, fragile ways. The contrast between these intimate moments and the sweeping tragedy of the narrative gives the story its resonance. Love becomes the pulse beneath the chaos, the reason every blow hurts as much as it does.\n\nIn the end, The Last of Us Part II doesn’t offer easy answers. Instead, it offers something far more honest: a meditation on how complex, contradictory, and transformative love can be. It leaves players not with certainty, but with reflection—an emotional afterimage that lingers long after the credits roll.\n\nIt’s a story that understands that to love deeply is to be vulnerable to both joy and destruction, and it brings that truth to life with fearless storytelling and raw, unforgettable characters.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Hello ! (I'm French so forgive me if i make any mistake while writing)\n\nI played this game for the first time in 2022, on PS4, i finished the game on multiple difficulties and played it multiples times. I played it again this year on PC, once and i thought \"I'm never playing that game again\".\n\nI had played Part 1 one year before in 2021 and it instantly became one of my favorite solo - story driven  games of all time. \n\nWhen i made my review of TLOU Part 1 i think i gave it 11/10 for story and 7/10 for gameplay.\n- Great Side Characters (and main characters)\n- Visually stunning \n- Innovative in a genre stacked with campetition (dying light, left 4 dead, zombie island...)\n- Good, reactive and fluid Gameplay \n- Great enemy AI\n- Insanely well written story\n\nNow if i had to talk about TLOU Part 2 : \n- Characters : what a disappointment, the game doesn't feel like it wants you to care for Jackson, its people, or Ellie's friend. You will spend much more time learning about people you don't care about. \n\nThen Ellie (The main character, the person i actually want to know the story of)  gets like 50% of screen time, then we get 15% of flashback that are basically a continuation of the first game. And finally, we get 35% of mental torture that will make you want to throw your computer through the window.\n\nIn the first game we get Bill, Henry and Sam, Marlene, David, Tommy, Joel and Tess ! Memorable characters.\nIn my opinion, TLOU Part 2 has 5 memorable characters at best none of them being Ellie or Abbie.\n\n- Gameplay : TLOU Part 2 blew me away when it came to gameplay though, truly amazing and satisfying. \nIt expends on what Part 1 did and makes it 100 times better. \nOn top of that there were also some crazy sections which are very well orchestrated and paced in my opinion (action / horror / peace / mesmerizing). \nThe encounters and fights are also well designed and are a pleasure to do.\n\n- The Story : Another disappointment\nPeople spare each other for no reason. \nPeople say their name to complete strangers and make stupid decisions then show insane survival instincts and skills. \nThe whole game happens because of a sequences of events that you couldn't convince a conspirationist, are true.\nThe story is a big circle, at the end of the game you realize that none of what you did mattered and you didn't have a chance to do anything about it from the start (not satisfying). \nAll that loss and anger bs didn't work for me, honestly, only three deaths really had any kind of impact on me, i didn't feel sad for the characters and i didn't get emotionally moved like in the first game.\nSometimes boring. \nYou don't play Ellie when it could matter the most and the game takes position. Sadly,  if you like the direction the game takes you towards. You end up like me, betrayed and disappointed.\n\nThe flashbacks (not all of them) are an exception though, in my opinion some flashbacks were even better than the game itself.\n\nTo sum up, i'd say TLOU Part 1 is all about Depth and even if it has a less beautiful form. After doing it again on PS4 a week ago i'd give it 11/10 for Story / 11/10 for Characters and 6/10 for Gameplay :\nI'd give it an overall note of 10/10\n\nTlou Part 2 is all about form, the music is nice, it looks good, the gameplay is incredible, but it didn't feel like Tlou to me. It lacked the Depth that i was waiting for. It is a good game but i don't think it is a great TLOU game. I'd give it 4/10 for Story, 2/10 for Characters and 11/10 for gameplay: \nI'd give it an overall note of 6/10\n\nLooking back at what they could have done, i would have preferred a game focused around Ellie's story, a younger or even older version of her. Because, the game felt like it was mostly about Joel and Abbie.\nOr i would have preferred a unique story about new people that would almost totally get \"rid\" of the old characters. \n\n\nI would recommend the game if it wasn't called \"The Last Of Us\" \nThank You !",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "great gameplay but genuinely one of the worst sequels to a game ive ever seen.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "Good Gameplay, Bad Writing and Pacing Varies throughout the game. Ending left me unsatisfied. I do enjoy the visuals and rogue like mode, Overall feels like a waste of Legacy Characters.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "This game was amazing until being forced to play as the killer of one of the most beloved characters in video game history for the second half of the game.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "graphics 10/10\r\ngameplay also 10/10\r\n\r\nthe story... the story is trash. glad i waited so long to play it and paid quite little. Im so dissappointed that i played the whole thing. Last Naughty Dog game i buy",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "If you really like the story of the Last of Us Part One, then trust me, the story is better off as you enjoyed it without you touching Part Two. \r\nCombat, gameplay etc is great, it's a good game, I'm giving it a negative review purely for the direction they took the story. \r\n\r\nFor the first 7 hours of the game virtually nothing happens and it's honestly just a slug-fest to get to the next story part. Then, I was surprised with how much of a positive turn the story took for the next 5-6 hours with Abby, it was really good. \r\nHowever, there's *that* part in the story that turned me away and lost all buy in, nothing mattered after that because the story genuinely didn't make sense. I played through the last 3-4 hours genuinely not caring how it ended, just trying to finish the game. \r\nI don't know why that story direction choice was made, but if you've played the game you know exactly what moment I'm talking about and it is the most amount of buy-in I've ever lost in a single scene of anything ever. \r\n\r\nThe game is good, but if you're here to continue the amazing story of Part One, just don't.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The first half? quarter? was amazing. The story beats were hitting hard (so to speak). I was being set up for something huge...and it all went downhill. TLOU was marketed as an emotionally gripping story that doesn't shy away from the violence and pain of the worst and most desperate of the human experience. I was indeed emotionally gripped, then crushed, and instead of healing, I was cast aside in favor of cheap thrills, gimmicky writing, and overly-mechanical gameplay for it's own sake. It seems half of Naughty Dog wanted to continue the cinematic drama of the first TLOU (evident in the chronological sequences), and the other half wanted to make Metal Gear Solid with zombies.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is f****** hot a**. I wasn't crazy about the first, gave it an 8/10, but this is a 3/10 and I'm being generous. The only good thing about this game is the graphics. Game play? Boring and extremely repetitive. Story? Even worse. Whoever wrote this game should be thrown to the zombies themselves. There's so much negative stuff to say about this game it's ridiculous and I don't know where to start, so I won't. Do not give them your $. Play The Walking Dead Telltale Series game for an amazing zombie campaign. F*** Naughty Dog.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "tried everything on ASUS ally x but it crashes, also tries on a pc and even though i have latest firmware 25.x.x.x it keeps reading 23.x.x.x and crashes and asks to update to 25.x.x.x",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game requires hitting keys really fast for stupid things like turning on a generator. Fun for a five year old, not for a disabled adult.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "20:56:30:454 (00003612) > [NxApp] Windows version detection mismatch: 6.2 build 9200.7171 (detected); 10.0 build 26200.7171 (registry)\n\nWindows 6.2 is Windows 8 Pro, how it can be detected on Windows 11 Pro 25H2 machine? An obvious bug in released version of the game,  I will pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most annoying and frustrating single player game i've ever experienced, trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i installed it back to replay it, turns out the game goes unresponsive and doesn't let you play the game had my pc go unresponsive for 30 min, sony have the money but can't fix a port. honestly sony isn't made for pc, why bother porting it to pc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game states that it is an open world game, nothing can be further from the truth, you have one path and only one path to follow you can not deviate you can not make you own decisions, all of these things that are supposed to be in truly open world games,  and on the new game plus even though you know where the traps and bottlenecks exist you cannot avoid them because as i have stated earlier, there is only 1 path for moving forward, so even if you know the next action will get you blown up, you have no choice but to let it blow you up, or if there is a choke point that you know you will be attacked you cannot avoid or plan your way around it.  So the last thing I would call this game is open world,  the end is predetermined, and there is nothing you can do to cause a different ending.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Last of Us Part II REM PC – Impressions\r\n\r\nFine game. Fine, not great. Delivering some – some – and mezzo mezzo.\r\nFine gameplay, nice visual fidelity (character animation, environments), and an immersive world feel. Yet there is no wow and no boom effect — just mellow, vanilla.\r\n\r\nUnfortunately, there are way too many cinematics: long cutscenes dominate the game. Half-cutscenes, story cutscenes, action cutscenes, platform cutscenes, scenery cutscenes — and on and on the list goes. Sometimes requiring up to 3–4 skips at one time during major level-to-level or chapter-to-chapter follow-up sequences. A diabolical experience.\r\n\r\nSome of them even feel unskippable and are seriously frustrating. It literally feels like the game is more about watching a storyline cinematic — or skipping through one — than actually playing the game.\r\nIf I wanted to just watch a story, I’d pick an interesting movie and grab a fidget poppet while watching — the effect would be about the same.\r\n\r\nGameplay\r\n\r\nMechanics are good: solid traversals, no major frame dips, decent synchronization times, low stutter, and an efficient shader-compilation methodology and design. Sadly, all of that is constantly overshadowed by the endless cinematics — to the point I had to force myself to keep playing this spongy game just to justify the money I spent after ten hours in.\r\n\r\nPerformance\r\n\r\nCPU is heavy-ish during cinematic work; GPU optimization is okay. Controller support holds up to specs.\r\nNothing ground-breaking, nothing catastrophic — just fine. No major issues with AMD end-to-end Ryzen 7 8/16 CPU and 9000-series XT graphics combo.\r\n\r\nSettings & Graphics\r\n\r\nSettings menu is functional, and the overall framework and gameplay pipeline feel positive despite some random minor pixel corruption in certain areas.\r\nOtherwise, visuals are acceptable. Gameplay and game autonomics are around 6 / 10, if you’re into games that practically run on none to half-autopilot with no real sense of navigation, no real compass — since that feature seems minimal to nonexistent in this title. Part of open world.\r\n\r\nOverall\r\n\r\nThe game is mechanically solid, but the overwhelming number of long cinematics and sporadic performance issues make the experience frustrating — or rather, they kill the vibe entirely.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is extremely WOKE; the women are much more muscular than the men. Everyone makes a big deal about being gay, and there's a girl who identifies as a boy.\r\n\r\nVideo games should be about stories, not political agendas!\r\n\r\nThis is a definite Not Recommended game for me.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The Last of Us 2 attempts to say alot of things, and fails to say much at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's more last of us! If you liked the first's gameplay it still holds up, though a couple hours in not seeing anything new other than some more open levels. Optimization is unplayably bad. Even on the lowest settings, which do not look like they should be taxing, rendering slows to a slideshow, making combat impossible, desynching cutscene audio, and otherwise ruining the experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sixteen hours in and they lost me on the story. All they had to do was follow the formula of part one.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The direction, the visuals, the animations and gameplay are awesome. But the scenario... And because there are no choices to make, I felt stuck with it till the end. And it's very woke which to me, is not pleasant.\r\n\r\nBecause number 1 was such a masterpiece, this sequel in my view is simply not worth the name.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely great “sit-back-and-relax” game with stunning graphics. However, several elements make it less engaging compared to the first game. The inclusion of LGBT themes felt forced to some, the story follows a typical dramatic revenge arc, and the killing of the main character, Joel, whom we empathized with, significantly diminishes the emotional impact.\r\n\r\nJoel’s death in particular is preposterous. In the first game, he was portrayed as extremely intelligent, cautious, and not easily fooled. Yet in the second game, he recklessly reveals his name to a stranger he saved just 20 minutes earlier—without any hesitation or concern—only to be killed by that same stranger. This undermines his character and caused to lose interest in the story.\r\n\r\nAdditionally, the fact that Ellie and Tommy survive makes the revenge-driven storyline predictable, further reducing suspense and emotional stakes. Overall, while the game excels in visuals and gameplay mechanics, its narrative choices make it less compelling than its predecessor.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you haven't played this game and are on the fence about it, I'd maybe hold off and see if they patch it a bit. It seems to run great and has been out for a while, but there are some bugs that make the experience very frustrating.\r\n\r\nFirst off, I played Last of Us Part 1 and thought it was a masterpiece. It was one of the most emotional story telling experiences I've encountered. Just through and through, an incredible experience. This game seems to be shaping up the same, but every time I play it I end up in a bad mood. I decided to find out why and analyze the game more critically.\r\n\r\nThe chief problem with the game is Deena. She sucks. She is nearly useless in combat but her backstory is of this hard survivor. This is not too surprising since she is the product of the developers who led to the birth of the phrase \"ludonarrative dissonance.\" She's also ALWAYS getting in the way. She's like a cat. If you've ever lived in a house with stairs and have a cat, you know how dangerous having a creature whose always underfoot can be. And Deena IS ALWAYS UNDERFOOT! She's never more than like 5 feet from you in combat, which relies very heavily on stealth and cover, and will actively push you out of cover with her big old butt and get you discovered. \r\n\r\nI hate her. You can't kill her, I've tried. Not even booby traps will kill her. Plus she talks all the time. Joel and Ellie definitely talked in the first game, but it was far more seldom than in this game. But Joel and Ellie had chemistry. Deena and Ellie do not have quite as much, I guess a little is there, but nothing like Joel and Ellie.\r\n\r\nAnother huge issue with this game is manual saves seem to be broken in a lot of areas. Some work just fine, but in others, loading from a manual save will just restart the encounter from the last auto save spot. That can lose you around 20 minutes in the worst case, since thankfuly autosaves happen quite a lot. But it's the larger areas that seem hit with this bug. This makes me want to play longer than I sometimes want, just to make sure I hit an autosave spot.\r\n\r\nSo both of these things contribute to why I find this game puts me in a bad mood. Deena can ruin a stealthy approach in a game where the rambo approach is highly discouraged, she talks too much, and the manual save bug makes me play past the point where I'm ready to quit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Let's make a super linear game.\nLet's make it also very repetitive.\nLet's summon 20 soldiers round after round with our great combat system.\n\nLucky I didn't pay for that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is like a piece of chocolate flavored poop, it tastes very sweet and delicious, but in essence, it's still a piece of poop.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just bought a game to skip cinematics after cinematics! Amazing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not bad, but the gameplay is  really simplistic and story segments are kind of boring. Overall feels really generic, TLOU2  really wants to be like one of big budget tv series but lacks any   personality  beyond that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game, but I didnt know they make gay out of Ellie, what a shame really, I would like to give 1 start out of 5, if I find the button\nnot recommended, and for sure I will not gonna get (buy) the next one to support such Ideas if they ever make last of us 3, how come a normal person like me should like such games, please tag them for gays and lesbians",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I AM NEIDOLF DRUCKLER. COMMANDER OF THE THIRD REMASTER. LITTLE KNOWN FACT, ALSO DOPE ON ZE MIC",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just play Part 1 and pretend this one does not exists, story line is worst then part 1, to much \"woke\" agenda in your face in this one",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "a literal spit in the face of the first game. it blows",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is so broken that can not be finished due to game breaking bug on the the confrontation chapter. Reloading the save or the chapter does not do anything, simply the game is not optimized to run on steam/windows.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "take the last of us 1 add every woke shit out there boom you just got the last of us 2",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Abby and lesbians ruin the game...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's Gameplay is okay, the story is meh 4/10.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "CRASHES CRASHES CRASHES THATS ALL THIS FUCKING GAME DOES",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ending is shit, abby should have died for what she did",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game wouldnt let me use molotov in synagouge",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shitty woke gay awful perspective on post apocalypse dont get this jew slop",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "story written by preschool children",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Last of Us 3: Ellie has a stroke and fucking dies",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game of all time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hardly recommending. There are tooooooo many LGBT+ and Jew info which is already influencing the gaming experience. What a pity.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "CANT DELETE MY REVIEW",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bye main character",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lesbian fetish!!",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "spend your money somewhere else",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Já foi mió",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NEVER FORGIVE",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "disgusted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gay",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "eh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The production quality of this game is absolutely exceptional with stunning visuals, remarkable attention to detail and incredible animations. Unfortunately it is let down by far less impressive writing, questionable plot occurrences and gameplay that becomes a bit of a chore. \n\nI think the overall narrative is perfectly fine - exploring the consequences of Joel's actions in Part I is a good angle for this sequel but the way it is told and constructed is a bit of a shambles at times. The game suffers from some severe pacing issues as a result, and other instances where gameplay can feel repetitive and exhausting. \n\nSome looting sections are way too drawn out and there's also flashbacks which stall the action further as the game tires to shift away from its darkened tone into more positive moments of the past. This game is more than twice as long as the first and quite a bit of padded content could've been trimmed or even cut altogether. \n\nCombat can be fun and the mechanics feel way more expansive and refined. Sadly the majority of the game revolves around looting, cutscenes and navigating environments that lack the wow-factor of the original. There's still plenty to see and collect plus upgrading your character and weapons are also enjoyable thankfully. \n\nThe game does a terrible disservice to the original characters though and even key new ones are significantly under-developed. It also tries to promote seemingly 'evil' ones as good people as a thought-provoking bait and switch plot point, but ultimately ends up leaving longstanding fans frustrated with how iconic characters are portrayed. \n\nThis is a very tough game to recommend - mostly down to its persistently grim backdrop, bloated length and the way the story unfolds. They did a staggering job with the presentation and the plot was interesting to explore but the way everything came together was a disappointing mess to say the least.",
      "voted_up": false,
      "votes_helpful": 76
    },
    {
      "review": "Shader compilation during the gameplay was the worst decision nixxes could come up with. I am good with waiting several minutes for the stuff to be compiled while in the main menu, but for whatever reason the dudes decided to compile them on the go. During the compilation, this 5-year-old game loads 7800x3d for up to 80-90%, so you receive microstutters and even 0 FPS drops as a bonus to your experience.\n\nGreat decision, bravo!",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "[i]A disappointing love letter.[/i]\n\nThis isn’t a rage-fueled rant. Nor is it a holistically negative perspective of what was presented, or a staunch refusal to accept and embrace change. This was born out of a genuine admiration of the predecessor, and disappointment for what followed. \n\nI absolutely adored the first game, so my disappointment with the way the narrative was handled was immeasurable. Suffice it to say, this was not a worthy enough successor. Yet in spite of this, just because I’ve elected a negative outlet for my perspective, it does not correlate to regret. Most people will still enjoy this entry, myself included. But, the message could have been so much more powerful had what I’m about to dissect been properly handled.\n\nSo everything is officially set in motion by one very particular plot point that I wager most already know, but I’m not in the business of criticising this point, nor its specifics. Anyone who was enraged by this decision was rightfully so, but not so much as to warrant dropping the game entirely; I understand the sentiment, but it’s a decision bred from raw emotion. Once everyone sits with the circumstances, the pain wanes, which is what the developers wanted.\n\nThey want you to feel as Ellie did, this decision was specifically designed with the intention to guide the player into what can only be described as pure, unfiltered rage, with a strong lust for revenge. The overarching theme of the story is to detail both the void revenge leaves, but also its inevitable emotional and physical trauma, as well as the importance of empathy. So with this in mind, it’s not off to a bad start; an abrupt, and considerably unwelcome one, but it sets itself up strongly nevertheless. \n\nHowever, whilst the game preaches the futility of revenge, it contradicts itself already: we see the successful, albeit sudden, brutal, but nevertheless complete nature of Abby’s revenge. We’re meant to empathise with Ellie at this point, to feel the same rage she feels, but are punished for it despite it being begotten out of the very same principle the story wishes to diminish through Ellie. Instead of trusting the player to reflect on difficult circumstances, the game insists on telling us exactly how we should feel, oftentimes through emotionally manipulative design; as opposed to inviting empathy, it demands it irrespective as to whether or not its foundation has been properly established. I didn’t need the game to lecture me on the importance of considering the plight of others, or the reality of the emptiness that characterises revenge's conclusion; they didn’t trust me to come to this conclusion myself. Instead, this message is spoon-fed with so much force that it undermines its own moral complexity. The core problem here is not the theme, but that the design philosophy presumes distrust in the ability for the players to empathise without being steered towards any particular conclusion.\n\nNevertheless, this blends nicely with the next point: certain characters are elevated disproportionately for the sake of idealism that undermines the narrative. Simultaneously, the characters we are naturally rooting for are diminished, not sentiments earned through well-written character development, but deliberately through narrative decisions that feel punitive given the players existing emotional investment in the characters. As an example, Abby (the ‘antagonist’) is not a compassionate person, her compassion is forced as a convenient excuse to humanise her. She wasn’t originally written to be morally or ethically flawed, rather she represents a hypocritical and broken symbol as a consequence of poor narrative decisions; [i]the game was rigged from the start.[/i] \n\nLikewise, they immediately betrayed the initial intention of wanting the player to feel as Ellie did, through a time skip disclosed far later in the game; Ellie's been stewing for weeks as compared to our mere hours. Would it not have been far more effective had there been deeper transitions that allow for grief, guilt and most importantly, growth, to land more naturally? Crucial moments are often undermined by a lack of emotional runway. \n\nThe story doesn’t shy away from revenge’s bleakness, it leans into it, often to a degree that feels emotionally numbing rather than meaningful. This relentless, monotonous tone undermines the emotional balance and resolution of the player. Rather than leave us with melancholy to reflect on, we resent, exhaustfully so, the circumstances that have reaped this feeling of punishment for simply caring. There is a very fine line between allowing these melancholic emotions to resonate, as opposed to outwardly scolding the player for their engagement, because it may differ from what they’re supposed to be feeling. The empty feeling many may feel after completing the game isn’t bred out of the bleak narrative, but rather the bleak design philosophy. They favoured crushing the player for feeling wrong, irrespective of a personal moral and ethical compass that already outmanoeuvres the game’s. There’s an important difference between tragic, and emotionally punitive, unfortunately veering into the latter category; we’re devastated not because of Ellie's tragedy, but because we’re punished for wanting her story and not Abby’s.\n\nAt any rate, the purpose of the story is clear from the beginning; they’re valid, and admirable to explore, but it’s approached with a crippling lack of subtlety, making it more of a lecture than an actual, tangible experience. The narrative is designed such that any interpretation is restricted other than what Naughty Dog wants you to feel as opposed to the emotional ambiguity that made the message of the first game so powerful. Consequently, you are forced to align with the developers conclusions over engaging with the narratives moral tension. They wanted to embody the whole notion of “you either die the hero, or live long enough to see yourself become the villain”, but without the subtlety or grace such a complicated narrative decision beckons for. The design philosophy isn’t exploring moral ambiguity, but rather precisely limiting your ability to interpret events independently; it doesn’t ask a question, it answers it, then punishes you for not agreeing fast enough.\n\nIt’s difficult to ignore the sensation that Naughty Dog is only forcing so many of these themes on the player, because many seemingly disregarded, or didn’t understand the weight of the first game's ending. This way, instead of an ‘ambiguous’ decision that Joel made, they forced everyone to understand that decision, and are subsequently forcing everyone to understand the weight of the consequences in this game as opposed to allowing people to lose the point. Importantly, I am merely speculating, but irrespective of my speculation, this notion isn’t entirely unfounded, so whether or not there is some truth to it seems inevitable; it’s simply a matter of how much.\n\nThere’s a lot more to cover, but I feel as though I’ve touched on the main reasons as to why The Last of Us: Part 2 crumbles. These flaws didn’t just dull the experience, they hollowed it. What could have been a meaningful, devastating story of loss and redemption instead became a suffocating lecture, distrustful of the very audience it tried to move. And as someone who adored the original, that’s what makes it all so hard to bear. I wasn’t just disappointed by the direction. I was left questioning whether the story I once loved had ever been understood by the very people who created it.",
      "voted_up": false,
      "votes_helpful": 153
    },
    {
      "review": "The Last of Us Part II is objectively a good game, no matter how you slice it. So why is it getting a thumbs down? Well, that's actually the main argument of this review.\n\nThe biggest shift that Part II did that made it so controversial, was the shift in tone. If Part I was dark enough for a lot of people, Part II broke barriers in what people thought was possible. But that's not my issue with it. It's the storytelling. It's something reminiscent of scrambled eggs. A mistake that at least the TV series is fixing.\n\nThe story is everywhere. It doesn't start at the beginning, it starts somewhere around the middle, then goes back to the past in flashbacks, then goes back and forth again and again. It's so convoluted, and I really can't see a reason why the writers set it up this way. Maybe they thought they were breaking barriers in storytelling - they weren't, in fact it was a mistake to write it this way, because it's simply not compatible with character driven narratives.\n\nPart I in contrast, was a simple, linear, and deeply personal story about dealing with loss and moving past it. Part II, in turn was not even a story - it's just a cautionary tale about the dangers of revenge. The whole game plays like its trying to make a point, and that point is hammered again and again, almost to preaching levels. Part I wasn't trying to make any particular point about violence - it was simply understood by anyone playing, just by being in that world, that this is how things work now. And it does work, because it's simple. It's told through the characters eyes.\n\nPart II, however tries to give you the perspective of two opposing sides, and that's the main flaw in my opinion. It's structured much like a dissertation. It's not about telling a story and making it into an emotional experience, it's about proving a point by examining the evidence. It's about making it as objective, and impersonal as possible.\n\nBut humans don't work that way. Part II dehumanizes the player in that regard, by making us hyper aware of what happens on both sides - a thing that is not possible for the characters. That just takes so much away in my opinion. The whole charm of Part I was developing this bias towards Ellie, which will make you as a player want to protect her no matter what by the end. This bias is what makes us human, and Joel was able to embody that perfectly. But here in Part II, it deconstructs any attachment you have with Ellie in favor of Abby, only to deconstruct it again and leave you with nothing, just to prove a point.\n\nPart II was not supposed to be fun. It was supposed to be an experiment. It was too concerned with being revolutionary, that it forgot to be fun. It tried to break barriers in storytelling, and it ended up being a fiasco. Some people have commended the writers for taking risks with Part II, but players aren't looking for anything revolutionary, they just want to have a good time. That being said, Part I was pretty groundbreaking for a game that \"played safe\".\n\nThe only redeemable aspect of Part II was it's technical achievements. The game is unbelievably gorgeous, unfathomably realistic in it's depictions of everything, specially violence, and a complete leap beyond everything that was achieved with Part I. It just plays amazing. The combat, the exploration, the crafting, the stealth, the visuals, the motion capture, the voice acting, the soundtrack... it is simply a masterclass in every technical aspect.\n\nHowever, unfortunately, that only serves to further exacerbate all the problems with the narrative. While its carcass shines in utter brilliance, it's rotten core is exposed and left to burn in the sun.",
      "voted_up": false,
      "votes_helpful": 808
    },
    {
      "review": "***CURRENT THOUGHTS***\n\nThe game is great, and an awesome follow up to the original game, looks incredible and hits with the feels so much, as well as the combat being much better. \n\nI know the game is divisive to many people. You either love it or hate it. I'm one of those that love it, and now that the game is playing much better I can sit back and really enjoy the game without having to dust off the Playstation.\n\nWhen the game plays correctly, it is fantastic and I would highly recommend, but if you are having issues, or concerned you will have issues, then do hold off on buying it until you feel confident it will work.\n\n\n***EDIT***\n\nSo, since patch 1.1 came out the game has become mostly playable. The stutters are still there, but they don't last as long. However! Thanks to the comment left by aumari I tried out turning off Ransomware Protection in Malwarebytes, and it actually fixed the game completely for me. No stutters at all, and with 60fps cap and V-sync on, my CPU usage sits at a nice 50%-60% usage the whole time on high settings.\n\n-----------------------------------------------\n\n***ORIGINAL REVIEW***\n\nThe game is well optimised and plays great, when it isn't compiling shaders every few minutes.\n\nI got from easily playing the game on high settings 4k at 80 fps, to a dead stall in seconds, because they have decided to have the shaders compile during gameplay as new areas load in. Sometimes the game will stall at 0 fps for a split second, other times it stalls for almost 10 seconds, and this can happen during combat, which is a quick way to a game over.\n\nUntil they fix this, or you have a very top of the line CPU, I cannot recommend buying the game, which is a shame, as other than the shader issue, the game plays and runs great. Hopefully a patch will come available soon to allow people to select how they want the shaders to be handled. I personally am happy to wait in the main menu for a few minutes to experience a smoother experience.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "[h2]Crashes all the time and Controller Issues[/h2]\n[h3]Not having a great time...[/h3]\nWhile this release is certainly better than Part I, the game still suffers from a few issues here and there. \n\nFirst, I would like to praise the performance — the game is incredibly well optimized. It runs on my PC at 90 FPS on high settings just fine. The previous game can barely run on medium, so it's amazing that this game runs as well as it does. The devs did an amazing job.\n\nThat said, my game has been crashing CONSTANTLY. The second I stepped into the first open-world city, it became nearly impossible to progress because the game would just crash at random. There were no patterns to these crashes as far as I can tell. Trying to craft an item? Crash. Trying to upgrade your skill tree? Crash. Standing idle for too long? CRASH. I swear, I am NOT kidding. It made progressing a pain in the butt because I kept losing a lot of progress because of this. I know for a fact it isn't a performance issue because the game runs buttery smooth, there are no lag spikes or anything — so I don't know why this keeps happening.\n\nAnother issue I'm having is with my controller. I use a PS5 (DualSense) controller, and I've noticed that the longer I play, the more input delay starts to build up — to the point where my movements take a solid 2–3 seconds to register. I have never experienced this in another video game before. Trying to disconnect or restart the controller to fix the issue causes the game to stop recognizing it altogether, forcing me to restart the game every time.\n\nAssuming these issues get fixed, I'll gladly update my review, but this is seriously ruining my experience, i'm not having a good time.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "Game is great in terms of quality but this fucking story pisses me off wayyyyyyy more than it should, like who the fuck cares about Abby like bruh I just wanna put 50 bullets in her brain man. Are you skunked? Are you flipping skunked? Like why tf do I care 'bout some bald Aang from Avatar: The Last Airbender looking mf?  Like bruh.. I don't give a fk 'bout no love triangle between this muscular ass Greta Thunberg looking stumpy ass midget mf I just wanna put a shotgun in her mouth and blow her head away blud. Like what? She killed one of the most beloved characters of all time and Naughty Dog went \"Yeah let's focus half the game on her story\" probably smoking crack. Smh...\n\nhttps://www.youtube.com/watch?v=ZphfTOVoQe4",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "Ran out of VRAM trying to run this crap and it crashed to desktop. Never ran into this bullshit in any other game. It's just lazy porting from the developer.\n\nNot on the newest generation of GPUs (3080), but it should be plenty to run run this, since almost any other AAA title runs on max settings flawlessly.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Maybe a quarter into the game. I usually wouldn't post a review until completing it, but in this case, the issue is with the technical state of the game rather than the content. It crashes constantly. Like every 2-3 hours. Full crash to desktop, all progress lost (fortunately the checkpoints are extremely forgiving). If they ever fix it, I'll come back and revise this review. So far the content is good, but the game is not in a playable state.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "Went into this almost completely blind after recently finishing part I. \nI'll try keep it spoiler free, but there may be a few minor ones.\nLets start with the positives:\n- Gameplay is definitely enhanced since part 1. It's still simple, but well executed. Newer game and newer mechanics. The gameplay is enjoyable.\n- It looks good. This game is very pretty and captures the atmosphere of a post apocalyptic environment very well.\n- Weapon upgrades and customisation is pretty neat\n\nThe negative: \n- The story is a scrambled mess. Taking place several years after the first game, you spend the first half of the game playing Ellie, who in this game has the personality of a cardboard box with little to no actual character development. She's one dimensional and boring, she doesn't have many friends. Her reason for rampage seems more like an excuse to vent than anything else. She makes bad decision after bad decision as you control her. \nThe second half sees you playing as Abby. Abbys story is actually pretty well done considering. Although we may not agree with everything she has done, through her eyes we see that she does regret her actions and she has a somewhat decent arc. However, her story should be an option, and we shouldn't be forced to play as her for 10-12 hours. \n- The significant event that occurs a couple of hours in is stupid. I don't care that they did it or that it happened, but how it happened is bad. Even if the character had \"grown soft\", it's still a post apocalyptic wasteland. Even a \"soft\" person isn't going to trust a random small group armed militia - especially after having  lived a similar life in the past. \n- The game is too long. Long games are fine, but this dragged. As the stories converge between Abby and Ellie, we expect a big climax, but there wasn't one - then the game continues for another couple of hours, but there is no climax, and we are given no time to process the events that occurred. As as previously mentioned, when we do get back there, it falls flat anyway. \n- Ellie demonises Joel for taking her from the Fireflies hospital - she despises him because it wasn't his decision to make. However, the great moral quandary at the end of the first game is totally glossed over - there's barely any mention of the fact that the Fireflies were doing the exact same thing. They did Joel dirty by completely glossing over this. \n\nIf you're expecting a deep story driven game, this isn't it. Such a disappointment after how well the story in the first game was executed.\nI was left with an utter sense of bewilderment by the end - having felt like I wasted my time and money on an unpolished story with no real substance. If I could, I'd get my money back.\n\nEdit: To the people who think \"I didn't get it\" - I did. I understood the story and the developers intent, and it still sucks. Playing this game is probably my biggest gaming related regret.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "Will be talking mainly about story, blacking out major spoilers but I will be leaving it open for spoiler talk a lot here for my final review, now that I've finally got to play it. FYI, TLOU is my All time favourite game and I don't see anything ever topping it. \r\n\r\n[h3]I didn't like it...[/h3]\r\nI came into the game with a negative view but, to put it simply, Yes, I didn't like the second part of the game and my perception fell off a cliff having to play with this group of dumb terrorists. I think I had the game at 5/10 halfway and that's including the start of Abby scenes. I was getting a good laugh at the stadium and the pregnant lady there at the WLF is ... truly inspirational. If I was forced to have more scenes around the heavily pregant chick I would develop a brain eating fungus irl too. I'll leave it at that.\r\n\r\nThere were a lot of points critiquing the game and I think everyone was valid, and people praising the game can praise it too. But, I believe the Director of this game and team that made it, appluaded themselves and gave themselves the awards for multiple game of the years like they had made the Godfather of video games. When they didn't even make Godfather part 3 in my opinion. The whole part with Abby drained me, annoyed me and infuriated me to the point where I was thinking about skipping the cutscenes on my first playthrough. In TLOU (OG) I've played it almost 10 times and only skipped the cutscenes once in my playthrough just before part II came out, just to knock out the acheivments. I began skipping the lore letter pickups and rushed to get the game finished here, but the game just forced you to walk so many times it pained me. Also I think there should be a tag here for 'Visual Novel' too because the cutscenes got excessive with Abby. And also helping everyone up when they fall and tying their shoelaces and saying, [i]'Hey are you Okay?'[/i] over and over again.   \r\n\r\nPlaying with the enemy faction confirmed to me a theory in the first game [spoiler]that if all went to plan and they did the surgery in the first game,[/spoiler] the fireflies would be the p.o.s that they are and use it to seperate themselves from people, use the cure for evil. That's evident in how they act and even they can't stand each other and complain, and torture people daily. \r\n\r\nThere are moments when the bad guys just straight up play puppy dog eyes and then say and do the most evil thing in the game (even more sic than the start of the game), like, \"and he deserved it.\" Right after saying, \"I still have nightmares about that day.\" These people are truly sick and are played to be the nicest and sweetest people. I have to go and get an eye check up soon to reset my eyes because of how many times I rolled them into the back of my head.\r\n\r\nSo, about that scene. It didn't really bother me. [spoiler]Joel is an old man and he's lived his life.[/spoiler] Another thing was, [spoiler]walking into an ambush,[/spoiler] there were three instances that I could believe there in that sequence of events, but I can't agree with [spoiler]ratting out your whole base of Jackson to a group of heavily armed people you don't know while you're on your daily task of clearing out and taking note of infected and anyone coming near the heavily guarded town of Jackson.[/spoiler] It honestly gave me a little bit of a chuckle at how dumb that little bit was.\r\n\r\nThere is enough playtime with Joel and Ellie together here and in their own flashbacks that exceeds the playtime of the Left Behind DLC so that's good. And some I never saw and really, really enjoyed some conversations and playthrough with Joel and Ellie.\r\n\r\n[spoiler]I think it would've hit harder if Ellie Killed Abby in the end. But, they obviously had a future plan.[/spoiler]\r\n\r\nI didn't agree at first with people saying that there were too many cuts(flashbacks) until I played it and did find a problem with it. It's not confusing, I do however think the game is, confused, in a sense. [spoiler]It would definitely hit way harder and people would like Abby more if there was no cut after the Seraphite capture, to the hanging, and escape scene with the two kids, you could say I hated that choice and[/spoiler] it took the wind out of me to not get to continue playing through that section without a distraction in between.\r\n\r\n[spoiler]Don't get the placement of the dance scene, having it at the end and not at the beginning. It had no real substance there.[/spoiler] It was one of the first bit of footage shown off from the game(the shot of the lights above Ellie's head), [spoiler]you'd have to cut/show that scene again with the part of Ellie yelling at Joel.[/spoiler] But, it really fits at the start of the game.\r\n\r\n[u]FINAL NOTE:[/u]\r\nI feel like the whole second half of the game with Abby is all completely pointless. You'd have more substance if Ellie was shown wiping her asss than any of the scenes with Abby. Or the scene at the start with Ellie sniffing her armpits, there is more depth and character and lore accurate and story in that action alone than anything Abby and her Wolf friends ever had in the whole game, and they really tried",
      "voted_up": false,
      "votes_helpful": 88
    },
    {
      "review": "Beautiful game, the execution is immaculate, but I have never seen a story fumbled so hard in my LIFE. I genuinely feel like I've wasted my time. A horrible and completely unsatisfying conclusion.",
      "voted_up": false,
      "votes_helpful": 92
    },
    {
      "review": "Hello ! (I'm French so forgive me if i make any mistake while writing)\n\nI played this game for the first time in 2022, on PS4, i finished the game on multiple difficulties and played it multiples times. I played it again this year on PC, once and i thought \"I'm never playing that game again\".\n\nI had played Part 1 one year before in 2021 and it instantly became one of my favorite solo - story driven  games of all time. \n\nWhen i made my review of TLOU Part 1 i think i gave it 11/10 for story and 7/10 for gameplay.\n- Great Side Characters (and main characters)\n- Visually stunning \n- Innovative in a genre stacked with campetition (dying light, left 4 dead, zombie island...)\n- Good, reactive and fluid Gameplay \n- Great enemy AI\n- Insanely well written story\n\nNow if i had to talk about TLOU Part 2 : \n- Characters : what a disappointment, the game doesn't feel like it wants you to care for Jackson, its people, or Ellie's friend. You will spend much more time learning about people you don't care about. \n\nThen Ellie (The main character, the person i actually want to know the story of)  gets like 50% of screen time, then we get 15% of flashback that are basically a continuation of the first game. And finally, we get 35% of mental torture that will make you want to throw your computer through the window.\n\nIn the first game we get Bill, Henry and Sam, Marlene, David, Tommy, Joel and Tess ! Memorable characters.\nIn my opinion, TLOU Part 2 has 5 memorable characters at best none of them being Ellie or Abbie.\n\n- Gameplay : TLOU Part 2 blew me away when it came to gameplay though, truly amazing and satisfying. \nIt expends on what Part 1 did and makes it 100 times better. \nOn top of that there were also some crazy sections which are very well orchestrated and paced in my opinion (action / horror / peace / mesmerizing). \nThe encounters and fights are also well designed and are a pleasure to do.\n\n- The Story : Another disappointment\nPeople spare each other for no reason. \nPeople say their name to complete strangers and make stupid decisions then show insane survival instincts and skills. \nThe whole game happens because of a sequences of events that you couldn't convince a conspirationist, are true.\nThe story is a big circle, at the end of the game you realize that none of what you did mattered and you didn't have a chance to do anything about it from the start (not satisfying). \nAll that loss and anger bs didn't work for me, honestly, only three deaths really had any kind of impact on me, i didn't feel sad for the characters and i didn't get emotionally moved like in the first game.\nSometimes boring. \nYou don't play Ellie when it could matter the most and the game takes position. Sadly,  if you like the direction the game takes you towards. You end up like me, betrayed and disappointed.\n\nThe flashbacks (not all of them) are an exception though, in my opinion some flashbacks were even better than the game itself.\n\nTo sum up, i'd say TLOU Part 1 is all about Depth and even if it has a less beautiful form. After doing it again on PS4 a week ago i'd give it 11/10 for Story / 11/10 for Characters and 6/10 for Gameplay :\nI'd give it an overall note of 10/10\n\nTlou Part 2 is all about form, the music is nice, it looks good, the gameplay is incredible, but it didn't feel like Tlou to me. It lacked the Depth that i was waiting for. It is a good game but i don't think it is a great TLOU game. I'd give it 4/10 for Story, 2/10 for Characters and 11/10 for gameplay: \nI'd give it an overall note of 6/10\n\nLooking back at what they could have done, i would have preferred a game focused around Ellie's story, a younger or even older version of her. Because, the game felt like it was mostly about Joel and Abbie.\nOr i would have preferred a unique story about new people that would almost totally get \"rid\" of the old characters. \n\n\nI would recommend the game if it wasn't called \"The Last Of Us\" \nThank You !",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "great gameplay but genuinely one of the worst sequels to a game ive ever seen.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "Good Gameplay, Bad Writing and Pacing Varies throughout the game. Ending left me unsatisfied. I do enjoy the visuals and rogue like mode, Overall feels like a waste of Legacy Characters.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "This game was amazing until being forced to play as the killer of one of the most beloved characters in video game history for the second half of the game.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "This game is f****** hot a**. I wasn't crazy about the first, gave it an 8/10, but this is a 3/10 and I'm being generous. The only good thing about this game is the graphics. Game play? Boring and extremely repetitive. Story? Even worse. Whoever wrote this game should be thrown to the zombies themselves. There's so much negative stuff to say about this game it's ridiculous and I don't know where to start, so I won't. Do not give them your $. Play The Walking Dead Telltale Series game for an amazing zombie campaign. F*** Naughty Dog.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "graphics 10/10\r\ngameplay also 10/10\r\n\r\nthe story... the story is trash. glad i waited so long to play it and paid quite little. Im so dissappointed that i played the whole thing. Last Naughty Dog game i buy",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "If you really like the story of the Last of Us Part One, then trust me, the story is better off as you enjoyed it without you touching Part Two. \r\nCombat, gameplay etc is great, it's a good game, I'm giving it a negative review purely for the direction they took the story. \r\n\r\nFor the first 7 hours of the game virtually nothing happens and it's honestly just a slug-fest to get to the next story part. Then, I was surprised with how much of a positive turn the story took for the next 5-6 hours with Abby, it was really good. \r\nHowever, there's *that* part in the story that turned me away and lost all buy in, nothing mattered after that because the story genuinely didn't make sense. I played through the last 3-4 hours genuinely not caring how it ended, just trying to finish the game. \r\nI don't know why that story direction choice was made, but if you've played the game you know exactly what moment I'm talking about and it is the most amount of buy-in I've ever lost in a single scene of anything ever. \r\n\r\nThe game is good, but if you're here to continue the amazing story of Part One, just don't.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The first half? quarter? was amazing. The story beats were hitting hard (so to speak). I was being set up for something huge...and it all went downhill. TLOU was marketed as an emotionally gripping story that doesn't shy away from the violence and pain of the worst and most desperate of the human experience. I was indeed emotionally gripped, then crushed, and instead of healing, I was cast aside in favor of cheap thrills, gimmicky writing, and overly-mechanical gameplay for it's own sake. It seems half of Naughty Dog wanted to continue the cinematic drama of the first TLOU (evident in the chronological sequences), and the other half wanted to make Metal Gear Solid with zombies.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game requires hitting keys really fast for stupid things like turning on a generator. Fun for a five year old, not for a disabled adult.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "tried everything on ASUS ally x but it crashes, also tries on a pc and even though i have latest firmware 25.x.x.x it keeps reading 23.x.x.x and crashes and asks to update to 25.x.x.x",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the story, and gameplay is amazing truly a great game, but nearly 1 year into the games launch i experience many crashes. I have a pretty decent computer and it handles most every game just fine, but it still crashes every 30 minutes without fail with settings on medium to low. if you have a tank of a pc play it for sure. I waited nearly 10 months to see if there would be optimization patches but i'm still having the same issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]A Great Game But It Is Not The Last of Us[/h1]\n\nIs it a fun \" Gaming \" experience ? = Absolutely !\n\nIs it a fun \" The Last of Us \" experience ? = Nope.\n\nThe Last of Us Part II is a wasted masterpiece. The graphics, the cinematography, the acting, the animations, the gameplay, the world building is just pure perfection. It's a generational game that could have became one of the greatest games of all time. If it wasn't for main things that made the first game special but were thrown out of the window with this one, the purpose and the story of the game.\n\nThe Last of Us Part I was a truly special experience thanks to it's Narrative that was heavily carried but the emotional relatable truly remarkable survival journey of Joel and Ellie. Instead of carrying on with that relationship and improving upon it, just like with Kratos and Atreus in God of War or Amicia and Hugo in A Plague Tale, they decided to completely ignore it and make it a so NOT \" The Last of Us \" experience with an average overused story.\n\nSummarizing: The Last of Us Part II is a sequel that ignored the main thing that made it's predecessor a special game. The Joel and Ellie relationship. It could've been a masterpiece considering all the technical features that this game achieved, but it chose not to by ruining the story.\n\n[h3]Overall: 7.5/10[/h3]\n*The technical features carried so hard.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "20:56:30:454 (00003612) > [NxApp] Windows version detection mismatch: 6.2 build 9200.7171 (detected); 10.0 build 26200.7171 (registry)\n\nWindows 6.2 is Windows 8 Pro, how it can be detected on Windows 11 Pro 25H2 machine? An obvious bug in released version of the game,  I will pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most annoying and frustrating single player game i've ever experienced, trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i installed it back to replay it, turns out the game goes unresponsive and doesn't let you play the game had my pc go unresponsive for 30 min, sony have the money but can't fix a port. honestly sony isn't made for pc, why bother porting it to pc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game states that it is an open world game, nothing can be further from the truth, you have one path and only one path to follow you can not deviate you can not make you own decisions, all of these things that are supposed to be in truly open world games,  and on the new game plus even though you know where the traps and bottlenecks exist you cannot avoid them because as i have stated earlier, there is only 1 path for moving forward, so even if you know the next action will get you blown up, you have no choice but to let it blow you up, or if there is a choke point that you know you will be attacked you cannot avoid or plan your way around it.  So the last thing I would call this game is open world,  the end is predetermined, and there is nothing you can do to cause a different ending.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Last of Us Part II REM PC – Impressions\r\n\r\nFine game. Fine, not great. Delivering some – some – and mezzo mezzo.\r\nFine gameplay, nice visual fidelity (character animation, environments), and an immersive world feel. Yet there is no wow and no boom effect — just mellow, vanilla.\r\n\r\nUnfortunately, there are way too many cinematics: long cutscenes dominate the game. Half-cutscenes, story cutscenes, action cutscenes, platform cutscenes, scenery cutscenes — and on and on the list goes. Sometimes requiring up to 3–4 skips at one time during major level-to-level or chapter-to-chapter follow-up sequences. A diabolical experience.\r\n\r\nSome of them even feel unskippable and are seriously frustrating. It literally feels like the game is more about watching a storyline cinematic — or skipping through one — than actually playing the game.\r\nIf I wanted to just watch a story, I’d pick an interesting movie and grab a fidget poppet while watching — the effect would be about the same.\r\n\r\nGameplay\r\n\r\nMechanics are good: solid traversals, no major frame dips, decent synchronization times, low stutter, and an efficient shader-compilation methodology and design. Sadly, all of that is constantly overshadowed by the endless cinematics — to the point I had to force myself to keep playing this spongy game just to justify the money I spent after ten hours in.\r\n\r\nPerformance\r\n\r\nCPU is heavy-ish during cinematic work; GPU optimization is okay. Controller support holds up to specs.\r\nNothing ground-breaking, nothing catastrophic — just fine. No major issues with AMD end-to-end Ryzen 7 8/16 CPU and 9000-series XT graphics combo.\r\n\r\nSettings & Graphics\r\n\r\nSettings menu is functional, and the overall framework and gameplay pipeline feel positive despite some random minor pixel corruption in certain areas.\r\nOtherwise, visuals are acceptable. Gameplay and game autonomics are around 6 / 10, if you’re into games that practically run on none to half-autopilot with no real sense of navigation, no real compass — since that feature seems minimal to nonexistent in this title. Part of open world.\r\n\r\nOverall\r\n\r\nThe game is mechanically solid, but the overwhelming number of long cinematics and sporadic performance issues make the experience frustrating — or rather, they kill the vibe entirely.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is extremely WOKE; the women are much more muscular than the men. Everyone makes a big deal about being gay, and there's a girl who identifies as a boy.\r\n\r\nVideo games should be about stories, not political agendas!\r\n\r\nThis is a definite Not Recommended game for me.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The Last of Us 2 attempts to say alot of things, and fails to say much at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's more last of us! If you liked the first's gameplay it still holds up, though a couple hours in not seeing anything new other than some more open levels. Optimization is unplayably bad. Even on the lowest settings, which do not look like they should be taxing, rendering slows to a slideshow, making combat impossible, desynching cutscene audio, and otherwise ruining the experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sixteen hours in and they lost me on the story. All they had to do was follow the formula of part one.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The direction, the visuals, the animations and gameplay are awesome. But the scenario... And because there are no choices to make, I felt stuck with it till the end. And it's very woke which to me, is not pleasant.\r\n\r\nBecause number 1 was such a masterpiece, this sequel in my view is simply not worth the name.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely great “sit-back-and-relax” game with stunning graphics. However, several elements make it less engaging compared to the first game. The inclusion of LGBT themes felt forced to some, the story follows a typical dramatic revenge arc, and the killing of the main character, Joel, whom we empathized with, significantly diminishes the emotional impact.\r\n\r\nJoel’s death in particular is preposterous. In the first game, he was portrayed as extremely intelligent, cautious, and not easily fooled. Yet in the second game, he recklessly reveals his name to a stranger he saved just 20 minutes earlier—without any hesitation or concern—only to be killed by that same stranger. This undermines his character and caused to lose interest in the story.\r\n\r\nAdditionally, the fact that Ellie and Tommy survive makes the revenge-driven storyline predictable, further reducing suspense and emotional stakes. Overall, while the game excels in visuals and gameplay mechanics, its narrative choices make it less compelling than its predecessor.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you haven't played this game and are on the fence about it, I'd maybe hold off and see if they patch it a bit. It seems to run great and has been out for a while, but there are some bugs that make the experience very frustrating.\r\n\r\nFirst off, I played Last of Us Part 1 and thought it was a masterpiece. It was one of the most emotional story telling experiences I've encountered. Just through and through, an incredible experience. This game seems to be shaping up the same, but every time I play it I end up in a bad mood. I decided to find out why and analyze the game more critically.\r\n\r\nThe chief problem with the game is Deena. She sucks. She is nearly useless in combat but her backstory is of this hard survivor. This is not too surprising since she is the product of the developers who led to the birth of the phrase \"ludonarrative dissonance.\" She's also ALWAYS getting in the way. She's like a cat. If you've ever lived in a house with stairs and have a cat, you know how dangerous having a creature whose always underfoot can be. And Deena IS ALWAYS UNDERFOOT! She's never more than like 5 feet from you in combat, which relies very heavily on stealth and cover, and will actively push you out of cover with her big old butt and get you discovered. \r\n\r\nI hate her. You can't kill her, I've tried. Not even booby traps will kill her. Plus she talks all the time. Joel and Ellie definitely talked in the first game, but it was far more seldom than in this game. But Joel and Ellie had chemistry. Deena and Ellie do not have quite as much, I guess a little is there, but nothing like Joel and Ellie.\r\n\r\nAnother huge issue with this game is manual saves seem to be broken in a lot of areas. Some work just fine, but in others, loading from a manual save will just restart the encounter from the last auto save spot. That can lose you around 20 minutes in the worst case, since thankfuly autosaves happen quite a lot. But it's the larger areas that seem hit with this bug. This makes me want to play longer than I sometimes want, just to make sure I hit an autosave spot.\r\n\r\nSo both of these things contribute to why I find this game puts me in a bad mood. Deena can ruin a stealthy approach in a game where the rambo approach is highly discouraged, she talks too much, and the manual save bug makes me play past the point where I'm ready to quit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Let's make a super linear game.\nLet's make it also very repetitive.\nLet's summon 20 soldiers round after round with our great combat system.\n\nLucky I didn't pay for that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is like a piece of chocolate flavored poop, it tastes very sweet and delicious, but in essence, it's still a piece of poop.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just bought a game to skip cinematics after cinematics! Amazing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not bad, but the gameplay is  really simplistic and story segments are kind of boring. Overall feels really generic, TLOU2  really wants to be like one of big budget tv series but lacks any   personality  beyond that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game, but I didnt know they make gay out of Ellie, what a shame really, I would like to give 1 start out of 5, if I find the button\nnot recommended, and for sure I will not gonna get (buy) the next one to support such Ideas if they ever make last of us 3, how come a normal person like me should like such games, please tag them for gays and lesbians",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I AM NEIDOLF DRUCKLER. COMMANDER OF THE THIRD REMASTER. LITTLE KNOWN FACT, ALSO DOPE ON ZE MIC",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just play Part 1 and pretend this one does not exists, story line is worst then part 1, to much \"woke\" agenda in your face in this one",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "a literal spit in the face of the first game. it blows",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is so broken that can not be finished due to game breaking bug on the the confrontation chapter. Reloading the save or the chapter does not do anything, simply the game is not optimized to run on steam/windows.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "take the last of us 1 add every woke shit out there boom you just got the last of us 2",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Abby and lesbians ruin the game...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's Gameplay is okay, the story is meh 4/10.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "CRASHES CRASHES CRASHES THATS ALL THIS FUCKING GAME DOES",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}