{
  "positive": [
    {
      "review": "A diamond in the rough that unfortunately requires a lot of work to turn into a real gem.\r\n\r\nA disclaimer: I have been having fun in flight simulators since Flight Unlimited 2, I am that old. My first XPlane was version 6 and the first time I saw Microsoft Flight SImulator II was as a kid on Atari and quite frankly I never cared much for it.\r\n\r\nThere are many issues with this sim. The user interface is abysmal, menu controls are the worst I have ever seen and the flight dynamics and systems depiction of most of the planes that come with the sim is very lacking (ironically one of the best planes in the sim is the default Cessna 172, but I think the devs can recite the POH of that plane in their sleep). \r\n\r\nATC is... well, it's so bad that I just turned it off. I fly on PilotEdge, VATSIM and SayIntentions, but even Flight Unlimited 2 had a much more superior ATC system and that was more than 20 years ago. Setting controls is a chore and only after a thousand hours in I am starting to grasp the insanity of the mind behind it. Career mode, while it's something I very much hoped for, is feature-wise below the standards of any already existing career addons, like the old FSEconom. The only thing that is positive about it is the integration of aircraft state into the career module - if you land rough, you will eventually see it in the mechanic report.\r\n\r\nI will not judge the actual physics. Not even real pilots are really qualified to do that, so take all youtube vids of real and phony pilots saying that this is that has 100% realistic handling with a huge grain of salt. To me, it's realistic enough. Most of the flight envelope is depicted really well and the rest is in the hands of aircraft developers.\r\n\r\nHowever, once you spend time (and money) on getting a few essentials down, this is an absolute work of art. I would say that behind all the undercooked and broken stuff there is a labour of love from people who have flying airplanes in their hearts. But you will need to:\r\n\r\n- forget about any version above the Standard one. I own premium deluxe. Not worth the money.\r\n- invest in a couple of top quality planes from top developers. A2A, Black Square, PDMG, Fenix, Taog just to name a few.\r\n- Personally I cannot feel any immersion from flying on a pad or on keyboard. Even a simple joystick with analog throttle and perhaps a twist stick will make it good.\r\n- Find an ATC system of your liking if you feel like you need one. I can't fly without it because it adds that bit of pilot workload that just makes it interesting.\r\n- Try to use one of the addon career modules. Some are free, some are paid. The bottom line is to have a reason to fly from one place to another, perhaps with some persistence. I am a member of Walker Air Transport which provides me a lot of ready routes and inspirations.\r\n- Learn about how all this works in real life, otherwise the utility of floating an arcade plane over bing maps will cease to be a novelty rather soon.\r\n- There are a lot of quality of life improvements on addon websites too.\r\n\r\nIf it sounds like a lot of work, then yes, but it's an investment that is paying off, at least for me. I fly both MSFS 2024 and Xplane 12 on a regular basis, spent more money on virtual planes and control systems than I care to admit. But boy, do I have stories to tell, like the time I crossed over Mongolia in a DC-3 Dakota on a round-the-world trip over the Himalajas... or made an ILS approach to Cracow airport in an absolutely abysmal zero visibility conditions in a conga line of other virtual planes on VATSIM... or just took off in a small biplane and flew over Yosemite... or cruised at FL400 in a fast business jet... or crossed the Atlantic in planes that were barely designed to do so...",
      "voted_up": true,
      "votes_helpful": 70
    },
    {
      "review": "My first time with a flight sim, and I find it interesting. I have only played career so far.\nI'm happy i read reviews before paying a rather steep price for the game, because the complaints about bugs are true, and you need to acquiesce this until the developers get all these issues sorted.\nA full year after release, and you still have a game in this current state:\n-Game crashes to windows rather often\n-You can get punished in a mission for action you have not done, before you even touch the controls.\n-Bugs with the flight navigation log.\n-etc.\n\nYou can learn a good amount about avation, but dont expect it to be extremely comprehensive in terms of the teaching.\nBe prepared to search and study materials yourself outside the game, and then try out stuff in the simulator.\nFor example how to use the navigation systems in the planes, traffic patterns, etc.\n\nThe pace of the game feels like a grind too slow for my liking. It takes too much effort to earn credit in order to progress the game.\nYet, I still keep playing because i keep learning new things almost for each gamesession.\n\nOverall I recommend the game, using a PS4 controller. \nI have learned things about aviation i never heard off, and I feel that you can actually save a serious amount of money in real pilot training, if you have a desire to acquire a real pilots license, due to the familiarity you get with aviation via this game.\n\nThe graphics looks nice (above altitude 1.000ft), \nyou can disable the assists for the full experience, \nand you can interact with nearly all of the buttons in the cockpit, if you choose to handle the vehicles fully by yourself.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "So, after almost 200 hours, and about 300 in 2020, here's a positive review.\n\nThis has to be one of the most immersive experiences on a flight sim yet. Yeah it has sum things that are kind of buggy, but nothing that really breaks the game for good. I have enjoyed the career mode too much, it needs a lot of strategy and it's full of surprises, like when you're flying a med-evac and you need to land early wherever is nearest because the patient is having issues.\n\nI'va been playing Flight Simulator since FS 95, played every single one of them, and each experience has been better in some ways than the last.\n\nI honestly don't think this simulator deserves mixed reviews, maybe not extremly positive, but for sure is better than mixed. You can do whatever you want, fly wherever you want, it supports modding, aircrafts are cheap or free, it's constantly being updated.\n\nMicrosoft and ASOBO did a good job on this and I always hope for more and always get more.\n\nWith it's issues, I love this simulator.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The game has the WHOLE world in it. It is very relaxing and I recommend playing it. The only down side is IT NEEDS A HELL OF A PC TO RUN THE GAME :/",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "On release the game was riddled with bugs, it has however gotten better over time. The visuals are certainly stunning and the physics are an improvement from 2020. Nevertheless I do still experience bugs from time to time, so for stability (and add-on support) I'd probably stick with 2020.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "the game still has glitches but is amazing and worth the price",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I put off buying this game for a year because all I saw about it was negativity - I wish I hadn't. It runs buttery smooth on my Ryzen 5950x & RTX 3070 with the much enhanced frame generation, and feels like a significant upgrade in so many ways. I've encountered a small bug here and there but nothing game breaking or even vaguely annoying. I've been playing Flight Sim since '95 and this one blows my mind with the detail and realism. Recommended!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has to be the greatest simulators I've ever got to play and learn from. This game presents a great way to learn, explore, and test how well you can pilot any aircraft you've wanted to fly. I love flying and being able to fly over my hometown or any other place around the whole world makes this the best game to  experience all of those things. Hope to catch you in the skies",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There do have bugs, but you can still have a lot of fun as a serious leisure.\r\n\r\nI'm new to flight sim, and this makes me think it totally worth $70 for a really rare experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a 66 year old (still young) I still had the first MFS and played it for years with my Saitek X52 and the planes was very forgiving but after this upgrade there is no comparison as it is very realistic and I failed a few times, but learning my new Honeycomb Alfa and Bravo controls was so much more to smooth the process that I spend daily just learning something new....big shoutout to those youtube and FB fans for making it easy for us to learn!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is getting better after SU4.  Notably in a 4060 laptop. I think the game needs to first, provide more stable environment, and fix all the base game planes. It is quite disappointing that at this point those plane are not working probably like in 2020. Release livery template for players! Keep up with the good work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really nice, realistic sim, just watch out for the price tag",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its... alright. That's genuinely the most enthusiastic word I can find. The reason why I chose 'Yes' and not 'No' is just down to some minor convenience things rather than anything else. The main benefit compared to 2020 is, it loads quicker. You can go from Desktop to Cockpit in just a minutes or two, instead of some of the lengthy load times in 2020. I get a few more frames than in 2020 and that's where it ends. Everything else, just like 2020, and I will actually day, the default generic landscape actually seems a bit more dull and boring, I actually preferred the way it looked in 2020. So, if you want a few more frames and a quicker load time, go for it, but don't expect anything drastically different or new.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game, very very good graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Couldn't play this game initially at launch but just had to change my thermal paste and upgrade my CPU cooler and wait a few months for them to fix the bugs and I would say it's performing well. Can easily play at 1440p with clouds on ultra.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As of late November 2025, I can finally write a positive review. On release it definitely felt like a step down from the 2020 release, but with SU4 night lighting and the abilty to locally download files, it now runs very nicely on ultra with 2x frame gen on my 4090. Need to add that I mostly fly realistic routes with addon aircraft, coming from P3D V5 and simultaneously flying XP12, can't comment on career mode. UI is still really confusing, weather system leaves a lot to be desired, but visually it's definitely the most stunning flight sim available today.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun game to play. The graphics and details are amaizing. That being said, this is a was a half-cooked game, in my opinion. My game still crashes when I try to do any weather missions, and sometimes when you land in airports you \"crash\" when the taxi routes stick you between two buildings, and before you ask... you can't deviate... you'd be \"taxiing off of the runway\". If you can see past some of these small errors, you'll have a blast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun to play. Just wish that the leveling up process was faster or unlock certain missions when you pass the certification for the style of plane that you are wanting to fly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game and the graphic is absolutly fantastic, and now they have made works for you that is so much better when you got a perpus in the game. I use the for serius flying, and use the Digital Combat Simulation where that game is more a game where the Flight Simulation is more serius game So if you like flying and who doesn't have both game and you will have a day when it is raning and you can't do any thing outside.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, challenging and very imersive. Can be for a newbie to flight sims and of course for the seasoned flight simmer. The new career mode and exterier modes are great add ons.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazingly realistic, challenging, fun, and engaging! I started with MSFS 2020, but have now switched to MSFS 2024 full-time. I really enjoy the career mode, as it's fun to just pick a mission and hop right into a flight without thinking too much about where I want to fly. I do wish we had an official version of the D77-TC Pelican for 2024 like we had in 2020--that's the funnest thing to fly. I'm glad that Asobo keeps improving MSFS 2024. Despite its rough launch, it has stabilized greatly, and this is the game I play the most.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best simiulator game for airplanes choppers and more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Suggest buying the game. Its so much fun than the older version of msfs \"Didn't experience some bugs in the game\" I reccomend purchasing the game. Im waiting to see the latest uptades and futures that are coming to the game... Of all the futures and the planes my rating is [9/10]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Simualtor Ever. Highly recommended for everyone to enjoy and experience the best of the virtual flight. Your imagination is the limit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much it is: fun, has tons of content, and is my favorite game:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a LOT prettier than 2020 but there are some big buts!  1.  It takes perhaps 5 minutes to load - more like 10 to get to an actual flight - I have the fastest m2 drive-  this is too long considering point 2..  2. For me, VR crashes the game back to desktop unless I order things specifically.  I start a flight, then escape to settings, turn on my vr headset and base stations, then switch to VR within the game.  3.  I've been unable to mouse click on controls in VR.  It highlights the switches as I run the mouse over them but it won't let me operate them - infuriating and I can't fix it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am new the MSFS and joined with 2024 so I don't have history, but for my uses (pre-IFR training) it is absolutely incredible. I fly a DA40-180 so the COWS version (paid) is a work of art and matches the plane I fly to the most incredible details including the random rattle noises at lower RPM. I have a old but higher end computer and it handles it very well so I can't complain. I decided to start career and it's a bit funny and repetitive, but does keep you coming back to fly more missions. Would recommend for someone like me that wants to use it for training.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the on going updates. They does sometimes extend the due day on updates but I would rather have them extend the dates than pushing a update out and crashing us all. I do wish the controls settings were more like Xplane12 tho. Super easy to setup controls in Xplane. Msfs can be a pain.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun game recommend you need a good pc though try out vatsim it makes it even better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but the optimism/performance need to be checked and than improve.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite bugs here and there and some needed optimization, it's one of my favorite games in the world next to DCS. It allows me to pretend to be a pilot. Something I'll never achieve in real life since my daddy isn't a millionaire.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was playing on XBOX, and just purchased the steam version.  Not very happy with this version, so far.  Set up flight in A320-NEO (I am not new to flying), and the PFD/MFD, instrument panel all locked up and could not make any changes,  i.e. qnh, std setting, engine screen was all red X's, but the engines running.  Only way I knew i was changing anything was the system assistance was still on ( i normally turn that off.)  the push back is horrendous, it does what it wants to, not what is needed to get out of tight gate settings.  Over all disappointed with this version, had better luck with the Xbox version.  will try again later, but spent 2 hours trying to fix or see what I did wrong.  I did get in the air, but not knowing what direction I was going, could not set altitude, etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Together with Vatsim is it more addicting than everything else",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly game is full of bugs, ATC loves to try to put me into the mountains. Keeps me on my toes. 10/10. The hours will continue to rise. and hopefully so will my flying skills.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game by itself is wonderful. Yeah there are bugs and glitches and sometimes weird terrain textures, but on the whole its awesome. Maybe they will fix the career mode, maybe not. Doesn't matter. Get NeoFly for free, its better anyway. See you up there!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have personal issues with the airbus planes but that could just be me. everything else is fantastic. Recommend if you want an improvement of 2020",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wonderful game, realistic and beautiful graphic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very good! Uh the experience will be the best when you have a hotas sytem or any other flight sim equipment you can fly with the keyboard but sometimes it is hard. Anyways the game is good the graphic is good! (you might need a powerful pc to play this game) Well good luck on your flight adventure!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "help!\nhow do you play this game after you purchase it? \n i go to steam, go to simulator, amd it says, ''its already in your library'' ''play now'' or '' install steam'' , i hit play now, but it it dosnt do any thing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great for people who know what they are doing, the global map is so pretty and the cockpit interfaces are great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just got a HOTAS. absolutely no glitches. idk what the others are talking about",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dont know why anyones complaining, no bugs for me and any game i can fly over canadian and alaskan wilderness is great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game with INSANE detail/realism. Mostly customisable. Really Fun! Just a few bugs and glitches here and there (The updates should fix them?). $100+? Not really. Feels like it, though it's MUCH better to buy it on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Endless possibilities!\nGreat for practicing checklist procedures, traffic pattern, instrument flying & simulated emergencies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent Core Experience, Critically Undermined by Core System Bugs\nRecommendation: Not Recommended (Until critical issues are resolved)\nI have spent over 80 hours in this simulation and genuinely love the core experience, the atmosphere, and the new Career Mode. It is, at its heart, a thoroughly enjoyable and engaging simulator. The sense of progression is rewarding, and reliable aircraft like the Cessna 172 Skyhawk fly beautifully.\nHowever, the experience is severely and fundamentally broken by critical system failures and control input conflicts that make complex missions an unreliable, frustrating gamble. This is not acceptable for a flight simulator.\nCritical, Game-Breaking Issues:\n * Unreliable/Corrupt Throttle Control:\n   * Throttle control becomes completely unusable or \"stuck\" in crucial flight phases (e.g., final approach/landing). This issue is prevalent on higher-tier planes like the Cessna C400 Corvalis TT and the Bonanza G36.\n   * This failure is unpredictable, resulting in a total loss of power control right before touchdown, leading to guaranteed crashes and devastating Reputation loss. The fact that the engine sputters or cuts out, despite correct Propel Pitch and Mixture settings, confirms a deep-seated bug.\n * Unacceptable Control Input Conflicts:\n   * The system fails to support a combined control setup. It effectively forces the user to choose between Keyboard and a dedicated Yoke/Controller.\n   * It is impossible to reliably map complex commands (e.g., Autopilot functions) to keyboard combinations while simultaneously using a yoke, as the system struggles to process these inputs without conflict. This hinders essential pilot workflow and forces reliance on the mouse in critical situations.\n * Inconsistent and Bugged Navigation Guidance:\n   * There is a consistent and dangerous mismatch between navigation systems: The visual \"Flying Patterns\" (boxes/guides) frequently vanish or conflict severely with Air Traffic Control (ATC) instructions.\n   * Example: Being instructed to \"maintain 15,000 feet\" by ATC while the visual guide simultaneously demands a rapid descent for a landing a few kilometers away. This forces the player to guess and risks a mission-ending crash.\n * Unexplained Flight Path Failures:\n   * Even when lined up perfectly for the final approach, the aircraft will sometimes perform an uncommanded, sharp, and aggressive turn (swerving) or dive that cannot be corrected, leading to a crash. This suggests a failure in the underlying simulation model (e.g., the Rudder Connection bug on damaged aircraft).\nConclusion:\nThe dedication to realism in the world and the core flight model is outstanding, but the total unreliability of the essential control systems and navigation guidance makes the game unplayable for serious career progression. Until these fundamental bugs—especially the throttle issues and control conflicts—are fully addressed, this remains a title with incredible potential, but currently delivers an unacceptable and deeply frustrating experience.\n\nI do understand that not everyone might have experienced this types of bugs or similar experiences in some cases.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "希望能下载地面风景到本地，可以离线单人游玩。",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not perfect, but better than anything we've had in the past.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very fun but the controls are preaty hard but when you get used to them you can easely fly trough the sky. It has lots of aeroport to chose from the plane selection is incredible the details are amazing but as you get closer to the ground things mushes but i  mean cants blame the the graphics a great recomed to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "-CATEGORY WELLNESS-\r\nDon't even bother watching the gameplay\r\nYou can find better in its category \r\nDoes what it needs to do\r\nExcels at its category \r\nBest of the best ✅\r\n\r\n-DIFFICULTY-\r\nA baby could play it\r\nEasy\r\nAverage\r\nChallenging ✅\r\nUnderstanding Winston Churchill ✅(If you decide to be very realistic)\r\nBeating Cuphead without losing any hearts on a delayed TV remote \r\n\r\n-GRAPHICS-\r\nPixelated \r\nBad\r\nOk\r\nGood\r\nGreat \r\nCinematic ✅(Maxed out)\r\n\r\n-SPECS NEEDED-\r\nCan run on a potato computer\r\nAverage\r\nHigh end ✅\r\nNASA ✅(When maxed)\r\n\r\n-ENJOYMENT-\r\nI'd rather watch Peppa Pig\r\nNot enjoyable \r\nCan get boring \r\nEnjoyable \r\nA game you'll remember \r\nCan be a part of your childhood ✅\r\n\r\n-COST-\r\nFree\r\nCheap\r\nGood amount \r\n60$ ✅\r\nLittle overpriced \r\nExcuse me, hell to the no\r\n\r\n-STORY-\r\nDoesn't really have a base game one\r\nWorse than how my parents met\r\nUnderstandable ✅\r\nVery interesting \r\nA whole show \r\n\r\n-PAY TO WIN-\r\nNo ✅\r\nYes\r\nPay to play \r\n\r\n-COMMUNITY-\r\nNicer than your friends\r\nNice\r\nBalanced ✅\r\nToxic\r\nYou'll be threatened \r\nGTA Online: Oppressor MK2 Edition \r\n\r\n-MODDING COMMUNITY-\r\nDoesn't have one\r\nUseless\r\nHas few mods \r\nGood\r\nMods make a difference \r\nA LOT ✅\r\nFrom a plant to a jungle \r\n\r\n-AUDIENCE-\r\nDon't have to be mature ✅\r\nMust be mature \r\nHas NSFW content \r\nMust be very mature\r\n\r\n-DLC AMOUNT-\r\nNone\r\nDecent ✅(Base game DLC)\r\nToo much\r\nEA and Paradox level ✅(When including the market place)\r\n\r\n-BUGS-\r\nNext to none\r\nMinor bugs\r\nCan make an impact \r\nVery annoying ✅(Not as bad as it used to be)\r\nCyberpunk 2077's release \r\n\r\n-SOUNDTRACK-\r\nMute it\r\nDecent ✅\r\nI'd download the soundtrack\r\n\r\n-WORTH IT?-\r\nNo\r\nWait until a sale\r\nYes ✅",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hard as fuck to land but i learnt how to after getting used to it  HUGE FUN can explore anywhere i want would 100% recomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but this game is hard all buttoms in cabin is working",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's very cool and realistic and gives you a range of missions and a massive range of fleet especially in free mode you can fly anywhere, even your house!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing simulation, few bugs during career and training but the live data etc amazing, you need a powerful pc graphics card.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've used Flight Sims for decades primarily for professional training eg getting ready to do my UK CAA SPA-MEIR. Accuracy is tantamount. My favourite sims were FSX Steam, then P3DV4. I then tried MSFS2020 but the native ATC - yuk. Now I have just bought MSFS2024. So far, as of yesterday I am now a fan.\r\n\r\nTo date, all I did was a short hop Inverness to Lossiemouth at 3000ft and the biggest change was being handed off correctly between Inverness to Lossie and not via Leuchars which is some 70nm to the south south east. \r\n\r\nI will be impressed if the ATC can handle a easterly departure from Dundee with a right turn south as it should be a quick change between Dundee and Leuchars - if the latter is active.\r\n\r\nSo I am going to stick with MSFS2024 now and support it. \r\n\r\nNB My flying is turboprop - all below FL180.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "government is shutdown and i cant get anything back on my medical shi so this must suffice",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good flight simulator. Better if you have the right yoke and pedals setup.\nRequires a powerfull computer to really enjoy the visuals.\nI really like how close to real life the in-game imagery is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've bought every new version of this released since 1983, and I also have real world flying experience, So I feel qualified to speak.\n\nI think they've really nailed it here. It looks better, runs better, and even sounds better, than previous versions, this one is in contention to be my favorite ever. I really like having the career mode! I think it adds purpose and a sense of accomplishment. The flight dynamics system seems to have had an overhaul because the planes seem to handle better and more realistically than they have in ANY other version, even the ground handling is much improved, probably the best it has been too.\n\nIMHO, it is an absolute improvement over MSFS 2020, and worth a look.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recent optimizations in the beta version have made the sim more usable for me performance-wise on a relatively low-end laptop by 2025 standards. There are still loads of issues that will either take years to be ironed out or may never actually be fixed. Whether the franchise and Asobo's development direction of it are worth investing in, especially compared to alternatives like X-Plane 12, is one thing, and the negative reviews hold a lot of merit - however, if you are an existing flightsimmer coming from 2020 and looking to exclusively do free flight, willing to begin tweaking settings, and will predominantly be using third-party aircraft and addons, I feel this sim has reached the point where it finally has an edge on 2020. Many popular addons have been converted to work and in my experience the sim both performs better and has better visuals, although my terrain and object level of detail sliders are set quite low as they are in 2020, to be able to have reasonable performance. With that out of the way it's definitely smoother and prettier. Your performance mileage may vary, and as I mentioned, there are still numerous issues all over the place that plague this franchise in general. But I'd say with the recent SU4 beta I'm pretty content with moving my addons over from 2020.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SU4 is the update that delivers all the performance we have been waiting for. vr perf is insane too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has its issues but it's still a very good experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its very cinematic and very fun to play",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a good overall game apart from the big price",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lots of glitches but still worth playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game a lot but it is laggy for me and i dont know  how to fix it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was released a year early but it's finally starting to show its potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool but cant under stand msfs 2024 vr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is an good game for plane lovers but you need something to play this game like an joystick or controler do not buy it if you are going to play on key board but if you have an joystick or something els then this is an perfect game for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game! I personally enjoy this game more than X-Plane, I know that may be a hot take. This game just gives me better vibes and much better integration with my current setup.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although i'm on the beta version the sim is absolute stable and running smooth.\nIt delivers all what FS2020 had plus a nice extra in optics and functionality on top...\nI like it very much! It is gettin better and better!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "On my 4090 rig works really well incredible graphics only problem they've complicated  the controller setup previous version really straightforward now you need a degree in understanding the obtus. London looks photorealistic but no HMS Belfast.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wished that some of the aircraft transerferd over from 2020",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "huge upgrade in terms of features,modes and graphics compared to msfs2020",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best flight simulator for PC on the planet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best game because you can play vr and pc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a beautiful with many realistic details",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing graphics if you got the GPU for it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "detailed, very good graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game guys nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Now that most of the problems have been ironed out. Looks great plays well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My PC ascended to heaven mid-takeoff. \r\n10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good game very immersed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best simulator ever!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's 2025 and this game is great!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun for vatsim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Helps with learning for my PPL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good flight sim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mfs2024 is good but not the best now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever! PLAY THIS!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it needs some work but its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a really fun sim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ye all good but make sure to have 32 of RAM no less.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nothing beats a jet2 holiday",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Maybe time to switch to 2024 now...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its super fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Realistic gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game ever!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good  game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its real. goog",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "I have been into microsoft flight sim for years. I know a lot of people have had issues with 2024 but i figured i should give it a try. It has so much potential but its just too buggy and choppy to enjoy. the flight planner is also very confusing and complicated. I am actually a private pilot myself and i will say doing a real life flight plan is easier than dealing with flight sim 2024 set up and flight planner. The VR mode also has bright flashing randomly during flight that makes it unplayable in VR. I have a little hope microsoft will be able to complete this sim in the future because i feel like it could be very good with some cleaner menus and better cloud gameplay servers. for now i will go back to flight simulater 2020 until microsoft completes (or abandons) 2024.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "This must be a buggiest game i ever played, career mode is unplayable and FM of CL-415 is really bad, graphics are really nice but everything else is buggier than swamp. It is sad to see game in this poor state one year after its release. Deff regret purchase!",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "Helicopter Career Mode – Still Broken, Still Unplayable\n\nI hopped back into the game recently, hoping that maybe, just maybe, after a year they’d fix at least some of the problems. Nope. Every single issue that was there at the start of 2025 is still alive and kicking.\n\nThe helicopter side of Career Mode is honestly a disaster. About half of the missions are straight-up unplayable. You can be hovering perfectly still — engines running smooth, no warnings, everything fine — and the game just decides, “You crashed.” Mission failed. Thanks for playing.\n\nOr even better: you spend 30–50 minutes on a mission, land perfectly, and the game refuses to recognize it. The mission just sits there, mocking you. There’s no way to end it, no payout, nothing. Your only option? Abort and lose everything.\n\nAnd the loading times… oh boy. You can make coffee, take a shower, maybe learn an instrument, and it’ll still be loading. Then when it finally starts, you get 45 minutes of smooth flying followed by a random invisible wall ending your career.\n\nIt’s just painful how inconsistent everything is. Some missions bug out completely, others don’t trigger at all, and overall it feels like the helicopter part of the game was abandoned halfway through development.\n\nI want to like it. I really do. Flying helicopters is fun — when it actually works. But right now, it’s just frustration wrapped in pretty graphics.\nIf you plan on playing Career Mode with helicopters: don’t. Unless you enjoy yelling at your monitor and questioning your life choices after every failed landing.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "Have held of on purchasing this game for a long time.  Just bought it in November 2025, as I was feeling confident as the people on the subreddit were praising the game and said that the bugs were pretty much ironed out....\r\n\r\n.... lol, well I guess there's a sucker born every minute and I'll take that on the chin. Bravo Asobo, Microsoft and the fanboys on reddit; this is a buggy pile of steaming dog-shit.\r\n\r\nBack to MSFS2020 for me.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Can't even log into the game, Nov 2025. Unresponsive login screen.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "What a piece of shit.  This game continues to be plagued by issues that just straight up shit in the mouth of the player.  I can't even fucking log on to this piece of stupid shit.  Way to rush a product to market that wasn't ready.  Uninstalling.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Took a 10 month break hoping this game would be polished and in better shape when I returned. I am back 11/27/2025, nearly 1 year after \"release,\" and I cannot tell any difference. This is still a mess.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Tried giving MSFS2024 a fair shot and it completely put me off. The install alone was a nightmare: it failed the first time and ended up taking around 10 hours total to finally get running.\r\n\r\nMy first flight was a quick hop around Seattle, and it was rough. Scenery kept popping in right under the nose of the aircraft, killing any sense of immersion. Instrument panel lights were flashing on and off as cloud conditions changed, which felt more like a bug than “dynamic lighting.” On top of that, the new UI is just flat and depressing to use, with none of the excitement you’d expect from a next-gen sim.\r\n\r\nOverall, it was more frustration than fun. I’ve requested a refund. I'll stick with trusty ol' 2020 for now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is beautiful, BUT it still has a ton of issues with installing mods and just trying to do vatsim barely works.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its a buggy pile of trash. cant even complete some certifications because it wont recognize the flight plan and constantly fails me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "1 year in, and an absolute joke.\nUninstalled - requesting refund.\nAlmost nothing works.\nYou might get 3 hours into a flight and then lose everything to bugs.\nThe game is pretty, and the potential is enormous, and i think those 2 things hurt the most.\nThe bugs appear faster than i can note them.\nThe forum is terribly moderated, and to be clearly objective i've had my partner look over my posts and she can barely see and issue, even after me having told her to apply a critical eye to it.\n\nI bought this for Career mode, i;ve been told i shouldn't fly this way as it has the most bugs... but why the hell shouldn't I be able to enjoy that, a premier offered feature of the prodct?\n\nTraining missions are broken.\nName an aircraft, i'll list a dozen bugs.\n\nMainthread loading up bug dropping FPS from 144 to <40\n\nC172 - floats too much on landing\nG1000 - NoseUP/DN logic inverted in FLC mode (basic functionality still broken 1 year in?)\nC208 - Throttle axis broken when throttle bought idle causing prop overspeed\nC208 - gross mishandling causing difficulty landing (extreme floating)\nC208 - AP pitch porposing (mild) and similar with roll (severe) - a forum user has a fix for this, but still not implimented.\nAirTractor Avionics broken\nCirrus Vision G2 - Unable to extend flaps to full if some de-icing feature used (exists in the real aircraft, but also in the real aircraft can be overidden after making a check, this part not in the sim).\n - Cirrus - Auto throttle adding thrust approaching stall speed, making it impossible to perform a safe landing at 1/2 flaps.\nInsurance - highest level of insurance intended to pay out 80% on loss of aircraft pays $0 - given losing an has sever in game consequences this is pretty rough.\nOverwhelming number of missions given are impossible to complete AS REQUIRED by parameters.\n- and some forum idiots say.. well you'd just pick a differnt runway in real life.. you're a bad pilot.. really??? picking a different runway incurs a penalty.. and i'm just trying to play as intended.\nInadequate fuel provided for missions.\nRadio pentaly for no reason at all.\nWheel off runway when taxiing down centreline.\n\nJust a few that come to mind.\nThe forum is riddled with issue after issue.\n\nUsers are also their own worst enemy for tolerating bugs telling me i should have known about  X Y or Z bug before i flew.  Are you serious? Classic case of defending a bad product and blaming the victim.\n\nTerrible product and a decent number of toxic users too.\n\nVery very sad, as if it even remotely worked as offered it would have great potential.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "DO NOT BUY THIS GAME!!!!\n\nUnlike MSFS 2020 which was a fully downloadble game (meaning the game was 150+ GB) it did also mean there was little to no latency issues unlike this game where the entire game revolves around servers this means it's constantly slow and barley able to run, also with little new features being added. If I could refund this game any day of the week I would.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Extremely buggy, almost useless for VR, DCS is much better, waste of money",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a fucking joke, A year later its still full of bugs that make the game unplayable. Carreer mode is imposible. Dont buy this joke of a game. 2020 is still better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After almost 100 hours on this game, they have yet to fix ANY bugs with ANY aircraft, still the shit quality from day one.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Sim still has many issues. I feel this game shouldn't have been released when it was. It wasn't ready. It still does indeed have bugs that really shouldn't even be a thing. Career mode is very buggy in general. Missions failing before you even get to pilot the aircraft, etc. Hopefully this stuff gets fixed soon...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i had fun for the first few hours but some how the game got deleted and when i re installed it and tried to play again it wouldn't get me passed the loading screen i tried everything don't waste your money on this piece of sht.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The fact that this game has been out and stuff has still not been fixed is actually crazy wish there was more customization in career as choosing different livery but the fact of trying to skip more so to open the door for more areas and then ur planes in the water or something else is crazy that or the fact when doing rescue missions theres no way for a plane to get there and then u end up crashing and destroying your rep overall its a solid game just wish they would fix the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have a $2000 computer and good internet and every time I load in the textures are shit. I cant even fly because the textures of everything in the cockpit are so low quality. I have my graphics settings on high so that is not it. I cannot fix this and it makes the game unplayable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "in one flight, expect to see more bugs than you have ever seen in any game. play it like a toy and you get toy results, play it like a sim and you get toy results, would NOT recommend. fuck Microsoft",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hard to run and has lots of glitches and bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is horrendously complicated to migrate control commands to any peripheral joystick . If you are a tech person I guess you can have fun programming the program ...basically for every single aircraft ..if you are just a pilot ..good luck ..graphics awesome but dozens of options for some features eg throttle control , and double tasking for inputs and a corn maze menus have me finding other passtimes .....I hate the program now.......simply defining a few terms would be nice ..eg filters ...eg beta update ..eg input value ...etcetcetc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Completely unfinished game and a borderline scam. £69.99 for a game that promises everything and delivers nothing. Career mode is unplayable and half the aircraft don't function. A year on and there are now more bugs and defects in the game than ever. With ever update, they fix a few things and break much more. The game made 26.7 million so far and was created by a multi-billion dollar company, yet they can't employ developers to hot fix the many issues raised in the forums, but instead have a gross over reliance on AI. So much potential for a great game but the delivery is shockingly bad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "CATASTROPHIC! \r\nI used to fly a lot on FSX when I was younger, a decade later we got this, can't believe it. \r\nIt's impossible to play online formation flight with a friend, we tried everyting, set up and online guides, this is ridiculous. Yes, the game is beautiful but everything else is completely messed up, I cannot believe it in 2025. The menu is a mess, no logic at all, the flight model is most of the time horrendous, it's heatbreaking. I'm a commercial pilot and will stick to payare addon to train, for any other fun, FORGET IT.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is good but it contain a lot of bugs and problems, What I hate the most is AI ATC. its terrible. I think you release this game too early. Msfs 2020 much better and contain more realism and less bug than msfs 2024. Please fix it. :(\n\nMsfs24 cost more than msfs20 but contain bugs that really annoying. I can't even fly normal because ATC AI is very bad. Hopefully you read it and going to fix those huge problems. :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think it’s time for me to throw in the towel on this one. I held out hope for a long time, believing the team would eventually deliver. I was genuinely excited for this game — finally, a flight simulator that could bring career progression, mission structure, and real economic depth into the experience. It had the potential to create incredible immersion and inspire a whole new wave of aviation interest through YouTube series and community projects.\n\nBut I’m deeply disappointed. I feel fooled by the way this release was presented. The pre-release communication made it seem like the developers had a solid vision and a genuine passion for aviation and simulation. I believed in them — enough to buy the Aviator Pack to support the project because I truly wanted it to succeed. Yet almost a year later, the game still doesn’t feel anywhere near release-ready.\n\nIt’s a real shame. This could have been a fantastic game if it had delivered on its promises. Even the free flight experience feels unstable and incomplete. I delayed writing this review because the developers’ feedback after launch seemed positive — as if they had a plan and were actively fixing things. But at this point, it feels more like a broken promise than a work in progress.\n\nI want to change this review someday. I still hope that one day this will become the game I believed I was buying. Please — make it into the simulator it was meant to be.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is just the worst game ever played what a wast of time and money ive spent creer mode aircrafts just chrashes no reson now think flying ur own craft thats all ur hard work gone spending to repair because dont buy this shit MFS 2020 was better then this shit its been all day like this spent millions of credit now run out cant even repair its just  a fucking joke of a game sim WORST",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "over all the game looks bad and plays bad hard to lern took away to many thing from the first game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When I first got the game everything was fine but after attempting to download the aircrafts from the previous title (MSFS2020) the game wont even start. I have all my drivers updated, CPU and CPU are fine and not stressed during gameplay. When the game did crash I never got a crash report, so I couldn't even fix the problem even if I wanted to. I'm happy this happened in the 30 day window so I can get my money back and spend it on a game that actually is playable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "flight models isnt that great performance is okay but it does not work with AMD drivers on windows for some reason and has a lot of artifacts and glitching. (works on linux). Game is also really overpriced with all the microtransactions on top of that",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't believe the state this game is in after a year. I bought it a year after it was released and I've never seen such a pig of a game. The load times are atrocious, I can understand partially if it's for the area you're flying in but just the menus take forever. It doesn't make any sense. \n\nOnce airborne it's pretty good, of course amazing graphics but I'm not sure it's worthwhile. Mission objectives sometimes don't get hit and are arbitrary as well. \n\nAnyways, really surprised.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Waiting Simulator 2024\n\nDo you ever find yourself in the mood to waste hours of time playing video games, but are tired of engaging with the content to do so? \n\nDo you ever come away from a gaming session exhausted because you got too much done per unit of time wasted? \n\nThis game solves these problems. By taking 30 minutes to boot from the time you launch the game, locking you in the menu for hours while it loads your flights, and making you go back and forth trying to get basic things to remember your wishes (like the hair color of your pilot, or the time of day you set for the flight), you can waste hours of your life without ever actually experiencing any fun! \n\nVery rarely do we see a game that innovates on how you interact with the game: you get your standard keyboard and mouse, and you press buttons to make things happen. Microsoft is taking us on an avante garde journey as they incorporate the rest of your house into the interactive experience. Watch as you get up from your chair to clean your room, wash the dishes, make a phone call, or browse reddit waiting for the game to load the most basic assets, from menu images to a flight you literally just loaded a moment ago!\n\nI've never not played a game so much before!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game crashes constantly and randomly. It doesn’t autosave anywhere, so you lose all of your flight progress. My most recent crash was because I was adjusting the mixture — what an edge case the devs never saw happening!\n\nThe training missions don’t explain anything at all. I’m not versed in a B737; you can’t expect me to know exactly what all the acronyms, buttons, and checklist items mean. You get docked points because you aren’t a seasoned jet pilot, with no explanation.\n\nCareer mode will dock you points for no reason. I’ve had points taken off for “entering a taxiway” on a runway where I had to turn around and couldn’t do so without running off the tarmac a bit. It’ll also only give you 80–90% for landings even when they were textbook.\n\nSome missions have you flying outside of your plane’s capabilities — spawning you in a 172 and asking you to take off and climb a mountain at a rate higher than the aircraft can achieve. You fail the mission if you deviate from the path.\n\nThe controls are way overcomplicated. I have a button on my throttle to enable/disable NAV AP. For some reason, each aircraft has this exact same function listed differently in the controls menu. Even after setting general controls and “copying to all aircraft,” there are several areas where the same key/button needs to be bound multiple times for most aircraft to recognize it.\n\nSometimes autopilot doesn’t work. Sometimes your throttle gets stuck at TOGA. Enabling NAV mode on AP will have your aircraft oscillate endlessly, even though you were already on the line when enabling it. Sometimes the V/S beep in gliders gets stuck at a certain tone no matter what. Sometimes the sim wants you to taxi to parking, but the parking spot is 180 degrees from where you’re facing and there’s no way to get there — so you just park the wrong way and chop the marshaller in half with your prop. Sometimes the hold short box isn't in the right place so you get penalized for overshooting it. then it repeats that message and continues to ding you over and over again, while asking you to disable the parking break (already disabled) while in the air.\n\nVery buggy, laggy, unoptimized piece of garbage. The devs should reevaluate their careers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not ready yet for prime time.   Still very buggy - this from an 20+ year Microsoft Flight simmer.  Still some substantial kinks required to work out.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "ive had this game for many years, ive always purchased the latest one, im technology challenged and hate paying for something that i cant use now, i know my passwords and sh>t,  im freeken pissed, i have quit few of hours, but for some reason when i used my spare laptop to play other games from this freeken site it blocked me, i can play my CandC but cant use my sim anymore, do i have to buy again to use it or in my brain im thinking that this is bercome a legal issue, FRAUD, when a person buys something they shpuld be able to use it and NOT HAVE XBOX FREEKEN MAKE IT INPOSSIBLE TO USE SUCH ITEM\r\n    SIGNED DISSAPPOINTED",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Another garbage product from a garbage company. Microsoft products are already a joke, and it shows with they're declining behind other tech giants. I have a brand new Razer Blade 14 Gaming Laptop with great specs and this POS freezes non-stop for no reason. I have optimized everything and tried countless remedies to no avail. Garbage product from an even more garbage company.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The inconsistent performance is the biggest killer in the game in my opinion. I run very up-to-date hardware on my computer and sometimes the frames chug to the point that I just turn it off. \n\nThe campaign is also a disaster. The game randomly throws \"you didn't land on a runway!\" even if you did. Sometime it can spawn you close to a building causing you to fail the mission because you literally cannot get out. Or hell, if the world streaming is really bad you can end up getting deformed runways which will cause you to hit weird polygons when landing, causing it to count as \"failed mission\".\n\nI can't recommend it until they fix these things. Other than that, the game is fantastic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "still contains many bugs. from performance, visuals, etc. even though it's more stable than the early launch version. career mode still take ages to open. addon compatibility with MSFS2020 are still pretty much hit-or-miss, even though Asobo promisses seamless compatibility. still lack of native 2024 addons, or even the supported 2024 addons.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely awful experience for mouse users \r\nForced mouse acceleration and smoothed head movement make it a pain to try and use",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very buggy mess and requires a nasa supercomputer to run decently",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I figured I would give this a try since its disastrous launch assuming since its been a year they should have fixed most things by now. Nope this game is a pile of crap. I have never played anything that has crashed or had as many issues as this and I of a top of the line system that can run anything maxed out. So many GPU/DX12 issues combined with their whole streaming online model what doesnt cause it to crash? Spent days troubleshooting and eliminating potential causes and at the end of the day their product is shit and requires significant patching to function. Not worth the time and money. Stick with 2020 and that being said 2024 barely looks better than 2020 anyway so save yourself a huge headache.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The tutorials don't explain how you do anything, they just tell you what to do. \"Trim\" ...okay, what direction, how much, why, what does this do? what's the rule of thumb? when? etc.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This version 2024 is full of Bugs that are really annoying if you use Vatsim or other add ons.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unable to sign into microsoft/Xbox account.  Unable to play.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just installed and the TMB did not work at all.  Keyboard nor mouse controls worked.  Honeycomb Alpha nor Bravo controls worked.  Both were set up prior to starting flight.  Garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ters rüzgardan neredeyse geri geri uçtuğum piste indim zar zor , durdum pistten 5 metre ötede , pistten çıktım diye ceza aldım pist 200m filan dünyanın en kısa pisti , pistin bitişine ağaç dikmişler , durduğum yerden döneyim diye hareket ettirdim 0.1 knt hıza varmadım, ben bile hareket ettiğinin farkında değilim ağaca kanat değmiş ve uçak düştü dedi, itibarın ****** koydu , buglarla dolu bu serüvene sen de davetlisin , gel ve anan ****sin..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dlc inside the game doesnt work, loss of money",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As a seasoned flight simulator player, I had to give FS2024 a go. I'm not a big fan of 2020, but I'm biased due to a horrible installation process at launch. I have however played X-Plane 11 and X-Plane 12 for a good amount of time (over 3000 hours), and have a few hours in real world aircraft with an instructor (Cessna 172, Cessna 152, Piper PA28 Warrior II.) In terms of physics FS2024 feels more true-to-life, espescially in terms of ground handling, the aircrafts actually feel like they have inertia and lag with the tiller. Another thing that stood out to me with FS2024 was its performance, but not in a good way. I have an i7, a 4070Ti and 32GB of DDR5, this however was still not enough to run it on medium graphics settings at Sydney Airport in the A330 without serious stuttering that made interacting with the aircraft or even just moving the camera around a very difficult experience. Another let-down for me was the controls. I love the control bindings and setup in XP11 and 12, everything for the most part seems logically set up and customisable, however this in my experience is not the case with MFSF2024, the default controls were different to 2020 and made little sense to me. This was made worse by the difficult UI for changing these controls.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Each update makes it worse. The career mode is still buggy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When I decided to buy a plane simulator I thought that Microsoft is a big company and quality is assured\nOh man how wrong I was\nshould wait a little longer and read the comments",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They have had a year to improve this sim and it still bugs FREQUENTLY and freezes up on me.\nIt runs perfectly fine until i unfocus it, it continues to pause the flight at random moments which lags the game, and it simply is less efficient to install mods compared to msfs2020.\n\nIn my opinion, skip this version, just use MSFS2020 with mods, its the same thing and isn't NEARLY as buggy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When the Microsoft login doesn't work, there's no back button, you have to restart the game and try again. I got tired of doing that and refunded the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As of now, I have 609 hours on this game, and I highly recommend buying basically any other flight simulator. Overall, the graphics look great, and most of the aircraft handle very well. That's about the only redeeming qualities of the game, it's a poorly optimized dumpster fire with more bugs than features. Career mode is fun when it works, however it's fairly common to end up getting softlocked out of completing missions, or just having the game randomly decide you've crashed. They also still have not completed career mode yet. We're going on 2 years since the game was released, and there's still no heavy cargo missions, no jet airliners other than the 737 max, and there's still certifications that haven't been released yet. The ATC for career mode is also absolutely horrible and glitchy, with it giving inaccurate directions and often getting stuck in dialog loops. Microsoft has also chosen to focus on releasing in on Playstation, instead of finishing the game that we've already paid for. Unless you really want the glitchy in-game career mode, you're better off spending your money on Flight Simulator 2020. The ONLY reason I have so many hours on this is because I already paid for it, and I'm not gonna pay for another one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm so sick of trying to play this game.\nFor every hour I spend trying to get this game working without crashing I get 15 minutes of play time.\n\nNo update has increased stability. No update has increased performance.\n\nEvery time I try to play I just get more frustrated than I ever could have imagined.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This gsme is a sham. Go with X plane. This game is setup for all to fail, and when it doesnt it freezes out",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Loading times make the game unplayable at times.  Poor decision to make it cloud based if your not going to make it work.  I would not recommend this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is fun and all but in career it freezes when i load into instrument rating and i have to restart my game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game has been unplayable, getting crashes since I bought the game. Sessions that last longer than 20 minutes without crashing are almost impossible even without any add-ons. I've been trying to fix the sim with help from their Zendesk support without any progress. For me, sadly, unplayable and currently a waste of time. They should focus on getting out of their \"unofficial beta testing\" and fix the game where they already released it!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THE WORST WAY TO SPEND 69 $ ....\n\nCreated the Xbox account , barely did couple of minutes of flying, logged out. Tried to login again after some time , for no reason the account was locked , can't verify by text .. can't do anything , no support ..NOTHING.  \n-Tried creating a new Xbox account with a different email address since i barely did anything on the sim anw ... guess what you can't.. it says account mismatch. ( I initialy thought it was a mismatch with the steam email address which i also then changed to match the new one.... didnt work )\n\nSave yourself the headache and money waste ... so disappointing and stressful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "absolute rubbish, never the same game twice. always something that doesn`t work. dont waste your money",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "10 bugs in one hour is genuinely impressive. My \"flight instructor\" was half way through the ground talking to my crotch. This game would be 10/10 if it was like 10 dollars.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What a janky game! Everyday it seems to be something new....some sessions it will fly properly, and others, like today, it just wants to screw you. Loading into a mission should not crash/drop your plane out of the sky, or fail you because you JUST loaded in and you somehow managed to leave your plane without your cargo....but you haven't taken off the chocks, pitot cover or engine cover.\nAlso still incapable of changing a flight plan and modifying the runway you want to land at. Even with Enforce ATC turned on.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "expensive as hell game and each plane you want to get is another 10 to 30 dollars you gotta spend. Denver International Airport is locked behind a dlc or you can spend 10 to 20 to get it individually. Mind you this is the THIRD BUSIEST AIRPORT IN NORTH AMERICA WHEN THIS WAS RELEASED.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a buggy, abominable fucking insult to all I hold dear in aviation. Do not fucking buy it. Please do not make the same mistake I made. DO NOT BUY. DO NOT BUY.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "My aircraft autism is not strong enough to overcome the endless frustration this game causes me.\n\nIt installs fine, it runs fine, performance is decent…..enough.\n\nActually playing it though is just erratic. Between the “streaming everything” data model, peripheral support, add-on support, I feel like I spend more time chasing a problem than I do flying a plane.\n\nMicrosoft Preflight Checks Simulator - I just can’t be bothered. :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game isn't the best if you download mods they won't work and also the crash physics are so unrealistic, I'd just like to say if you had a hundred dollars you should not buy this game unless you are very into planes. Thank You For Your Time I Hope You Have A Good Rest Of Your Day",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game performs as well as Bill Gates did discussing climate change. Then changing his position when it wasnt relevant. I wouldn't buy this game again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible AI generated dialog that repeats every. single. mission. Crashes that happen in the middle of long haul flights. A completely bugged career mode that tries to path your plane through mountains, will claim that you crashed your plane midair resetting the progress you made. No more bush flights mode. This is a downgrade",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Game did not even work no matter what i did 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A pile of rubbish infested with bugs on virtually every level. It might be ready to play when they release the next Flight Simulator.\r\n\r\nEverything from:\r\n1. Unsolvable, inconsistent stuttering GFX, even if FPS high on a high spec PC.\r\n2. Crackling sounds\r\n3. Ridiculous install time, ridiculous load times (no SSD on Earth will help you)\r\n4. Broken ATC\r\n5. VERY broken career mode\r\n6. Broken planes (my last plane (PC-24) uses fuel at double the rate! Did QA even bother to fly it?\r\n7. Major features unfinished/missing e.g. career heavy cargo\r\n8. Graphical artifacts (trees looking like blobs, missing buildings, floating peope)\r\n9. Mission scripting/pathing - the MS/Assbo team responisble should be straight up fired\r\n\r\nAll this still after 3 major sim updates.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this sim has been out for an entire year and Career mode is unplayable with the amount of bugs that interrupt the flight, 2 hours of your time wasted and for what? the parking brake wont engage. Cant click it, can bind a button to it on keyboard, throttle, or yoke. Absolute joke of company. dont buy this unless you absolutely have to. they dont deserve your money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "cANNOT GET POP OUT PANELS TO WORK.  SPENT HOURS WORKING ON IT ANS THE SUPPORT IS WORTHLESS TO NON EXISTENT",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Extremely laggy. Can't even play the game. Waste of $70.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still very bad sim, It is a scam  compared to MSFS2020",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "looks like devs optimized this shit while they are on crack",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Просто хлам , верните нормальную камеру ! Как в это играть?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't login.  xbox sign on doesn't work.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont waste your money this game has more bugs than a ant hill",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "stay on 2020 still crashes a lot",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bad fps and bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its jus a plane game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The buggiest game I have ever played",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "to hard to connect with my joystick",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nie kupujcie tej Alfy - Nie warto za takie pieniądze",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unplayable",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It feels like its still in beta.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "uh not my type",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overpriced Nonesense",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h2]TL;DR:[/h2]\n[h3]Free Flight:[/h3] Stunning, smooth, magical.\n[h3]Career Mode:[/h3] Bug buffet served daily! Do bring patience.\n[h3]Verdict:[/h3] I love it too much to lie...can't recommend it.\n[hr]\n[/hr]\n[h1] I absolutely love Microsoft Flight Simulator 2024.[/h1] \n\nLet's get the obvious out of the way first: the graphics are jaw-dropping. The first time I loaded into Free Flight and watched the sunrise over the clouds, I just sat there, grinning like a kid. You can see reflections in the cockpit glass, light bouncing off the wings, and tiny cars moving below, it's insane. There's no point in even debating it: [b] it’s absurdly beautiful![/b]\n\n[h3]Free Flight mode?[/h3]\nAbsolute chef's kiss. It's relaxing, immersive, and everything I ever wanted from a flight sim. You can just pick a plane, pick a place, and go, no stress, no nonsense. Sure, there are a few small glitches (nothing's perfect), but nothing major. The kind of issues you can solve by taking a deep breath, grabbing a snack, and reminding yourself you're basically flying a digital Boeing from your desk.\n\nAnd, sometimes, those \"bugs\" are unintentionally hilarious. I once discovered a flying ship in Miami. Yep. A ship. Flying. I didn't even bother reporting it, at this point, I just waved at the captain and moved on. Honestly, it's part of the charm.\n\nSo yes, [b]Free Flight mode? Fantastic. 8.5/10 easy.[/b]\n\n[h3]Then there's Career Mode.[/h3]\n[b]And oh boy… where do I even begin?[/b]\n\nCalling it \"buggy\" would be like calling a hurricane \"a bit windy.\"\nIf you can imagine a bug...any bug...it's there!\n\nThe game will find creative new ways to fail you.\nA pigeon sneezes in another time zone? [b]Penalty.[/b]\nA cloud gives you side-eye? [b]Mission failed.[/b]\nSomeone in your house opens a soda can too loud? [b]Congratulations, you're out of fuel.[/b]\nAnd my personal favorite: ATC instructs you to maintain 5,000 feet while you're staring straight at a 10,000 foot mountain. If you climb...[b]Penalty.[/b]\n\nIt doesn't matter if you're on Xbox Game Pass or Steam, I've tested both, the madness is the exact same. You could be flying over the Himalayas or taking off from Kansas, at any moment, something small, random, and ridiculous [b]will[/b] ruin the entire flight.\n\nHere's the thing:\nI want to love Career Mode. The concept is brilliant. Building a flying career, taking jobs, improving your rank, it's everything a flight sim enthusiast dreams of. But right now, it feels more like a test of patience than a feature. Each time I think \"Okay, maybe this update fixed it,\" I end up going to bed frustrated, muttering at my monitor like an air traffic controller who's lost faith in humanity.\n\nAnd what's worse? I've seen almost no meaningful bug fixes in the updates so far.\nEvery patch feels like a new paint job on a plane with one wing missing.\nNo serious acknowledgment from the devs, no clear roadmap for major fixes, and definitely no hint of an \"MSFS2026\" or future plan. That's what really scares me, that this might be as good as it gets for Career Mode.\n\nWill I keep playing?\n[b] Absolutely. [/b]\nBecause when everything does work, when the wind is calm, the systems behave, and the plane glides smoothly through golden-hour light, it's truly pure magic. Those moments remind me why I fell in love with flight sims in the first place.\n\nBut most evenings, after a long day of work, I just want to relax, fly a job, and make a little progress… and instead I end up staring at \"Mission Failed\" screen, questioning my life choices and wondering if my dog's snoring somehow triggered a stall warning.\n\nBottom line:\nI can't, from the deepest part of my aviation-loving soul, give this game a positive review.\nBecause I care too much to pretend it's fine.\n\nGames are not just about graphics, they're about experience, consistency, and respect for the player's time. And right now, Career Mode doesn't respect any of that.\n\nIf you're still tempted to buy it (and hey, I get it), do yourself a favor:\nHead to the official forums at forums.flightsimulator.com\nTake a read. See what the community is saying. You'll quickly realize this isn't just me ranting into the void, it's a chorus of frustrated pilots trying to love a game that keeps stalling mid-flight.\n\nThank you and Happy Flying everyone",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Career mode is broken",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too may problems",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "prefer DCS instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "BAD",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pros - -game is beautiful from the cockpit \r\n           -It has hours of content from career mode to free flight \r\n           -the aircraft all feel different so it gives a lot to play with and learn\r\n           -it does a good job tickling the brain when you have a successful flight in career mode\r\n           -there is some light character customization which is a nice touch \r\n           -small details like your office changing as you progress and make more money\r\n\r\ncons - - you can not customize aircraft livery in career mode\r\n           - helicopter missions are still lacking and often buggy\r\n           - bugs will often cause a hit to reputation in career mode \r\n           - bugs often occur near the end of long flights (often hours) causing \r\n              loss of all progress\r\n           - career mode has a lack of certain missions showing for company missions for example medium \r\n              cargo, helicopter SAR hoist, helicopter SAR.\r\n           - when you buy a aircraft with real money you will still need a few million in game currency to be \r\n              able to use it in career mode\r\n           - often times the default altitude will be above the maximum allowed for your aircraft\r\n \r\n*conclusion - get it on sale or if you are a absolute nut about aircraft and can tolerate the issues mentioned. For everyone else I would pass on this game until its patched up a bit better unless you have that kind of money and patience to throw away on something.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Decided to buy with the intention of playing career mode, despite all of the negative reviews, and I can confirm it's a disaster. The career progression is unforgiving with a total lack of refinement. It's full of game-altering bugs that can really piss you off, such as: your plane randomly crashing upon takeoff and aviator performance bugs that tank your reputation and bank account. The final cherry on top for me is that I am no longer receiving no-skip bonuses for flights. In fact, I'm receiving HALF of the advertised amount for the flight. \n\nThe fact they charge this amount for this garbage is infuriating. Listen to the reviews. Do not buy.",
      "voted_up": false,
      "votes_helpful": 249
    },
    {
      "review": "The game is good, but it doesn’t live up to MFS20. I bought it for the career mode, and I wish I had not. The missions are repetitive, and the AI voice acting is terrible - I would love to see an option to mute it. Technically, it falls short of what we got in 2020, which is disappointing. In its current state, I don’t recommend this game to anyone who wants to play the career mode.\n\n 3/10.\n\n\nEdit: After an additional 26  hours, I still cannot recommend this game. It is hard to believe the game is already a year old. My experience over those hours includes:\n\n1. Very poor optimization: frequent frame‑rate drops and stuttering.\n\n2. Freezing: The game frequently becomes unresponsive.\n\n4. Incorrect IFR coordination: Wrong instructions.\n\n5. Communication failures with ATC\n\n6. Irregular runways: Irregular runways, random objects and vehicles cause planes to crash.",
      "voted_up": false,
      "votes_helpful": 115
    },
    {
      "review": "If you want a realistic feel for IFR flight,  this simulator is not for you.  The tower does not step you down to the correct altitudes.  Graphics are great and simulation is  good if you simply want to fly VFR but I was disappointed with how this game handles IFR approaches and I bought the premium addition.  Totally not worth the money.",
      "voted_up": false,
      "votes_helpful": 115
    },
    {
      "review": "If this game was half as good of a sim as it was pretty, it would be great. Career mode is so broken it’s not playable. The performance is awful. First party Microsoft on their platform and it’s total junk. It’s been out for over a year and it’s still a mess. How!?",
      "voted_up": false,
      "votes_helpful": 118
    },
    {
      "review": "I have been into microsoft flight sim for years. I know a lot of people have had issues with 2024 but i figured i should give it a try. It has so much potential but its just too buggy and choppy to enjoy. the flight planner is also very confusing and complicated. I am actually a private pilot myself and i will say doing a real life flight plan is easier than dealing with flight sim 2024 set up and flight planner. The VR mode also has bright flashing randomly during flight that makes it unplayable in VR. I have a little hope microsoft will be able to complete this sim in the future because i feel like it could be very good with some cleaner menus and better cloud gameplay servers. for now i will go back to flight simulater 2020 until microsoft completes (or abandons) 2024.",
      "voted_up": false,
      "votes_helpful": 87
    }
  ]
}