{
  "positive": [
    {
      "review": "The best hunting simulator game, better than The Huner call of the wild.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Really fun and enjoyable. It’s simple, smooth, and entertaining, with great gameplay and good vibes all around. Addictive and satisfying, I keep coming back for more. Overall, a solid game that’s fun, relaxing, and has just the right amount of challenge.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "it’s slow-paced but rewarding. The environments are absolutely gorgeous even for its age",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Muito bom, pode ser um pouco difícil de se adaptar, mas depois de 1 horinha você já entendeu como funciona e é só diversão",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I have played this game for many years now & have enjoyed it. They have events throughout the year that are especially fun like hunting werewolfs for Halloween and Rudolph the red nose reindeer for Christmas",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game man love huntinf and mechanics of it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Definitely a game for the patient; it is hard finding games are are true to the real thing like this game. Give the game a try and it might grow on you. This is not about graphics or gimmicks. This is a game for true hunters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game but one thing  i chose a boy but it gave me a girl. but everything else is great. i really think you need to get it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It free and good takes a little while to getinto but once your in its the best hunting game out there only if it got updates other then events wich are awsome cus i almost pooped myself when i here were wolf and try to pull out gun but just get malled asome game tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Hunter Call of the Wild is prob my fave game but this is prob 3rd or 4th it is more relistic i know i spelled that wrong sorry but any way and harder but over all I recemend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very real hunter game, better than COTW, if they could merge the Graphics of COTW to this game or the mechanic to COTW that will be a hit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing. its realistic, fun, and free! Highly recomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was aggravating at first, to find out it’s basically pay to upgrade unless you want to grind for months to get a gun capable of shooting most animals, and mostly finding female animals that get you no in game currency for killing. But once you learn what you can kill and get points for and what to look for it’s a pretty amazing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game! it is not pay to win but it does take time to progress without paying, they gotta make money somehow",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game iv always liked it i play the hunter call of the wild more now but i revisit this every once and a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its hard to play without spending money but if you do spend its pretty fun and enjoyable. doing the missions will help alot with making money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this for a while now, and I can confidently say that it's worth trying IF you have the time and the money. This game does progress slowly if you don't do missions or competitions, and not spend a dime. But after that, the game gave me fond memories of me and my gf playing this. \r\n\r\nAlso be careful, this game is old and newer pc's do sometimes break stuff, specifically graphic drivers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly its not for everyone. if you like realistic games, this is ok. but its clunky and really hard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, grindy. Hard for beginners, but fun when played for a while. Recommending!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I stalk the deer on a far hill for 45 minutes\r\nI take aim at the deer at too great a distance\r\nI shoot the deer\r\nI realize the deer is a rock\r\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Spent abut 45 Minutes tracking a deer. Found one got excited and shot it in the chest. Got side tracked with other animals lost it. Then proceeded to get yelled at by a NPC for not using the Right type of ammo. All in All would Dark theHunter Classic Souls agian.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game for being free. This game has been legendary since launch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game does have a pay wall.  Or extreme grinding but it is very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty chill and good game to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "theHunter Classic is a “free-to-play hunting sim,” which is a polite way of saying:\n\n> “Do you enjoy walking very slowly in the woods, listening to birds, and occasionally experiencing 3 seconds of pure chaos?”\n\nYou don’t run-and-gun.\nYou **crawl-and-hope**.\n\n---\n\n### The Actual Gameplay Loop\n\n1. Spawn in.\n2. Walk.\n3. Walk more.\n4. Hear a call.\n5. Crouch-walk for 15 minutes.\n6. Finally see the deer.\n7. Forget to hold your breath and completely whiff the shot.\n\nRepeat until you question your eyesight, your aim, and your life choices.\n\n---\n\n### Pros\n\n* **Vibes: immaculate.**\n  Forests, fields, mountains, rivers—this game nails “I touched grass today, digitally.”\n* Surprisingly relaxing… right up until your target finally appears and your heart rate spikes like you’re defusing a bomb.\n* Realistic tracking: footprints, droppings, calls. You will become way too excited about pixelated poop.\n* Guns actually feel different:\n\n  * Too big = overkill\n  * Too small = “you just wounded it, congrats on your guilt”\n* Co-op is peak comedy: four grown adults whispering into mics about an elk that immediately smells them and sprints to another zip code.\n\n---\n\n### Cons\n\n* If you’re impatient, this isn’t a game—it’s a **punishment**.\n\n  * You will walk for 20 minutes\n  * Misstep once\n  * Animal gone\n  * Back to cardio\n* F2P but with “you sure don’t *have* to spend money… but look at these nice guns and licenses 👀” energy.\n* The learning curve is basically:\n\n  * “You scared it.”\n  * “You scared it again.”\n  * “You hit it badly; enjoy tracking blood for 40 minutes.”\n* Hard to explain to non-gamers:\n\n  > “I spent my night in a virtual forest and got excited about hearing a distant grunt.”\n\n---\n\n### Peak theHunter Classic Moments\n\n* Crouch-walking for ages, lining up the perfect shot, clicking the mouse… **safety was on.** Deer leaves. You leave emotionally.\n\n* Hearing a call, doing everything right, wind in your favor, perfect cover… and then a random rabbit sprints past and ruins the entire stalk.\n\n* Multiplying your monitor’s brightness, leaning forward IRL, and convincing yourself that blurry brown pixel is definitely a whitetail.\n\n* Finally dropping a big animal cleanly and posing for trophy pics like you didn’t just spend 45 minutes chasing one dot on the minimap.\n\n---\n\n**9/10**\nLess “action game” and more “zen hiking sim where you occasionally commit ballistic math.”\n\nWould once again boot it up “for a chill hunt,” walk in a straight line for half an hour, miss the only shot I get, and still call it a great session because the trees looked nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game for people who liked call of the wild and wanted more of a challenge",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most realistic and enjoyable online hunting game there is. Compatible with several different hunting techniques. Can have a fair amount of success without spending a ton, and you can get in game currency by winning competitions and and completing missions. Best game I've ever played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game if you want a classic oldschool hunting experience. The different festive events give it a fresh breath of life(that is when the developers manage to roll out the events on time). Game has bugs here and there but its awesome and i love it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "1 hour in and theHunter: Classic is surprisingly immersive. The environments feel alive, tracking animals is satisfying, and the realistic mechanics make every hunt exciting. A great start for hunting fans.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ngl fun game when youre board with nothing to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Najlepsza gra do upierdalania esioka z ziomkami polecam kazdemu",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good if you like good old original hunting games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best hunting game ever made",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty, good game i really like it <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Hunting game ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hunting aminals, nice!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best hunting game ever!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game! Very realistic!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gun go boom and deer goes sleepy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bok befok now that you can shoot anything",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very nice inda slow but rewarding :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun shold do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game!!!!!! 5 stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game hard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its aight",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HOLY CRAP! this is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "beautiful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i can buy em$",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ALLAHU FISBAR",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SKIBIDI",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "opa",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gas",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeahhh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "relax",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "☆┌─┐　─┐☆\n　│▒│ /▒/\n　│▒│/▒/\n　│▒ /▒/─┬─┐\n　│▒│▒|▒│▒│ =]~~\n┌┴─┴─┐-┘─┘\n│▒┌──┘▒▒▒│\n└┐▒▒▒▒▒▒┌┘\n　└┐▒▒▒▒┌",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think my life would be incomplete without this game in it. I live in the north west of Oregon. It is my general archery season right now for Roosevelt elk; but I am glad to be giving this amazing game a review. I have and will continue to tell or convince anyone willing to listen, whether their young, or old, a gamer or not, a hunter or not to play this game. I have talked 2 people into buying a laptop and a desktop just to  play this game and still play with with them to this day, neither of them had had a steam account before that. For any one reading this: good games are not about graphics or the depth of story but by how it is able to pull your emotions out and make you feel as if playing the game wasn't a waste of your life.. I don't regret any moment spent in this game. To all the hunters out there It's as close as it gets to the real thing hands down 100% and if you say it isn't, your either not a hunter or a hunter that has paid big $$$ for what ever trophy animal they had handed to them or someone that hunts from the front seat of their truck.. \r\nAnyway, if I had to say one thing to try and get people to play this game it would be this, if you're looking for an easy  quick thrill of a game, one that you won't ever remember after you're done playing it because you're weak and just want a gimme easy and have a \"everyone gets a trophy\" type mentality.. This game might not be the one you want but it might be the game you need to play to make you stronger as an individual. This game will make you remember every shot you take or hours spent looking for an animal. I've played on and off as much as I could for over 10 years and have a memory from every hunt. I moved to the middle of nowhere and all the time i didn't play was due to lack of internet capabilities. \r\nTo the people that keep this game going, I have a love and respect for you that I can't explain. I think you are all extremely amazing people and i hope myself and anyone that enjoys wild life and amazing wild places get the chance to see the joy this game can bring to a person's life. I hope that no matter what in life happens that this game is here for people to play, and I hope I can play it until the day I die. \r\nThank you.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "How is this game that old and still better than anything on today’s market? It has such good mechanics and ideas. If this game were made today, it would be the best hunting game on the market - and it wouldn’t even be close. Even though it’s old, it still holds up really well. Okay, I only have a few hours in it, but I can already tell I’m enjoying it way more than the others. Like, how is COTW so much worse? You already had the perfect formula here.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "it’s slow-paced but rewarding. The environments are absolutely gorgeous even for its age",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Really fun and enjoyable. It’s simple, smooth, and entertaining, with great gameplay and good vibes all around. Addictive and satisfying, I keep coming back for more. Overall, a solid game that’s fun, relaxing, and has just the right amount of challenge.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "If you enjoy a slow-paced, realistic hunting experience, give it a try. There's a steep learning curve, but the satisfaction of a successful hunt is well worth it. Prepare for long walks and misses, but enjoy beautiful scenery and wildlife.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Muito bom, pode ser um pouco difícil de se adaptar, mas depois de 1 horinha você já entendeu como funciona e é só diversão",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "game is epic and insane graphics compared to what it was originally upon release. Still prefer over call of the wild any time any day",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Amazing game man love huntinf and mechanics of it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoy playing the game with other people. A few bundles with two person tree stands would be nice though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you’ve ever wanted to channel your inner hunter without leaving your house, theHunter Classic is basically a wildlife safari on steroids. 🦌🎯\nThe game nails realism: 45 species with authentic behaviors, massive open worlds from the Louisiana swamps to the Austrian Alps, and day/night cycles plus dynamic weather that make every hunt feel alive. Weapons range from crossbows to sniper rifles, and even your tracking skills actually matter—spot the tracks, line up the shot, and savor that satisfying “ding” when you bag the perfect trophy.\nCo-op with friends makes it even better: plan a hunt, track your prey, and compare trophy shots. The community is huge and friendly, full of tips, stories, and brag-worthy achievements. And the best part? A ton of content is free to start, so you can dive in immediately.\nBasically: theHunter Classic is a masterclass in hunting realism and patience, with just enough thrill to keep your heart racing. 10/10, my trophy lodge is growing, and I haven’t left my chair once. 🏹🌲",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Hunter Call of the Wild is prob my fave game but this is prob 3rd or 4th it is more relistic i know i spelled that wrong sorry but any way and harder but over all I recemend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very real hunter game, better than COTW, if they could merge the Graphics of COTW to this game or the mechanic to COTW that will be a hit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. Hunting is just so relaxing and the open world is so beautiful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра theHunter Classic – это реалистичный и захватывающий симулятор охоты, который погружает в огромные и красивые открытые миры. Графика хоть и не самая современная, но создает атмосферу дикой природы. Физика поведения животных правдоподобна, а искусственный интеллект заставляет действительно выслеживать добычу.\n\nЗдесь нет быстрого экшена, это охота, требующая терпения, планирования и глубокого знания местности и повадок зверей. Система прокачки позволяет улучшать навыки и открывать новое снаряжение, что добавляет глубины геймплею.\n\nНесмотря на то, что игра является бесплатной, внутриигровые покупки влияют на скорость прогресса, и это может быть немного раздражающим. Однако, даже без вложений можно получить массу удовольствия от процесса. TheHunter Classic – это игра для тех, кто ценит реализм, стратегию и атмосферную охоту в дикой природе. Рекомендую!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excited because new engine is coming to the game and cant wait to see the new content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so atmospheric, it really feels like I am actually walking around in the wilderness. It is beautiful and satisfying. The animal behaviour is so real and the hunting dynamics are extremely rewarding to play. The scenery is stunning, hunting is fun to play. I just keep coming back to it again and again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool game, teaches you about hunting, skill, ect!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game its free worth a try but its only hard at first after that when u learn how to play the game it becomes super fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the scenery and the amount of animals that I am able to hunt.  It doesn't matter if I hunt with friends or alone I enjoy it every time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "back in the early days is was very pay to play, now with the introduction of endless rerunable missions, getting anything you want is very easy, you just need to know how to hunt correctly. it's therapeutic to just walk in on the maps, but if your not into hunting games in general, i dont think this will change that. it needs updating and integration with higher refresh rate monitors and better mouse input systems, overall a solid game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful game to Grind. Can get expensive but with 30$ you could have lots of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game, I'm a hunter in real life and it is a great to kill the time between season.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing. its realistic, fun, and free! Highly recomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was aggravating at first, to find out it’s basically pay to upgrade unless you want to grind for months to get a gun capable of shooting most animals, and mostly finding female animals that get you no in game currency for killing. But once you learn what you can kill and get points for and what to look for it’s a pretty amazing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game! it is not pay to win but it does take time to progress without paying, they gotta make money somehow",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game iv always liked it i play the hunter call of the wild more now but i revisit this every once and a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its hard to play without spending money but if you do spend its pretty fun and enjoyable. doing the missions will help alot with making money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this for a while now, and I can confidently say that it's worth trying IF you have the time and the money. This game does progress slowly if you don't do missions or competitions, and not spend a dime. But after that, the game gave me fond memories of me and my gf playing this. \r\n\r\nAlso be careful, this game is old and newer pc's do sometimes break stuff, specifically graphic drivers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game, it’s hard yet rewarding! I’ve played the game for many years and I always return!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "well lil outdated but fun some times. but when you chase an elk for 30 min. and you find that fucker dead becouse of the wolfes. just fun. and at the end you cat find that wolfes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Итак. Зачем скачал the hunter classic? Потому что, потратив тысячи часов в cotw и зациклившись на поиске алмазов, со временем понял, что cotw хоть и красивая игра, но это аркада со специально сломанным балансом оружия, статичными неопасными хищниками (кроме тигра) и кашей из животных, где главная фишка игры это, безостановочно вопящие утки и гуси. Если у вас сложились подобные чувства, а играть в игры про охоту еще хочется, продолжайте читать. Что слышал про the hunter до того, как скачал: 1) Лучший симулятор охоты. 2) Каждое оружие уникально. 3) Донатная помойка, где шагу не ступить без реальных денег. Что в итоге. Без вариантов, это лучший симулятор охоты. По сути, предтеча cotw с которой разрабы взяли карты, животных, оружие и сделали хоть и красивую, но аркадную игру со специально слабыми винтовками калибра 243, 30-30, 45-70, 270, 6.5 и лосем-танком. Собственна ради этих калибров, я и поперся в classic. Почему это лучший симулятор охоты? Потому, что тут не получится схватить винтовку и начать шмалять с 300+ метров во все что движется, накидав столько тушек, не сходя с места, что потом лень собирать. Здесь вы почувствуете реальность как она есть. Как в детстве с батей, ну или когда вы сами стали охотником. Когда ходишь-ходишь, чета слышишь следы видишь, а ничего не находишь. Если вы торопышка, мало времени, и слово медиативность вам непонятно, лучше даже не пытайтесь. Сгоревший пукан вам обеспечен. Здесь даже бегать нельзя. Не спеша или на карачках, вы час за часом ползете по местности, ища хорошего рогача или хищника, чтоб заработать немного больше, чем разочарование в себе. И самый ваш страшный враг, это кабаны, убивающие вас одним ударом. Здесь вообще все убивают вас одним ударом. Гризли, быки, кабаны. Если нет аптечки или места для нее, море эмоций гарантированно. Оружие, это второе ради чего стоит начать играть в classic. Оружие все самодостаточно, если можно так сказать, по мощности похоже на реальное и каждая винтовка дает те самые чувства, что вы от нее ждали. Это то, чего так не хватает в cotw, где базовые 30-30 и 270 специально сделаны чуть мощнее детской рогатки. Но вот получить новое оружие быстро, это часть номер три, она же «донатная помойка» или тяжкий труд за копейки. Хотя сильно боятся не стоит. Базовый 243 на самом деле хорошая винтовка, в отличие от cotw, и лупит будь здоров по белохвосту, чернохвосту, мулу, лани, козам и мелким хищникам. Пуля 12 калибра легко валит elk, лося и даже гризли, метров с 50. Так что таких проблем с базовым оружием, как в cotw, тут вообще нет. Ну и, я так и не понял, что там с лицензиями, про которые часто пишут в guides. Может что то не так делал, но в одиночном режиме, я играю на всех картах и никого убить без лицензии мне не запрещают. Может не разобрался просто, но пока так. Местный графоний кстати тоже не плох и у олдов может вызвать даже ностальгию. Такие приятные ламповые чувства. Особенно в Австралийской карте в джунглях. Когда, глядя на местные красоты вас начинают накрывать вьетнамские флешбэки. Так и ждешь, когда со всех щелей полезут вьетконговцы. В общем, охота на 10 из 10.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "This game has dark patterns that would make a korean mmo dev giggle. 10-30 gm per kill and but yet anything you want out of the store is 10k+. its crazy that there are people defending this crap, its no suprise a game wants you to spend money but these guys expect you to either open your wallet or be brain dead enough to play for 200+hrs before you can buy a scope",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "never have I wanted to refund a free game... untill now\nthe tutorial deer didnt even render properly and my pc is far above the recomended specs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pretty meh game, you cant change controls or sensitivity so your stuck with crappy default controls, graphics are decent but scope is all over the place. 3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A really terrible game that requires a bunch of micro-transactions. However, even with those, I can't see how this would be fun. Lots of aimless walking around. I shot something with the correct caliber and it gave me zero in-game money, which is already worthless as it is. Don't bother.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "it does not allow to play the actuall game and crashes on start",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is so ass it’s honestly painful. the community is completely braindead, running around the empty fields like they’ve never touched a functioning brain cell in their lives. half of these people should seriously go outside instead of wasting their time on this shit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A walking simulator with no character and doesnt fit your screen so you have to play windowed which looks awful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Somehow runs worse for me then Call of the Wild?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i cant get to the fucking deer , i hate this shit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's very bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its so boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im played 3.5 hours i havent killed anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mostly pay to win lol imo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No animal what tha hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to state upfront I am not down voting this game because I think the game play is bad.  I think this is an amazing hunting sim.  The reason I don't recommend this game is because of how the cash shop works.  Yes it is free to play but the grind is painful compared to other hunting sims vs time invested into your hunt.  The hunts can take anywhere from fifteen minutes to over an hour and you don't get much free currency for your efforts.  The missions aren't much better and can take just as long to complete.  Combine this with high cost on the items in the market if you want to get them for free.\r\n\r\nThis is why I haven't been able to get into the game despite the challenge and the excellent hunting.  The game is extremely grindy and you will have to chose between this and other games.  If you want to focus on this then I do recommend this but if you have other games you want to play, other hunting sims or a work schedule that doesn't give you much time to play this isn't the game for you.   I would 100% come back if they lowered the bar to entry in the game via the in game shop so please don't take this as I am trying to make the game sound bad.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game has dark patterns that would make a korean mmo dev giggle. 10-30 gm per kill and but yet anything you want out of the store is 10k+. its crazy that there are people defending this crap, its no suprise a game wants you to spend money but these guys expect you to either open your wallet or be brain dead enough to play for 200+hrs before you can buy a scope",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Downloaded to play a hunting game for some peace and experience. Tried launching several times and crashes every time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So, while the game play is probably the best for a hunting game.  Everything else is pure garbage.\r\nCurrent Steam Charts are saying the game averages around 475 active monthly players.\r\n\r\nNew Official Discord server that has no moderation.  The game is advertised to be free to play,  but everything is overpriced for in game currency.  There have been tons of suggestions made via discord to make the game more appealing to new players but they don't get read by the dev team (a 3d art studio is claimed to be the active dev)  and everything gets drowned in \"the game doesn't need this\" by a handful of discord dwellers that just sit on there to try and start arguments (moderation team allows this).  \r\n\r\n\"But they run weekly sales!\"  those sales only apply to the pay to win currency.\r\n\r\n\"Just grind missions! it only take 1.5 mission packs to afford a gun!\"  while this is true, you will have to shell out money for it despite being free to play.  And to do that 1.5 mission packs discord says you can do that in 24 hours!  No, no where close to true.  When I started it took well over a week to even be close to affording a gun that I could do 1 mission with, then it never got used again because it sucked.\r\n\r\n\"They take suggestions to better the game!\"... no.  Their discord is where suggestions go to die without being acknowledged by developers let alone server admin or moderators.  Unless the admin wants to approve a post on your suggestion that says you are wrong.  that's something?  I guess?\r\n\r\nIt boils down to EW made probably the best hunting game ever, and it's been on life support for years now and has an art studio/advertising company claimed as the developer.  Unless you want to sink about 400 hours into the game to be able to afford about 1/3 of the guns, 1/8th the camo required, go elsewhere.  I hear Skyrim has a better hunting experience that COTW and won't try to empty your wallet like EW does.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Attempted to play the game and during the tutorial- the deer was invisible aside from the antlers. I had to shoot it blind... which I made an amazing shot! So when starting the game, I struggle to track, but finally figured it out. I had like 9 marks on the ground and was hearing noises, but for the life of me COULD NOT SEE ANYTHING. So Idk if the game is bugged... or stuff was glitched to be invisible, but I gave up.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it does not allow to play the actuall game and crashes on start",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pretty meh game, you cant change controls or sensitivity so your stuck with crappy default controls, graphics are decent but scope is all over the place. 3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A really terrible game that requires a bunch of micro-transactions. However, even with those, I can't see how this would be fun. Lots of aimless walking around. I shot something with the correct caliber and it gave me zero in-game money, which is already worthless as it is. Don't bother.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It just starts as a black screen and won't boot 9/10\n\n\n\"Father and son outing and How!\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I only just finished the tutorial but here is my opinion.\n\nWeapon sway is outrageous. Movement is slow and clunky. Oh guess what, the game barely gives any movement help. I spent like 25% of the tutorial on the ground crawling because there was no way to look up the keybindings to figure out how to stand back up. \nW,A,S,D standard movement\n\"C\" toggle run/sprint\n\"Ctrl\" crouch - x2 lay down\n\"hold \"W\" and push \"Shift\" to stand up\n\"Tab\" opens up gps - x2 map\n\"#'s\" hotkeys for gear (weapon, calls etc)\n\"spacebar\" with weapon aimed down sight (ADS) is holding breath for like 3 seconds at most. \n\nThis is my rage quit notification. hopefully the dev's or the next new player can use this info to make their game a better play through.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the game is bugged as hell, it does not register the pressing of stuff it asks.\nin the tutorial it states \"go to the dome\" when it's actually the little dumb circle on the floor.\nI regret downloading this game....",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is very bad and has nothing to do with hunting at all. no quality or even good setting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would play this game if there was a way to actually play it offline so you didn't have to rely on the servers going down one day and losing all of your progress.  That is why I still occasionally play COTW since it can be played offline since there are save files and profiles.  COTW has aged badly though and all the devs do now is rely on PicSoul to moderate their steam forums while they release mediocre DLC instead of making their game look better and increase the view distance for animals.\n\nMaybe one day if they unban me from the Steam Forums I'll give them a fair shake, but my opinion has been tainted for at least 4+ years now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "nearly unplayable, 90%+ pay to win and needs a third party account as well",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is strange... The screen resolution cannot be adjusted, as well as the graphics settings!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Barely works, deer in the tutorial was invisible. Not worth trying tbh",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game does not load anything but dashboard can not play at all on a new laptop that is more than able to handle the requirements for hardware. Support page shows 404 error page can not be found have tried uninstalling reinstalling restarting computer nothing works.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "esta puta mierda de juego no se launchea y es una puta mierda de las  mayores mierdas de juegos de puta polla de la historia , me cago en su puta madre hijos de puta de developers de juego",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "game sucks, launched on ultra graphic settings, even my grandmas tv has better graphics than this shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lol i roamed 2 straight hours never to find a single living being. 0/10, straight bullshit no bullets shot. call me noob but if the game mechanics forces you to track without bumping into one single animal even by chance. its a waste of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so ass it’s honestly painful. the community is completely braindead, running around the empty fields like they’ve never touched a functioning brain cell in their lives. half of these people should seriously go outside instead of wasting their time on this shit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "worst game i fucking have ever fucking came upon. See a deer, shot. BUT OH, YOU SHOT HIM WITH A RIFLE THAT FOR SOME FUCKASS REASON DOESNT LET YOU LOOT IT. AND ITS A FUCKING FEATURE TOO. Second, wanna run? No thanks, you run 1 mph and walk a quarter of that, the worst part, if you run, every fucking animal in a 20 mile vicinity just hears you and starts running. fuck your game, fuck your studio, go fuck yourself retarded game studio.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A walking simulator with no character and doesnt fit your screen so you have to play windowed which looks awful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is really bad, the mechanics suck and the graphics are shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not even have able to start it, its just crashing all of the time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "u wont let me out of crouch and i cant go into full scree",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant even play like i spamming start now but it does not work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it took to long to get this resolution right for this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is honestly just the worst, i feel ripped for what i paid for this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "where to buy bleach? I need it after that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somehow runs worse for me then Call of the Wild?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i cant get to the fucking deer , i hate this shit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's very bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its so boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im played 3.5 hours i havent killed anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mostly pay to win lol imo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too old",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No animal what tha hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to state upfront I am not down voting this game because I think the game play is bad.  I think this is an amazing hunting sim.  The reason I don't recommend this game is because of how the cash shop works.  Yes it is free to play but the grind is painful compared to other hunting sims vs time invested into your hunt.  The hunts can take anywhere from fifteen minutes to over an hour and you don't get much free currency for your efforts.  The missions aren't much better and can take just as long to complete.  Combine this with high cost on the items in the market if you want to get them for free.\r\n\r\nThis is why I haven't been able to get into the game despite the challenge and the excellent hunting.  The game is extremely grindy and you will have to chose between this and other games.  If you want to focus on this then I do recommend this but if you have other games you want to play, other hunting sims or a work schedule that doesn't give you much time to play this isn't the game for you.   I would 100% come back if they lowered the bar to entry in the game via the in game shop so please don't take this as I am trying to make the game sound bad.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game has dark patterns that would make a korean mmo dev giggle. 10-30 gm per kill and but yet anything you want out of the store is 10k+. its crazy that there are people defending this crap, its no suprise a game wants you to spend money but these guys expect you to either open your wallet or be brain dead enough to play for 200+hrs before you can buy a scope",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Downloaded to play a hunting game for some peace and experience. Tried launching several times and crashes every time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So, while the game play is probably the best for a hunting game.  Everything else is pure garbage.\r\nCurrent Steam Charts are saying the game averages around 475 active monthly players.\r\n\r\nNew Official Discord server that has no moderation.  The game is advertised to be free to play,  but everything is overpriced for in game currency.  There have been tons of suggestions made via discord to make the game more appealing to new players but they don't get read by the dev team (a 3d art studio is claimed to be the active dev)  and everything gets drowned in \"the game doesn't need this\" by a handful of discord dwellers that just sit on there to try and start arguments (moderation team allows this).  \r\n\r\n\"But they run weekly sales!\"  those sales only apply to the pay to win currency.\r\n\r\n\"Just grind missions! it only take 1.5 mission packs to afford a gun!\"  while this is true, you will have to shell out money for it despite being free to play.  And to do that 1.5 mission packs discord says you can do that in 24 hours!  No, no where close to true.  When I started it took well over a week to even be close to affording a gun that I could do 1 mission with, then it never got used again because it sucked.\r\n\r\n\"They take suggestions to better the game!\"... no.  Their discord is where suggestions go to die without being acknowledged by developers let alone server admin or moderators.  Unless the admin wants to approve a post on your suggestion that says you are wrong.  that's something?  I guess?\r\n\r\nIt boils down to EW made probably the best hunting game ever, and it's been on life support for years now and has an art studio/advertising company claimed as the developer.  Unless you want to sink about 400 hours into the game to be able to afford about 1/3 of the guns, 1/8th the camo required, go elsewhere.  I hear Skyrim has a better hunting experience that COTW and won't try to empty your wallet like EW does.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Attempted to play the game and during the tutorial- the deer was invisible aside from the antlers. I had to shoot it blind... which I made an amazing shot! So when starting the game, I struggle to track, but finally figured it out. I had like 9 marks on the ground and was hearing noises, but for the life of me COULD NOT SEE ANYTHING. So Idk if the game is bugged... or stuff was glitched to be invisible, but I gave up.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "never have I wanted to refund a free game... untill now\nthe tutorial deer didnt even render properly and my pc is far above the recomended specs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pretty meh game, you cant change controls or sensitivity so your stuck with crappy default controls, graphics are decent but scope is all over the place. 3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A really terrible game that requires a bunch of micro-transactions. However, even with those, I can't see how this would be fun. Lots of aimless walking around. I shot something with the correct caliber and it gave me zero in-game money, which is already worthless as it is. Don't bother.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It just starts as a black screen and won't boot 9/10\n\n\n\"Father and son outing and How!\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I only just finished the tutorial but here is my opinion.\n\nWeapon sway is outrageous. Movement is slow and clunky. Oh guess what, the game barely gives any movement help. I spent like 25% of the tutorial on the ground crawling because there was no way to look up the keybindings to figure out how to stand back up. \nW,A,S,D standard movement\n\"C\" toggle run/sprint\n\"Ctrl\" crouch - x2 lay down\n\"hold \"W\" and push \"Shift\" to stand up\n\"Tab\" opens up gps - x2 map\n\"#'s\" hotkeys for gear (weapon, calls etc)\n\"spacebar\" with weapon aimed down sight (ADS) is holding breath for like 3 seconds at most. \n\nThis is my rage quit notification. hopefully the dev's or the next new player can use this info to make their game a better play through.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the game is bugged as hell, it does not register the pressing of stuff it asks.\nin the tutorial it states \"go to the dome\" when it's actually the little dumb circle on the floor.\nI regret downloading this game....",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is very bad and has nothing to do with hunting at all. no quality or even good setting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it does not allow to play the actuall game and crashes on start",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is strange... The screen resolution cannot be adjusted, as well as the graphics settings!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Barely works, deer in the tutorial was invisible. Not worth trying tbh",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game does not load anything but dashboard can not play at all on a new laptop that is more than able to handle the requirements for hardware. Support page shows 404 error page can not be found have tried uninstalling reinstalling restarting computer nothing works.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game sucks, launched on ultra graphic settings, even my grandmas tv has better graphics than this shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lol i roamed 2 straight hours never to find a single living being. 0/10, straight bullshit no bullets shot. call me noob but if the game mechanics forces you to track without bumping into one single animal even by chance. its a waste of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "esta puta mierda de juego no se launchea y es una puta mierda de las  mayores mierdas de juegos de puta polla de la historia , me cago en su puta madre hijos de puta de developers de juego",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "worst game i fucking have ever fucking came upon. See a deer, shot. BUT OH, YOU SHOT HIM WITH A RIFLE THAT FOR SOME FUCKASS REASON DOESNT LET YOU LOOT IT. AND ITS A FUCKING FEATURE TOO. Second, wanna run? No thanks, you run 1 mph and walk a quarter of that, the worst part, if you run, every fucking animal in a 20 mile vicinity just hears you and starts running. fuck your game, fuck your studio, go fuck yourself retarded game studio.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so ass it’s honestly painful. the community is completely braindead, running around the empty fields like they’ve never touched a functioning brain cell in their lives. half of these people should seriously go outside instead of wasting their time on this shit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A walking simulator with no character and doesnt fit your screen so you have to play windowed which looks awful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is really bad, the mechanics suck and the graphics are shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not even have able to start it, its just crashing all of the time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "u wont let me out of crouch and i cant go into full scree",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant even play like i spamming start now but it does not work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it took to long to get this resolution right for this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is honestly just the worst, i feel ripped for what i paid for this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "where to buy bleach? I need it after that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somehow runs worse for me then Call of the Wild?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i cant get to the fucking deer , i hate this shit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's very bad game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its so boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "im played 3.5 hours i havent killed anything",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "mostly pay to win lol imo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No animal what tha hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to state upfront I am not down voting this game because I think the game play is bad.  I think this is an amazing hunting sim.  The reason I don't recommend this game is because of how the cash shop works.  Yes it is free to play but the grind is painful compared to other hunting sims vs time invested into your hunt.  The hunts can take anywhere from fifteen minutes to over an hour and you don't get much free currency for your efforts.  The missions aren't much better and can take just as long to complete.  Combine this with high cost on the items in the market if you want to get them for free.\r\n\r\nThis is why I haven't been able to get into the game despite the challenge and the excellent hunting.  The game is extremely grindy and you will have to chose between this and other games.  If you want to focus on this then I do recommend this but if you have other games you want to play, other hunting sims or a work schedule that doesn't give you much time to play this isn't the game for you.   I would 100% come back if they lowered the bar to entry in the game via the in game shop so please don't take this as I am trying to make the game sound bad.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game has dark patterns that would make a korean mmo dev giggle. 10-30 gm per kill and but yet anything you want out of the store is 10k+. its crazy that there are people defending this crap, its no suprise a game wants you to spend money but these guys expect you to either open your wallet or be brain dead enough to play for 200+hrs before you can buy a scope",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Downloaded to play a hunting game for some peace and experience. Tried launching several times and crashes every time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So, while the game play is probably the best for a hunting game.  Everything else is pure garbage.\r\nCurrent Steam Charts are saying the game averages around 475 active monthly players.\r\n\r\nNew Official Discord server that has no moderation.  The game is advertised to be free to play,  but everything is overpriced for in game currency.  There have been tons of suggestions made via discord to make the game more appealing to new players but they don't get read by the dev team (a 3d art studio is claimed to be the active dev)  and everything gets drowned in \"the game doesn't need this\" by a handful of discord dwellers that just sit on there to try and start arguments (moderation team allows this).  \r\n\r\n\"But they run weekly sales!\"  those sales only apply to the pay to win currency.\r\n\r\n\"Just grind missions! it only take 1.5 mission packs to afford a gun!\"  while this is true, you will have to shell out money for it despite being free to play.  And to do that 1.5 mission packs discord says you can do that in 24 hours!  No, no where close to true.  When I started it took well over a week to even be close to affording a gun that I could do 1 mission with, then it never got used again because it sucked.\r\n\r\n\"They take suggestions to better the game!\"... no.  Their discord is where suggestions go to die without being acknowledged by developers let alone server admin or moderators.  Unless the admin wants to approve a post on your suggestion that says you are wrong.  that's something?  I guess?\r\n\r\nIt boils down to EW made probably the best hunting game ever, and it's been on life support for years now and has an art studio/advertising company claimed as the developer.  Unless you want to sink about 400 hours into the game to be able to afford about 1/3 of the guns, 1/8th the camo required, go elsewhere.  I hear Skyrim has a better hunting experience that COTW and won't try to empty your wallet like EW does.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Attempted to play the game and during the tutorial- the deer was invisible aside from the antlers. I had to shoot it blind... which I made an amazing shot! So when starting the game, I struggle to track, but finally figured it out. I had like 9 marks on the ground and was hearing noises, but for the life of me COULD NOT SEE ANYTHING. So Idk if the game is bugged... or stuff was glitched to be invisible, but I gave up.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "never have I wanted to refund a free game... untill now\nthe tutorial deer didnt even render properly and my pc is far above the recomended specs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pretty meh game, you cant change controls or sensitivity so your stuck with crappy default controls, graphics are decent but scope is all over the place. 3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A really terrible game that requires a bunch of micro-transactions. However, even with those, I can't see how this would be fun. Lots of aimless walking around. I shot something with the correct caliber and it gave me zero in-game money, which is already worthless as it is. Don't bother.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It just starts as a black screen and won't boot 9/10\n\n\n\"Father and son outing and How!\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I only just finished the tutorial but here is my opinion.\n\nWeapon sway is outrageous. Movement is slow and clunky. Oh guess what, the game barely gives any movement help. I spent like 25% of the tutorial on the ground crawling because there was no way to look up the keybindings to figure out how to stand back up. \nW,A,S,D standard movement\n\"C\" toggle run/sprint\n\"Ctrl\" crouch - x2 lay down\n\"hold \"W\" and push \"Shift\" to stand up\n\"Tab\" opens up gps - x2 map\n\"#'s\" hotkeys for gear (weapon, calls etc)\n\"spacebar\" with weapon aimed down sight (ADS) is holding breath for like 3 seconds at most. \n\nThis is my rage quit notification. hopefully the dev's or the next new player can use this info to make their game a better play through.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the game is bugged as hell, it does not register the pressing of stuff it asks.\nin the tutorial it states \"go to the dome\" when it's actually the little dumb circle on the floor.\nI regret downloading this game....",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is very bad and has nothing to do with hunting at all. no quality or even good setting.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}