{
  "positive": [
    {
      "review": "downloaded the game\r\nwent to a bank\r\nkilled the security guards\r\nopened the vault\r\nmilitary kicked in\r\nkilled them all\r\ngot away with the money\r\nwent home and played the game\r\n10/10",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Really fun and heart racing game trying to evade cops while robbing stores, mansions and more i would try it out if i were you!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "i get game play for 30 mints uninstall game then reinstall when i get new pc dont play it for 3 weeks then plays it then takes brake then plays it again 100000 out of 10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is very fun with friends and quite addicting... The maps are complex and leaves me wanting to play more.. 10/10 would recommend..",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "it is a good game and it is fun but it is a little buggy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice and fun game to play with frend but it might not be realistic cause you can shoot 3 time in the head and the swat member will still be alive, same things with armored swat member.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a pretty good game overall, I mean it's meant for low-end pcs. I can get around 220 fps on max settings, and the missions are pretty fun. I just wish  you didn't have to pay for everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is good with friends and mid alone. Dont get me wrong this game is VERY fun but whyyyyyy did they make it so that you have to buy the later maps with a currency that you have to buy with  REAL money [same with  cozmetics but i dont really care about that.] early game and mid game is fun but the same cant be said for late game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun with friends. good and simple game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes very good i love the stealing mechanics making this game so much harder however should post some updates to make getting levels easier",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game, fun to play with friends when you are bored. However, I will admit the progression system isn't the best, and there is still a handful of glitches. I would also enjoy a way to customize you're character without needing to spend money, other than that it's alright. 3.5/5 dumb fun, entertaining, but slow to level and progress and has a few bugs needing ironing out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Woke up\r\nDownloaded this game\r\nWent to the local jewelry\r\nRobbed it\r\nWent home\r\nPlayed this game\r\n10/10 would play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a simple and fun game to play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is really good and the graphics are good two but can we drive off in the game, no. that is the only one bad thing about this game. but, all the rest of the game is really good and you should play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's super fun but it can be annoying when I'm across the map pretty much and a guard hears me shoot a camera. The logic isn't the best, but otherwise the game's super fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "downloaded the game\nwent to a bank\nkilled the security guards\nopened the vault\nmilitary kicked in\nkilled them all\ngot away with the money\nwent home and played the game\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really fun game though wish i could stealth the levels a little eaisier \r\nwish there were like 2 diffiacultys or smth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun game with mostly realistic things like physics ig. The putting things in bag or setting things down can take some time getting used to since its a littly jumpy. And the one swat boss person, I fee like he has a bit too much health but it is a good addon to make the game a bit different. How ever it is a fun game still.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun with friends never played alone but i expect it to be boring alone but overall fun experience with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is alot of fun early game but mid-late game it gets really repitive and pay to win",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its really good and its free. But they should add a little more maps I think :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun with others and surprisingly addictive lol. Guards have their quirks, and I don't think its perfect but overall me and my best friend have been really enjoying it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had a lot of fun playing this game with friends and its so funny just planning it out or just getting caught great time killer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun by myself and hopefully even more fun when i get my friends to play it and a pretty fun grind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but the sad thing is that theres no real fun when theres no actual tools or stuff, its boring that its one handed i wish it was just a normal robbing gaem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for being free its impossible to complet the game without irl money recommend playing with goofy friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun and free Pay Day alternative. Performance could use some work, though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Phenomenal game, Free and multiplayer! My friends and I love how serious yet un-serious the game is. I hope to see some added mechanics like a single use ammo bag (one use per teammate). But outside of a couple bugs, I'd still highly recommend getting you and three friends to play this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game a bit like payday but free and a small storage size i will recommend this but there was a bit of a learning curve but overall 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "We flung a cart full of shit we were stealing into the stratoshpere.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is very entertaining and funny \ngreat to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so fun and nice to play with friends, although would be nice if most of the maps werent locked behind in game purchases but other than that a very good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, but gets repatitive when you know the heists",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game i really like it but I would like for their to be a gun which is silent so you can hear when someone shoots",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best funniest but still serious game ive ever played recommend to get ur friends to join and have a laugh while robbing a bank",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely an amazing game. only downside you'll have to restart over and over again to find some stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, only problem is how fidgety the guns are with surfaces around the player, though i understand why it is how it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very good game and will run well on all pcs and laptops",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Load up game\r\n\r\nStart game\r\n\r\nTake loadout\r\n\r\nGo outside \r\n\r\nStart taking things and putting them in my duffel bag\r\n\r\npolice start chasing me\r\n\r\nI run\r\n\r\nI call friend\r\n\r\nFriend shoot all police\r\n\r\nwe go to our van\r\n\r\nWe go home \r\n\r\nWe buy gun\r\n\r\nWe do same shit again exept more sneaky\r\n\r\n*gets caught by cops\r\n\r\nkill all of them\r\n\r\n10/10 would play again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "片手で戦うPAYDAY3といった感じ。\n\nPAYDAY2・3からインスパイアを受けているが、独自の仕様あったり、あっちと違ってきちんと改善されてる部分もあって楽しい。",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game, highly recommended/Gran juego, muy recomendado",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to play with friends i played for 4 hours straight had tons of fun,free to play and can make your by shooting the AK in the sky to alert the guards i have gotton tons of progress in this game and have had so much fun!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's difficult but really fun and even more fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game! underrated, played it with a friend and it was the best co op game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game but i think they should add more maps, and make getting heist coins through buying and through successful heists (like 50 per successful heist)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty good game considering its free although it can few a bit repetitive after awhile.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, to play alone or with friends, simple, understandable mechanics, the game has microtransactrions that don't make it pay to win, it has lots of content, you really don't get tired of playing, there's always something else that you can do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game about robbing 3d banks and being an asshole trolling the whole lobby full of NPC', damn i wish the jerk Hristo Lesev came back from the hell drinking soda, not taking a shower unitl ddd, BRO STOP PL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good\nthat is a perfect choice to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "clicking is very tiring, also the camera systems are suck. big w for it's only 1 GB and better than payday 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6.7 hours haha\ni love when my friends shoots with the m4 accidentally and ruins the heist we've been working on for like 30mins",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun just needs more things to do since it gets boring after like 30 robberies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Realy fun! But playing it with a friend makes it much better,trust me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1)try to enter\r\n2)get caught\r\nre-do\r\n1) try to sneak from behind the building\r\n2) a guard spot you, get caught\r\nre-do\r\n1)you try again to sneak from behind the building\r\n2)kill the guard\r\n3)another guard find the dead body, get caught\r\nclose the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game but gets repetitive after a bit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game but kinda repetitive after awhile definitely a fun game if you have friends though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing, silly fun packed with your friends' stupidity. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with friends, really hard if only 1 player \r\n6/10 fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one armed jerk and run with friends. fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but i wish most cosmedics we have to buy with real money and i wishh thare wus more money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS IS A GOOD GAME VERY ADDICTING I SPENT TREE HOURS ON THIS GAME MY FIRST PLAY 9-10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One armed robber more like one armed player cuz im jerking it while playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing but i need more maps pls. ill buy them if i have have to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ts game was the best to play with friends bro download it rn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a very good free game its just i think you might need to add a bit more free levels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the worst attempt at a payday game but i somehow have 11 hours on it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I DONT PERSONALLY LIKE THESE TYPES OF GAMES. I FIND THE CONTROLS DIFFICULT AND JANKY, BUT THAT IS THE STYLE AFTER ALL. NOT THE GAMES FAULT,  PURELY OPERATOR ERROR. ITS SIMILAR TO RV THERE YET WITH THE PHYSICS ASPECT. I KNOW ALOT OF PEOPLE LIKE THESE KINDS OF GAMES SO I DEFINETELY WOULD RECOMMEND IT FOR OTHERS, IM JUST TERRIBLE AT THESE TYPES. I WOULD SAY THE  OVERALL REVIEWS ARE PRETTY ACCURATE. AWESOME CONCEPT.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great game when u want to lose a friendship",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun to rob banks and stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "reccomend but theres so many hackers in multiplayer its funny though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun with friends. especially if you're bad at the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good, LOTS of grind. 3.8 stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game more fun with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is a blast with a buddy. very challenging",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With the other hand i jerked off with the other other hand i robbed. 9/10 I do it again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bro its so fun robbing the jewlery store in one armed robber",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is really fun especially with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love one armed robber it changed my life and i pooped myself while i was playing it and i pissed myself cause i got scared.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game for the price of being free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "surprisingly fun. definitely go for the stealth route",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a really fun multiplayer/solo free game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really a good game if u play w ur friends lwk",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game great music more gaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's fun and it's goofy,nothing else to say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "idk what you do with the other hand but it makes it easy to play 2 player",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool  game but most levels held behind paywall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's perfect game for spend time with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good though mechanics can be annoying to deal with somtimes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is a little bit hard but is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun SHORT TERM Game to play with ur friends :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the craziest game ever if you're with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to play with friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very fun game to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game with friends i do recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "c4 master lockpik and gurrd phone cahare no nooed to use radiio",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'ts really fun with friends, 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game if your playing with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its very fun with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its free aucustic child of payday",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I was playing with my hb (who has the mental faculties of toddler with cerebral palsy) and it was torture. nothing on you guys, my friend is just an idiot.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nothing really works in this game everything is clunky and annoying nothing is really explained",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game sucks single player with all lvl 1 gear cant even beat the first lvl",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you litteraly cant play the game its buns no mission is possible without two people or more",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is ass ngl, I played with two of my friends for 20 minutes and we all got bored.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game gets really boring after many heists, and with no new content coming",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun for a small amount of time, i love the whacky style this game has and the idea, but gameplay difficulties like loot not fitting into the duffle bag (art gallery heist), the lack of variety of maps, and the fact that the objectives are repetetive, before you even unlock higer level guns and gear, the game already starts to bore you out, ofcourse the purchase of a new gun and gear could live up the game but the level progesion and the proces of making money is slow for a repetitive enviorment. If the game had more free and unlockable maps, with the level progression made faster the game could entertain you for a lot more time. \n\nwould recomend the game to anyone who wants a short and quick way off killing time with friends.\nwould not recomend to people who want to play heist games for a longer ammount of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game gets boring after awhile because there has been no new content for awhile and once you get the battering ram the game just gets boring doing the same thing over and over again",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i fucking hate this game played it with friends, it's shitty, repetitive and boring AF",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont even waste your time. Physics for items too dam real. Like you pick up the dough and you have to stand over the duffel bag to drop it in and it dont 'snap' into the bag, it's literally loose and moving around, you walk into the bag and it flip over mad easy (which make no sense IRL) and everything spill out, or you try to put money in the bag and it fall to the side. Like aint no way I'm gonna be looting and fighting the police then some player gonna come running into the bag and knock everything over, imma be mad as a mug. Other than the physics seem like a fun game, was making me think of PD2, but like I cant spend all that time tryna get slippery money into a bag that like doing back flips when you touch it, couldnt make it past tutorial",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game lowkey sucks donkey ass, doesnt matter how much you wanna stealth it, the game will do EVERYTHING IN ITS POWER TO STOP YOU. did the first mission, snuck past all the gaurds, disabled cams AND opened the vault without anyone noticing. then a gaurd outside is randomly promted to run PAST ME, GO DIRECTLY UPSTAIRS WHERE A DEAD BODY WAS AT AND SOUND THE ALARM. game is incredibly difficult to solo because they just never stop sending waves and waves of police",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Atrocious FPS and stuttering on a 9070 XT on any settings.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game suckjs single player, stealth and going loud doesnt work, good potential but ive tried to find multiplayer games and its hard, its probably good in multiplayer but without freinds its basically impossible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is good but gets boring when you hit like lvl 10 or smth like that plus it doesnt has much new heists so its boring and you could speedrun a lot of heists in seconds because you just know how to do it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is nice but why do i have to get currency that is locked behind a paywall to get some more missions",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst fucking piece of trash ive ever played \nentire game feels vibe coded\ntutorials CANNOT be completed\nCANNOT even start the \"stealth tutorial\" \nCANT disarm the guards phone... \ncops have the worst ai possible and will just open every door for you.\ncant even scope out a place because whether or not your in a restricted area, carrying nothing. or even just walking out of the van the \"right way\" will get you detected.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ASS GAME\n\nDOES NOT TELL YOU A THING ABOUT THE CONTROLS. AND IT IS VERRY MESSY CONTROLS.\n\nDISCLAMER DO NOT PLAY THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck this piece of shit game it ruined my life I no longer want to live fuck one armed robber it killed my dog.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Have to kill never ending amounts of swat to be able to get any money and thats all it is.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is alot harder than it really should be. not easy or fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game iss stupid difficult \r\ndont waste your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "matchmaking still doenst work, just sad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s ok. Just sorta a poverty gun game ig.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "payday 2 but in unity this fucking sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am too good at game, it very boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the challenge comes from the jank",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There are too less maps to play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Im bad so game bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is not very good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant join 1 game online",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "H3h3 funn3h",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game gave me aids. I tried playing this game to see how black people felt, but for some reason they did not add any buffs to the black people. this made me extremely angry. I played this game with my son who has down syndrome, evil autisim, cerebal palsy and aids, he found it extreemmmly difficult to use the characters, quote \" AAAAAAAAAAAAAAAHHYHHHDGGHGHBHGHFBBBB\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ahh game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i want to kill myself now",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I CENT PLY  WITHE MULTIPLAYER",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I DONT LIKE IT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "please just play payday 2",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "they had two arms...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ai is so ***",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no. just no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hello... In the wine place where you collect all of the wine makes me go crazy I had to collect so much wine that I get triggered when I see or hear the word now. And dont get me started about all of the dead swat officers, my pc almost exploded and sent my house aflame, I now have nightmares and visions about this moment when I collected wine for 2 hours straight. Please refund me of my time and energy. By the time I finished this level I aged like a bottle of wine, I swear I could see my GPU ascending into the sky. My PC fans started spinning so fast It almost generated enough thrust to leave the atmosphere. My GPU started screaming in a language humans yet to discover. I genuinely think I'd rather mow a soccer field using a scissor than ever go through this again. I could hear my GPU talking to me telling me its \"all my fault\". Im now retired with no money because I was busy picking up wine bottles.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "naaaaaah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "123",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I spent an hour getting fictional wine bottles one by one for 132,000 fake dollars on my night off. I have clinical PTSD every time I see wine. My pc was about to blow shards of glass in my head because of how much dead swat members that were present on my screen. This game gave me hepatitis, aids, and every sexually transmitted disease known on the planet and maybe even have created my own. I hope the creator gets swatted. New bacteria has grown on my dingus and I wouldn’t wish this pain on anyone except Mr.Benito. The creator owes me money for playing this game. By the time this message is being written I’ve contracted schizophrenia, lost custody of my kids, and my wife cheated on me. I have a better chance at convincing my son to take a shower than to be sane again after playing this game for the longest 4 hours of my life. I’d rather listen to cousin Muhammad and his tribe set in the country of Bulgaria talk about how cousin Muhammad is the third coming of the Messiah and how his magical fungal growth on his wiener gave him super knowledge while he tries to plug his telekinetic energy absorbing foreskin into all the outlets in my house because he claims it charges my phone faster, again (yes this has happened more than once) like no Muhammad your penis is not magical, you just have one the size of a horse’s third leg that has mushrooms growing on it, which led to so much blood flow to it so you’re brain doesn’t get enough and the only magical thing you gained was the ability to onset dementia at the speed of my neurons decaying and an unreal case of autism. Thank you for reading this, I’m getting wheeled to the asylum now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I hate wine bottles. Never buy this game. I hope the person who made this game, deletes it and gets swatted by juggernauts with wine bottles as weapons. Never download this unless your some masochist or really likes wine. I spent an hour with my friends wanting to break a wine bottle over my head and i now have PTSD, Down Syndrome, Autism, aids, arthritis. My PC was running at 10fps and i never want to even look at wine again.PS I got the Aids from the wine bottle. I think if i could either have 1 billion dollars or see or touch a bottle of wine again i'd kill myself. I'm having hallucinations and everything is now a bottle of wine. If i see the creator of this game hes getting jumped including his entire family. I am now schizophrenic and my wife left me and my parents disowned me and removed me from their will. My family thinks im crazy and they're sending me to a mental institute. I would so much rather count every single grain of sand in this world than to even click play on this godforsaken game ever again. Don't buy this or you'll get swatted with wine bottles and probably gets aids from it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cool game but cant seem to stay in a multiplayer lobby. lags out instantly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was playing with my hb (who has the mental faculties of toddler with cerebral palsy) and it was torture. nothing on you guys, my friend is just an idiot.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nothing really works in this game everything is clunky and annoying nothing is really explained",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game sucks single player with all lvl 1 gear cant even beat the first lvl",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you litteraly cant play the game its buns no mission is possible without two people or more",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is ass ngl, I played with two of my friends for 20 minutes and we all got bored.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game gets really boring after many heists, and with no new content coming",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun for a small amount of time, i love the whacky style this game has and the idea, but gameplay difficulties like loot not fitting into the duffle bag (art gallery heist), the lack of variety of maps, and the fact that the objectives are repetetive, before you even unlock higer level guns and gear, the game already starts to bore you out, ofcourse the purchase of a new gun and gear could live up the game but the level progesion and the proces of making money is slow for a repetitive enviorment. If the game had more free and unlockable maps, with the level progression made faster the game could entertain you for a lot more time. \n\nwould recomend the game to anyone who wants a short and quick way off killing time with friends.\nwould not recomend to people who want to play heist games for a longer ammount of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game gets boring after awhile because there has been no new content for awhile and once you get the battering ram the game just gets boring doing the same thing over and over again",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i fucking hate this game played it with friends, it's shitty, repetitive and boring AF",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont even waste your time. Physics for items too dam real. Like you pick up the dough and you have to stand over the duffel bag to drop it in and it dont 'snap' into the bag, it's literally loose and moving around, you walk into the bag and it flip over mad easy (which make no sense IRL) and everything spill out, or you try to put money in the bag and it fall to the side. Like aint no way I'm gonna be looting and fighting the police then some player gonna come running into the bag and knock everything over, imma be mad as a mug. Other than the physics seem like a fun game, was making me think of PD2, but like I cant spend all that time tryna get slippery money into a bag that like doing back flips when you touch it, couldnt make it past tutorial",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game lowkey sucks donkey ass, doesnt matter how much you wanna stealth it, the game will do EVERYTHING IN ITS POWER TO STOP YOU. did the first mission, snuck past all the gaurds, disabled cams AND opened the vault without anyone noticing. then a gaurd outside is randomly promted to run PAST ME, GO DIRECTLY UPSTAIRS WHERE A DEAD BODY WAS AT AND SOUND THE ALARM. game is incredibly difficult to solo because they just never stop sending waves and waves of police",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Atrocious FPS and stuttering on a 9070 XT on any settings.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game suckjs single player, stealth and going loud doesnt work, good potential but ive tried to find multiplayer games and its hard, its probably good in multiplayer but without freinds its basically impossible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is good but gets boring when you hit like lvl 10 or smth like that plus it doesnt has much new heists so its boring and you could speedrun a lot of heists in seconds because you just know how to do it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is nice but why do i have to get currency that is locked behind a paywall to get some more missions",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst fucking piece of trash ive ever played \nentire game feels vibe coded\ntutorials CANNOT be completed\nCANNOT even start the \"stealth tutorial\" \nCANT disarm the guards phone... \ncops have the worst ai possible and will just open every door for you.\ncant even scope out a place because whether or not your in a restricted area, carrying nothing. or even just walking out of the van the \"right way\" will get you detected.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ASS GAME\n\nDOES NOT TELL YOU A THING ABOUT THE CONTROLS. AND IT IS VERRY MESSY CONTROLS.\n\nDISCLAMER DO NOT PLAY THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck this piece of shit game it ruined my life I no longer want to live fuck one armed robber it killed my dog.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Have to kill never ending amounts of swat to be able to get any money and thats all it is.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is alot harder than it really should be. not easy or fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game iss stupid difficult \r\ndont waste your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "matchmaking still doenst work, just sad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s ok. Just sorta a poverty gun game ig.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "payday 2 but in unity this fucking sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am too good at game, it very boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the challenge comes from the jank",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There are too less maps to play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Im bad so game bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is not very good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant join 1 game online",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "H3h3 funn3h",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game gave me aids. I tried playing this game to see how black people felt, but for some reason they did not add any buffs to the black people. this made me extremely angry. I played this game with my son who has down syndrome, evil autisim, cerebal palsy and aids, he found it extreemmmly difficult to use the characters, quote \" AAAAAAAAAAAAAAAHHYHHHDGGHGHBHGHFBBBB\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ahh game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i want to kill myself now",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I CENT PLY  WITHE MULTIPLAYER",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I DONT LIKE IT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "please just play payday 2",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "they had two arms...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ai is so ***",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no. just no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hello... In the wine place where you collect all of the wine makes me go crazy I had to collect so much wine that I get triggered when I see or hear the word now. And dont get me started about all of the dead swat officers, my pc almost exploded and sent my house aflame, I now have nightmares and visions about this moment when I collected wine for 2 hours straight. Please refund me of my time and energy. By the time I finished this level I aged like a bottle of wine, I swear I could see my GPU ascending into the sky. My PC fans started spinning so fast It almost generated enough thrust to leave the atmosphere. My GPU started screaming in a language humans yet to discover. I genuinely think I'd rather mow a soccer field using a scissor than ever go through this again. I could hear my GPU talking to me telling me its \"all my fault\". Im now retired with no money because I was busy picking up wine bottles.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "naaaaaah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "123",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I spent an hour getting fictional wine bottles one by one for 132,000 fake dollars on my night off. I have clinical PTSD every time I see wine. My pc was about to blow shards of glass in my head because of how much dead swat members that were present on my screen. This game gave me hepatitis, aids, and every sexually transmitted disease known on the planet and maybe even have created my own. I hope the creator gets swatted. New bacteria has grown on my dingus and I wouldn’t wish this pain on anyone except Mr.Benito. The creator owes me money for playing this game. By the time this message is being written I’ve contracted schizophrenia, lost custody of my kids, and my wife cheated on me. I have a better chance at convincing my son to take a shower than to be sane again after playing this game for the longest 4 hours of my life. I’d rather listen to cousin Muhammad and his tribe set in the country of Bulgaria talk about how cousin Muhammad is the third coming of the Messiah and how his magical fungal growth on his wiener gave him super knowledge while he tries to plug his telekinetic energy absorbing foreskin into all the outlets in my house because he claims it charges my phone faster, again (yes this has happened more than once) like no Muhammad your penis is not magical, you just have one the size of a horse’s third leg that has mushrooms growing on it, which led to so much blood flow to it so you’re brain doesn’t get enough and the only magical thing you gained was the ability to onset dementia at the speed of my neurons decaying and an unreal case of autism. Thank you for reading this, I’m getting wheeled to the asylum now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I hate wine bottles. Never buy this game. I hope the person who made this game, deletes it and gets swatted by juggernauts with wine bottles as weapons. Never download this unless your some masochist or really likes wine. I spent an hour with my friends wanting to break a wine bottle over my head and i now have PTSD, Down Syndrome, Autism, aids, arthritis. My PC was running at 10fps and i never want to even look at wine again.PS I got the Aids from the wine bottle. I think if i could either have 1 billion dollars or see or touch a bottle of wine again i'd kill myself. I'm having hallucinations and everything is now a bottle of wine. If i see the creator of this game hes getting jumped including his entire family. I am now schizophrenic and my wife left me and my parents disowned me and removed me from their will. My family thinks im crazy and they're sending me to a mental institute. I would so much rather count every single grain of sand in this world than to even click play on this godforsaken game ever again. Don't buy this or you'll get swatted with wine bottles and probably gets aids from it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cool game but cant seem to stay in a multiplayer lobby. lags out instantly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was playing with my hb (who has the mental faculties of toddler with cerebral palsy) and it was torture. nothing on you guys, my friend is just an idiot.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nothing really works in this game everything is clunky and annoying nothing is really explained",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}