{
  "positive": [
    {
      "review": "The game is mostly successful due to the void of the category on steam, and it would be a lot better if they made the strike zone more dynamic rather than a ball garunteed to be either a dinky grounder or a foul ball, regardless of how close the ball is to the strike zone, it just makes it less immersive and more frusterating as a hitter. I do enjoy the pitching and general progression of the game though, it is very p2w but it is possible to take it slowly and progress. The overall team building of the game is where it shines though, as it can be very engaging to make the best team possible. Also, if I had to change one thing about the game, it would be making the league mode teams actually perform to the reccommended OVR that it says on the UI, for reference the Champion 2 league option has a reccommended OVR of 115, however some of the highest teams in the mode will have OVRs of 128, it just doesnt make any sense and it is frusterating to me as a player since my OVR is about 124 and I cant progress past a challenge mode supposedly made for players at 115 OVR. But the game is pretty solid overall.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The game is really good & suitable for vast people. You can either being F2P or whales but the game still give you good stuffs. The only flaw is that I want sth like The Show's mechanic, but's it's completely ok. Worth playing for a long time. Hope the dev would add the retain function so that I can take back my materials that I've put before",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great MLB game on Steam. I love the player acquisition mechanics. Graphics are pretty good too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great\nI've been looking for a sports game that I would enjoy for a long time\nAt first I didn't understand the overall interface, but the more I play, the more I like this title\nI plan to create a team and compete with other players for the championship",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't think it comes anywhere close to being as good as MLB games on Playstation, but this is probably the best you could get for free on PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a really cool free PC game for baseball fans. Though the progress for F2P players is quite slow, I got 120 OVR within half a year without spending any money. If you enjoy baseball try this game out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill game best played whilst weaving in work or when you wanna cool down. The latter isn't applicable to ranked slugger.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not a baseball fan but after playing this video game I'm interested. The visuals are good and the controls are straight forward. This is an awesome game to play and pass the time with. It's fun and the numerous features will keep you hooked. With a few tweaks and upgrades this game would be outstanding. Even if you don't like baseball this video game is worth checking out! Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game! the ability to create your own teams is cool and I think this game should be more popular.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's basically a mobile game with a TON of in-game purchasing options. You will never be great in this game if you don't spend A LOT of money but if you like baseball and just want some chill clicker/collection game then it's nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While on its face its basically just a gacha-style mobile game, because it is, if you just ignore that part you can play the game without spending a cent and have a genuinely good time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you have the best game ever i love it and it helps me think how i should play baseball in real life because i am going into livearm. So thank you for creating this game it has motivated me to keep going in baseball in real life instead of just giving up, so thank you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good. also graphics are bad cuz it was meant to be a mobile game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its free!!!! After you turn of all the automatic BS then its an actual baseball game that you would imagine. Not going to lie the auto stuff is super annoying and even a pain in the ass to turn off but once you figure it out its an awesome baseball game! NOTE:  Its a bloatware game trying to sell you stuff but you can just pass on all of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good baseball game, if you want free baseball on PC, it's great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, nothing to complain about",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Me i just love baseball games and if you don't want to pay 70$ for MLB the show then play this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun sport with internet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "swing bat, hit ball. swing bat, miss ball",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for a free baseball game its pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes it is a very good game i hit 11 homers in one game just look",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not really my type but it was fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hi dev if your seeing this i wood like to help with the game in sum way?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game. would reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so much fun so many game modes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's O.K. For what's on Steam .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "jung hoo lee",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Top 3 game of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great MLB Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "que juego de mrd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "soft ballz in my base",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than nothing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "plz resign ranger suarez",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "masterpiece holy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SHOHEI OHTANI IS GOAT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "baseball 🤤",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes i would",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coooooooool!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "heh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":>",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gggggg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As one of the only MLB games on PC right now and its free, it is worth playing",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "For a free baseball game, MLB Rivals is honestly really good. The graphics aren’t the best and things can feel a bit rough sometimes, but the gameplay itself is super fun and surprisingly accurate. It’s easy to get into, and it actually feels like real baseball once you start playing. Even with its flaws, it’s impressive how much content and enjoyment you get without paying anything. Definitely worth a try if you’re a baseball fan looking for something casual and fun.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "These review comments are trash. The game is great fun. Its casual and yes its a mobile game. So its not going to be like \"The Show\" but imo its perfect for someone who doesnt have time to dedicate to mastering pitch types, or bat timing, etc. Its not a simulator, PLUS you have nothing to lose with a price-tag of free. Definitely try it out!",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "The game is mostly successful due to the void of the category on steam, and it would be a lot better if they made the strike zone more dynamic rather than a ball garunteed to be either a dinky grounder or a foul ball, regardless of how close the ball is to the strike zone, it just makes it less immersive and more frusterating as a hitter. I do enjoy the pitching and general progression of the game though, it is very p2w but it is possible to take it slowly and progress. The overall team building of the game is where it shines though, as it can be very engaging to make the best team possible. Also, if I had to change one thing about the game, it would be making the league mode teams actually perform to the reccommended OVR that it says on the UI, for reference the Champion 2 league option has a reccommended OVR of 115, however some of the highest teams in the mode will have OVRs of 128, it just doesnt make any sense and it is frusterating to me as a player since my OVR is about 124 and I cant progress past a challenge mode supposedly made for players at 115 OVR. But the game is pretty solid overall.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "incredibly impressive for a free game, not performance heavy but also doesn't require much skill. very different from MLB The Show in terms of gameplay.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "pretty good game you can pick a player and stick to him however you cant really control the outfield",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Your game is one of my favorite game on my pc, it is really good. But it would be great if we had a practice mode where we can chose the batter and pitcher",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "less predatory to its f2p players than 9innings. still a looooot of popups asking you to buy stuff though. more generous than 9innings, and easier to upgrade players. but seriously, what's up with the player variety? why do you have some available in this game, but not in 9innings and vice versa? the historic players/hof players are also super limited, yet there's like a trillion versions of everyone in the game. \r\n\r\nnone of this makes the game unplayable however, and it does run better than 9innings.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It really blows that the best options for PC Baseball games are either Backyard Baseball '97 or MLB Rivals. That being said, it's pretty clear why Rivals is so good despite literally being a mobile to PC port. Com2uS (formerly Gamevil) has been developing baseball games going back as far as at least 2007 with Baseball Superstars 2007. They've since ditched the cutesy, anime-like artstyle for an MLB license and pretty good graphics for a mobile game and present more of the same fun and engaging gameplay and modes to keep you coming back.\n\nOf course, the game has microtransactions but so far in my 11 hours I've amassed a quite nice roster (Mookie, Soto, Jeter, Chisholm, Ohtani, Freeman, Devers, Acuna, etc.) without spending a dime and just by playing and picking the right card packs. I wish the pop ups for $20 bundles and other things weren't so predatory but hey, mobile game things.\n\nOverall, it's a fun game and worth looking at. I just really hope someday MLB The Show can come to PC or some dev/dev team could make a truly excellent baseball game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty sad we have to love this mobile game port since we can't have any other nice baseball game on PC. \n\nI don't like the fact you can't really hit freely like in MLB console game and I hate the fact we can't do the fielding, but at least we can enjoy a baseball game on PC. \n\nYeah I don't count super mega baseball with those annoying looking characters.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "good. also graphics are bad cuz it was meant to be a mobile game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its free!!!! After you turn of all the automatic BS then its an actual baseball game that you would imagine. Not going to lie the auto stuff is super annoying and even a pain in the ass to turn off but once you figure it out its an awesome baseball game! NOTE:  Its a bloatware game trying to sell you stuff but you can just pass on all of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good baseball game, if you want free baseball on PC, it's great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a P2W game even the free game play is really decent and there is enough daily content to keep you busy for a long time without being stalled waiting for currency to keep playing. It's very fun to play and can be very competitive if that is your style of play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game, Not keyboard support to this game but still good as baseball cool graphic as free to play .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is pretty cool and it is free. I would say it is the best free game I have and it has some decent graphics. runs smooth on a laptop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and good for beginners to play and or experienced.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun game takes time to build your team ratting unless you want to spend big money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game. Amazing graphics and will give you amazing animations along with realistic game play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Game.  Not complicated.  Plenty of events and free items to further progress.  Pick your favorite team and build your favorite lineup.  There is a cash store for whales as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its just like the mobile app MLB 9 Innings and, its so fun!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. fun to play, and simple. I love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In terms of being able to play the game as pitcher or batter, this is a great game. I haven't found a decent tutorial on the game showing what all the controls are and what they do. Short of this, Super Mega Baseball 2, 3, and 4 are better for game play. Still, I'd recommend it as a good game for a lot of players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly its alot of fun. People can learn about Baseball and how to play properly. I would consider Games as a Form of Education.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there are not many free mlb games on steam and not a lot of them too! so although its not the best, it is still really good to play, and its a little pay to win but most games are and let me tell you i've seen a lot worse but you can get player cards easily i have gotten 5 prime cards already!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for free.99 this is solid, its not great though, I treat it like a mini game of sorts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been liking this a lot! Baseball, team building, and organizational change! whats not to love? Watch out for my juiced Rockies! yee yee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is good and can be played extensively but more like it makes it feel like that's how its supposed to be to get or make better players so becomes time consuming until a level is reached that is still low in terms of the others played against. so until it fells like no more progression can be made it's fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decided to play this game after the mariners won, and now im hooked\n\nGO MARINERS",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "very good game, nothing to complain about",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Me i just love baseball games and if you don't want to pay 70$ for MLB the show then play this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and free the batting actually feels smooth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a great baseball game..if you really into the sport, then you'll love this installment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would for sure recommend this game to anyone who comes across this, its amazing. the game could be bad to some but to me it is just perfect. perfect, everything about it, perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to learn pitching is kinda borin but still fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "add manual fielding and baserunning and this would be fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its no MLB the show, but it serves the purpose.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game to play I wish it would play without crashing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "swing bat, hit ball. swing bat, miss ball",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes it is a very good game i hit 11 homers in one game just look",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love for the game-hope you think is good enough to build.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game just need to work on commentary",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If your looking for a free MLB game thats fun you found it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game for being free",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Absolutely DISSAPOINTED  \nAfter mlb Perfect inning I was looking forward to a baseball game on steam. But the lack of gameplay, the change in pitching mechanics. difficulty in upgrading players. you cant even choose to throw to base to try and get the runner out.\n\nThe batting is only about timing. No control over the bat swing, no control in base running. there is no need for assisted batting zone since the batting only has to do with timing\n\nthe change in pitching is COMPLETELY unrealistic but worse than tht is that it takes away ALL skill when it comes pitching. there is no method to be able to confuse your opponent or disguise your pithches. Batting is difficult IRL and as such, can be fustrating ... but thats baseball. thats why there are slumps and  hitting 3/10 ab are Great batters!\nbaseball isnt about homeruns!\nthe hardest thing baseball is a NO HITTER its called  A Perfect Game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's not terrible and might satisfy an itch but I can't recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've put nearly 1,200 hours into this game and while I can say it had it's moments and consumed time for me when I was bored. But it's an unrewarding and exhausting experience. Through my entire time put into this game I've probably done well over 95% of the events throughout it. Putting time into the game you can gain quite a bit and actually find some solid enjoyment in it but if you don't spend money you will be completely outmatched when you start to stagnate. Yes I understand this is a gacha game and I should be expected to spend money but with the amount of time I've put in with events and other activities no matter how much you do you will find yourself in a completely outmatched environment if you do not spend money every time. \n\nI'm 100% complaining due to the lack of the show support on PC too and I wish for a better MLB experience but this is just not it. Spending money on a game is fine but to make such an effort in limiting your progress by so much even with the amount of time you put in just makes it an overall sad experience. \n\nNow am I saying don't play this game? No. If you find yourself bored it's definitely passes the time for you. But if you want to be able to reach the top without spending money you won't, or it will take an extremely long time. My experience is mixed, I hated not being able to progress much after reaching a certain point regardless of how much effort I put into the minigames and events. But it was able to pass time for me whenever I needed it to. That's all it'll be. Can't be bothered to spend hundreds of dollars just to progress at where I am.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "literally just a mobile phone game port & its sucks ass game says its online pvp but cant even link up with ya mate to smash him so gay",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its gets easy at first soo easy but when u countine on YOU CANT GET A WIN VRO THE MARLINS MADE A COMEBACK catchers call is also pretty TRASH ALL OF IT IS BALLS NO STRIKES",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I went into this game expecting epic 6v6 Baseball Hero Shooter action, but this is just a baseball game. Why call it Rivals if it has nothing to do with Marvel Rivals? I'm considering taking legal action against this game for false advertisement",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "had a team of nothing but A and S rank and got beat by someone who had nothing but B and C rank players. complete pile of fiucking trash. dont waste your time on this wack ass pile of hot garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "graphics suck, and the play is clunky and not engaging. It feels like a pay to win mobile game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I literally can't fucking open the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "BAD GAME CANT PLAY WITH A PS CONTROLLER LIKE IT SAYS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't play ea sports ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buns",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a pay-to-win baseball gacha with minimal depth that thrives due to a lack of market competitors.  There is a definite hard cap to how far one can progress their team without sinking hundreds of dollars into incremental gains required to compete at the top levels.  Virtually every game milestone is met with a helpful opportunity to purchase another gacha box.\r\n\r\nMaybe someday, MLB The Show will come back to PC.  Until then, this is a flawed option and if obtained you should become accustomed to getting your teeth kicked in unless you are willing to make a significant financial investment in the game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Absolutely DISSAPOINTED  \nAfter mlb Perfect inning I was looking forward to a baseball game on steam. But the lack of gameplay, the change in pitching mechanics. difficulty in upgrading players. you cant even choose to throw to base to try and get the runner out.\n\nThe batting is only about timing. No control over the bat swing, no control in base running. there is no need for assisted batting zone since the batting only has to do with timing\n\nthe change in pitching is COMPLETELY unrealistic but worse than tht is that it takes away ALL skill when it comes pitching. there is no method to be able to confuse your opponent or disguise your pithches. Batting is difficult IRL and as such, can be fustrating ... but thats baseball. thats why there are slumps and  hitting 3/10 ab are Great batters!\nbaseball isnt about homeruns!\nthe hardest thing baseball is a NO HITTER its called  A Perfect Game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Love my baseball games but this one didnt cut it. The graphics when batting and pitching are quite good. The physics of the hits ok - to good though I wondered in the slugging event how I hit 450 ft HR fighting a fastball off my fists and 630 ft HR`s. Number one issue is what happens when you hit the ball . You cant do much after that.\r\nThe biggest issue if the interface is jam packed full of different windows giving bonus points and wanting daily check ins to upgrade this or that.  A HUGE alarm was I kept ending up in this window with add on purchases. $150 looking me in the eye. If a child was on this it could end up in tears. \r\nSomehow ended up with a hall of famer pretty quick. Was a bit all over the shop. \r\nHas potential but needs to remove all the gimmicks and whistles and develop a simpler interface where you can simply play a season , trade , manage etc.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "has the feel of a mobile game on pc, lots of in app purchase request. no ability to control runners or set up steals. batting is based on chance of guessing pitch location to get a half decent hit. pitching isnt much better. its hard to rag on a free game and i know that they have to have the inapp purchases to provide some sort of revenue to keep the game going. it has alot of potential but its not there yet",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is complete SHIT! Boring, full of cheaters and no way to report, and they constantly have pop ups on your screen trying to get you to spend money.. The prices they want people to pay are fucking regarded too 100 bucks for little packs of shitty things that dont help yall are brain dead lmffaooo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I appreciate the attempt in adding an MLB simulation game since The show isn't available on PC but this just ain't it. At least for right now. The game holds your hand way too much with both pitching and hitting. The pitching is just moving the cursor where you want to aim and then pressing a button, and the hitting is very annoying visually due to the meter at the bottom of the screen telling you when to hit. I wouldn't have a problem with that stuff if there were a difficulty setting to turn it off or something along those lines but it's just forced onto you and immediately ruins the experience from the get go. At this time Super Mega Baseball 4 is still the best simulation Baseball game I could find on PC and I don't see that changing anytime soon.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not that great . It's a sim through game and the menus are not player friendly to even play a whole game or series . \nEmphasizes  are on simulation lacks options but encourages buy buy buy . uninstalled it spend to much time in the menus just to play out an entire game . ugh !!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly their mobile games are way more interactive\ncant even control players outside pitching and batting and even those two mechanics are very simple",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont play this game its take all data for your pc / laptop just read it before start the game terms and conditions...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not for serious gaming fans. I uninstalled it in a matter of minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its gets easy at first soo easy but when u countine on YOU CANT GET A WIN VRO THE MARLINS MADE A COMEBACK catchers call is also pretty TRASH ALL OF IT IS BALLS NO STRIKES",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nigga this shits just a phone game and what fucking phone game is 10gbs looks like a fucking bitcoin miner or chinese spyware with that being said I opened packs because i feen for rigged luck based pulls and uninstalled if there was more to the game than using mouse 1 Id play but fuck phone games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wasted grinding to lvl 5 only to find out matchmaking with my friend does not work at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "had a team of nothing but A and S rank and got beat by someone who had nothing but B and C rank players. complete pile of fiucking trash. dont waste your time on this wack ass pile of hot garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "graphics suck, and the play is clunky and not engaging. It feels like a pay to win mobile game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if the matchmaking wasnt so retarded they might have something here but its just horrible unbalanced garbage matchmaking some games are even some games are absolutely 100% unwinnable mlb rivals is cringe game and the show is WAY better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "doesnt load past press any button screen waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I literally can't fucking open the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is just a Phone game on pc dont get it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was an okay experience",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't play ea sports ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pay to win game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "buns",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a pay-to-win baseball gacha with minimal depth that thrives due to a lack of market competitors.  There is a definite hard cap to how far one can progress their team without sinking hundreds of dollars into incremental gains required to compete at the top levels.  Virtually every game milestone is met with a helpful opportunity to purchase another gacha box.\r\n\r\nMaybe someday, MLB The Show will come back to PC.  Until then, this is a flawed option and if obtained you should become accustomed to getting your teeth kicked in unless you are willing to make a significant financial investment in the game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Absolutely DISSAPOINTED  \nAfter mlb Perfect inning I was looking forward to a baseball game on steam. But the lack of gameplay, the change in pitching mechanics. difficulty in upgrading players. you cant even choose to throw to base to try and get the runner out.\n\nThe batting is only about timing. No control over the bat swing, no control in base running. there is no need for assisted batting zone since the batting only has to do with timing\n\nthe change in pitching is COMPLETELY unrealistic but worse than tht is that it takes away ALL skill when it comes pitching. there is no method to be able to confuse your opponent or disguise your pithches. Batting is difficult IRL and as such, can be fustrating ... but thats baseball. thats why there are slumps and  hitting 3/10 ab are Great batters!\nbaseball isnt about homeruns!\nthe hardest thing baseball is a NO HITTER its called  A Perfect Game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's not terrible and might satisfy an itch but I can't recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've put nearly 1,200 hours into this game and while I can say it had it's moments and consumed time for me when I was bored. But it's an unrewarding and exhausting experience. Through my entire time put into this game I've probably done well over 95% of the events throughout it. Putting time into the game you can gain quite a bit and actually find some solid enjoyment in it but if you don't spend money you will be completely outmatched when you start to stagnate. Yes I understand this is a gacha game and I should be expected to spend money but with the amount of time I've put in with events and other activities no matter how much you do you will find yourself in a completely outmatched environment if you do not spend money every time. \n\nI'm 100% complaining due to the lack of the show support on PC too and I wish for a better MLB experience but this is just not it. Spending money on a game is fine but to make such an effort in limiting your progress by so much even with the amount of time you put in just makes it an overall sad experience. \n\nNow am I saying don't play this game? No. If you find yourself bored it's definitely passes the time for you. But if you want to be able to reach the top without spending money you won't, or it will take an extremely long time. My experience is mixed, I hated not being able to progress much after reaching a certain point regardless of how much effort I put into the minigames and events. But it was able to pass time for me whenever I needed it to. That's all it'll be. Can't be bothered to spend hundreds of dollars just to progress at where I am.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Love my baseball games but this one didnt cut it. The graphics when batting and pitching are quite good. The physics of the hits ok - to good though I wondered in the slugging event how I hit 450 ft HR fighting a fastball off my fists and 630 ft HR`s. Number one issue is what happens when you hit the ball . You cant do much after that.\r\nThe biggest issue if the interface is jam packed full of different windows giving bonus points and wanting daily check ins to upgrade this or that.  A HUGE alarm was I kept ending up in this window with add on purchases. $150 looking me in the eye. If a child was on this it could end up in tears. \r\nSomehow ended up with a hall of famer pretty quick. Was a bit all over the shop. \r\nHas potential but needs to remove all the gimmicks and whistles and develop a simpler interface where you can simply play a season , trade , manage etc.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "has the feel of a mobile game on pc, lots of in app purchase request. no ability to control runners or set up steals. batting is based on chance of guessing pitch location to get a half decent hit. pitching isnt much better. its hard to rag on a free game and i know that they have to have the inapp purchases to provide some sort of revenue to keep the game going. it has alot of potential but its not there yet",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is complete SHIT! Boring, full of cheaters and no way to report, and they constantly have pop ups on your screen trying to get you to spend money.. The prices they want people to pay are fucking regarded too 100 bucks for little packs of shitty things that dont help yall are brain dead lmffaooo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I appreciate the attempt in adding an MLB simulation game since The show isn't available on PC but this just ain't it. At least for right now. The game holds your hand way too much with both pitching and hitting. The pitching is just moving the cursor where you want to aim and then pressing a button, and the hitting is very annoying visually due to the meter at the bottom of the screen telling you when to hit. I wouldn't have a problem with that stuff if there were a difficulty setting to turn it off or something along those lines but it's just forced onto you and immediately ruins the experience from the get go. At this time Super Mega Baseball 4 is still the best simulation Baseball game I could find on PC and I don't see that changing anytime soon.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "literally just a mobile phone game port & its sucks ass game says its online pvp but cant even link up with ya mate to smash him so gay",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont play this game its take all data for your pc / laptop just read it before start the game terms and conditions...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not for serious gaming fans. I uninstalled it in a matter of minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its gets easy at first soo easy but when u countine on YOU CANT GET A WIN VRO THE MARLINS MADE A COMEBACK catchers call is also pretty TRASH ALL OF IT IS BALLS NO STRIKES",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I went into this game expecting epic 6v6 Baseball Hero Shooter action, but this is just a baseball game. Why call it Rivals if it has nothing to do with Marvel Rivals? I'm considering taking legal action against this game for false advertisement",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Garbage, just bring 'the show' to pc/ steam, and sales would make up for the shitty exclusivity.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wasted grinding to lvl 5 only to find out matchmaking with my friend does not work at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "had a team of nothing but A and S rank and got beat by someone who had nothing but B and C rank players. complete pile of fiucking trash. dont waste your time on this wack ass pile of hot garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "graphics suck, and the play is clunky and not engaging. It feels like a pay to win mobile game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if the matchmaking wasnt so retarded they might have something here but its just horrible unbalanced garbage matchmaking some games are even some games are absolutely 100% unwinnable mlb rivals is cringe game and the show is WAY better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "doesnt load past press any button screen waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I literally can't fucking open the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "BAD GAME CANT PLAY WITH A PS CONTROLLER LIKE IT SAYS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was an okay experience",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't play ea sports ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buns",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a pay-to-win baseball gacha with minimal depth that thrives due to a lack of market competitors.  There is a definite hard cap to how far one can progress their team without sinking hundreds of dollars into incremental gains required to compete at the top levels.  Virtually every game milestone is met with a helpful opportunity to purchase another gacha box.\r\n\r\nMaybe someday, MLB The Show will come back to PC.  Until then, this is a flawed option and if obtained you should become accustomed to getting your teeth kicked in unless you are willing to make a significant financial investment in the game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Absolutely DISSAPOINTED  \nAfter mlb Perfect inning I was looking forward to a baseball game on steam. But the lack of gameplay, the change in pitching mechanics. difficulty in upgrading players. you cant even choose to throw to base to try and get the runner out.\n\nThe batting is only about timing. No control over the bat swing, no control in base running. there is no need for assisted batting zone since the batting only has to do with timing\n\nthe change in pitching is COMPLETELY unrealistic but worse than tht is that it takes away ALL skill when it comes pitching. there is no method to be able to confuse your opponent or disguise your pithches. Batting is difficult IRL and as such, can be fustrating ... but thats baseball. thats why there are slumps and  hitting 3/10 ab are Great batters!\nbaseball isnt about homeruns!\nthe hardest thing baseball is a NO HITTER its called  A Perfect Game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's not terrible and might satisfy an itch but I can't recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've put nearly 1,200 hours into this game and while I can say it had it's moments and consumed time for me when I was bored. But it's an unrewarding and exhausting experience. Through my entire time put into this game I've probably done well over 95% of the events throughout it. Putting time into the game you can gain quite a bit and actually find some solid enjoyment in it but if you don't spend money you will be completely outmatched when you start to stagnate. Yes I understand this is a gacha game and I should be expected to spend money but with the amount of time I've put in with events and other activities no matter how much you do you will find yourself in a completely outmatched environment if you do not spend money every time. \n\nI'm 100% complaining due to the lack of the show support on PC too and I wish for a better MLB experience but this is just not it. Spending money on a game is fine but to make such an effort in limiting your progress by so much even with the amount of time you put in just makes it an overall sad experience. \n\nNow am I saying don't play this game? No. If you find yourself bored it's definitely passes the time for you. But if you want to be able to reach the top without spending money you won't, or it will take an extremely long time. My experience is mixed, I hated not being able to progress much after reaching a certain point regardless of how much effort I put into the minigames and events. But it was able to pass time for me whenever I needed it to. That's all it'll be. Can't be bothered to spend hundreds of dollars just to progress at where I am.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Love my baseball games but this one didnt cut it. The graphics when batting and pitching are quite good. The physics of the hits ok - to good though I wondered in the slugging event how I hit 450 ft HR fighting a fastball off my fists and 630 ft HR`s. Number one issue is what happens when you hit the ball . You cant do much after that.\r\nThe biggest issue if the interface is jam packed full of different windows giving bonus points and wanting daily check ins to upgrade this or that.  A HUGE alarm was I kept ending up in this window with add on purchases. $150 looking me in the eye. If a child was on this it could end up in tears. \r\nSomehow ended up with a hall of famer pretty quick. Was a bit all over the shop. \r\nHas potential but needs to remove all the gimmicks and whistles and develop a simpler interface where you can simply play a season , trade , manage etc.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "has the feel of a mobile game on pc, lots of in app purchase request. no ability to control runners or set up steals. batting is based on chance of guessing pitch location to get a half decent hit. pitching isnt much better. its hard to rag on a free game and i know that they have to have the inapp purchases to provide some sort of revenue to keep the game going. it has alot of potential but its not there yet",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is complete SHIT! Boring, full of cheaters and no way to report, and they constantly have pop ups on your screen trying to get you to spend money.. The prices they want people to pay are fucking regarded too 100 bucks for little packs of shitty things that dont help yall are brain dead lmffaooo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I appreciate the attempt in adding an MLB simulation game since The show isn't available on PC but this just ain't it. At least for right now. The game holds your hand way too much with both pitching and hitting. The pitching is just moving the cursor where you want to aim and then pressing a button, and the hitting is very annoying visually due to the meter at the bottom of the screen telling you when to hit. I wouldn't have a problem with that stuff if there were a difficulty setting to turn it off or something along those lines but it's just forced onto you and immediately ruins the experience from the get go. At this time Super Mega Baseball 4 is still the best simulation Baseball game I could find on PC and I don't see that changing anytime soon.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "literally just a mobile phone game port & its sucks ass game says its online pvp but cant even link up with ya mate to smash him so gay",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont play this game its take all data for your pc / laptop just read it before start the game terms and conditions...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not for serious gaming fans. I uninstalled it in a matter of minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its gets easy at first soo easy but when u countine on YOU CANT GET A WIN VRO THE MARLINS MADE A COMEBACK catchers call is also pretty TRASH ALL OF IT IS BALLS NO STRIKES",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I went into this game expecting epic 6v6 Baseball Hero Shooter action, but this is just a baseball game. Why call it Rivals if it has nothing to do with Marvel Rivals? I'm considering taking legal action against this game for false advertisement",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Garbage, just bring 'the show' to pc/ steam, and sales would make up for the shitty exclusivity.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wasted grinding to lvl 5 only to find out matchmaking with my friend does not work at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "had a team of nothing but A and S rank and got beat by someone who had nothing but B and C rank players. complete pile of fiucking trash. dont waste your time on this wack ass pile of hot garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "graphics suck, and the play is clunky and not engaging. It feels like a pay to win mobile game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if the matchmaking wasnt so retarded they might have something here but its just horrible unbalanced garbage matchmaking some games are even some games are absolutely 100% unwinnable mlb rivals is cringe game and the show is WAY better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "doesnt load past press any button screen waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I literally can't fucking open the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "BAD GAME CANT PLAY WITH A PS CONTROLLER LIKE IT SAYS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was an okay experience",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't play ea sports ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buns",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a pay-to-win baseball gacha with minimal depth that thrives due to a lack of market competitors.  There is a definite hard cap to how far one can progress their team without sinking hundreds of dollars into incremental gains required to compete at the top levels.  Virtually every game milestone is met with a helpful opportunity to purchase another gacha box.\r\n\r\nMaybe someday, MLB The Show will come back to PC.  Until then, this is a flawed option and if obtained you should become accustomed to getting your teeth kicked in unless you are willing to make a significant financial investment in the game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Absolutely DISSAPOINTED  \nAfter mlb Perfect inning I was looking forward to a baseball game on steam. But the lack of gameplay, the change in pitching mechanics. difficulty in upgrading players. you cant even choose to throw to base to try and get the runner out.\n\nThe batting is only about timing. No control over the bat swing, no control in base running. there is no need for assisted batting zone since the batting only has to do with timing\n\nthe change in pitching is COMPLETELY unrealistic but worse than tht is that it takes away ALL skill when it comes pitching. there is no method to be able to confuse your opponent or disguise your pithches. Batting is difficult IRL and as such, can be fustrating ... but thats baseball. thats why there are slumps and  hitting 3/10 ab are Great batters!\nbaseball isnt about homeruns!\nthe hardest thing baseball is a NO HITTER its called  A Perfect Game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's not terrible and might satisfy an itch but I can't recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've put nearly 1,200 hours into this game and while I can say it had it's moments and consumed time for me when I was bored. But it's an unrewarding and exhausting experience. Through my entire time put into this game I've probably done well over 95% of the events throughout it. Putting time into the game you can gain quite a bit and actually find some solid enjoyment in it but if you don't spend money you will be completely outmatched when you start to stagnate. Yes I understand this is a gacha game and I should be expected to spend money but with the amount of time I've put in with events and other activities no matter how much you do you will find yourself in a completely outmatched environment if you do not spend money every time. \n\nI'm 100% complaining due to the lack of the show support on PC too and I wish for a better MLB experience but this is just not it. Spending money on a game is fine but to make such an effort in limiting your progress by so much even with the amount of time you put in just makes it an overall sad experience. \n\nNow am I saying don't play this game? No. If you find yourself bored it's definitely passes the time for you. But if you want to be able to reach the top without spending money you won't, or it will take an extremely long time. My experience is mixed, I hated not being able to progress much after reaching a certain point regardless of how much effort I put into the minigames and events. But it was able to pass time for me whenever I needed it to. That's all it'll be. Can't be bothered to spend hundreds of dollars just to progress at where I am.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Love my baseball games but this one didnt cut it. The graphics when batting and pitching are quite good. The physics of the hits ok - to good though I wondered in the slugging event how I hit 450 ft HR fighting a fastball off my fists and 630 ft HR`s. Number one issue is what happens when you hit the ball . You cant do much after that.\r\nThe biggest issue if the interface is jam packed full of different windows giving bonus points and wanting daily check ins to upgrade this or that.  A HUGE alarm was I kept ending up in this window with add on purchases. $150 looking me in the eye. If a child was on this it could end up in tears. \r\nSomehow ended up with a hall of famer pretty quick. Was a bit all over the shop. \r\nHas potential but needs to remove all the gimmicks and whistles and develop a simpler interface where you can simply play a season , trade , manage etc.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "has the feel of a mobile game on pc, lots of in app purchase request. no ability to control runners or set up steals. batting is based on chance of guessing pitch location to get a half decent hit. pitching isnt much better. its hard to rag on a free game and i know that they have to have the inapp purchases to provide some sort of revenue to keep the game going. it has alot of potential but its not there yet",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is complete SHIT! Boring, full of cheaters and no way to report, and they constantly have pop ups on your screen trying to get you to spend money.. The prices they want people to pay are fucking regarded too 100 bucks for little packs of shitty things that dont help yall are brain dead lmffaooo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I appreciate the attempt in adding an MLB simulation game since The show isn't available on PC but this just ain't it. At least for right now. The game holds your hand way too much with both pitching and hitting. The pitching is just moving the cursor where you want to aim and then pressing a button, and the hitting is very annoying visually due to the meter at the bottom of the screen telling you when to hit. I wouldn't have a problem with that stuff if there were a difficulty setting to turn it off or something along those lines but it's just forced onto you and immediately ruins the experience from the get go. At this time Super Mega Baseball 4 is still the best simulation Baseball game I could find on PC and I don't see that changing anytime soon.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "literally just a mobile phone game port & its sucks ass game says its online pvp but cant even link up with ya mate to smash him so gay",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont play this game its take all data for your pc / laptop just read it before start the game terms and conditions...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not for serious gaming fans. I uninstalled it in a matter of minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its gets easy at first soo easy but when u countine on YOU CANT GET A WIN VRO THE MARLINS MADE A COMEBACK catchers call is also pretty TRASH ALL OF IT IS BALLS NO STRIKES",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I went into this game expecting epic 6v6 Baseball Hero Shooter action, but this is just a baseball game. Why call it Rivals if it has nothing to do with Marvel Rivals? I'm considering taking legal action against this game for false advertisement",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Garbage, just bring 'the show' to pc/ steam, and sales would make up for the shitty exclusivity.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wasted grinding to lvl 5 only to find out matchmaking with my friend does not work at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "had a team of nothing but A and S rank and got beat by someone who had nothing but B and C rank players. complete pile of fiucking trash. dont waste your time on this wack ass pile of hot garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "graphics suck, and the play is clunky and not engaging. It feels like a pay to win mobile game.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}