{
  "positive": [
    {
      "review": "you get 1 close match every 50 one sided matches you play.\n\n20 health card game where sword craft can deal 12 damage from hand with a single card and evolve point and that isnt even the best card they have\n\nI still play it though idk why",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Having read all the negatives reviews I decided to give this game a try.\r\nPros: lots of free goodies. I got 2 full prebuilt decks + 40 free packs for free + a bunch of gold + get a free pack everyday.\r\nCons: meta seems to be shit. game feels like you are simply trading removals until your opponent gets an op legendary so you lose.\r\nI didnt like the current meta so I stopped playing. I still recommend it cuz maybe you will like it.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Pretty good game despite all the negative reviews, just don't expect to get everything you need for a meta deck without grinding",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Not a fan of the monetization, but fun card game nonetheless.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun.\nThe game is a battle.\nIf it's not fun, why bother?\nIf it's not a battle, where's the fun?\n\nThis game is neither fun nor a battle, unless you consider \"fighting Retard McFaggot who summon 4 billions ward because he dragged Aether onto the field by accident\" a battle",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its quite a disappointment. I expected more but I got all the same good old bad stuff although with higher resolution.\nWould still recommend because it might be your thing, who knows? It did get boring quick for me though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What I've noticed is that most of the negative reviews concern the economic side of the game, not the gameplay itself.\nI'm a big boy who grew up playing CCGs, so I'm aware of the expenses that come with this hobby.\n\nIn my opinion, it's the best digital CCG on the market right now.\n\nA spectacular game, both in terms of mechanics and visuals... I can't stand manga... and this game is the only case where that doesn't bother me. The design of the cards, boards, characters and effects accompanying the game are world-class.\n\nAs an MTGA veteran with a nearly complete collection, I've now completely switched to Shadowverse.\nWhat this game gives me is the feeling of playing with an opponent, not with the limitations imposed by an algorithm and absurd matchmaking.\n\nThe greatest satisfaction for me in these types of games comes from building decks; in MTG, I achieved top Mythic levels using only my own builds.\nDeck building here gives me immense satisfaction, which translates into an advantage over a less experienced opponent with a deck they haven't explored enough.\n\nI have several hundred hours of playtime on my iPad, and unfortunately, I can't link my account to my Steam because I created a Steam account on release day and then forgot and created another one on my tablet.\nSo remember, Steam only allows you to link only one Shadowverse account, and it's permanent.\n\nThe economic situation is similar to other CCGs; you should expect to spend around 100-200$ when a new expansion is released to maintain your collection.\n\nI'm not a F2P player who spends weeks playing the same deck online. I need cards to build my own decks, so I'm paying for my enjoyment.\n\nPlaying regularly, I managed to build a 100% collection based on in-game bonuses and purchasing gems when new expansions were released.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Great game, play it more than any actual games. Read through the Negative reviews and you'll see its nearly entirely about early Monetisation, don't know why people expect to get everything in a new game with <5 hours played. \n\nThis game is far more alive in JP communities especially on youtube etc.\n\nAlso if you're wondering as its on the app store, its not a gacha in anyway. It would be as close to a gacha as buying LoL skins is (apart from you buy cards here, everyone gets the same cards)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I put $15 into this game at launch and have made Diamond league every season. Your arguments are invalid. L2P.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Let's talk about shadowverse (OG game) and Shadowverse 2 (this one aka worlds beyond).\n\nThe first game was totally fine, kinda outdated in graphics and maybe \"mechanics\" (yes, this). Why mechanics? This game is just a cardgame you are wondering, so your answer, because this game to be balancing all the time is a mess. Just go in the first game and try to play into unlimited or rotation if you start now, you will see how grindy it is and how \"mercenary\" it is. As a time (ladder) and money (to buy packs, you need to be playing for a long time).\n\nSo following this thesis from the first game, the second game is no different. You need to follow as early as you can to play with cards in meta and spend the less you can (unless you want leaders, then you need to be ready to open your wallet or be lucky). \n\nThe game mechanic is really good as far as I played, nothing to worry that much about it, still grind as hell and people are smoking like crack in ladders but this what the game competitive and it's fun because of it. \nThe entire community is play along with each other and eventually after playing some tournaments you might know everyone (or a good part). And if you want to browse some tournaments it has real money involved (mostly) and some in game rewards!! Search on battle.fy or the oficial discord btw!!\n\nThe graphics are better than the old one and might be the best in the entire market with card games in general.\n\nThe \"supplies\" system, are really hard to manage since it's really expensive, but yeah... I am biased when it comes to speaking but when i like something i just invest even if its a little (battle pass ok). And it's really rewarding, otherwise... you need to be really lucky or be playing in every event (chest even to earn more gold, park, etc) to do your decks.\n\nFairly, I recommend the game if you want to \"try it out\", but if you are f2p and are willing to tryhard.. you should wait for a bit and do go for overhype each patch and wait for a bit until starts the real events to earn gold, etc to earn gold and dont suffer that much as people said in the other reviews IMO.\n\nAnd now if you are a dolphin/whale/willing to spend some money, totally worth to try it out. REMEMBER, YOUR MONEY, YOUR RULES!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's good, I have no idea what all the negative reviews are about, and having a virtual lobby is something that really adds to the immersion (that no other digital card games do), despite it looking as simple as a Wii avatar.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dont trust the comments i play thing game comepletly f2p 0 $ spent. I have all the cards and all the meta decks also have a lot of game currency and enough dust to craft 11 legendary cards that i dont need. The game is f2p friendly you need one deck to not only play but win weekly tournaments and if you play the solo mode you can make it in a day. I dont know what those lazy ass gamers are talking about",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the game and despite what others says, F2P is possible, you just have to be smart on what you will use your 1st resources for. you need to do your own research about the classes and pick 1 you will likely enjoy using for a long time as you will need it to play matches and do missions to save up more resources. i suggest you pool all your resources and then buy the legends pack as they have most of the very foundational cards and with guides from youtube, you could build a working, primary, budget friendly deck to play. its not perfect, in fact, its not good either but it gets you by. i won 5 out of 10 using such deck with only 1 or 2 lucky legends pulled. \n\nThe gameplay is also very nice and I like it. as for the monetizing issue? its not really and issue, its for those who have money and can splurge. for us F2P we settle in grinding, like how most rpg games need grinding for materials too.\n\nI would have also spent money if it wasnt for the Gacha part. yes, that is my only problem, its gacha. i mean, I wouldnt mind spending money but atleast the money spent should have been worth it. but bro, the pull rate for the important cards are waaaaaay too low and I couldnt bring myself to waste money on a game of chances with such a low pull rate. its the GACHA part that is the main problem.\n\ni mean, there are currently 4 types of packs you could buy and each have 70+ cards to collect and each needs to be 3. ive spent so many resources on a single pack type and only got 3 legends counting the same monster cards. i barely there are still 3 more packs and maybe more coming, how the heck do I even get the cards I need if 70% of what I pull are redundant cards of bronze and silver quality?!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, easy and cheap. Great graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like the upgrade of the regular shadowverse.  It is fun in the lower levels. It fills up the hole made by hearthstone that is pretty shit nowadays.\n\n BUUUTTT as soon you get a bit higher in rank and meet the sweat lords with no regards to spedning their real money. YOu have no chance against their deck. The game ends when they jsut happen to get their combo or waited card.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Granblue collab experience:\n\n- Fight against GB Character\n- Pull Eustace out of my deck\n- Super evolve Eustace\n- Steamroll the boss\n- Profit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty chill card game without the 20 minute long combos from yugioh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I never played the original Shadowverse. All of the negative reviews I've seen from this game have been from people  who have claiming it isn't as \"f2p friendly.\" While that might be true, as someone who has played a lot of Magic Arena and early master duel, I can say that it is much more f2p friendly than both of those games. You get a free pack on login every day. They consistently have events and other ways to get resources along with dailies. The meta right now appears fairly balanced. While you might not be able to make a fully meta top-tier deck in every archetype as a f2p player at the start you also can't do that in any other free tcg game at the moment that I'm aware of. (At least not the big ones). This game comparably appears to have the quickest entry into competitive play without breaking the bank, and even if you don't want to play competitively there are plenty of casual ways to play and still make enjoyable decks. I still play magic on paper, but I'll never go back to Arena after playing this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want to play baby's first TCG, play Pokemon.\nIf you want to play solitaire/roulette/dice, play Yu-Gi-Oh.\nIf you want to play a TCG where you'll never financially recover from, play Magic the Gathering.\nBut if you want to play a card game with beautiful art, aggressive monetization and terrible blancing, play Shadowverse.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is like a drug, even though getting addicted to it is horrible, I can't get enough!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game when u start to learn it and notice your progress in how good u are becoming at the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has just been a blast for me. could it be better, yeah, but as to where, I wouldn't know.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a decent upgrade over the original Shadowverse game, but it sucks all our rare unlocks from the original didn't get honored and ported over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rather simplistic as a card game but there are a bunch of cards and collaborations I like. Good enough. Portalcraft gaming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1][b[Umazing game[b][/h1]\r\nignore haters, embrace RQ",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is it good game for go full free to play? No, you do need to pay for battlepass for every 1-2 month to help you unlock new card for each expansion which make this game more enjoyable. The battlepass is around 8 dollars and you will get enough resource to make around 2-3 decks per expansion (could be 3-4 decks now because new expansion scedule is around every 2-3 month).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ถึงผมจะไม่รู้ว่า มันมี ดราม่าอะไรนะ แต่โดยรวมตอนนี้มันก็ยังเป็นเกมเล่นสองคนอยู่ \n\nถ้ารู้สึกอยากบ่นก็คงเป็นเด็ดบางเด็ดเหมือนเป็นลูกรักเกินไปหน่อย อย่าง เด็ดนักเวทย์ นักบวช กับ เด็ดหุ่นเชิด ที่ไม่รู้ทำไมมันสู้ยากชิบหาย",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is nice experience actually. pretty fun if set a side the high paywall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good card game. Very f2p friendly. Meta can be boring sometimes, but that's the nature of card games like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "despite the bad monetization the game is great and very reasonable to play for free!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite the power level starting at higher than I would like, the game has been pretty addicting. It has its issues, but currently there's pretty healthy meta and wide range of decks that are playable.\n\nNot sure how difficult it would be to start now, but after 4 sets I'm sitting at a point where I can play most of the stuff and cook janky decks. I just hope they keep adding more good low rarity cards instead of wasting the limited slots on the draft mode filler.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun, you get a free pack every day and has some daily chores to get more resources. If svwb gets as much support as shadowverse in collabs I think this game will be more then awesome.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As for the first hours I really enjoy the game. While many people complain for f2p system, for me it's ok. Each day you get a free pack, and there's a lot of ways to get gold from. You need to be patient and collect cards for a while if you wish to create one of the most expensive decks for free, but it's what I expect from a collectible card game. For me much better monetization than MTG Arena. \n\nOn the other hand, the main disadvantage for me is the Arena mode (so called \"Take two\"). While MTG Arena has really bad monetization I enjoyed a lot the draft mode which is perfect for me and I miss sth like that in SV WB. Take two doesn't allow you to keep cards you choose and is overall less fun in the way you build the deck with the chosen cards.\n\nIn general, for my current experience I recommend it :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game so far, And it Runs well on Linux!\n\n     To start, I have not spent a single dime on this game so far. Nor have I had any experience with the Shadowverse series ever. I joined when this games steam pages bombed with negative reviews and by the time i publish this review it will probably still be negative. I have been able to collect most cards through normal play except for Legendary Cards, and have been able to craft a Meta Decks in under 20 hours of play. As long as you play regularly you'll be fine. If you are going in as a F2P player like me, then I am sure you would already understand that you won't be able to craft every single card. The community is incredible and more helpful than other card game community I have experienced thus far.\n\n8/10 would recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the original shadowverse and wasn't too happy with the economy and crafting system changes at first. But after playing for a few months it really isn't as bad as I thought and I can comfortably craft several decks per expansion with crafting materials leftover.\n\nAs long as you play regularly you'll be fine, just don't expect to craft every single deck per expansion as an f2p player.\n\nJust wanted to chip in as there's a lot of negativity surrounding the game, but as someone who's actually really enjoying the game right now, I want people to at least give this game a try and spend some time before jumping to conclusions as I initially did.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this card game so much genesis dragon go boom! THE SEA RISES! I love Dragoncraft it super fun that I can play the game on my turn unlike another card game with hand traps and omni negates.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not a bad game, but the troble in the begining, make a bad impresion. But I still like this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really fun deck-building game. Every faction has a lot of options to suit your style and adapt to the most used/meta decks you'll see online. I was worried it would take a while to catch up since I started playing during the third pack. But after doing the dailies and events for a while, you can collect a good amount of cards relatively fast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bad card balance. As a Forestcraft-main and kind of new player, the experience is such a pain for the total 36h. Feeling time wasted. Not gonna continuing grinding for more ranked scores without stopping, and preying for a good rng run and hoping not to meet any opponents with tons of meta cards in the deck is the only chance to win with total 1/4 percentage along the whole way climbing to Ruby. If I dont want to keep losing, the best to way is to join them. But i won't Spend much money to draw all those metas, and I only want to play with the cards I have got and play forestcraft I enjoy. It's not interesting to play meta the whole time and there is no much diversity in decks when playing against the player in higher rank.\r\nThe only thing I enjoy about the game is the beautiful art design, epic background music and nice voice actor performance. So you'd better to try for yourself to tell if it is actually fun. At least for the first 12h, i think it's a great experience because there are so many free prizes to get by finishing easy missions and of course the exciting gacha time. After that, the more grinding for nothing, the more painful you might feel. Btw i don't think the game is really bad for the large numbers of the negative comments, it just feels like annoying most of the time playing it against real players. \r\nnote: English is my second language, and I don't usually comment. And I simply want to share what I feel after playing the game and hope to help someone to make decision playing it or not if possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "People hate to much lol... Fun game and you can craft your deck when you play a little.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "...I'm actually going to only thumbs-up this because this game is what Pokémon TCG Pocket wishes it could be and I want it to feel bad.\n\nCompared to TCG Pocket, it's night and day. Vials are much better than pack points, battling isn't riddled with RNG throwing saves, etc.\n\nAs a sequel to Shadowverse, however, tread carefully. If I was coming from SV1, I'd be giving this the thumbs down. But with TCG Pocket's ugly existence, I can actually tolerate this game and it provides more fun than it all the while giving all of its characters more personality. TCG Pocket has two original characters and those characters are virtually non-existent blank slates.\n\nJust goes to show how 90% of Pokémon fans have astonishingly low standards.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The monetization is bad for the mega whales. People just want free stuff. As a light spender I've been able to make whatever I want. Into the forth set the meta is more diverse than what I've seen from the OG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and infuriating. Very fast paced..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some craft seems bit unbalanced from another, but with bit luck you can win",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don´t understand the hate. I am f2p since launch and have 0 problems building decks that are meta.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "another game that will be like abusive partner to you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Card Game albeit a little bit Pricey for beginners",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but kinda expensive/grindy to draw packs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very f2p friendly and high quality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting gameplay though greedy monetization",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played since the start of the Shadoowverse. Still pretty solid online TCG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gruesome grinding and mindblowing troll decks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "บัฟกับเนิร์ฟการ์ดน้อยไป เมต้าเดิมๆตลอด",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A sequel that didnt need to exist but as fun to play as the first one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like being in a relationship with a bad person who is beautiful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice Game With a lot of Comp to play the card game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The in-game economy is not nearly as bad as people say tbh",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i Do really love the shadowverse games but Man this one im a bit sad over but my love for the first one makes me keep playing this one both on PC and Mobile",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s like Hearthstone, but you don’t need to sell your soul to Blizzard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HEARTHSTONE Lite VERSION !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fix your game dawg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its one of the games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once you actually craft a deck its really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Hate this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good gaem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "suffer with me",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Collection of waifus, what more can I want?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good card game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hearthstone with waifus, what's not to love?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "很好玩，嘿嘿!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is ok it's a card game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "albert is my brother",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fate's head will roll. \r\nVictory is mine!\r\n-7 \r\n┐(￣ヘ￣)┌",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love and hate this game..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent card game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super Shadowverse",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fuck Albert",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cards",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EYYYYY TANOSHI",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gafdo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "welp",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": ":)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "あ",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My gambling addict friend said if I post a review and it gets 150 likes and 50 Awards that he will buy me a case of beer, some vodka and 1 kg of lemon So im just gonna leave this here.\n\nМой друг-игроман сказал, что если я опубликую отзыв и он наберет 150 лайков и 50 наград, он купит мне ящик пива, немного водки и 1 кг лимона, так что я просто оставлю это здесь.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I started playing during set 2, and given all the negative reviews about the economy I would worried I would never catch up.\n\nI’m glad I decided to give this game a chance. If you play regularly for freebies and buy the battle pass, you’ll be pleasantly surprised how quickly you amass a large collection.\n\nI’m a longtime Hearthstone grinder. I still love HS but was looking for something new to scratch the same itch and Shadowverse WB does just that. The new player experience isn’t perfect but it’s better than people give it credit for and I would recommend people not to doom over the economy and give it a try.",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "The game is fun, well-polished, and has plenty of close matches that keep you on the edge of your seat. However, the monetization can be questionable.\n\nPros:\n\n-Really fun gameplay mechanics; Evo and Super-Evo are game-changers.\n\n-Many decks to choose from, offering a wide variety of playstyles.\n\n-Everything is well-polished — the art, UI, and voice acting are top-tier for a card game.\n\n-The park feature adds a social element, making the game feel less lonely.\n\n-Amazing paid cosmetics if that’s your thing.\n\n-Daily free card packs.\n\nCons:\n\n-Monetization is questionable. You cannot mill cards unless you have duplicates, which makes it very hard for new players to build decks. Top-ups may feel almost necessary.\n\n-Legendary cards are expensive — 3,500 to craft one, so it takes a lot of saving.\n\n-The gap between free-to-play and whales is quite large.\n\n-Minor nitpick: the art style of each card varies noticeably. You can easily tell that different artists drew them. While nearly all cards are beautiful, the lack of a consistent art direction can be slightly frustrating (for comparison, card games like Gwent or LoR have very cohesive art styles).\n\nOverall, this is an excellent card game. New players and free-to-play users will need patience at first, but once you get started, it’s incredibly fun.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "This game has a whole lot of \"my deck decided that the match is over now\", where drawing a card or waiting on a card just becomes an enrage timer where the amount of time is unknown.\n\nI don't mean simply powerful cards that integrate well with the rest of your deck and depend heavily on how well you played.  I mean literal match ending cards that invalidate many types of decks from being viable in this game and just make whoever used it first likely win.\n\nIt's not even always about damage, some of them just win the match.  Even if they're at full health and have an invincibility bubble on their leader, it will instantly kill them.  That aspect of the game is extremely uncompelling, because there isn't some decision you can make to deal with it, the game just decides that the match is over and there is no satisfying resolution in terms of decision making that gives the player agency over it.\n\nI think they wanted a game with shorter matches to make it more mobile/on-the-go friendly and to optimize the matchmaker.  Shorter matches = healthier matchmaker.  Problem is, they forgot to design a game for shorter matches, where it's part of the design philosophy from the start so it feels like an afterthought.\n\nDespite that, because not everyone decides to put those cards in their deck, you can have many enjoyable matches so long as you stay out of the higher ranks.  If you are the kind of person that chases the meta in any game, this game will probably disappoint you.  One upside is that these game ending cards make it kind of easy even for casual players to get some wins whether they built a great deck or not.\n\nAdditionally, what people say about people just taking turns clearing each others boards every turn is generally true.  You have to build a deck that minimizes your attrition while either buying you time for a game ending card or make sure to integrate aggressive cards that can both clear the board and attack their leader.  That cards have health/defense values is almost irrelevant in most cases, because the cards just get disappeared every turn.  Banish, destroy, infinite damage, deal an amount of damage that's the same as the health it has!  You name it, they've got some version under a fancy name, rebranded.\n\nIn general, this game has several rather unsatisfying (many would read this as \"annoying\") mechanics that aren't just run of the mill bad, but surprisingly and almost willfully bad.  If you can get past that, the game does have some charm and is very free to play friendly regardless what others say.\n\nI think it might be the closest thing to a Japanese Hearthstone out there and needs some TLC from the developers to course correct some issues.  Without course correction, the player churn may be too high to keep the game relevant for long.\n\nEven though it has many design failings and I wouldn't recommend it to everyone, people do exist that I could recommend this game to with all the necessary caveats.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "this game is not free to play , not by a long shot . but the base game is fun and cool",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "you get 1 close match every 50 one sided matches you play.\n\n20 health card game where sword craft can deal 12 damage from hand with a single card and evolve point and that isnt even the best card they have\n\nI still play it though idk why",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Having read all the negatives reviews I decided to give this game a try.\r\nPros: lots of free goodies. I got 2 full prebuilt decks + 40 free packs for free + a bunch of gold + get a free pack everyday.\r\nCons: meta seems to be shit. game feels like you are simply trading removals until your opponent gets an op legendary so you lose.\r\nI didnt like the current meta so I stopped playing. I still recommend it cuz maybe you will like it.",
      "voted_up": true,
      "votes_helpful": 7
    }
  ],
  "negative": [
    {
      "review": "Shadowverse is a card game with gacha elements. \nShadowverse: Worlds Beyond is a gacha game with card elements. \n\nGameplay wise, it's better than Shadowverse, but everything else is just pure evil / bad.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "This game is horrible, as a beginner, you basically cannot do anything productive unless you play for a ton of hours.\nDo you want to do well against an opponent with your new cards? Well sorry, they have 16 legendaries, so you can't win, sorry.\n\nPlease save your time and do not play this game <3",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Never have I ever seen a card game being this hated and the people hating it being so right to do so.\n\nThe first game was... not good... and they started completely anew yet same core gameplay problems are still there. The idea of having so much swing turns sounds nice, but also it encourages meta decks that kill in a turn from the hand with no counterplay or else you will have to play the most boring stall game ever.\n\nThe monetization has been ruined and the game is very expensive. Highest rarity cards are very pushed, and decks revolve around them. \n\nMaybe the draft is good, but I do not care to stick around and find out.\n\n1/10.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "terrible sets that come out too fast. Can't build the decks you want right away unless you wanna spend money. forced to keep a max of 3 cards and can only liquefy extras and not just whatever cards you don't want like in the previous game. only rewards those who choose to put lots of hours just to gain enough coin to open more packs or just drop money.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Fuck this game. Your packs are worthless and your opponents are assholes. I had a nicer review before steam ate it. FUCK THIS GAME.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Someone tried to convince me this game was good, but it really isn't. It's a cash grab. They had everything they needed in the older version, this game brings in only a new option to have awkward looking characters to walk around with? Try almost any other free to play trading card game, and it will be far better than this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Look, this gets a negative review from me even BEFORE discussions about monetization. When you make a sequel, it's really for one of two reasons. Reason 1, you need to fix fundamental flaws in the game that can't be fixed in the original. Or Reason 2, you want to take the base concept, and expand on it.\n\nThis game does neither. They added a 'super evolve' which could have been part of the base game, and then they just copied every card from the original, word for word, into this one. Which means this must be the hidden Reason 3: They wanted more money.\n\nDon't waste your time with this. It doesn't even *look* better than the original. It's as heavy of a no that I can possibly give.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Takes too long to build a deck compared to the original Shadowverse, took 80+ hours to build a single meta deck as a f2p player over the length of maybe a month. I eventually got to Master Rank so I still like the game but it takes way to long to get cards needed for viable decks.\r\n\r\nAlso does not work with a VPN if that matters.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I tried very hard to like this game, but it just got worse with every set. Awful card designs across the board. Most games are decided by coinflip and skill expression is practically nonexistent. Mechanics like intimidate and extremely overstatted minions make it so the player either has the answer or immediately lose on the spot.\n\nI was 'Beyond' multiple times last season when they first introduced GM, but in retrospect it doesn't feel like an accomplishment at all given how this game works.\n\nFor people nostalgic about early hearthstone, don't bother with this.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "After 4 sets of worsening gameplay from an already mediocre start, I'm ok with never touching this again",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's pretty bad. If you don't have every legendary your deck needs you will lose. You HAVE to have the legendaries. It's not even funny. Without them just GG. It doesnt help that there are CLEARLY better Legendaries than others. Havencraft. Sword. Sandy. Its beyond uninteresting to go against the same decks ooover and over. \n\nThe game is also stupidly pay to win. The card craft price scaling goes from like Bronze: 50, Silver: 90, Gold 750, Legendary 3500. Like what the f*ck? So you have to desperately pull and as a f2p you are insanely limited. 'oh but you get daily free pack' cool man, you cant even deconstruct cards until you have more than 3. So I have multiple legendaries I will never use (one cause I dont play the deck, and two because they are TRASH compared to the GOOD legendary cards.)\n\nTLDR: Game is p2w and sucks if you dont either have godly luck, played since d1, or whale.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Can only liquefy cards you have extras of, making crafting for FTP players impossible. Otherwise pretty great game, just not reasonable for FTP players.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I cannot in good conscience recommend this game. On top of a very greedy and grindy gacha system that incentivizes you to spend a lot of money, there is a glaring lack of balance that the devs seem to ignore if only to get people to buy into whatever is meta in a given season. The last few balance patches have done nothing to address clear outliers that make queuing into a game a coin toss. I regret having spent any money on this game and will not be returning unless there is a major balance and or rotation system put in place.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cannot recommend this game to newcomers as this game needs to be heavily grinded and invest so much of your time to complete just one deck that you can use to consistently win some games. The game rarely gave out rewards to build your cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a predatory game if you want to play a card game similar to this play Legends of runetera they are almost identical. \r\nthe other card games that are better are \r\nYu-gu-oh masterduel & MTGA\r\nIn this game you get alot of options for a starter deck, which feels like you have a choice.\r\nHOWEVER they are all insanely dog shit. which then forces you to pull for more. and they dont give you alot of currency to start with so in the end you are forced to pull out your wallet, just to win some games.\r\n\r\nAll in all this game is a 3/10 \r\nthe only reason i didnt give it a 1 is that the art is great and i liked the idea of being able to evolve/super evolve any and all units.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "There are so many problems with this game.\n- The game is simple to play, 99% of the games is just playing legendaries on mana curve, win conditions are not interactable with, so you don't really even need to know which cards can opponent play. Skill is insignificant in individual games, you can easily go on 10+ games losestreaks due to bad luck, to climb you have to spam games like crazy if not playing t0 deck.\n- Events are grindy\n- Decks are extremely expensive, very often 50%+ are legendary cards, while I got by not paying much and have enough vials to create any deck in the game, I just cannot imagine someone joining in right now and even if you want to spend, prices are pretty high. Prepare for 2-3 months of getting destroyed by meta decks before being able to craft something for a class you want to play.\n- Metagame is stale, balance changes extremely rare\n\nThe game has good art, voice acting and cool setting when you read flavor text on cards etc. That kept me playing for a while and is the only saving grace of the game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "TL;DR Do not play this game. Do not give any money to this company, unless you love horse races and Kiryu. Its just and asset flip made in UE5 where Cygames spits on your face and spends your money on their fucking horse game, horse races and the yakuza\nShadowverse 1 died for this. What an absolute mess\nThis game is basically an statement of what cygames has become in recent years: A company that wont mind throwing what little fans from other of its IPs has under the bus just to feed their Umamusume yakuza overlords\n\nSV1 was:\n-One of the most played CCGs at the time (circa 2016) together with Hearthstone and some others\n-Known for being one of the most f2p friendly games of its genre out there\n-A lot of care put into its artstyle which was top notch and every expansion had delighting artwork which i still look to this day\n-A fast paced game which was a nice break from other CCGs at the time\nSV (basically) died in 2024 because Cygames got too comfortable, deciding to balance the game way too late and way too little, without really adding nothing new to make players stick to the game, while their competitors were at least trying to do new stuff\n\nFast forward to SV:WB\nAt the time of writting this, with 8 years of experience and feedback from SV1, 6 months of this game experience and feedback and more money than ever, Cygames in their infinite wisdom has:\n-Made the same game, with the same UI and menus copypasted into UE5 (Which somehow runs worse than SV1???)\n-Reprinted 75% of the art and cards, \n-Made all of your collection, currency and progression get reset, only having a bunch of .GIF's wallpapers from the premium cards (Leaders that changed the hero you played as in their specific class) and only giving you a title and a 10 packs\n-Made 4 set's which have less cards than SV1 release set + basic cards, leading to a stale \"1 deck for each class with very slight variations\" meta. No memes or wacky fun decks either\n-In turn, they have made you earn less currency with your daily quests (So you dont get all 77 cards from the new expansion right away) in exchange of getting one daily pack\n-Game is STILL a balance mess, deciding to \"fix\" it by making each an every game a mulligan and topdeck game: \"Did you mulligan correctly? Good! Now you just need to draw the cards you need, because we havent printed any that tutor specific cards on you deck! Good luck!\" Board state doesnt matter, you play everytime from hand, wiping boards and biding your time till you can OTK your opponent, by either shitting 2948576 worth of stats or just killing him from hand. If you or your opponent leave something alive in board, you probably already lost the game\nI could go on and on about how they have messed every chance and opportunity they had (Popularity contest for example), but i want to get into the \"best\" part:\n\nThe fucking shadowverse lobby (AKA a raw fucking metaverse that is completely unfinished)\nThis is where all the money and dev time went. A nothing burger lobby where you were supposed to do a bunch of activities that wasnt playing the game (Fishing, mahjong?, Raiding for some reason??????) but ended up getting shelved a couple of months before release\nMy only guess its that, during development, they saw the lizardman from facebook say it was \"the future\" and decided to copy it, but as always, it turned out he was wrong.\nSo they decided to just delete 90% of all of that, and since they didnt have much more time to do anything else, they just decided to put half of your dailies and all of your weekly quests behind that abyssmal dogshit of a feature so you use it and have a reason to click it.\nAnd thats Shadowverse: Worlds beyond. I wont be surprised in the slightlest if this game is in the same state as SV1 in around 2 years.\nGod i hate fucking Cygames",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "game is on steam yet still using in-game download for update smh",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So much potential wasted because of the greed of publisher, quite sad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It just like a same game with an unnecessary additional rules.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Embarrassing attempt to revolutionize the TCG genre. Don't waste your time, this has all the monetization of your modern TCG without any of the depth. The amazing adaptation I was speaking of? You can evolve your cards with the click of a button in battle. How unimaginative and dull of an experience that was. It really ruins the idea of creating any kind of strategy. It just becomes a series of tossing down the biggest card and hoping they can't do anything about it, for good reason, they want you to spend money to get those big cards. This is an absolute mockery of trading card games. They have stripped all the depth out just to deepen their pockets.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You can technically make meta decks and play completely for free, but it's going to cost you a ton of free time just doing chores for the game. I recently got a promotion at my job that requires a lot more of my energy and I just don't have time to play this game anymore as my second job.\nThe worst part is the meta sucks so bad that it's not even worth the effort. Also having 20 health in a game where opponents can regularly do 15 damage in a single turn is so incredibly frustrating, plus with enough time tons of decks can do a full 20.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game doesn't change much on OG Shadow EXCEPT that you need three of the same cards to be able to liquefy, otherwise you have to pull.\n\nAfter six months of playing.\n\nOut of the seven classes, there are two or three that play to their strengths. But not all classes stand out.\n\nI won't talk about the monetization of free games. I can only say one thing: a free game is like gambling. If you're lucky, you win, but if not, you'll always lose, so you have to pay to continue.\n\nThe last thing for new players: if you're not lucky, don't come or you'll have money to waste. Because the game is not friendly. You start with nothing but the basic cards and a very basic deck from the new set (one legendary from the new set) but nothing else.\n\nThen again, if you're sadistic and like doing dailies, welcome!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can this fucking game actually shuffle my god damn fucking deck, so I dont see the same god damn fucking card in my opening hand everytime",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meta becomes stale pretty quickly and the game is very stingy with the cards it gives you, It's not particularly worth picking up at this point if you haven't been playing since launch.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am incredibly mixed on this game. I really enjoy the gameplay of Shadowverse and the new additions with Worlds Beyond, but the fairly quick release of sets with stronger mechanics alongside the new monitization methods makes it fairly difficult to keep up unless you happen to have most everything from the previous sets. It is difficult to recommend this game to someone who is newer to card games or isn't willing to spend a lot of time grinding out all of the missions and free gold and vials. It would be nice if they more frequently did the large pack giveaways like in the original shadowverse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its ok. probability says i should have gotten 4 leader tickets and i only have 2. kinda disappointing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As someone with nearly 200 hours in the original Shadowverse, I came into Shadowverse Worlds Beyond hoping for a fresh evolution of a great game. And while the new title definitely has potential, I can’t recommend it in its current state.\n\nThe biggest disappointment is the monetization. Compared to the original, Worlds Beyond feels significantly more aggressive, pushing players toward spending rather than rewarding gameplay. This is made worse by the removal of one of the best features from the first game: the ability to disenchant your cards to craft the ones you want. In a TCG—a Trading Card Game—being unable to manage your collection and work toward specific builds is extremely frustrating. It makes acquiring the cards you actually want far harder, and it turns what used to be a generous system into a grind-heavy and restrictive one.\n\nShadowverse Worlds Beyond could become something great, but right now the systems surrounding progression and card acquisition hold it back. As a longtime fan, that’s incredibly disappointing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "currently game play is very flat - i'm unsure what to make of the new mechanics as it stands, and its only made worse by everything feeling very same-y no matter who you play and who you go up against unless you're playing something goofy with a friend.\nnot being able to dust cards unless you have 3+ of them is extremely predatory, not to mention the prices of the things in the shop. the freebies are plentiful at the start, of course, but its not enough to get you anywhere if you want even a little variety.\nanother strange thing is that, while the art is still very good, there is some card art that just seems unfinished to me - sketch lines on the non-focus areas, colour bleed, etc. i understand that this can be part of someone's art style, but for a game like this, its weird to me. this alone isn't a bad thing, but compounded with everything else it just feels like a hint of things being rushed without thought.\n(a counter point to that would be the implementation of spatial audio, *someone* would have had to have cared for that to be a thing, right?)\n\nif things change i can be convinced to change my review, but as it stands, its rough.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is just shi with good graphic, good performance, nice art, but bad balance. Every update making the game worse. the belial card ? -20POINTS within 4 turn, super envolve it making the game end in 2 rounds + destroying everything on the field?  worst design ever. Throwing 2 belial in 2 rounds. Its just greed behind all those unbalance design card.  GBF wont save the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "not great, i played for the umamusume collab which was alright but otherwise the game itself isnt the best",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Normally i dont leave review, This game is highly pay to win, i have played this game and no, im telling u spending 100 dollar every expansion is not worth it, the game is too greedy, and im talking about real greedy, since this is a pvp game too, it really matter. If u wanna play good shadowverse game just go back to elvove im serious.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Imagine making a game that is basically the same thing as the last one and choose to fuck up the monetization even more..... WOW",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "horrible monetization, ruining what made the original good. don't play this until they fix this garbage monetization",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Difficult to catch up and make a decent deck if you were to start now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't disenchant cards unless you have more than 3 of them xDD I just wonder what were they thinking when they decided to 'reinvent the wheel'.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Waiting for connection... fix servers...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "make decks cheaper pls, its bad for new players",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "GAME NO SELLING CARDS, NICE SU GAME MU",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "gimme old econ broke nigas can't keep up",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Funni card game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just doesn't hook me like the original.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Where's dafuk is my leader at ?!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "sobaad that i dont play it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "we love swordcraft :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pay to win",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "how grind money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It sucks",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Flashy Solitaire.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trash.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this is very p2w",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "o.o",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LONG RANT BELOW. \n\nTL;DR: Don't play it, this game is bad.\n\nI have played Shadowverse:  World's Beyond for over 300 hours. I have played since the game's launch, and have hit the highest rank of each set release as of this review (Master in Legends Rise and Infinity Evolved, Grandmaster in Heirs of the Omen and Skybound Dragons).\n\nI can confidently say that this game is not worth your time, and is a skip.\n\nDuring my time playing I've logged in daily to get the daily free pack, completed every daily mission, grinded ranked religiously each set, and in that time, I've lost all feelings of fun that I've had playing the game.\n\nWhat ruined the game for me is how Cygames has managed their balance with each set release. From the very start, the game has had stupidly overpowered cards that can instantly end games; from Albert being a board clear with Storm that attacks twice and can deal over half of your health with no set up required, to Cocytus D-Climb instantly killing you in a single turn as soon as the Rune player hit Turn 10, there is no shortage of cards that require no skill or thought to use properly. There are so many cards with ridiculous keywords and mind-boggling stats that strategy feels irrelevant if you can just play cards that practically say \"When you play this card, you instantly win the game; ignore how badly you played during the entire rest of the match.\"\n\nCygames saw that there were brainless win conditions, and rather than address the issue, they went in the complete opposite direction and introduced more. With the latest expansion Skybound Dragons as an example, there is a new card named Belial that has a gimmick called Skybound Art. You are rewarded for spamming followers that evolve on their own, providing healing and insane tempo at no cost for you, with a card that will clear the board and set a timer on your opponent that will instantly win you the game the moment it goes off. It doesn't help that they've also introduced cards with RNG elements into them like Sandalphon, who will win games for you because you were lucky enough to hit the opponent's face and avoid their followers on board with his RNG effect.\n\nI feel as though the skill floor in the game has gotten worse and worse over time. As of the latest release, the best thing to do every turn is to simply play a card's cost that matches with the turn number. There's no thought or effort that goes into playing a 3 cost on Turn 3, 5 cost on Turn 5, and so on and so forth, and if a board lasts longer than a turn on the field, then the game is over due to the overall damage being way too high. Every game is just a coin flip between you and your opponent to see if they had better value in their hands than you, and it feels stagnant and infuriating when they get a perfect curve with little way to counter it or get tempo back since snowballing advantage is way too easy. Going second is also so much better than going first, since not only do you get access to a coin that refreshes, essentially letting you play your overpowered cards before your opponent can answer them, but you can also access your evolves before the player going first.\n\nIf you thought there was hope for Cygames potentially balancing cards, think again. Cygames is notoriously stingy at balancing cards even back in the original Shadowverse, and that philosophy transfers here. They have done almost nothing to address the toxic cards running rampant everywhere since they only look at win rates for decks. If a card is incredibly stupid but the deck it's in has about a 50% win ratio due to the amount of trash players playing it and losing, then they will just let that card ruin the game for all players and pretend that nothing is wrong with it. They also have a bias towards not nerfing cards since if they do, they'll have to give out a small amount of crafting currency to the players that have extra copies; and knowing Cygames, they want to keep their economy as low as possible so that you keep spending your sweet money on their monthly battle passes. The only real nerf they have done as of this review is to a single healing card for Haven, which did almost nothing to address the toxic meta of Heirs of the Omen as the nerf came right at the end of the expansion.\n\nI'm very disappointed in this game and myself for how much time I have spent playing it. I loved the original Shadowverse but got turned off by the rise of power creep in it, and I really wanted this game to do well. When this game was announced, I was genuinely excited to see how this game would evolve over time in the modern era, since I believed that it could really carve out it's own niche out of every other card game. But it seems like Cygames has not learned from their past lessons, and will continue to release yet another card that will instantly win you the game every expansion while stealing your wallet on the side.\n\nI will not be opening this game again, and will be instead devoting my time and energy into other games that want to balance things and make the games feel fair for both players. I hope that Cygames will learn from their mistakes and fix their issues, but I sincerely doubt it based on their track record.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": ";(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Imagine to have such great idea with rebooting such godly IP as Shadowverse just to ruin such golden opportunity because of greed and bs decision making...all devs need to do to create masterpiece like in old days was just releasing OG Shadowverse from the old days on new modern game engine and with maybe A LITTLE BIT changes into game and thats it...but greed turns out to be way too strong... ;v\nWhat they did? They ruin whole pack system with 5x the cost of original game while daily rewards give you on average HALF pack per day vs OG SV where on average it was 1,5 pack per day. Whole liquefying system gets rekt to the ground cuz of their greed that force you to buy more packs to be even able to craft stuffs you want cuz in new system you are forced to have 3 copy of card to even be able to liquefy it vs OG game where you open pack and you could dust all cards asap as you wish...not to mention that dusting got extra nerf with ~50% less dust from liquefy cards... ;v\nThen there is matter of how rigged 1 st big event of game was just to \"force\" 85% of community to spend more money in game on overpriced items that should be for free if devs don't rigged tournament when comes to points...once again devs spit on playerbase face with greed...\nWith bs stuffs that is happening in game since release until right now and shi.tty balance that is getting worst and worst every expansion, game will be as unplayable trash game as OG Shadowvere is right now WAY WAY faster than it took OG version of game to reach to it's current trash state... ;v\nOnly positive matter that is way better than OG Shadowvere and overall, is fact that graphical side of game (cuz of new engine) is even more <3 and gorgeous than ever...but sadly thats only possitive aspect in new version of game so far and this is waaaay too little to keep game going in positive way...\nIn current state game deserve half of current positive total % of reviews so maybe devs would wake up from bs greed dream and fix everything 90%+ of playerbase is asking for... ;v\n\nQuick edit: Game balance is still pure garbage trash...nerf this trash unbalanced 1 turn 20pp+ worth of value, full board clear, full board fill, 20hp heal yare yare \"i win in 1 turn and you can do sh.it about it\" runecraft ffs greedgames!!~\n\nQuick edit 2: 4th expansion just dropped and dragoncraft is still garbage shi.tty and \"kicking boy\" like always... ;v",
      "voted_up": false,
      "votes_helpful": 59
    },
    {
      "review": "3 monthes old game, 3 sets released, already such an unfun powercrept meta. Everyone waits the first balance patch. \r\n\r\nThe balance patch : 0 nerfs, 3 totally useless buffs.\r\n\r\nYou can't make ts up. Cygames, take my thumb down.",
      "voted_up": false,
      "votes_helpful": 118
    },
    {
      "review": "the opportunity to start fresh squandered by almost immediately beginning to repeat the design mistakes of the original in addition to far far more greedy monetization and sets that are so small there is virtually no variety in deckbuilding\n\ngarbage",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "Terrible monetization, HS or SW1 lets you disenchant cards to craft new ones. Allowing you to get straight into the game with viable deck and farm a strong one in a couple of weeks of having fun with maybe one more after few months of playing F2P or paying set amount of money. \nHere this mechanic is locked behind completing your set, so you can't craft the cards you need unless you grind with useless, boring deck for months or do the daily login thing for even longer. Even spending a bit of money is not an option with this mechanic, you either spend enough to complete a whole set so you can turn excess rare cards into vials (imagine 500usd+ at least) or waste your time. \nEven if you do decide to spend the money, you'll still have to play hundreds of games against F2P people with decks without a win condition until you rank up enough to play people with legit decks. \n\nGame itself is is ok, but the 'fun' is locked behind 10 AAA games worth of money and weeks of grind or months of grind. 0/10, do not support predatory developers.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "Shadowverse is a card game with gacha elements. \nShadowverse: Worlds Beyond is a gacha game with card elements. \n\nGameplay wise, it's better than Shadowverse, but everything else is just pure evil / bad.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Arguably one of the worst balanced card games I've played, predatory monetization, lack of respect for a player's time and commitment. Gameplay is fine, fun and flashy but even with those three Fs, it's also frustrating, flawed and fatiguing. If you decide to play this, just know that chances are, no, the next card set will most likely not fix anything, no matter when you read this. Play at your own discretion.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "Hearthstone is more generous than this game. Do not expect to be able to keep up with meta unless you're lucky with your card pulls and if you're f2p player and decided to take a break or didn't play since game released? You're SOL.",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "I would like to recommend this, because I very much enjoy most card games, and this one has cool ideas. But dear god in heaven, this game is a test of willpower to keep forcing yourself to push for ranks and rewards. You'll win 6 or 7 games in a row, and feel pretty decent about your deck. Then you'll rank-up to a new group and suddenly have a 9-game losing streak against opponents who are drawing absolutely perfect hands and countering every move you make. Maybe you'll think \"damn, I should drop some money to get some more copies of legendary cards so that my deck is more consistent\". If you enjoy spending lots of money on packs for that reason, more power to you. But playing in any group past ruby makes me want to claw my own eyes out no matter how fine-tuned my deck is. Straight-up not fun.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "This game is horrible, as a beginner, you basically cannot do anything productive unless you play for a ton of hours.\nDo you want to do well against an opponent with your new cards? Well sorry, they have 16 legendaries, so you can't win, sorry.\n\nPlease save your time and do not play this game <3",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Omens (Set 3) is the most obnoxious set to make an okay game into one of the most unfun meta.\nJust bring multiples of OTKS (One turn Kills) and Do nothing and win the game metas.\n\nAdditionally, almost every in-game events are just play some games for minor rewards. When they did have a promising event, they somehow still fumble everything and make the community outrage.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Meta and set releases too fast. Can't keep up and makes it less fun.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "its fun at first, welcoming community and all but its extremely pay 2 win in higher elo rank game. But overall its around 7/10 for me but i wont recommend it unless you're a spender in this game.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Never have I ever seen a card game being this hated and the people hating it being so right to do so.\n\nThe first game was... not good... and they started completely anew yet same core gameplay problems are still there. The idea of having so much swing turns sounds nice, but also it encourages meta decks that kill in a turn from the hand with no counterplay or else you will have to play the most boring stall game ever.\n\nThe monetization has been ruined and the game is very expensive. Highest rarity cards are very pushed, and decks revolve around them. \n\nMaybe the draft is good, but I do not care to stick around and find out.\n\n1/10.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really wanna get into it buy just can't.. it's easily the worst new player and free to player model I have ever seen....\nI have rerolled using 6 different accounts, opened all the \"free\" stuff, did the tutorials for gold and summons(exhausted the bigger ones) and still in all 6 accounts, couldn't make a single proper deck or even one that I remotely am interested in... \nThe game is for whales... none whales avoid! You're welcome!",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Bad balance and instead of trying to fix it, let's just release even more imbalanced cards! Tournaments bugged, overall rewards is low. My thoughts - just don't waste your time on this game.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "terrible sets that come out too fast. Can't build the decks you want right away unless you wanna spend money. forced to keep a max of 3 cards and can only liquefy extras and not just whatever cards you don't want like in the previous game. only rewards those who choose to put lots of hours just to gain enough coin to open more packs or just drop money.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Don't bother trying this game. One of the worst balanced card games I've gotten to experience. Shills will tell you \"The meta is fine there's 4 viable decks.\" Ignoring the fact that 2 of the decks have been meta since the 1st set. 1 of the 4 meta decks creates literal non games where you wait to die from burn damage. And the devs are unable to make actually interesting new cards for the under performing decks. Save yourself some annoyance go play literally any other card game.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Honestly, this game is pure luck. \r\nEvery time a new deck comes out, it seems runecraft or swordcraft get a massive boost. In game currency isnt exactly the easiest to get, matchmaking is messed up because you keep getting pitted against extremely high ranked players, so much lag in the park, and of course, if you think about spending money, you're better off spending in other games. Even crappy ones like Apex. You'd have better luck pulling an heirloom than pulling a card your deck desperately needs. Oh yeah, sure you could craft it but thats another in-game kidney you'd lose. \r\nNot recommended. Play Hearthstone or Magic lol.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really wanted to like this game, but it has so many glaring issues that are if anything, worse 4 months after release.\n\nI could rant all day about the bad interactions, card imbalance, Cygames disingenuous practices, class favouritism and stale meta of 3 classes comprising more than 60% of all matches, but it, like this game is just not worth my, or your time.\n\nNot to mention Cygames up to their usual BS with a rigged community event and generally limited rewards from events, dailies and other sources.\n\nThe card pool is too small to allow for any real variation between decks, with each archetype having a predictable curve that comes out every match save a little rng on draws.\n\nThis causes you to not only have the dice roll on if you get a favourable class match-up, but also the dice roll on your draws, with the small card pool limiting the ability to make any real variation from a core archetype, furthering the repetitive nature of the game.\n\nThis current set (Omens) has been the final nail. The biggest issue is the healing/aggro balance, where the meta Haven, Rune and Dragon decks can reliably have 40+ health over the course of a game, which on top of their access to wards and board wipes makes finisher cards like Albert or Roach too expensive to break through, while also being oppressive to other classes, where playing Forest or Portal against Sword, T8/9 is a 12 HP check.\n\nThis also raises the issue of coin, going second is a clear advantage, not only having an additional mana early, having curve on evolve unlocks and another additional mana past turn 7. The game is also very reactive, furthering the advantage of going second, allowing you to take tempo before your opponent can evolve, forcing them to miss evolve effects to clear your board.\n\nOverall, I would reccomend you don't play this game, it's just not worth the frustration.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Fuck this game. Your packs are worthless and your opponents are assholes. I had a nicer review before steam ate it. FUCK THIS GAME.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Power-creep is insane in this game. Perhaps the worst I've seen in a CCG. Theres three sets, thats how long it took for the downfall. The devs announced a balance patch, but it was 3 useless buffs. Joke of a game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "If you are thinking of playing this as a free-to-play, don't even consider it unless you enjoy being bullied by what seems like everyone using the latest new deck while you struggle just to finish yours. Yes, the game does give you dailies, but it hardly adds up to anything because this is a gacha after all, with multiple other classes and whatnot. So, for you to get what you need , the chances are completely against you. Unlike in the original Shadowverse, where you could break down any card you wanted, now they require you to have three copies of a card before you can even think of breaking them down for vials. This makes it even more unfriendly for free-to-play players. After you do dailies, you have zero way to get currency besides Take Two, which also costs currency, or story, which is a one-time deal. You get absolutely nothing for doing ranked matches besides rank points and the five random daily chests event. So prepare to farm for a very, very, very long time before you can even switch decks and enjoy getting pushed around, forcing you to A ) become numb to it or B ) break down and waste hundreds to thousands of dollars like the other no-lifers. XD If you want to play a card game, I recommend a truly random free-to-play card game where the cards are all accessible without the dumb monetization, so you can have a real competitive scene. Yu-Gi-Oh! has quite a few online , I do know, but besides that, like I said, avoid this like the plague. It is fun for a minute, then just becomes unfair trash that makes you question why you wasted your time, especially for old Shadowverse players who worked hard going through the deck-building hell just to be screwed all over again, losing everything and having to start all over. The cash-based deck building is the worst part about this game, and they messed us up like this with trash rewards for returning players, not even close to fair compensation, especially for people who did spend money.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "greedy monetization , shit balance , very bland and very little room for creativity",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game currently has an unstable internet connection while the match is happening. And worst off the timer doesn't stop whenever this happens. In fact the timer doesn't stop for anything the players don't have control over. In fact this problem happened in an official tournament. In fact it was so bad Cygames decided to give a moderately generous apology by giving them in game rewards. That's how bad the match connections are.\n\nIf you love card games, sure, play this game. I'm sure most of the negative reviews come from people who are and still clocking in hours. But Cygames doesn't deserve anymore players for this game if they let this sort of slop continue. Go play with horses instead.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Horrendous experience outside of the mechanical quality of life updates. The card pool is shallow. Cygames released 77 cards in expansion 2 and 3 with a good chunk of them being pack filler. The actual gameplay is repetitive and rewards pattern abuse rather than good decision making and resource management. Variance is a part of card games and skill any good player should have is knowing what lines give them the best chance at winning, and knowing how they can create their own edge. In that regard the game feels shallow. Shadowverse (2016) had its problems, especially so near the end of its run, but some archetypes in the game rewarded good judgement and execution. \n\nI'm saying this as someone that understands the kind of game Shadowverse and Shadowverse WB is. The games are meant to be fast. Being aggressive and decisive will help you close out some games. Saying the game doesn't require skill at all is reductive. \n\nThat being said, this game isn't for me. A lot of competitive players from Shadowverse (2016) have voiced their frustrations with Shadowverse WB. I've tried to be open minded but I can't do it anymore. The game is unfun. The economy for cards is terrible. Sure you can be F2P if you log in and play every day, but it doesn't matter if the actual gameplay is exhausting and doesn't invoke a natural desire to grow and improve. I toughed out the first two expansions hoping that it would get better, but it didn't. Cygames isn't going to change because they don't need to. People are going to continue paying money for this terrible experience. I wish them the best. I'm done.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "First two sets everyone just play Storm to my face, now that it is a third set everyone just directly deal damage to my face and board and I could do nothing to about it. Not a very interactive card game I'd say and there is so little communication from the team regarding players feedback.\r\n\r\nIn term of collecting cards, this game is fine - you earn enough to get by until the current set if you've been playing from day 1. Good luck if you're a new player, though.\r\n\r\nCosmetic? everything is overpriced for no good reason when it is a DIGITAL CARD GAME.\r\n\r\nOverall: Yay! Tanoshit/10",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "First and second pack is acceptable meta with pros cons and counter measure to each. But this Third pack is suck. You need to set up faster than opponent that all. New deck have their condition card that need to play as fast as possible in every class you only need is draw it. Well, that mean if you done first you win or it will be a long game and you need to struggle hope they out of useful card while you need to done your set up too.\n\nMeta is boring every deck is control deck. You win because your luck is better. No flex deck like old mid range abyss or artifact portal in meta. No aggro deck. Only control deck. Time need to play per game is higher with that.\n\nFor me, crafting mechanic is ok. Free player can get 1 deck. If you boring and want new deck now, buy battle pass give you more 2 deck (or 1 expensive deck). I think it not play to win it just you get the deck first. In the end free player will have too. Not like rpg game that lv cap. can be increase the deck have limit card can be use legendary can be trash card. And game have group if you ero is low, you still can climb the rank.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I had my fun with Shadowverse Worlds Beyond.\n\nI think the game is absolutely fun, and I really like the visuals. I stayed and played this game for those reasons alone. However, there were many cracks that have shown since launch, and, now, it's time for me to quit.\n\nI'll try to keep it short.\n\nI don't like the economy/monetisation, and the events.\n\nI thought the game's economy wasn't that bad at first. But, now that we're in the third expansion as of this writing, decks feel expensive to make. I don't think the amount of rewards is enough anymore.\n\nAs for the events, the Popular Vote event felt rigged. Other comments have explained this, so I'm not going to dive into it. Just note, if that's how players are going to be treated (with events being rigged and their time not being respected), I don't want to be part of it.\nAlso, my time is not being respected with other events like these stupid chest ones. On top of having to win a match to open a chest, why do those chests appear randomly? I sometimes needed to spend 2-3 hours to open all 5 daily chests. Ridiculous.\n\nThere are more problems I have with the game (such as the balancing), but the problems I mentioned were the tipping point.\nI want to love this game, but I don't think it'll get better.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I want this game to succeed but the meta for S3 has been by far the worst meta. They want to focus buffing cards but some are just so over tuned that this game isn't enjoyable competitively.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Someone tried to convince me this game was good, but it really isn't. It's a cash grab. They had everything they needed in the older version, this game brings in only a new option to have awkward looking characters to walk around with? Try almost any other free to play trading card game, and it will be far better than this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "after months of trying to find a deck to play, crest haven finally comes just for everything else in the game to come and ruin everything. sword kills you by turn 5, rune kills you without you ever being able to stop them, mode abyss having the answer for everything. but it seems like whenever you play those decks you can't get the basic gameplan down because your hand is shit and your opponent drew the nuts everygame. most of the time matchups come down to who is going first and nothing else really matters. Zirconia on turn 4 going second in the mirror is a stark contrast to a turn 5 Zirconia going first. the devs need to balance their game but instead of doing that they want to help the underrepresented classes that won't change the meta or how the game is played so the people on the bottom are getting their asses kicked slightly less than before. maybe in a few set releases and most of the player base quitting will be what they need to get this to a playable state but right now this is the first game iv'e had to uninstall and quit out of actual pure frustrations of just trying to enjoy playing the game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Look, this gets a negative review from me even BEFORE discussions about monetization. When you make a sequel, it's really for one of two reasons. Reason 1, you need to fix fundamental flaws in the game that can't be fixed in the original. Or Reason 2, you want to take the base concept, and expand on it.\n\nThis game does neither. They added a 'super evolve' which could have been part of the base game, and then they just copied every card from the original, word for word, into this one. Which means this must be the hidden Reason 3: They wanted more money.\n\nDon't waste your time with this. It doesn't even *look* better than the original. It's as heavy of a no that I can possibly give.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Takes too long to build a deck compared to the original Shadowverse, took 80+ hours to build a single meta deck as a f2p player over the length of maybe a month. I eventually got to Master Rank so I still like the game but it takes way to long to get cards needed for viable decks.\r\n\r\nAlso does not work with a VPN if that matters.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I tried very hard to like this game, but it just got worse with every set. Awful card designs across the board. Most games are decided by coinflip and skill expression is practically nonexistent. Mechanics like intimidate and extremely overstatted minions make it so the player either has the answer or immediately lose on the spot.\n\nI was 'Beyond' multiple times last season when they first introduced GM, but in retrospect it doesn't feel like an accomplishment at all given how this game works.\n\nFor people nostalgic about early hearthstone, don't bother with this.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I'm leaving a negative review for the following reasons:\n\n1. Victory chest reward event doesn't respect the players time. Having a 'chance' for a chest to appear is an extremely frustrating mechanic that is there just to waste the players time. On top of that, the rewards are pretty sub-par for the effort. Either rewards need to go up or getting the chests needs to be easier.\n\n2. Getting leaders from the sets feels extremely bad. Why did they increase the amount to pity AND split the cosmetics for each leader into 3 different parts? Really? If you got everything related to the leaders the increased pity would be somewhat acceptable. Making the daily free pack count towards pity would also be a good start. As is, it feels really unrewarding as a mechanic.\n\n3. Balance is non-existent. They plan to do a balance patch this month but I think it will probably be too little too late. There are way too many singular cards that are just so strong that there really isn't an answer for. A lot of the time it feels like I have zero agency on whether I win or lose a game. If I don't draw X card and my opponent draws Y card I just lose the game instantly. There just isn't much room for any outplay in this game.\n\nThe game was fun for a time, but these main issues have just sapped my motivation to play the game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "After 4 sets of worsening gameplay from an already mediocre start, I'm ok with never touching this again",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's pretty bad. If you don't have every legendary your deck needs you will lose. You HAVE to have the legendaries. It's not even funny. Without them just GG. It doesnt help that there are CLEARLY better Legendaries than others. Havencraft. Sword. Sandy. Its beyond uninteresting to go against the same decks ooover and over. \n\nThe game is also stupidly pay to win. The card craft price scaling goes from like Bronze: 50, Silver: 90, Gold 750, Legendary 3500. Like what the f*ck? So you have to desperately pull and as a f2p you are insanely limited. 'oh but you get daily free pack' cool man, you cant even deconstruct cards until you have more than 3. So I have multiple legendaries I will never use (one cause I dont play the deck, and two because they are TRASH compared to the GOOD legendary cards.)\n\nTLDR: Game is p2w and sucks if you dont either have godly luck, played since d1, or whale.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Poor game balancing, bad connection issues, and crash issues...",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "No attempts to balance the game. Balance patches are one of the advantages of this genre yet no balance patches for the first 3 months of the game despite obvious imbalances. Launch months basically decide the lifespan of live-service games, so this sort of laziness is baffling.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Can only liquefy cards you have extras of, making crafting for FTP players impossible. Otherwise pretty great game, just not reasonable for FTP players.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No, the game itself is normal, but the crashes are crazy. Fix the servers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its genuenly a really fun card game and the persentaion is great and the art is fantasic but the meta is NOT the greatest and the monetizeion is a MESS if you like card games i WOULD reccomomend this game but if you are new to them/no a fan of them THIS IS NOT FOR YOU.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I cannot in good conscience recommend this game. On top of a very greedy and grindy gacha system that incentivizes you to spend a lot of money, there is a glaring lack of balance that the devs seem to ignore if only to get people to buy into whatever is meta in a given season. The last few balance patches have done nothing to address clear outliers that make queuing into a game a coin toss. I regret having spent any money on this game and will not be returning unless there is a major balance and or rotation system put in place.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cannot recommend this game to newcomers as this game needs to be heavily grinded and invest so much of your time to complete just one deck that you can use to consistently win some games. The game rarely gave out rewards to build your cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a predatory game if you want to play a card game similar to this play Legends of runetera they are almost identical. \r\nthe other card games that are better are \r\nYu-gu-oh masterduel & MTGA\r\nIn this game you get alot of options for a starter deck, which feels like you have a choice.\r\nHOWEVER they are all insanely dog shit. which then forces you to pull for more. and they dont give you alot of currency to start with so in the end you are forced to pull out your wallet, just to win some games.\r\n\r\nAll in all this game is a 3/10 \r\nthe only reason i didnt give it a 1 is that the art is great and i liked the idea of being able to evolve/super evolve any and all units.",
      "voted_up": false,
      "votes_helpful": 7
    }
  ]
}