{
  "positive": [
    {
      "review": "[h3] As a close friend of mine stated: \"It's like shuffling Spotify, but only with Soulsborne soundtracks.\" [/h3]\n[h1] I couldn't agree more. [/h1]\n\n\n[hr][/hr] \n\nThis has not to be taken as a negative aspect of the game, instead, it's on of its main powers if I gotta be honest.\nOne of the main things that I appreciate in games are the Soundtracks, the OSTs, and the ones made by FromSoftware really slap! Harder than the Fume Ultra GreatSword! Harder than Smough's Hammer!\nThey really seep deep into your mind, burying themselves in your brain, giving you strenght, sadness, courage, pride: [b] MAKING YOU FEEL SOMETHING! [/b]\n\nEvery time I see an Enemy, a Mini-Boss, a Boss, an Horde, I feel all the emotions that both the Dark Souls Trilogy and Elden Ring have made me feel in the past, making my heart shake.\nIt's like coming back to those games, but under a new light (or shadow, if you get what I mean): I always thought \"It would be SO COOL to see how DS enemies and weapons interact together with ER!\".\nAnd here we are! BTW, this game's trailer was released some minutes after I've finally beat ER DLC's final boss, so it got me really in hype!\n\nI'm a [b] BIG LORE LOVER [/b] of these games, I always search for more details, connections, trying to resolve mysteries and dilemmas; and as one I have to say that if you're the kind of dude which screams at anything \"This game has no real lore! It's not even connected to the main series! Therefore it's total trash!\" I don't really blame you, you're kinda right in some ways, there's not really much to go against.\nBut at the same time I really think you should rethink about your \"\"purist\"\" behaviour. \n\n\n[hr][/hr] \n\nThis is a [b] REALLY [/b] great game to enjoy, both [b] ALONE [/b] and with a [b] FRIEND [/b] or [b] TWO [/b]!\nSure, it can become repetitive after a while, or get frustrating for some aspects, but, which game doesn't after all? \nSure, I don't have a lot of hours played, and that's because of personal reasons unrelated to the game itself, but even if I don't have that much hours, I can say for sure that I've lived this game's experience itself. Not to be taken as [i] \"damn, with only that little gametime, already feels done and finished?\" [/i] but as [i] \"if you played DS and ER, BB, etc. you surely know the MAJORITY of how this game works.\" [/i]\n\nI get what people mean when they complain about Nightreign, [b] I really do [/b], but if atleast half of them decided to open their hearts instead of sticking with their vision, maybe they could enjoy everything more, not only this game.\nThat's why even tho you should have high standards, at the same time you should keep your child-immagination, because that's what makes you dream and enjoy kind of everything that gets in front of you.\nJust think of how amazed you were when you played games as a kid, everything seemed special; [i] now you're just in search of things to despise because of your lack of immagination. [/i]\n[B] Be strong fellas, and never stop your brain inner clocks. [/b]\n\n[hr][/hr] \n\nLet me tell you this: \n\n[b] \"Traveller of the silent dawn, fix not thine eyes upon that which glitters alone, for the mirror decieves and the mask may wear the face of truth. \nLet not thy judgement be fettered by the gauntlet of old-customs, nor thy spirit confined to the realm of the known. Embrace the new tide that swells beyond thy shores, for stagnation is the hollowness of the undying. \nDare to wander, dare to dream, and let thy blase cleave the veil of certainty. There shall thou find renewal and freedom. \nGiven time, technique never fails.\nBe safe, friend. \nDon't you dare go hollow.\" [/b]",
      "voted_up": true,
      "votes_helpful": 101
    },
    {
      "review": "Man, this is a tough one. There is a lot to love here for Elden Ring fans, but I'd say the game misses it's mark overall.\n\nObviously, you've got the same fantastic Elden Ring combat. Plenty of familiar bosses are here, and in particular there are a few from the Dark Souls franchise which I thought was an awesome addition. Characters are extremely diverse and allow you to approach your favorite play-styles in unique ways when incorporating the special characters abilities. There is a character here for most everyone, and its fun to switch it up and improve at all of them. Nightlords are, for the most part, really fun and engaging fights that demand your attention and teamwork (there are some stinkers though, you know the ones). Leveling system being more streamlined compliments the new faster-paced gamplay nicely. And skins are pretty cool overall too. \n\nBUT.....there is not even close to enough variation in content here. Build variety is technically there but so many effects and passives are just boring and enhance your character in the most minuscule ways. Relics are just like the effects; there are a FEW interesting ones but by and large they are boring and unneeded for success in the game. Honestly, by the time you have beaten all the Nightlords for the first time, you will have seen basically the entire game. The amount of map seeds in the game is a JOKE, and the boss pool is laughably small considering all the bosses they could have used but didn't. The 'rare' occurrences in the game are quite frankly TOO rare, to the point where you almost never see them in any given session. Then, instead of maybe adding more stuff to the game, they made Deep of Night mode instead, which is an absolute grind-a-thon that gets unendingly frustrating even as early as Depth 2.\n\nWe're SOOOO close guys! This is a fun and engaging Elden Ring spin-off, but it is BEGGING for more variety. I have had fun with it, enough for me to still leave a positive review, but saying I recommend it would be a huge overstatement. Give it some time to cook if you are on the fence, hopefully the upcoming DLC will fix some of these problems.",
      "voted_up": true,
      "votes_helpful": 66
    },
    {
      "review": "好玩！非常上瘾，出之前：缝合怪，出之后：我求求你多缝点。肉鸽元素挺弱的，但深夜模式的新词条略微补足了这点。非常期待dlc的新地图和新角色。\r\n\r\n我说有个游戏更新多且快，dlc还在同年端上桌，你说别带1234 56",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "\"Come on, who wanted Fromsoft to do a Elden Ring multiplayer battle Royale? This is so unnecessary. They're just milking ER because it's such a huge success. I hate this\".\n\nThis is me, from the past before playing NR. I cannot believe how much of a hater I was saying things like that, but in the end it doesn't even matter. I had to play it to lose all the hate. And discover that even with a lot of flaws, NR is so fun, interesting and a new concept with characters that are charming. So now I'm a huge fan of this game. Even playing with randoms can be fun (at least sometimes is fun, but a lot of times is frustrating). But with friends? This game is 100% a blast. I DEFINITELY RECOMMEND IT!",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "Perfect game for playing with friends and relaxing",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Attempting Everdark Libra for 10 hours until finally getting a run where we killed him in under 2 minutes so passionately and mercilessly he didn't even get to go into phase 2 was pure bliss, I was riding that high for days. Great translation of souls gameplay into multiplayer, fun with a static group at least. It is repetitive and deceptively fast paced, if you want to stand a chance against some of the harder bosses you will be optimizing your runs a lot. I hate the trolls. I wish there was more than 1 map. I enjoy much, one of my favorites of the year.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "i wish they would add covetous demon and demon of song to this game they are my favourite fromsoft bosses ever",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The game hits that perfect mix of Elden Ring combat with roguelike chaos. Every run feels different new layouts, new enemy setups, new BS to deal with. It keeps you on your toes in a good way.\nCo-op is where it really pops. When the team clicks, the fights get stupidly fun clutch saves, crazy combos, full panic moments that somehow turn into wins. Even solo, it’s got that “one more run” addiction.\nIf you’re into Souls-like challenge with real replay value and constant action, this thing delivers.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Engaging gameplay and beautiful soundtrack,had fun playing it daily with my girlfriend.\nLooking forward to The Forsaken Hollows(and more aura farming)",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "~ DIFFICULTY ~\n🔲 Beginner-friendly\n🔲 Easy\n☑️ Hard (Demanding roguelite combat. With element specific Nightlords, RNG elements, 3-player Nightlord battles. Success will really depend on all 3 things lining up at once during a match)\n🔲 Extreme Souls-level punishment\n\n~ GRAPHICS ~\n🔲 Poor\n🔲 Average\n🔲 Decent\n☑️ Beautiful (Dreamlike Limveld nights, detailed environments, and unique Nightlord designs)\n\n~ MUSIC ~\n🔲 Unremarkable\n🔲 Adequate\n☑️ Beautiful (Epic orchestral score that heightens every expedition and boss encounter)\n\n~ STORY ~\n🔲 Absent\n🔲 Minimal\n☑️ It's there for those interested (Nightfarer backstories integrated with Elden Ring lore)\n🔲 Deep narrative\n🔲 Grand epic\n\n~ PRICE ~\n🔲 Too low\n☑️ Perfect Price ($40 for extensive co-op roguelite Souls experience)\n🔲 Slightly high\n🔲 Overpriced\n\n~ REQUIREMENTS ~\n🔲 Potato PC\n☑️ Average (Optimized for mid-range hardware, playable on Steam Deck at 30-40 FPS)\n🔲 High-end\n🔲 Top-tier rig\n\n~ LENGTH ~\n🔲 Short runs only\n🔲 Brief\n🔲 Moderate\n☑️ Long (50-100+ hours mastering classes, relics, and escalating challenges)\n🔲 Endless\n\n~ FUN ~\n🔲 Dull\n🔲 Average\n☑️ Highly engaging (Adrenaline-Runs with co-op and satisfying combat synergies when matched with a good team)\n🔲 Unmatched\n\n~ REPLAYABILITY ~\n🔲 Linear\n🔲 Limited\n🔲 Good\n☑️ Infinitely replayable (RNG relics, Nightfarer variety, procedural expeditions, DLC support)\n\n~ WORTH BUYING ~\n☑️ Yes (Essential co-op extension for Elden Ring enthusiasts)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Surprisingly fun, challenging and durable.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Perfect Co-op game just needs some more content from previous titles to improve the randomness.\nAnother Classic for sure.\nHungry for the DLC",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's an interesting spin on the Elden Ring gameplay. I expected combat to be more different but it's not really dramatically different from Elden Ring. The main difference is itemization and how you build your character given the heavily level and time limited system. It feels like overall faster Elden Ring.\n\nI find the roguelike structure to be sometimes frustrating but overall I think it's better than I expected.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A Souls game, in this format (i.e. Fortnite-ish) isn't for all Souls fans.\nBut it's fun in small doses for what it is.\n\nPersonally, I don't like RNG being involved in what dictates a \"bad run\" or a \"good run\".\nSome elements are overtuned, while others are undertuned.\nI like taking my time to explore in Souls games, and the time-crunchiness of the night rain bogs down my enjoyment.\n\nBut, while it's not exactly my cup of tea, I can still appreciate what this game is doing.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Probably the best online co-op game I have played, no surprise it's been nominated for best multiplayer game of 2025. Really liking the new competitive mode and ranking system. Love the OSP (On-site procurement) feature and random events in the world, which makes every run different from others. Variety of playable characters makes it even more enjoyable. Totally recommended.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "A great spin on the Souls-like formula, utilizing many of the best aspects of Elden Ring's combat while punching it up with unique aspects. Combo'ing character abilities to keep bosses stunned, building up afflictions or reviving downed allies all feel immensely satisfying. Along with traversal that genuinely makes it kind of hard to go back to using Torrent in the main game. \r\n\r\nFun solo, fantastic with a friend or full squad of three.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "From the moment I entered this game, I could feel the intensity spike with the unfamiliar enemy patterns, ambush corridors and bosses that hit like they’re personally offended you dared to return. The initial runs took a lot of trial and error to understand what actually allows me to survive the first night in the game. The game demands you to be versatile with the range of classes provided since each of them have a stat scaling which directly affects the weapons to be used and the playstyle that comes with it. I enjoyed this journey with my fellow companions as we died over and over to random things in the map as we overestimated our strength at times. Sometimes the frustration of losing a perfect run with great buffs and weapons due to not paying attention to the closing mist circle would make me want to rage quit and at times the runs would be a breeze once we knew what we were doing. Its a great experience to share with your friends as the rogue-like aspect to the game keeps your experience fresh with different team comps.\n\nDifficulty to 100% -\n(3/5)\nPerfecting it has been a tough but addictive challenge for me. The game demands far more than a single clear as you need to beat every Nightlord, finish all the Remembrance storylines and push through tons of runs where RNG either carried me or completely crushed me. Some Expeditions feel smooth and satisfying, while others fall apart because of one mistake or bad loot. With a good co-op session the grind becomes much more manageable, but solo attempts can be brutal AF.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I really enjoyed it, top tier rougelike game.\r\nbut fromsoft was really dry with updates, could have done way more with the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great soundtrack, great gameplay, great designs. This is a faster and more streamlined version of ER without anything about it's story or level design and it works perfectly for this type of game. All of the characters play very differently from eachother which helps keep the game fresh for longer if you're trying all of them out. \r\nI only wish the rouge-like aspect was explored a bit further, having more extreme effects on your character based on the upgrades you choose as the game progresses, but since matches can't go on forever like other rouge-likes I guess they have to cap your progress in a way, otherwise it could become too easy. Relics are sometimes the thing that has the most effect on your runs and they are set before going into one, they can encourage a different playstyle for a specific character which can be fun, but what is not fun is having to gamble all my (in-game) money to hopefully get the relic I want or having to play hundreds of matches to get a drop at the end that may have a relic I wanted.\r\nThe addition of character abilities and \"ultimates\" is great and they all feel unique and useful in their own way, some characters are more inclined into their strengths than others in terms of attribute scalings and could use a rebalance, but most characters are super solid. The map could benefit from some more variation, currently, only most the structures change places every run (ignoring shifting earths) but the terrain stays the same. Ideally I would love some procedural generation for more variety but I understand why they went with the simpler route.\r\nOverall the game is super fun, especially with friends, hopefully more characters, expeditions and changes to the map keep coming along after Forsaken Hollows",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "fire game, sick gameplay and addicting gameplay loop",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun, fresh ride if you’re already into Souls games. It hits all the right notes: great combat, memorable bosses, strong music, and plenty of callbacks that longtime fans will catch. It’s tough at the start if you’re not used to challenges of the Souls games, but once things click, it feels genuinely rewarding.\r\n\r\nMy only real gripe comes at the communication aspect. It’s not awful, just a bit lacking for a game that moves this fast and expects quick decisions.\r\nSeveral updates aimed at fixing the game’s disconnecting problem (which, honestly, all FromSoftware Souls multiplayer titles suffer from) are definitely moving in the right direction, though there’s still work to be done before it feels truly polished.\r\n\r\nHopefully the DLC brings some QoL improvements for both the system and the characters, so they don’t overshadow each other and each run feels more rewarding instead of repetitive.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A very good co op experience that's much better with friends than with randoms. I also hope future soulslike games adopt this approach to different classes having distinct playstyles, in addition to just stat differences.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game has a potential to become the best fan-service power-fantasy thing in history of FromSoft, and you wouldn't even need mods for it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "nice game, 100% recommend and if u suck like me go make some friends who can carry you",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is insane. On one hand, the roguelike mechanics and run-based gameplay feels sorta dull and uninspired. Yet at the same time, Elden Ring's mechanics but supped up feel fantastic. The reuse of old Souls bosses feels lazy in a way, but then they have new moves or are reintroduced in interesting ways. The biggest standout thing is the Nightlords, which are just emphatically what I've always dreamed of: Souls Raid Bosses. The music, fight design, and presence of these fights make them some of the best FromSoft has ever made. Also, Co-op is so fucking fun and I love playing this game with friends, unparalleled fun factor and satisfaction.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I'm a huge From Software fan and when I first heard about this game I was skeptical about the concept and if it would even work. Fast forward to now nearly 200 hours later and I can confidently say that this game is peak! My 2025 GotY and I'm super looking forward to the dlc next month! The devs have listened to the players all throughout the last few months and have added so many updates that have improved the game and made it a more enjoyable experience! Now do I still get my teeth kicked in? Of course. Will I do another run before going to bed? You better believe it! Seeya out there Nightfarers! 🫡",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A FROM Soft multiplayer game that sits somewhere between roguelike and PvE battle royale, and I mean that in the most complimentary way. For me, someone who likes games that require knowledge of the game's content and systems, Nightreign has just the right amount of RNG. That is to say, not much of it. Once you get far enough in the game, you can pretty much set up a map exactly the way you want, setting yourself up for success on the subsequent run. \r\n\r\nIf you're an adult with real life responsibilities like kids and pets, it might be hard to find the relatively long stretches of time required to complete runs. However, if you have the time, it's some of the best multiplayer gameplay with friends that FROM has ever done.\r\n\r\nThe game doesn't provide the best tools for communication in random matchmaking, but players make do. The game really shines in a team with friends.\r\n\r\nIt's one of my favorite games of the year.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is my first soulslike game, and I'd say I enjoy it quite a lot. Caligo and Heolstor are my two favorite bosses, those fights are absolute cinema.\r\nSome Nightfarers could use some balancing to be more useful (looking at Revenant)... hopefully with the upcoming DLC.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This is 2025 best coop game lah.\r\nFrom Software really good with action game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "perfect game to introduce your hesitant friends to get into the souls franchise whilst also making sure they dont get bad habits such as panic rolling\r\nits fun for long time players or just as a party game\r\n10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "There's a lot to talk about with this game, but I'll try to keep it short. I did not expect to enjoy this game as much as I did when I first found out about it. If you have friends who are familiar with and enjoy the combat mechanics of the Souls games then I think this is a no-brainer purchase. It's addictive. You'll have a great time together. It's a distilled Souls multiplayer experience. There's a lot to love... but also plenty to hate, particularly when you've delved into the Deep of Night, which can be extremely punishing. Sometimes you have a great run and it feels fantastic to utterly obliterate the foe, while other times your great run meant nothing and you get destroyed at the end. Sometimes you have a terrible run that ends exactly how you think it will, but other times you somehow manage to overcome everything despite it all, which feels amazing. I think the core of it, this balance between luck and ability, can be very satisfying. \r\n\r\nThe combat, by virtue of being split between a variety of unique characters with special abilities, feels like an evolutionary step forward for the Souls games. It's the main focus and the highlight. Each Nightfarer feels different and comes with a number of benefits and drawbacks. Unfortunately, while all characters are viable, some require significantly more effort or good luck than others to stand on equal ground. They can all be modified with relics, which are obtained by completing expeditions, win or lose, and purchased with currency gained the same way. They provide various stat boosts or enhancements to skills and abilities. There are also relics with extra powerful effects, usually accompanied by debuffs, that are exclusive to use in the Deep of Night mode.\r\n\r\nA run in the game begins with you selecting an expedition, determining the Night Lord boss you'll fight at the very end. You're dropped onto the map, the same one every time, but sprinkled with various interchangeable points of interest. These usually hold specific treasures and enemies, with certain types of location having different presets, such as holy or fire, which will have an effect on the enemies, weapons, and items you can obtain within. Shifting Earth events are the only real significant changes to the map, although these are random unless you spend currency gained from defeating enhanced bosses. They're very well worth it though, as completing an event usually provides some kind of huge benefit as well as a higher likelihood of finding powerful legendary weapons within the bounds of the Shifting Earth. \r\n\r\nAn expedition is divided into three days, and as a day progresses, a damaging rain begins to fall, shrinking the area of the map you can explore without your health constantly draining and eventually instantly dying. You fight a night boss at the end of each day, drawn from a specific pool for each expedition, and then in lieu of a proper third day, you are teleported to an area where you can do a little last minute prep before fighting the final boss of the expedition. Each day is fairly strictly timed, the only real change in the duration of an expedition depending on how long it takes you to deal with the night bosses. On average I'd say a single expedition takes around 40-50 minutes, which means you're dealing with the longest runback in any FromSoft game if you're defeated by the Night Lord at the end. You can also experience various random events during a run, from another Night Lord raiding you to a crashing meteorite, which all give you different rewards.\r\n\r\nThe game provides a fair escalation in challenge. Once you've completed at least one expedition against seven of the eight expedition bosses, you can challenge their Everdark Sovereign forms, which are enhanced versions of the fight with new moves and gimmicks that get rotated out on a weekly basis. These earn you a special currency called Sovereign Sigils when beaten, in addition to the Murk currency you usually earn from a normal expedition. For when even they get too easy, you can take on the Deep of Night after defeating the final boss. All enemies, including bosses, both deal and take considerably more damage in this mode, getting progressively more powerful the greater your depth level, and certain ones on the map will also become red, which means they're even tougher than the others, but will drop red rarity weapons. These have additional passive effects, many of which are unique to this mode, in addition to negative ones. Some of these negative effects are so detrimental that an otherwise amazing weapon can be ruined by them. You still want to stack the best buffs, of course, but there's now more to consider.\r\n\r\nHowever, you cannot select the Night Lord you fight at the end of a Deep of Night expedition. It's randomly selected at the beginning, and sometimes in deeper depths, they aren't revealed even then, although you can hazard a guess based on the night bosses you fight. Your map, which usually displays all the points of interest, can also be blank, only filling in with places you personally visit, which makes planning a route, one of the key aspects of the game, much more difficult. As well, you won't know if you're fighting the normal or Everdark version of the Night Lord until you're actually in combat with them, and given how different some of the bosses are between versions, this can really screw you over in terms of what to prep for, without even considering just how much more difficult some of these fights are with just the enhanced HP and damage they receive. Some of these bosses can be very frustrating in this mode. Therein lies the challenge, I suppose. \r\n\r\nThe game is hampered a bit by lack of randomness. For example, you might notice that the merchants you can buy things from during a run, while selling different collections of weapons, will provide the same ones with the same passives each time. Only certain night bosses will appear during the expedition for each Night Lord. Particular events can only happen during specific expeditions, like fighting a secondary night boss, which would be much more fun and interesting if it could happen during any run. I think the only thing that might be properly random is what weapons drop and the combination of skills and passives they can possess, which is unfortunate. \r\n\r\nAll that being said, I think this game is great. I've gotten enough out of this that I can wholeheartedly say it was well worth the money. If it received more love and attention, it could be even greater. We already have a few familiar faces from Dark Souls thrown in as night bosses, why not toss in a few more? Mix them into the boss pools, which could be enlarged or removed completely so there's more variety for each expedition. Maybe some of the bosses that only appear at the end of the night could show up on the map and vice versa. Stuff could be added in from Shadow of the Erdtree, which it does seem like we're getting soon with The Forsaken Hollows. A few more playable characters might be nice... Original weapons and enemies... They could easily continue adding content to this. I hope that they do!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Nightreign is a good game, Too bad its full potential was not used.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It has a solid roguelike foundation, but it slightly lacks content, and the gameplay loop becomes a bit repetitive after a while. The level of polish is on point, as with other FromSoftware games. It’s great with friends, but not so much with randoms. Solid 8/10.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun, chaotic, and hard. Can recommend",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "(Review Written before the DLC is out, will review that on it's own) This game is *weird*. Thats the best word for it. On launch I had no intention of buying it, but eventually did as some friends wanted a 3rd person to run it with and I do not usually get to do things like that. Thats the key here. The game is totally playable solo, or with randoms (If you are ok with long que times, that will only get longer as the game ages) but this is 100% a \"Made for a group of 2-3 friends in discord\" kinda game. If you got that, rad! If not, maybe not for you. This game is also very good for \"Scratching the souls-like itch\" as it's basically a condensed From-game. You explore, get equipment, fight bosses, then fight \"bigger\" bosses, and then a final boss. With neat lore and \"do-it-yourself\" storytelling. All in a bite-sized chunk. It's also good for practicing souls/Elden ring style combat, so if you wanted to learn how to git gud here you are. I liked it much more then I thought I would.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Soulslike tower defense game with main differences: you find the boss instead of finding you and you build yourself instead of building defences. At the end of the day it is a fun game with friends and with random players... as it adds the quote 'life is a box of chocolates- you never know what you gonna get' and I say this with excitement as it can make or break your game, literally.. Fair to mention that there are some minor quests for the characters you play that adds that solo touch to your trials..\n\nTo wrap it all into a single sentence: Nightreign is an over the counter balm for boss rush ache and it should have been an Elden Ring DLC and priced accordingly; though that could change with the incoming 'Forshaken Hollows' expansion.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I can count many issues of the game, yet it feels good. For me, it gives a way to play many different characters and styles in a short time. And with friends. Fast-paced and visceral. The bosses are interesting enough to play against many times, well, maybe except Everdark Augur.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "🌌ELDEN RING NIGHTREIGN\nPerfect for getting started in the world of Souls-like games, and even better with friends. I still play it thanks to a certain person, and it's quite enjoyable for passing the time.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Honestly its pretty fun all things considered, its not really a souls-like game, it does play a bit like Elden Ring, but the only souls-like feeling I get when I play it is on the very last boss, other then that its just more-so Roguelike then anything, its a fun game dont get me wrong, but It definitely doesnt quite feel like a souls game in alot of aspects, but I still recommend none the less, just go in with certain expectations is all :)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Super fun\r\nwish there was a bit more in terms of items, and variability between runs\r\nbut for a rouge-like souls-like its...\r\nseggs",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Some may cry about the recycled assets, but it's a solid step for FromSoft to embrace more multiplayer-driven games  (I manifest souls MMORPG PLEASE). Soundtrack is beautiful, each character is very fun and unique to master, and makes me happy to go in-raid with my homies to get squashed by a big boss and have to go thru another 30 minute runback. \n\n8/10 needs Slave Knight Gael",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[b] Nominated for the \"Better With Friends\" Steam award 2025. [/b]\n\nWhile being my personal GOTY,  I can't deny that the most beautiful feature of this game is experiencing unrestricted jolly co-operation with other Nightfarers.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Despite a lot making this game radically different and more difficult than Elden Ring, this game is and can be enjoyable when you've got a good group of friends to play with.  \n\nHowever, the game can be extremely frustrating to play when you've only got two people playing as finding a third can be cumbersome and even playing solo can be difficult to get matched with a party.  Frequently, even after being matched with a party one or both cooperators will drop making you have to restart the search for a group.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Довольно быстрый темп игры, но привыкнуть можно. Если играть не одному, становится еще интереснее)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very fun spin-off of the FromSoft formula; while the map (and sometimes bosses) can feel a bit stale after a while, the fights, pathing, loot, and decisions you have to make helps each run feel unique. Best played with two friends, but random trios is still fun, so are duos and even solos.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The B-team cooked with this one. However, Nightreign feels more like a proof-of-concept rather than a complete game because it lacks enough content to make the most out of its rogue-like elements. Still, it is very fun and unlike anything else on the market.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game. It's so fun to play with friends. The concept is so great.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's Elden Ring with the boys. Having my friend help me doesn't make me suck any less though. I still get my balls crushed regularly, but that's part of the fun, I suppose.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You can spend 50hours in this game easily. Even go up to 100 hours, if you join Discord server for in-game communication. However after that mark - lack of true randomness and change in world-map gets to you. \nOverall Nightreign is worth it here, right now, while its popular and you can find people to play with.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely love this game\r\n\r\nI didn't expect much when it was releasing, thought of it as just a boss rush.  \r\nAll the characters became super likable though, the story for each was moving for me.  \r\nThe abilities of each characters are super fun and even more fun when synergizing with friends \r\n\r\nThe Nightlords as well are fun and have lots of variety with an amazing OST\r\nHighly recommend playing this if you are a fan of souls series.  \r\n\r\nThe movement and gameplay might be the best its ever been.\r\n\r\n9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm a souls game fan so this game was not the exception. It is so fun to play with a friend. Also I'm excited for the DLC.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like how the little jar merchant draws things on its chalkboard.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I was not expecting this game to reel me in like it did. Elden Ring was a near-perfect masterpiece. This game feels like that only condensed into mini adventures where speed, efficiency and game knowledge are key to winning you runs.\nThe characters in Nightreign you play as really set this game away from the base game of Elden Ring, with each one having their own unique traits and ways to play. The dopamine you get from playing this game comes from how well you can work together as a team to snowball over foes from the weapons you find to the skills and ultimate arts of the nightfarers. Seeing how each run averages about 45 minutes from Day 1 to the end of Day 3 it makes sense that these characters have more freedom and mobility as oppose to how it felt in other Fromsoft titles.\nRNG can play a large part in what defines a winning run in this game. However, like in most games of similar style in combat, skill is the backbone on the road to victory.\nThere are some things in this game I'm not particularly a fan of - like the relic system, or even the Deep of Night mode that makes the game harder the more you rank up - but nothing totally dealbreaking. It will not give you the same experience as Elden Ring on a first time playthrough or any other souls-like before it. To those souls veterans looking for something different yet more of the same in terms of combat I think it's a great game. Newcomers to Fromsoft's genre of souls-like may find difficulty getting into this one and to that end I would recommend trying the previous titles (like Elden Ring) first before trying Nightreign.\nIf you are a die-hard fan for Elden Ring this is a worthwhile and addicting spin-off of that formula.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "everdark draconic tree sentinel with red eyes is free.\n\n\n\n\n\nhe kickt my ass big time\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Elden Ring: Nightreign - A stellar, shadow-drenched expansion\r\n\r\nElden Ring: Nightreign isn't just DLC; it’s a full-scale descent into a hauntingly beautiful and brutally refined version of the Lands Between we thought we knew. FromSoftware has done it again, but with a focused intensity that feels both familiar and thrillingly new.\r\n\r\nThe Good:\r\n\r\nThe Realm of Night: This new region is a masterclass in atmospheric design. Cloaked in perpetual twilight, it trades the base game's golden vistas for muted blues, deep purples, and unsettling bioluminescence. The visual storytelling is impeccable.\r\n\r\nBosses That Will Break You (In The Best Way): The new roster of enemies and bosses is exceptional. They are fast, ferocious, and demand you re-learn their intricate, punishing dance. The victories here feel earned like nowhere else.\r\n\r\nMeaningful Progression: The new weapons, spells, and gear aren't just side-grades. They introduce wildly unique playstyles and powerful effects that feel impactful enough to rebuild your character around. The power fantasy is real.\r\n\r\nLore That Pulls You Deeper: For Tarnished hungry for answers and new mysteries, Nightreign delivers. It expands the mythos in satisfying and terrifying ways, adding crucial depth to key figures and the world's history.\r\n\r\nThe Not-So-Good:\r\n\r\nPunishing Even by FromSoft Standards: The initial difficulty spike is severe. Veteran players will be challenged, but newcomers or those who found the base game tough might hit a wall early on.\r\n\r\nThe Shadow Can Feel Oppressive: The consistently dark palette, while stunning, can sometimes make navigation and spotting secrets more taxing on the eyes over long sessions.\r\n\r\nA Few Recycled Ideas: A handful of lesser enemies feel like reskins from the base game, which slightly breaks immersion in this otherwise pristine new world.\r\n\r\nVerdict:\r\nElden Ring: Nightreign is an essential pilgrimage for any Lord or Lady. It captures the original's magic of discovery and conquest while carving its own identity in the pantheon of great expansions. It's challenging, breathtaking, and deeply rewarding—a must-play for anyone who heeded the call of the Elden Ring.\r\n\r\nScore: 9.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like the new elden ring game, it has a different combat style and movement but yet it's a new style to play the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I gotta say I was sceptical when I bought this game. It took me 6 month's before I even tried if from pre-ordering it... But holy moly it's great. I love the mechanics when traversing the map. The combat is Elden Ring + with so much other stuff added and even if I have only made it to the last night boss once so far I still feel rewarded when me and my duo fail. Learning still but enjoying it greatly in my failure :D\n\nOnly downside is that it's not cross-platform... I really wish with all my heart it could be but for now it's amazing anyway so it's just that small little sad part of this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is perfect for anyone who wants to relax and chill out",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pretty fun but gets repeditive after a while, hopefully the upocoming dlc brings a bunch of content.\nthere are some fun mods tho, FSParty adds Bosses and Risk of Nightreign makes it more rogue-like",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At first, I didn't understand the premise of the game, but after a few hours and days, I came to the conclusion that it's a very good game for those who like Elden Ring, Souls, rush, strategy, and playing with friends. I had some performance issues at first, but it stabilized, and other than that, I really like it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun, challenging, and rewarding, I can only hope this goes to better the online service for future titles.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game. Great combat. Amazing soundtrack. Severely lacking in content variety, especially for a game with roguelike mechanics. Relics, which are your only form of progression, are uninteresting (save for a few that slightly alter character abilities) & most of the time useless. Map variety is lackluster. This game deserves much more attention from the studio, content wise especially. Hopefully the DLC will be worthwhile. If I could mark my review as mixed, I would.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have more time on this then i do Elden Ring. This is not the case because Elden Ring is bad, but because i want to play Elden ring, but hate the tedious and long setup it demands to get a new build and save going. That is exactly where this game shines. Of course, Nightreign does not have the incredible depth we love of the other souls games, but its perfect for hopping on with a buddy and fighting bosses. If they can find a way to get more content added to Nightreign faster, and really turned this into a live service game of sorts, i would be very happy. my only solid complaint after 200 hours is that ive seen everything so much. i want more weapons and bosses imported in from the other souls games. it really only features a few bosses from previous titles. and weapon variety currently is somewhat low. you get a lot of the same gear in general from run to run. if they just added every non-repeated boss from Elden Ring and way more weapons, i think i would have triple my hours currently.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Elden Ring is a solid 10/10, but I'd say this game isn't even close.\nFun with friends for sure!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good as a souls game but you know as a souls player i don't like this kind of battle royaley game play",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "With the lack of general help in-game beyond a very basic tutorial, the poor translations, the bugs, and the inconsistent logic (hope you like community-compiled spreadsheets to work out what effects do and don't stack together - it's completely arbitrary!), you should expect to spend a fair bit of time on youtube/reddit to really get the most out of it.\n\n...And yet despite all that I'm playing it [i]obsessively[/i].",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly i just boot with Friends and we make the craziest comps and plays also Libra im watching You, anyways good game im still having so much fun cant wait for DLC to see how much we gonna get on the game. I love the Game and im gonna have more fun with my homies.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Destroy every boss in the game, get destroyed by Everdark Libra. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Difficult & fun game and creates a lot of moments",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Clutching a 3 player scaled boss while your friends hold their hands together in a fetal position and discuss their favourite Starbucks drink was never more enjoyable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "They made a whole game about the worst part of Dark Souls, the boss runback. It's great.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While the game lacks some of the more artistic/atmospheric elements from previous souls games and features a streamlined difficulty curve (mostly reliant on RNG), the core gameplay loop is pretty fun (though, owing to the limited content, it can get repetitive very fast). It's mostly carried by the design and variety of character builds and abilities, which Fromsoft managed to nail pretty spectacularly. The game is especially good with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very unexpected from FROMSOFT's first official multiplayer game. True that other Souls games had multiplayer elements, but this is a true focus on multiplayer. Ishizaki cooked with Nightreign!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game. Best way to practice with your timing and dodges. Like random boss spawner mod in Elden Ring.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you expect the usual Soulsborne style with much lore and complex story, this won't be it.\r\nIt's not Elden Ring or Dark Souls series that you know.\r\n\r\nThis is more fast paced, with randomised environtment and a bit of hack and slash and permadeath. There is some lore, but it's not yet made as complex as the DS and ER worlds are.\r\n\r\nYou will die, you will die a lot. You will lose runs here and there.\r\n\r\nI'm a bit so-so on the time spent on the runs, but if you're playing with friends - it's quite fun.\r\nSolo runs, if you're not super into the whole Soulsborne challenge world, is quite challenging too, but also fun to do.\r\n\r\nThere will be quitters in the middle of the run too, so be prepared to lose one or both randos you'll get on your team. It might be the internet connection, might be the server, might be people getting angry, you'll never know, but be prepared for it.\r\n\r\nBut it is a fun game as a stand-alone type. I still see it as more of a test project, same as their horror game on PS2 was.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A visionary and creative masterpiece that manages to capture everything you love about the original game and deliver it in convenient, 45-minute cycles. It truly is the perfect experience for anyone who loved the original Elden Ring but wanted something new.\r\n\r\nActually, let’s be honest. Playing this game is more about mastery because you're playing as one of the eight preset Nightfarers this time. But who cares right? True freedom of custom character build crafting is for lesser games. We’re here for the suffering, and FromSoftware delivers.\r\n\r\nIt’s supposed to be co-op fun, but the only thing you cooperate on is the collective decision to uninstall. And woe betide you if you only have one friend, at least that's how it's used to be. They actually gaved us duo mode, but that just meant you now get to suffer in two person instead of three.\r\n\r\nThe most important lesson this game had taught me is run when you see Bell Bearing Hunter in the basement, just run. He's not hunting bells this time, he's hunting your balls and you better give it to him. Every other Nightlord is a warm-up; the Bell Bearing Hunter is a divine reckoning sent to judge your life choices.\r\n\r\nIn short, this is high-level psychological warfare delivered in a, roguelite package. Everyone knows Nightreign is the best game ever created, the forced group dynamics are peak social engineering, and the feeling of failure is strangely addictive. You will never feel rage, only profound existential fulfillment.\r\n\r\nAnyway, perfect game and everyone should give it a try. Now if you’ll excuse me, I need to check my Relic roll then complain about RNG and prepare for the next aura farming with Executor until Bell Bearing Hunter one shot my ass.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In the name of the blue prince, we shall megabonk this Balatro. We must speedrun like Umamusume, race like a pretty derby for the nightreigns, but alas, there might be a risk of rain, so embrace the ball x pit and conquer hades.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, when I first saw the trailer for this game, I thought it was basically just an asset flip and wrote it off as such. I liked elden ring (which was also my first FS game), but was disappointed that FS would make a an \"asset flip\" game. Then, I didn't think about the game for a few months. It was only after my brother asked me to get it did I cave in, buy, and then play it. After I played it, all I can say is that I was gravely mistaken about what I had thought. This game is absolutely awesome. While they do re-use a fair amount of assets from past games, that by no means takes away from the fun. If anything, it actually adds to it because we get this nostalgic boss rush gameplay loop where we get to see many enemies return from past games for a round 2. There's also new stuff too, like the relic system, weapon passives, Everdark versions of bosses, and the Deep of Night mode (which, at the time of writing this, I have yet to play, funnily enough). If you like rogue-likes and like souls-like games, then this game is for you. It seamlessly blends the two genres in a surprisingly fun and unique way.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The fact we got this not even a year after Shadow of the Erdtree is insane. I got a lot of good memories out of this game and even solo'd a few everdarks, it's a must play with friends or for any Elden Ring fans.\nCan't wait to sink even more hours into the DLCs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I fucking love Recluse's butt, I want to bury myself between those cheeks and just inhale the raw scent of the stank as it slowly crushes my skull. 10/10 game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "enjoyable, honestly harder than it should be, but that's always the draw for souls games, soooo ;)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nothing but love for this game and Elden Ring <333 ily Fromsoft + Bandai Namco",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun game with friends, Very different then elden ring, if you are looking for an elden ring 2, this will not be it, this is a mix of Battle royal (only in that it has a closing circle) and dark souls/elden ring, it has bosses, different maps, and routes you complete per map, skill is very important but so is mapping and speed, would reccomend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Elden Ring: Nightreign is a really interesting multiplayer take on the Souls style. It’s different, but in a good way, and I had a lot of fun running through it with friends. I even ended up 100%ing the game. I’m definitely looking forward to the DLC.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Has been such an amazing experience, playing with friends makes it even better! The fights are super fun, and music goes hard. Very addicting. But them trolls on castle?? I swear they want to end me. \nAnd I love depth of the night mode, very exhilarating gameplay, especially dop 4-5.\nLove <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is a bit less than one would expect from such a strong title, but it is worth it. There are some small differences in the commands from Elden Ring and that makes jumping from one game to the other a bit annoying, but overall it is a fun game to play with a friend. At start you will feel super overwhelmed, but as you learn it, it gets more and more satisfying to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I didn't really like Elden Ring, but my friends had convinced me to try this out and this is way better. Each time you play you fight different enemies with different gear, this way it is much more fun. Instead of dying repeatedly to one enemy you repeatedly die to different enemies.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game and mechanics are pretty good but game lacks diversity in terms of weapons, enemies and maps. Would be nice to have more characters in the future",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ahh, Nightreign.\nThis game has soooo many flaws which bug me every time I play, however...\n\nI CAN'T STOP PLAYING THIS GODDAMN GAME!!!\nSouls' combat is too addicting and always shower me with dopamine when dodging and killing enemies.\nIt's paced wayyyy faster than normal Elden Ring and it makes you plan and make decisions quickly compared to previous instalments which makes it the new mechanic that has to be mastered to play optimally and guarantee higher chance of winning.\nWhen they introduced Deep of Night mode, I got addicted even more. This mode is so hard yet so satisfying to play due to enemies being harder as well as more passives on weapons that can drop during an expedition which makes each run even more unpredictable.\n\nWhen it comes to flaws, I guess the most annoying would be number of seeds an expedition has. I understand why they did that but they could at least double the number of seeds and made random events happen more and this game would be my favourite rouge-like when it comes to gameplay.\n\nAlso simply lack of bosses from previous games as well as lack of boss variety in general. As of time of writing this review, there are only 6 bosses from Dark Souls (2 from DS1, 2 from DS2 and 2 from DS3).\n\n(Also please add mode where every enemy is BBH please From Soft I beg you <3)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Muito bom pra jogar com amigos, mas tem quase nada de conteúdo, oq faz valer o preço é o tempo q tu conseguir se divertir com os amigos, poderia ter mais conteúdo e não recomendo caso não tenha alguém pra jogar junto",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "PEAK, really love this game, i recommend this game to everyone if you have a black sweaty monkey that is going to carry you and lick your balls, but overall ye, absolute peak 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wasn’t totally sure what Nightreign was aiming for at first, but after a few runs, it clicked—and I’ve been having a genuinely good time with it. It still carries that Elden Ring spirit: challenging fights, gloomy vibes, and moments where you ask yourself “Why am I like this?” right before getting flattened by a boss. But the shorter, co-op-friendly format makes it much easier to hop in without mentally preparing like you’re climbing a mountain.\n\nPlaying with friends is honestly where the game really shines. Each class feels unique enough to matter, but not so complex that you need homework before choosing one. Runs are short, fast, and surprisingly addictive. The shifting map keeps things fresh, and the bosses are tough in that classic “scream first, celebrate later” FromSoftware way. And yes, it’s actually satisfying when you finally win—especially if you’ve already spent 10 minutes blaming your friends for no real reason.\n\nIt’s definitely not trying to replace main Elden Ring, and that’s a good thing. This game is more about jumping in, having fun, dying in new and interesting ways, and trying again. Solo is doable but a bit rough—like eating pizza without cheese—but with even one friend, everything becomes smoother and way more enjoyable. Progression is simple, the combat feels tight, and the learning curve never crosses into “why do I exist?” territory.\n\nOverall, Nightreign is a solid, atmospheric co-op game that respects your time and still gives you that FromSoftware-style challenge. I keep telling myself “just one more run,” which is exactly how you lose track of three hours without noticing. If you enjoy Elden Ring or co-op action games in general, this is absolutely worth giving a shot. I didn’t expect to enjoy it this much, but here we are—having fun and pretending it was all skill.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun game, the movement is very nice compared to ELDEN RING. I wasn't really a fan of the deep of the night game mode but i'm hopeful the DLC revives my will to play a bit more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good point : Smol bean Revanante\r\nBad point : Hard mode crazy madman bipedal goat and cheaters.\r\n\r\n7/10, better with friends or teammates with a brain (not me).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Güzel. DLC geldikten sonra daha da güzel olmuş ama tek kişi değil min 2 kişi oynamak gerek tek işi için bosslar fazla güçlü.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Elden Ring Nightreign is one of the most fun games I've played this year with friends. Very snappy and fun with alternations to the original game of Elden Ring. And my God the nostalgia, so excited for Artorias and hopefully Bed of Chaos :). If you like Souls you probably already own it, but pick it up if you don't already!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has been one of the most aggravating yet easy to come back to games mainly because it taps into a determination emotion never seen before. I have spent countless hours of my life to this game because it is just that entertaining.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Beautifully done gameplay, visuals and boss fights are stunning. A few of the remembrances for the main playable characters are a bit confusing and lack direction but overall it does not take away from what is essentially a rogue-like experience for Elden Ring content. Seeing familiar, old favorites for bosses; and even some new ones; makes the combat challenging and refreshing. Being a long time souls enjoyer I can honestly say that this game made me Git Gud! I hope to see more content from FromSoft that continues or at least recognizes the beauty of this fine addition to the SoulsBorne community.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good. good game. this game is fun and feels rewarding to play. unlike monster hunter wilds. that game sucks.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I nominated this game for every category in the steam awards except for VR and Labor of Love. I don't have a VR headset, and the most labory of loves goes to Dead By Daylight easy peasy. They love their fans!!!",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "I Have Mixed Feelings\n\nIf you're here for the combat, Nightreign delivers. The fighting responsive, and satisfying. Each class plays distinctly enough to encourage experimentation, and boss encounters are intense and memorable.\n\nIf you're drawn to Souls games for their world-building, exploration, and sense of discovery, this might not be the experience you're looking for. Nightreign strips away much of the adventure in favor of a hyper-focused boss gauntlet structure.\n\nA 40-minute slog just to reach a boss, only to get one shot at it. Fail, and you're back to square one—another 40 minutes before your next attempt. it's soul-crushing. The absence of meaningful shortcuts or checkpoints makes the runback feel more punishing than the boss itself.",
      "voted_up": false,
      "votes_helpful": 140
    },
    {
      "review": "Unenjoyable without friends.\n\nRandom`s will run only the \"Best route\" and usually die doing so,\nwhile also being completly silent about what their plans are.\n(A ping on the map being the most you can expect in terms of communication)\n\nDon`t know about you, but i play Rpg`s to escape following orders \nmade by a half wit without basic social skills.\n\nAnd forget about appreciating the game in it`s entirety, the rounds are so short that you barely have time to see a quater of the map.\n\nThe solo experirence remindes me of Scholar of the first Sin.\nIf you have fun getting ganked by bosses on \nBloodborne-crack every single fight, you will definitly get your kick here.\n\nThe 8 classes are all pretty fun to use tho, offering all playstyles established\nthroughout the souls franchise.\n\nRanged, magic, summoning and a variety of melee characters fill pretty much all\ngameplay niches and are all fun to use.\n\nAND the game is, just like all the other modern Fromsoft titels, \nan artistic masterpiece.\n\nThe game is fun with some friends, \nbut i wouldn`t recommend buying Nightreign for solo play.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Game is not bad. But there are a lot of thing that were implemented horribly. Among them imho:\n\nNo cros-play with consoles\nNot the best class balance, some abilities and ulti seems useless (depends on solo/duo/trio ofc.)\nEntry level is so high due to incredible bad UI/UX\nNo clear information about stats/buffs/perks in numbers. You have to read a lot of wiki pages to grasp essentials.\nNo sandbox hunting ground where you can create your dream setup and test everything: relics, gear, stats, effects, etc.\nTerrible network balancer: game tend to put you into party from another region with big ping difference, so you see a lot of blinks, jumps, lags for actions etc. Some sessions are just unplayable (I have ping 20-30 on EU). And you can't leave without rank decreasing.\nNo vote for fast finish session when one of the teammates left for any reason. Same reasons.\nRNG for relic effects also bad, I have 2-3 perfect relics after 200h playing.\nA lot of garbage gear and spells in the game.\nUnfriendly to two monitors, game crashes so often if you alt-tabbed.\n\nSo game is RAW, wait for new patches, DLCs or whatever and don't buy it yet. Simply not worth full price.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Extremely lackluster basegame with only a single map with 4 modifiers that can only happen one at a time for you to play, the game needs so much more for it to be good yet instead of adding to it they're just going to sell you more through the DLC, pretty scummy and not what I've come to expect from this company",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "[h2]Despite my many hours in the game [/h2]\n[h1]I can't recommend the game that much[/h1]\n\nThe game overall is pretty fun, but it lacks content, eventually you will figure out the map, and once you do that there is no surprise in any match, you already know what to expect.\n\nYour first runs might be plagued of Elden Johns that quit as soon as the match starts, f those guys, eventually you will move on to everdarks, which are pretty fun (when there are no quitters).\n\nBut once you enter deep of night is when hell begins, the first rank is easy, you will barely notice any difference between your regular runs and this special mode, but as you venture into deeper depths is when hell begins, more often than not your team of random Elden Johns sucks, some may quit the match, or they just straight up suck, [b]WHEN[/b] and not IF, WHEN you eventually lose a match you get deducted points, how many? it depends... to give some context, a match is roughly 40 minutes, when you win you get 200 points, and when you lose at the final boss (at least for depth 2) you lose 200, fair enough right? but then you realize \"oh, I need to win 2 runs to keep progressing\".\n\nAs the deep of night reaches higher depths you can lose even more points, 200, 400, 500, 600, 800, and when you run the numbers you realize that losing a single match can cost you easily 3-5 hours [b]JUST TO MAKE EVEN.[/b]\n\nAs if wasting your time with awful teams is not enough the game servers can prank you from time to time, playing deep of night at [b]ANY[/b] depth? Oopsies\n\n[h1]NETWORK ERROR[/h1]\n\nNo biggies right? I will just rejoin, guess what? EVERYONE GOT KICKED OUT, [b]-800 FOR LEAVING THE MATCH[/b]\n\nYou might think \"It doesn't matter, I'll just keep playing, I'll just start a new match...\" and then the game starts matchmaking, matchmaking complete... BUT GUESS WHAT?\n\n[h1]AN ERROR OCCURRED[/h1]No biggies again right? WRONG [b]Unable to restore current session due to a multiplayer issue. A penalty was incurred as there is evidence to suggest an exploit that affects other players has been[/b]\n\n[h3]MY BROTHER IN GOD, THE MATCH DIDN'T EVEN STARTED YET[/h3]\n\nDon't you love it when you lose a sh*t ton of points just because the game felt it like it?\nDon't you love it when your teams sucks a$$?\nDon't you love it when the servers die mid run?\nDON'T YOU LOVE WASTING YOUR TIME?\n\nIF THE ANSWER TO ALL OF THE ABOVE QUESTION WAS A YES, THEN...\n[h1]THIS GAME MIGHT BE FOR YOU![/h1]\n\nThe game overall is okayish... deep of night is just a world of pain.\n\nBut hey, at the end of the day is just a game, who am I to tell you if you will enjoy it or not?\n\nGive it a go, and if you don't like it you can just refund it, or keep playing and complain while playing it, like I do...",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "was it necessary for every boss to 2 shot people on depht of the night?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game has extremely boring content, with end-game content that only involves grinding Relics (but you can't change Relics when selecting a character in-game, which is ridiculous). Especially the latest content, which is Ranked mode against random Bosses, and here you can't change Relics based on the enemies you face, so you have to use the same Relics every single game. \n\nSo what's the point of collecting lots of relics if you can't choose them when facing a boss with specific weaknesses?\n\nI feel like the relic grinding just forces you to create one character with one build that deals massive damage, and this is incredibly boring. We can't choose or experiment with more interesting builds.\n\nWe're forced to play with RNG drops. I know the game requires luck to make each playthrough easier, but can't we use the default weapon from the relic we're using to fight bosses with specific weaknesses? At least that way, we don't have to worry about the main weapon drop we'll use because the weapon we're using already matches the boss's weakness.\n\nAt least if you really like all the characters in this game, you could create each character with a build that has weaknesses for each boss in this game. For now, my main complaint is that we cannot change relics in the game once it has started.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game has a lot of things I disagree with, so only buy it if you're a bit masochistic and enjoy something like Elden Ring.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Think of any Soulslike, now put that Soulslike into a race to get to the best items before a circle closes. I cannot say I recommend this to anyone who won't grind the hell outta this game, it took 21 hours to beat the first boss named Tricephalos. So yeah, buy at your risk I guess, this isn't for casual playing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "performance issues this severe are unacceptable.\r\n\r\nconstant frame drops to as low as 1 fps. tried all the official and unofficial 'fixes' and non have made a difference.\r\n\r\nspecs:\r\nrtx 4080\r\n13600kf\r\n32gb ddr5 ram",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "A stuffy timer that rushes the player. It would be better to make exclusionary choices about where to go. It would be more in the DS style.\nWhy is it not possible to try to kill the boss after death in order to get used to it? The reward and kill will not be counted, but you will not have to play the entire run for a new attempt.\nOne of the main charms of DS was the ability to try over and over again without being punished for trying.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love this game, but a lot of the design feels outdated. If you don't have a team of people you know personally, the game is far less enjoyable and it feels like very little thought went into the game. An online game with no voice chat or cross-play releasing in 2025? Insane",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "60 minutes boss run in midgrave just to play elden mid",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game it self a quite good, its fun for me to run around and kill some mobs and bosses. But there is a big downside to that, and i don't know why this game have so many positive reviews. Devs don't give a F about their servers, they bought cheapeast potato servers from EPICs so it works like garbage, if it works at all. Since the DoN i can't play with my friends, cuz one of us always gets DCed, no matter what we do nor vpn nor ports cant help to solve it, but with randoms every thing is good. Back to this game few months later came back to play with other friends and 3 days out of 3 days servers dies and u cant came back. I hope ppl start talking about it more and devs will start do something about it, cuz no matter how good is game, if u cant play it game is sh*t",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game feels like it needs more weapons from all the games, as well as meaning full bugs from weapons and the colored stones. I feel like the game with the dlc is what the base game should have been. It’s a good game, just missing some features.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no updates after 6 month. Content is very fast and grinding difficulty is not interesting",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dogshit. Not much else to say. no amount of DLC will make this less of a dogshit game. Not now, not in 10 years, never. This is just not it. Fromsoftware seem to be going backwards in their ability to develop games.\n\nThe millions of retards calling this game fun literally have a worm in their brain.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun game, support is terrible. Trying to get any help feels useless.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "dog water net code, infested with game breaking bugs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its a really good game from the gameplay. Sadly it is really badly programmed and it keeps crashing over and over again on my 3070 while I play on medioum settings. I have tried everything to fix the crashes but it´s impossable to fix. I also contacted the support and they were not helpful at all. And even if the game doesnt crash it runs really bad with a lot of lag and framedrops for no reason. If these performance issues get fixed the game would be awesome tho",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I do not recommend for one reason:\n40 euro is too much for 1 map with a very small number of seeds, making it repetitive. Hades is half the price and offers way more variation.\n\nThe game isn't bad, but you need to have a huge number of hours in all of the FromSoft games for it to be enjoyable solo as every single boss in this game is from a game they've made.\nThey are hinting at a DLC for this game soon, which will be full price of the game. Strictly don't recommend paying the price of the full game for any DLC. DLCs should typically be of those of Skyrim or The Witcher 3, offering a big amount of content without making you question if the price should be spent on buying a whole game instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do you like 45 mins runbacks before trying a boss? Then this game is for you. I'd rather play more Dark Souls 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game idea itself is amazing.... but its not polished enough like the other fromsoft games for me to give a positive review. It has serious frame drop issues even when the my pc is not all even 50% load and its not even once in awhile its the entire game and its way too irritating to play because of it. If they could properly optimize the game I would give a positive review. Also the bosses are underwhelming after you beat them 2-3 times.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "clapping every enemy until the night lord just one shots the whole team....... again.................... the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is great, servers are absolute shit, it takes out most of the enjoyment...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After playing 34.3 hours I feel like the game ain't good. It's just an asset flip and a bit more of fromslop. The game is the same has elden ring, darksouls, etc... Nothing new, just a small multiplayer that ain't good.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it was fun for a bit, but then went downhill when they added deep of night, getting penalized because cowards leave is lame, and also builds no longer matter in the further depths, everything just one shots you. Game also really needs some more variety. Maybe more flexible, bigger builds. A new map even. Every time im about to pick the game back up, i remember the exact same map, doing the exact same things, finishing the same bosses and feeling like i gained nothing. The relics are so absurdly rng its impossible to make a unique build. Would have been nice if i could have a starting loadout (specific wep and ash of war) and upgrade it throughout the run.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself is a interesting experiment and worth playing I think. It's fun to play with people and quikcly get into a game instead of having to do a lot of set up like regular elden ring. However the network issues with disconnections sometimes and constant lag/latency in 95% of matches are just ruining the experience. The game is still not fixed :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Relics? Rng. Getting effects that are useful to your character on weapons or weapons with specific elements? Rng. Getting talismans that are useful for your character? Rng. (Man I so love it when I get the same identical talisman twice in a run and it's not even one that is useful). Encountering field events at all? Rng (after 62 hours there's still a few I've never found because most runs have NONE). Encountering the good shifting earths and maybe not the same one 5 times in a row? Rng. Encountering the right bosses? (Aka NOT bellbearing hunter or very tanky/very time consuming bosses) Rng. And oh, by the way, good luck understanding the *exact* thing that buffs/effects do, with these very amazing descriptions they have.\n\nWhen those rng elements all click together? Great game. Otherwise? I want to Wylder skill into a car to end my suffering.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don’t recommend this game unless you’re a hardcore fan of Elden Ring or Soulslike games. It’s full of bugs — for example, I’ve fallen through the map countless times, I won a match at level 4 and got -200 points, and the Sites of Grace often have massive lag, taking up to 10–15 seconds to activate. I’ve died many times because of that.\n\nThe game needs serious optimization. I have an RTX 5070, and my FPS sometimes drops to as low as 20. Some characters need a serious buff — for example, the Revenant really needs the incantations from the DLC and should have at least one offensive spell at the start. The Revenant relies way too much on RNG.\n\nI don’t know what happened in the last update, but the difficulty has increased a lot. It feels like I’m playing at depth 4 — I’m currently depth 2, but the bosses have HP and deal damage like depth 4 ones. A month ago I could easily win at depth 3, and now I can barely win at depth 2.\n\nAnother annoying thing: if my teammates leave the match, why do I still lose points when we lose? How am I supposed to win alone after both of them quit!?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There is a lot of good things in this game but the deep of night mode is currently the only thing that gives you a reason to play once you defeated every boss. And that mode needs some rebalancing. In the higher level only three or four characters are still valid choices. Everything other than Wylder, Ironeye and Duchess or Recluse will either not do enough damage, have no damage windows or a high likely of bad equipment.\nAnd the penalties for loosing are way too harsh. 100 points away from lvl 5 lost like several weeks worth of progress because of factors I couldn't even control. It honestly got me questioning what the point of it all is.\nIt's especially harsh for the amount of luck involved, be it the map layout, item drop rate or the game deciding that it will now show a power point presentation of a boss because there is too much lightning or a bad connection.\nAnd in the end, reaching higher depth levels is almost the only point in that mode, aside from maybe being matched with more experienced players. The other reward, deep relics, can't be used anywhere else.\nIt would be way more fun if you could just freely choose to play any level you unlocked for no depth points and no penalty. The way it is now is just too much stress, not enough fun.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is in absolutely terrible state right now. Way to many bugs. Fromsoft should focus on fixing these issues before even consider launching the DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For f**k sake! It's almost 5 month after release of the game, and they still haven't fix the performance issue.\nI have a problem where FPS suddenly drop when open in game menu. also encounter this problem when play elden ring, but for elden ring it's fine. I am not open menu that frequently.\n\nBut this game is an online roguelike game, I need to quick view weapon/item effect then ran away from enemy. need to quick loot because limited of time till map got shrinking.\n\nwell since I love most of Fromsoftware game, I am not gonna refund maybe wait for a while till they fix it.\n\nAnd now 5 month later they still haven't fix it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Decades of development experience, and fromsoft is still entirely unable to create a game with functional multiplayer, it is frankly a pathetic attempt. The matchmaking is pathetic, leading to runs with hundreds of ms of consistent lag and teammates that have never opened the game before. The soloq experience is bad enough to rival that of Dead by Daylight's, mostly due to the fact your only source of communication is a mere ping system.\r\n\r\nThe UI is minimally better than base Elden Ring, but that is such an unbearably low bar, that it frankly could have been accidental. The game is also horribly optimized, with unbearably inconsistent frames and stutters. I have lost more games due to bugs and crashes than actually bad plays. \r\n\r\nFinally, the game is filled with illogical, out of touch decisions, and one of the most punishing experiences to ever come out of fromsoft, and not in a fun way. I wouldn't mind if the game was just hard, but the penalties are overly severe for a barely functional game. Did you crash with no crash report or get DC'd from the abysmal connection stability? That sucks, you have approximately a 50% chance to be allowed back into the match, and even if you do, you have arbitrarily lost a level and thoroughly delayed a game based on time usage. Not to mention that if you don't get back in, you have utterly destroyed your teammate's experience, which will result in a loss or DC, leading to a progression penalty. \r\n\r\nFromsoft has lightning in a bottle and is not only letting it out, but is actively forcing it out.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One would think a roguelite spin on Elden Ring would be awesome. To some extent, the temporary nature of each run makes it so you constantly have that satisfying feeling of your build taking shape that is really cool in the midgame portion of other fromsoft games. Unfortunately, the need to constantly keep moving and keep ahead of the pace of the fortnite circle makes it so you can't really stop, think about your build, buy items from the sparse few vendors in the map, and upgrade your weapons, or do inventory management. Not that there's a real inventory, you have 4 slots to hold items like titanite, fire pots, etc.\r\n\r\nA roguelite setting would be the perfect way to incorporate the lore themes of death/rebirth, and cycles of history, into the core mechanics of the game. However, yet again, the constant pressure to keep moving means you can't really \"take in\" the setting. The meta progression, at least early on, seems to be going on expeditions, collecting murk, and buying gems to socket into your character to start the run with perks like \"start with a fire pot\" or \"+5 dexterity\". Most of these seem to be extremely boring and don't really change much about your run. There do seem to be different \"quality\" of these gems, so maybe the purple/orange text ones have some awesome perks, but I won't be playing the game long enough to find out.\r\n\r\nIf you enjoy any of Fromsoft's other games, you probably won't like Nightreign, which is kind of sad. For me, the enclosing fire circle and the fact that multiplayer \"partners\" will constantly just go off in their own direction, get killed and then quit the game makes this game a hard skip. I have already uninstalled this, and am going back to a fresh elden ring run.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game is amazing and very enjoyable to play i had so much fun playing it BUT when i switched to ultra wide monitor THE BLACK BARS RUINED IT its annoying and hard for me to focus this made me quit playing Night Ring the dlc made it much worse cuz such a good dlc but i cant enjoy it when the black bars exsist FromSoft remove the bars as soon as possible beacuse it ruins the experience for all ultra wide screen users prob made more quit the game beacuse of this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While the base game isnt too bad and is quite enjoyable. Once you get to the late game like deep of the night this is where this game becomes atrocious. This game relies on RNG to win games. While you do have some agency in the base game in the late its nonexistent. EVERYTHING IS RNG. RELIC ITEMS, MAP, BOSS, WEAPONS, AFFINITY EFFECTS, WEAPON, hell even your own teammates are RNG where or not they stay and if they leave because they got angry well great because now you to are getting penalized because your random left even though it saids that they waived it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "wasted money....no more adventure finding weapons and upgrades .. jus online with other players that dont work together and leave you ...and if you decide to play alone then your pushed by wall of fire to move ahead no time to jus play....when you do upgrade . once you finish map everything is gone...what was the point of this game....now its seems i cant play at all says im off line or some crap but i have internet...i started a game and other player jumped out or something and i got punished for something another player did...who ever made this games and its rule sucks...elden ring is dead to me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a disaster. The amount of people I've matched with that just threw the entire run is stupidly common. A dogwater take on Elden Ring, and a even worse skilled community. Thanks for the people who play competently... I can't carry two dead people AND the Everdark boss. Wild.\r\n\r\nJust play Elden Ring, no Nightreign. Don't do this again, from. Just add the seamless co-op aspect and trash this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "they say the games hard def bro so harddd omg u fight a boss in ranked thinking ur bouta get a cool weapon to fight the next one with no 0 weapons in ranked its like they want u to spend hours and hours just practicing basic moves to kill a boss when every single and i mean everysingle boss in ranked one shots u at full hp dont matter how much hp u have still ghetting one shotted if u dont have friends dont play because randoms just leave everytime and expect a carry even tho there playing the two worst characters and ur the only one to fight up close this games community is so unfun possible went from having a fun time to hating every single time i open this game i honsetly cant rember the last time i had 2 people stay all 3 nights and defeat the boss with me like if i wanted to play alone id play base elden ring i dont think the developers are doing a good job of keeping this game alive either we need some sort of communication so i can tell my teammates there fucking horrible and to uninstall the game but seriously if u think im being od or this is to much i could stream multiple games of me playing it and the same exacr stuff im saying would happen im not bad either at the game lik i beat all 8 bosses all enhanced bosses most of all bosses moves memorized its just so unfun to play especially when u get the SHITTEST WEAPONS and get one shotted by a solider not even a boss a solider but yeah elden  ring is supposed to be \"hard \" and \" challenging\" right totally man totallllllllllyyyyyy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A valiant attempt at a fully multiplayer game, Nightreign encompasses the best and worst qualities of Fromsoft community. Sometimes you'll have an amazingly emotive session with cooperation galore, others you'll be left in the match alone after everyone else rage-quits, or you'll be waiting to join a session for half an hour.\n\nIf you got a couple friends and just want to whizz through perfected fast-paced combat, then Nightreign is the game for you!\n\nOn the other hand, if you're looking for the classical world-building, exploration and tattered lore, Nightreign runs short at about the 80h mark, after which it's just more of the same.\nSo while I did enjoy all the Nightfarer stories, cosmetics and dialogue, I ultimately wish there was more to it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Incoherent and Abysmal continuation of an amazing IP. The original Elden Ring Succeeds Nightreign in nearly every aspect. Unfortunate and milquetoast. However, I appreciate the effort, at least.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If the game didn't have elden ring attached to it this would be an ok game. Unfortunately since it has elden ring on it there mechanics and gameplay portions that are expected. Lacking many things such as character/build customization for generic classes, a narrative progression for an open world boss rush, poor level progression which I've never even hit level 15, and weird gear/item progression makes it lacking and falls short of what you expect from fromsoft.\n\nIt still has the basic mechanics you expect from the basic fighting system, which gives a bit of saving grace as it's still solid, it just stops there. The aformentioned bad level and gear system with a random level progression of enemies makes it more difficult in runs then it should be. Can we also stop sucking on fortnite's... ya'know..? The whole wall coming in is just so tired and horribly frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is literally unplayable for me, thanks easy anticheat!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is okay, but lacking content for a \"full game\". Kind of annoying they are releasing paid dlc instead of building onto what's there already for people who bought this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh. just not a game for me. i can see the appeal for others but just falls flat, especially, the new player experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s alright but it should be $15 not $40. Shadow of the Erdtree was $40 and had SOOOOOO many cool bosses and areas, y’all hated on that because it was “too hard” (like fromsoft games aren’t all about overcoming challenges or something) You fight the 8 new bosses, half of them are an absolute snooze fest, and that’s it. The map not getting randomized per run is what really kills the vibe, otherwise this game would be decent. You will 100% have more fun doing a co-op run with a friend on Elden Ring then the 8-10 hours you get out of this extremely mid content",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"~30h with tips, ~60h without to 100%.\" -Achievement Scouts 2\n which is subpar at best.\n\nPretty cool game, though don't expect any plot to it. It's just plain fast-paced world domination and boss killing. It's extremely fun with friends to play with which I have none of :)\n\nI had posted a positive review at first but after thinking about it for a moment and doing some research I realized that this game however epic and fun, has flaws that outweigh the goods, like the limited bosses and Nightfarers or the fact that THE GAME HAS NO IN-GAME VOICE CHAT!!!!!\n\nI think communication is fundamental to a team game like this one, it is in fact ESSENTIAL !!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DoN ruined the game at depth 3 and beyond. Serious balance adjustments need to be made. Everything 1 shots you at this point and that just isn't fun. So until they make some serious changes for the sake of enjoying the game. No thanks. Don't waste your time/money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pro Tip: Alt-F4 is faster than quitting to menu in singleplayer.\r\n\r\nNo idea why this game doesn't let you pause or quit back to the roundtable in singleplayer, but hey. We lost that technology a decade ago.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I DO THINK THEY ACOMPLISHED THEIR GOALS AND HIT THE MARK WITH THIS GAME ( That being a polished proof of concept for seamless co-op in future titles)\r\n\r\nI DO THINK THIS IS A GOOD CO-OP ROGUELIKE (although randoms still suck so try to play with a group of people you know)\r\n\r\nHowever for me it just feels bland after a while there is neither enough roguelike nor enough souls DNA in this game to keep my attention.\r\nDefinitely see the appeal of the game and having a good group makes it enjoyable but something just doesn't click for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The only game I encounter FPS drops and freezes. Unplayable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cannot recommend this to anyone unless you have a group of friends. The single player experience feels like running into a wall over and over again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nah this is actually a bad game. It's meant to punish you for everything with no reward. It's a joke. The characters are flat or over complicated. I wouldn't recommend it to fromsoft players that have done elden ring or other souls. It's not a roguelite, it's not a open world. It's a bunch of hodgepodge that never had a direction. \r\n\r\nSoulless cashgrab from fromsoft. They should be ashamed. Jobless. It's not a \"hard\" game. It's made poorly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to start off by saying this game can be really fun it's more elden ring no pvp invasions fighting bosses with friends! At the core I think this is what a lot of people want to play. Nightreign provides all of that if you can get past all of the short comings from the games before it that have been baked right in... a lock on / targeting system that seems to works against you a camera system that is one of the most difficult things to play around at times a controller layout that works against you along with a roster of bosses with little to no down time on attacks. Attacks that can one shot many of the characters in the game or require perfect timing while also having other bosses that a very mid gust of wind could defeat... i frames that can feel wildly inconsistent at times making one character very good because of her more consistent dodges... enemies can spam attacks occasionally making it impossible to dodge... paired with a brutal revive mechanic along with cheesy bosses that will hit invisible players stopping the revive.  Characters with really bad alts or skills that have received very little buffs to help them be viable so if you like one of those characters or play styles good luck... also boss invasions that can bug out and become unstoppable... though if you can get past all of this and more you may just have a great time but don't worry the devs thought of this too and even after the best runs you'll get the worst relics that could possibly be given to you. It's actually impressive how bad they can be and now with the deep of night there is a new layer to the awful relics you can get.. This doesn't even touch on the weapon system the mechanics not explained to the player and so much more...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun but the torture of trying to fight bosses when my friend is trying a new character is aids",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game so ahh. If you buy this game then you should instantly refund and put your money into a good cause. For example to J.C.Staff.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd love to have had a better opportunity to learn to like this game, but I was plagued with crashing at random but frequent intervals. I've played plenty of other demanding 3D games on this computer and I can't recall any of them ever crashing on me. Buyer beware.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't think the game loop is very fun. I can't remember a game I've played with such a large time commitment where almost nothing goes on for a good 80% of the time. It feels like day 1 and 2 are just filler. The map bosses are not made to fight multiple people and it shows.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "darkest night game mode needs to be adjusted, at least let us go down from level 2 lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You get matched with people who may or may not have any idea how to actually play the game. You queue for \"ranked\" content and get paired with people who constantly die. They rage quit and leave. You're left playing solo in a game you got to play in teams. There's basically no consequence for leaving. The rewards at the end aren't good enough to keep people from leaving.\n\nI would estimate my actual \"finish a match with a full team\" vs \"leavers nuke the run\" ratio is 1:5. \n\nNo amount of gameplay or aesthetics or anything makes up for how absolutely broken the team making is. There is no \"join in-progress.\" You're just down a player without anything to really balance the situation other than the inherent health/power scaling mechanics. It's just f***ing lame and I'm tired of it.\n\nI won't be picking it back up until they fix this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you have a widescreen monitor stay away , its 2025 and this game does not support widescreen.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Progression system and single-player sucks so much azz that the intestines made a suprise appearance. FromSoftware's worst game in the last two decades.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, the game is so team reliant, it basically boils down that you can't play without a premade because randoms will not communicate, will not cooperate, and you will be punished for their actions. Lobbies are overloaded with cheaters who make your experience worse. Given the way the relic system works, it's no wonder they cheat for those, but it goes beyond that, forcing bosses in DoN and more egregious actions.\r\n\r\nIt did feel pretty good to play when I started, but they've also since nerfed characters every other patch. They'll randomly tweak or buff a boss so their attack patterns are less consistent or change targets mid-animation. This results in inconsistent punishment for players who play casually.\r\n\r\nIt was very promising, but it just feels like biased halfhearted development work at this point. Maybe the DLC will improve things, but I doubt it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish I could give a middle thumb of some sort. Middle of the road review. \r\n\r\nThis game is a rogue like. This is its greatest weakness. See when the game doesn't shaft you it's a fun time. But that's assuming the game isn't going to do just that. Runs take about forty minutes and if you don't get good drops then that's forty minutes lost. \r\n\r\nAnd the systems surrounding the Rogue like elements are pretty terrible too. The gatcha system for the relics is bad and there isn't a single good relic in the game to modify your play stile. Deep of night and everdark runs I'm convinced are jokes meant to waste more of your time. \r\n\r\nEven with a team of good players the RNG will just ruin whatever time you were having. And if my only fun is coming from hanging out with people I know, then that's not a point towards the game, if anything it's a point away from it. \r\n\r\nLook the new bosses are cool looking but it's a pretty bad experience usually. The soulslike formula just doesn't work for a fast paced randomized system like this. It leaves victories feeling hollow. And don't even get me started on playing with randoms, that is the single worst way to play this game.\r\n\r\nSo maybe watch someone else play the bosses and check out a lore video if you're seriously interested. If you just want some thing to play with your friends, then I guess this'll kill a few hours. But I don't think the money their asking for to play this is worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As a massive Elden Ring fan, not that great of a game. I honestly don't think this game really hits the sweet spot for me. Every time you lose to one of the main bosses, getting back there doesn't feel deserved or rewarding, it just feels like the biggest boss run back ever.\n\nThe game is objectively partially RNG based as you are going to be relying on good loot for the main bosses which is entirely up to how lucky you are. Of course skill is still necessary.\n\nGetting bad teammates that rage quit or troll the run is insanely frustrating in a game where you can pretty much lose everything on the drop of a dime. Not having people to play with makes it an occasionally asinine experience, especially because they did NOT balance the game for single-player runs properly. Fighting two full-scale bosses at once is a prime example of this.\n\nSometimes, on a bad day, the game feels like the most repetitive cycle imaginable. \"I spawn in with my teammates, play for over a half an hour looting, leveling up, occasionally dying, and hoping my teammates don't drop the ball, then I reach the main boss, die, repeat 10 times until I eventually beat it or give up.\", and that isn't even remotely fun.\n\nThe biggest issue is that 80% of this game is recycled from Elden Ring. Only the new bosses and the character classes add freshness to it. I love Elden Ring but I'm not on this game so I can fight a Crucible Knight, I'm here for the new content, having to churn through bosses I've already beaten a million times in a literal different game just to finally reach a new enemy I can die to a hundred times and needing to repeat this process over and over again kills my excitement and interest pretty fast. It's not a matter of difficulty, it's a matter of my limited patience and how quickly it wear's thin.\n\nWith souls-games, I tough it out because I can always just go back to the boss and fight it again. Nightreign I need to do a 40 minute runback that I pray I survive through just for another chance to fight it.\n\nBut again, the game DOES have amazing boss fights for what it's worth, and the character classes are fun. If I was rating it purely on the new content it has, 9/10. But the actual experience? 7/10 at best, 6/10 would honestly be fair. Only recommended for people that have a genuinely insane tolerance level.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A fun game with great potential that's held back by network issues and bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My experience with Nightreign is the kind of game that leaves you feeling mixed at first, then you learn to like it, and finally you hate it.\r\n\r\nStarting with the positives, transforming Elden Ring into a roguelike style is an interesting gamble, and it's mostly a successful one. You learn to think about a plan of action, where to go next, churches? castle? great ennemy? You learn to improvise if a Night Lord comes and messes with you during the day, and if, like me, boss fights are what you love about Souls games, the game puts a big emphasis on them. The characters' stories are decent, and each one has an artistic direction that sets them apart from the others, just like the Night Lords, for that matter. And some OST are gorgeous too, hi Caligo and Heolstor !\r\n\r\nSo why am I giving it a negative rating? Because Nightreign is a fun game, but it has some unbearable flaws. I classify them into two categories: the ones from the basic content and the ones from the additional content, which are even worse and amplify the former's even more.\r\n\r\nI'll be brief with the first case: servers that literally cause the game to bug, 6 seconds of latency because my session wants to run on a server in Asia, I know its Peer 2 Peer but holy ****, some map seeds are much more advantageous than others, so your runs can heavily rely on RNG. And meeting the same bosses over and over again can be a bit repetitive, most players expected more variety of bosses from all soulsgame.\r\n\r\nBut the RNG/Servers flaws, are somewhat manageable for an experienced Nightreign player. Until these are made three times more unpleasant by the other category of problems in this game: the flaws in the additional content.\r\n\r\nThe added content concerns the Everdarks and the Deep of Night:\r\n\r\nThe Everdark content is a Hardcore mode of nightlords : some offers a very balanced challenge like Adel or Fulghor. But some of them feel sluggish and lazy, like Caligo, and even worse, some are VERY POORLY designed, like Libra. You just need to look at his wiki page to see what an abomination this boss can be and how he inflicts Madness in real life.\r\n\r\nBut the biggest flaw in the game right now is its “Deep of Night” mode.\r\n\r\nA ranking system that is becoming increasingly difficult in the most sloppy and unfair way possible. There are 5 levels, each requiring a certain number of points to reach that you gain by winning, and lose by getting defeated, and the Night Lord is chosen randomly for each run. The difficulty is that now, enemies have more health and damage (creative...), but ALSO, the higher you climb in level and therefore in difficulty, the more points you lose when you lose a game. You can win against 3 Everdarks at level 4 or 5, but be aware that A SINGLE DEFEAT will take away the equivalent of THREE VICTORIES. So in a game mode where almost everything kills you in one hit, you need to have a win rate of over 75% to progress. Now take all the flaws I've mentioned, the connection issues, the poorly balanced Everdarks that have a chance of appearing, the runs where a single bad teammate can cost you a game, and the ranking system becomes more frustrating than League of Legends (congratulations on that).\r\n\r\nBut do you win something for all that effort? No. no skins, no new characters, no skills. Oh yes, if you reach DEPTH 5 WITH 9999 POINTS you get a tiny little glowing banner. Might as well climb the Mount Everest in exchange for a biscuit.\r\n\r\nA simple rebalancing of the additional content and dedicated servers (this is FromSoftware, so I doubt it) would massively improve the game. But until that happens, the negative aspects of the game overshadow the positive ones after you've completed the basic content (about fifteen hours).\r\n\r\nMy advice is to buy the game on sale. Forty bucks seems a little too much, and my opinion will remain negative until the game is properly rebalanced. And of course like the pigeon that I am, I will buy the DLC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't recomend this game, and I regret buying it, for a roguelike is so repetitive, if you want a game with the same concept but better play ravenswatch, I buyed it for the parry class, but the parry cost you stamina, so it's not as satisfiyng as sekiro, and the \"abilities\" u unlock are basic things, and purely statistics, nothing creative like u would see in a good roguelike",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "优化垃圾，平衡垃圾，服务器垃圾，没有人带不看攻略根本不知道在玩些什么。这是游戏",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Features typical bad souls net code.  Desynchronizations, latency, phantom range, frequent disconnects.  Inexcusable for a multiplayer game.\r\n  Optimization is terrible and I can't even get through a single \"day cycle\" without a CTD.  Even solo crashes so much I can't complete a match.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FIX the net code! the latency, desyncs and network-disconnects ruin the game completely until then I con not recommend this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is great but not leaving a good review until they fix stutter & fps drop problems in high end pc.\nThe gameplay is unbearable, i could have enjoyed more if i wasn't having this issues 24/7.\n\nRTX4080S & Intel(R) Core(TM) i9-14900K.\n\nand yes, everything is updated.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In general, it’s a very fun collaborative game. I like fighting with people instead of against them. I also enjoy the interaction between players, when we understand each other without verbal communication.\n\nHowever, I can’t say I like the DoN mode. It puts too much emphasis on winning and therefore takes away a lot of the fun aspects of the game, like exploration or trying impractical but fun new ideas. Also if it’s designed for hardcore players, then we should expect more experienced teammates in DoN, but in reality, you get all sorts of weird players who don’t even know the basics. In normal mode, that would be fine, you could slow down the pace and try to guide them. But in DoN where you care about winning, it’s just very frustrating. During the Nightlord fight, sometimes I have to give up on a downed teammate because I know saving them won’t help us win, but that also ruins the fun for them, and I hate that.\n\nBut without DoN the game gets boring very quicky. We need more content — new maps, bosses, heroes, garments, and so on. Maybe that’s something to expect from the DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Did my best to try and enjoy it. It's repetitive, has feast or famine balancing, has a very boring map, another pointlessly abstract story, and a burning ring mechanic that punishes you for making decisions such as inspecting their incredibly vague item descriptions.\r\n\r\nI couldn't recommend this game to anyone. The people who enjoy it have a very niche interest.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The DLC bricked my save because I refunded it, lost hours and hours of progress because of their shitty DLC, literally fuck these devs to death.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "needs more humanoid bosses, the ones they have are boring.\nthe looting and night cycle before the main boss got old fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Massive Fan of almost all these games. This one, however, is a spit in the face. For a game where mistakes can immediately equate to failure, the amount of mistakes that come from the un-optimized mess that is this insult of a $40 price tag is ridiculous. This game has the potential and its not being met. Unsure if it's incompetency or a lack of care. The servers are more rickety than an out-of-the-box gingerbread house, and it's connectivity is the hardest enemy you'll face. Fix them. It's a shame such interesting story and characters are locked behind this horrid mess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Does pretty much everything wrong you can to combine two gametype I love: roguelikes and soulsgames. Unfortunately highlights the worst of both of them and you end up with a frustrating game at the start, until you know what to do and it becomes boringly easy. The boss roster is a disgrace, even more so when you realise they have the whole Fromsoft catalog to chose from.\n\nA truly baffingly accomplishment to make this game come out this bad, a shameful effort which is overpriced as well.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this is a basic and normal game that becomes boring in the long run and doesn't offer much content , elden ring nightreign = 30% of elden ring + 8 charecter + 8 new boss + two bosses from each game : ds1,ds2,ds3, and just this .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Average cock sucking of fromsoft from the community once again.\r\n\r\nThis game is poorly laid out, feels like a jumbled mess of asset flipping, and in general has awful gameplay flow and design. \r\n\r\n4/10 at best, but the community is delusional about it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game dead doesn't work; the servers are awful and more often than not (about 80% of the time for me) it crashes when trying to just load in, and then it eventually crashes anyway. I have 64 GB RAM, an RX 7900 XT, and a 7800X3D, so I don't think it's a hardware issue. Even when you can play, it's just alright. It doesn't do anything interesting or uniquely fun and I always come out thinking \"Wow, I would have either rather been playing monster hunter or a real soulslike\". Haven't been able to load into it consistently since it came out. This game is atrociously maintained and definitely not worth $40. Garbage. Just play Elden Ring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't recommend with how repetetive the game is, fun for 100 hours but going on the same map to fight the same bosses gets too repetetive. i hope the dlc fixes this but its still a paid dlc.\nnightlords are good but not a saving grace of nightreign\nshoulda been a dlc and not standalone",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Best way to describe it is a elden ring PVE battle royal.  Not my cup of tea since I like to take my time and explore areas but it does offer a few new bosses.  Wouldn't say it is worth the price.  They could have added this as a expansion to the base game itself.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is great, enjoyed playing it for the 130 hours I've put on it already.\r\nBut for now until it's fixed, I'm putting a negative review.\r\n\r\nReplayability is decent, relic RNG is mediocre though. But the fighting and bosses are fun as hell, including a few extra bosses from different souls games which is neat.\r\n\r\n[h3] ONLY ISSUES involving what I said above though... [/h3]\r\nAs of recently, the game now suffers just from starting up. Taking up to a several minutes just to start up the game, when it ran perfectly fine previously. Now forcing me into offline mode 50/50 of the time because of \"framerate issues\". Tried researching about this issue and never really found any answers yet, but I'm not waiting minutes EVERY SINGLE TIME UPON STARTUP just to play a game.\r\nIf ANYONE has an answer, that'd be greatly appreciated.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "firstly yes, there are people who enjoy this game and that's fine BUT buying this game is a gamble. I am a FromSoftware fan, all the DS games, Elden Ring, Armoured Core....Nightreign isn't FromSoftware, its a Fortnite game with Fromsoftware assets. \nJust because you like souls-like doesn't mean you will automatically like this game. It feels like a cash in on the Fortnite Formula...next there will be a battle royale mode.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "glitchy asf multiplayer. networking is ass. Losing points in games I win. dont get into it unless u really dont care about losing randomly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks they should stick to making games where you can explore not whatever tf this shite is",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "such a good game but like every battle royal style game with a circle forcing you at every turn its not worth it. If you want to enjoy elden ring then just play elden ring, if you want to enjoy a battle royal type game mechanics there are plenty of those trash. Have a good day, and yes i have a bias to battle royal as i have a large dislike for games that take anything from them such as the dreaded dumb circle in a pve game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring and bland nothing to do. Bosses are too Ez. Bosses and janky mechanics are copy and paste from similar bad titles. Game does not feel intuitive or unique whatsoever and is not very rewarding for a rogue-like video game. Teammates are stupid morons and I'm always outperforming these idiots who I'm unfortunate to solo que or form a stack with. 0/10 THIS GAME IS TRASH!! I HATE IT!!! DO NOT RECCOMMEND!!!!...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You either enjoy Fromsoft games or you don't. I tried too but the art and style didn't grow on me. Also the bugs are insane, the amount of times an attack goes through my character model when I parry not giving the parry but also not dealing damage is crazy. That interaction is jarring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somehow my specs aren't great enough to get this game to run smoothly. It's an absolute travesty to see lag whenever you try to open menus or even the inventory. FROM dropped the ball on this one. I wouldn't even call it a console port as I've been better performance on emulators. Would not recommend anyone get this game. In fact I wouldn't even play it if it was given to me for free - it's that bad.\r\n\r\n• CPU: Intel Core i9-14900F — 24 cores, 32 threads\r\n• GPU: NVIDIA GeForce RTX 4090 — 24GB VRAM\r\n• RAM: 64GB DDR4\r\n• Storage: 1TB WD SN850X NVMe + 1TB Samsung 970 EVO Plus NVMe\r\n• Display: MSI MPG 271QRX QD-OLED — 2560×1440 @ 360Hz, HDR\r\n• Motherboard: MSI Z790 (MS-7E06)\r\n• Keyboard: Wooting Two HE (analog input)\r\n• Mouse: Logitech G502 X LIGHTSPEED — paired with Logitech Powerplay\r\n• OS: Windows 10 Pro 64-bit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Repetitive and geared towards continuously grinding. Some of the game mechanics make no sense. Some stuff is in the game just to be there, you literally don't have time to do anything. \nYou end up just doing the same thing over and over. The map is most often empty and is hard to find proper mobs to level up. The last boss is almost impossible to solo unless you are a  die hard player. Not showing the specs of the weapons is a ridiculous and idiotic idea.\nTHERE IS NO WAY TO EXIT TO THE HUB DURING A SESSION. IT IS DUMB!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A great game plagued by technical issues and buggy online play. \r\n\r\nWith deep of night mode, the issues are only exacerbated because you get a penalty on your score if the game thinks you're abandoning a session, even when it's caused by technical issues on Fromsoft's side. \r\n\r\nOccasionally you will get kicked out of a session, back to the main menu, and then it will offer to attempt session recovery. Great! Except it will often fail. The game will offer you to retry or cancel. Retrying won't work. The only way to fix it is to quit and restart the game, but then you get a warning that this will incur a penalty on your score. Wonderful.\r\n\r\nThe performance of the game is poor for many people as well, and if you are unlucky like me it will randomly freeze for multiple seconds, even on high-end hardware. There are long lists of fixes to try out for these problems that work for some people and not for others. I have tried everything to no avail.\r\n\r\nThere's no support for wide-screen or above 60FPS either.\r\n\r\nRight now, I can't recommend buying the game and hope that by the time the DLC releases, some of these technical issues will be fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "All teammates suck, story is lackluster and endgame is just pointless grind. Game can be fun at times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "new update and gurdian is still fucking trash worst than trash unplayable to the point i want to file a lawsuit over it this is worst than dropping the ball you showed up with a hockey puck to a basketball game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thought playing this on pc would change my mind but it didnt. Still fun to play with friends and fight bosses, but this is still the worst roguelike ever. \nRelics are a joke still, the map never changes aside from the shifting earth event happening just enough for me to resent it. (Yes, im aware of the collector signboard), everything is static and always feels the same even if i try switching up the run. and STILL no VC for jolly cooperators. (guess i'll continue to rely on ping and shield spam.)  Oh and cant forget the Dumb BR closing ring. not Fromsofts worst game imo but its pretty still pretty mid. \nPraying that Forsaken Hollows update Vastly improves the gameplay loop and brings more value to the Overall experience. All and all a mixed bag.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love Elden Ring but this game is definitely not it.. and come on it's 2025 still has no ultrawide support?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's all the worst parts of Elden Ring, but in a form that punishes your attempts to learn by reducing your levels for every death, and in a game full of instant kill attacks and input reading bosses, there's no opportunity to even learn.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've been telling em for years that adding balatro porn to nightreign would make it better, for years :KCPlusOne:",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}