{
  "positive": [
    {
      "review": "Everyone's reviewing the driving part of this game and yeah it rules but have you taken a look at the reference section and read one of the bios for a driver and it's like \"this girl lost her boyfriend 6 years ago and she cleans the car every day in his memory\" and there's 9000000 drivers and they all have bios like that. And then you race against a driver named MJ6Feet6 and you google Michael Jordan's height and sure enough",
      "voted_up": true,
      "votes_helpful": 132
    },
    {
      "review": "Tokyo Xtreme Racer is a great revival to form of a racing series that hit its stride in the PS2 era of arcade racing games. Genki have kept it simple, relatively clean, and lots of fun. The simcade aspect also makes the racing feel somewhat realistic unlike other arcade titles, and you can spend a lot of time fine-tuning the settings of each car as well. The performance and graphics isn't bad either, especially given this is on UE5.\n\nIt does lack a bit of polish, what with the somewhat unbalanced endgame rivals, uneven power upgrade balancing, AI that will corner at some incredible speeds, rendering of certain stickers and emblems... but Genki has done updates to try and fix these issues. They've also continued to add new free DLC content with the vtuber wanderers, so there seems to be a pipeline in place for more in the future. (Personally I'm hoping for WandereRyS, but we'll see)\n\nAnyways, it's pretty solid and definitely worth it on sale if the $50 price is too high. You can get 25 to 30 hours of gameplay out of TXR easily if not more.",
      "voted_up": true,
      "votes_helpful": 28
    },
    {
      "review": "Great classic racing game! I love music and night races atmosphere here, really appreciate classic JDM cars even with those K cars and stuff. And car effects look absolutely stunning< I would even buy DLC just to see more of them. And the simple and intersting duel's on the road with skill tree was pretty nice. \n\nIn fact, I've been waiting for the release of the game \"NIGHT-RUNNERS\" for quite a long time, so much so that I didn't even notice the release of this masterpiece at the time. Platinum was pretty tough and gameplay's a bit grindy, but I mostly like it. Ten devilish Z's out of ten.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Here is the review I wish I had seen before buying: I was worried that the highway-only format would be repetitive/boring but it's actually perfect. \n\nThe world still feels super huge and open and would probably be annoying or doing too much with urban/city streets. It's super fun to cruise around chasing down rivals and grinding to tune your car or buy new cars. \n\nAt certain points the game feels easy but as you level up it gets hard again and if you play on challenge mode (highly recommended) there is a lot to work towards which is very rewarding.\n\nI was also worried about the lack of multiplayer but tbh it's really refreshing to just chill on my own and not worry about cheaters, server issues, or constant cosmetic upselling. I put 6 hours straight in my first single sitting playthrough if that tells you anything. \n\nOnly things I would change is I think car sounds could be better. Music is basic and retro but repetitive and kinda puts you in a trance state  so maybe add a bit more variety. Maybe higher difficulty settings (already challenging enough but gets grindy at times) and maybe a multiplayer mode where we can all just spawn in on random parts of the highway, basically the same as NPCs against each other on small servers or something. But this game is honestly fine without multiplayer, really good as it is.\n\nI'ts also really nice to play a game that just works and is actually in a finished state upon official release. It feels like a total package. Legitimate 9.5/10 game.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "its fun, real japan jdm feeling.\r\nAlso it works with xbox controller on pc which is nice.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This game does NOT forget were it came from. As a Tokyo Xtreme Racer Zero fan this game feels Nostalgic to say the least. Def what the racing game world needs rn",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "a blast from the past, an absolute legend back from the dead, and a new hope for the revival of the old days of thematic racing games that focus on GAMEPLAY before anything else.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Very simplistic racing makes this a pretty fun racer to relax with. Cool cars and great tunes keep me coming back to this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun, and some catchy music.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing racing games my whole life and this is probably one of the most addicting ones I've played in years, like a lot of racing games from the early to mid 2000's you'll be building your garage tall instead of wide, instead of the game giving you 40 sports cars to try out you'll pick one car that you really like the design of and then tune it until its a monster. There's a ton of customization and tuning so you can really pin down how you want your car to feel on the road and the progression feels satisfying with a lot of perks and parts to unlock at reasonable pace. I really appreciate that the game changes the sound of your engine as you upgrade power, exhaust, and intakes so it really feels like your taking a barebones stock car and turning it into a purpose built track car. I'll probably be putting a lot of hours into this game over the next few months. Put on some of your favorite music and rip around the highways of Tokyo!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Top stuff. I haven't played the old TXRs so I can't speak about its return to form, but as a standalone arcade racer in 2025 it bangs. Fun handling, excellent setup, challenging but not stupidly hard progression, cool bits and pieces about the racers in menus/dialogue.\n\nOne complaint I'll have is that the menu controls are a bit of a mess, especially before you get used to them. Repeatedly switching between mkb and gamepad seems to work the best",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Sense of speed and focus is on the point, a perfect remasterd  masterpiece game, it brings what racing games used to feel  in the past  without internet back then, overall 10/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "all it needs is a FPOV and better wheel settings although it does say its recommended to play on a controller. Those two things would defeniately make it that much more enjoyable",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "We are so back...\r\n\r\nAfter 68.7 hours spread over 40 days, I have to say this has become my favorite racing game since the first Forza Horizon. The atmosphere, the story, the cars, the races... everything feels amazing. Despite some very challenging bosses [spoiler] (I'm looking at you, Melancholic Angel, Steel Heart & co.) [/spoiler], this game felt enjoyable and rewarding at every stage. Highly recommended, even if you are not that much into Japanese street racing (trust me, I didn't know I was so much into it either).\r\n\r\nThanks, Genki!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is easily one of the greatest racing games to come out in the past few years. Racing game of the year, even.\n\nThe driving feel is great, and the story progression is some of the best in the genre. The other drivers may all be silhouettes, but they have hundreds of times more personality & charm than you'd expect. The overall style is a perfect blend of new and old. Tuning is deep and rewarding, which really encouraged me to look into how each setting works more in-depth. Customization also is very good for a modern racer! The difficulty is tuned just right for me, but your mileage may vary- if you aren't attentive to your own tuning or your opponent's upgrades, you might feel over or underpowered in comparison. \n\nGenki are also very good to the playerbase and constantly improving on things, from Early Access till now. It's seriously impressive how they made such a comeback after their long absence in the gaming space, and I think things can only go up from here.\n\nYou owe it to yourself to play TXR if you're a racing game fan. The genre needs more games like this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Simplistic, but in every single good way. Prime example of less is more while giving you hours of content with a steady and relaxed grind. 10/10 would sit on limiter at 170+ for 30 minutes straight again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just beat this, pretty much everything you could want in a racing game. Great sense of speed, sense of progression is there, tuning your car trying to squeeze every tenth of performance out of it. Great soundtrack and best of all it runs beautifully without relying on upscaling tech. Highly recommend this one! Thank you Genki for the key!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun and refreshing racing game in a sea of forza and nfs clones, basically a refresh of a series and formula that's been dead since the ps2 with great visuals and fun gameplay\nthis game *is* made in ue5 but surprisingly well optimized! runs very well on steam deck and my computer, and it doesn't need the very latest and greatest specs to run at all\nin general, this game is pretty fun and relaxed when you're just driving down the highway, but picks up the pace during races. the visual novel elements are more passable than \"good\", but the gameplay is the main focus and what makes up for it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game in a  classic franchise, TXR is back!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has a major flaw and it's that the difficulty curve is like a crypto coin graph. You literally outspeed every single enemy you face making it not that fun or you just get 100m gapped by the boss in 2 second then u have to go buy the strongest car then google up best modifications then proceed to make the boss go to the wrong route and win or bang him into walls and cars not to mention you have to start the boss fight at specific parts of the map to even gain a chance otherwise they just zoom off instantly. Like there is no blocking involved you are just slamming the guy in to win there isn't any racing it's just car x car. or maybe its skill issue. overall the game is eh.\n\nI would like to say retrying bosses and fights are the worse part of the game because you spend your nitro and your tire wear and god pray for you if u have the heat system on because now u lose the boss fight u go back to garage drive back to the boss for a retry or if you hate yourself you drive to a carpark to refill nitro and change tires.\n\nI'm unfamiliar to racing games and the midnight racer series however it boggles my mind that some leaders are harder than the checkpoint bosses like shuwashuwa and gentleman it's so weird to me. And steel heart is a great boss he isnt too fast he isnt too slow but the problem is the triple battle where u fight steel heart, lucifier and ryoma like ?? steel heart falls behind so he isnt even part of the race and lucifier's only goal is to make u crash and ryoma just zooms off like how is this a interactive battle, i had to retry over 20 times and the way i won was by speed off with nitro but ryoma caught up but he crashed into a car and i crashed into the little checkpoint zone with the partition walls making all 3 of them crash into me and i just sped off again like great game design man.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing arcade racer and worthy entry in the 首都高バトル series. The progression is very beginner friendly. The player will go from zero to hero in no time, each new car or tuning option is an event. The game is super polished and runs like greased lightning on low spec'd hardware, but scales up beautifully with more GPU power.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "BACK UP YOUR SAVE!!! Just lost a 130 hour save, opened the game to just the continue button greyed out.... Id still play it and will (not that i now have a choice) start the game over at some point but because the game only has one save file that overwrites, if this save becomes corrupted or wipes, there are no other saves to pull from like almost any other modern game. Otherwise brilliant and would 100% recommend to old fans and people who have stumbled across the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "TXR 2025 is a good deal for the early access price (roughly half price), and too short for full price.\n\nHandling is predictible but tricky to learn, however brakes never felt right to me.\n\nThe game could really use another race type halfway through the game, it can get too repetitive toward the end.\n\nThe map could also do with having more roads, or an entirely new city (such as Osaka in previous titles)\n\nThe game's difficulty is old-school unfair, it's only difficult if you try to race opponents fair and honorably.\n\nThe story serves the game's purpose, if not basic.  Could really benefit from having more recurring characters to interact with.\n\nOverall, I like that the game has character, and largely stays true to what the series was decades ago.\nIt's very refreshing that the game contains no advertising of in-game purchases.\nIt is barebones in relation to the full price of the game, but worth it on a sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably the best racing game released this year. Its pretty repetitive and has some things I dont like, but the overall experience is still rather great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game ticks all the boxs for me as an actual arcade racer game like the ps2 era, it amazing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Genki surely knows how to make a great game even after all these years. Definitely best arcade racer game on the market right now and if you are into wangan racing you should try it. Would recommend 10/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It is fun, the graphics are great, cars look good - just feels a little tedious almost doing the same races over and over. But I guess that's the true spirit of the original game. Worth checking out, but maybe wait for a price drop first.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its a realy fun game. just like the old games back on the ps2.\r\nwould recomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the best racing games of 2025 and I'm happy to say Genki has done it once again! Shutokō is back baby!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow. So this was a recommendation from NoClip, and it was right up my alley. There's so many tweaks to each and every component it's nearly overwhelming, but the community seems nice and helpful and I'm well on my way to completing New Game+.\r\n\r\nIf you want to just roll around a virtual Tokyo, with rainbow sparkles emanating from your Skyline, this game is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Refreshing to play something so arcadey. Makes me wanna play the older games. Steam ports?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is old school fun. It is simple, but very addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game with a nice soundtrack, reminds me of wangan midnight in the arcades but i can play it at home.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of the most fun racing games I've played in a long time. Just a good old classic arcade-y racing game. My only minor complaint is I feel it could have a few more cars but that's just nitpicking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game , nice change of pace or race games . top tier car list",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game series. So glad that Genki has brought it back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s fun, I’d say. It brings back memories of when I used to play Tokyo Xtreme Racer 3, and I still play it to this day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Apparently this game is set 4 years after the last title, which was about 18 years ago. That feels like a perfect metaphor for this game - modern graphics and hardware with the soul and gameplay of a golden-age classic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thought I was doing pretty well until I accidentally challenged a taxi.\n10/10 would attempt again\n\nLearned about this game series from a certain sim racer turned race car driver youtuber...bought this game during early access and it's pretty fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun oldschool but not old-feeling racer. But you need to love grind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TXR is jump into ps2 era nostalgia and simplicity, no eshop, no liveservice bs, just a good racing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It remains true to the classic games, simple yet complete.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All that TXR0 comes flooding back. Just as good as it used to be, but shinier!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "since the update the FFB from a Moza R12 feels a lot better. not quite as nice as say a 90s arcade machine but its getting there. for some reason my FFB percentage is greyout and stuff at 30% but its enough. really could do with online leaderboards , thatd be nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Arcade racing game devs, take note: this is how it's done. All you need is a good map, a decent car selection, period accurate car customisation and a fun gameplay loop, and you've got a winner on your hands.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Straight out of the 6th generation era of gaming and it doesn’t disappoint",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TXR25 is a faithful lineup in the series, with fun gameplay and interesting additions like perks and a more fleshed out PA system (compared to TXR3) that makes it more accessible to newer players and funner in general.\n\nTry it out! It's a quality game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game love the music and nostalgia this game brings back love it good ps2 days",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Racing Game of the Year 2025, shame it wasn't even nominated. \n\nInstead we got f1 slop, mario kart slop, sonic racing gem and a sports game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely tied for Game Of The Year for me along with 2 other titles. This is arcade racing at it's best and quite honestly one of the best video game experiences I've had in ages, even when this was in early access it still felt like a finished game for the most part. The quality on display is outstanding from the highly addictive gameplay where I would find myself saying \"just one more race before bed\" and proceed to play for almost another hour or so it's that good. The games soundtrack is phenomenal but after a while I'll admit I did mute the games music and play some mixes that I felt really fit the atmosphere especially playing late into the night will link those below for those interested. I could gush about this game for ages so I'll leave the rambling out and let the game speak for itself definitely play this if you want something that is genuinely fun and absorbing.\r\n\r\nhttps://www.youtube.com/watch?v=-6U3Pz7-KMk\r\nhttps://www.youtube.com/watch?v=QVTWvOzktbE\r\nhttps://www.youtube.com/watch?v=5RU5QG5EBvs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Should have been nominated for best racing game its really a shame 2 kart racers got nominated over this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game hits almost all the core points of a racing game: Great driving physics, beautiful visuals, awesome soundtrack and decent customisation. With the only element lacking being the sound design overall.\n\nMuch like this review, it's that simple. It's as solid as it gets for a racing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First time in a long while that I was excited for a racing game. Enjoyed it when it was in early access and the full release did not disappoint.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A MODERN looking CLASSIC racing game where you actually progress, instead of being given everything to you from the get-go, which is something that is missing so much in the modern age. Kudos to Genki for sticking with their PS2 TXR formula, but with modern graphics\n\n湾岸",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best racing games of the modern era, genuinely such a great return to fun racing games, I've missed games like this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just as fun as it was on PS2. Amazing cars and can be challenging at times! So glad they brought this back",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TXR is the racing game than we needed for a long time with all those deception in recent years in racing games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This games is right up my alley (JDM, Racing in the streets of Japan, Challenging)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great comeback to the series and this style of racing games, hope they can add more classic JDM cars to the mix",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "true throw back, loved this game in the past, it got better with age.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seeing this being released in the year 2025 where most of the new games have to be live-service plus microtransactions up the alley sure is refreshing af, and the best part is this game is hella fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A modern reincarnation of the old games in the best way possible. Love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best racing game to come out this year.\r\nIt's a ps2/x360 era of fun racing video game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the most pleasant surprise of 2025. It hits that nostalgic itch while bringing it into the modern day. Great soundtrack, the cars look and drive good and the progression system is fun.\nThis game works good on the Steam Deck and therefore easy to pick up for a quick game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic series brought back after being on hiatus for 17 years, feels just as easy to pick up as the ps2 games but with new QOL features. New cars, new rivals, old cars old rivals, this game can be picked up and played by everyone through an \"easy to learn, heard to master\" model. Learning how each car handles and mastering the ability to flow through each corner at blazing speed and leave your opponents behind. I absolutely adore this game and it strongly lives up as another game in a franchise a lot of people missed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally the best arcade racer out currently. Genki finally maned up and showed the racing game industry how to make a fun and good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was my introduction to TXR. I was very excited when it first got announced, as I'm a big fan for high speed highway racing. Growing up I used to play the WMMT series (3DX+), so it did certainly give me some nostalgia.\r\n\r\nThis game is incredibly addicting despite having to race in a straight line with the occasional corner or two, I completed the game and have started doing a NG+. I always enjoyed the concept of starting off with a basic car and working your way to the top, I've been waiting for a game like this for a long time.\r\n\r\nThis game has a great car list, soundtrack and general vibe.\r\n\r\nI highly recommend this game if you are a fan racing games that start you off with nothing just like the older NFS games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I first joined the community that loves this series when I played the U.S version of the final game they made before they went on a hiatus you could call it and then came back with this absolute banger. Import Tuner Challenge I believe they called it on Xbox 360, that was one of my go-to games back then, and I guarantee you if I found my 360, and one of my old copies, or a copy of that game, it would be one of the first games I would probably play on that console. I have nothing but love and respect for Genki and the games in this series, both the ones I played on consoles, and the ones I attempted to play on shitty computers on PlayStation 2 emulators. If you  are a fan of this game series and have the money to buy this one, 1. then DO IT! If not, 2. then wait till it goes on sale, then refer back to step 1.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Refreshingly different than modern racers, but tracking the progression and specific requirements of other drivers can be tedious and waste lots of time. Still fun, still worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything you want from the series and more (sometimes a little less).  If you've liked any of the past games this is a no brainer.  To someone new it's hard to explain, it's just an addicting racer that's also basically a fighter but also some light rpg stuff and manga drama... so yeah get it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shows to older racing games were doing something right and going back to those methods still makes great racing games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been investing a lot of offline time on steam deck into TXR through beta and had a total blast.\r\nGame of the year contender at the very least - it does it's thing very, very well...\r\nAlso is perfect for Eurobeat compilations",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR if you're gonna buy any racing game from this year, probably prioritize this.\r\n\r\n\r\n\r\nWow. Okay.\r\n\r\nThis is probably my favorite modern racing game so far.\r\n\r\n\r\nStory-wise, it has a very solid foundation. They even built the story quite well, although if I may call it as it is, the cutscenes (a.k.a. poems, apparently) are a little too sappy. It reeeeally doesn't need the extra cutscene in my opinion, but maybe it's just an artistic choice.\r\n\r\nEither way, the story was very enjoyable and easily understood. It's refreshing to see a racing game with so many deeply rooted lore (going back to almost 25 years ago) to ACTUALLY use the story as-is, with minimal retconning.\r\n\r\nI really loved the inclusion of so many racers from older games (spoilers for some of the TXR entries, including this one), such as [spoiler]Purple Meteor, the original Jintei and Snake Eyes, and last but not least — a mainstay for maybe any game set in the Wangan/C1 area — Akio Asakura.[/spoiler]\r\n\r\n\r\nGameplay is very fun and engaging, especially in the earlier stages where you have to \"make do\" with whatever car you got at that point. You REALLY have to win, no matter what the strat may be.\r\n\r\nOne thing to point out is definitely, DEFINITELY disable camera shake. Or at least, minimise it. On lower speeds (100-200KM/H) it might look cool (although a little disturbing), but eventually in the higher speeds, you're gonna feel veeeery dizzy if you don't disable it.\r\n\r\nOn an unrelated note, the flashing streetlights makes me sleepy on high speeds, for some reason. Maybe I can make a scientific paper on it?\r\n\r\n\r\nThis game really plays out like it's older counterparts, just with more QoL that makes it more accessible without ruining the trademark pacing of TXR installations in general.\r\n\r\n\r\n\r\nGraphics is — surprisingly — well made and quite nicely optimized (although I wouldn't call it 'light', per se), unlike some of the other Unreal Engine slop games out there that only flips assets and calls it a day. No. This isn't a game like that.\r\n\r\nAlthough I still have to retweak some of the settings to get a consistent framerate in 1440p with a midrange PC, I still think that the optimisation deserves more recognisation due to the low, low bar being set by other UEslop games. To make a game that really captures the essential vibe of Tokyo, WHILE keeping it modern AND playable for midrange PCs? That's some baller move, I can't even lie.\r\n\r\n\r\nDespite its steep price ($50), this game is a huge gust of fresh air to the racing game community, and I think is well worth the money. At least in my experience, I enjoyed this game much, much more than the Forza Horizon titles (despite spending almost 1000 hours on both games combined), The Crew 2, and the 2 modern Need For Speed titles I have in my library combined.\r\n\r\nThe past 70~ hours I spent with this game is of better quality than the 1000+ hours I've had with the other racing games in my steam library. Go figure.\r\n\r\n\r\n\r\ndon't race the taxis/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was replaying TXR Zero on PS2 right before this came out. The game is pretty much a modern version of that. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great revival of a classic game from the PS2 era. A really fun arcade racer with great vibes. I think the addition of perks is interesting if nothing else. I also enjoy that they kept the same style of story telling form the PS2 games, including the reference section with bios on all the silly rivals.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very reminiscent of the older games; it reminded me of playing Tokyo Xtreme Racer 2 back on the Dreamcast. The formula hasn’t changed much: race, upgrade, get new cars, rinse, and repeat. It’s fun in short bursts, which is sometimes exactly what you need. Like the old games, it still has a bit of jank in the controls and optimization. Other than that, it’s a fun nostalgia trip for those who remember the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Goated game. Just like the old TXRs really deep and really stylized. The most fun I had in any racing game released in the last 10 years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Completed the game 100% for the third time. It pretty dope to the point that people in car meets that I attend talk about this game. It's basically a game about racing against others cars at the Tokyo freeway with fighting game and RPG elements. Genki did a great job with their comeback within this entry, especially with feedback during the Early Access phase. Highly recommended if you're into Japanese car tuning culture.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really solid arcade racer - it focuses on a niche and does especially damn well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun, chill racing game oozing with old school vibes. They also do VTuber collabs, what more could you ask for?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great arcade racer to just sit back and enjoy driving.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun arcade racer. has its challenges. just like old school txr series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a throw back ive been waiting for.  its not as cheesy as the old ones which i miss cause u got some cool and weird cars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A proper return to form, great game and great to see Genki doing what they do best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This isn't the game we wanted, it's the game we needed.\n\nGenki comes back out of nowhere and shows that they still got it.\nThey stuck to what works, polished it, and dropped one of the best racing games in the past 5 years.\n\nRegular updates and bugfixes show that genki is serious about this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Arcade racing game and different from all other games in the genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really genuinely fun racing game as a guy who’s not really into racing games, the atmosphere is unmatched. game is an excellent example of how to PROPERLY optimize games, UE5 game that runs amazing on steam deck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak Shutoko experience, can be challenging or relaxing depending on your style of playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best highway racing game there is right now, great selection of cars and the different opponents do race differently than each other, works well with my G29 sim wheel. The customization is not a lot but enough to satisfy most people, and then the soundtrack is also really good, have not hated a single second playing this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tokyo Arcade Racer provides an exciting arcade gameplay experience that is a much-needed break from the festival racers and the realism-focused simulators that nowadays make up a huge part of licensed racing games.  Given that this is the first entry in the franchise in a long time (with a lot of great racing series having been born, died, or in a loop of mixed quality in the same time span), I think it says a lot that this is the first racing game that instantly blew my mind the first time I played it since Forza Horizon 3.  I've only played a few hours as of the writing of this review, but this game gives me a glimmer of hope that maybe the racing game genre might not be past the point of return in terms of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Freaking Love this game and just as I look this morning, a new Rival DLC for FREE!!!! Love this and cant wait to see what come next and all I can say is I am so Glad TXR IS BACK BABY!!!!!!!!!! Looking forward to the next project or installment, you can tell this is a work of love and I have too fallen head over heels for this game. Bit Grindy but with a Wheel you will be able to really lock in once you calibrate everything correctly G920 is what I use and it's quite good and I am addicted. Can't recommend enough, buy this at any price. Good developers should be rewarded for their amazing work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genki did something long forgotten - they managed to release a game with no microtansactions, no season pass and so on, and in the same time it captures the old school vibe of the PS2 era TXR games. I can totally recommend this game for the old school fans of the franchise or for someone who wants to get into it, this game is the perfect starting point. I can say its definitely easier than the old ones but lets say its more of a QoL things easier. There are lots of cars (only japanese for now tho) and more than 200 rivals to challenge. The graphics and the vibe are great. The soundtrack is awesome for what it is, but they couldve added more songs. My only gripe with the game is the balance of some cars feels a bit off. Especially the tier of the GTR34 for example. It feels underpowered. A few other cars of that tier suffer from the same. Besides that, I find no weak points of the game. Again - totally recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite literally the best way to revive TXR\nTXR 2025 is 10x better than every previous game in the TXR Franchise every aspect, keeping all of the good details and improving upon them while also exploring new things and doing those new things absolute justice, great game all around, tons of fun to be had",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly Recommend if you use to play the old Tokyo Xtreme racer games of if you are new check this game out it has a brilliant soundtrack and the company breathing life into this game thanks Genki.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid arcade style racing game. Minimal fluff, but missions can feel repetitive at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic Japanese style racing game and made by the OG Genki co. no less. Great relaxing game to play and still has that nostalgic feel of the older games. Car selection is modest and could have more JDM classics but still has enough to give you something to play around with. Game progression and New Game+ are a nice touch and give you a challenge without making you feel like you arent leveling fast enough. In game story is done in a more traditional Japanese style and may seem pointless at first, but the conversations leave hints and clues to when or where other racers might spawn in, so it fills a need to read them.\n\n8/10 for the game and devs\n\nwould like to see in car cameras added eventually, would make using a racing wheel or rig more enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game feels like you're playing the old TXR ps2 games with modern-ish graphics (in the best way), down to the janky translations, which has its own charm. It isn't perfect (meh engine sound, weird car progression, rivals glued to the road) but it is the most i've been invested in a modern racing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun arcade racer with many unique cars and tuning opinions. Just be aware you are racing only on Tokyo highways so there are parts of racing without any corners but it can by fun too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A simple, fun arcade racing game that's very refreshing to play. The vibe is there, the selection of cars is fine, the sense of speed well done, and the Toyko highway is fun to race on. \n\nI only have one complaint. Progression in this game isn't great. You're going to be stuck with early beginner cars for quite some time. The majority of the cars are locked behind beating different acts of the story. In the beginning, this can be a bit time consuming. Once you unlock the cars/mods past the first act, the game's progression feels so much better and really opens up.\n\n If you like cars/racing, do yourself a favor and pick this up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great racing game that feels both like a ps2 game and a modern game at the same time. looking forward to future updates and/or another TXR game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "-Returned Game-\n\nThis game isn't terrible, its somewhat okay, just basic. Nothing wrong with it, but I can't recommend purchasing as it just feels like it is missing a lot of aspects to feel like a complete game at $50. If you can get it for 25 or lower, go for it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you were a fan of the older TXRs Im not to sure this one is going to tickle your fancy. Cars and car upgrades are locked behind grindy skill tree upgrades that make it feel like less of a racing game and more of a souless roll racer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too many crashes, as in the game crashes! and it looks so much fun, i refunded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's good fun, and I certainly enjoyed my time with it, but it's not a game without jank. There's quite a lot of unpolished content, and though it doesn't outright ruin the experience, this game is NOT worth $50.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is really boring after the first few hours. I tried to play through it to see if it would get better, but it doesn't. Got bored and tired of fighting the awful ai driving. They just target you and push you into traffic or walls when they clearly have room or you have right of way which means in some cases the only way to win is to do the same to them, not fun if I have to cheese to win. Audio is terrible. Every car sounds the same in the world like they all have the same engine. All the turbos sound the same. The music is like the same 3 songs over again. It just feels like a PS2 racing game, stuck in the old times. Graphics are good and the photo mode is pretty nice. Was very hopeful for this game but its a solid 5/10 for me, was neat for a while but there are much better racing games out there.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Looks great, until you realise that a bug exists that causes the car engine sounds to be completely missing if you've got too powerful headphones. If you google for the issue most just state \"Yeah I just started playing it on my TV instead\" as a fix... which isn't a fix at all, its a workaround.\n\nLooks like they tried to fix it a couple times but still seems to be an issue either way.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "generally speaking really good game aside one tremendous problem, driver ai, its so terrible it made me question my sanity countless times. Opponents swerve all over the road, crash into random traffic for no reason, crash INTO YOU feels like purpously.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "so my pc crashed and bricked my entire save file nice wasted 50h absolute garbage game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love getting pit maneuvered, dragged along the wall, and then losing to SP damage every race even when I've been in front the whole time\n\nEspecially when I can't do the same to my opponent because they don't get punished for contact with the wall\n\nRemember kids, passing is rude and disrespectful, the polite way to win a race is to kill the other driver with a 100+ mph wrecking ball",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "good remaster but they ruined it for no reason with random little changes that didn't need to be made\r\ni've literally enjoyed Nightrunners: Prologue more than this I don't understand this game should be good but somehow they screwed it up",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If it said absolutely anything else other than TXR in the title, everyone would say like mid at best for an indie team of like five persons.\r\nThis \"would not recommend\" is not necessarily for TXR, but rather for modern street racing games in general. How did we get to the point where in order to get all the praise from the playerbase, all you have to do is NOT include any modern BS and that's it?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played 24 hours and would not recommend it to someone, I think it is too special.\r\n\r\nIt is a clicking simulator with a bit of driving.\r\n\r\nPros:\r\nLooks good.\r\nGood Car selection which also features cars which you dont find in other games.\r\nI guess the tuning is good enough\r\n\r\nMid:\r\nProgress system is bit mid because you need to beat certain people to unlock, but you need to look for them for ages,\r\n\r\nCons:\r\nUseless talking with faceless NPC's which you cannot remember at all.\r\nAll those red dots where you spend more time clicking thorugh further useless dialogs.\r\nGrind for money and BP's...............\r\n\r\nWhy not recommened and stop playing?\r\nI get so annoyed by this useless talk and clicking around, it makes me furious. It is all so repetitive and I dont see any fun in it... you cannot drive in the parking lots, would have loved to drive around in daikoku like you see on youtube. There is no atmoshphere and everything is so disconnected.\r\n\r\n\r\nCheers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Refunding this. Wheel support is dogshit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NO DYNAMIC CAMERA ANGLES",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You need to fix this garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "anus",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you care about handling feel, I would recommend playing a different racing game. Almost any other racing game. Maybe one of the old TXR games - I love TXR Drift 2 - but not this one.\nI was willing to give the game a lot of leeway, given it was an Early Access release to improve on, but there hasn't been any notable improvement in the actual gameplay. New cars were added, and rivals are more balanced and dynamic, which is terrific!\nBut the driving model has not been improved, at all. The camera uncomfortably lurches with every input, uncoupled from the direction of the car, and even the car itself handles with a eerie delay. There is an inherent self-centering here that goes beyond understeer - it is extremely difficult to get your car to actually respond to any sort of left/right input. The game handles more like inputs apply forces to the car's body, which are then resisted by the suspension, rather than actually turning the wheels.\nThis all makes for a deeply unsettling experience if you're trying to do anything but pound down straights, and although I can play countless hours of Assetto Corsa or Richard Burns Rally in VR, here even playing on a monitor gives me a special kind of motion sickness. There's no amount of tuning that fixes these discomforts - I could only mitigate handling issues slightly - and there are no options to adjust steering sensitivity, lock the camera to the car, or almost anything else. There is also no cockpit view, which might have helped mitigate camera sway by giving a solid frame of reference.\nUltimately, if you just want to out-power opponents, admire 3D models of JDM classics, and play with customization and stickers - it's fine, but it feels worse to [i]play[/i] than almost anything else on the market. I'm not going to bother complaining about the lack of content variety - you either want to do nothing but run the highway loop, or you don't, that's all this game is - but even doing that never felt \"right.\"",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "As a fan of the original PS2 versions of the TXR series including Drift and Racer. I cant help but feel underwhelmed by the \"full release\" of this game. My major gripes are as follows, The AI rubberbands and has 0 awareness of the player, Meaning they will ram you off the road and try to pit maneuver you. The Story while semi interesting is present through loading screens with a shimmering bubble effect on the text that almost feels like it was made in Microsoft Powerpoint. While this was acceptable on the ps2 in the modern age it seems rather poorly presented. There is No Gauge customization, which was present in TXR III you can enable Oil and Cooling settings but there is no upgrades to manage this like previous TXR's. There is no Yaseu Route, Shibuya/Shinjuku Routes or Ikebukuro routes. No Nagoya, No Osaka, In turn it feels pretty samey in alot of areas as most of us have driven this exact route of the Tokyo Expressway in many games. The Music is Weak and repetitive but that was never a strong suit of this series. The car list. This is the most insulting part of the game, I don't know if they failed at achieving the rights to alot of cars but there are some Serious ommision's from this game, No FD Civic, No Evo 8/9, No Eclipse 99/02, No Mistsuibishi FTO, No Base model Skylines, No GM cars, No Ford, No Dodge, No Lotus, No Gemballa/Porsche these were all present in previous releases of TXR just to name a few. The Handling is pretty mediocre, Its floaty and feels unresponsive. The Sound effects are a huge step backwards from modern racing games, These cars unfortunately sound like vacuum cleaners and are relatively really quiet compared to the other SFX in this game. While I really wanted to love this game, I love that it exists and serious props to Genki for a return to form with this series, However these are my biggest complaints and I will happily change my review positive if some or all of these issues are addressed in future updates but as it stands I'm underwhelmed. I've waited so long, Unfortunately this still seems like its missing a bulk of what this game COULD be.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "I loved this game in its early access version but unless i'm missing something the game afterwards is just spamming nitrous against a very glitchy and advantaged AI. They can accelerate faster than you, bounce off walls without slowing down, and pull turns at impossible speeds. It takes all the fun out of the game when I literally have no chance without nitrous with a fully upgraded car.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I don't have the nostalgia factor, so I'm just gonna draw the conclusion from a fresh player perspective on this game as a stand alone piece, not as a 'successor to a classic franchise'\n\nFor the amount of car customisation and collection factor, it is pretty good. Maybe not the asking price level of good, but could be worth it on sale. \n\nFor a pure racing gaming perspective, not worth it at all. This is not a very good racing game. The driving feels distinctively 'model car on a slotted track'. Add to that, pretty much all rival cars cheat, and the rubber banding is pretty excessive. You can get the exact same car with the exact same stats as the car a boss is driving, and the boss car is just going to be plain faster than you are. A lot faster than you are. The way late game bosses zip around corners is basically physics defying. Luckily they are not actually all that good at driving, so they crash into traffic a lot. Overall there is simply not very much driving skill involved, you either win by having a faster car, or you win by the NPCs crashing spectacularly.\n\nTo be honest, if I had knew this game's driving is like this, I wouldn't have bought it full price. And if I knew the game's balancing and grind is this bad in early game, I would have requested for a refund. Unfortunately by the time the excessive rubber banding and bots cheating driving physics becomes obvious, you are likely well beyond 2 hours of play time.\n\nThe game is also overly grindy. One of my main enjoyment is to collect cars and modify them, plus the game have a lot of opponents that require you to have specific cars to race them, so you will have to buy a lot of different cars. The game only rewards you handsomely for the first time defeating an opponent. Once you are buying and tuning your third or forth car, or preparing a car specifically for a rival, the BP you get from those first wins is simply not enough, and you will have to start repeatedly battle rivals on the road to grind for it. Battling rivals you have already defeated gives very little BP rewards compared to the amount you would need to collect multiple cars, including the special boss cars. This grinding process is extremely boring and time consuming, due to the low reward and the lack of driving skills involved in this game.\n\nI would say this game is still worth a try just for the cars available, but wait for significant discounts.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "I did not play the earlier games so I do not have the benefit of nostalgia like others. I think it is okay. But every race is either easily won or an absolute nightmare that requires you to cheese. The few races that are competitive are good. \r\n\r\nAI opponents break the laws of physics. You are punished for things they are not. They can knock you around but not the other way around. They go through corners without losing speed while you cannot. They hit walls or npc cars and lose no speed nor the amount of health that you do for the same. Insane rubberbanding. \r\n\r\nGame looks good but there is a lot lacking. Every night feels the same. Same skybox, same npc cars all driving exactly the same. Not much in terms of atmosphere. The map is big but it feels like 95% takes place in the inner loop so what is the point. Livery editor is needlessly restrictive and hard to use. \r\n\r\nNot bad, but I would not buy it again, especially full price. 6/10.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "PC won't run the game with latest update, won't run at all, tried the updates and work around's. nothing worked, no mods installed etc. will be waiting for a fix.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "-Returned Game-\n\nThis game isn't terrible, its somewhat okay, just basic. Nothing wrong with it, but I can't recommend purchasing as it just feels like it is missing a lot of aspects to feel like a complete game at $50. If you can get it for 25 or lower, go for it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you were a fan of the older TXRs Im not to sure this one is going to tickle your fancy. Cars and car upgrades are locked behind grindy skill tree upgrades that make it feel like less of a racing game and more of a souless roll racer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too many crashes, as in the game crashes! and it looks so much fun, i refunded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's good fun, and I certainly enjoyed my time with it, but it's not a game without jank. There's quite a lot of unpolished content, and though it doesn't outright ruin the experience, this game is NOT worth $50.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is really boring after the first few hours. I tried to play through it to see if it would get better, but it doesn't. Got bored and tired of fighting the awful ai driving. They just target you and push you into traffic or walls when they clearly have room or you have right of way which means in some cases the only way to win is to do the same to them, not fun if I have to cheese to win. Audio is terrible. Every car sounds the same in the world like they all have the same engine. All the turbos sound the same. The music is like the same 3 songs over again. It just feels like a PS2 racing game, stuck in the old times. Graphics are good and the photo mode is pretty nice. Was very hopeful for this game but its a solid 5/10 for me, was neat for a while but there are much better racing games out there.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Looks great, until you realise that a bug exists that causes the car engine sounds to be completely missing if you've got too powerful headphones. If you google for the issue most just state \"Yeah I just started playing it on my TV instead\" as a fix... which isn't a fix at all, its a workaround.\n\nLooks like they tried to fix it a couple times but still seems to be an issue either way.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "generally speaking really good game aside one tremendous problem, driver ai, its so terrible it made me question my sanity countless times. Opponents swerve all over the road, crash into random traffic for no reason, crash INTO YOU feels like purpously.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "so my pc crashed and bricked my entire save file nice wasted 50h absolute garbage game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love getting pit maneuvered, dragged along the wall, and then losing to SP damage every race even when I've been in front the whole time\n\nEspecially when I can't do the same to my opponent because they don't get punished for contact with the wall\n\nRemember kids, passing is rude and disrespectful, the polite way to win a race is to kill the other driver with a 100+ mph wrecking ball",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "good remaster but they ruined it for no reason with random little changes that didn't need to be made\r\ni've literally enjoyed Nightrunners: Prologue more than this I don't understand this game should be good but somehow they screwed it up",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If it said absolutely anything else other than TXR in the title, everyone would say like mid at best for an indie team of like five persons.\r\nThis \"would not recommend\" is not necessarily for TXR, but rather for modern street racing games in general. How did we get to the point where in order to get all the praise from the playerbase, all you have to do is NOT include any modern BS and that's it?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played 24 hours and would not recommend it to someone, I think it is too special.\r\n\r\nIt is a clicking simulator with a bit of driving.\r\n\r\nPros:\r\nLooks good.\r\nGood Car selection which also features cars which you dont find in other games.\r\nI guess the tuning is good enough\r\n\r\nMid:\r\nProgress system is bit mid because you need to beat certain people to unlock, but you need to look for them for ages,\r\n\r\nCons:\r\nUseless talking with faceless NPC's which you cannot remember at all.\r\nAll those red dots where you spend more time clicking thorugh further useless dialogs.\r\nGrind for money and BP's...............\r\n\r\nWhy not recommened and stop playing?\r\nI get so annoyed by this useless talk and clicking around, it makes me furious. It is all so repetitive and I dont see any fun in it... you cannot drive in the parking lots, would have loved to drive around in daikoku like you see on youtube. There is no atmoshphere and everything is so disconnected.\r\n\r\n\r\nCheers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Refunding this. Wheel support is dogshit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NO DYNAMIC CAMERA ANGLES",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You need to fix this garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "anus",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you care about handling feel, I would recommend playing a different racing game. Almost any other racing game. Maybe one of the old TXR games - I love TXR Drift 2 - but not this one.\nI was willing to give the game a lot of leeway, given it was an Early Access release to improve on, but there hasn't been any notable improvement in the actual gameplay. New cars were added, and rivals are more balanced and dynamic, which is terrific!\nBut the driving model has not been improved, at all. The camera uncomfortably lurches with every input, uncoupled from the direction of the car, and even the car itself handles with a eerie delay. There is an inherent self-centering here that goes beyond understeer - it is extremely difficult to get your car to actually respond to any sort of left/right input. The game handles more like inputs apply forces to the car's body, which are then resisted by the suspension, rather than actually turning the wheels.\nThis all makes for a deeply unsettling experience if you're trying to do anything but pound down straights, and although I can play countless hours of Assetto Corsa or Richard Burns Rally in VR, here even playing on a monitor gives me a special kind of motion sickness. There's no amount of tuning that fixes these discomforts - I could only mitigate handling issues slightly - and there are no options to adjust steering sensitivity, lock the camera to the car, or almost anything else. There is also no cockpit view, which might have helped mitigate camera sway by giving a solid frame of reference.\nUltimately, if you just want to out-power opponents, admire 3D models of JDM classics, and play with customization and stickers - it's fine, but it feels worse to [i]play[/i] than almost anything else on the market. I'm not going to bother complaining about the lack of content variety - you either want to do nothing but run the highway loop, or you don't, that's all this game is - but even doing that never felt \"right.\"",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "As a fan of the original PS2 versions of the TXR series including Drift and Racer. I cant help but feel underwhelmed by the \"full release\" of this game. My major gripes are as follows, The AI rubberbands and has 0 awareness of the player, Meaning they will ram you off the road and try to pit maneuver you. The Story while semi interesting is present through loading screens with a shimmering bubble effect on the text that almost feels like it was made in Microsoft Powerpoint. While this was acceptable on the ps2 in the modern age it seems rather poorly presented. There is No Gauge customization, which was present in TXR III you can enable Oil and Cooling settings but there is no upgrades to manage this like previous TXR's. There is no Yaseu Route, Shibuya/Shinjuku Routes or Ikebukuro routes. No Nagoya, No Osaka, In turn it feels pretty samey in alot of areas as most of us have driven this exact route of the Tokyo Expressway in many games. The Music is Weak and repetitive but that was never a strong suit of this series. The car list. This is the most insulting part of the game, I don't know if they failed at achieving the rights to alot of cars but there are some Serious ommision's from this game, No FD Civic, No Evo 8/9, No Eclipse 99/02, No Mistsuibishi FTO, No Base model Skylines, No GM cars, No Ford, No Dodge, No Lotus, No Gemballa/Porsche these were all present in previous releases of TXR just to name a few. The Handling is pretty mediocre, Its floaty and feels unresponsive. The Sound effects are a huge step backwards from modern racing games, These cars unfortunately sound like vacuum cleaners and are relatively really quiet compared to the other SFX in this game. While I really wanted to love this game, I love that it exists and serious props to Genki for a return to form with this series, However these are my biggest complaints and I will happily change my review positive if some or all of these issues are addressed in future updates but as it stands I'm underwhelmed. I've waited so long, Unfortunately this still seems like its missing a bulk of what this game COULD be.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "I loved this game in its early access version but unless i'm missing something the game afterwards is just spamming nitrous against a very glitchy and advantaged AI. They can accelerate faster than you, bounce off walls without slowing down, and pull turns at impossible speeds. It takes all the fun out of the game when I literally have no chance without nitrous with a fully upgraded car.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I don't have the nostalgia factor, so I'm just gonna draw the conclusion from a fresh player perspective on this game as a stand alone piece, not as a 'successor to a classic franchise'\n\nFor the amount of car customisation and collection factor, it is pretty good. Maybe not the asking price level of good, but could be worth it on sale. \n\nFor a pure racing gaming perspective, not worth it at all. This is not a very good racing game. The driving feels distinctively 'model car on a slotted track'. Add to that, pretty much all rival cars cheat, and the rubber banding is pretty excessive. You can get the exact same car with the exact same stats as the car a boss is driving, and the boss car is just going to be plain faster than you are. A lot faster than you are. The way late game bosses zip around corners is basically physics defying. Luckily they are not actually all that good at driving, so they crash into traffic a lot. Overall there is simply not very much driving skill involved, you either win by having a faster car, or you win by the NPCs crashing spectacularly.\n\nTo be honest, if I had knew this game's driving is like this, I wouldn't have bought it full price. And if I knew the game's balancing and grind is this bad in early game, I would have requested for a refund. Unfortunately by the time the excessive rubber banding and bots cheating driving physics becomes obvious, you are likely well beyond 2 hours of play time.\n\nThe game is also overly grindy. One of my main enjoyment is to collect cars and modify them, plus the game have a lot of opponents that require you to have specific cars to race them, so you will have to buy a lot of different cars. The game only rewards you handsomely for the first time defeating an opponent. Once you are buying and tuning your third or forth car, or preparing a car specifically for a rival, the BP you get from those first wins is simply not enough, and you will have to start repeatedly battle rivals on the road to grind for it. Battling rivals you have already defeated gives very little BP rewards compared to the amount you would need to collect multiple cars, including the special boss cars. This grinding process is extremely boring and time consuming, due to the low reward and the lack of driving skills involved in this game.\n\nI would say this game is still worth a try just for the cars available, but wait for significant discounts.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "I did not play the earlier games so I do not have the benefit of nostalgia like others. I think it is okay. But every race is either easily won or an absolute nightmare that requires you to cheese. The few races that are competitive are good. \r\n\r\nAI opponents break the laws of physics. You are punished for things they are not. They can knock you around but not the other way around. They go through corners without losing speed while you cannot. They hit walls or npc cars and lose no speed nor the amount of health that you do for the same. Insane rubberbanding. \r\n\r\nGame looks good but there is a lot lacking. Every night feels the same. Same skybox, same npc cars all driving exactly the same. Not much in terms of atmosphere. The map is big but it feels like 95% takes place in the inner loop so what is the point. Livery editor is needlessly restrictive and hard to use. \r\n\r\nNot bad, but I would not buy it again, especially full price. 6/10.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "PC won't run the game with latest update, won't run at all, tried the updates and work around's. nothing worked, no mods installed etc. will be waiting for a fix.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "-Returned Game-\n\nThis game isn't terrible, its somewhat okay, just basic. Nothing wrong with it, but I can't recommend purchasing as it just feels like it is missing a lot of aspects to feel like a complete game at $50. If you can get it for 25 or lower, go for it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you were a fan of the older TXRs Im not to sure this one is going to tickle your fancy. Cars and car upgrades are locked behind grindy skill tree upgrades that make it feel like less of a racing game and more of a souless roll racer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too many crashes, as in the game crashes! and it looks so much fun, i refunded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's good fun, and I certainly enjoyed my time with it, but it's not a game without jank. There's quite a lot of unpolished content, and though it doesn't outright ruin the experience, this game is NOT worth $50.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is really boring after the first few hours. I tried to play through it to see if it would get better, but it doesn't. Got bored and tired of fighting the awful ai driving. They just target you and push you into traffic or walls when they clearly have room or you have right of way which means in some cases the only way to win is to do the same to them, not fun if I have to cheese to win. Audio is terrible. Every car sounds the same in the world like they all have the same engine. All the turbos sound the same. The music is like the same 3 songs over again. It just feels like a PS2 racing game, stuck in the old times. Graphics are good and the photo mode is pretty nice. Was very hopeful for this game but its a solid 5/10 for me, was neat for a while but there are much better racing games out there.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Looks great, until you realise that a bug exists that causes the car engine sounds to be completely missing if you've got too powerful headphones. If you google for the issue most just state \"Yeah I just started playing it on my TV instead\" as a fix... which isn't a fix at all, its a workaround.\n\nLooks like they tried to fix it a couple times but still seems to be an issue either way.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "generally speaking really good game aside one tremendous problem, driver ai, its so terrible it made me question my sanity countless times. Opponents swerve all over the road, crash into random traffic for no reason, crash INTO YOU feels like purpously.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "so my pc crashed and bricked my entire save file nice wasted 50h absolute garbage game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love getting pit maneuvered, dragged along the wall, and then losing to SP damage every race even when I've been in front the whole time\n\nEspecially when I can't do the same to my opponent because they don't get punished for contact with the wall\n\nRemember kids, passing is rude and disrespectful, the polite way to win a race is to kill the other driver with a 100+ mph wrecking ball",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "good remaster but they ruined it for no reason with random little changes that didn't need to be made\r\ni've literally enjoyed Nightrunners: Prologue more than this I don't understand this game should be good but somehow they screwed it up",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If it said absolutely anything else other than TXR in the title, everyone would say like mid at best for an indie team of like five persons.\r\nThis \"would not recommend\" is not necessarily for TXR, but rather for modern street racing games in general. How did we get to the point where in order to get all the praise from the playerbase, all you have to do is NOT include any modern BS and that's it?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played 24 hours and would not recommend it to someone, I think it is too special.\r\n\r\nIt is a clicking simulator with a bit of driving.\r\n\r\nPros:\r\nLooks good.\r\nGood Car selection which also features cars which you dont find in other games.\r\nI guess the tuning is good enough\r\n\r\nMid:\r\nProgress system is bit mid because you need to beat certain people to unlock, but you need to look for them for ages,\r\n\r\nCons:\r\nUseless talking with faceless NPC's which you cannot remember at all.\r\nAll those red dots where you spend more time clicking thorugh further useless dialogs.\r\nGrind for money and BP's...............\r\n\r\nWhy not recommened and stop playing?\r\nI get so annoyed by this useless talk and clicking around, it makes me furious. It is all so repetitive and I dont see any fun in it... you cannot drive in the parking lots, would have loved to drive around in daikoku like you see on youtube. There is no atmoshphere and everything is so disconnected.\r\n\r\n\r\nCheers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Refunding this. Wheel support is dogshit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NO DYNAMIC CAMERA ANGLES",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You need to fix this garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "anus",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}