{
  "positive": [
    {
      "review": "At the time of this review I have over 1400 hours in Soulmask and it has yet to feel like I've capped out.  I came to this game looking for an alternate to Conan and found I enjoyed the gameplay and graphics much more.  The developers have really put a lot of work into giving the community what they want.  Obtaining and using masks and building the perfect tribe is very rewarding and enjoyable.  Even without the seasonal events, updates, and expansions the world is massive and provides a great experience.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Its a great game, but its a fucking nightmare to run a server. Lets skip the fact that the server-side settings are in chinesse, it lacks many usefull tools for admins to speed things up such as \n- porting around the map\n- fast move with one key (short distance porting)\n- god mod (no i dont mean the milion HP thing, thats NOT enough)\n- building mod (why its not available for private servers escapes me completely)\n- spectator mod\n- linking private servers through portals\n- noclip feature\nThese are just few that comes to mind. I am still trying, but slightly losing nerves and interest.\nLets hope it gets better when out of Early Access",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "joining a friend is just a 100% nightmare experience. not due to the gameplay. code worked once and never ever did after. thanks to steam I could join.\nThat, and the announce that pops everytime you come back to main menu. really, a square on a corner would have done it. especially when you read it 10x trying to join a server that don't want to, for 0 error message reasons.\nedit: each time you fail to disconnect you come back to main menu + the notification window you have to close each time. please, just a refresh of server + favorite list (IP you can add). in fact the minecraft multiplayer menu is quite to take as a small + simple + intuitive + stays in the same menu & ping indicator way. I know, it's a long run to add that. I hope one day I'll start a mod or 2 but it's an unknown road from the start.\n\nbuuut when you go past that, the game is real good.\nenough realistic without being a chore, you can have NPC that you tame in order to get them working for you as a tribe member. they can leave if not enough happy and some will convince others more to leave (each human npc has different starts, some of them aren't tamable (especially in special areas, like, you go underground, & it's a good experience), but it's not that hard to make them stay actually. once you go past stone age, none will stay, your next fear is will they survive in a raid I lead\na tad too much idle game sometimes. ven if I cranked resource bonus to max & a few things like that.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I can truly recommend this game.\nIt's not your run of the mill survival game.\n\nYes, you start on an island with nothing and have to gather/fight for everything.\nBut I like the uniqueness of not being a character, you are the mask and you can control practically every character!\n\nIf you don't have a lot of time, don't go for this game, because it's rather addictive!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a great blend between a straight survival game, and a colony management sim. Having your tribe take care of the menial tasks of a normal survival games is nice, it is instead replaced by managing those tribesmen, and recruiting and replacing tribesmen for better ones more suited to specific tasks.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best game I have ever played for over 35 years of experience. From Skyrim to enshrouded this is the best game I have ever played. The only caveat is it does have more crashes than most games I have played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game is way under rated loved playing it and cant wait for shifting sands",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My brother and I spent 56hrs in the game. Then a bug wiped our entire progress. We tried the fixes. They didn't work....\nIt's a great game, clearly, given the hours we put into it. But ye be warned...perhaps one day, when you least expect it...everything will be gone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, like if a Conan player solved all the issue of Conan.\r\nBut unfortunatly there is not enough building variety, Conan had a lot of DLC with different building styles. This one doesn't.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the Aztec and Inca elements in the game, very good visuals and I adore how big the map is! Battle mechanics are fun and the building is quite nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't been playing long, I normally play on the PS5.  Movement could be made easier for those of us who are not used to playing with the buttons.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have put this game up for Labour of Love 2025 Steam awards .... I can remember the play test waaaay back when... I fell in love with it then and still loving it now.\n\nGreat gameplay, awsum graphics, fantastic ideas and a Dev team that listens and strives to improve.\n\nGreat work and Good luck!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, if you like survival games this one is a good one, good graphics, good taming system, building system, overall a good experience, only minus would say the keyboard mapping wich may require some tweaking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a bad, worth a try. Interesting take on the world when your the mask not the guy behind the mask. Nice learnig curve lots of things to do. End game is decent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game to explore the rainforest with an underutilized theme! Gotta say though, the game is scary af solo, firt time I met a crock it blended with the bushes by the time I noticed it he launched itselft at me leaving me near death. I panicked and started running for my life, as it gets pitch black I come across what I thought was a tree trunk on ground until the red eyes popped up, NOPE--fucking anaconda man, constricted my ass up and killed me.  It was fucking HUGE!!  fml  T-T",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The novel way of survival in this game makes it very unique. After you grow your tribe of survivors, everything feels so much more open and powerful. You do scale up in all survival games, but seeing the whole thing play out more exponentially feels nice. it makes the game easier to pick up for person like me who tries to avoid survival games mostly or goes for very easy difficulty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A crafting survival game which gave player a npc to select base on their stat , assign them to role , give all the feeling of playing with group of people like good ol` days. good to to hang around with friend, family, other player around world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really don't have too many complaints about this game.  It's actually really good and engaging.  The survival aspects are good but not over the top.  The grindiness is pretty high but not more than most survival games.  Storyline is a bit weak but still good.  It purposely leaves a lot vague so that players can come up with their own ideas.  It's worth the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has some amazing building, base management, and tribe management features that will absolutely blow your mind!  What are you waiting for? Grab some friends and jump in! make sure you don't forget to feed your Alpacas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100% recommendation for survival lovers, which likes to dive deep into game mechanics.\n\nIt might not be THE best Survival Game ever, but for sure THE MOST UNDERRATED one!\n\nThis Game is both, casual comfortable on it's exploration side, very detailed in it's crafting, farming and automation-part and very exciting by the randomness of abilities, which your tribemember can get. \nAnd once you start exploring Dungeons and higher tier Bosses, your butt will get ripped off, if you don't prepare right and tryhard by the blood of your teeth :D\n\nI play this game since Beta and the Devs do an awesome job at implementing community feedback and improving the game with nice new FREE Content-DLC's!\n\nReally look forward to the 1.0 release and upcoming first paid DLC with the new Map, can't wait for it <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great chill game, the tribesmen take out  alot of the normal \"grinding\" expected in survival games. The only thing is i wish the controls were more controller friendly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are into games like Icarus, enshrouded, valheim, palworld, or any base building / crafting / survival / adventure type games, give this a shot. Big map, lots to explore and do. Good dev engagement and regular patches / updates as of 2026",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only played 17hrs but i love how immersive it is. Reminds me alot of Conan Exiles which i have over 5k hrs in!! great job so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is pretty fun very in-depth system and mechanics i like the capturing and progression off the game and dungeons are fun and engaging my only thing is that I wish i can redo my character's apperance but over all it's pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good, weird to get into, the UI has to be reworked. \n\nOh and if you are going to get inspiration from the Incas and Mayans, where is the macuahuitl weapon ? Its like...iconic.\n\nOh and add some mini-games to have fun with your tribe, like the life or death volleyball game with a solid ball played with forearms and such, that'd be dope",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game with some really cool features. worth the money and still has updates and dlcs coming out. 80 hours in and not even half way done!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solo PvE player here. What I love about this game is that it has sliders for most settings. I love being able to make the real grindy parts less grindy, while making combat decently challenging. Without looking anything up, there seems to be a tutorial/codex within the game if you need it. Nice graphics. Only thing i don't like so far are the parrots that wont shush.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Though the tribal details for weapons falls to the wayside after stone tools and such, it's still a style I'm fond of. Making some fat ass chief, calling him papu papu, then building an empire based off pillaging and raiding while using the inbuilt wall hacks to see what innocent villager would make a fine kidnapping target, my only wish is that my would-be labourers would stop tossing jars of feces at my head before I'm able to \"recruit\" them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game so fun highly recommend. fun building, clan game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For the love of god please do something with the UI.  Like a text resize would be nice. Going blind trying to  read the quest line and everything else. Granted i am using a big screen tv as my monitor with my pc hooked up to it. That being said I know I am not alone on this one as i have read many posts with people having the same issue. Please address this",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best Survival out there by much. Pve and Pvp....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is wonderful... can't what for the Egypt DLC. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like games such as Ark, Rust, Valheim, etc.. you'll love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hello i recommend the game it's a good game but there not alot of animal to tame and mount they dont defend and you cant even use weapon on it i wish there were more mount animal and defend you to i preferred to breaded by my self then havin it in cage the bufalo can be a good mount and defend plus why havin a teleport when you cant teleport nothing this game need alot of work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with a lot of content. It is a very in depth game. The crafting and tribe management systems are very well done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is just beautiful. The sunrises, sunsets, scenery is just amazing and keep drawing me back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "another great game I am addicted to now that have caused me to stop playing all other games currently.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is oddly unpopular for what it offers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Give it a try its very involved and a good challenge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a wonderful fantasy game i enjoy it all the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything you wish Conan Exiles had, this game has.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "like the game needs some work with the pad but its a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game better than ARK and conna alot more harder",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best all round game..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing hidden gem",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "simillar to Conan Exiles. but more better. ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly one of the best survival PVP games i've tried.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome s",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Slavery Simulator 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just Great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game - not a great game.\r\n\r\nThe survival foundations, automation, combat are all good. The first 40 hours are a good loop where you grow your character through combat, exploration and building. The combat is made fun by good animations and weapon variety, and there's a nice sense of progression as your power in combat increases as you unlock new things.\r\n\r\nThen it flatlines. Increases in combat difficulty come from bloating health bars. No new mechanics, and copy pasted and reskinned enemies.\r\n\r\nYour base automation doesn't grow in complexity, it just adds higher tiers of the same simple recipes. The payoff is slightly higher stats to offset the 'bullet sponge' enemies. The depth of crafting is nonexistant, your pallet to build more interesting things doesn't increase. It's just reskinned,\r\n\r\nAs a sidenote, the game is aweful with default configuration. Progression is too slow and you have to grind things that are not interesting enough to engage with. One of the most egregious is repeated dungeons with identical monsters that can only take 'blunt' damage and prevent all combo moves. So you find yourself clicking basic attack for 10 minutes with occasional dodge to down the enemies. That's the game at it's worst, and it's aweful.\r\n\r\nIt's worth the money, I had a good 40 hours and another 'maybe it get's better?' 25. But near mid to end game, even after adjusting 30-40 of the settings, becomes not fun. Buy it, but don't expect to finish it. The end game is reskinned and makes the issues in the first half more glaring.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "5 stars. I went from 7 Days to Die, Enshrouded, Aska, Vahalla, and a few others to hear. This is a 'best of' those games so far, with a nice twist to make it own thing. \r\n\r\nExamples of what it (for me) corrects from the other listed games.\r\n~ Fixes issues with storage management day 1 - not after you grind to a certain level. \r\n~ You can pick and chose the parts you enjoy playing and if you don't like parts...get your tribe members to do it instead. \r\n\r\nYes, I could nit pick at one or two things but nothing that impacts my enjoyment of the game.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Its ok, its not bad but you could say this is sort of a mix of mechanics related to Conan, Ark Survival and other things.\n\nIt combines creating minions with survival, much like Conan, except in this game you can directly control your minions with a mask, that isn't so bad and its unique in that aspect. You'll also notice the controls are similar to Conan and Ark, building is done by piecing walls and floors together.\n\nYour 'thralls' or minions are pretty useful. While not perfect their pathfinding and ability to navigate is what separates this from Conan. So if you liked a more fun and unique take on Conan Exiles, sounds good so far right?\n\nWell there is a few problems here.\n\nSoulmask suffers from various problems like late game progression. Logistics between bases can be quite annoying to setup also. Your minions aren't truly autonomous and can be quite stupid, where one might find themselves repeatedly attacked by bandits and just stand there. \n\nAnd much like Conan, don't expect much from the three npc factions. It would have been nice to see interactions with the player like \"The Forest\", but the three factions are pretty much more than eager to sit in their camps and wait for you to slaughter them. They make no moves to conquer or do anything interesting for endgame purposes besides little events like raiding and convoys.\n\nHowever besides the negative and positive, it is a good game in its own right. Perfectly playable right now. Even if its in Early access, it feels a bit complete, repetitive after a while but still complete. I wouldn't say online multiplayer is great though, but if you single player a lot in Conan, its not bad.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Think Conan with far better integrated organisation. Great survival aspects and the tribal touch and discoveries just add to the game meaning it feels like there is purpose and not just a build, craft and grind kinda game. The fact it is in beta means I very much look forward to what it will be like when completed.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "At the time of this review I have over 1400 hours in Soulmask and it has yet to feel like I've capped out.  I came to this game looking for an alternate to Conan and found I enjoyed the gameplay and graphics much more.  The developers have really put a lot of work into giving the community what they want.  Obtaining and using masks and building the perfect tribe is very rewarding and enjoyable.  Even without the seasonal events, updates, and expansions the world is massive and provides a great experience.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "https://critical1mess.com/2025/03/29/soulmask-video-game-pc/\n\nAfter spending a good chunk of time with Soulmask, I can confidently say this game is a fantastic addition to the survival genre. If you’ve ever wanted a game that feels like a blend of Conan Exiles, Valheim, Green Hell, Necesse, and Palworld, then Soulmask is exactly what you’re looking for and then some.\n\nAt first glance, Soulmask looks like your typical survival game: gather resources, craft weapons, build a base, and fend off enemies. But what sets it apart is the mask system. A mysterious power that lets you take control of other characters, expanding your options for managing a tribe, commanding workers, and fighting smarter. It adds a unique layer of strategy and progression that makes you feel like more than just another scavenger in the wild.\n\nThe setting is absolutely gorgeous, but don’t let that fool you it’s also merciless. Everything from wild animals to barbarians to your own poor planning can wipe you out. The game strikes a fine balance between difficult and rewarding, forcing you to adapt, plan, and learn from your mistakes rather than brute force your way through.\n\nThe ability to recruit and manage NPCs is both a blessing and a curse. On one hand, it’s amazing to delegate tasks like gathering, farming, and defending your base. On the other, NPCs can sometimes feel like adorable yet infuriating toddlers, forgetting how to do basic tasks or standing around while a jaguar mauls them. It’s a work in progress, but when it works, it makes the game feel like a living, breathing society.\n\nThe combat is fast, brutal, and satisfying. It has a mix of melee, ranged, and tactical options that encourage smart fighting rather than button mashing. Blocking, parrying, stunning, sneak attacking, executing, and dodge rolling to name a few all help flesh the system out quite a bit.\n\nExploring the world is equally engaging, with hidden ruins, dangerous territories, and the constant thrill of discovery. The game rewards risk takers, and every adventure feels like it could be your last… because sometimes, it is…\n\nSoulmask is an addictive, immersive, and incredibly fun survival experience. It takes the best elements of other survival games, mixes them into something fresh, and delivers a world that constantly challenges you. While there are some rough edges, the foundation here is solid, and if the developers keep improving it, this could become one of the best survival games in years.\n\nIf you love difficult but rewarding survival games, building and managing your own tribe, and occasionally turning poop into bombs (yes, really), Soulmask is absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "joining a friend is just a 100% nightmare experience. not due to the gameplay. code worked once and never ever did after. thanks to steam I could join.\nThat, and the announce that pops everytime you come back to main menu. really, a square on a corner would have done it. especially when you read it 10x trying to join a server that don't want to, for 0 error message reasons.\nedit: each time you fail to disconnect you come back to main menu + the notification window you have to close each time. please, just a refresh of server + favorite list (IP you can add). in fact the minecraft multiplayer menu is quite to take as a small + simple + intuitive + stays in the same menu & ping indicator way. I know, it's a long run to add that. I hope one day I'll start a mod or 2 but it's an unknown road from the start.\n\nbuuut when you go past that, the game is real good.\nenough realistic without being a chore, you can have NPC that you tame in order to get them working for you as a tribe member. they can leave if not enough happy and some will convince others more to leave (each human npc has different starts, some of them aren't tamable (especially in special areas, like, you go underground, & it's a good experience), but it's not that hard to make them stay actually. once you go past stone age, none will stay, your next fear is will they survive in a raid I lead\na tad too much idle game sometimes. ven if I cranked resource bonus to max & a few things like that.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Its a great game, but its a fucking nightmare to run a server. Lets skip the fact that the server-side settings are in chinesse, it lacks many usefull tools for admins to speed things up such as \n- porting around the map\n- fast move with one key (short distance porting)\n- god mod (no i dont mean the milion HP thing, thats NOT enough)\n- building mod (why its not available for private servers escapes me completely)\n- spectator mod\n- linking private servers through portals\n- noclip feature\nThese are just few that comes to mind. I am still trying, but slightly losing nerves and interest.\nLets hope it gets better when out of Early Access",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The mask is both a literal artifact and a symbolic identity. It grants powers, defines your playstyle, and ties you to the mysterious ancient civilization that once ruled the world.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Beautiful Scenery, game play is awesome. I enjoy this and would recommend if you like survival and building.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Pretty solid! Functionally, it's a take on Conan Exiles but like, better. Also interesting to see a Chinese studio's take on survival crafting- like it's still obviously very Conan Exiles inspired, but the texture's, different? In a good way? Anyways it's good! Plays great solo, the NPC tribe members are genuinely cool to recruit and set up to run things in your town.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is a true diamond in the middle of all the early access games glad i brought it! It only keeps giving!!!\nCan't wait for the egyptian dlc!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "hardly recommend it, it very well made game with nice systems for leveling, crafting, survival ect...\r\ni played before it was release in the playtests and im still happy with the game. lots of improvement  has been done, and looking forward for the new DLC.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I can truly recommend this game.\nIt's not your run of the mill survival game.\n\nYes, you start on an island with nothing and have to gather/fight for everything.\nBut I like the uniqueness of not being a character, you are the mask and you can control practically every character!\n\nIf you don't have a lot of time, don't go for this game, because it's rather addictive!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a great blend between a straight survival game, and a colony management sim. Having your tribe take care of the menial tasks of a normal survival games is nice, it is instead replaced by managing those tribesmen, and recruiting and replacing tribesmen for better ones more suited to specific tasks.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best game I have ever played for over 35 years of experience. From Skyrim to enshrouded this is the best game I have ever played. The only caveat is it does have more crashes than most games I have played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun one of the most automated survival games out there its not bad solo or co op its combat system is better than most survival games the DLC release coming up with Egypt will be epic but the Mayan/Inca like style right now is pretty fun in itself. Id say besides crafting/Technology/Exploring/NPC Raids/ Ruins/Dungeons/ Taming mounts and tribesmen all this is really fun but I sense there is a need for more challenging end Goals like larger tribal Barracks/settlements maybe caves full of traps like tomb raider or something more spiritual battle against the ancient Gods of this Culture will see but as it is I could see a brighter end game in the making!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Its a mixture between Ark, Conan and more.\r\nThe way you progress through the game is very well thought off. The difficulty is there for sure. It's not a walk in the park but that's what makes it so good.\r\nThe map is massive and everytime you need to unlock a part defeating a Scout.\r\nLearn how to dodge, play smart and you get there.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The most underestimated survival game on the market. It has everything and more.\nI joined a PVP server (with raid off) on EU and the experience is amazing so far. In low level areas, players don't attack you on sight, everyone is busy leveling up and building bases. Higher level players who can one shot you just ignore you and don't grief. Most of the PvP action is in higher level zones, so you have plenty of opportunity to level up in peace. Highly recommend for other players who are anxious about PvP to try it out!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Liking this game a lot, fixes a few gripes I usually have about survival games, like gate keeping inventory slots or weight management - not a problem with this game. I'm only 91 hours in but feel like there is a good pace to things, enjoyable difficulty level, and still tons of content left for me. \r\n\r\nInventory - Seems like most games make this such an annoying task, limit your carry items or weight and don't make smart storage available early. Right away you can make boxes for specific categories of items and hotkey transfer, this feature makes my day!! I don't want to waste all my gaming time sorting junk. Thank you!\r\n\r\nMounts - Right amount of access to good fast mounts (seems like other survival games try to drag everything out and keep you snail slow, I like that you can get a Jaguar relatively early with some patience.\r\n\r\nBuilding - Pretty standard building mechanics, glad they have triangle sets too. \r\n\r\nPortals - I was happy with the fast mounts, it's just icing on the cake that there are portals all over the map to use too.\r\n\r\nTribesmen - Recruiting NPC's and having them do all the busy work is so fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Combines an open-world feel with the coziness of farming sims and genuinely challenging combat.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Was für ein Spiel..\nUnglaublich geil!!\nBin knapp 40 Stunden drin und hab vllt 40% vom Spiel. Wahrscheinlich weniger. Es ist soooooo unglaublich vielfältig. Allein was man alles craften kann und bauen, sowas siehste in keinem anderen Game. Respekt an die Devs für ein Meisterwerk. \n\n10/10!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game, if you like survival games this one is a good one, good graphics, good taming system, building system, overall a good experience, only minus would say the keyboard mapping wich may require some tweaking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a bad, worth a try. Interesting take on the world when your the mask not the guy behind the mask. Nice learnig curve lots of things to do. End game is decent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game to explore the rainforest with an underutilized theme! Gotta say though, the game is scary af solo, firt time I met a crock it blended with the bushes by the time I noticed it he launched itselft at me leaving me near death. I panicked and started running for my life, as it gets pitch black I come across what I thought was a tree trunk on ground until the red eyes popped up, NOPE--fucking anaconda man, constricted my ass up and killed me.  It was fucking HUGE!!  fml  T-T",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The novel way of survival in this game makes it very unique. After you grow your tribe of survivors, everything feels so much more open and powerful. You do scale up in all survival games, but seeing the whole thing play out more exponentially feels nice. it makes the game easier to pick up for person like me who tries to avoid survival games mostly or goes for very easy difficulty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A crafting survival game which gave player a npc to select base on their stat , assign them to role , give all the feeling of playing with group of people like good ol` days. good to to hang around with friend, family, other player around world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really don't have too many complaints about this game.  It's actually really good and engaging.  The survival aspects are good but not over the top.  The grindiness is pretty high but not more than most survival games.  Storyline is a bit weak but still good.  It purposely leaves a lot vague so that players can come up with their own ideas.  It's worth the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has some amazing building, base management, and tribe management features that will absolutely blow your mind!  What are you waiting for? Grab some friends and jump in! make sure you don't forget to feed your Alpacas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100% recommendation for survival lovers, which likes to dive deep into game mechanics.\n\nIt might not be THE best Survival Game ever, but for sure THE MOST UNDERRATED one!\n\nThis Game is both, casual comfortable on it's exploration side, very detailed in it's crafting, farming and automation-part and very exciting by the randomness of abilities, which your tribemember can get. \nAnd once you start exploring Dungeons and higher tier Bosses, your butt will get ripped off, if you don't prepare right and tryhard by the blood of your teeth :D\n\nI play this game since Beta and the Devs do an awesome job at implementing community feedback and improving the game with nice new FREE Content-DLC's!\n\nReally look forward to the 1.0 release and upcoming first paid DLC with the new Map, can't wait for it <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great chill game, the tribesmen take out  alot of the normal \"grinding\" expected in survival games. The only thing is i wish the controls were more controller friendly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are into games like Icarus, enshrouded, valheim, palworld, or any base building / crafting / survival / adventure type games, give this a shot. Big map, lots to explore and do. Good dev engagement and regular patches / updates as of 2026",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only played 17hrs but i love how immersive it is. Reminds me alot of Conan Exiles which i have over 5k hrs in!! great job so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is pretty fun very in-depth system and mechanics i like the capturing and progression off the game and dungeons are fun and engaging my only thing is that I wish i can redo my character's apperance but over all it's pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good, weird to get into, the UI has to be reworked. \n\nOh and if you are going to get inspiration from the Incas and Mayans, where is the macuahuitl weapon ? Its like...iconic.\n\nOh and add some mini-games to have fun with your tribe, like the life or death volleyball game with a solid ball played with forearms and such, that'd be dope",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game with some really cool features. worth the money and still has updates and dlcs coming out. 80 hours in and not even half way done!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has become sutable for just about every survival playstyle i know and has great unit management for those who like to fight wars across the maps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is a hidden gem for any survival lover.\r\nYou can easily spend over 100 hours playing it solo, but if you have friends, it becomes a whole different experience—especially on a PvP server.\r\nIt’s very unique, and the Amazon/tribal theme makes it feel incredibly real.\r\n\r\nIt can be a little overwhelming at first because of the many materials, builds, and mechanics, but that’s true for most sandbox survival games.\r\nThe graphics are impressive and look very realistic.\r\n\r\nOverall, it’s worth every penny—and it’s a pity that more people don’t know about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loving this game really enjoying all the base mechanics and collecting tribesmen and the adventuring . very much worth a play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Conan Exiles clone with some original aspects of its own. It supports mods already (very few atm) and I think it's a long therm investment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love how in-depth the content of this game is, and the excitement around the 1.0 release, which seems to be packed with awesome new content! It's very grindy, and lots to learn, but that's what I like, and you can switch your skills up at any time by multiple means, so you aren't stuck being good at JUST bow or JUST cooking etc. I play on the Official PVE North America 2056 server, come say hi especially if you're a friend! I seriously learn new things about this game every day, and it's not something that can be rushed thru, it takes a bit of commitment, just a heads-up!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy this game thoroughly. I eagerly await continued development beyond early access as this game has fantastic potential to be a gem as a open-world survival game beyond what it is now. Developers continue to refine the game and provide frequent updates which is very reassuring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Visually stunning, fun game play, looking forward to more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommended for survival crafting fans and MMO fans alike. The build mechanic is solid, allowing for great amounts of customisation. The tribe building and automation is great. The game is a little grindy at times, but never to such a degree that its not engaging. \r\n\r\nThe only flaw I can see is with the portal system. If you are not knowledgeable enough when you start to choose a base location near a map portal, there is a lot of running around to do with very few means of transport. This means multiple base builds, no easy way to move bases from place to place, and a lot of backtracking. If the custom portals were able to be connected to the ones on the map, it would make for a more rewarding dungeon delving experience as there would be more value to finding the right relics. \r\n\r\nJust food for thought",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Fun game but announcing DLC before adding a button to rotate building pieces is a clown move.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "they decayed 100s of hours away simply because i didnt log in for 5 days - theres nothing that says buildings will decay automatically after 5 days even with tribesman set to bonfires.  so if you have a job or a life outside game note that they will delete everything from you to include 100s of hrs of gameplay over a 5 day decay timer.  if you have a life dont buy this game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Is early access game\nMakes DLC trailers\n\nSo is the game out or not?\n\nProbably another cash grab game. Avoid, it's not fun.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "it's not bad actually but becomes boring soon enough due to repetitive activities and very slow development. It could be better if it has a kind of main story line and some side quests.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cons: Combat is boring and repetitive, world feels empty, Very grindy, tribesman AI is janky.\r\n\r\nPros: AI control mechanic is cool, pretty detailed options for Player owned AI",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "In its current state, the game is just… meh. It has potential, but right now it didn’t really pull me in. I was hoping for something along the lines of Conan, but unfortunately it’s not that.\n\nThe beginning is extremely boring. I know it’s a survival game and it’s still in early access, but starting out with no real goal besides a flood of tutorials and information—even the UI is overwhelming at first—can easily push players away. There’s no real introduction to the story (if there even is one). And that opening cutscene? For me, it explains absolutely nothing. I get that it’s a survival game, but many survival games still have some kind of story setup, world introduction, or at least an explanation of who you are and why you're even here.\n\nThe crafting menu also isn’t great. I appreciate the attempt to divide knowledge into “sections,” but it doesn’t help much when you’re still being flooded with a massive list of items. It would be much better if everything was separated into clearly defined windows/categories.\n\nThe animations are so stiff it’s honestly painful to look at. The transitions between them… ugh. Just try chopping a tree and moving your mouse—the character suddenly “teleports” into a new position. Or if your character dies underwater, they start crawling. Crawling! Underwater. The same goes for facial expressions: there basically aren’t any, and characters look like empty dolls.\n\nCombat is also pretty mediocre. The animations aren’t great (same issue as above), and enemies feel super stiff too—they mostly just stare at you, waiting for you to make a move, and sometimes they hit you… maybe. In most games, combat feels enjoyable to me, but here it really doesn’t.\n\nI even jumped into the water expecting some sharks or something interesting, but nope—just empty space where you can swim and swim and swim and… swim.\n\nAs for graphics, they’re nice and pleasant to look at. I enjoyed running around the map, but that leads to another issue: the map is big, but mostly empty, aside from a few animals. (Maybe that’s because I didn’t explore much beyond the starting zone, but honestly the game didn’t motivate me to go further.) Most of my time was spent running around aimlessly.\n\nNow, the character creator… look, I know it’s early access, but considering how extremely limited it is, it’s hard to say anything positive. But hey, they added jiggle physics for breasts… Great right... I guess. Personally, in actual state I’d prefer just two preset characters—one male and one female—but actually well polished. Maybe the character creator will improve later and give us more options.\n\nThere’s also no first-person mode. If I can’t make my character look the way I want, then I’d rather not stare at her and would prefer a first-person view instead.\n\nThe building mode is a so much pain. There’s absolutely no button to lower or raise foundations — you have to dance around to position things properly and wiggle the camera. When i love building in almost every game, that here. No way!\n\nSo overall, the game didn’t grab my attention or hook me enough with its beginning for me to want to come back to it. Maybe I’ll give it another try someday when I run out of other games to play, but for now… it’s just boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After hundreds of hours playing Conan: Exiles, I decided to give this a shot. I wanted something new as Funcom is focusing on DUNE and Conan seasons rather than making a new map or large DLC. This ain't it chief. Conan is still a much better experience than this is. This game has a lot of bugs to work out, and a needlessly complex and expansive system for their menus. There are also some translation issues but I can easily look past that part. Combat is clunky and repetitive. I didn't even get into the building side of things because I was just so turned off from everything else in the beginning. This game has potential, but potential doesn't fix the issues.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Controller support is terrible. \nText size is unreadable. \nI'm hopeful future updates will improve the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "regretta buying it. thought i would and can confirm regret\r\n\r\nreally obvious when a game is in EA and they're announcing DLC that it wasn't gonna be worth it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "they talk about mounts but none exist... the map is way too big to move on foot... the enemies are stupid over power, zero freaking balance...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is just such a grind. I'm 24 hours in and I feel like I haven't really played the game. The crafting takes forever, I often forget I'm playing while I Alt Tab out to grocery shop. Riding into trees constantly in thick brush sucks. It's hard to tell what's going on with the map and you spend all your time running around mountains.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "หนีไป....เป็นเกมที่โคตรพ่อโคตรแม่ดึงเวลาชีวิต ทุกอย่างแม่งขั้นตอนสุดๆต้องรอแม่งทุกอย่าง สงสัยโคตรมันเป็นข้าราชการไทยมั้ง...ฟวย",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Released as Early Access to trick people into being more eager to give it a chance, when in fact developers were working for majority of time on DLC. Whole 2025 was 1 content update in summer and 3-5 bugfixes each week, for entire year. The whole game \"development\". But hey! There's huge announcement for 1.0 release - a DLC.\n\nSo far we still don't know if DLC is paid or free for Early Access buyers. If it's paid, I'd call it a scam and look for refund by Steam.\n\nQuote from store page about Soulmask Early Access:\n\"We are working tirelessly around the clock to accelerate development and complete any interesting modifications that we and the players have mentioned to make Soulmask more attractive.\" This is straight lie, what tirelessly they were working on is 1.0 DLC. I can imagine DLC has many features players asked for in Early Access feedback.\n\nSeems like CampFire Studio or Qooland Games decided to sell this game as Early Access without fully understanding what Early Access supposed to look like OR with full knowledge how it should look like - they decided to just lie about it and trick people into buying Early Access game when they were fully aware, the content they work on is not Early Access content, but DLC. \n\n\nAbout the game:\nUnique background of amazonian jungle with interesting feature about AI tribesman you capture to order them doing certain tasks so you have a semi-living-village-like experience. Beside that rather unimaginative classic open-world sandbox, grind resources, build structures, upgrade gear, repair gear, the end. There's not much to build, but models are well designed and fit together perfectly, so even simple constructions look good. When I bought the game I had an impression THIS is solid foundation developers will further build on - now knowing there is no further developement - as a whole game, it lacks much. Interesting surface, not much deepness.\n\nThere are many ways you can tweak and balance gameplay by \"server settings\", so that's a welcome feature, especially for solo players.\n\nOverall Soulmask is fine example of a game that goes through the checklist of what supposed to be in a game from this genre, checks most marks as \"it's there\" and that's it. There is a lot of bland content that will keep you busy for hours. For me AI tribesmen is only feature that makes this game interesting, but when everything else is meh, playing Soulmask felt like forcing myself to do meh things in order to enjoy one particular feature for a while.\n\nIf you want one perfect example of Soulmask bland content, the Jaguar probably is. Jaguar is dangerous predator that can easily kill you in early game, for some time you literally watching your backs travelling around and try to learn where in the jungle they hunt so you can avoid surprise attack. Sounds cool right? Later you learn the how to capture one, so obviously you want one right? It's not only not easy in terms of game mechanics you need to learn, but also risky. So you finally captured Jaguar one day. A dangerous predator on your side? Nope. A \"horse\". Jaguar once tamed is only a mount. Soulmask is filled with such put-hours-of-gameplay for a meh reward content. \n\nThere is a lot of content in Soulmask, but the more content you come across, the more discouraged you are to push further due to way the content is implemented. Like I said, it's checklist content, implemented sometimes in most unimaginative, lazy way just to be there instead of have any meaningful impact on a gameplay. \nWhat would be acceptable for an Early Access game knowing the meh stuff might turn into good stuff when developers expand on it after players feedback. But we already know it won't happen in case of Soulmask so lazy, unimaginative content is all you get. But hey, there's a lot of it, so I guess for some it makes it okay-ish?\n\nDLC seems promising tho, so you know. There's a hope.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "ถึง..คนส้ราง \nรู้จักมั้ย คอนโทรลเลอร์อ่ะ จอยสติ๊กอ่ะ!!! \nขั้นตอนเยอะ รอนาน เยอะสิ่งไปหมด \nนึกว่าเล่นแล้วจะหายเครียด ที่ไหนได้ เครียดกว่าเดิมอีก\nก็อป Conan มาทั้งดุ้น แต่เสียเวลาและขั้นตอนเยอะกว่า\nสั้นๆ ไม่แนะนำ",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lots of systems, lush world, looking good.  Oh wait, it's slavery, in a central american theme of all places.  Big no for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very bad to play the game with controller.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game ruined by chinese cheaters everywhere",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Solo Experience is quite dull in terms of exploration and discovery compared to other survival crafting games available, they definitely need to work on that.\n\nCrafting system is what you would expect. Nothing Feels rewarding though, just grind and wait, automation system with tribesman works well but there's not a lot to it.\n\n I'm hoping they develop this game and add more interesting POI's , features events or structures and wildlife.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I agree with the negative reviews.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bush dogs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It feels like this game has a good foundation, but unfortunately that's kind of it. They keep adding more things, which is nice, but it's very clear that's all they want to do, and not refine what they have.\n\nThe combat is mediocre at best, I'd describe it as functional. It looks way more fun than it is. The crafting system could be really cool, because you can have your tribe craft for you, but the menus and systems are overly complex and not intuitive. It seems like even though I have my tribe always working on something, nothing is getting accomplished.\n\nI hate the respawn system, every mob, human and animal, spawn in the exact same spot in barely no time at all, making for a disconnected experience. It dispels any illusion of immersion that could be had since it no longer feels like a real world anymore, but an NPC spawner, making the areas feel cramped and stifling because you can never truly clear an area. It feels amateur, and one of those things that, if they haven't done anything with it in a year and half, it ain't changing now.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "If you're looking for an MMO/Co-op experience similar to Conan, Ark, or Rust, this will probably deliver everything you're hoping for. My review is only based on the solo experience.\n\nEven though it is designed similarly to the aforementioned MMO/co-op games, Soulmask boasts having theoretically hyper-capable AI followers that can practically run your base for you without ever having to lift a finger yourself. While it's true that they *can* do just about any task players can do, they're not incredibly intelligent about it. You'll constantly have to reset or modify their orders to avoid having them do nothing but rest around your campfire, which kind of defeats the purpose of having them do the work for you.\n\nAnd don't even think about depending on them in combat. Sure, they can fight off the random animal or raider you encounter while exploring the world, but actual quest areas, dungeons, and bosses were clearly designed with a party of players in mind. AI followers absolutely cannot substitute for real, thinking players here, and if you try to take these challenges on by yourself with only a few followers at your back, you'll just get everyone killed and lose hours of work you put into strengthening and gearing up.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "The first negative comment that I make on many steam games that I've played so far.\n\nBought the game less than a month from the release date just because my friends suggested me to play the game.\nIn the beginning of the game, I didn't find it that fun, so I quit playing after a couple of months.\nRecently I started to play back again, and spent around 300 hours playing this game for a couple of months.\nPlayed in 04p tribe PvP server since it was 3 of us.\n\nLong story short, there is no point of you spending much hours in the game.\nThere are countless chinese hack users, not to mention that chinese people teaming themselves and attack as a group more than 4 people in 4 p tribe server, but also they use bunch of different hack such as ESP, teleport, firing arrows like machine gun. There are so many factors that makes the PvP server less fun, like mentioned above, but the devs are just sitting there watching and doing pretty much nothing. We even recorded the video of cheating, but apparently the dev says \"we went through anti-cheating program, and there was no evidence of those players using hacks\". All these actions taken and the answers I got regarding the hack report even makes me doubt about the competency of the dev looking into the logs and spot the cheating. Most of the online games, if you are suspicious about the users using cheating programs, you just report them, and the devs look into them see if reported players used hacks, not telling the users to bring the proofs, but surprisingly, the devs of this game asks players for the proofs of hack. If you look into few negative comments on this game, then you will instantly see the same comments on those.\n\nThe game which devs do nothing about the hack, and the voices you raise about these would easily be limited or ignored, no matter how many times you speak about it.\nIf you live in democratic country, but you would like to experience communism, I highly recommend you to play this game.\n\n스팀게임을 하며 처음으로 남기는 부정적 평가\n\n게임 출시 한지 한달도 안됐을때 친구들이 같이 하자고 하길래 시작함\n게임 초기에는 크게 흥미를 못느껴서 한두달 하고 그만 둠\n최근에 다시 시작해보자 해서 약 한달 넘게 300시간 가까이 태운듯\nPvP 서버에서 시작했고, 총 인원이 3명이었기에 4명 부족 서버에서 시작하였음\n\n아무리 많은 시간을 태워도 큰 의미가 없는 게임\n중국인 핵 유저가 넘쳐남, 4명 부족 서버에서 다른 부족과 티밍해서 쪽수로 밀어붙이는건 기본이고, ESP, 순간이동, 활 연사 핵 등 \nPvP 의 재미요소를 반감시키는 핵들이 판을 쳐도 운영진은 방관만 할 뿐, 대처를 안함\n증거를 제시하라고 해서 녹화까지 하였으나 본인들의 안티핵프로그램에는 잡히지 않았으므로 문제가 없다고 함\n이정도면 로그도 못딸정도로 개발진의 역량에 한계가 있는것인지 의심까지 듬\n대부분의 게임이 부정프로그램 사용한 유저를 신고했을 시, 개발진이 조사를 해서 핵사용을 잡아내지, 유저들한테 핵사용한 증거를 가져오라고 하진 않음, 하지만 놀랍게도 이 게임을 유저에게 증거를 요구함\n다른 유저들의 부정적인 평가를 보면 금방 알 수 있을 것임\n\n운영진이 핵을 방관하는 게임, 그 외에 많은 발언권들이 운영진에 의해 제한되거나 무시당하는 경우도 빈번함\n본인이 민주주의 국가에 살면서 공산주의를 경험하고 싶다면 추천",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I tried many times to get into it. A lot of the game mechanics are not fleshed out well, needing polish. Content is a bit light, and it turns out the lack of updates to content and some mechanics is because they haven't been working on it. They've been working on paid DLC that will be released with 1.0. So that's where the money went... Expect Conan Exiles and Ark style DLC as a focus/model moving forward, but at a far lesser rate/audience than either of those games. I'm not sure that model will carry their success forward.\n\nThough it's fun for a while I can't fully recommend getting into this. There are better games to invest in.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "It say it has partial controller support but the controls feel absolutely terrible. I can't recommend this game to anyone who plays with controllers.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Fun game but announcing DLC before adding a button to rotate building pieces is a clown move.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Generic and soulless game overburdened by useless features. It's not fun. Combat is horrible. PvP is awful. Very grindy, repetitive and clumsy.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Pros:\n\n-It runs, never had issues with crashes, or extreme lag\n\n-decent enough if you are looking for a generic survival game either solo or with friends\n\n-slave mechanic, although it's been done before, and other games have done it better, this game does offer you the chance to explore while your slaves chop wood, mine, harvest, cook, etc.\n\n-rarity system in gear, I thought it was kinda cool of having a chance of crafting a better version of my gear.\n\nCons:\n\n-stuttering and lag while running or swimming, though not extreme, it gets annoying.\n\n-Combat is boring, feels the same on nearly every fight, and the game just feels like it only rewards you for spamming the special attacks.\n\n-AI is poor, constantly fail to navigate the arena, glitch when swimming, act like Terminator when patrolling, and just simply give no breathing space during combat, they spam attacks with higher chances to stun or stagger than you do.\n\nThe AI ruins immersion this game could have, they feel extremely basic and repetitive, Not asking for realism, but I like to be immersed in the fictional worlds I play.\n\n-A big map, but an empty one at most. The map is big, but its copy and paste the same ruins, pyramids, and camps the entire game, nothing feels new except for a few different enemies in the different biomes, but they usually are just annoying to fight, or feel impossible solo.\n\n-Cant toggle sprint, we are in 2025, that should be accessible, nearly every game has that option at this point.\n\n-Basic Unreal look, doesn't feel like a fresh art style like Valheim, Terraria, Abiotic Factor, No Man's Sky, or Grounded. This feels like every other Unreal test, it doesn't really stand out or feel memorable.\n\nI remember Valheim for its calming ambience and memorable areas.\n\nTerraria for its unique bosses and art style.\n\nAbiotic Factor for its Scp like entities and deep story.\n\nAnd Grounded for a chibi like design on all of the insects and spiders.\n\nMy overall experience?\n\nThe game is okay, but I don't recommend it as something to come back to. The game offers the basic survival experience, nothing too memorable or exciting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Huge empty map, identical ruins copy paste with Tapirs (2 shot) guardians, awful combat, buggy roll dodge.\r\n5hours in the game and i just stood in one place and craft \"progression\" stuff, for what? Empty copy paste ruins that spawn back after 5min. Too much hype for this garbage",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Ehh the game is too early access, NPC's don't work well at all. We have now had our entire based decayed/wiped only after a couple days even though we had tons of wood/thatch/etc. and 2 different npc's stoking the fire. The decay is too aggressive and/or the npc's are not doing their job when you are logged out. Will need to revisit in like 3-6 months, this game is not ready for prime time yet. I would stay away for now until they resolve the issues.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "they decayed 100s of hours away simply because i didnt log in for 5 days - theres nothing that says buildings will decay automatically after 5 days even with tribesman set to bonfires.  so if you have a job or a life outside game note that they will delete everything from you to include 100s of hrs of gameplay over a 5 day decay timer.  if you have a life dont buy this game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "meh... hard to say. I was really digging the game until it came to the \"control\" aspect. It's neat... but I find myself not wanting to invest into it because the RPG element doesn't really matter. Why bother leveling up skills if I can just control another character that has them? It would be cool if the main character had more impact or worth but controlling another character had a singular or timed purpose maybe, otherwise it's just hard to care.\n\nIf that doesn't bother you, probably a cool game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "it's not bad actually but becomes boring soon enough due to repetitive activities and very slow development. It could be better if it has a kind of main story line and some side quests.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "In every way EXCEPT GPU load, this is a great game.  There are pathing bugs and some minor gameplay bugs, but overall, I would have rated this a positive except for one thing.\r\n\r\nThis game does not run well on an RTX 2060.  Nor does it run particularly well on an RTX 3050.\r\n\r\nAs with most modern games, Soulmask suffers from a lack of optimization of the primary graphics rendering thread in the client.\r\nThis means if you want to enable any setting (grass, shadows, distance, textures, particle effects, etc) other than the minimum, your GPU load will be 100% constantly, no matter the GPU you have in your rig.\r\n\r\nSo, given you are going to play this game for hours, that means the temperature of the card will exceed 91'C for hours and hours and hours.  Again, only if you want to play on any setting other than the minimum.\r\n\r\nIf you're willing to limit your framerate to 30 or 45 FPS, your card will run cooler.  It's a terrible shame to have to do this, given how beautiful the game can look, but that's the reality as of Sept 18, 2025.\r\nHopefully before 1.0 release, the developers of Soulmask fix both the pathing bugs and the GPU optimization, and they will have a game worthy of the price tag.\r\n\r\nUntil then, caveat emptor, and be ready to enjoy the sound of a GPU FAN running at 100%. :D",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cons: Combat is boring and repetitive, world feels empty, Very grindy, tribesman AI is janky.\r\n\r\nPros: AI control mechanic is cool, pretty detailed options for Player owned AI",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Is early access game\nMakes DLC trailers\n\nSo is the game out or not?\n\nProbably another cash grab game. Avoid, it's not fun.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "There could be something here, but it's still cooking.\nCharacter creation is very limited. Tiddies jiggle like they're filled with water. The animations are just terrible. The tutorial is way too long and parts of it are in chingchong chicken scratches. The UI is an abomination. Way too much shit all over the screen. Just no.\nMaybe they'll spend some time polishing it and make it shine, but for now just no.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If this game had a more flexible character creator like Ark Survival where i could make a unique character and i was unable to unbind the left mouse button, I am sure I would have enjoyed this game, but atm it's a no for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Boring game, I could see having some fun with friends, but even with other players, there isn't much to do. Theres some animals and a few camps here and there, you sometimes fight and build a base. That's it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall, a fun game, until it is not.\r\nThe game has a few flaws, some things need to be ironed out, the tribesmen work wonky and the fact you cannot 'fully level' your initial character is just...bad design.\r\nBut, it was fun for the most part.\r\n\r\nUntil you reach halfway to the game, suddenly the game turns from 'Valheim with tribesmen' to 'Dark souls with tribesmen'\r\nAnd while people can say 'git gud' or whatever, it isn't about that.\r\nThis is a survival crafting game, its NOT a soulslike. People who want to play a soulslike, will play that!\r\nDont randomly insert gameplay I do not enjoy halfway into a game just as I think I'm 'getting to the good part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A lot of great systems here, but waaaaaaaaaay too much of a grind. I played with friends and it was still a struggle. Stuff degrades way too fast, we realized we were spending hours crafting replacement equipment per hour of actually exploring or raiding. Deciding to stop playing was a relief to us all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In its current state, the game is just… meh. It has potential, but right now it didn’t really pull me in. I was hoping for something along the lines of Conan, but unfortunately it’s not that.\n\nThe beginning is extremely boring. I know it’s a survival game and it’s still in early access, but starting out with no real goal besides a flood of tutorials and information—even the UI is overwhelming at first—can easily push players away. There’s no real introduction to the story (if there even is one). And that opening cutscene? For me, it explains absolutely nothing. I get that it’s a survival game, but many survival games still have some kind of story setup, world introduction, or at least an explanation of who you are and why you're even here.\n\nThe crafting menu also isn’t great. I appreciate the attempt to divide knowledge into “sections,” but it doesn’t help much when you’re still being flooded with a massive list of items. It would be much better if everything was separated into clearly defined windows/categories.\n\nThe animations are so stiff it’s honestly painful to look at. The transitions between them… ugh. Just try chopping a tree and moving your mouse—the character suddenly “teleports” into a new position. Or if your character dies underwater, they start crawling. Crawling! Underwater. The same goes for facial expressions: there basically aren’t any, and characters look like empty dolls.\n\nCombat is also pretty mediocre. The animations aren’t great (same issue as above), and enemies feel super stiff too—they mostly just stare at you, waiting for you to make a move, and sometimes they hit you… maybe. In most games, combat feels enjoyable to me, but here it really doesn’t.\n\nI even jumped into the water expecting some sharks or something interesting, but nope—just empty space where you can swim and swim and swim and… swim.\n\nAs for graphics, they’re nice and pleasant to look at. I enjoyed running around the map, but that leads to another issue: the map is big, but mostly empty, aside from a few animals. (Maybe that’s because I didn’t explore much beyond the starting zone, but honestly the game didn’t motivate me to go further.) Most of my time was spent running around aimlessly.\n\nNow, the character creator… look, I know it’s early access, but considering how extremely limited it is, it’s hard to say anything positive. But hey, they added jiggle physics for breasts… Great right... I guess. Personally, in actual state I’d prefer just two preset characters—one male and one female—but actually well polished. Maybe the character creator will improve later and give us more options.\n\nThere’s also no first-person mode. If I can’t make my character look the way I want, then I’d rather not stare at her and would prefer a first-person view instead.\n\nThe building mode is a so much pain. There’s absolutely no button to lower or raise foundations — you have to dance around to position things properly and wiggle the camera. When i love building in almost every game, that here. No way!\n\nSo overall, the game didn’t grab my attention or hook me enough with its beginning for me to want to come back to it. Maybe I’ll give it another try someday when I run out of other games to play, but for now… it’s just boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After hundreds of hours playing Conan: Exiles, I decided to give this a shot. I wanted something new as Funcom is focusing on DUNE and Conan seasons rather than making a new map or large DLC. This ain't it chief. Conan is still a much better experience than this is. This game has a lot of bugs to work out, and a needlessly complex and expansive system for their menus. There are also some translation issues but I can easily look past that part. Combat is clunky and repetitive. I didn't even get into the building side of things because I was just so turned off from everything else in the beginning. This game has potential, but potential doesn't fix the issues.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Controller support is terrible. \nText size is unreadable. \nI'm hopeful future updates will improve the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Long long long game, takes months to level top out. and theres really not much to do. It's the same slash and hack with a roll. Beautiful graphics however",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SoulMasks whole philosophy seems like it wants you to LIVE the experience...just not the fun parts.\nIts more a micromanaging, base building and resource simulator, than it is an actual survival.\nOr a \"game\" for that matter.\nAfter 56 hours, I can honestly say 50 hours felt like laborious work.\n3 hours was probably learning this games systems from YouTubers, and I think I went AFK for 3 hours.\n\nThe game kinda sells you on a system in which you can automate the boring wood, stone gathering etc - allowing you to assign these tasks and base upkeep to your NPC Tribesmen.\n\n\"Gee-Willikers, that sure is awesome...now I can spend more time exploring the massive sprawling world!\"\nNo Billy.\n\nFirst, you have tasks to complete which are intended to teach you the game.\nDon't worry though Billy, because later, this will all become too much information and you'll soon need to relearn everything from a YouTuber that can explain it far clearer.\nThen, you need to capture a slave....\nJust fight your way through a camp, spare one and stare menacingly into their eyes until they submit and go into a coma. (you know - the usual \"How I met your mother\" story).\nNext, caveman-carry them back to your base and throw them lifelessly onto a bed.\nThen, literally spoon-feed them until they regain consciousness, at which point I assume you’ve either gaslit them into cooperation or they have the fastest case of Stockholm syndrome ever.\nEither way - you own them now.\n\nNow comes the fun part.\nNow, you'll have to navigate possibly the most convoluted AI task assignment process known to man.\nBut fret not Billy ol chum...after getting the hang of this, doing your taxes won't feel so bad.\nThings will also constantly go wrong with the orders you have given your tribe, so don’t think you're out into the woods just yet.\nNext, you have to manage their inventories to ensure they don't starve or die.\nThen, you need to ensure you continue to build more storage constantly.\nOh, and don't forget to keep an eye out on the durability of their tools.\n\nNow, its finally time.\nTime to d-d-d- dua...er I mean, go to sleep, to manage your sanity, cook some food and gather water for yourself - and your tribe.\nLest your slaves turn against you and leave because yes...there is a mood bar, and several other fun and exciting meters to monitor to ensure happiness is felt by all.\n\nJust not you.\nNever you.\n\nNow, just do this 9 more times and build a happy little colonized family and you are finally ready to do your best Bilbo impression and \"go on an adventure!!!!!\"\nThis is it.\nThe moment you have been waiting for.\nOh wait, a death kitty?\nYou're dead.\nWait, a giant snek?\nDead-skies.\nAhh, that's a go-fast cat...and you guess it.\nDed.\nI'm literally shocked the fkn Turts don't kill you in this game -_-\n\nOh, and funnily enough, at one point I captured a black man.\nI died on an adventure with him, so I respawned AS him, and completed the slaughter of his family. However, when I respawned back as me, he died, slipped into a coma and was somehow reborn as a white man.\n\n\nBut enough theory crafting why that happened....maybe caves will provide a better experience?\nNahhh, inside lie robots, and groups of geared natives will unalive you faster than it took you to regret buying this game.\n\n\"But why sir? They are lvl 26 and i'm 33\"\nWell Billy, levels mean two thirds of a rat’s ass in Soulmask because chances are, you aren't paying attention to the right one or not levelling them all in tandem.\nYou see you have YOUR level, and then your masks level.\nNot to mention, you have the level of your proficiencies in literally everything you do and wield.\n\nFML this review is getting away from me.\nEither way, Billy quit and went to Roblox.\nI haven't heard from him since.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Farm for hours to get masks that all feel like they add nothing. \n\nFarm for hours to get upgraded armor and still get one shot by everything.\n\nYou have the be standing right next to your mount to call it, making that feature useless.\n\nThe chat censorship is terrible, censoring every other word, but if you use all caps it will censor nothing. If you can't do it right don't do it at all.\n\nNo point in finding a good NPC to help you because when you bring any helpers the bosses and mobs suddenly do 10X the damage and have 10X more health.\n\nPublic servers lag like crazy even when a few people are on at a time. They most likely get a cut from the companies that rent out private servers incentivizing them to have garbage public servers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Weird buggy game but has booba slider AND jiggle physics, which explains the rating.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is just such a grind. I'm 24 hours in and I feel like I haven't really played the game. The crafting takes forever, I often forget I'm playing while I Alt Tab out to grocery shop. Riding into trees constantly in thick brush sucks. It's hard to tell what's going on with the map and you spend all your time running around mountains.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Released as Early Access to trick people into being more eager to give it a chance, when in fact developers were working for majority of time on DLC. Whole 2025 was 1 content update in summer and 3-5 bugfixes each week, for entire year. The whole game \"development\". But hey! There's huge announcement for 1.0 release - a DLC.\n\nSo far we still don't know if DLC is paid or free for Early Access buyers. If it's paid, I'd call it a scam and look for refund by Steam.\n\nQuote from store page about Soulmask Early Access:\n\"We are working tirelessly around the clock to accelerate development and complete any interesting modifications that we and the players have mentioned to make Soulmask more attractive.\" This is straight lie, what tirelessly they were working on is 1.0 DLC. I can imagine DLC has many features players asked for in Early Access feedback.\n\nSeems like CampFire Studio or Qooland Games decided to sell this game as Early Access without fully understanding what Early Access supposed to look like OR with full knowledge how it should look like - they decided to just lie about it and trick people into buying Early Access game when they were fully aware, the content they work on is not Early Access content, but DLC. \n\n\nAbout the game:\nUnique background of amazonian jungle with interesting feature about AI tribesman you capture to order them doing certain tasks so you have a semi-living-village-like experience. Beside that rather unimaginative classic open-world sandbox, grind resources, build structures, upgrade gear, repair gear, the end. There's not much to build, but models are well designed and fit together perfectly, so even simple constructions look good. When I bought the game I had an impression THIS is solid foundation developers will further build on - now knowing there is no further developement - as a whole game, it lacks much. Interesting surface, not much deepness.\n\nThere are many ways you can tweak and balance gameplay by \"server settings\", so that's a welcome feature, especially for solo players.\n\nOverall Soulmask is fine example of a game that goes through the checklist of what supposed to be in a game from this genre, checks most marks as \"it's there\" and that's it. There is a lot of bland content that will keep you busy for hours. For me AI tribesmen is only feature that makes this game interesting, but when everything else is meh, playing Soulmask felt like forcing myself to do meh things in order to enjoy one particular feature for a while.\n\nIf you want one perfect example of Soulmask bland content, the Jaguar probably is. Jaguar is dangerous predator that can easily kill you in early game, for some time you literally watching your backs travelling around and try to learn where in the jungle they hunt so you can avoid surprise attack. Sounds cool right? Later you learn the how to capture one, so obviously you want one right? It's not only not easy in terms of game mechanics you need to learn, but also risky. So you finally captured Jaguar one day. A dangerous predator on your side? Nope. A \"horse\". Jaguar once tamed is only a mount. Soulmask is filled with such put-hours-of-gameplay for a meh reward content. \n\nThere is a lot of content in Soulmask, but the more content you come across, the more discouraged you are to push further due to way the content is implemented. Like I said, it's checklist content, implemented sometimes in most unimaginative, lazy way just to be there instead of have any meaningful impact on a gameplay. \nWhat would be acceptable for an Early Access game knowing the meh stuff might turn into good stuff when developers expand on it after players feedback. But we already know it won't happen in case of Soulmask so lazy, unimaginative content is all you get. But hey, there's a lot of it, so I guess for some it makes it okay-ish?\n\nDLC seems promising tho, so you know. There's a hope.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Lots of systems, lush world, looking good.  Oh wait, it's slavery, in a central american theme of all places.  Big no for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very bad to play the game with controller.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game ruined by chinese cheaters everywhere",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Solo Experience is quite dull in terms of exploration and discovery compared to other survival crafting games available, they definitely need to work on that.\n\nCrafting system is what you would expect. Nothing Feels rewarding though, just grind and wait, automation system with tribesman works well but there's not a lot to it.\n\n I'm hoping they develop this game and add more interesting POI's , features events or structures and wildlife.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Already selling DLC ? your game is still in early access stage !",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I agree with the negative reviews.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bush dogs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It feels like this game has a good foundation, but unfortunately that's kind of it. They keep adding more things, which is nice, but it's very clear that's all they want to do, and not refine what they have.\n\nThe combat is mediocre at best, I'd describe it as functional. It looks way more fun than it is. The crafting system could be really cool, because you can have your tribe craft for you, but the menus and systems are overly complex and not intuitive. It seems like even though I have my tribe always working on something, nothing is getting accomplished.\n\nI hate the respawn system, every mob, human and animal, spawn in the exact same spot in barely no time at all, making for a disconnected experience. It dispels any illusion of immersion that could be had since it no longer feels like a real world anymore, but an NPC spawner, making the areas feel cramped and stifling because you can never truly clear an area. It feels amateur, and one of those things that, if they haven't done anything with it in a year and half, it ain't changing now.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "If you're looking for an MMO/Co-op experience similar to Conan, Ark, or Rust, this will probably deliver everything you're hoping for. My review is only based on the solo experience.\n\nEven though it is designed similarly to the aforementioned MMO/co-op games, Soulmask boasts having theoretically hyper-capable AI followers that can practically run your base for you without ever having to lift a finger yourself. While it's true that they *can* do just about any task players can do, they're not incredibly intelligent about it. You'll constantly have to reset or modify their orders to avoid having them do nothing but rest around your campfire, which kind of defeats the purpose of having them do the work for you.\n\nAnd don't even think about depending on them in combat. Sure, they can fight off the random animal or raider you encounter while exploring the world, but actual quest areas, dungeons, and bosses were clearly designed with a party of players in mind. AI followers absolutely cannot substitute for real, thinking players here, and if you try to take these challenges on by yourself with only a few followers at your back, you'll just get everyone killed and lose hours of work you put into strengthening and gearing up.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "The first negative comment that I make on many steam games that I've played so far.\n\nBought the game less than a month from the release date just because my friends suggested me to play the game.\nIn the beginning of the game, I didn't find it that fun, so I quit playing after a couple of months.\nRecently I started to play back again, and spent around 300 hours playing this game for a couple of months.\nPlayed in 04p tribe PvP server since it was 3 of us.\n\nLong story short, there is no point of you spending much hours in the game.\nThere are countless chinese hack users, not to mention that chinese people teaming themselves and attack as a group more than 4 people in 4 p tribe server, but also they use bunch of different hack such as ESP, teleport, firing arrows like machine gun. There are so many factors that makes the PvP server less fun, like mentioned above, but the devs are just sitting there watching and doing pretty much nothing. We even recorded the video of cheating, but apparently the dev says \"we went through anti-cheating program, and there was no evidence of those players using hacks\". All these actions taken and the answers I got regarding the hack report even makes me doubt about the competency of the dev looking into the logs and spot the cheating. Most of the online games, if you are suspicious about the users using cheating programs, you just report them, and the devs look into them see if reported players used hacks, not telling the users to bring the proofs, but surprisingly, the devs of this game asks players for the proofs of hack. If you look into few negative comments on this game, then you will instantly see the same comments on those.\n\nThe game which devs do nothing about the hack, and the voices you raise about these would easily be limited or ignored, no matter how many times you speak about it.\nIf you live in democratic country, but you would like to experience communism, I highly recommend you to play this game.\n\n스팀게임을 하며 처음으로 남기는 부정적 평가\n\n게임 출시 한지 한달도 안됐을때 친구들이 같이 하자고 하길래 시작함\n게임 초기에는 크게 흥미를 못느껴서 한두달 하고 그만 둠\n최근에 다시 시작해보자 해서 약 한달 넘게 300시간 가까이 태운듯\nPvP 서버에서 시작했고, 총 인원이 3명이었기에 4명 부족 서버에서 시작하였음\n\n아무리 많은 시간을 태워도 큰 의미가 없는 게임\n중국인 핵 유저가 넘쳐남, 4명 부족 서버에서 다른 부족과 티밍해서 쪽수로 밀어붙이는건 기본이고, ESP, 순간이동, 활 연사 핵 등 \nPvP 의 재미요소를 반감시키는 핵들이 판을 쳐도 운영진은 방관만 할 뿐, 대처를 안함\n증거를 제시하라고 해서 녹화까지 하였으나 본인들의 안티핵프로그램에는 잡히지 않았으므로 문제가 없다고 함\n이정도면 로그도 못딸정도로 개발진의 역량에 한계가 있는것인지 의심까지 듬\n대부분의 게임이 부정프로그램 사용한 유저를 신고했을 시, 개발진이 조사를 해서 핵사용을 잡아내지, 유저들한테 핵사용한 증거를 가져오라고 하진 않음, 하지만 놀랍게도 이 게임을 유저에게 증거를 요구함\n다른 유저들의 부정적인 평가를 보면 금방 알 수 있을 것임\n\n운영진이 핵을 방관하는 게임, 그 외에 많은 발언권들이 운영진에 의해 제한되거나 무시당하는 경우도 빈번함\n본인이 민주주의 국가에 살면서 공산주의를 경험하고 싶다면 추천",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I tried many times to get into it. A lot of the game mechanics are not fleshed out well, needing polish. Content is a bit light, and it turns out the lack of updates to content and some mechanics is because they haven't been working on it. They've been working on paid DLC that will be released with 1.0. So that's where the money went... Expect Conan Exiles and Ark style DLC as a focus/model moving forward, but at a far lesser rate/audience than either of those games. I'm not sure that model will carry their success forward.\n\nThough it's fun for a while I can't fully recommend getting into this. There are better games to invest in.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Fun game but announcing DLC before adding a button to rotate building pieces is a clown move.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "PVP servers are full of hackers that teleport to your bonfire and instantly destroy your base.  They demand a tax to not hack your base, like some poser Chicago gangster wannabe, and the devs are totally on board with it for some reason.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It say it has partial controller support but the controls feel absolutely terrible. I can't recommend this game to anyone who plays with controllers.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Generic and soulless game overburdened by useless features. It's not fun. Combat is horrible. PvP is awful. Very grindy, repetitive and clumsy.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Pros:\n\n-It runs, never had issues with crashes, or extreme lag\n\n-decent enough if you are looking for a generic survival game either solo or with friends\n\n-slave mechanic, although it's been done before, and other games have done it better, this game does offer you the chance to explore while your slaves chop wood, mine, harvest, cook, etc.\n\n-rarity system in gear, I thought it was kinda cool of having a chance of crafting a better version of my gear.\n\nCons:\n\n-stuttering and lag while running or swimming, though not extreme, it gets annoying.\n\n-Combat is boring, feels the same on nearly every fight, and the game just feels like it only rewards you for spamming the special attacks.\n\n-AI is poor, constantly fail to navigate the arena, glitch when swimming, act like Terminator when patrolling, and just simply give no breathing space during combat, they spam attacks with higher chances to stun or stagger than you do.\n\nThe AI ruins immersion this game could have, they feel extremely basic and repetitive, Not asking for realism, but I like to be immersed in the fictional worlds I play.\n\n-A big map, but an empty one at most. The map is big, but its copy and paste the same ruins, pyramids, and camps the entire game, nothing feels new except for a few different enemies in the different biomes, but they usually are just annoying to fight, or feel impossible solo.\n\n-Cant toggle sprint, we are in 2025, that should be accessible, nearly every game has that option at this point.\n\n-Basic Unreal look, doesn't feel like a fresh art style like Valheim, Terraria, Abiotic Factor, No Man's Sky, or Grounded. This feels like every other Unreal test, it doesn't really stand out or feel memorable.\n\nI remember Valheim for its calming ambience and memorable areas.\n\nTerraria for its unique bosses and art style.\n\nAbiotic Factor for its Scp like entities and deep story.\n\nAnd Grounded for a chibi like design on all of the insects and spiders.\n\nMy overall experience?\n\nThe game is okay, but I don't recommend it as something to come back to. The game offers the basic survival experience, nothing too memorable or exciting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It’s your typical Chinese survival game consisting mostly of grinding, overloaded and illogical UI and questionable business practices. On top of that the world feels pretty empty and lacks character. It will pull you in, make you waste many hours of your life chasing that elusive feeling of satisfaction, making you think it’s just around the corner, and leave you unsatisfied and with a massive hangover hours later. You will never get that time back.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Huge empty map, identical ruins copy paste with Tapirs (2 shot) guardians, awful combat, buggy roll dodge.\r\n5hours in the game and i just stood in one place and craft \"progression\" stuff, for what? Empty copy paste ruins that spawn back after 5min. Too much hype for this garbage",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Ehh the game is too early access, NPC's don't work well at all. We have now had our entire based decayed/wiped only after a couple days even though we had tons of wood/thatch/etc. and 2 different npc's stoking the fire. The decay is too aggressive and/or the npc's are not doing their job when you are logged out. Will need to revisit in like 3-6 months, this game is not ready for prime time yet. I would stay away for now until they resolve the issues.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "meh... hard to say. I was really digging the game until it came to the \"control\" aspect. It's neat... but I find myself not wanting to invest into it because the RPG element doesn't really matter. Why bother leveling up skills if I can just control another character that has them? It would be cool if the main character had more impact or worth but controlling another character had a singular or timed purpose maybe, otherwise it's just hard to care.\n\nIf that doesn't bother you, probably a cool game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Is early access game\nMakes DLC trailers\n\nSo is the game out or not?\n\nProbably another cash grab game. Avoid, it's not fun.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "it's not bad actually but becomes boring soon enough due to repetitive activities and very slow development. It could be better if it has a kind of main story line and some side quests.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "In every way EXCEPT GPU load, this is a great game.  There are pathing bugs and some minor gameplay bugs, but overall, I would have rated this a positive except for one thing.\r\n\r\nThis game does not run well on an RTX 2060.  Nor does it run particularly well on an RTX 3050.\r\n\r\nAs with most modern games, Soulmask suffers from a lack of optimization of the primary graphics rendering thread in the client.\r\nThis means if you want to enable any setting (grass, shadows, distance, textures, particle effects, etc) other than the minimum, your GPU load will be 100% constantly, no matter the GPU you have in your rig.\r\n\r\nSo, given you are going to play this game for hours, that means the temperature of the card will exceed 91'C for hours and hours and hours.  Again, only if you want to play on any setting other than the minimum.\r\n\r\nIf you're willing to limit your framerate to 30 or 45 FPS, your card will run cooler.  It's a terrible shame to have to do this, given how beautiful the game can look, but that's the reality as of Sept 18, 2025.\r\nHopefully before 1.0 release, the developers of Soulmask fix both the pathing bugs and the GPU optimization, and they will have a game worthy of the price tag.\r\n\r\nUntil then, caveat emptor, and be ready to enjoy the sound of a GPU FAN running at 100%. :D",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The base of the game is a typical survival game, but the amount of time required to reach experience for the highest levels and unlock some of the gear required for end game is way out of balance. You may have a house of slaves, but you better let them dance and do ALL the chores yourself.. then go out and slaughter the same high end city over and over and over and..... in the hopes of unlocking the recipe for just one piece of the armor required... now do it again because you need the full set. as a bonus, if you put three bases together to make a mega base and guard it super well from people breaching the wall, well now the invasions will just spawn on the second floor inside the building. I'm certain that it completely by accident though..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cons: Combat is boring and repetitive, world feels empty, Very grindy, tribesman AI is janky.\r\n\r\nPros: AI control mechanic is cool, pretty detailed options for Player owned AI",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "they decayed 100s of hours away simply because i didnt log in for 5 days - theres nothing that says buildings will decay automatically after 5 days even with tribesman set to bonfires.  so if you have a job or a life outside game note that they will delete everything from you to include 100s of hrs of gameplay over a 5 day decay timer.  if you have a life dont buy this game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "There could be something here, but it's still cooking.\nCharacter creation is very limited. Tiddies jiggle like they're filled with water. The animations are just terrible. The tutorial is way too long and parts of it are in chingchong chicken scratches. The UI is an abomination. Way too much shit all over the screen. Just no.\nMaybe they'll spend some time polishing it and make it shine, but for now just no.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If this game had a more flexible character creator like Ark Survival where i could make a unique character and i was unable to unbind the left mouse button, I am sure I would have enjoyed this game, but atm it's a no for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Boring game, I could see having some fun with friends, but even with other players, there isn't much to do. Theres some animals and a few camps here and there, you sometimes fight and build a base. That's it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall, a fun game, until it is not.\r\nThe game has a few flaws, some things need to be ironed out, the tribesmen work wonky and the fact you cannot 'fully level' your initial character is just...bad design.\r\nBut, it was fun for the most part.\r\n\r\nUntil you reach halfway to the game, suddenly the game turns from 'Valheim with tribesmen' to 'Dark souls with tribesmen'\r\nAnd while people can say 'git gud' or whatever, it isn't about that.\r\nThis is a survival crafting game, its NOT a soulslike. People who want to play a soulslike, will play that!\r\nDont randomly insert gameplay I do not enjoy halfway into a game just as I think I'm 'getting to the good part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A lot of great systems here, but waaaaaaaaaay too much of a grind. I played with friends and it was still a struggle. Stuff degrades way too fast, we realized we were spending hours crafting replacement equipment per hour of actually exploring or raiding. Deciding to stop playing was a relief to us all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have never seen this kind of announcement for a 1.0 version of a game, sincerely idk why people is happy with the announcement of the 1.0 with a DLC which is looking to be paid because they are not saying that it will be free. It feels really concerning.\n\nThe game is good but the adding a DLC first day launch is a big wth.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "In its current state, the game is just… meh. It has potential, but right now it didn’t really pull me in. I was hoping for something along the lines of Conan, but unfortunately it’s not that.\n\nThe beginning is extremely boring. I know it’s a survival game and it’s still in early access, but starting out with no real goal besides a flood of tutorials and information—even the UI is overwhelming at first—can easily push players away. There’s no real introduction to the story (if there even is one). And that opening cutscene? For me, it explains absolutely nothing. I get that it’s a survival game, but many survival games still have some kind of story setup, world introduction, or at least an explanation of who you are and why you're even here.\n\nThe crafting menu also isn’t great. I appreciate the attempt to divide knowledge into “sections,” but it doesn’t help much when you’re still being flooded with a massive list of items. It would be much better if everything was separated into clearly defined windows/categories.\n\nThe animations are so stiff it’s honestly painful to look at. The transitions between them… ugh. Just try chopping a tree and moving your mouse—the character suddenly “teleports” into a new position. Or if your character dies underwater, they start crawling. Crawling! Underwater. The same goes for facial expressions: there basically aren’t any, and characters look like empty dolls.\n\nCombat is also pretty mediocre. The animations aren’t great (same issue as above), and enemies feel super stiff too—they mostly just stare at you, waiting for you to make a move, and sometimes they hit you… maybe. In most games, combat feels enjoyable to me, but here it really doesn’t.\n\nI even jumped into the water expecting some sharks or something interesting, but nope—just empty space where you can swim and swim and swim and… swim.\n\nAs for graphics, they’re nice and pleasant to look at. I enjoyed running around the map, but that leads to another issue: the map is big, but mostly empty, aside from a few animals. (Maybe that’s because I didn’t explore much beyond the starting zone, but honestly the game didn’t motivate me to go further.) Most of my time was spent running around aimlessly.\n\nNow, the character creator… look, I know it’s early access, but considering how extremely limited it is, it’s hard to say anything positive. But hey, they added jiggle physics for breasts… Great right... I guess. Personally, in actual state I’d prefer just two preset characters—one male and one female—but actually well polished. Maybe the character creator will improve later and give us more options.\n\nThere’s also no first-person mode. If I can’t make my character look the way I want, then I’d rather not stare at her and would prefer a first-person view instead.\n\nThe building mode is a so much pain. There’s absolutely no button to lower or raise foundations — you have to dance around to position things properly and wiggle the camera. When i love building in almost every game, that here. No way!\n\nSo overall, the game didn’t grab my attention or hook me enough with its beginning for me to want to come back to it. Maybe I’ll give it another try someday when I run out of other games to play, but for now… it’s just boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After hundreds of hours playing Conan: Exiles, I decided to give this a shot. I wanted something new as Funcom is focusing on DUNE and Conan seasons rather than making a new map or large DLC. This ain't it chief. Conan is still a much better experience than this is. This game has a lot of bugs to work out, and a needlessly complex and expansive system for their menus. There are also some translation issues but I can easily look past that part. Combat is clunky and repetitive. I didn't even get into the building side of things because I was just so turned off from everything else in the beginning. This game has potential, but potential doesn't fix the issues.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Controller support is terrible. \nText size is unreadable. \nI'm hopeful future updates will improve the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Farm for hours to get masks that all feel like they add nothing. \n\nFarm for hours to get upgraded armor and still get one shot by everything.\n\nYou have the be standing right next to your mount to call it, making that feature useless.\n\nThe chat censorship is terrible, censoring every other word, but if you use all caps it will censor nothing. If you can't do it right don't do it at all.\n\nNo point in finding a good NPC to help you because when you bring any helpers the bosses and mobs suddenly do 10X the damage and have 10X more health.\n\nPublic servers lag like crazy even when a few people are on at a time. They most likely get a cut from the companies that rent out private servers incentivizing them to have garbage public servers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "8 hours into the game, i've played a bunch of other survival games, subnautica, bellwright, enshroud, and what not.  This has got to be one of the worst \"survival games\" ever designed.   Lets start with what's ok.   The graphic and combat feels ok, and is better than games like Bellwright(fights like you are playing bannerlord2).   What's not good about this?   Survival progress feels like it was designed by competing teams that did not agree with each other.   You have a tech tree that you can't find material for, such as leather.   The map is huge and you waste more time walking around lost than actually enjoying the game.   Gear levels does very little in protecting you from wild animals, you die quick.   Actual fights with npcs is even worse.   your captured villager have almost zero AI, the entire automation process is stupid.   For example, you cannot tell your first village's people to move to your new base without walking them over by yourself.   When you set villages to follow and fight with you, they lose that command the moment you die or have to reload the game, stranding them in the middle of no where, which your equipment-less self have to go fetch.    End result is a game with poor AI, poor progression, and a giant waste of time.   I would refund this if I still could.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Weird buggy game but has booba slider AND jiggle physics, which explains the rating.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is just such a grind. I'm 24 hours in and I feel like I haven't really played the game. The crafting takes forever, I often forget I'm playing while I Alt Tab out to grocery shop. Riding into trees constantly in thick brush sucks. It's hard to tell what's going on with the map and you spend all your time running around mountains.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Released as Early Access to trick people into being more eager to give it a chance, when in fact developers were working for majority of time on DLC. Whole 2025 was 1 content update in summer and 3-5 bugfixes each week, for entire year. The whole game \"development\". But hey! There's huge announcement for 1.0 release - a DLC.\n\nSo far we still don't know if DLC is paid or free for Early Access buyers. If it's paid, I'd call it a scam and look for refund by Steam.\n\nQuote from store page about Soulmask Early Access:\n\"We are working tirelessly around the clock to accelerate development and complete any interesting modifications that we and the players have mentioned to make Soulmask more attractive.\" This is straight lie, what tirelessly they were working on is 1.0 DLC. I can imagine DLC has many features players asked for in Early Access feedback.\n\nSeems like CampFire Studio or Qooland Games decided to sell this game as Early Access without fully understanding what Early Access supposed to look like OR with full knowledge how it should look like - they decided to just lie about it and trick people into buying Early Access game when they were fully aware, the content they work on is not Early Access content, but DLC. \n\n\nAbout the game:\nUnique background of amazonian jungle with interesting feature about AI tribesman you capture to order them doing certain tasks so you have a semi-living-village-like experience. Beside that rather unimaginative classic open-world sandbox, grind resources, build structures, upgrade gear, repair gear, the end. There's not much to build, but models are well designed and fit together perfectly, so even simple constructions look good. When I bought the game I had an impression THIS is solid foundation developers will further build on - now knowing there is no further developement - as a whole game, it lacks much. Interesting surface, not much deepness.\n\nThere are many ways you can tweak and balance gameplay by \"server settings\", so that's a welcome feature, especially for solo players.\n\nOverall Soulmask is fine example of a game that goes through the checklist of what supposed to be in a game from this genre, checks most marks as \"it's there\" and that's it. There is a lot of bland content that will keep you busy for hours. For me AI tribesmen is only feature that makes this game interesting, but when everything else is meh, playing Soulmask felt like forcing myself to do meh things in order to enjoy one particular feature for a while.\n\nIf you want one perfect example of Soulmask bland content, the Jaguar probably is. Jaguar is dangerous predator that can easily kill you in early game, for some time you literally watching your backs travelling around and try to learn where in the jungle they hunt so you can avoid surprise attack. Sounds cool right? Later you learn the how to capture one, so obviously you want one right? It's not only not easy in terms of game mechanics you need to learn, but also risky. So you finally captured Jaguar one day. A dangerous predator on your side? Nope. A \"horse\". Jaguar once tamed is only a mount. Soulmask is filled with such put-hours-of-gameplay for a meh reward content. \n\nThere is a lot of content in Soulmask, but the more content you come across, the more discouraged you are to push further due to way the content is implemented. Like I said, it's checklist content, implemented sometimes in most unimaginative, lazy way just to be there instead of have any meaningful impact on a gameplay. \nWhat would be acceptable for an Early Access game knowing the meh stuff might turn into good stuff when developers expand on it after players feedback. But we already know it won't happen in case of Soulmask so lazy, unimaginative content is all you get. But hey, there's a lot of it, so I guess for some it makes it okay-ish?\n\nDLC seems promising tho, so you know. There's a hope.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Lots of systems, lush world, looking good.  Oh wait, it's slavery, in a central american theme of all places.  Big no for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very bad to play the game with controller.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game ruined by chinese cheaters everywhere",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Solo Experience is quite dull in terms of exploration and discovery compared to other survival crafting games available, they definitely need to work on that.\n\nCrafting system is what you would expect. Nothing Feels rewarding though, just grind and wait, automation system with tribesman works well but there's not a lot to it.\n\n I'm hoping they develop this game and add more interesting POI's , features events or structures and wildlife.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Already selling DLC ? your game is still in early access stage !",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I agree with the negative reviews.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bush dogs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It feels like this game has a good foundation, but unfortunately that's kind of it. They keep adding more things, which is nice, but it's very clear that's all they want to do, and not refine what they have.\n\nThe combat is mediocre at best, I'd describe it as functional. It looks way more fun than it is. The crafting system could be really cool, because you can have your tribe craft for you, but the menus and systems are overly complex and not intuitive. It seems like even though I have my tribe always working on something, nothing is getting accomplished.\n\nI hate the respawn system, every mob, human and animal, spawn in the exact same spot in barely no time at all, making for a disconnected experience. It dispels any illusion of immersion that could be had since it no longer feels like a real world anymore, but an NPC spawner, making the areas feel cramped and stifling because you can never truly clear an area. It feels amateur, and one of those things that, if they haven't done anything with it in a year and half, it ain't changing now.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "If you're looking for an MMO/Co-op experience similar to Conan, Ark, or Rust, this will probably deliver everything you're hoping for. My review is only based on the solo experience.\n\nEven though it is designed similarly to the aforementioned MMO/co-op games, Soulmask boasts having theoretically hyper-capable AI followers that can practically run your base for you without ever having to lift a finger yourself. While it's true that they *can* do just about any task players can do, they're not incredibly intelligent about it. You'll constantly have to reset or modify their orders to avoid having them do nothing but rest around your campfire, which kind of defeats the purpose of having them do the work for you.\n\nAnd don't even think about depending on them in combat. Sure, they can fight off the random animal or raider you encounter while exploring the world, but actual quest areas, dungeons, and bosses were clearly designed with a party of players in mind. AI followers absolutely cannot substitute for real, thinking players here, and if you try to take these challenges on by yourself with only a few followers at your back, you'll just get everyone killed and lose hours of work you put into strengthening and gearing up.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "The first negative comment that I make on many steam games that I've played so far.\n\nBought the game less than a month from the release date just because my friends suggested me to play the game.\nIn the beginning of the game, I didn't find it that fun, so I quit playing after a couple of months.\nRecently I started to play back again, and spent around 300 hours playing this game for a couple of months.\nPlayed in 04p tribe PvP server since it was 3 of us.\n\nLong story short, there is no point of you spending much hours in the game.\nThere are countless chinese hack users, not to mention that chinese people teaming themselves and attack as a group more than 4 people in 4 p tribe server, but also they use bunch of different hack such as ESP, teleport, firing arrows like machine gun. There are so many factors that makes the PvP server less fun, like mentioned above, but the devs are just sitting there watching and doing pretty much nothing. We even recorded the video of cheating, but apparently the dev says \"we went through anti-cheating program, and there was no evidence of those players using hacks\". All these actions taken and the answers I got regarding the hack report even makes me doubt about the competency of the dev looking into the logs and spot the cheating. Most of the online games, if you are suspicious about the users using cheating programs, you just report them, and the devs look into them see if reported players used hacks, not telling the users to bring the proofs, but surprisingly, the devs of this game asks players for the proofs of hack. If you look into few negative comments on this game, then you will instantly see the same comments on those.\n\nThe game which devs do nothing about the hack, and the voices you raise about these would easily be limited or ignored, no matter how many times you speak about it.\nIf you live in democratic country, but you would like to experience communism, I highly recommend you to play this game.\n\n스팀게임을 하며 처음으로 남기는 부정적 평가\n\n게임 출시 한지 한달도 안됐을때 친구들이 같이 하자고 하길래 시작함\n게임 초기에는 크게 흥미를 못느껴서 한두달 하고 그만 둠\n최근에 다시 시작해보자 해서 약 한달 넘게 300시간 가까이 태운듯\nPvP 서버에서 시작했고, 총 인원이 3명이었기에 4명 부족 서버에서 시작하였음\n\n아무리 많은 시간을 태워도 큰 의미가 없는 게임\n중국인 핵 유저가 넘쳐남, 4명 부족 서버에서 다른 부족과 티밍해서 쪽수로 밀어붙이는건 기본이고, ESP, 순간이동, 활 연사 핵 등 \nPvP 의 재미요소를 반감시키는 핵들이 판을 쳐도 운영진은 방관만 할 뿐, 대처를 안함\n증거를 제시하라고 해서 녹화까지 하였으나 본인들의 안티핵프로그램에는 잡히지 않았으므로 문제가 없다고 함\n이정도면 로그도 못딸정도로 개발진의 역량에 한계가 있는것인지 의심까지 듬\n대부분의 게임이 부정프로그램 사용한 유저를 신고했을 시, 개발진이 조사를 해서 핵사용을 잡아내지, 유저들한테 핵사용한 증거를 가져오라고 하진 않음, 하지만 놀랍게도 이 게임을 유저에게 증거를 요구함\n다른 유저들의 부정적인 평가를 보면 금방 알 수 있을 것임\n\n운영진이 핵을 방관하는 게임, 그 외에 많은 발언권들이 운영진에 의해 제한되거나 무시당하는 경우도 빈번함\n본인이 민주주의 국가에 살면서 공산주의를 경험하고 싶다면 추천",
      "voted_up": false,
      "votes_helpful": 32
    }
  ]
}