{
  "positive": [
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☐ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond",
      "voted_up": true,
      "votes_helpful": 114
    },
    {
      "review": "I loved it! The city resize is a huge improvement and it makes everything feel more alive. The new gameplay dynamics are refreshing, and the story is great. The visuals and animations look amazing, and swinging through the city is still super fun.\n\nOn the downside, the game feels a bit short and the side missions get a little repetitive. I hope they improve that in the next game. Something I’d love is the ability to go inside the subway. That would be awesome. Also, there are only a few achievements and they’re not very challenging. It would be great to have more achievements or harder ones to unlock.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "The Spider-Man games have been some of my favorite games to play on my Steam Deck! \n\nThese are my personal favorite interpretations of Peter Parker, Mary Jane Watson, and Miles Morales.\n\nThe gameplay is slick and responsive, which is how I like to feel when playing a superhero game.\n\nThe story is heartbreaking and beautiful at the same time. You feel for All these characters as they have to grapple with responsibility and trying to not lose themselves. \n\nAlso - hot take - I love the MJ side quests. I found them to be a nice break in between the constant fast paced action throughout the games. \n\nIt provided insight into MJ's work and how even though she doesn't have powers, she's still just as much of a hero as Pete and Miles. \n\nMy only complaint with Spider-Man 2 is it's hard to make it run well on my Steam Deck without lossless scaling. \n\nNot a deal breaker, just something people new to the games should be aware of. \n\nOverall! These games are great! Give them a chance and you won't regret it!",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "This is a hesitant recommendation. Only get it if you have a device strong enough to play it. On steam deck, it drops down to 15fps regularly, despite being \"Verified.\" The game is quite fun otherwise.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "[h2]Sequel Swings Higher Than Before[/h2]\r\n\r\nReally enjoyed Marvel's Spider-Man 2, swinging as both Peter and Miles was pure fun with seamless switching between them. The removal of tedious crimes from the first game cuts down on repetition, and the side content feels solid and varied. [b]Tweaking with gadgets is heavily nerfed compared to previous Spider-Man games[/b], though still viable in combat. It’s a little sad there are no DLCs like the first game, [spoiler]but the hints teasing Carnage keep things exciting for the future.[/spoiler]\r\n\r\nI only hit minor stutters with no major bugs on my setup, though a friend dealt with T-poses and characters breaking into weird poses. Overall, [b]it's a strong sequel with great traversal and combat that really nails the superhero vibe[/b]. [u]7/10 — worth it for fans.[/u] :D",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Excellent game and great gaming experience. Visuals are absolutely superb and immersive, movement and combat are very fluid and satisfying to perform, cutscenes and action sequences both deliver an exceptional cinematic experience. The story is actually pretty great, and side missions are mostly interesting and worthwhile.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I can say this is the best game in the Marvel’s Spider-Man series. This time, being able to play both Peter and Miles adds a lot of variety to the game. The new symbiote powers, improved web-swinging, and more detailed combat system are really satisfying. Performance met my high expectations, optimization is good, and the city is bigger but still runs smoothly.\r\nThe story is perfect, it is very dramatic and full of action, and having control in these moments is amazing. Switching between the two characters keeps the gameplay fun and fresh, but I wish Peter and Miles had more interactions with each other.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game genuinely captivated my wife and I like no other game has this year. It's been done to death, but you really do feel like Spider-Man. I wish the final act was more fleshed out, but for what we have, I loved it to bits. Venom was better in Spider-Man PSX, but it's hard to top perfection.. I still adored him, and it was a beautiful, emotional ride. Can't wait for Spider-Man 3!! Carnage & Green Goblin are gonna rock.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fantastic game overall - very solid 9\n\nIf you have played the first game and liked it there's a solid chance you will enjoy the sequel too.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The main story of the game is B-movie gold. 'Ultimate Russian jungle hunter is so tough and bored that he seeks a real challenge and goes with thousands of crew members and billions of dollars of tech to new york city to fight spider-man and villains'.. The more you think about it, the less sense it makes. I kept waiting for some twist that it would make more sense but it never came. \nThe last half of the story is more familiar spider-man lore with venom taking over the city and causing a rampage. Slightly better but very familiar already. Actually, i liked to play as Miles most as he was doing tasks for his neighborhood and community.\nThe gameplay is great tough. There are so many ways to approach combat that you actually forget half of what's possible. Somewhere near the final boss i remembered i can actually shoot webs during combat, which i didn't do since the tutorial... All in all it's a good game, but not amazing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After all the patches, performance is still not that great...barely playable on steamdeck\n\nBut the game is overall good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Spider-Man 2 is everything I wanted from a superhero game.\nInsomniac refined the formula to a point where swinging through the city feels almost meditative — smooth, fast and incredibly satisfying. The combat kept the rhythm of the previous title but added just enough depth and variety to stay fresh the whole way through.\n\nThe story surprised me. It’s emotional without being cheesy, and both Peter and Miles have strong, distinct arcs. The pacing is tight, the set pieces are huge, and the performances are top-tier.\n\nVisually, the game is stunning. The city is denser, more alive, and the transitions between cutscenes and gameplay are absurdly seamless. It’s one of those games where you stop mid-mission just to appreciate the skyline.\n\nIf you enjoyed the first game and Miles Morales, this one feels like a true evolution. Not perfect — a few side missions are hit-or-miss — but the highs are really high.\n\nEasily one of the best superhero games ever made.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game elevates everything that was fantastic about the earlier games. It feels faster, smoother, and more vibrant than ever to swing through New York. Both heroes have memorable moments thanks to the emotional, passionate, and well-balanced dual stories of Peter and Miles. It truly seems like a playable Spider-Man movie because of how exciting and heartfelt the Venom arc is. The world is rich and immersive, the combat is more dynamic, and the outfits are amazing. As a lifelong admirer of Spider-Man, I couldn't stop grinning at this game. It's the best Spider-Man experience, not merely a sequel. 5/5",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "GG Good Game. Runs well on Steam Deck. 32 hours to 100%; shorter than the remastered, double the Miles Morales",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "wat a game ... i really love the action and i have enjoyed a lot while playing this game and i remeber back in 2010 i used to play a spiderman game .",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Anyone who liked the earlier Spider-Man games will enjoy this one. The city is bigger and looks great. Combat feels smooth and the movement system is easy to get into. The gameplay stays fun and the black suit story has surprising intensity, even if the overall game is a bit short.\r\n\r\nThe main drawback is the Adidas collaboration on the Miles outfit and his very generic Killmonger style haircut, which feels awkward and out of place.\r\n\r\nOverall it is a strong entry in the series.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is amazing! Excellent support for PS4 Dualshock controller, complete with vibration and partial pressing of the triggers being recognized. It feels just the same to me as playing the first two games on the PS4. Even on my modest rig I can swing around the city at 30 FPS and fights are around 60 FPS.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a better spiderman game what can i say",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game was smooth and good graphics.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think gameplay wise, this sequel is better in every way, compared to the first and the Miles Morales game.\nSome new ways to traverse the city, and a new mechanic for stealth gameplay.\n\nThe story is just a tad worse than the first game, maybe the 3rd act should have had a little more time to breathe.\n\nI liked the pick of villains, but like in the other games, I am not a major fan of the design decisions for them.\nI think it is a little to \"armory\" and too \"monster\"-like. I would have preferred a little more comic book accurate designs. But that is a nitpick.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, good story, awesome, u might wanna use controller tho, cooler keybinds",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fighting, atmosphere and overall gameplay is good, but the story.... oh man, it's so bad. Motivation of half of the characters is so dumb I just can't believe it. MJ particularly pisses me off, trying to act Rambo. I understand there should be a strong woman in game, but the risk she takes for an ordinary journalist is so insane and stupid, not to mention having a gun that K.O. with one shot makes me think why spiderman has to kick guys at least 5 times instead of using a gun? Also where the hell police and army are during multiple invasions. I guess let the almighty spider-mans do all the work.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the only games that I have ever 100% completed, that should be enough said. But, one of the best single-player story mode games I have ever played. The pacing, gameplay, everything was just pure bliss. Builds on every mechanic that was in the original and Miles Morales but takes it to the absolute max. Some of the best 26 hours of gaming I have ever had...",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you like Spider-man, marvel or even just superheroes this game is for you and it doesn't only capture the action the Spider-mans get into but their personal life two, it is definitely one of the most detailed games I have played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I liked it quite a lot especially the Venom parts. Definitely worth playing. The first game blew me away and my expectations were definitely too high. This game is great but I was honestly a bit disappointed in the story and gameplay improvements. \r\n\r\nThey made a few nice improvements to the combat and web swinging, but they removed all my favorite gadgets. I'm not interested in the web-wing gliding or the mechanical spider arms either, so I really only felt like I was playing a sequel when I had the Symbiote powers. Also I really wanted them to improve the parkour, wall crawling, and stealth, but they let me down hard in those aspects. It didn't really feel like a full, finished sequel when you look at the first game combined with all it's DLC.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Thanks Sony, for delivering something a year late, and under-developed.\n\nStill a good game tho.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pretty epic. everything was great until they hit us with the miles suit. Do NOT let bro do his own thing. And i hate that they put the branded adidas or whatever shoes in the suit as well like I don't mind them having a store in the city like that makes sense but now you're just screaming at me BUY ADIDAS SHOES THIS IS A PAID PRODUCT PLACEMENT. anyway good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Eu pensava que não tinha o que melhorar no primeiro jogo, mas quando joguei o segundo, eles conseguiram melhorar o que não tinha como melhorar",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What an amazing game in every way.\r\n\r\nFirst the story. I heard a lot of people saying it would be subpar or worse than in SM1. I don't think that it's bad in anyway really. Liked it just as much as the SM1 story. It was really immersive and had lots of points where it made you emotionally attach to something. Lots of turning points and so on. I felt it was really good. \r\n\r\nSecondly the gameplay. It is very very smooth compared to SM1 and Miles Morales. The way the combat feels is great, traversal is great and the mechanics are great. The combat animations are so smooth and flowy.\r\n\r\nAnd lastly the technical side which I would say is the only tiny minus to the game. The game is clearly not optimized well to pc. The game struggles to load things fast enough so when traversing through the city with speed the fps struggles to keep at 60 fps and sometimes there's a 1 second loading freeze before some cutscenes but I feel like that would be fixed with more and faster RAM as well as better CPU. Otherwise when not moving at great speeds and fighting the fps is there up in the hundreds in 2K resolution.\r\n\r\nOverall the game is one of the best games I have ever played. I don't remember the last time I had a 12 hour gaming session without bigger breaks. The game just pulled me into the story so well.\r\nCan't wait for the final chapter in SM3\r\n\r\n9.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly I enjoyed every moment of this game. The Pacing is not bad at all, the story is engaging and fun, and this game definitely had more content than both 1 and Miles Morales. \n\nI didn't experience any crashes or any issues with game play on my PC. 10/10 recommend!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Brilliant Game! \n\nDon't get me wrong this is definitely the weakest entry for the three Spider-Man games, With the peaking being Spider-Man 1.\nIf You're looking for a relatively chill gameplay experience with a rich story, you'll love this!\n\n**Also if you're going for 100% on Achievements this game is stress free for that**",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I liked the first game, and enjoyed Miles Morales expansion but this one is just really good.\n\nThe game feels like it is finally fully fledged.\n\nKind of the same feeling I had between Arkham Asylum to Arkham City",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wanna give this a middle review cos the game is actually fun and I like the combat (though the first game was really good so the downgrades to this is shit)\n\nfirst things first the pros:\n\n-fun gameplay \n-web swinging is still fun\n-gliding is really fun too\n-combat is pretty good but could have been better\n-stealth feels nice\n-lots of cool costumes \n-decent amount of collect ables that feel fun to find \n-The Miles and Peter trandom team ups when free roaming and fighting crime is really cool\n-Miles' powers feel better than what they looked like in his over priced standalone DLC game\n-Symbiote powers fuck so hard \n-Main story is really well written and fun to unravel \n-Kraven and Venom are well written and are fun to fight\n-the Venom part is fun to play \n\nCons:\n-the majority of side missions suck ass and ruin gameplay flow (looking at you those 3 Friendly Neighborhood missions, the school missions and the the last half of the Museum missions)\n\n-too many side fluff minigames being passed off as \"missions\" (the plant genome minigame, the QTE rythme game etc)\n\n-MJ sections are a screeching halt to the flow and are not fun her stealth sucks and her missions drag\n\n-the models of the main three (Peter MJ and Harry) look like shitty uncanny valley cartoons (i fixed this by modding the cast of the Sam Rami trilogy into the game. They seriously looked better with their inihital release graphics on PS4) literally everyone else's default models look 100 times better\n\n-shitty writing for side missions (there's like 3 good side missions that don't try to be quirky consumer slop)\n\n-replacing most the broadcasts with that annoying \"hello fellow youth\" podcaster vs J Jonah Jameson was rough. She sucks as a character and is as annoying as that bad guy from the first game that live streamed spider-man fighting her fans\n\n-hardly any JJJ (Jonah is a central part of spider-man and needs to be in it more to make it feel like I'm spider-man)\n\n-Mile's friends (besides Ganke) are annoying as fuck (i really hope kids don't make quips every 2 seconds in real life cos holy shit nothing can be serious anymore apparently) \n\n-Peter Parker biking sections\n\n-having to play as a deaf grafiti artist instead of spider-man for a whole mission... wow what a hoot she's slowly crossing beams and I have to do the spray paint mini game from GTA san andreas but dumbed down.\n\n-the city stays damaged once u complete everything (this is a very minor complaint but i'd like to see the city be brought back to normal or maybe have the clean up crew company marvel invented be in those areas and we get some easter egg lines or lore dumps if u loiter around n listen to them work?) \n\n-one of those games where once you beat it there's nothing else to do even with mods (would be nice if these spiderman games had mod support so that we could make custom campagins like the elder scrolls games do)\n\n-the nexus mods page is dry asf with this game but of course the porn stuff stays up \n\n-and of course DEI. (it isn't an issue to me but the way things have been handled in the last few years when it comes to diversity writing it feels like we have fallen 20 years back when it comes to accurate and realistic portrayals of people who might be gay or a minority. The writing feels so in your face cringy like it was written by some old white dudes for a hip 1990s movie or sitcom. No one feels like a person they feel like tokens for browning points and that's more damaging than it is healing.)\n\nOver all I like the game its relaxing to swing from the webs and having two different play styles is great! I just wish the people who worked on the main story and the few good side missions got more say so in the script process for the other stuff cos some of this writing is so cringy i think i sucked my own asshole back up into my body from winching at the lines. Also never do the MJ sections ever again.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's okay, but the story doesn't feel as polished as the original or Mile Morales. If you want more Spider-Man, this is it. Unfortunately, there are still MJ gameplay in this... which felt unnecessary.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't know why but this game didn't keep me as hooked as the first game. For some reason too they undermine Peter way too much along the story.\n\nWebswinging is pretty fun as always, but for some reason whenever i use the highspeed winds I feel like i'm playing superman 64 instead of spiderman. The first game was just so fun to swing around new york, on this one I enjoy it still but I can't quite put into words why the game hasn't hooked me as much. Maybe its the time of my life that i'm in right now, when the first game came out it was at the exact time where I could just enjoy a game like this.\n\nCombat feels pretty good still, but I feel like the more arkham combat of the first game was more fun? the super powers of this game end up making me play cooldown management instead of styling on my enemies with the kit.\n\nStory was fun, but i felt the pacing not keeping up after the kraven arc.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand the hate on the story. Sure, it all happen fast etc. but the game feels like a movie which I really like. The gameplay is amazing, story, visuals, soundtrack... it's all phenomenal. A lot of spider suits for both spider man. Stan Lee would be proud. Go play it :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a very fun game but fyi you might have some stutter cause i do it might just be me but over all very fun game 10/10 i cant wait for a spider man 3 if there is top be on",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Visuals are stunning, great music and gameplay. Gameplay is even better than the previous games. Story is also decent, not as bad as some are saying. Having a great time playing this game. Optimization is also almost perfect now, did not noticed any huge bugs or crashes. Free roaming and Swinging around the city is the best part of this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I waited to buy this game not only until it was on sale but also because at launch a lot of people review bombed it saying it had horrible performance. All I know is since I purchased it and have played the little I've played of it so far it has run perfectly fine for me and I have not encountered any issues. It's been a blast so far, I have always been a big fan of the Spider-Man games dating back to the super nintendo days",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Story starts off spectacularly, starts to feel rushed at around the 50% mark, but ends off well. Overall, the game is worse than the first game, but does improve fairly largely on combat, even improving the spectacular web-swinging from the first game, and brings a fairly substantial expansion of the map. The graphics are improved, although performance is disappointing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good and quite captivating story with a lot of emotional moments despite feeling a bit rushed at times, the fights are great but some of the boss fights can get pretty repetitive with the whole \"empty their health bar>cutscene>boss gets back up with 1 new move and full health\" being repeated 4 times in a lot of major fights. In my opinion the suits are kinda meh compared to the first game. Story is very long and the new gameplay features (combat and movement) help make the game feel considerably faster and smoother than the first game. Despite my few gripes as far as some of the bosses and enemy encounters go probably my biggest issue with this game is the optimization, i have quite a beefy pc but i’m forced to play on medium, granted they have improved since release but it’s still sub optimal. I would recommend this if you enjoyed the previous games. Maybe wait for a bigger sale, though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played in November 2025, and it ran nicely for me. A handful of very minor issues, but nothing egregious. If you've been waiting because of the poor performance press on launch, now may be a safe time for you to buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having waited a year or 2 from when it first released on PS5. I kept my eye out for it and then one day it finally came to PC, having played the first and Miles spin off game I have to say it was the cherry on top finally getting to experience the infamous black suit with todays graphics was a real treat. \n\nThe games mechanics are always a breath of fresh air from the other FPS or even AAA action adventure titles out there but if you've played the others it's not to dissimilar but this time with a few added extras to keep you going but it's a Spider-man game so that's already a 10/10.\n\nThe story has a uneven flow with bits feeling a bit slow and others feeling too fast, along with the side activities some are great but obviously copy and paste, others are a bit boring and I found myself rushing through it just so I could move onto something a bit more exciting.\n\nThe graphics are amazing as to be expected, I've seen some saying about performance issues. I had a few crashes here and there so it is something to think about but for FPS I don't remember ever having mega frustrations with it however todays updates could have made things a bit different.\n\nOverall It's a great game and if you're a Spider-man fan it's a must have. maybe not as good as the first but it's still pretty damn good. \n\nIf you're on the fence about it just buy it and if its on sale even better! it's definitely worth £50 so anything under is a bargain!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "have to say I'm really impressed with how much the gameplay and just the game overall has improved since the first and the Miles Morales side game. bit disappointed that the Carnage DLC was cancelled but it was still nice to see a cameo from Kasady in the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Spider-Man game out there. The gameplay is super fun, the story keeps you hooked, and the graphics are absolutely breathtaking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W game, insane graphics, crazy movement,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good story, graphics are good\n\npc port sometimes crashes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great the action is great the story is solid everything you should expect from a Spider-Man game so excited for the next one and it was so worth the wait for it to come to pc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this was a gift an so far its been an amazing time 100% recommend it for anyone looking for a good combat an story game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game with a pretty solid story and character ark. MJ missions were kinda slow in contrast to Spider-Man, But there was a goo mix of Peter solo missions and Miles solo missions. The story suits are hot garbage but there are some off color suits that rock the games cosmetic library. If you are only going for the 100% then there is about 40 hours of gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is more of the first game and that you already loved. It does feel like a \"middle child\" game looking back b ut its alot of fun. Game is fun to run on powerful hardware and swinging will always be fun. 9./10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is definitely my favorite of the 3 Spiderman games to date. Its can be easy and story based if you want or it can be a challenge for when you want one. The achievement grind is simple and beginner friendly. Iv personally 100% the game both in the story and the achievements and would very much recommend it to others. Besides it is Spiderman how could it not be good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played all 3 games, best 1 so far. semi glitches in the cutscene but nothing crazy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game/Series and its previous entrys. they are fantastic and i cant recommend getting them enough.\n\nThe only problem is them having some memory problems/Needing to have up to date Graphics Drivers no exceptions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this and spider man 1 are probably my favorite solo story games of all time. near flawless execution for both. admittedly you can tell that this one is rushed, but still a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely one of my favorite games. Loved how there was always so much stuff to do, but it wasn't all dry and boring. I was able to stay engaged and almost 100% the game, I just have to go back and do it all again in New Game + to get the last achievement.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not even 3 hours in and it's already one of my favourites, i remember the bliss of getting the first game and playing on the playstation 4 when christmas came, hopefully the third one will be even better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i got this game today and already played 5 hours swinging and spamming the same two buttons everytime is fun and you can even play on xbox controllers 10/10 recomended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoyed the first Marvel's Spider-man, this game is a direct improvement upon that game. Improved travel mechanics, continuation of the great story, improved combat mechanics, larger game world. Whats not to like?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story could have used some work and feels rushed but the gameplay, design and everything else is peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My Honest Review (After 3 Hours of Play)\n\nThe graphics are great—9/10, pretty solid.\nThe gameplay is insanely good—9.5/10.\nThe main story is already a 9/10; I’m really feeling it.\n\nHowever, there’s one thing I don’t like. The game (as expected) has a few bugs, like with the models and other things. For example, after completing a mission, the buttons disappear, and all you see is the character and the environment, which is a bit odd.\n\nBut overall, after playing for 3 hours, I’m really enjoying this game. It’s definitely worth the money.\n\nP.S. I’ll update this review once I finish the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game. Combat is fun and the story is enticing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favourite spider-man game from the series just because it has both of the spider-mans in one game and also has venom which i also like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game\r\n\r\nPros:\r\n\r\n-best swinging in any Spider-Man game which I never get bored of\r\n-Good story\r\n-Amazing graphics\r\n-2 Spider-Mans\r\n-Fun side missions\r\n-So many good suits\r\n-Symbiote/Anti Venom powers are very fun to use\r\n\r\nCons:\r\n\r\n-Story felt a bit rushed after Peter got the symbiote suit\r\n-Random FPS drops for no reason (mostly in cutscenes)\r\n-Resolution is not that good even tho I have it on max\r\n\r\nI would still really recommend this game, I've heard a lot of people complaining about the game not running right.\r\nIf that does, you can change the launch options or look up for a tutorial but you can also refund the game if you don't like it in general.\r\n\r\nThanks for reading and have a nice day!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story, great interactions. Lot's of attention to detail, running through the game in NG+ to gather everything because it's just so enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10 i gave it this rating simply because there were some visual glitches during some later cutscenes but overall the game was fantastic and played very well on my pc i have a ryzen 5 5500 and a geforce RTX 2060 super.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, amazing graphics, and so many different quests I can't count. Miles and Peter have such different play styles, with storyline to match. Only downside would be the not *infrequent* glitches and crashes, which made gameplay slightly less smooth. Overall, Spider-Man 2 is a amazing game, and well worth the money. Fans of Hogwarts Legacy and Legends of Zelda: Breath of the Wild/Tears of the Kingdom will adore this game. Total: 9/10!\n\nKeep up the great work Insomniac!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is pretty good i would say a lack of main side quest villians kinda brings the game down a bit but so far i love everything else about this game wish there was dlc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game blew the franchise to the next level, I’ve played all the Spider-Man games and this one is the best, story is excellent, a lot of twists and turns much like the former games, it just never turns out as you expect, gameplay is quick pace or gives you the feeling of quick pace and really gives you a taste of what is it like to be the Spider-Man weather it’s original Spider-Man or new Spider-Man. I could go on how good this game is but I’ll be writing a book at this point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Runs fine, despite some reports to the contrary. Strong narrative, directing and set pieces. The only weakness is a convoluted controls and less smooth combat than previous titles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoyable gameplay, great story, all round 10/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just to get it out of the way, yes, spiderman 1 has a better story but that doesn't mean this game is bad, infact this game is really fun, the combat and traversal are both so much better, \n\nThe combat has tons of variety now with the inclusions of different skills for both peter and miles, making it way more engaging.\n\nThe traversal is honestly amazing, yeah the web wings do sometimes end up feeling like you're just flying through newyork like superman but it's still really fun, not to mention insanely fast.\n\nThe story is decent, it definitely could've handheld both venom and kraven better, but overall it's fairly decent.\n\nThe MJ sections are WAY better and more engaging, I still don't like that they exist but hey they're much better here.\n\nThe stealth however has seen a downgrade. The removal of the various gadgets for sure harms the overall gameplay \n\nThe biggest downside of this game is that it is horrendously optimised, you WILL have to tweak with the settings and pagefile size with this game to just get it running smoothly on lower end hardware.\n\nTo conclude my thoughts, it's a good but horribly optimised game, and seriously insomniac, no DLC? \n\n7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fire game have beat it it 3 times still not bored wish i could get acheivement  for max diffuclty completation like old game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game! 100% it just yesterday. if you love story missions or just hangin around its for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like the first Marvel's Spider-Man game, this game has built upon a pretty solid foundation. The results are a better combat system, means of traversing around NYC, and enemy types. While Spider-Man 2 doesn't do anything genre-defining or subversive, what it does do is very well and you can see how much passion Insomniac Games pour into this game. I personally found the story of Spider-Man 1 to be better crafted than this title, however. It doesn't make Spider-Man 2's story less emotional and found that it had higher narrative beats especially with Miles Morales' struggles. However, I felt it was a lost opportunity to develop Harry and the symbiote, given how impactful they were, as Venom, to the story and the friction with the rest of the cast. \n\nI do like Dr. Octopus and the set of villains from the first game more than Karven from both a narrative, gameplay, and motivational perspective. However, I found Venom to be very imposing and I wished he had a bigger presence throughout the story, replacing Karven, rather towards the end. A feature I did not enjoy about both Spider-Man games is the gameplay segment with MJ and her stealth mission, as you really got to suspend your disbelief and it feels bad to go from playing as Peter and Miles to MJ. Overall, I had a great time with Marvel's Spider-Man 2, especially as a fan and give it a 8.5/10. For the price I paid for it, I definitely got what I paid for and would recommend it to anyone looking for a fun superhero game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great but leaves a lot to be desired after completing the story. The overall story is good even without the added content that the first game got with its 3 dlc stories. Using an Xbox controller to play had me feeling like my inputs were delayed or ignored at times. Not sure is this is on the game os the hardware though. All in all I recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great experience you can be casual gamer or a competitive gamer (like me) and you will have a great time playing this also you don't need to play the other games but you can, but i think you should but you don't have to and you still will enjoy this game. hope you liked my comment and have a great day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly the most amazing sequel you could want to the first two games! I loved both Spiderman and Spiderman: Miles Morales, where I found that Miles Morales allowed the development team to build and riff off all the cool tech from the first game. Now, with this game, they took that philosophy to another level! \n\nIf you loved the first two games, then this is the ultimate progression for what they could be! Essentially every system from items, to traversal, to combat has been updated and more fleshed out to fit even more playstyles! Not to mention, the environment design and game are simply beautiful, with pretty awesome performance. I cannot say enough good things about this game, they absolutely blew it out of the park!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a bit short story from the last game, but i still love it plus the new mechanics feels fresh from the first 2 games, but it still lack of content for example repetitive side mission. But overall, its fantastic especially you're a spiderman fan",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a great game, but the part where Peter looks at the different research projects in the building is the most tedious thing in gaming. Take that out and this game is a 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been a Spider-Man fan since I was a kid, and I always dreamed of a game with an open world, great web swinging, and enough detail to really make you feel like you're inside the suit. For me, this is a childhood dream come true. The best Spider-Man game I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think the story was a bit short. The OG spider-man game had more side missions and mini games which I enjoyed. I also felt like the game was not as optimized and stuttered sometimes. Overall, good story, good mechanics, but not much different than the other 2 spider-man games. Hope there is a 3rd iteration with a longer story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing, story line, combat, visuals, voice acting!  You do not need to link it to your sony, or even have one to play it!  however the port is lacking a little bit but ill leave a positive review because it is playable with minor glitches.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ran like gnome in treacle. Then I found a little advice telling me to uninstall all the playstation garbage it installs in the background. No issues running it now and it is a fun game. Still hate the walky garbage stealth sections though ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great combat and traversal. Good variety in powers and combat styles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect balance of challenging and not too hard, creative story, looks pretty bad with a lot of visual bugging that is infuriating even on max quality. 6/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tons of fun. Familiar controls and characters from earlier chapters in the franchise and new exciting moves and added tasks build upon an already great model. Switching between Miles and Peter are a treat as well. I enjoy the diversity and mix of abilities making the game enjoyable for more than one run through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Epic story and gameplay. Big improvement over SM:MM.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its an ok game. i wouldnt personally consider it as a must have, but for what it is it is done good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Epic game finally Venom was implemented to the games only sad thing you cant play more of Venom it was so much fun recommend for any MCU/Spider-Man Fan",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very fun and addicting, love the part where you get to play as Venom.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Marvel’s Spider-Man 2 on PC shines with impressive visuals and smooth performance, making it one of the best superhero games yet. The dual-protagonist setup and expanded skill trees keep combat fresh and the story gripping, even if minor technical hiccups and pacing issues appear near the end.\n\nPros:\n\nGreat story and characters\n\nFun dual-hero gameplay\n\nStunning New York setting\n\nNoticeable graphic improvements\n\nCons:\n\nOccasional performance drops\n\nSlightly rushed final act",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've always wanted to play Spider-Man but never owned a PS5. I recently go a PC gaming desktop and it was the first game I bought. It is definitely worth every penny. Extremely fun with lots to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved it. A bit short but an improvement in speed and flow from the previous titles. Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a little buggy, but not like before. Game is more stable then last patches.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing visuals and great storyline, however ran into quite a few bugs in my second playthrough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is well over hated. I get the story isn't AS good as the first game but it still has INCREDIBLE character development and world building. The game-play is also incredible I cannot get enough of it. Only flaw about the game-play is the fact there is no suit powers like there was in the first game. Pretty much everything about this game is an improvement from the first besides the story and a few minor bugs, though if you prefer more of an action packed story, you would prefer this. Solid 9/10 overall. 7.5/10 if I am rating it just on the story. First games story was just a 10/10 In my opinion and will be incredibly hard to beat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was fantastic.\r\nYou can replay it a good amount which is good.\r\nThe movements is good and fluid.\r\nDefinitely worth the purchase.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, 31 hours to 100% (except new game plus) and performance was mostly 60 fps at 1440 on a 3080. One part near the end of the game dropped but I was having an issue with my computer so I blame my cpu. After a reboot never had issues again.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Gonna keep this short and sweet - Spider-Man 2 is not a bad game. It is stunning, fluid, crispy, and is a blast to play to embody the Friendly Neighborhood Spider-Man.\r\nThe problem is the optimization. I have a decently beefy Rig (RTX 4070ti) and I have not once been able to keep a stable frame rate, constant pop-ins, stutters. Swinging too fast will cause the game to pause and catch up the loading process. Raytracing is still busted, and will not work. Tanks the game's performance whereas other titles I have played utilizing Ray Tracing run perfectly fine with rarely any issue. \r\nIts not a bad game, but the optimization is pure cheeks. Until it properly gets fixed (which it probably never will), this review will remain negative.\r\nIf you have any optimization tips, let me know.",
      "voted_up": false,
      "votes_helpful": 204
    },
    {
      "review": "After 2 masterpieces they f up with optimization on this one.. Its ok but not the same..",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "The writing is really rough, it asks you to suspend a lot of disbelief, but unfortunately it doesn't create an immersive environment suitable enough to allow you too. It doesn't help that there is just so much political messaging in the game too. Whether you agree with it or not, it being there for reasons other than story and gameplay is just constantly annoying and a part of why it's challenging to immerse yourself generally. It's a shame because the game feels and plays like a technical masterpiece otherwise. \n\nThe game would be a lot more pallatable if the cutscenes were skippable but unfortunately I can't recommend sitting through the dialogue.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game is not only dissapointing but very out of character in comparison to the other games in this franchise. From stupid gameplay changes to a slow paced story, this game is like getting socks for christmas.\n\nMy first 45 minutes in this game was figuring out the right settings because this game is insanely unoptimized. I read about it online and it's a big problem that even fulfilling system requirements does not save you from lags and many visual glitches. I literally had to google settings people made, to enjoy this game in a normal state but I still get frame loss during missions or on bigger maps. The AI upscaling made it even worse.\nThere are also so many bugs with character models in which they either get stuck or break certain animations. \n\nI kinda ignored these and tried to enjoy the game. \nI am here for the story, the cool fighting and other collectibles in the city. So I didn't cared that much.\nBut even this seemed too much to ask for because one tiny change, did so much damage for my experience personally.\nChanging the healing was by far the most unnecessary change of all time. You can only heal with a full focusbar now. \n\nThis is important because the fighting itself also kinda changed with the difficulty. Not only are there enemies which counter almost your entire arsenal, the snipers in this game shoot you faster and more often now. \nThe healing change is basically causing you, to not have a real choice anymore for actual finishers because now the need to heal is much bigger now. So you just smash buttons till the whole bar is charged, which takes so much fkn time to do so.\nThis entire thing just changes everything in terms of getting throu the story because you changed the entire pace of the game. Either you just spam abilities till you're allowed to heal or just dodge and hope you get by the 500 snipers that change their position every second. \nSeriously, If Spider-Man can stop a moving car with his hands, why can't he punch throu a shield.\n\nI love the last two games, even if it was becoming repetitiv in someway, you knew, you get to do stuff your way. Now your limited by the game itselft and you actually get annoyed when you have to fight. I just instantly knew, that backline enemies will snipe me to my death.\n I don't know why this was even necessary to change, the fighting worked so well in Spider-Man: Miles Morales and you just throw it away for the sake of being different. It feels like a major step in the opposite direction since Spider-Man: Miles Morales felt sharper and cleaner than the first game.\n\nNow to the story\nI am a huge believer that cutscenes are only important, if the intention is to convey information and plot. Anything other than that is just time wasted. Like when someone takes away your controller and you wait for your turn. The pacing in this game is really bad because the plot goes by so slow while the story missions itself change constantly between your gameplay and unskippable cutscene inbetween. They feel so shallow after some time because you just want to play and have fun while the game holds you back to show you something you forgot anyway.\nThe story had such a weak first act, I can't believe how much of a step back this seems. It want's to introduce so many character arcs, plot and story lines while failling to convey tension or emotions. I loved the last games for actually putting focus on a conflict instead of showing us so many potential conflicts in one first act.\n\nI also couldn't give less of a shit for Kraven because he has the character depth of a puddle. At somepoint I just wanted to get done with it because the game just couldn't go by faster. \nWe already know what his plan is but next to peter, you obviously have to change to miles now, because the game wants you to and have to play his character arc out which somehow has almost nothing to do with the main story. You get the feeling that nothing is happening, everything is stretching while you already know what Kraven wants, does and can do.\nI asked myself so many times when I get to do peter missions again to finally progress with Kraven again.\nIt only got interesting for me when we actually got to see Venoms influence and himself in his form which in my opinion took way to long. Like we got actual plot progession and tension after more than 60% of the story done.\nI was so shocked to see how cool this game can get after the whole boredom I had to endure. \n\nYou have to build your story and characters up, I get that but let's be real, Kraven had almost no impact that was significant to the story.  It could've been any other villain and I blame the very little screentime he actually had in the game\nHe kills many people that could've had a potential comeback to the games but it was made very clear, that this was never the intention in the first place. \n\nSpider-Man 2 want's you to understand that it's better now, it's so cool and has so many cool new features but totally forgets what made it fun in the first place. The moment you rather play side missions than continue with the main story, is the moment you have to realize you failed. \nI loved getting to play this series but feeling so tired of this one just made me sad man. Not every new installment needs big and new changes. Especially with core gameplay mechanics.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I have a 4060Ti and 32gigs of ram yet experience constant lag/buffering even in windowed mode and settings that prioritize FPS over graphics. Love the game when i'm actually able to play it but this is the laziest port i've ever seen. If you really want to play this game just get a PS5. Do better Sony and release this amazing character from your greedy ignorant clutches.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i bought spider man 2 when it launched and it horrible performance issues and i tried playing the game for 20 hours however once every 10-30 minutes my computer would overheat and shut itself down and after fighting it for so long i gave up and decided to wait for updates to come in. I reinstalled it a couple of days ago and it still overheats on low settings. This was never an issue for me before this game and i still havent had this happen outside of this game. i'd also say i have a pretty beefy computer as i have an Radeon rx 7600 xt and a Ryzen 7 5800x. i wouldn't recommend",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Okay, so let me say, first and foremost, that the game is fun and a solid sequel from the excellent first entry. BUT, even as a fan, I have to say that this PC port is terrible. If it wasn't for online tweaks and fixes, this thing wouldn't even run properly on my PC. I found multiple issues within these first three hours of playtime, these I'll list below:\r\n- Stuttering\r\n- Crashes\r\n- UI glitches\r\n- Game-braking bugs\r\n- Lighting glitches\r\n\r\nFor a full-price game AAA, it is completely unacceptable to have all of these issues after an entire year since the game came out. Thus, I CANNOT RECOMMEND IT unless you're willing to fix these issues yourself by adjusting settings and downloading code tweaks online.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game has been out for about 11 months and 10 patches now and its still completely unplayable i cannot finish this game from the lagging and loading as im swinging to just completely crashing randomly on me i hate that i have 28 hours on this and have barely gotten into the story and i wish i could just either have it fixed or get a refund so in conclusion save yourself the hassle and dont even bother buying in its current state",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was fun to play another Spider-Man game. However, this one felt like a large DLC rather than a full game. Took me 34 hours to 100% and will never play it again.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "To this day this is still an absolutely dogwater port. There are mods to fix some of the performance issues but even then cutscenes are frequently glitchy at best, and literally unwatchable at worst. There are no excuses for a company like Sony putting out a product this lazy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Disappointing how this games performance is. Frame drops like crazy even without Ray tracing. The story is lacking majorly as well. Pushing Peter to the back, rushed villains, pointless side content like playing Miles deaf girlfriend. What a mess Insomniac has done with this sequel. \n\nI bought this on console when it first came out and wanted to see the difference on pc but couldn't get myself to keep playing. The first game was good and then they completely lost their vision for spiderman. I hope a different dev gets to re-create these games who actually love and respect the character.\n\nI refunded the game. Not worth it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "one of the worst optimised games ive ever played, having to jump through hoops to fix constant stutters and frame drops on a 5080. really not worth the trouble",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have a \"mid\" PC so I don't expect much but when Monster Hunter Wilds runs way better with less frame freezes and almost 0 bugs I just have to call this the worst port ever. I'm playing the game on the lowest graphics possible, all other programs closed so this game is the only thing running and it still freezes if I move fast (which was never a problem on PS5). I ran into multiple bugs where the game just dies and doesn't load anything at all or it just breaks so either enemies don't spawn, I can't move or the action to trigger the plot to progress just doesn't activate.\nI had to force close the game 3 times so far and it crashed at least once. (I never ran into anything like this in the previous Spider-Man titles)\n\n The only reason I'm suffering through all of this is to get 100% like I did with MSP 1 and Miles Morales. If you really want to play this game and have a Playstation, I recommend you play it there.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Im just going to be honest this game on the steam deck i feel like it needs more work before even putting it on the steam deck plus spider man the first 2 game played amazing on the steam deck but as soon as we get 2 on the steam deck it looks bad the fps should stay lock on 50fps or 60fps but instead it drops down to 25fps and that not good I feel like they need to take it down and fix this game because this game should play well on steam deck but it looks bad like really really bad 👎",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game late 2025, expecting great things and a fabulas game much like the other Spiderman games from this line up. I made sure that my PC had the right requirements and it did so i bought the game as a late birthday present to myself. It downloads and i start up the game, I load it up and it crashes before i even see the loading screen. I figured my graphics settings were too high so i lowered them and booted up the game again. And it once again crashed. So, i lowered my settings, over and over and over will i couldn't anymore and it still wouldn't load. I tried everything i could find online as well as everything I could think of and it still didn't work. My time was wasted as well as my money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Spider man remastered is better and this is just extra content, not worth buying tbh you will not get the same feeling as the previous one.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I feel like I am not in control at all, just button mashing. Other reviews complain about optimization, but it runs perfectly on my PC. Others must play on potatoes. I just didn't like the linear feel of the skill tree, the fights, and the story so far.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Две тыщи ГРЫВАСЕЙ просто в ебучий МУСОРНИК за игру, в которую я играла ДВАЖДЫ тока чуть по другому. я не знаю, что вы там в своем сони ЕДИТЕ но шо, у вас ни у кого не было не отрофированного вкусового рецептора? Кароче я не то, шобы довольна, но и не то, шобы разочарована. Просто верила в лучшее и была за это НАКАЗАНА",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When it is updated and optimised so there is no lag, freezing and crashes it will be worth buying.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well, its a great game but the optimization is pretty bad unfortunately",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "while this game look great from the gameplay to the story i cannot in good faith recommend this pc port.\nIt crashed 2 times in the SETTINGS before i even got to start the game and after i optimized everything to work for my pc the cutscenes where broken with desynced audio, broken lighting and models going all over the place \n\nIf you're to play this game better get a ps5 otherwise it might as well be unplayable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was really looking forward to playing this game and swinging around New York again like I did on PS2, but the game is very poorly optimized and my frames were all over the place. My system is no slouch, so I was very disappointed with my experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super fun, when it works, unfortunately, this port has a lot of problems with lag, and performance, forcing me to play with the lowest graphics and it still stuttered",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game seems great, unfortunately it's just not optimized for PC. I was getting static on my screen while playing, which I've never had before. I've loved all the Spider-Man games, and this didn't seem any different, but I just couldn't play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game does not run well on pc. I have all above recommended specs and even on low settings still cant get a stable framerate and when in fights the stuttering makes it fully unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its. a noticeable improvement over. MS1 and MM but mainly in the gameplay department (graphics are pretty much the same, cinematography was better though). but some of the plot stuff is so abhorrent i have to take breaks to try to understand their thinking.(Haily-the deaf girl beating symbiotes on her own?) Peter is constantly punked and nerfed it's not even funny, and the best part about the story was the black suit part (which was entirely too short). speaking of which this story's got some major pacing problems.\nit became infuriating seeing peter never overcoming any of his problems and just relying on MJ and Miles after getting solo'd time and time again, \n\nBeyond the story there's the optimization, it took me a whole hour just to tune the settings right so i don't have white artifacts everywhere, but it ran okay after that. (I've got an AMD 7700 XT btw)\n\n(its a 7/10 at best) I wouldn't get it for anymore then 25\npretty decent to play in the background or to have at a party,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is great. Why do I not recommend the game you ask? I do not recommend this game because this game crashed so much. I optimized it so the game wouldnt crash but it still kept crashing. \nThe game is awesome but the port is bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Optimisation is horrid. Game is verified to be played on the Steam Deck yet when turning all the settings down i dont get more than 19-20FPS. The story continues on my pc, being much more powerful it still cant even hold a steady 30FPS in gameplay and cutscenes are like watching a slide show. I hope this game soon gets an update that fixes optimisation.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "caceta que jogo chato, o primeiro e o do Miles é mil vezes melhor que isso. A primeira vez jogando é ok, história mediana gameplay ok, a melhor coisa nesse jogo é o web swing, mas re-jogar no NG+ é chato demais, o conceito de re-jogar essa porcaria é basicamente os desenvolvedores esfregarem na sua cara o quão porca e ruim é história desse jogo, o quão chato e repetitivo é o combate e como as missões secundarias são um porre, as únicas boas são a do Howard e os pombos dele e a de achar um avô desaparecido, pq de resto é a coisa mais tanto faz que existe. Isso tudo sem entrar na questão técnica porque esse porte pra PC é uma porcaria, meu PC roda Red dead 2 e Cyberpunk sem problemas, mas essa bosta com fator gameplay é feita com tanta falta de amor e carinho que teve momentos difíceis pro meu PC tankar essa bosta, fico até triste de abrir esse porte merda merda na minha maquina pq diferente do pessoal que fez esse jogo eu tenho carinho pelo meu PC e pelos personagens do universo do Homem-Aranha. Dito isso não recomendo essa tentativa fracassada de jogo nem de presente, só se vc quiser gastar tempo jogando isso ou querer ofender o seu amigo com um \"presente\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "full of bugs, Peter sometimes acts like he is dumb af (out of character)\n\nFun gameplay overall, it is worth it at a big discount.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Glitchy trash, unplayable. Spawning into a tomb in game save that cant be reversed, waste of money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable on Steam Deck despite being verified. The game crashed while adjusting settings. Even at the lowest setting, the game crashed before I could hit the first button to swing. Also, wow, the graphics (at the lowest setting to start the game), I think the PS2/3 era had better character models. This game is way too old and way too overpriced to be in this poor of a state. The only positive aspect of this is that I can get a refund and watch the gameplay on YouTube.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played it on PC, only to realise it didn't work. I have no idea what its like now but I played it on PS5, I would honestly rate it a 4/10. Not really anything like I remember the last one being. Not the best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh.it's alright. the web wing traversal kills the cool factor of the webswing. it's not optimized for pc.plenty of bugs. some missions are tedious. the writing can range from good to cringy. not excited for the inevitable sm3 and how they will ruin the wedding,cause marvel entertainment is filled with classic MJ haters, and im not talking about \"bugs bunny teammate\" Jordan or  \"Thriller\" Jackson.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't even play the game because of how Buggy and broken it is. I was excited to play this one after I had finished both of the other Spider-Man games and then the broken characters and out of sync voices on the first cutscene, and then the game just goes to a black screen with the music still playing as if nothing was wrong while it tries so hard to run the actual game play. Not worth the money until they fix it, but looking at how much time has passed since release, it may seem that'll never happen unfortunately. I am VERY disappointed in SONY for this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thought I'd wait for it since the desastrous launch.\r\n\r\nRuns like shit on 3080RTX and i9 10850K 32ddr4 (and I'm talking 1080p without ray tracing and DLSS enabled!)\r\nFirst Spiderman ran really well compared to this.\r\n\r\nI'm not gonna talk about the story, it's not worth it.\r\n\r\nTraversal is dope tho.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Originally I wrote this review after dropping the game several hours in for many reasons but being a big Spider-Man fan I felt I had to at least give this game a proper try. I wish I didn't.\nWhat's to say that hasn't already been said? Many issues about the game are well documented via other reviews and the many videos on YouTube but I still need to express just how bad the main plot is. There are elements of good moments but they're grains of sand on a Sandman. So many questionable choices. One big one being Miles.\n\nNow before I continue, I'm biased. I don't like Miles, don't like how forced in Media he is, or his support group (except Rio, she's cool and Arron is alright) but he's the Rey Palpatine of MSM2. Peter is unable to do pretty much anything without Miles, even the personal battle of Spider-Man vs Venom, a fight which the narrative has made it a big point of it being about them and MJ, has Miles not only thrown into it, but saving Peter. Which by that point has become a pattern of bad writing. Of course we can't talk about the plot without mentioning Scream. Those who know, know. It's probably THE prime example of how bad the writing in this game is.\nThe biggest sin this game commits though is how badly they treat Peter. Parker luck is not only in full force but it's like he's wearing the Sonichu pendant too. If this Peter was in the first game, the helicopter scene would have resulted in a bloodbath. He's unable to do anything to the point where his greatest enemy in this game is a fridge (those who know) which doesn't make me angry, just depressed. What kind of tar do you have to have in your soul to hurt our boy Peter so bad?\n\nAs for the gameplay, I honestly feel traversal is downgraded. The swinging felt more fluid and natural in the first game, just slow. In MSM2 it feels nerfed to force the player into using the gimmicks like the boosts and webwings, it just didn't click with me like MSMR's traversal but that could just be a me issue. Then again I play as Spider-Man to swing on webs, not fly like Rico from Just Cause. \nCombat has a lot more depth, but way worse gadgets. I suspect it's to force the player to play with the new shiny toy powers instead, but the symbiotes make the combat feel like something glitched with how un-fun they are to fight.\n\nAs for everything else? The sidequests... exist? Nothing much to say about them outside of what they did to Yuri and how they ruined her. Costume's are just terrible and suffer from MCU syndrome of being way too overdesigned. Thank you modders for giving me actual decent options including porting over the first game's costumes. And as for performance? I haven't talked about it simply because it's THE most documented thing about this port. But the complaints are legit. Even my decent PC suffered from moments of freezing. \n\nSo that's my experience with MSM2. A game with solid bones, but missing the rest of the anatomy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ray tracing effects are still broken, lots of noise in rt shadows.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Why are games going woke? Why does every other character have to be LGBTQ? There is a mission to help one gay character ask another gay character to the prom. Not related to the story, no reason other than to press it upon people. Along with the stuttering and other glitches made the game less than thrilling to play. Do not recommend.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "does not remotely look like the trailers. what would have been a decent game can not distract me from the that the graphics look like trash in 5120x1440, despite it is supported. 2018 GOW can do it, unreal 5 is garbage, stop using it. refund requested.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I refunded this game after 30 minutes. This game is uter trash compared to the first one. The combat is strange, the story is trash, the combat movements made me feel like I'm playing a 2012 game. Also the first 30 minutes of the game looks like something from a Disney movie. Dont spend your money on this garbage :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game starts lagging and glitching",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it crashes and i have a 4080 super. i rather throw stones across a lake than this poorly poverty optimized filth. MLK had a dream and it ain't this smh.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It gets the big things right, but a bunch of things are holding it back.\r\n\r\nThe port is still very inconsistent. There's gotta be some kind of VRAM leak, because the longer you play, the more it uses. Sometimes, the frame pacing has a good streak (framegen probably helped with this) even when my overlay says I'm using 2.5GB more than my capacity.... There was a point where I turned all settings to low/no RT, at 4K, and it was still using 14GB VRAM. That's lunacy. The longer you play, the more the frame times tend to deviate. \r\n\r\nThe game does look better than the first one, but it's not worth the steep hardware price. Other games are being made today that look and run much better.\r\n\r\nDid Insomniac just forget about keeping their identities a secret after a while? Too many instances to list for this issue.\r\n\r\nI can see an argument being made that this game's world-building leans on identity politics too much. Miles has a questline where he has to find stolen musical instruments, and it just kills the plot for a while. The game often goes out of it's way to show you: \"Hey look at all of this inclusive stuff! They're important too!\" I'm not saying they don't matter, but it served as a distraction to the plot. \r\n\r\nThe dichotomy between the Danikast and JJJ is another example of this element of the game.\r\n\r\nIf that doesn't bother you, you'll enjoy the game more. But my issues with it ran deeper than that. Still 100%'ed it tho, one of the easiest platinums I've ever done.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Being forced to play as MJ ruins the entire game, shes the lamest playable character, shes by far the most OVER POWERED one shots everything and has infinite health regen but her gameplay is SO absurdly lame and boring. It feels so pointless to play spider man and fighting when MJ is far superior to either of the spider men",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So far i havent had any problem with optimalization. Also the story and gameplay is entertaining. However i am bit scared that peter and miles start kissing in no time. In short gameplay time (11hours) I already had two homosexual story lines. One in side quest, one in main story - fortunately not above mentioned example. I swear if there is another LGBTwhatever content i uninstall this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game crashes all the time. its fun.... when its not crashing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good gameplay and story but.... Woke Agenda.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bad story, cringe-worthy dialogue and full of far-left propaganda. Only redeeming quality is semi-fun combat and web-swinging mechanics. Nobody wants to play as MJ nor Miles' deaf GF though. Nobody ever picked up a Spider-man game to play those characters.\r\nAlso the voice acting is terrible.\r\nMJ's model looks nothing like the first game. Looks more like the head writer for the game. Weird, huh? Self-insert much?",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "still have bugs. Good main story but dissapointed side mission. I can see the shadow of arkham knight in it but worse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’ve been excited to get this game on PC for a long time now. I picked it up the other night, and it played well for about the first mission (taking down Sandman), but after that I ran into an audio bug that makes Peter or Miles sound like they’re in a cave—full of reverb/echo. Even when your character is inside, the New York street noise is so loud you’d think you’re standing in the middle of the road in downtown NY. I can’t hear what NPCs are telling me; it’s completely unplayable. I’ve struggled to fix this game for about 4 hours. I hope Steam will help me out and refund it. What a shame—this port is just awful. Save your money; buy a different game. Also, I do not have a potato PC: RTX 5080, AMD 7800X3D, game on a Samsung 4TB SSD, so I don’t know what the problem is. All drivers are updated; no other game I own does this, but Spider-Man 2 does.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I loved the first Spider-man and the Miles Morales follow up, but I am not recommending this game.\r\n\r\nThe problem is, now there are two main characters, with their own super-powers, and they switch up a lot. This mean, that half the time I did not remember which keys activated which powers, and had a hard time beating the enemies.\r\n\r\nAlso, even though you can turn this off in the options, it wants you to press some keys that you NEVER use, like J, K or L, in quick time events. Way to go to make me lose out on getting those right!\r\n\r\nThe story ... some moan about it, but it was fine, although the ending boss fight dragged on through way too many stages to stay interesting. I actually thought about giving up and uninstalling on the third stage.\r\n\r\nAll in all, I think they missed out on making this game the best they could, but like I said , I loved the first two.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Optimization Issues... and really woke Story and Character Designs!\n\n0/10 - No Fun allowed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "as soon as i have to play as MJ I uninstall. this game is called spiderman not...mary jane.\n\nwoke propaganda.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This one has all the bells and whistles and almost perfect detail unfortunatly swinging around with that many pixels is the death of your frames. Untill either I get a better PC or they figure out how to use less polygons ill put this one on hold.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another lame WOKE propaganda by Sony. Extremely boring and repetitive.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Its not the best if your gonna buy a spiderman guy buy Spiderman remasterd or miles because this one lets you do less and MJ looks ugly they did a massive down grade theres alot of bugs they can make a comeback but it will have to be a big one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "runs well but has a hard time booting up sometimes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful new york inspired 3D painting which you run on top of doing activities in a manner either to your taste or not.\r\n\r\n* Great looking background visuals.\r\n* Strange looking characters, as if the publisher lost the IP to the comic character art.\r\n* Same 2-3 mob group spawning over and over in different parts of the map, be it radiant events (rendom generated filler mobs to slow you down) or part of the main quests. Same thing over and over for the most part. Recycle, Repeat.\r\n* Dialog written by retired corporate accountants. Bland, tedious attempts at infantile quips, about nothing. Not even attempts at jokes. Nothing to make you even bend that corner of the mouth in \"Ah, ok, this was supposed to be funny\". Or \"I see, this was supposed to be serious\" for that matter.\r\n* Forced to go into a menu to skip the poorly written tripe, [b]each time[/b].\r\n* Lots of QTE events. But on a positive note, there's a setting for just holding down a button for [i]some[/i] of them to save the controller from wearing out.\r\n* Combat controls of the kind press A + LB + pause for 123 ms, then press LT + up, touch your nose and cross your eyes while repeating \"She sells sea-shells on the sea-shore, the shells she sells are surely sea-shells\" and then press Y + X in a very specific timed interval to throw anything but a straight punch.\r\n* If you crave being stuck behind scripted avatars that go on and on about nothing for 5-10 minutes at a time, dragging their feet at snails pace while you're locked into following them, not able to run past them or away from them, then check, this product has you covered in abundance.\r\n\r\nPerhaps it's a sandbox that's supposed to be played with muted audio and your own background music in very short increments of 15 minutes per week, assuming you have a gopher memory, so you forget you already played the same loop before. That way the repetition might be less of an issue or at least less in-your-face.\r\n\r\nNot a title resonating for me. But if you appreciate the above core pillars and mechanisms making up the title, then it may be for you.\r\n\r\nNow go read some other reviews as well, and [i]then[/i] make your [i]own[/i] synthesized purchase decision.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It says verified on Steam Deck. This game is not playable on steam deck",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "gay fag game with gay fag mission that cant be skiped.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS THE BIGGEST DISAPPOINTMENT.!! There is no optimization even with i7 13th gen RTX 5060TI in medium settings. The performance is all over the place, and story is just terrible. This game made me write my first review in my life. The first %35 is nothing but messing around. Doing pointless  tasks that makes you fall asleep. It doesnt build tension, it doesnt develop characters. You just run around doing meaningless activities. Then the game turns into a budget Elden Ring wannabe... But here is the problem; even Elden Ring does it better. Because at least game is built around boss fights. This one? It's just the boss or their small copies. Cut> Boss fills HP> Cut again>Boss fills HP>Cut again> Boss fills HP>Repeat... Thats not creativity its lazy design. It honestly feels like developers had no idea what to add. so they padded the game by forcingbosses to refill their hp so you can cut them again and again. Its repetitive, boring, and frustrating for all wrong reasons. I do not reccomend to anybody. Dont let anybody yoy care about to buy this game. It is not worth the money. Even if it becomes free. Dont waste your time. Worst game Sony released to date. Literally makes me die sooner.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is honestly poorly optimized. Simply moving the camera lags the hell outta the game. If you can afford it, just get a Playstation and get the game from there.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a great game but its terribly optimized for pc, constant crashes and bugs and framrate issues. The gameplay is pretty stale as well aside from the story, to compare i have about 70 hrs on the remastered version replaying newgame plus because i could actually enjoy the game whereas here after one playthrough i dont feel the need or want to go through on ng+ because of the constant issues and the stale combat system. The game gets really boring even when it does run smooth because the combat is so boring compared to remastered.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game runs at the worst possible quality imaginable on Steam Deck. Refunded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The most unoptimized game I've ever played. I've tried everything and the game still stutters. I bought this game looking at the reviews thinking that they have made a change but clearly not. Even with an RTX 20 series and an I7-10700 the fps stutters are horrendous, can't go 2 seconds without the game lagging for 30 seconds and during game cutscene, the lag is so bad with textures not loading and dialogues being unsynced. If you have a similar pc build do NOT buy this game it is genuinely a waste of money. It's a shame since I loved Spiderman 1 and Miles Morales, The Miles Morales game worked perfectly on my PC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Oof, I saw the technical issues talk when the game first released and figured it would be better now almost a full year later. It is not.\n\nThe framerate is actually pretty stable for me, but I have a very high end computer. There is just an inexcusable amount of bugs for this though, its a pretty abysmal port. Almost every couple minutes some bug will happen that causes my controller to non-stop vibrate until I change focus or mash buttons, lots of texture and lighting glitches and flickering even after fiddling with my settings, and I've had more than one hard crash to desktop. I just gave up and refunded, I'll play this on Playstation because the game itself feels fun but this is a really bad port.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Would be an amazing game if the Devs took the time to bug test it before rushing it out the door. There is no excuse for the game to crash this much, and quite literally nothing can be done to prevent it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty good game, better gameplay then the first, though the story is a lot messier and less engaging. Especially in the second half. \n\nOne of the best FSR Frame Gen implementations I've ever seen, very little ghosting. Unfortunately the game is also kind of unplayable without it. Running on an RX 6750XT, Ryzen 5 5600x, 32GB of ram, and an m.2 SSD. Basically slightly higher spec then the PS5, and yet the frame rate tanks to 45-50 fps when swinging/flying around. And the performance gets even worse in the second half of the game. especially when fighting Symbiote enemies.\n\n The Screenspace implementation is pretty bad, and it has no cubemap refections to fallback on when ratracing is disabled like in previous games, leading to glass reflections actually looking worse then they did in the first game. \nWater reflections seem to be entirely broken. It constantly reflects stuff it shouldn't reflect, or will reflect your character even though you are way to far away to actually cast a reflection, and has a massive gap around your character when swinging over things. So essentially, reflections are super broken if you don't use raytracing, and if you're using a pre 7000 series AMD card, you are kind of forced to. Which is kind of ridiculous in this scenario seeing as the PS5 uses an AMD GPU (equivalent ish to a RX 6600).\n\nCannot recommend unless it's on sale. \n\nJedi Survivor performs better than this on my PC, and that game is broken as hell to its very core.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wish I could give this 2 thumbs down. i played and loved the first 2 games, and was excited to begin this one. Upon the first cutscene, I was immediately greeted with T-posing characters, desynced dialogue, and freezing visuals. I have a 3060-ti and 32gb RAM, which should be enough to run this smoothly, yet the gameplay freezes for 10+ seconds every few seconds of actual movement, even on the lowest of low graphical settings. DO NOT BUY!!!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "turns out the other reviews weren't lying about the performance of this port",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unoptimized when it works its fun but it doesn't",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit ass game fuck you fuck you fuck marvel fuck disney",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "3.5 hours played, at least 7 crashes. 5080, 64 Gb RAM. Not playable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashes ever 10 to 20 mins with nvidia 4090 series",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Perhaps Insomniac should go back to making Ratchet & Clank",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "optimization is shit,nuff said",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "PC optimization is horrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Miles' stupid evolved suit made me alt f4",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "without a carnage dlc this game is ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unoptimized and Buggy as hell cant recommend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How is this port so bad? Even struggles on my  9070xt",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game crashes more times than i play lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "idk why but the graphics on steamdeck was awful",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "not super, man",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the games at some point freeze",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Performance Issues",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "full of bugs",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "its not muiltiplayer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spiderman Vibes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't force gay stuff on us",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was swinging around the city until I've found jewish npc (ofc it's not GTA, so I couldn't do anything to him).\n0/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible Game\nGet Woke Go Broke.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Woke garbage",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "THE GAME SUCK!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "L W give my money back",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}