{
  "positive": [
    {
      "review": "After playing the first Grounded game a couple years ago, my husband and I were super excited to be diving into Grounded 2.  Nostalgia came rushing back as we wandered around the beauty and familiar scenes. Once our PC's graphics were adjusted to lower a few lag issues, we mustered up some courage and happily set out adventuring. \r\nThe Developers once again built a wonderful fantasy world full of creatures that brought us a range of emotions.  From cooing sweetly at adorable red worker ants and weevils to suddenly running away, screaming our fool heads off in sheer horror as a ticked off praying mantis ambushes us from above. \r\nWe are very much enjoying learning how to survive, while completing the quests that boost our knowledge and keep us interested in the fun filled story line.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "Wait for the 1.0. While there was definitely 20 hours of content here, I definitely regret going into this early, just like I did the first.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Bear in mind we are still in EA, but this game is easily as good and honestly better than the first game. Buggies are by far one of the most requested features and we finally have it (with more to come). Building, combat, map size, SCA.B, boss fights, heat/ice damage -- pretty much everything has been improved. Buggies, recipe tree balances/additions, NEW bugs, new combat mechanics, and an absolutely massive (and growing) map have made Grounded 2 far supersede the first game. The story is as engaging (better imo) just like the first game and there's still much to do. I've sunken over 30 hours and I still have a couple things to do story wise before I'm done with what EA has to offer so far. For EA, there's a ton of content. My two gripes are frequent crashing and awful lag in high-foliage areas. I have a beefy new PC and I still have to run the graphics at medium across the board just to get to 60 FPS. I'm hopeful all that will be remedied with updates (patches are trying to keep up with crash report data). The first game runs fine on full graphics for me so they definitely can and likely will fix these performance issues.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A great sequel to an incredible game, everything is just as cool, only even more pumped up than in the first part. You just need to wait a year for improvements and full content. This is the best survival game!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "An absolute gem of a survival genre game. It doesn't fall into the trappings of other survival multiplayer games where they all come out as the same feeling (With exceptions ofc). Its vibrant and cute artsytle juxtaposed with relatively scary creatures in a unique \"Honey I shrunk the kids\" worldspace gives off an experience you won't soon forget. Even though it is in Early Access it is full to the brim with content available to play. However note that as of this review it is in Early Access so don't expect it to be a full game in its current state",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's terrifying! The sounds make it feel like there's always something about to get you. I noticed the further I advanced through the game the less scary it got which I appreciated as it really helps with the feeling of progression. It's still terrifying wandering into the unknown. I can't praise this game enough as someone who doesn't usually play games with scary creatures I can't get enough of playing this!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Although its still in prerelease, I am very impressed.\n\nThe map is larger & im talking about what we already have access too. The bugs are harder (playing on medium) & the game feels more like a survival. \nThey took all the good of G1 & improved it by so much.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am so excited for this game to come out. I had dabbled in the first release of the series in it's early access but never made it more than 25% of the way thru the game. Now this is in its early access and i had so much fun trying it that i have now gone back thru G1 and am working towards my first NG+, of which i have only recently learned there are like 5 levels NG+. I loved Honey I Shrunk the Kids, i saw it in theaters, these games are a bit of a dream come true for me.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I feel like visuals and content wise so far, amazing job. But I really do believe that like like with the first game, unless you are only here for the new mechanics and places to explore, you would most likely benefit from waiting until 1.0 the story and optimization aren't there yet, and for the sake of keeping this only backwards compatible with future updates, most of the map is blocked off, as opposed to the original just having grass and bugs in the unfinished areas.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’m absolutely delighted with the game’s universe. \nI really liked the first part, and I’m looking forward to its development!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Grounded 2 surpasses every expectation I had for a sequel. Obsidian has taken the charm, creativity, and sense of adventure from the original and expanded it into a richer, more immersive world that feels alive in every direction. The level of detail is stunning, from the dynamic ecosystem to the expressive creature animations and exploring the backyard has never been more thrilling.\n\nThe story is deeper and more engaging this time around, with characters who feel meaningful and memorable. The new crafting and base-building systems are incredibly intuitive and rewarding, making experimentation genuinely fun. Combat has also seen a big upgrade, delivering smoother mechanics and a real sense of progression as you master new tools and strategies.\n\nWhether you're playing solo or teaming up with friends, the cooperative experience shines. Teamwork feels natural, exploration feels boundless, and every session leaves you with unforgettable moments.\n\nGrounded 2 is not just a sequel, it’s a confident and imaginative leap forward that solidifies the franchise as one of the most unique and delightful survival experiences available today.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you liked Grounded this one is absolutely worth your time. Same style of game with better QoL features and gameplay",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly really fun so far. Some of the bugs are very challenging and the game has a much larger sense of danger than grounded 1. Can't wait for more!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is so cool to play the sequel to my favorite survival game, everything about it is better, except the tool thingy and my fps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really loved grounded 1 but when I started this one I just couldnt get into it.\n\nIm gonna give it a try once more updates come out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent follow-up to the first game. Can't wait until the full game is released.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing but honestly quite glitchy for me idk if it will be for others or not but none the less the game is still amazing and I enjoyed it and I loved the prequel and being able to play a sequel truly makes it amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked the first game you'll like this one but I would say wait until more content updates because you don't have much to do right now other than that if you're a person how don't get easily annoyed by bugs wait for the full release it's still in early access",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. The gameplay and art style are amazing! S-s-s-science!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of bugs in this game. Exploration, survival, fighting, scary spiders.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game, a lot of depth and fun fight mechanics. just make sure you save, ive crashed a bit but nothing major.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like the first game but better graphics and stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I found myself a little annoyed with the keybinds when moving from Grounded 1 to Grounded 2, but they're not bad. Multiplayer has had some issues with disconnections. Tier 3 weapons and armor feel a bit too easy to get. Overall, it's a fantastic start to the game with a lot of improvements over Grounded 1 and I can't wait to see it get more polished as we get closer and closer to the 1.0 release!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yk pretty fun here and there you will get a jump scare or a HUGE lag spike but of than that its def a good game i can wait for hopefully a maybe garden snake to come to the game/.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really brilliant game , i loved the original too but i love the updated style of this game and the game play was alot easier too highly recommend playing if you havent already",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like games like Raft, you will love this game.  It can be a little overwhelming at first, but once you get a firm footing in the world, you can easily lose hours to this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grounded 2 features an intuitive and connected natural world. The game ties basic mechanics to realism; players must interact with a specific type of grass for grass seeds, and ants will attempt to steal resources from spots like the cooking spit. This focus on realistic behavior is the source of much of the game's discovery. Beyond the mechanics, Grounded 2 is visually appealing. Obsidian introduces clever visual variety with different biomes, notably a \"frozen wilds\" section tied to an ice cream truck's presence.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Admittedly I am currently writing this for the game awards badge, but this game is truly fun. I played the first one and this is living up as a sequel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game,played the 1st one and love the game so far,story is complete so far just waiting on full release.cant wait for the future of this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this one since release with my father. We've also played the prequel before in all it's glory and were absolutely lloking forward to a continuation of the masterpiece. Gameplay, setting, artstyle, it all works flawless. Love the new stuff in grounded 2 like mounts and can't wait to further play it along side their steady content releases! \nI recommend both grounded one and two to anyone, that looks to have a enticing and relaxing story  gameplay  packaged in a open sandbox (while still having a red hairing).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing so far, the open world, encounters, and building and much more is so much better than the old ways, I do recommend to those who have played Grounded!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "5* got it on PC and  Xbox. Awesome game.  Even my 6 years old daughter enjoys the building system! Without living bugs :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, visuals are stunning, love the ability to ride ants and spiders",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, more updates coming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have had a lot of fun with this game same as the first with my friends. the building has been great and  was terrifying to fight a cockroach",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Would recommend. Even though it is early access and there are a few bugs, this game does a great job living up as the sequel to the first game. New items, new bugs, new everything. The devs already announced a roadmap for the rest of the year, so players know when to anticipate new content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game! so far its super fun to play with friends. you get to build whatever you want and explore! Lots of bug fights too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though this is pre release, It's a very nice game. Has amazing graphics, and gameplay that is challenging at times. Looking forward to see what takes place as the game receives updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "more of the same from the previous game, with some updated (and harder) combat\nvery much recommended with at least one friend, as the mounts don't help that much (and can't coordinate)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although there's isnt a ton of things to do yet, it's still a fantastic sequel and the new game mechanics are well thought out. I can't wait for new content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is quite fun and very different than the game before and i like the different",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it so far, has a lot of potential to be as good and even better than the first.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even tho here are some BUGS i love the base building. And the fact that we can now ride the insects is amazing. I liked the old game, but I LOVE this wone. 10/10 would recomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't bother listening to the negative feedback or complaints about poor optimisation. The game is incredibly fun, hilarious with friends and 100% worth the purchase of 1 & 2! Zero performance issues (:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big step up from the last game but with just a few graphical preformences",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and it is just enough similar to the predecessor, that it feel somewhat familiar. But not so much it feels like the same game again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grounded 2 is shaping up to be just as fun as the first game. Love the addition of bug mounts, the omni tool, and I can't wait to explore the rest of the map!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Obsidian listened to Grounded's community and understood the assignment.\r\n\r\nThere are quality of life improvements alongside features they weren't able to put in the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still a fun game like Grounded 1 with some technical problems (early access). Needs more optimization otherwise love it and can't wait for the new updates and improvements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game but there are some big problems right now and you should really only play if you played the first game but even after that it is fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing story for the sequel. Gigantic map, even more dangerous. Cant wait for the full version.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Way better then i expected actually gold for EA great job devs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great sequel to an incredible game, everything is just as cool, only even more pumped up than in the first part.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoyed Grounded one ? Fully Yoked, you'll enjoy Groundwd 2. Granted it is in early access, It's got its bugs and issues that show up occasionally. Said issues are getting patched out relatively fast. I'm happy that i get to see the game grow as i play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite this games buggy (no pun intended) start, I can already tell it's going to get better as time goes on. Everything the devs have brought back from the first game on top of the new additions like buggies are amazing. I'm excited to see what more they are going to add for the future",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☑ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ Replayability }---\n☐ One and done\n☑ Worth a second run\n☐ Played it 20 times and still not bored\n\n---{ Microtransactions }---\n☑ None\n☐ Only cosmetics\n☐ Slightly pay-to-progress\n☐ Pay-to-win\n☐ More shops than gameplay\n☐ Casino Simulator\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the first game and have been really been enjoying this one. i'm looking forward to what is coming next. i really want to see where the rest of the story goes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall: 29/130. 22% F- Critical Failure\n\nSkip through this review for the sections you care about! ;w; I'm talking a lot about a lot of things. I know this game is in early access, but in my opinion, if a sequel doesn't hold up to the original right out of the gate, it's failed as a sequel. I only recommend this game to people who are NG+5 into Grounded 1 and want something new :3 anyone else? Big thumbs down- play the OG instead. \n\nGameplay Loop: 6/10 \n-Basically the same as Grounded You fight bugs and forage plants to build gear, weapons, and bases. You go out and hunt, gather, come back, and upgrade. I will say, there feels like there's still less to do long term in this game compared to the original, but it's in early access so that's to be expected. -Additionally, this score would be perfect, if the gear and weapon upgrades weren't capped at level 3. I'm a little chagrined, because in Grounded 1, I basically never used crafting materials to repair my weapons, I always upgraded them and then repaired them with glue. But in Grounded 2, some weapons you can use for a bit, upgrade them when they break, but after level 3, if they break the only way to repair them is with their crafting materials. I don't want to use up rare wolf spider materials to repair my wolf spider daggers >:( I didn't have to do it in Grounded 1, I'm very irked I have to do it here. Truthfully, this is a key failure of the game as a sequel. (This is a common theme in this review) \n\n\nVibes: 9/10\n-Visual style, music, sound effects, and character dialogue creates a really rich environment that justifies the full sequel treatment. \n-Took off 1 point because a big part of vibes are creating vibes via base building, and there just isn't much here in that category compared to the first game. I'll talk more about that later. \n\nStory: 2/10 continuation of the first game, with mysterious new characters. There's basically nothing here. I maybe spent 10 hours on the meager droppings of story that's available thus far. Those 10 hours are good, and there's environmental storytelling as well, but again. Compared to the original? OOF\n\nGameplay Mechanics: 9/10 The developers did a good job preserving what worked from the first game (mostly) and adding new things that make the gameplay interactions really nice. First game you had blocks and parries. Blocks could mitigate or stop incoming damage, but would wear down your endurance. Parries let you do the same but at no endurance cost! You use stamina to run or swing your weapon, watch your health to make sure you don't reach zero HP, and there's hunger and thirst because it's a survival game. In grounded 2, there's no endurance for blocking,  you just lose stamina instead. I'm neutral about this change atm. They added dodges though! So you can spend some stamina to jump out of the way, extremely useful, necessary for some fights (I'd add a point for this one). This would be a perfect score, BUT they made a change to how bows work. Now you can't block with a bow (only weapon that can't block AT ALL, even though it could in Grounded 1), and instead you get this zoom in effect, which would be cool, EXCEPT it has auto aim that aims AWAY (I repeat, away) from enemy weakpoints, which is like, the ENTIRE point of an archer build. (I subtract two points) \n\n\nProgression: 3/10\nUnfortunately, this game being so early in its development, there are a lot of things that are missing. Level 3 caps at upgrades hinder progression enormously. It feels like this game lets you get like 2 tier 3 armors and half a dozen tier 3 weapons, some of which you can't repair or duplicate if you aren't with friends because tier 3 harvesting tools and refining constructs aren't available until winter if they can stick to the plan outlined in their early access roadmap. \nBase Building: 0/10\nSo at launch? -5/10 the fact that they did not include things that were in the original game? Lowkey heinous. After the Hairy and Scary update? Welllll they added a few new things, but the big problems with base building (lack of coziness for cheap heals, lack of customization, no hanging lanterns) still remain. This score is lucky it's not in the negative anymore. \n\nThings The Sequel Should Have/Improved upon as a sequel \n-new bugs 7/10 pretty good overall\n-buggy mounts 6/10 there's only two but there may be more coming soon? \n-returning bugs 4/10 would be a 3 but some of the returning bugs received additional attack patterns which is pretty cool. Otherwise there is an enormous lack of some of the key bugs from grounded 1 in terms of crafting resources, gear, tools, and base decorations. \n-returning/ reimagined gear, tools, and weapons. 4/10 much of the returning gear are reimagined, making this a 4 instead of a 3, but most of the gear is tier 2 or 1, so they lose viability later on. \n-New weapons, tools, gear 5/10 There are some really cool additions, at all tiers. But a lot of them don't seem viable later game, and without level 5 upgrades, the weapons are down an ability compared to grounded 1. \n-BAD CHANGE: -5/10 Bug Roasts, like meat roasted on a spit, no longer counts as a meal towards reducing your hunger drain rate. There is now literally no reason to make roasts when they are indistinguishable from jerky and this has hugely nerfed early game progress in Grounded 2.\n-BAD CHANGE: -10/10. Building is buns in this game. Everything in Grounded 1 is permanently stuck in EARLY early game progression until devs free us from early access purgatory. Pallets? Stuck holding only 21 stems. Movement? Stuck to the meager 'improvement' we call buggies, pale comparison to ziplines. Resources you need to build? ALL STEMS which are, because of the crappy pallets are a BENCH to gather. Mind you, everything you need for these things, ARE ALREADY IN THE GAME. \n\nActive Bungles of Current Game Meta -10/10 \n-Nerfing the Scorpion armor set  ability AND the ambush mutation to ONLY affect angry bugs. Insane, I can only imagine this was done to punish the players who discovered that the crippling ambush strike this armor has, and the ambush mutation's bonus damage, offer an alternative route to hunting snails. I'm sorry, but guys, WTF? /WHY/ change this? Why strip players of clearly creative choices? Because this literally forces players to be /MORE/ cruel to peaceful, non angry creatures. This is the only time I'm going to swear here. That's really F*ck3d. SO for those who don't know, before one of the latest patches, this armor set and mutation allowed players to nearly one shot every peaceful creature, and in the case of snails, stun them long enough to be delt a swift death. Now? Now you have to slice, stab, crush, or beat your way through normal innocent creature's health bar until they finally pass. Snails? Now the /only/ way to kill them is to critically hit their eyestalks with arrows. This never oneshots. It takes time, arrows, and patience to torture the snails to death, and that is the only way to get their drops which are CRUCIAL to many tier 3 items and consumeables. Literally WTF? I'm sorry but why MUST we torture peaceful bugs to death? What was the point of adding a 'rogue' mutation, and armor set but then make it COMPLETELY POINTLESS against HALF the bugs in the game. Actually /Ridiculous/ change. This score will be negative until that is changed. Needless cruelty to mostly defenseless bugs is /not/ a good direction for this game, you /cannot/ change my mind on this. \n\nBugs in game code: 5/10 There's a LOT of bugs in the code unfortunately. They're not usually game breaking, but they're incredibly inconvenient. \nExamples: \n-sometimes the menus get bugged where you can only click with the mouse to navigate them. Can't switch menus with q/e, can't press space to confirm or escape to deny. Can't press y to sort inventory. \n-Can't sort inventory in chests yet\n-When Pete takes off his helmet he has a voldemort face on the back of his skull. Everyone's nicknamed him voldepete.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still the best PVE, Crafting, \"Retro\" style game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've spent hundreds of hours playing the original game, and I adore Grounded. 100% on Xbox and PC. I don't think this game is ready, and I don't say this lightly. I like it, however there were a lot of problems. There was a lot of movement, combat, and engagement.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, excited for full release. Run smooth too. Bigger map from sequel too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just tryna get the badge lol but in my opinon this game is good = until they finish all the damn updates and when playstation is allowed to play this game u know its good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game nice classes fun with friends nice to just mess about and chill cool bosses good lore there's a plague doctor assassin outfit so that's pretty cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "barely playable in the current state should focus on optimization, still hope it will become great, miss the old tools system a bit, but whats the worst for me is having only one hotbar since i used to have multiple armors and being able to hotswap them. especially boots but with mounts i feel like aphid  shoes wont be as usefull as they were",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very enjoyable with friends. Lots of exploring and story yet to come very exciting. And mounts to get around faster",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. \r\nCan get laggy with high settings. I have a 4070 super GPU and a R7 5800X CPU and get 70 frames with medium to high settings.\r\nAnd the map feels huge already even though it's only a quarter of the final product.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played Grounded when it first came out was so hyped for this when it came out, sat down to play with my buddies and frickin loved every second of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved grounded, and this is just grounded... but 300% better, cant wait for it to be fully done",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great fun, as long as you learn to let go and not mind the number of times a scorpion/praying mantis nymph/wolf spider ganks you in the back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“Grounded” é uma das experiências de sobrevivência mais criativas e divertidas que já joguei. Nomeei este jogo para os Prémios Steam porque combina de forma exemplar criatividade, atmosfera e cooperação.\n\nO conceito de sobreviver no quintal enquanto somos reduzidos ao tamanho de um inseto é simplesmente brilhante, e o jogo aproveita essa ideia ao máximo. Cada inseto tem comportamento próprio, cada zona do quintal parece um novo bioma e cada exploração conta uma história visual diferente.\n\nA jogabilidade é equilibrada e gratificante: recolher recursos, construir a base, enfrentar insetos perigosos e evoluir o equipamento dá sempre aquela sensação de progresso constante. É um jogo que brilha especialmente em coop, onde a coordenação e a criatividade do grupo tornam tudo ainda mais memorável.\n\nA direção artística é excelente, criando um mundo que é ao mesmo tempo acolhedor e ameaçador. A banda sonora e o design de som fortalecem a imersão, desde o farfalhar da relva ao rugido inesperado de uma aranha gigante. Nunca me senti tão pequeno… e tão investido.\n\nSeja pela originalidade, pela diversão com amigos ou pelo carinho e dedicação que os criadores continuam a mostrar, “Grounded” merece verdadeiramente reconhecimento. Recomendo sem reservas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Can't wait to see what else is in store for this early access game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved the first game and this second version builds on that. Devs are a tobe and the game is getting better with every update/patch on Steam deck. Looking forward to the development.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely loved grounded 1, the setting being in the late 80s/ early 90s, the lore, open-word crafting and base building, and just the overall \"Honey, I shrunk the kids\" premise. I think the bug fights were a little repetitive in g1 but having the insects block in g2 makes it a little more interesting. Although, I see some pretty cool new features and insects in grounded 2, I do agree with complaints in the negative reviews. The current state of the game is buggy (no pun intended lol) and hard to play at times. However, if we exercise a little patience for this winter update and future ones to come, I don't believe we'll be disappointed. I can already tell they've expanded so much on the first grounded and with time, we will see grounded 2 reach its full potential. \n\nSide note: I will say lowering the graphics did help but still suffered latency issues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It really needs to be a bit better optimised, or atleast players should be given SOME settings to make the game... not run on like 2fps on a device that handled grouned one perfectly fine. (I understand that the map is alot bigger and its a new engine.. but not having settings to turn of hadows and turn down texture quality is just bad.)\nI have not played through all the avaliable content, but I have finished what has been released of the main storyline.\nIt was enjoyable, just frustrating due to the fps I was stuck playing with at times. (And the ladders..)\nI think that in the future they will add more fun content, Not sure it'll match the enjoyablility as grounded one but we'll see.\nMany bugs, of both types, as expected in early access, though not many that were game-breaking and I appreciate that. It was a bit dissapointed that when I got to the main fight, half the textures were missing and the fight suffered from even lower fps than my game usually did. As far as I'm aware missing textures have been fixed? Its just a shame I speedran through it.\nLove the bug mounts, great feature. \nOverall, alright game so far - definetly some improvement needed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun to play, especially with a friend.  The building can sometimes be a bit less intuitive on what to do or where to get the materials.  But all around a fun time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, their first game was a huge success and now obsidian kicked again with an even better game! it is absolutely AMAZING! The immersion, the innovative gameplay, the stress when escaping gargatuan mobs like the praying mantis, which took me a few minutes to realise it was just a nymph, like goddamn mother of god, cant wait to meet the bigger one. they added much more equipment than the previous game. Seriously, its by far the best game i've ever played. i totally love the survival crafting concept, and they delivered one of the best, if not the best, game in this category. everything is in there. just perfect. 10 out of 10. i also rated it GOTY in the awards, without hesitation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing with just the right balance of survival and exploration. Must play!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of goods and bads so far. It's still in development, but the \"Bones\" are there. The idea is it's a worthy successor to Grounded 1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "interesting game but it has flaws, I hope they fix it when it comes out of early access",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bugs. Little bugs, friendly bugs, farty bugs, and bugs that will make you have nightmares for days (Wolfy).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is full of bugs and they keep increasing with updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game right now is great with lot's of things to do and places to explore. Lot's of new bugs to fight, the combat mechanics and types of armor are expanded. While there are a few bugs (ha), overall I am excited for the future of the game and what else they can bring in the coming updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Personally, Grounded 2 is really fun. Actually a nice changes to the progression system Grounded had, but made sure to kept the same thing. Weapons actually feel more fun, and the enemies, while feeling the same for me, are much more fun to face against. A friend and I had yet to continue our adventure for it, as I do want to see us fighting a boss as Wizards.\n\nOthers had notify that while yeah the optimization is poor on this game, it is in Early Access. And so far, most of the things I would encounter as a glitch is just simply things that would not occur. For example, if you don't collect a certain resource in time, it just doesn't respawn, and it makes it much harder to obtain. So while yeah the Optimization for this game is rough, I do think it's that way because Early Access is meant to start out a fair bit rough.\n\nOverall, I would definitely reccomend the game if like the first Grounded game, but do expect alot less content from it... as again, it's Early Access.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Huge fan of both the games, and a day one for both. Loving it so far with what has been released. The variety of weapons and armour just scratches an itch that the first game didn't, and is just better overall. And as a huge insect nerd, I'm loving the attention to detail so far. I have huge hopes for the future of the game and perhaps we'll see a snake themed armour set similar to the koi fish armour of the first game ',:\\",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I prefer playing this with others, it's more fun to complete tasks together. Kinda reminds me of Honey I Shrunk the Kids, lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "13 hrs in , couple bugs but obviously because its just come out recently , so much better than the first game , enjoying it to much and cant wait for map expansion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing gameplay alot to do crafting,gather resources,building and much more 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Getting lost in this amazing world isn't such a bad thing after all! I'm all in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game for friends to sit back and relax!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to play with friends. They're still working out some kinks, but that's to be expected with the early access stage. I LOVED the 1st Grounded, & this one has the potential to have that same feel once it's all polished :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its new, and i haven't got far yet, but if its anything like the first game, I have CRAZY hopes for this being even better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had so much fun playing this game with my kids! It feels like they kept all the great things from the first game and improved upon them even. We can't wait to play 1.0!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you loved the game Grounded then you will really love this game. More added stuff than the original, such as rideable insects, new weapons, new armors and insects. A nice continuation to the story and all around worth getting to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good early access, despite a few rough edges. I wish that is was a bit more fleshed out before releasing, however, the state of the game currently is amazing for this early point in the early access. I see great things coming from Grounded 2, bigger and better than Grounded. The story thus far is also very intriguing and provides a good challenge to the game in some parts of the story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it so much. The story, the gameplay, the new bugs, everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked Grounded you'll love the Grounded 2. It's bigger, better, and has lots of new mechanics that build upon the first game. It is still in its infancy but I believe it will certainly be great later on. Definitely recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is SO FUN! it makes me cry you can fight craft collect and explore and ride ants and orb weavers/spiders",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absoulutely loved grounded, definitely feel the same on the second one, just my only issue is that it doesnt have much content but I know that just because its in early access I just dont wanna keep waiting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the original Grounded and it was a great all the way through the process going from the early beta to the finished game and I feel Grounded 2 will be the same. It's already a really fun game with the right amount of difficulty and not too much hand holding. It wants you to go out and explore which imo makes a great action adventure. Only a game like this can make a picnic table into a challenge with more stuff to find every time you go back.\n\nIt has it's faults yes, such as your \"buggy\" vanishing out of existence when you get too close to a place where it shouldn't be meaning you may have to walk back to your base on foot from the other side of the map.\n\nOverall I think this is a great exploration and action game that stands mostly on it's own for being original and with the dev team behind it listening to their fan base will be an even greater game as the months or years go by.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool idea for a game.  The world is interesting to explore.  Very creative team knocked it out of the park with imagining what the work would be like if you were smaller than a bottle cap.  The combat is challenging enough to require some practice and remain interesting. \r\n\r\nAnd this game isn't even fully relkeased.. the map isn't totally uncovered yet... plenty of content to come.  Better with friends for sure!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "[b] Grounded 2 in Early Access is a technical nightmare. [/b] The game looks nice, but the terrible optimization ruins the fun. On very strong hardware it barely keeps 60 fps and drops below this happen all the time. This makes playing very frustrating instead of fun. Right now the game is not worth buying, unless you want to get it cheap and play it later.",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "I love Grounded and this game looks incredible. Unfortunately the optimization is so poor that I struggle to enjoy the experience. At the moment I would not recommend paying full price or wait until they fix it up.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Buggy, AAA early access game that barely runs on modern hardware. not worth the money in its current state. only update in 2 months is 4 bugfixes. can't recommend.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "ive been waiting patiently for yall to fix the bluetooth sound issue and something as simple as that still isnt fixed. i was so excited to play this game and still am but am floored that i cant play it without the audio sounding like its from a radio. Not one person who buys a game should have to deal with tweaking and fiddling with their computer just to make a single game run the way it should in the first place. Id love more than anything to refund this but my refund period is long since passed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Build a stable framework, then add your content. Nail the controls. Nail the UI.  Nail the netcode. This is a mark that Obsidian has completely missed. Build that stable foundation and ONLY THEN build upon it with features and content.  It's been months since this released in EA, and Obsidian is by no means a small dev team...  There is no excuse for the complete lack of basics here. I have played very few games where the controls were as broken as this.  I thought the recent update addressed this... nope. I would caution potential buyers to wait until full release given the basics are not a priority here.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "At the time of writing this, the game is almost unplayable. Strong enemies lurk almost everywhere and at all times. When you fight an enemy, they will almost always call for backup. It is not uncommon to end up fighting 6+ enemies at once, an unwinnable position. On top of that, the introduction of roaches, a common neutral enemy who will swoop in and loot your kills before you can make even a win feel like a loss. \nConstant raids by some unnamed antagonist get in the way when you are just trying to work on your base. The ability to repair your buildings is glitched and doesn't always work. \nThe class benefits are lack-luster and unbalanced. Kills for mutations are not always counted correctly.\nOptimization is abysmal, even on a good quality gaming rig, I had to play on the lowest graphics settings and still experienced frequent lag.\nThis game may mature into something good eventually, but do not waste your money on it now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gameplay is a lot of fun when you can actually play it, unfortunately it runs so badly with constant crashes you can't really make much progress.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is badly optimised, have tons of glitches and bugs. Can't enjoy game at all, i guess most of players just waiting for game to be fixed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Trash tier game.  Just Grounded 1 without the same functionality.  Everything is broken, expect it to lock your machine regularly and be generally unimpressive even when you can get it to run.  Nothing worth the time or money here.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I am enjoying bits of the game, but it feels like too much was removed from the 1st game, but only for the character. Its still in a rough state, and you can feel the early access shining through. Possibly after the winter update (which was delayed until late winter) the game may be worth getting. Currently there is just not enough content and a bit unstable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In its current state it has very poor perfomance and crashes a lot.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I hate to have to give this game a negative review, but I can play Helldivers 2, Cyberpunk 2077 and even Battlefield 6 on the highest possible settings. No issues besides some minor lag spikes once in awhile. This game has two major issues that caused me to give it a negative review. The constant lag that makes the game feel sluggish to respond regardless of graphical settings and the fact that when trying to build a base it crashes my computer, as in full lock and reboot crash. I loved the first game to death, so it kills me to have to be negative about the second game but as of right now the game doesn't feel playable to me because of the crashing my PC issue. If it was just the game crashing that would be fine but crashing my computer can damage it if I keep trying to play. So until this game gets a few more updates, I have to uninstall it and walk away from it for awhile. However I WILL NOT BE REFUNDING THIS FOR ANY REASON!!! I FULLY intend to play after the full first year has passed. For me the launch was rough because I wouldn't play due to the intense lag, now it's a computer crashing issue. So yeah, after a first year I will come back and try again. Hopefully to an actually playable state that I can fully enjoy. Good luck Obsidian! You've proven you can do great things! So let's see you do it again!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Another example of why early access is a terrible terrible trend in gaming. Game is years away from being ready to ask for money.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Nerfing the most fun things in the game.\r\n\r\nsick of games doing this over and over.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very Early Access at this time and it really shows. I have no doubt it will eventually be as good as the original. However at the time of this review, it is better to steer clear if you are wanting to have fun. If you like finding flaws and reporting them go for it, that is what Early Access is for.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they need to fix the game crashes more then dial up internet. its like they put crap on crap and said send it.\r\n80 plus hours and the game is beat and its bugged to wear your base does not get a  attack not able to move forward but everything else is done. wish i would have waited WASTE OF MONEY first game is way better !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game thinking I was going to be able to play with my dad on a trip he has a laptop and I have a steam deck. Of course I pay 700$ for a steam deck that can't even let me sign into xbox live. Is it an issue with the steam deck? yes...but forcing me to sign into xbox live just to play online and not just online with steam like every other damn game? wasted 5 hours of my life troubleshooting what a joke.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Massive fan of the first game. This game currently however is so poorly optimised, the framerate is unbearable. 6900xt / 5800x3d and I will not play Grounded 2 until it is optimised better and FSR is added",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately this game is not ready to play yet even in early access, unless you're willing to play with the default keyboard layout. Despite saying that they have fixed the issue where your keyboard settings reset after logging out, they have not. Also, you cannot currently change the bug mount controls so the whole control scheme system is a mess. Even taking pictures of your desired setup so that you can reset them every single time you start up the game is incredibly tedious because there are a ridiculous amount of primary controls, auxiliary controls and ancillary controls to cross-reference. It's hard enough to get it all right once, let alone every single time you log in. So, in my opinion, if they want to make the control scheme this complicated then it is unacceptable for it to be so impossible to remap them in a easy and expeditious manner.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game it self is nice BUT the bugs/crashes are still there. I had no problem before and  now i cant even get in the menu because its crashes, i tried almost everything to fix it. Nothing works!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Multiplayer is unplayable. Cant play for longer than 10mins without the server crashing. Even while playing it is like playing grounded 1 on a slide show",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Can't recommend, for now. [/h1]\n\nRuns poorly on a i7-9700K, GTX 1660 SUPER, 16GB RAM.\nLowest graphics possible, game still crashing.\nGot 4x times blue screen'ed trying to play.\nRandom problems where my headset just disconnected, only fixing it when closing the game.\nI trust it'll become really stable, just like the first one, but, for now, it's a nope.\n\n[h1] Refunded! [/h1]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought this game when it came out as I loved the first Grounded. Sooooo many problems, the main one that made me quit the game for awhile was getting constantly D/Ced no matter what I did. Came back today and no more DC but there are a lot of issue, bugs stuck in rocks, I can't stack anything for some reason, and the fighting seems delayed. Maybe in another year....kind of sucks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "- Performance is absymal on every pc in our household. On a 4070 ti super, 7800 x3d, 6000 mhz 32Gb RAM, FPS can drop to the 40's on medium settings. The worst thing, it doesnt look better one bit, that the first game! 90% of the assets are the same. Another casualty of the terrible Unreal Engine 5. \n- occasional hard crash to desktop (memory leak maybe)\n-balance is all over the place. Random enemy placement and aggro range is punishing, a lot of the times, when you are in a fight, 3-4 scorpions spawn from thin air. \n-the map is boring, and unimaginative. \n\nI know \"iTs EaRlY aCceSs\", but its in every way inferior to the first game. The fist was already better in this stage of develeopment. Given all the experinece with UE5, it will never run good, no matter the optimization. How rating is 80% on steam at the moment, is beyond me. Still have a long way to go.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Constant staggers and lagging in game. Had high hopes for this game, was dissappointed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I truly hate to leave a negative review on this game but I simply can’t do any different. There is nothing to say other than that it doesn’t run and obsidian should be ashamed that they cannot make a functioning product. The first game was a special experience and I hold out genuine hope that it will work one day. Fix you game, obsidian, just fix your game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT PLAY\ninsanely poor optimization, \nI play the game with everything set to medium settings with a 4070 Ti and this game pulls 100% of my GPU, it pulled so much that it actually caused my PC to crash. GPU has proper airflow and isnt overheating, drivers are up to date and in 2.5 years ive never had any issues from other games. Battlefield 6 only uses 65% of my GPU and runs at high and ultra settings with no issues. Constant crashes from this game and then a full PC crash is insane.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game runs terribly, plus it removes more features than it adds. Palate swapping enemies from the first game is so lazy, as is the story.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's unplayable at the moment (solo), because of the northern scorpion that comes to yours base. and all other places. seem to have a wallhack or something. (lacks scripting i guess) always comes, knows where you are all the time. and kills you till a point you have to restart the game. only takes 30 sec. in game to find you or comes to your base again and all restart again. no red soldier ants eggs to find anymore so no buggy or army of ants (scorpion kills m all tho ) demolishes your base along with some char in the game.\r\nrepair tool sucks, does it sometimes. so completly unreliable (better to demolish your damaged walls and rebuild, also grants you extra recoureses. ) At this state, the game really sucks you can't do anything but die a lot.... maybe waited a bit longer to optimize the game a bit more... even you devs. know that it's useless in this state. For the positive site... The ideas are good to create your own bug army, makes the solo play a progression to the first grounded. but it should help that it's playable tho. At this point i'm done for a while looks more like death simulator. keep up the good work tho !!  Also there is no way i guess you communicate with the community? or found it yet. or report bugs. looked in the ui. but found nothing so negative reports must do the trick i guess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No the performance on multiplayer is shit, The bugs agro so fast and are hella fast, keeps saying i need to log in with xbox for multiplayer even tho i did, Js wait for full release.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No oven, so can't make spicy globs for coaltana (which was in the first game) Only 2 on the entire map. What if i'm playing with two other people? \n\nWhy on gods green earth is grounded on unreal engine 5? Do you really think that the 13 year olds this game targets, have the money for the 4070 Super Ti that it takes to run this game above 35 frames? \n\nAlso constantly rubber banding, getting stuck in the ground, and bookbags getting stuck in the ground. Oh you finally got that bug part you needed? Well good luck getting it back when your bookbag is no longer of this earth? Oh you have a pc that doesn't cost $2000? Get fucked lol. Why even release the game in this state? No oven is really the cherry on top, I mean it was literally in the FIRST GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While fun like the first Grounded, Grounded 2 is an unfinished game and for the money I would say it's not worth it. A friend and I, who played really slow through the game, only got 19 hours of play time in before we completed everything. Just like is says in the early access notes: you should wait to see if the game progresses further in development).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "With something like Abiotic Factor existing there's just no way to justify this garbage.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Whenever you guys fix the game crash issue once for all, I'll change it to thumb up... Maybe. I don't see why Grounded 2, if the biggest differences between 1 and 2, are talent-tree-like system, and a mounting system? Barely a DLC content w/o obvious improvement on visual or gameplay.\nDon't ever tell me to change the graphics settings or update the GPU driver - I've tried already - and it is developer's responsibility to fix the game. :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very short and buggy. \n\nI played and adored the first one. So much so that i bought it on multiple platforms so i could play with multiple people. Easily in my top 10 games of all time. Now imagine they took the first one, added one or two small things, and removed like 80% of what already worked. Then imagine they charge full price for what is essentially a demo. I get EA but if you want me to pay you for a product, it better bet worth the money regardless of EA or not. \n\nTHEN they have the gall to put up paid dlc for a product that isn't even half finished! There should be rules around doing that. If I pay you for an unfinished product, then I expect every update and piece of content until full release to come my way, not locked behind another paywall. Leaves a terrible taste in the mouth, and feels scummy. Supremely disappointed.\n\nThe map is very small and once you get a buggy (very early on) it feels much smaller still. \nThe majority of the bugs from the first game aren't here yet. It really feels like they have hung their hat on scorpions, which are cool, but they dont make up for missing sooo much.\nWhy the f do you have no tier 3 tools available, yet blueprints that require them?? Such a massive slap in the face to just get started and then suddenly realise you cant get mid-tier armour or weapons because you cant get tier 3 hammer etc.\nWhy the f do you have an update that introduces an optional boss fight when we are still missing basic stuff?\n\nI didn't want to give a negative review since I got a decent amount of hours out of it for the money, and it shows real promise to be everything the first was and more, but I genuinely feel like I have been ripped off despite that. \nI was excited to build a new base, nope only basic mats and designs available.\ni was excited to check out the new armour sets, only early (quite trash) sets available.\nI was excited for weapons, nope. Can't even enchant them or upgrade past 3. You can find better shards but cant make them into anything.\nThe whole thing feels like a d-tease. Like they took the first game and gutted it down to the absolute bare minimum that you could call a game and then tacked a full price tag on it and claimed it's pre-release so thats ok. Either do pre-release and make it cheap af with no paid dlc, or get it to a point where it's 80% done and then release as EA. This is like 20% of the game the first one was.\n\nI know it will get better, but would I recommend it now? Hell no. Wait another year or two until they've finished milking people like me for their money and using us as bug testers. \n\nWTF is a founders edition anyway? i paid for the game in pre-release it is insulting to ask for yet more money for this tech demo. Shame on whoever thought that was ethical.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Loved Grounded and I love the ideas they have for Grounded 2, but I can't in good faith suggest this so long as the performance issues persist.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why make a sequel if its not gonna run on the same device capacity? like you could have made the game just as big without needing a massive graphics card and an entire pc replacement for some people? grounded 1 ran just find on older devices, this one just breaks. The developers really gave the \"f you\" to a lot of players at this point. Even fallout 76 and all horizon games run just fine on older devices, but grounded 2 couldn't afford the courtesy? f this development, you clearly don't care about your fanbase and I will NOT be promoting any of this developments products to ANY of my friends. You've lost my faith and my loyalty. Goodbye, grounded. You suck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When I first spent 50 dollars on this game I expected more creatures, better story and more gameplay however that was not the case. Grounded 2 was a disappointment, with too many larva, not enough creatures you need to find and overuse of orc creatures to fill in gaps. The 'bosses' were just regular creatures with name tags and buffs and even if new bosses are added they probably won't be anything special. The developers seem to think all anyone wants is to cuddle with an ant pet but realistically a lot more players couldn't care less about the horrible trek through the ant hill just to get something that u want to hang and kill. The Zipline from the first game was better than buggies and as an additional note, nobody cares about the vacuum cleaner mode. Overall the game was a complete waste of time and money and even if I hope it improves with more updates, I don't have high expectations.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Terrible optimisation, i have quite a good pc and can play most games but i get a lot of lag on this one also do not like not having multiple tools to put on hot bar. I found i got bored very quickly. Also found it difficult when wanting to craft things it felt that all the controls where all over the place.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's not there yet. Even just trying to store items is a major pain in the ass.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "zero optimization months after release.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not worth buying right now with all of the performance issues. Runs very poorly on medium settings on a somewhat high end PC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am a massive fan of Grounded 1, and assumed this would at least use that game as a starting point and continue to build on the perfect recipe they had created but holy shit was I wrong. I had to refund this and go back to the original game for the following reasons:\n\n- Poor performance\n- Networking issues and desync in multiplayer\n- Confusing menus and controls\n- Uninteresting and hard to follow storyline\n\nIm not sure how you have such a great game to build off of and mess it up this bad. It feels like the classic case of a new director and development team who feel like they need to make changes just to try and say they drove new direction. It sucks and at this rate this game is going to be a major flop.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have a 5070 i dont even get a consistent 70 fps at 1440p on low settings.\ndont buy this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cant play with friends if your on linux and your friends are not",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have a 4080 super and i can barely run the game, I would wait until full release to buy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "give it time too cook wait till winter update",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my laptop cant cope with the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "devs forgot about this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1 tim my fren hitt me with a speer an i dyed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "wait until full release",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no good game very bad men",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lots of glitches",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its butt",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "if you have a low end PC like me don't get it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "IF IT WAS GIVING FREE TO ME IIIII WWWWIIIIIIIILLLLLLL NOOOOT THESE GAMEEE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "performance hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buggy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They've started to address my previous concerns so I've updated the review. That said, at present the game is still not fun to play.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "Bought this for coop play on lan setup. \r\nUnfortunately there is no option to host locally and you must play on their servers that constantly kick/disconnect the player(s) that join. i played for a while solo but gets boring quite quickly. \r\nPlease allow us to host our own P2P server, its a coop game....",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Game is currently unplayable, don't know what they did but before the new Hairy and Scary update I was able to run the game just fine on max graphics settings, now I can't even run it on low graphics settings with more than 5 fps and the game crashed a few minutes of it just running",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "[b] Grounded 2 in Early Access is a technical nightmare. [/b] The game looks nice, but the terrible optimization ruins the fun. On very strong hardware it barely keeps 60 fps and drops below this happen all the time. This makes playing very frustrating instead of fun. Right now the game is not worth buying, unless you want to get it cheap and play it later.",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "Somehow, Grounded 2's devs are managing to make the game less optimized with every patch, to the point that it now constantly lags, freezes, and crashes my entire computer, something no other game has done to this PC. So I'd definitely suggest avoiding the game until it's much further along its early access development.",
      "voted_up": false,
      "votes_helpful": 119
    },
    {
      "review": "Wait until it's released fully and on sale. \n\nObsidian could have released this as a beta demo with how little content they put into it and the lack of issuing anything further other than patching bugs that shouldn't have made it to the soft launch in the first place. If it was a small indie developer I'd understand but when fucking Microsoft is backing this project go fuck yourself for a $30-40 game. \n\n+rep for at least not throwing in micro-transactions. Obsidian I get it, management probably shoved this out into the fire against your will and I'm aiming this at your shitty managers.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "I love Grounded and this game looks incredible. Unfortunately the optimization is so poor that I struggle to enjoy the experience. At the moment I would not recommend paying full price or wait until they fix it up.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "25 to 35 FPS on medium settings 7800X3D 64 gig ram RTX 5080.\nPathetic. This is the only game I have had trouble running in this rig.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "SOOOOO many bugs.... lost connection... waypoints and symbols on the map randomly disappear, trying to turn them back on doesn't work, arrows randomly get huge and massive... This game is clearly not ready for playing...",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "80-85% positive reviews is unbelievable, you either have extremely low standards or were playing a different game.\n\nThis is a quintessential example of an early access title, horrible performance and optimization, UI that must have been AI made, and just bad ideas.\n\nMy first issue was the mouse sensitivity. They changed it from numeric in the first game to percentage in this game, the result is a loss of 80% of sensitivity. It is a known issue apparently. You can fix it by editing a file but any in game alteration will reset it. In my opinion this is a major blunder for professional developers on a sequel.\n\nWhich brings me to my next issue. Why are you trying to reinvent the wheel when the first game had better systems. The UI is far inferior to the first game, things require more time, button presses and aren't nearly as functional as before. The omni-tool sounds good on paper but in practice, holding e for every interaction is far worse than click or click hold gathering. They also haven't learned that spamming e to pick up 6 items after harvest is extraordinarily tedious, annoying and bad for the player.\n\nThe performance on medium with a 3080 is very disappointing though hopefully that changes.\n\nThis game is currently not a good purchase, play the first game on new game plus and let Grounded 2 cook for a few more years.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Would love to play the game but crashes on load. Not quite capable of utilising high end gpus. I would not recommend until it is stable and playable.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "As of right now, no matter how cute this game is or how great the environment is, I couldn't recommend a friend play this game because of the glitches I have experienced. I will definitely come back to this gem later, when it gets much needed bug fixes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game is NOT ready to be played. i couldn't even get through the tutorial due to the unplayable lag and then dying from lack of water because of said lag.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "As it stands now, this game falls under the terribly optimized slop that a lot of triple-A games are following these days. Decent performance requires a Supercomputer and for AI frame-gen and upscaling to be enabled. An immediate 'no' for me.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game is badly optimised, have tons of glitches and bugs. Can't enjoy game at all, i guess most of players just waiting for game to be fixed.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Guests have long and frequent freezes in multiplayer and some crashes too.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "possibly the worst game i have ever wasted my time playing i cannot believe i paid for this with the amount of bugs and game breaking glitches i do not recommend playing this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Trust me when i say i wish i got my time back. I feel scammed, bamboozled, phished, and downright hoodwinked by the whole experience. Besides the insane amount of bugs, including game breaking bugs such as glitching out and unable to retrieve your backpack via game repair, this is an absolute waste of time. I cannot believe this game is worth money. They probably used chatGPT on their entire code base. I NEVER post game reviews, so you should know how ASS this game is. Save yourself the frustration, the rage, and the wasted hours. Don’t even bother installing it even though it is \"Free\". \n\nHELL EXPERIENCE/10\n\nDon't trust any positive reviews",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "ive been waiting patiently for yall to fix the bluetooth sound issue and something as simple as that still isnt fixed. i was so excited to play this game and still am but am floored that i cant play it without the audio sounding like its from a radio. Not one person who buys a game should have to deal with tweaking and fiddling with their computer just to make a single game run the way it should in the first place. Id love more than anything to refund this but my refund period is long since passed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Picked it up since it's free to play rn. But good gods. It's so badly optimized. It gets rid of textures on lowest settings and is unplayable imo.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Early Access Game, but,, ,\n- Stuttering, 1% low FPS drops from 70 to 30 FPS, nonstop. When I set it to 30 FPS and use Losses Scaling, it drops to 4 FPS in in new areas ( Not only outdoors, but also in closed areas ) \n\nSomewhere I only get 50 FPS on Medium settings and The map does not load when I switch to Low\n\nThis game has Shader compilation, but it doesn't actually do anything. \n\nFIx : \nEdit Engine.ini , Copy this in...\n\n[/script/engine.renderersettings]\nr.FidelityFX.FSR.Enabled=2 \nr.FidelityFX.FSR.Sharpness=3.0\nr.TemporalAA.Upsampling=1\nr.ScreenPercentage=88\nr.AntiAliasingMethod=2\nr.DynamicResolution.Enable=0\n\nAlso u need Losses Scaling  and game fps lock to 30 or 60\n\nIt works on Linux and Windows\n\nOrher game settings ( depens on u PC ) \n\n[ScalabilityGroups]\nsg.ResolutionQuality=100\nsg.ViewDistanceQuality=3\nsg.AntiAliasingQuality=3\nsg.ShadowQuality=1\nsg.GlobalIlluminationQuality=2\nsg.ReflectionQuality=3\nsg.PostProcessQuality=3\nsg.TextureQuality=3\nsg.EffectsQuality=3\nsg.FoliageQuality=3\nsg.ShadingQuality=1\nsg.LandscapeQuality=3",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The shared saves are broken, makes it extremely difficult to play with a friend, which is the only reason I bought this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "With the Axl update they've nerfed everything you use. weapons, armor, everything. i cant in good conscience recommend this game until its finished",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I played during the free weekend. I really enjoyed the first Grounded so this has been sitting in my wishlist for awhile.\n\nUnfortunately I had frequent GPU crashes with my 4080 Super. These crashes seemed to occur most often during combat which added an extra layer of frustration. Looking at the subreddit, it seems plenty of other players are experiencing GPU crashes which is a shame. If they are able to resolve these crashes, I would consider revisiting the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Graphics are good, but laggy. Art style is cool. Gamplay's not captivating, though. And I've played (and loved) extensively in Valheim, Terraria, Enshrouded, Conan: Exiles, etc.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love that Grounded 2 exists and look forward to full release. But I really don't understand why devs insist on players not having fun. The Hairy & Scary update is a perfect example of this. Hopefully things will be better further in development but as of right now, I am not playing it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game just was not fun at all after playing grounded 1, it's basically the same thing with a more boring map, and less things to do.  Yet here we go with this will be released every three months nonsense.  Don't even get me started on the horrible optimisation even with the best cpu and GPU.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Build a stable framework, then add your content. Nail the controls. Nail the UI.  Nail the netcode. This is a mark that Obsidian has completely missed. Build that stable foundation and ONLY THEN build upon it with features and content.  It's been months since this released in EA, and Obsidian is by no means a small dev team...  There is no excuse for the complete lack of basics here. I have played very few games where the controls were as broken as this.  I thought the recent update addressed this... nope. I would caution potential buyers to wait until full release given the basics are not a priority here.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "At the time of writing this, the game is almost unplayable. Strong enemies lurk almost everywhere and at all times. When you fight an enemy, they will almost always call for backup. It is not uncommon to end up fighting 6+ enemies at once, an unwinnable position. On top of that, the introduction of roaches, a common neutral enemy who will swoop in and loot your kills before you can make even a win feel like a loss. \nConstant raids by some unnamed antagonist get in the way when you are just trying to work on your base. The ability to repair your buildings is glitched and doesn't always work. \nThe class benefits are lack-luster and unbalanced. Kills for mutations are not always counted correctly.\nOptimization is abysmal, even on a good quality gaming rig, I had to play on the lowest graphics settings and still experienced frequent lag.\nThis game may mature into something good eventually, but do not waste your money on it now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gameplay is a lot of fun when you can actually play it, unfortunately it runs so badly with constant crashes you can't really make much progress.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hairy and Scary Update Combat nerfs are horrendous and poorly implemented, No one is going to want to play rogue after this update.... i sure won't",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Reviewing over the free-to-play weekend and oh boy you'd think that they'd put their best foot forward. In the span of my short playtime: \n- My game crashed in the first three minutes. Like I didn't even watch the cut scene, it crashed as I hit play. \n- My friend was completely unable to join multiplayer, as his game crashed four times with only two times being loaded into my world. \n- Because of their failure to join (but also being in?) I was completely unable to craft (like I repeatedly had to check my key binds because Z was just not working)\n- Back in the solo run I got outside and realized that the crafting system was a bit clunky for my taste, and with nothing really motivating me to continue I just uninstalled and shrugged. \n\nIt's early access, and clearly there's a lot of love poured into this. However for $30 you either have to be a hardcore fan of the game/studio, or really into bugs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Early Access means it's too early to buy this crap.\nSummary: Poorly optimized, buggy, and underdeveloped.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "RTX 4090\n\nBattlefield 6 on max = 150 fps\nGrounded 2 on min = 80 fps\n\nI would say it's funny that a game in 2025 doesn't have DLSS, but the graphical settings basically don't affect FPS, so this is a question of optimization. I don't know what they smoke before releasing such games.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's very unoptimized for multiplayer. My whole group turned down the graphics and still ended up crashing. Disappointing because we loved Grounded 1 so much and waited a few months to play it. I believe the devs should have waited until the game was more polished to release this. I'm so upset I paid $30 for an unplayable game, regardless if it's still in early access. A game in early access is expected to have bugs and problems but this was just unplayable for multiplayer. So if you plan on playing with friends I'd wait until it's 100%",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i understand that its pre-release beta but this should've never left the workshop. your hit box is the size of the elephant so the bugs just have to swing and they hit you. game is constantly crashing and you and your items falling through the map. lost my mount from loading into the game. will be a great game when all bugs are fixed, but shouldn't have been released as is. absolutely atrocious game play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game glitched and when i came back my fucking willard was gone. they took my god damned ant. they took willard from me. devs. count your days",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Since new patch Hairy and Scary (quite fitting considering the problems) I've had a lot more crashes and now it's corrupted my saves. Lost 156 days played on a shared world with lots of powerful gear and also some of the unique weapons which have completely disappeared from the game and my all my mutations reset to the point of 66 days played, randomly. Was really enjoying the game until this, now I can't bring myself to play anymore. I would be willing to re-grind it all out on the same play through if it wasn't for the fact that I have no way of re-acquiring the unique items now as their 1 time only per play through. With its current state of instability I couldn't recommend even if it is early access, outright deleting peoples progression shouldn't happen many other bugs I can accept. If fixed and game works well again then by all means yes it's a fun game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i have a good gaming pc and it barely runs even on lowest graphics it was so bad it made me feel motion sick. im really sad because i loved the first game and had over 350 of in game days played on it but grounded 2 is barely playable for me also why were the bugs SO LOUD?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buggy, AAA early access game that barely runs on modern hardware. not worth the money in its current state. only update in 2 months is 4 bugfixes. can't recommend.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game is currently unplayable for lower speced PCs and laptops. On literally the lowest settings (plus forcing lumen off) I get around 50 FPS on a 3070. My wife and I just want to play together but she is getting around 15 fps on her 3050. Obsidian's thought process still baffles me. Not everybody can afford a 5090.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No optimization at all - they just snugged everything under a layer of upscalers.\nAs a result - unplayable - around 5-10 fps on Steam Deck. This game doesn't look any different than the first one even, and the first one was quite playable on SD.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}