{
  "positive": [
    {
      "review": "Great game so far!.! There are a lot of options for play here, love it. There just needs to be a minimum player speed for us older players who think holding down the button makes us faster xD my finger is feelin it. Thanks for a great game!.!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun little game. Nice bullet hell with simple game loop. Recommended",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if dont starve and diablo 2 and halls of torment all got together to create a game. really fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is a pretty fun game. easy to learn .. worth the 12$? yes. if you want to sit back and relax and get more out of a game like vampire survivors this is the game for you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is an extreme grind and I'm here for it. Love the graphics. Like the loot. Enjoy the common upgrade skills. I'd like to advance quicker, I'd like more skills. Yet, I enjoy each run and have the ability to change difficulty on each run.\r\n\r\nTip, sometimes you need to go back to move forward.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Barely thumbs up.  I like the game play style and the graphic style.  However, the grind is real!!!  Ugh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addicting gameplay. If you've ever played the Survivor's Bane event in Diablo Immortal, it's just like that but better. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great artstyle and fun gameplay loop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay this game is fantastic, its literally OG Diablo + Vampire Survivors with Don't Starves art style. Great game soo far. The gameplay and progression is very fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely a bit of bullet hell in the mix, but for me the inclusion of multiple upgrades, equipment mods, alternate and variable attack styles forcing you to use different tactics is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a ton of fun to play. A couple of quality of life things are still missing, that I'd love to see in the game - Level cap could be increased for those really juicy runs that you've maxed your timer and curses out, so it feels more fun maxing out your skill levels. 6 skills seems a bit too much in regards to you always end up barely leveling 1-2 of them. I've even had runs where I ban 1-2 of my active skills which made leveling the rest of the things I wanted way easier, but that doesn't feel like the way you're supposed to use bans. I was hoping that maxing out the skill upgrades and getting more multi levels would help with this and it does to an extent, however 6 is just a bit much, and it rarely helps any synergy too. One other very major bummer for me is chasing the item (non-exp/gold) drops, especially on runs with maxed magic item find. You have to heavily invest in movement speed and it still feels very unsatisfying missing so much loot, a lot of it to the fact that you can't even see it in the very late stages of the game, so having another permanent upgrade to help with collecting loot other than exp/gold would do wonders for the late game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game so far. Just beat the first boss. It did feel weird getting legendary items so early, and they didn't seem to be THAT significant of upgrades. May feel better if they were more scarce but more impactful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game.  Easy to  lose track of time.  Id change the monk punch graphic--kinda looks like an eggplant emoji.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game and is helping me get through my recovery after a motorcycle accident. \r\n\r\nGraphics are nice and I like the art style. Looks wonderful on my 45\" 1440p monitor. \r\n\r\nProgression is going good so far. Though I worry I will upgrade a specific characters stats then decide I like a different better and won't be able to refund/get anything back for those stats on the other class. Guess it's a way to force people back to grind lower stuff.\r\n\r\nThe gear/item colors and such are a bit confusing to me. I can't really tell which items are higher level/quality. I try to go the typical route most games do but then I notice the base stats higher on a grey item.....\r\n\r\nBut yeah it's keeping me entertained while I recover and it plays really well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tower of Babel:  Survivors of Chaos is an interesting take on the bullet hell genre.  It's interface is VERY Diablo inspired... The game has persistent skills, as you'd expect, but relies more on weapon upgrades to progress.  One annoying thing is that progress is not saved across different classes, so it's tedious to start from the ground up.  Graphics are good, skills are fun but the sound effects can be annoying after a while.\r\n\r\nStill, it's fun to play and has the potential to be a real blaster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game so far. Would like some more level based exploration, similar to diablo, but pretty fun. Would like a class customization that gave you small perks that stayed. The content is fun. If you play Binding if Issac and Brotato you'll probably enjoy this. I would like to be able to do levels with it where you have to travel somewhere instead of run randomly so theres a bit of an objective other than survive. Good game over all and for the price worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyed this game a lot. Overall love the gameplay, graphics, setting. I wish it had a little more story to drive me to complete the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great mix of diablo and a bullet hell/survivors game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is barely a thumbs-up for me.  It's not as bad as some reviews make it out to be, but the grind is real.  It doesn't need to be this grindy.  Combat feels good, graphics are good, itemization seems solid.  They just bumped gear drop rates, but it needs more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, with the weird glitches & everything it seems like Ai makes the game and the devs babysit it.\r\nAlso, a DLC for a cosmetic is meh.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This morning when I woke up I closed my eyes and saw green and blue XP gems everywhere... that's when you know you've been playing this game too much.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "simple and fun. many build and equipment options to keep a person entertained for a while. it is well worth the money. i like the updates and hope to see more classes like a necromancer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing Fun!! Just buy it!! u  cant go wrong!! 5 STARS!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, hard and loot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a blast.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing game of the year",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellence <3 <3 <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "money well spent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "diablo like survivor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "b",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have a hard time judging how I feel about this game, but I'd feel wrong leaving a bad recommendation (because it was fun for a while) so although this review is largely critical, I'm still leaving a positive review.  Maybe my expectations are too high for a small indie dev, but this game is SO close to being my favorite bullet heaven game because it has most of what I want in it.\n\nAt first, this game felt really fun, in the same \"bullet heaven\" genre of games that's been recently popular + [i]Diablo[/i]-style loot/drops.  In the beginning progression felt fun, and loot drops felt fun, but after ~28 hours of playtime, unlocking the rift/portal feature, and getting to just floor 13, I think I'm done, at least for now.\n\nHere are the things that caused me to lose interest:\n\n- Some enemy design is downright obnoxious/stupid (the damn crows (AWFUL - too fast, too tanky, too unpredictable with movement especially when they veer towards you), the ice skeletons that release unpredictable projectiles on death, the wasps, whose projectile color is the same as every enemy that spawns rendering them REALLY hard to see and ESPECIALLY the elites that mark you for death and if you don't kill them in 30 seconds they instantly kill you even if they don't touch you.\n\n- At first progression felt okay, but in later floors it feels a lot like \"hey your build is feeling pretty strong now, you beat the floor!  Now try this next floor that's ball-stompingly hard and grind it until you can beat it so you can do the same thing on the next floor :D\" It could use some smoothing out.\n\n- Crafting needs more QoL.  Why do I have to pull stuff from storage and THEN bring it to the NPC?  If we're in the hub why can't the UI for the NPC just allow me to pull materials from storage to use?\n\n- Boring stats on gear aside from legendaries.  Legendaries have fun ability-altering stats, everything else is +1% crit chance, +3 Strength, +2% HP recovery, etc.  Also non-legendary gear seems to come in two flavors: one with a star on it (meaning at least one stat is its max roll for that stat on that piece), then some rares are marked as \"empowered\" or something like that in the text, I have yet to figure out what difference it makes, it is not explained.\n\n- In later stages and with tons of enemies on the screen, the transparency options that exist are *not* enough for the screen to be readable.  We really need options to make our own abilities like maybe 10% opaque, then options to make enemy projectiles more opaque, or all a single obvious color, like red or something.  There's SO much visual noise, even with the existing settings being used.\n\n- The blacksmith banging away constantly is a minor complaint but its so annoying when you're trying to think.  Please give  us an option to mute him and the alchemist noise too.\n\n- Upgrading gear could be a lot more fun if it was like, upgrade it to level 5 then CHOOSE from 5 potential upgrades, rather than at level 5 here's this random and probably useless stat, but you can reset this item's level 5 times to get different (and probably useless stats).  And maybe you can reset each item once/twice or something. Then at level 10 choose from 5 more, etc.  Just a thought.\n\nI will say each update to this game keeps making it better and better so I'll probably re-visit after the next update.  Please do not give up on it, you do have a fun game here, it just needs some more polishing :D\n\n[b]OVERALL RATING:[/b] 7/10",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Writing an early review at a point shortly after I could have refunded the game, will update at a later point.\n\nWell, this is Vampire Survivors with the Diablo III item system, graphics stolen from Darkest Dungeon and sound effects stolen from Halls of Torment. Does this game add anything new to the genre? I fear not. \nIt is, however, very solid. The graphic style my be stolen but it's very polished and crisp. I applaud the fact that they didn't use early 90s pixel graphics and called it retro once more, a trend that has become annoying (and I am saying this is somoene that DOES value gameplay over graphics).\n\nIt comes across a bit dull if you played more games of this genre. You'll get showered in items and the grey quality is obsolete as soon as the first time you are allowed to equip them. Blue rarity is outdated after your second run. Most items only scale a big selection of stat-tweaking, so that isn't exciting either. Only legendary items do have special affixes and as far as I can tell they tweak the existing skills, haven't seen one yet that actually has a special ability on it's own. \n\nTher [i]are[/i] various ways to enhance, transmute and pimp items which I can't use yet because the resources for that (like gems) haven't dropped yet but I since everything follows Diablo to the point I guess that won't hold any surprises, too. \n\nNon-itame meta progression is done via gold and is more or less limited to a few stat increases and upping the chance of multi-levelup for the various skills. The latter might be the only thing about this game that I haven't seen before and it isn't much. \n\nI still recommend this game as of now beause I can't give a neutral review and the game will still be entertaining enough for anybody new to this genre. But if you have about a dozen games like this in your library, don't bother unless you are a collector.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Fun little game. Nice bullet hell with simple game loop. Recommended",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "If you're looking for a bullet heaven sort of game that is really about the grind - grinding to get slightly better gear, grinding to earn just a little more gold to level something up, etc... then this is the one for you. \r\n\r\nI find these sorts of games to be a bit meditative, a good way to turn my brain off, and this one is definitely doing it for me. I love the art style, it makes me think of Don't Starve, and there is a decent variety in the skills you can pick up as you go. \r\n\r\nI don't know what this game is doing anything particularly new in the space, though the gear does make this feel a little like if Vampire Survivors and Diablo had a baby, which is the kind of description that would have led to me checking this game out if I wasn't already sitting here and reviewing it. \r\n\r\nKill things, get killed, do it all again. That's a bullet heaven + roguelike in a bottle.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Great game so far!.! There are a lot of options for play here, love it. There just needs to be a minimum player speed for us older players who think holding down the button makes us faster xD my finger is feelin it. Thanks for a great game!.!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Please add player trading\nHello developers! First, I want to say thank you for this amazing game. It is very cool and I really enjoy playing it.\nI have a suggestion. Please, can you add a trading system between players? I think it would be very good for the game. For example, we could exchange items or resources that we don't need. It would help a lot.\n\nThank you for reading my idea. I hope you can add this in the future.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "The dev has listened to the community and implemented some big changes that make the game much more fun also without making it too easy.\nI have played since the beginning and after the EA release I just couldn't recommend the game because it did not respect your time.\nFinally, this game feels like it is heading the right direction and I hope more people will give a try.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game has a TON of potential, so I'll give it a thumbs up. But there are some glaring issues, hopefully the devs see this and can make adjustments:\n1) All characters need a dash. Bullet hells get boring without a dash, and in this game you get swarmed at the end of every level, which can feel unfair without that dash.\n2) There needs to be objectives on the map. Bonuses, loot, etc. Something to move towards - not just WASD in a circle.\n3) There needs to be more differentiation in the characters. Right now they feel essentially the same. Maybe the spellcaster gets spell crit or double cast, etc.\n4) Yellow and legendary items feel the same, with a small perk on the legendary items. Maybe make rares have higher tiers, and legendary lower tiers with that perk? Also gray and blue items are worthless, just Charsi fodder.\n5) The game does feel pretty grindy at times, as others have suggested. Feels bad to beat a level and then fail the next level multiple times just trying to RNG some better gear.\n6) I personally prefer shared progress between characters. Some is shared, but some is by character, so once you get a high enough character it feels bad to switch.\n7) You never really feel like a GOD, which is what bullet hells are for. This one could be tougher to fix - maybe higher cast speed / attack speed? \n\nCarry on devs, will return for the next update!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "First off, I really love the art for this game. \r\n\r\nSecondly, it's pretty challenging when you choose the higher difficulties. And if you're stubborn like me and want to try everything on Nightmare without working your way up, it can get downright impossible, but I'm here to tell you with the right build and RNG being on your side, you can get through it with some persistence. \r\n\r\nI really love the huge amount of skill slots. You can slowly become a bullet hell boss yourself. \r\n\r\nVery fun so far. It's difficult but not in an enraging way. There is some luck to it but usually when I die it's because I was prioritizing the wrong ability or didn't pay attention to where the enemy horde was.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Tower of Babel: Survivors of Chaos has a fun and satisfying gameplay loop with rewarding loot drops and strong build synergy. Getting good gear feels meaningful, and the upgrade system keeps you pushing higher floors.\n\nHowever, progression is quite slow, and the flat 2D art style makes it difficult to judge distance to projectiles and enemy hitboxes, which can feel unfair—especially for melee builds that don’t seem to have extra mitigation to compensate. Some rare enemies and bosses hit extremely hard, making close-range play feel punished.\n\nThe maps also feel pretty empty. There aren’t really secrets to uncover, and crates or barrels rarely drop anything useful, which makes exploring the floors meaningless.\n\nOverall, it’s enjoyable and addictive once you get rolling, but it has some rough edges that hold it back. A solid pick if you like roguelite ARPGs and don’t mind a slower climb.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game seems like it's on the path of evolving the standard vampire survivor into something more complex by combining it with something else. In this case, the something else is the pretty common AARPG loot system, and I'm loving it. \n\nI agree that the game gets pretty grindy within too short a time, but it's still entertaining if your brain go burr while you smack hoards of enemies with a decent array of spells and loot their bodies for sweet sweet experience and treasure.\n\nThey could definitely use some more systems for leveling characters and boosting gear, like quests, combining and breaking down equipment, ect. (just all the stuff that other titles in these genres are already offering).",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is an extreme grind and I'm here for it. Love the graphics. Like the loot. Enjoy the common upgrade skills. I'd like to advance quicker, I'd like more skills. Yet, I enjoy each run and have the ability to change difficulty on each run.\r\n\r\nTip, sometimes you need to go back to move forward.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game strikes a nice balance between a Diablo style looter and bullet hell. So far I’ve really been enjoying it, it plays great on the Deck. Give it a go!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Vampire Survivor's, but more complex and more difficult - Highly recommend",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It is \"early access\" so I look forward to what the final build of the game looks like.\r\n\r\nGame is great so far. Got on sale for 9 USD, played 5 hours so far. Loot/progression is completely unbalanced right now. This is a 30 hour bullet hell that is currently (SEP 10 2025) tuned to take 200+ hours to max (my guess). Magnet at end of each level to pick up any stray gold would be appreciated.\r\n\r\nAs a fan of the genre (Halls of Torment, Rogue Genesia, Jotunn Slayer, Vampire Survivors, Death Must Die, Conquest Dark) if progression was faster (cheaper upgrades/more gold per drop) and loot was more interesting (synergies between Legendary effects) this would be a highly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Tower of Babel: Survivors of Chaos wastes no time pulling you into its dark-fantasy premise: a lone hero ascends a cursed tower that grows more hostile the higher you climb, a place where monsters swarm in increasing numbers and every floor becomes a test of adaptability and survival. The game puts its focus squarely on fast, kinetic hack-and-slash action, presenting each run as a condensed gauntlet of escalating danger. Whether you choose a bruising Warrior, a spell-flinging Wizard, or a close-quarters Brawler, the early moments set the pace — you are outnumbered, constantly pressured, and pushed to rely on quick reflexes as much as your character build. The premise is simple, but the execution thrives on intensity and momentum, creating a loop that feels immediately satisfying even before deeper systems begin to unfold.\n\nAt the heart of the game is a blend of roguelite randomness and action-RPG progression, and this hybrid structure gives Tower of Babel its personality. Every monster you defeat spills gold, souls, or loot; each item carries randomized affixes that nudge your character toward different builds. A single run can transform from a straightforward melee slugfest into a rapid-fire crit machine or a spell-amplifying powerhouse depending on what drops you encounter. The unpredictability keeps each floor exciting — even when you fail, there’s a sense that the next attempt might click just right. The game encourages experimentation by giving you frequent opportunities to rotate gear, adjust strategies, and pursue unexpected synergies that emerge mid-run. This makes climbs feel less like linear exercises and more like improvisational problem-solving under pressure.\n\nThe tower itself is crafted with a clear dark-fantasy identity. Hand-drawn 2D artistry gives each floor a distinct mood, from shadowy halls to fiery chambers to eerie, ruin-laden corridors. The environments aren’t overly detailed, but they establish a visual rhythm that helps each ascent feel like a journey through a folkloric hellscape. Enemies swarm in varied formations, bosses punctuate the climb with bursts of challenge, and the screen often fills with enough chaos to make victories genuinely thrilling. The visual clarity holds up even when dozens of enemies, spells, and animated effects converge at once — a critical quality for a game that lives or dies by its responsiveness.\n\nYet its Early Access nature does show through in certain areas. Despite a variety of classes and gear types, the balance between skills and basic attacks is not quite even. Some classes feel most effective when relying heavily on standard attacks, which diminishes incentive to invest deeply in skill upgrades or more complex builds. Likewise, the itemization — while generous in drops — can feel overly dependent on luck. Non-legendary gear becomes obsolete quickly, nudging players toward hunting specific rare drops instead of crafting adaptable builds. These balance issues don’t ruin the experience, but they do create occasional moments where strategy takes a backseat to the randomness of the loot pool.\n\nThe structure of the runs is fast and digestible, but also somewhat narrow in scope. With only around a dozen floors to ascend, a run never overstays its welcome, but it also doesn’t offer long-form progression or the sweeping arcs that some roguelite fans may crave. The short length works well for players who enjoy quick, repeatable bursts of action, but others may find the format limiting once they master the early floors. Still, the developers have stated their intent to expand the game with new floors, enemies, classes, and features, and the solid foundation already in place suggests the game could grow considerably with future updates.\n\nDespite these limitations, Tower of Babel: Survivors of Chaos succeeds in delivering a high-energy, loot-driven action experience that is easy to pick up and hard to put down. Its synergy between gear randomness and fast-paced combat keeps runs dynamic, and its clear visual style reinforces the frenetic pace without confusion. For players who enjoy experimenting with builds, chasing the thrill of lucky drops, and carving through hordes of enemies on the climb to an ever-higher floor, the game offers a compelling and addictive rhythm. With more refinement and additional content, it has the potential to stand out even more prominently in the roguelite action space. Even as it is now, it’s an engaging, chaotic, and rewarding excursion up a tower where every floor tests your resolve and every run feels like a fresh chance at mastery.\n\nRating: 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game so far, difficult without being impossible and love the mechanics.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy it a lot. And it’s nice when developers listen. Progress is kind of slow at first and I wish the survivors could dash. But it’s still early release and I’m having a lot of fun with it",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "3/5\n\nReally cool game, great gameplay and love the feel of it, but there is a pretty significant issue for me. Some key rebinds aren't allowed and that throws a bit wrench in my enjoyment. I play everything ESDF instead of WASD, so I keep mucking up some of my key presses. All that needs to happen is to allow E(interact) to be bound to a different key, but because interact isn't a rebind option it won't allow anything else to be bound to E. Fix that and I'd say it's a 4.5/5 game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is a pretty fun game. easy to learn .. worth the 12$? yes. if you want to sit back and relax and get more out of a game like vampire survivors this is the game for you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Nice and good survivor like with Diablo-like loot, i enjoying every second in this game, the grind the loot the upgrades and the gameplay its all adctive and well made, nice to see good indie games like this one. for me personal rating i give 8.5/10, very enjoyable experience and gameplay looping grind.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game considering the low price.\nIt is pretty much a combination of Vampire Survivors and Diablo.\nARPG gear and legendary augments, Vampire Survivors timer and waves of incoming enemies.\n\nMy only real complaint is they commit one of the cardinal sins of bullet heaven games:\nEnemy projectiles and AoE indicators are very hard to see with all the bogstandard screen clutter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A friend bought this game for me as a gift since they enjoy it, and I enjoyed another game they shared with me, Deep Rock Galactic: Survivor. This game currently feels simpler than that one, but is also enjoyable! The build diversity is interesting and has some cool interplay. The UI coming straight from Diablo and other loot ARPGs feels a little too much like stealing, but I don't know how they would do it differently and the familiarity makes it easy to jump in. I like knowing exactly how long I will spend doing a level (so far each floor is described by \"survive for this many minutes.\") I have played 5 levels and haven't died yet, but I've gotten somewhat close. This game makes me feel like I'm doing a good job making choices, but I can't say for sure what the difficulty level is. \n\nI know this is early access and features will be added/developed as time goes on. There are two things that I would love to be added. The first one is just a fun idea, and the second would take my recommendation from \"Buy if its on sale\" to \"I plan to buy this for my friends!\"\n\n1. There is the option to increase the difficulty for a floor. This seems to be based on lowering resistances and rewards you with increasing the drop rate. I would be interested in a fast forward option (hyper mode or something like that) that moves the game clock faster as well as making the character attack/walk faster and enemies spawn/attack/walk faster. Would allow me to tackle an easier level quickly when I don't have as much time to commit to the game. Would be harder to control so could potentially provide risk/reward opportunities for grinding gear.\n\n2. Multiplayer, please? I know not everything has to be a multiplayer, but at this stage in my life I just want to spend time with my wife and family when I'm unwinding at the end of the day. A game like this is way more relaxing/engaging (oxymoron? oh well, I want both) that just putting a show on the TV. But except for the days when my people are busy, it's hard to choose a single player game when I could choose one where I also get to spend time with them. I'm playing this game right now because it's new, but when the shine wears off, multiplayer would keep me coming back regularly and bringing my people with me. Especially if I can run split-screen and sit on the couch next to my wife while we play instead of across the room.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome roguelite bullethell with one of the more satisfying progression mechanisms I've seen in these kinds of games. First of all, I love [b]gear[/b]. That's one of the reasons Death Must Die is among my favorite games. This game is a lot about gear and optimization as well. Second, the different ways to craft/transmute just add more depth to the gear min-maxing. The abilities themselves are not too limited, but there's also not too much - Just the right amount.\n\nThe only thing I find slightly annoying is the Legendary affixes (they affect specific skills), and you can get them from the very first floor onward -- But of course, next floor/item level offers much better stats, so what ends up happening is I constantly have to remind myself \"which skills are being buffed by my equipped legendary items right now?\". However, it doesn't change my opinion of the game overall - just something to get used to.\n\nThis game used to be a bit on the worse side like half a year to a year ago, but now it's completely different -- And it seems they are constantly updating, with the new Hardcore mode giving you even more replayability. [b]Highly recommended, [u]especially[/u] if on sale.[/b]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tower of Babel has been a pleasant surprise so far. It’s simple in all the right ways, yet still manages to be genuinely challenging. The gameplay loop keeps you on your toes, and every run feels like it teaches you something new. I’m honestly loving it, and I can’t wait to see what new content and updates the developers bring next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful art style. Slow progression. Decent progression. Other reviews have a much better understanding of how this game works, so those are just my impressions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "20hrs in, so far it's amongst the very best VS like with a touch a Diablo touch with the loot upgrades and legendary objects skill synergy\nThe mana seems useless so far but maybe it involves stuff I haven't unlocked yet\nOtherwise really good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a mix of diablo-style loot / UI, but in a Survivors-type game.  Lots of ways to play the game, plenty of meta-progression, and a terrific theme.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the lvl advancing and loot is always fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic survival game, with a good nod to POE/Diablo/etc styled games.\nBit more persistent progress with more comprehensive character builds. \n10/10 fun game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "5/5. Very rare to find an action rpg rogue like that doesn't completely screw you over to milk content from endless replays. Art is pretty charming for a grim dark setting and the animations are super smooth. Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like AARPGs. roguelikes, and bullet hells , then you will like this. Has enough difficulty to be challenging, but not too punishing. I'm clearing all floors on hard for first clears as a personal challenge, and I have died a few times. As someone that plays POE, Vamp survivors, megabonk, etc. The game is great. Would love loads more weapons, but for now I'm enjoying it. Cant speak to the end game, but i do foresee it getting stale with the current limited weapon variety. However, Legendary gear can have affixs that alter skills which is very interesting and may be enough to keep it feeling fresh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun rogue like  love the grind wish inventory management was easier but still great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty meditative Vampire Survivors-like game, with art similar to Darkest Dungeon 1 and with features of classic Diablo (a \"doll\", items, etc. - similar to Death Must Die).\n\nIf you are into such games you won't be dissapointed. Thumbs up for this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Snizz Lickin fun, its like vampire Striver but with better end game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Putting 2 of my favorite things together in an indie game. I look forward to seeing more as this develops",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun in its current state, feel like it has a lot of potential still, will be interesting to see what the devs do with it going forwards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addicting gameplay. If you've ever played the Survivor's Bane event in Diablo Immortal, it's just like that but better. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great artstyle and fun gameplay loop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely a bit of bullet hell in the mix, but for me the inclusion of multiple upgrades, equipment mods, alternate and variable attack styles forcing you to use different tactics is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a ton of fun to play. A couple of quality of life things are still missing, that I'd love to see in the game - Level cap could be increased for those really juicy runs that you've maxed your timer and curses out, so it feels more fun maxing out your skill levels. 6 skills seems a bit too much in regards to you always end up barely leveling 1-2 of them. I've even had runs where I ban 1-2 of my active skills which made leveling the rest of the things I wanted way easier, but that doesn't feel like the way you're supposed to use bans. I was hoping that maxing out the skill upgrades and getting more multi levels would help with this and it does to an extent, however 6 is just a bit much, and it rarely helps any synergy too. One other very major bummer for me is chasing the item (non-exp/gold) drops, especially on runs with maxed magic item find. You have to heavily invest in movement speed and it still feels very unsatisfying missing so much loot, a lot of it to the fact that you can't even see it in the very late stages of the game, so having another permanent upgrade to help with collecting loot other than exp/gold would do wonders for the late game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game so far. Just beat the first boss. It did feel weird getting legendary items so early, and they didn't seem to be THAT significant of upgrades. May feel better if they were more scarce but more impactful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game.  Easy to  lose track of time.  Id change the monk punch graphic--kinda looks like an eggplant emoji.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game and is helping me get through my recovery after a motorcycle accident. \r\n\r\nGraphics are nice and I like the art style. Looks wonderful on my 45\" 1440p monitor. \r\n\r\nProgression is going good so far. Though I worry I will upgrade a specific characters stats then decide I like a different better and won't be able to refund/get anything back for those stats on the other class. Guess it's a way to force people back to grind lower stuff.\r\n\r\nThe gear/item colors and such are a bit confusing to me. I can't really tell which items are higher level/quality. I try to go the typical route most games do but then I notice the base stats higher on a grey item.....\r\n\r\nBut yeah it's keeping me entertained while I recover and it plays really well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tower of Babel:  Survivors of Chaos is an interesting take on the bullet hell genre.  It's interface is VERY Diablo inspired... The game has persistent skills, as you'd expect, but relies more on weapon upgrades to progress.  One annoying thing is that progress is not saved across different classes, so it's tedious to start from the ground up.  Graphics are good, skills are fun but the sound effects can be annoying after a while.\r\n\r\nStill, it's fun to play and has the potential to be a real blaster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game so far. Would like some more level based exploration, similar to diablo, but pretty fun. Would like a class customization that gave you small perks that stayed. The content is fun. If you play Binding if Issac and Brotato you'll probably enjoy this. I would like to be able to do levels with it where you have to travel somewhere instead of run randomly so theres a bit of an objective other than survive. Good game over all and for the price worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyed this game a lot. Overall love the gameplay, graphics, setting. I wish it had a little more story to drive me to complete the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great mix of diablo and a bullet hell/survivors game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is barely a thumbs-up for me.  It's not as bad as some reviews make it out to be, but the grind is real.  It doesn't need to be this grindy.  Combat feels good, graphics are good, itemization seems solid.  They just bumped gear drop rates, but it needs more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive, challenging and fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i think there could be some sort of quests in the game. \nAdd synergy with the abilities or make them upgrade since there are not many of them maybe add talents to the abbilities to make them be used according to the gameplay the user wants to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really nice game i just got back on it from a good time! needs more spells and maybe more mechanics, sums up a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please add a gameplay speed up / down [to 1.0x] option.\n\nGreat game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Flippin fun! Lots of great loot. Play one character only or play them all. Love the grind....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Progression, difficulty, leveling, abilities, much more well worth the small price tag buy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The more I play the more impressed I am. By far the best systems and enjoyable gameplay of any game in the genre, and I have played them all... Literally all of them, it's sad I know.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "playing on steam deck. love the art style, lots of loot, level progression is standard. if you enjoy auto battlers/rogues you wont be disappointed. enjoying my experience so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After the game its really good state of the  game. Still the loot rng need adjustment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game streamlines the gameplay loop for modern ARPGs, while using a combat and level-up system like Vampire Survivors or Spell Brigade. The item system is pretty much a facsimile of Diablo 4’s item system. I’ve only played a little bit so far, but I’m in love with it! \n\nI am a diehard Diablo 2 fan. To me, that is the greatest ARPG ever made. I think Last Epoch is pretty good as well, as far as modern ARPGs go. If you are like me and appreciate those two games, I think you will like Tower of Babel as well!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "É um jogo pra brincar meio que sem ter que pensar em muita coisa. Eu acho divertido. A customização fora da run deixa o jogo mais interessante e dá mais coisas pra fazer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game and for under $10 dollars! A worthy Bullet Hell title!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Other than some small QoL stuff it's a fun game. Tried the demo and after buying the full game somehow lost 4 hours of my day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for EA its fun enough, hope they keep cooking. The smith and alchemist aren't quick to adopt.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grindfest ???  More like Funfest !  Nothing but fun if you enjoy these type of games.  Great job to developers.  Don't listen to the video game snobs, Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it\n\nafter 40hrs only at midgame, i like to move slow and overprepare\n\nlook for items that have bless(+++)ban(++) to chase builds, with enough bless and ban, wearing build enabling unique comes online\n\nhappy hunting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am amazed how good this game is. I wish developers continue improving it and adding new levels.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I really want to like this game. It has cool artwork and an a core game play loop that I typically enjoy. But, it's giving me the ick.\n\nI love the artwork. I really like the idea of item-style RPG elements in a survivors-type game. The legendaries change how the spells work and boost their output, which I think is a pretty fun aspect. For example: I got a couple of items that tweaked the skill corpse explosion. I was so excited to see them in action. However, the next 4 runs I did I never got that skill. When I did, it was a blast! It was so fun to see my damage improve so much. Whenever I don't get offered the spells that I have built my items and blessings around its just such a frustrating slog.\n\nIt's way too grindy and the blessing system is just boring. I know its in early access so I would love to see some improvements to smoothing out the grind and letting me to choose maybe 1-2 spells to start the run with. That way I can start the run with the spells my items are supporting.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Uninstalling this dogshit/broken RNGfest, evade doesnt work, blessing doesnt work ( hello gold ??).\nYou can have a full chaos 30 run (getting to lvl 100 ) without seeing your most needed spell, or the full run without XP bonus or magic item find.\nsorry im done",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Art style is not bad but just way too many of these clones... needs better implementation its just not great. Stats and powerups are not working as it should. Legendaries dropped on my first run, doesnt feel very special stat wise/powerwise. Might change in the future with updates.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It is kinda of fun but after 20 hours it gets boring.\nYou will find some spells that you like and some items that change the way the spells work and you will grind with them until the end of time.\n50 hours and i cant beat lvl 14. You need gold to upgrade your base stats and chances of spells to level up faster but not the base dmg of your spells.\nThe crafting and modifying of items isnt really user friendly or intuitive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hit detection is badd",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "New class feels decent but the downside of this game is immense. The idea is there but the dough is terrible. Chance for a decent run with success is near 0%, same with the \"loot system\" 99.99% is trash and the \"meta\" upgrade is flat stat increase like 0.1% of the stats and skills that are so random in any run even if you're far enough in the game to have some decent legendarys you fail miserably. The loot goblin who steals almost everytime the better loot at the end after a failed attempt is a nice addition to that terrible system.\nThe monster behaviour is a little bit better since the beginning but still terrible.\nUpdate 1.8: Loot droprate increased with a smidge more valueable gear. Circling crows are still annoying af and the monster spawn rate at the end of the level is beyond ridiculous. Whole screen is filled with monster even with AoE builds.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "An aggravating, grind fest. \nEquip an item that gives a skill a boost? \nProceed to do the next several runs NEVER getting that skill.\nBless a skill? (Blessing a skill makes it more likely to appear on level up) \nProceed to get that skill at the same rate as any non- blessed skill.\nItems are all roughly the same. After a few runs you will have all \"legendary\" and will simply get better versions.\nGetting gold is the only thing that matters in the end game. It might take several runs just to get a +1% increase in attack power.\nChaos runs are unfulfilling. \nIt is in early access. If I had to do it again, I would have let it cook more.\nIn it's current state, it's frustrating and not fun.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "The game has a novel roguelite + diablo approach. Unfortunately it is incredibly grindy for its limited content. The sheer number of loot items that drop is too much to go through after every level. Making it worse, top tier items (epic/legendary) drop constantly but are so watered down it makes no difference. \r\n\r\nThe game just isn't balanced properly. It would be better to drop 25% of the loot and make the drops more meaningful. Right now its just a grab-bag of stuff, 99% of which you'll never use.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "I liked it at first but it feels a little halfcooked.\r\nGear feels nearly useless besides the legendary bonuses.\r\nGear stats is simply too small to be impactfull, getting 1-2% skill speed.. aint much. \r\nSome skills are better at rank 1 than other are at max rank 25.\r\n\r\nThere's only 1 map on repeat.\r\nSome enemies explode for your whole hp pool which is fun when you've got a good run then BOOM dead out of the blue.\r\n\r\nBUT\r\nThis is early access, there's hope for this one to become something great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "This game is a combination of Vampire survivors and Diablo. Pretty much a copy of Death Must Die.\r\nI think theyre trying to make a better version of DMD but it needs work. \r\nIf you wanna play that card \"its an early access game\". DMD and Vampire survivors early access was wayyy better. Why do we enjoy these type of games? its to farm and break the game with different combos, in this game its wayyyy to difficult to pull its off. I'm not gonna go in dept of why the game is boring or how to fix it.\r\n\r\nJust don't waste your time or money on this game until full version? i recommend if the full version comes out check out some videos on youtube before buying.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I really want to like this game. It has cool artwork and an a core game play loop that I typically enjoy. But, it's giving me the ick.\n\nI love the artwork. I really like the idea of item-style RPG elements in a survivors-type game. The legendaries change how the spells work and boost their output, which I think is a pretty fun aspect. For example: I got a couple of items that tweaked the skill corpse explosion. I was so excited to see them in action. However, the next 4 runs I did I never got that skill. When I did, it was a blast! It was so fun to see my damage improve so much. Whenever I don't get offered the spells that I have built my items and blessings around its just such a frustrating slog.\n\nIt's way too grindy and the blessing system is just boring. I know its in early access so I would love to see some improvements to smoothing out the grind and letting me to choose maybe 1-2 spells to start the run with. That way I can start the run with the spells my items are supporting.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "The Game is fun to discover but it simply takes too long to scale ,  its too grindy and repetitive. they release few more levels  that forces you to grind the same 20 mins + runs over and over just to get enough gold to upgrade perks and the gold cost scales super hard. they just dont respect ur time\n\nEdit: New Patch Adressed towards this , it might be better now",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was looking like a good game until level 6 where it turned into a bullet hell. Spawning waves of enemies with range. Did not want a bullet hell game. Was not advertised as a bullet hell game. This is the straw for me.\r\n\r\nOther issues are:\r\nThe 4 characters are also pretty much the same. All skills except for the basic attack are shared between them. There are also way too many skills, and the choice feels meaningless. You get all the skills from level 1, So there is no unlocking or progressing to get other, more interesting combinations. You also have no control (through banishment) of the skills. Maybe later on when you have enough +banish on your equipment you could build what you want. But to begin with, it's just a case of \"pick whatever has the highest level\".\r\n\r\nThis means you can't focus the alter on any one skill. Not that you'd want to as the prices shoot up massively after a couple of levels. So you're better off just levelling everything evenly. Especially as you don't have any real control over what skills you're going to pick anyway.\r\n\r\nThe item comparison UI also sucks. The \"what you're going to lose\" section doesn't actually tell you what changes. So if you have 3% on the item you're replacing and 4% on the item you're replacing it with, it still says you're \"losing\" 3%. No one wants to see it this way. And you don't even get to see both rings at the same time. You have to \"hold Y\" to swap. An absolute pain in the neck.\r\n\r\nMost of the failed runs I have were just due to \"chip damage\". Purely caused by not getting a healing skill. Just 1 or 2 levels of a healing skill massively increased the chance of succeeding in a level. It basically turns from 20 minutes of \"don't get touched\" into 20 minutes of \"ehh, I can run through these guys\". If there was just a little bit of base healing, then the game would feel much less random and reliant on these \"keystone\" abilities. \r\n\r\nThe teleporting insta kill enemies are also a massive pain and just bad game design. Deaths caused by things popping in directly in front of you for a one-hit-kill is not a fun game mechanic. A much better way is to just give them a large amount of health and to speed them up. \r\n\r\nThe passive skill descriptions are also really bad. What skills are affected by what area or range upgrade? Who knows. Got to go look at an external source to figure out what's affected. In the active skill descriptions there are all the skill tags, why not put those tags in the passives?\r\n\r\nIt could have been such a good game. If they just:\r\nFix the item UI.\r\nMake the skills gradually unlock (for the New Player Experience).\r\nMake the skill upgrades less grindy (although, this could be a symptom of the bad skill system).\r\nStop making \"chip damage\" the main cause of death.\r\nRemove the teleporting enemies.\r\nFix the skill descriptions.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Very good looking but also extremely boring game. Every upgrade and item revolves around small numbers going on extremely small increments for the sake of longer play time, but the game is not offering any \"fun\" for you to want to chase that.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "TLDR, other games have done it better in almost every aspect.\r\n\r\nOkay, I have played for 39 hours.  The game was fun at first, but it's a grind.  Too much grind.  Eventually all of the monsters only move erratically, fast, and also have projectiles as well.  As with all of these games... RNG is the core element.  Sure you can equip things that can alter the skills in various ways but I just can't stay interested.  I am on floor 13 and have unlocked another dungeon but it still feels like a part of the game is \"unavailable'  what are the runes for?\r\n\r\nI am just losing interest...  I am not winning by skill, I am winning because I got good RNG this run.  There is no feeling of accomplishment.  Just feeling lucky and if you like that aspect then you might like this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I very much wish this game had multiple save files.  Forced to not recommend until it's fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to give it a thumbs up but in it's current state I cannot.  The mobs are way too overtuned which in turn leads to the rediculous grind requirment.  This is the kind of game I want to jump on and spend an hour having fun blasting away at a some mobs, leveling up my char and feeling my efforts and time investment were rewarded with a sense of achievment through the progression of my character.  But you hardly move the needle and have to play the same level OVER and OVER to level up - then you need to do that for the other chacters should you want to play them but for myself Im over it before even considering repeating the grind to level them up.  It's unnecessarily grindy and its really taking away from this game potential.   Obviously its still in EA so if they fix some of these issues I'll give a thumbs up but until then there are similar games that do the same thing just are more fun.   Remember DEVS games are meant to be \"FUN\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Art style is not bad but just way too many of these clones... needs better implementation its just not great. Stats and powerups are not working as it should. Legendaries dropped on my first run, doesnt feel very special stat wise/powerwise. Might change in the future with updates.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i feel like this game is just Auto attack its to strong, the skills feel underwhelming lack of builds with them. legendary items are a D4 carbon copy and D4 Bad, they somehow managed to copy the underwhelming crappy-ness of D4 legendary items. even the  prefix sand  suffixes feel pointless. They might need to go Play Path of exile 1 and 2 for inspiration.  You're better off Buying MegaBonk more viable builds and in that game challenges have unlocks and rewards you for exploring. there is no reason to explore a floor in this game. there is Nothing Out there but some empty boxes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Uninstalling this dogshit/broken RNGfest, evade doesnt work, blessing doesnt work ( hello gold ??).\nYou can have a full chaos 30 run (getting to lvl 100 ) without seeing your most needed spell, or the full run without XP bonus or magic item find.\nsorry im done",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Slow, boring, no satisfying progression or power jumps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is kinda of fun but after 20 hours it gets boring.\nYou will find some spells that you like and some items that change the way the spells work and you will grind with them until the end of time.\n50 hours and i cant beat lvl 14. You need gold to upgrade your base stats and chances of spells to level up faster but not the base dmg of your spells.\nThe crafting and modifying of items isnt really user friendly or intuitive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hit detection is badd",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "New class feels decent but the downside of this game is immense. The idea is there but the dough is terrible. Chance for a decent run with success is near 0%, same with the \"loot system\" 99.99% is trash and the \"meta\" upgrade is flat stat increase like 0.1% of the stats and skills that are so random in any run even if you're far enough in the game to have some decent legendarys you fail miserably. The loot goblin who steals almost everytime the better loot at the end after a failed attempt is a nice addition to that terrible system.\nThe monster behaviour is a little bit better since the beginning but still terrible.\nUpdate 1.8: Loot droprate increased with a smidge more valueable gear. Circling crows are still annoying af and the monster spawn rate at the end of the level is beyond ridiculous. Whole screen is filled with monster even with AoE builds.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "An aggravating, grind fest. \nEquip an item that gives a skill a boost? \nProceed to do the next several runs NEVER getting that skill.\nBless a skill? (Blessing a skill makes it more likely to appear on level up) \nProceed to get that skill at the same rate as any non- blessed skill.\nItems are all roughly the same. After a few runs you will have all \"legendary\" and will simply get better versions.\nGetting gold is the only thing that matters in the end game. It might take several runs just to get a +1% increase in attack power.\nChaos runs are unfulfilling. \nIt is in early access. If I had to do it again, I would have let it cook more.\nIn it's current state, it's frustrating and not fun.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "The game has a novel roguelite + diablo approach. Unfortunately it is incredibly grindy for its limited content. The sheer number of loot items that drop is too much to go through after every level. Making it worse, top tier items (epic/legendary) drop constantly but are so watered down it makes no difference. \r\n\r\nThe game just isn't balanced properly. It would be better to drop 25% of the loot and make the drops more meaningful. Right now its just a grab-bag of stuff, 99% of which you'll never use.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "I liked it at first but it feels a little halfcooked.\r\nGear feels nearly useless besides the legendary bonuses.\r\nGear stats is simply too small to be impactfull, getting 1-2% skill speed.. aint much. \r\nSome skills are better at rank 1 than other are at max rank 25.\r\n\r\nThere's only 1 map on repeat.\r\nSome enemies explode for your whole hp pool which is fun when you've got a good run then BOOM dead out of the blue.\r\n\r\nBUT\r\nThis is early access, there's hope for this one to become something great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "This game is a combination of Vampire survivors and Diablo. Pretty much a copy of Death Must Die.\r\nI think theyre trying to make a better version of DMD but it needs work. \r\nIf you wanna play that card \"its an early access game\". DMD and Vampire survivors early access was wayyy better. Why do we enjoy these type of games? its to farm and break the game with different combos, in this game its wayyyy to difficult to pull its off. I'm not gonna go in dept of why the game is boring or how to fix it.\r\n\r\nJust don't waste your time or money on this game until full version? i recommend if the full version comes out check out some videos on youtube before buying.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I really want to like this game. It has cool artwork and an a core game play loop that I typically enjoy. But, it's giving me the ick.\n\nI love the artwork. I really like the idea of item-style RPG elements in a survivors-type game. The legendaries change how the spells work and boost their output, which I think is a pretty fun aspect. For example: I got a couple of items that tweaked the skill corpse explosion. I was so excited to see them in action. However, the next 4 runs I did I never got that skill. When I did, it was a blast! It was so fun to see my damage improve so much. Whenever I don't get offered the spells that I have built my items and blessings around its just such a frustrating slog.\n\nIt's way too grindy and the blessing system is just boring. I know its in early access so I would love to see some improvements to smoothing out the grind and letting me to choose maybe 1-2 spells to start the run with. That way I can start the run with the spells my items are supporting.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "The Game is fun to discover but it simply takes too long to scale ,  its too grindy and repetitive. they release few more levels  that forces you to grind the same 20 mins + runs over and over just to get enough gold to upgrade perks and the gold cost scales super hard. they just dont respect ur time\n\nEdit: New Patch Adressed towards this , it might be better now",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was looking like a good game until level 6 where it turned into a bullet hell. Spawning waves of enemies with range. Did not want a bullet hell game. Was not advertised as a bullet hell game. This is the straw for me.\r\n\r\nOther issues are:\r\nThe 4 characters are also pretty much the same. All skills except for the basic attack are shared between them. There are also way too many skills, and the choice feels meaningless. You get all the skills from level 1, So there is no unlocking or progressing to get other, more interesting combinations. You also have no control (through banishment) of the skills. Maybe later on when you have enough +banish on your equipment you could build what you want. But to begin with, it's just a case of \"pick whatever has the highest level\".\r\n\r\nThis means you can't focus the alter on any one skill. Not that you'd want to as the prices shoot up massively after a couple of levels. So you're better off just levelling everything evenly. Especially as you don't have any real control over what skills you're going to pick anyway.\r\n\r\nThe item comparison UI also sucks. The \"what you're going to lose\" section doesn't actually tell you what changes. So if you have 3% on the item you're replacing and 4% on the item you're replacing it with, it still says you're \"losing\" 3%. No one wants to see it this way. And you don't even get to see both rings at the same time. You have to \"hold Y\" to swap. An absolute pain in the neck.\r\n\r\nMost of the failed runs I have were just due to \"chip damage\". Purely caused by not getting a healing skill. Just 1 or 2 levels of a healing skill massively increased the chance of succeeding in a level. It basically turns from 20 minutes of \"don't get touched\" into 20 minutes of \"ehh, I can run through these guys\". If there was just a little bit of base healing, then the game would feel much less random and reliant on these \"keystone\" abilities. \r\n\r\nThe teleporting insta kill enemies are also a massive pain and just bad game design. Deaths caused by things popping in directly in front of you for a one-hit-kill is not a fun game mechanic. A much better way is to just give them a large amount of health and to speed them up. \r\n\r\nThe passive skill descriptions are also really bad. What skills are affected by what area or range upgrade? Who knows. Got to go look at an external source to figure out what's affected. In the active skill descriptions there are all the skill tags, why not put those tags in the passives?\r\n\r\nIt could have been such a good game. If they just:\r\nFix the item UI.\r\nMake the skills gradually unlock (for the New Player Experience).\r\nMake the skill upgrades less grindy (although, this could be a symptom of the bad skill system).\r\nStop making \"chip damage\" the main cause of death.\r\nRemove the teleporting enemies.\r\nFix the skill descriptions.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Very good looking but also extremely boring game. Every upgrade and item revolves around small numbers going on extremely small increments for the sake of longer play time, but the game is not offering any \"fun\" for you to want to chase that.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "TLDR, other games have done it better in almost every aspect.\r\n\r\nOkay, I have played for 39 hours.  The game was fun at first, but it's a grind.  Too much grind.  Eventually all of the monsters only move erratically, fast, and also have projectiles as well.  As with all of these games... RNG is the core element.  Sure you can equip things that can alter the skills in various ways but I just can't stay interested.  I am on floor 13 and have unlocked another dungeon but it still feels like a part of the game is \"unavailable'  what are the runes for?\r\n\r\nI am just losing interest...  I am not winning by skill, I am winning because I got good RNG this run.  There is no feeling of accomplishment.  Just feeling lucky and if you like that aspect then you might like this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I very much wish this game had multiple save files.  Forced to not recommend until it's fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to give it a thumbs up but in it's current state I cannot.  The mobs are way too overtuned which in turn leads to the rediculous grind requirment.  This is the kind of game I want to jump on and spend an hour having fun blasting away at a some mobs, leveling up my char and feeling my efforts and time investment were rewarded with a sense of achievment through the progression of my character.  But you hardly move the needle and have to play the same level OVER and OVER to level up - then you need to do that for the other chacters should you want to play them but for myself Im over it before even considering repeating the grind to level them up.  It's unnecessarily grindy and its really taking away from this game potential.   Obviously its still in EA so if they fix some of these issues I'll give a thumbs up but until then there are similar games that do the same thing just are more fun.   Remember DEVS games are meant to be \"FUN\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Art style is not bad but just way too many of these clones... needs better implementation its just not great. Stats and powerups are not working as it should. Legendaries dropped on my first run, doesnt feel very special stat wise/powerwise. Might change in the future with updates.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i feel like this game is just Auto attack its to strong, the skills feel underwhelming lack of builds with them. legendary items are a D4 carbon copy and D4 Bad, they somehow managed to copy the underwhelming crappy-ness of D4 legendary items. even the  prefix sand  suffixes feel pointless. They might need to go Play Path of exile 1 and 2 for inspiration.  You're better off Buying MegaBonk more viable builds and in that game challenges have unlocks and rewards you for exploring. there is no reason to explore a floor in this game. there is Nothing Out there but some empty boxes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Uninstalling this dogshit/broken RNGfest, evade doesnt work, blessing doesnt work ( hello gold ??).\nYou can have a full chaos 30 run (getting to lvl 100 ) without seeing your most needed spell, or the full run without XP bonus or magic item find.\nsorry im done",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Slow, boring, no satisfying progression or power jumps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is kinda of fun but after 20 hours it gets boring.\nYou will find some spells that you like and some items that change the way the spells work and you will grind with them until the end of time.\n50 hours and i cant beat lvl 14. You need gold to upgrade your base stats and chances of spells to level up faster but not the base dmg of your spells.\nThe crafting and modifying of items isnt really user friendly or intuitive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hit detection is badd",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "New class feels decent but the downside of this game is immense. The idea is there but the dough is terrible. Chance for a decent run with success is near 0%, same with the \"loot system\" 99.99% is trash and the \"meta\" upgrade is flat stat increase like 0.1% of the stats and skills that are so random in any run even if you're far enough in the game to have some decent legendarys you fail miserably. The loot goblin who steals almost everytime the better loot at the end after a failed attempt is a nice addition to that terrible system.\nThe monster behaviour is a little bit better since the beginning but still terrible.\nUpdate 1.8: Loot droprate increased with a smidge more valueable gear. Circling crows are still annoying af and the monster spawn rate at the end of the level is beyond ridiculous. Whole screen is filled with monster even with AoE builds.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "An aggravating, grind fest. \nEquip an item that gives a skill a boost? \nProceed to do the next several runs NEVER getting that skill.\nBless a skill? (Blessing a skill makes it more likely to appear on level up) \nProceed to get that skill at the same rate as any non- blessed skill.\nItems are all roughly the same. After a few runs you will have all \"legendary\" and will simply get better versions.\nGetting gold is the only thing that matters in the end game. It might take several runs just to get a +1% increase in attack power.\nChaos runs are unfulfilling. \nIt is in early access. If I had to do it again, I would have let it cook more.\nIn it's current state, it's frustrating and not fun.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "The game has a novel roguelite + diablo approach. Unfortunately it is incredibly grindy for its limited content. The sheer number of loot items that drop is too much to go through after every level. Making it worse, top tier items (epic/legendary) drop constantly but are so watered down it makes no difference. \r\n\r\nThe game just isn't balanced properly. It would be better to drop 25% of the loot and make the drops more meaningful. Right now its just a grab-bag of stuff, 99% of which you'll never use.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "I liked it at first but it feels a little halfcooked.\r\nGear feels nearly useless besides the legendary bonuses.\r\nGear stats is simply too small to be impactfull, getting 1-2% skill speed.. aint much. \r\nSome skills are better at rank 1 than other are at max rank 25.\r\n\r\nThere's only 1 map on repeat.\r\nSome enemies explode for your whole hp pool which is fun when you've got a good run then BOOM dead out of the blue.\r\n\r\nBUT\r\nThis is early access, there's hope for this one to become something great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "This game is a combination of Vampire survivors and Diablo. Pretty much a copy of Death Must Die.\r\nI think theyre trying to make a better version of DMD but it needs work. \r\nIf you wanna play that card \"its an early access game\". DMD and Vampire survivors early access was wayyy better. Why do we enjoy these type of games? its to farm and break the game with different combos, in this game its wayyyy to difficult to pull its off. I'm not gonna go in dept of why the game is boring or how to fix it.\r\n\r\nJust don't waste your time or money on this game until full version? i recommend if the full version comes out check out some videos on youtube before buying.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I really want to like this game. It has cool artwork and an a core game play loop that I typically enjoy. But, it's giving me the ick.\n\nI love the artwork. I really like the idea of item-style RPG elements in a survivors-type game. The legendaries change how the spells work and boost their output, which I think is a pretty fun aspect. For example: I got a couple of items that tweaked the skill corpse explosion. I was so excited to see them in action. However, the next 4 runs I did I never got that skill. When I did, it was a blast! It was so fun to see my damage improve so much. Whenever I don't get offered the spells that I have built my items and blessings around its just such a frustrating slog.\n\nIt's way too grindy and the blessing system is just boring. I know its in early access so I would love to see some improvements to smoothing out the grind and letting me to choose maybe 1-2 spells to start the run with. That way I can start the run with the spells my items are supporting.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "The Game is fun to discover but it simply takes too long to scale ,  its too grindy and repetitive. they release few more levels  that forces you to grind the same 20 mins + runs over and over just to get enough gold to upgrade perks and the gold cost scales super hard. they just dont respect ur time\n\nEdit: New Patch Adressed towards this , it might be better now",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was looking like a good game until level 6 where it turned into a bullet hell. Spawning waves of enemies with range. Did not want a bullet hell game. Was not advertised as a bullet hell game. This is the straw for me.\r\n\r\nOther issues are:\r\nThe 4 characters are also pretty much the same. All skills except for the basic attack are shared between them. There are also way too many skills, and the choice feels meaningless. You get all the skills from level 1, So there is no unlocking or progressing to get other, more interesting combinations. You also have no control (through banishment) of the skills. Maybe later on when you have enough +banish on your equipment you could build what you want. But to begin with, it's just a case of \"pick whatever has the highest level\".\r\n\r\nThis means you can't focus the alter on any one skill. Not that you'd want to as the prices shoot up massively after a couple of levels. So you're better off just levelling everything evenly. Especially as you don't have any real control over what skills you're going to pick anyway.\r\n\r\nThe item comparison UI also sucks. The \"what you're going to lose\" section doesn't actually tell you what changes. So if you have 3% on the item you're replacing and 4% on the item you're replacing it with, it still says you're \"losing\" 3%. No one wants to see it this way. And you don't even get to see both rings at the same time. You have to \"hold Y\" to swap. An absolute pain in the neck.\r\n\r\nMost of the failed runs I have were just due to \"chip damage\". Purely caused by not getting a healing skill. Just 1 or 2 levels of a healing skill massively increased the chance of succeeding in a level. It basically turns from 20 minutes of \"don't get touched\" into 20 minutes of \"ehh, I can run through these guys\". If there was just a little bit of base healing, then the game would feel much less random and reliant on these \"keystone\" abilities. \r\n\r\nThe teleporting insta kill enemies are also a massive pain and just bad game design. Deaths caused by things popping in directly in front of you for a one-hit-kill is not a fun game mechanic. A much better way is to just give them a large amount of health and to speed them up. \r\n\r\nThe passive skill descriptions are also really bad. What skills are affected by what area or range upgrade? Who knows. Got to go look at an external source to figure out what's affected. In the active skill descriptions there are all the skill tags, why not put those tags in the passives?\r\n\r\nIt could have been such a good game. If they just:\r\nFix the item UI.\r\nMake the skills gradually unlock (for the New Player Experience).\r\nMake the skill upgrades less grindy (although, this could be a symptom of the bad skill system).\r\nStop making \"chip damage\" the main cause of death.\r\nRemove the teleporting enemies.\r\nFix the skill descriptions.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Very good looking but also extremely boring game. Every upgrade and item revolves around small numbers going on extremely small increments for the sake of longer play time, but the game is not offering any \"fun\" for you to want to chase that.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "TLDR, other games have done it better in almost every aspect.\r\n\r\nOkay, I have played for 39 hours.  The game was fun at first, but it's a grind.  Too much grind.  Eventually all of the monsters only move erratically, fast, and also have projectiles as well.  As with all of these games... RNG is the core element.  Sure you can equip things that can alter the skills in various ways but I just can't stay interested.  I am on floor 13 and have unlocked another dungeon but it still feels like a part of the game is \"unavailable'  what are the runes for?\r\n\r\nI am just losing interest...  I am not winning by skill, I am winning because I got good RNG this run.  There is no feeling of accomplishment.  Just feeling lucky and if you like that aspect then you might like this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I very much wish this game had multiple save files.  Forced to not recommend until it's fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to give it a thumbs up but in it's current state I cannot.  The mobs are way too overtuned which in turn leads to the rediculous grind requirment.  This is the kind of game I want to jump on and spend an hour having fun blasting away at a some mobs, leveling up my char and feeling my efforts and time investment were rewarded with a sense of achievment through the progression of my character.  But you hardly move the needle and have to play the same level OVER and OVER to level up - then you need to do that for the other chacters should you want to play them but for myself Im over it before even considering repeating the grind to level them up.  It's unnecessarily grindy and its really taking away from this game potential.   Obviously its still in EA so if they fix some of these issues I'll give a thumbs up but until then there are similar games that do the same thing just are more fun.   Remember DEVS games are meant to be \"FUN\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Art style is not bad but just way too many of these clones... needs better implementation its just not great. Stats and powerups are not working as it should. Legendaries dropped on my first run, doesnt feel very special stat wise/powerwise. Might change in the future with updates.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i feel like this game is just Auto attack its to strong, the skills feel underwhelming lack of builds with them. legendary items are a D4 carbon copy and D4 Bad, they somehow managed to copy the underwhelming crappy-ness of D4 legendary items. even the  prefix sand  suffixes feel pointless. They might need to go Play Path of exile 1 and 2 for inspiration.  You're better off Buying MegaBonk more viable builds and in that game challenges have unlocks and rewards you for exploring. there is no reason to explore a floor in this game. there is Nothing Out there but some empty boxes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Uninstalling this dogshit/broken RNGfest, evade doesnt work, blessing doesnt work ( hello gold ??).\nYou can have a full chaos 30 run (getting to lvl 100 ) without seeing your most needed spell, or the full run without XP bonus or magic item find.\nsorry im done",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Slow, boring, no satisfying progression or power jumps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is kinda of fun but after 20 hours it gets boring.\nYou will find some spells that you like and some items that change the way the spells work and you will grind with them until the end of time.\n50 hours and i cant beat lvl 14. You need gold to upgrade your base stats and chances of spells to level up faster but not the base dmg of your spells.\nThe crafting and modifying of items isnt really user friendly or intuitive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hit detection is badd",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "New class feels decent but the downside of this game is immense. The idea is there but the dough is terrible. Chance for a decent run with success is near 0%, same with the \"loot system\" 99.99% is trash and the \"meta\" upgrade is flat stat increase like 0.1% of the stats and skills that are so random in any run even if you're far enough in the game to have some decent legendarys you fail miserably. The loot goblin who steals almost everytime the better loot at the end after a failed attempt is a nice addition to that terrible system.\nThe monster behaviour is a little bit better since the beginning but still terrible.\nUpdate 1.8: Loot droprate increased with a smidge more valueable gear. Circling crows are still annoying af and the monster spawn rate at the end of the level is beyond ridiculous. Whole screen is filled with monster even with AoE builds.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "An aggravating, grind fest. \nEquip an item that gives a skill a boost? \nProceed to do the next several runs NEVER getting that skill.\nBless a skill? (Blessing a skill makes it more likely to appear on level up) \nProceed to get that skill at the same rate as any non- blessed skill.\nItems are all roughly the same. After a few runs you will have all \"legendary\" and will simply get better versions.\nGetting gold is the only thing that matters in the end game. It might take several runs just to get a +1% increase in attack power.\nChaos runs are unfulfilling. \nIt is in early access. If I had to do it again, I would have let it cook more.\nIn it's current state, it's frustrating and not fun.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "The game has a novel roguelite + diablo approach. Unfortunately it is incredibly grindy for its limited content. The sheer number of loot items that drop is too much to go through after every level. Making it worse, top tier items (epic/legendary) drop constantly but are so watered down it makes no difference. \r\n\r\nThe game just isn't balanced properly. It would be better to drop 25% of the loot and make the drops more meaningful. Right now its just a grab-bag of stuff, 99% of which you'll never use.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "I liked it at first but it feels a little halfcooked.\r\nGear feels nearly useless besides the legendary bonuses.\r\nGear stats is simply too small to be impactfull, getting 1-2% skill speed.. aint much. \r\nSome skills are better at rank 1 than other are at max rank 25.\r\n\r\nThere's only 1 map on repeat.\r\nSome enemies explode for your whole hp pool which is fun when you've got a good run then BOOM dead out of the blue.\r\n\r\nBUT\r\nThis is early access, there's hope for this one to become something great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "This game is a combination of Vampire survivors and Diablo. Pretty much a copy of Death Must Die.\r\nI think theyre trying to make a better version of DMD but it needs work. \r\nIf you wanna play that card \"its an early access game\". DMD and Vampire survivors early access was wayyy better. Why do we enjoy these type of games? its to farm and break the game with different combos, in this game its wayyyy to difficult to pull its off. I'm not gonna go in dept of why the game is boring or how to fix it.\r\n\r\nJust don't waste your time or money on this game until full version? i recommend if the full version comes out check out some videos on youtube before buying.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I really want to like this game. It has cool artwork and an a core game play loop that I typically enjoy. But, it's giving me the ick.\n\nI love the artwork. I really like the idea of item-style RPG elements in a survivors-type game. The legendaries change how the spells work and boost their output, which I think is a pretty fun aspect. For example: I got a couple of items that tweaked the skill corpse explosion. I was so excited to see them in action. However, the next 4 runs I did I never got that skill. When I did, it was a blast! It was so fun to see my damage improve so much. Whenever I don't get offered the spells that I have built my items and blessings around its just such a frustrating slog.\n\nIt's way too grindy and the blessing system is just boring. I know its in early access so I would love to see some improvements to smoothing out the grind and letting me to choose maybe 1-2 spells to start the run with. That way I can start the run with the spells my items are supporting.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "The Game is fun to discover but it simply takes too long to scale ,  its too grindy and repetitive. they release few more levels  that forces you to grind the same 20 mins + runs over and over just to get enough gold to upgrade perks and the gold cost scales super hard. they just dont respect ur time\n\nEdit: New Patch Adressed towards this , it might be better now",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was looking like a good game until level 6 where it turned into a bullet hell. Spawning waves of enemies with range. Did not want a bullet hell game. Was not advertised as a bullet hell game. This is the straw for me.\r\n\r\nOther issues are:\r\nThe 4 characters are also pretty much the same. All skills except for the basic attack are shared between them. There are also way too many skills, and the choice feels meaningless. You get all the skills from level 1, So there is no unlocking or progressing to get other, more interesting combinations. You also have no control (through banishment) of the skills. Maybe later on when you have enough +banish on your equipment you could build what you want. But to begin with, it's just a case of \"pick whatever has the highest level\".\r\n\r\nThis means you can't focus the alter on any one skill. Not that you'd want to as the prices shoot up massively after a couple of levels. So you're better off just levelling everything evenly. Especially as you don't have any real control over what skills you're going to pick anyway.\r\n\r\nThe item comparison UI also sucks. The \"what you're going to lose\" section doesn't actually tell you what changes. So if you have 3% on the item you're replacing and 4% on the item you're replacing it with, it still says you're \"losing\" 3%. No one wants to see it this way. And you don't even get to see both rings at the same time. You have to \"hold Y\" to swap. An absolute pain in the neck.\r\n\r\nMost of the failed runs I have were just due to \"chip damage\". Purely caused by not getting a healing skill. Just 1 or 2 levels of a healing skill massively increased the chance of succeeding in a level. It basically turns from 20 minutes of \"don't get touched\" into 20 minutes of \"ehh, I can run through these guys\". If there was just a little bit of base healing, then the game would feel much less random and reliant on these \"keystone\" abilities. \r\n\r\nThe teleporting insta kill enemies are also a massive pain and just bad game design. Deaths caused by things popping in directly in front of you for a one-hit-kill is not a fun game mechanic. A much better way is to just give them a large amount of health and to speed them up. \r\n\r\nThe passive skill descriptions are also really bad. What skills are affected by what area or range upgrade? Who knows. Got to go look at an external source to figure out what's affected. In the active skill descriptions there are all the skill tags, why not put those tags in the passives?\r\n\r\nIt could have been such a good game. If they just:\r\nFix the item UI.\r\nMake the skills gradually unlock (for the New Player Experience).\r\nMake the skill upgrades less grindy (although, this could be a symptom of the bad skill system).\r\nStop making \"chip damage\" the main cause of death.\r\nRemove the teleporting enemies.\r\nFix the skill descriptions.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Very good looking but also extremely boring game. Every upgrade and item revolves around small numbers going on extremely small increments for the sake of longer play time, but the game is not offering any \"fun\" for you to want to chase that.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "TLDR, other games have done it better in almost every aspect.\r\n\r\nOkay, I have played for 39 hours.  The game was fun at first, but it's a grind.  Too much grind.  Eventually all of the monsters only move erratically, fast, and also have projectiles as well.  As with all of these games... RNG is the core element.  Sure you can equip things that can alter the skills in various ways but I just can't stay interested.  I am on floor 13 and have unlocked another dungeon but it still feels like a part of the game is \"unavailable'  what are the runes for?\r\n\r\nI am just losing interest...  I am not winning by skill, I am winning because I got good RNG this run.  There is no feeling of accomplishment.  Just feeling lucky and if you like that aspect then you might like this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I very much wish this game had multiple save files.  Forced to not recommend until it's fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to give it a thumbs up but in it's current state I cannot.  The mobs are way too overtuned which in turn leads to the rediculous grind requirment.  This is the kind of game I want to jump on and spend an hour having fun blasting away at a some mobs, leveling up my char and feeling my efforts and time investment were rewarded with a sense of achievment through the progression of my character.  But you hardly move the needle and have to play the same level OVER and OVER to level up - then you need to do that for the other chacters should you want to play them but for myself Im over it before even considering repeating the grind to level them up.  It's unnecessarily grindy and its really taking away from this game potential.   Obviously its still in EA so if they fix some of these issues I'll give a thumbs up but until then there are similar games that do the same thing just are more fun.   Remember DEVS games are meant to be \"FUN\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Art style is not bad but just way too many of these clones... needs better implementation its just not great. Stats and powerups are not working as it should. Legendaries dropped on my first run, doesnt feel very special stat wise/powerwise. Might change in the future with updates.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i feel like this game is just Auto attack its to strong, the skills feel underwhelming lack of builds with them. legendary items are a D4 carbon copy and D4 Bad, they somehow managed to copy the underwhelming crappy-ness of D4 legendary items. even the  prefix sand  suffixes feel pointless. They might need to go Play Path of exile 1 and 2 for inspiration.  You're better off Buying MegaBonk more viable builds and in that game challenges have unlocks and rewards you for exploring. there is no reason to explore a floor in this game. there is Nothing Out there but some empty boxes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Uninstalling this dogshit/broken RNGfest, evade doesnt work, blessing doesnt work ( hello gold ??).\nYou can have a full chaos 30 run (getting to lvl 100 ) without seeing your most needed spell, or the full run without XP bonus or magic item find.\nsorry im done",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Slow, boring, no satisfying progression or power jumps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is kinda of fun but after 20 hours it gets boring.\nYou will find some spells that you like and some items that change the way the spells work and you will grind with them until the end of time.\n50 hours and i cant beat lvl 14. You need gold to upgrade your base stats and chances of spells to level up faster but not the base dmg of your spells.\nThe crafting and modifying of items isnt really user friendly or intuitive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hit detection is badd",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "New class feels decent but the downside of this game is immense. The idea is there but the dough is terrible. Chance for a decent run with success is near 0%, same with the \"loot system\" 99.99% is trash and the \"meta\" upgrade is flat stat increase like 0.1% of the stats and skills that are so random in any run even if you're far enough in the game to have some decent legendarys you fail miserably. The loot goblin who steals almost everytime the better loot at the end after a failed attempt is a nice addition to that terrible system.\nThe monster behaviour is a little bit better since the beginning but still terrible.\nUpdate 1.8: Loot droprate increased with a smidge more valueable gear. Circling crows are still annoying af and the monster spawn rate at the end of the level is beyond ridiculous. Whole screen is filled with monster even with AoE builds.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "An aggravating, grind fest. \nEquip an item that gives a skill a boost? \nProceed to do the next several runs NEVER getting that skill.\nBless a skill? (Blessing a skill makes it more likely to appear on level up) \nProceed to get that skill at the same rate as any non- blessed skill.\nItems are all roughly the same. After a few runs you will have all \"legendary\" and will simply get better versions.\nGetting gold is the only thing that matters in the end game. It might take several runs just to get a +1% increase in attack power.\nChaos runs are unfulfilling. \nIt is in early access. If I had to do it again, I would have let it cook more.\nIn it's current state, it's frustrating and not fun.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "The game has a novel roguelite + diablo approach. Unfortunately it is incredibly grindy for its limited content. The sheer number of loot items that drop is too much to go through after every level. Making it worse, top tier items (epic/legendary) drop constantly but are so watered down it makes no difference. \r\n\r\nThe game just isn't balanced properly. It would be better to drop 25% of the loot and make the drops more meaningful. Right now its just a grab-bag of stuff, 99% of which you'll never use.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "I liked it at first but it feels a little halfcooked.\r\nGear feels nearly useless besides the legendary bonuses.\r\nGear stats is simply too small to be impactfull, getting 1-2% skill speed.. aint much. \r\nSome skills are better at rank 1 than other are at max rank 25.\r\n\r\nThere's only 1 map on repeat.\r\nSome enemies explode for your whole hp pool which is fun when you've got a good run then BOOM dead out of the blue.\r\n\r\nBUT\r\nThis is early access, there's hope for this one to become something great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "This game is a combination of Vampire survivors and Diablo. Pretty much a copy of Death Must Die.\r\nI think theyre trying to make a better version of DMD but it needs work. \r\nIf you wanna play that card \"its an early access game\". DMD and Vampire survivors early access was wayyy better. Why do we enjoy these type of games? its to farm and break the game with different combos, in this game its wayyyy to difficult to pull its off. I'm not gonna go in dept of why the game is boring or how to fix it.\r\n\r\nJust don't waste your time or money on this game until full version? i recommend if the full version comes out check out some videos on youtube before buying.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I really want to like this game. It has cool artwork and an a core game play loop that I typically enjoy. But, it's giving me the ick.\n\nI love the artwork. I really like the idea of item-style RPG elements in a survivors-type game. The legendaries change how the spells work and boost their output, which I think is a pretty fun aspect. For example: I got a couple of items that tweaked the skill corpse explosion. I was so excited to see them in action. However, the next 4 runs I did I never got that skill. When I did, it was a blast! It was so fun to see my damage improve so much. Whenever I don't get offered the spells that I have built my items and blessings around its just such a frustrating slog.\n\nIt's way too grindy and the blessing system is just boring. I know its in early access so I would love to see some improvements to smoothing out the grind and letting me to choose maybe 1-2 spells to start the run with. That way I can start the run with the spells my items are supporting.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "The Game is fun to discover but it simply takes too long to scale ,  its too grindy and repetitive. they release few more levels  that forces you to grind the same 20 mins + runs over and over just to get enough gold to upgrade perks and the gold cost scales super hard. they just dont respect ur time\n\nEdit: New Patch Adressed towards this , it might be better now",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was looking like a good game until level 6 where it turned into a bullet hell. Spawning waves of enemies with range. Did not want a bullet hell game. Was not advertised as a bullet hell game. This is the straw for me.\r\n\r\nOther issues are:\r\nThe 4 characters are also pretty much the same. All skills except for the basic attack are shared between them. There are also way too many skills, and the choice feels meaningless. You get all the skills from level 1, So there is no unlocking or progressing to get other, more interesting combinations. You also have no control (through banishment) of the skills. Maybe later on when you have enough +banish on your equipment you could build what you want. But to begin with, it's just a case of \"pick whatever has the highest level\".\r\n\r\nThis means you can't focus the alter on any one skill. Not that you'd want to as the prices shoot up massively after a couple of levels. So you're better off just levelling everything evenly. Especially as you don't have any real control over what skills you're going to pick anyway.\r\n\r\nThe item comparison UI also sucks. The \"what you're going to lose\" section doesn't actually tell you what changes. So if you have 3% on the item you're replacing and 4% on the item you're replacing it with, it still says you're \"losing\" 3%. No one wants to see it this way. And you don't even get to see both rings at the same time. You have to \"hold Y\" to swap. An absolute pain in the neck.\r\n\r\nMost of the failed runs I have were just due to \"chip damage\". Purely caused by not getting a healing skill. Just 1 or 2 levels of a healing skill massively increased the chance of succeeding in a level. It basically turns from 20 minutes of \"don't get touched\" into 20 minutes of \"ehh, I can run through these guys\". If there was just a little bit of base healing, then the game would feel much less random and reliant on these \"keystone\" abilities. \r\n\r\nThe teleporting insta kill enemies are also a massive pain and just bad game design. Deaths caused by things popping in directly in front of you for a one-hit-kill is not a fun game mechanic. A much better way is to just give them a large amount of health and to speed them up. \r\n\r\nThe passive skill descriptions are also really bad. What skills are affected by what area or range upgrade? Who knows. Got to go look at an external source to figure out what's affected. In the active skill descriptions there are all the skill tags, why not put those tags in the passives?\r\n\r\nIt could have been such a good game. If they just:\r\nFix the item UI.\r\nMake the skills gradually unlock (for the New Player Experience).\r\nMake the skill upgrades less grindy (although, this could be a symptom of the bad skill system).\r\nStop making \"chip damage\" the main cause of death.\r\nRemove the teleporting enemies.\r\nFix the skill descriptions.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Very good looking but also extremely boring game. Every upgrade and item revolves around small numbers going on extremely small increments for the sake of longer play time, but the game is not offering any \"fun\" for you to want to chase that.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "TLDR, other games have done it better in almost every aspect.\r\n\r\nOkay, I have played for 39 hours.  The game was fun at first, but it's a grind.  Too much grind.  Eventually all of the monsters only move erratically, fast, and also have projectiles as well.  As with all of these games... RNG is the core element.  Sure you can equip things that can alter the skills in various ways but I just can't stay interested.  I am on floor 13 and have unlocked another dungeon but it still feels like a part of the game is \"unavailable'  what are the runes for?\r\n\r\nI am just losing interest...  I am not winning by skill, I am winning because I got good RNG this run.  There is no feeling of accomplishment.  Just feeling lucky and if you like that aspect then you might like this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I very much wish this game had multiple save files.  Forced to not recommend until it's fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to give it a thumbs up but in it's current state I cannot.  The mobs are way too overtuned which in turn leads to the rediculous grind requirment.  This is the kind of game I want to jump on and spend an hour having fun blasting away at a some mobs, leveling up my char and feeling my efforts and time investment were rewarded with a sense of achievment through the progression of my character.  But you hardly move the needle and have to play the same level OVER and OVER to level up - then you need to do that for the other chacters should you want to play them but for myself Im over it before even considering repeating the grind to level them up.  It's unnecessarily grindy and its really taking away from this game potential.   Obviously its still in EA so if they fix some of these issues I'll give a thumbs up but until then there are similar games that do the same thing just are more fun.   Remember DEVS games are meant to be \"FUN\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Art style is not bad but just way too many of these clones... needs better implementation its just not great. Stats and powerups are not working as it should. Legendaries dropped on my first run, doesnt feel very special stat wise/powerwise. Might change in the future with updates.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i feel like this game is just Auto attack its to strong, the skills feel underwhelming lack of builds with them. legendary items are a D4 carbon copy and D4 Bad, they somehow managed to copy the underwhelming crappy-ness of D4 legendary items. even the  prefix sand  suffixes feel pointless. They might need to go Play Path of exile 1 and 2 for inspiration.  You're better off Buying MegaBonk more viable builds and in that game challenges have unlocks and rewards you for exploring. there is no reason to explore a floor in this game. there is Nothing Out there but some empty boxes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Uninstalling this dogshit/broken RNGfest, evade doesnt work, blessing doesnt work ( hello gold ??).\nYou can have a full chaos 30 run (getting to lvl 100 ) without seeing your most needed spell, or the full run without XP bonus or magic item find.\nsorry im done",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Slow, boring, no satisfying progression or power jumps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is kinda of fun but after 20 hours it gets boring.\nYou will find some spells that you like and some items that change the way the spells work and you will grind with them until the end of time.\n50 hours and i cant beat lvl 14. You need gold to upgrade your base stats and chances of spells to level up faster but not the base dmg of your spells.\nThe crafting and modifying of items isnt really user friendly or intuitive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hit detection is badd",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "New class feels decent but the downside of this game is immense. The idea is there but the dough is terrible. Chance for a decent run with success is near 0%, same with the \"loot system\" 99.99% is trash and the \"meta\" upgrade is flat stat increase like 0.1% of the stats and skills that are so random in any run even if you're far enough in the game to have some decent legendarys you fail miserably. The loot goblin who steals almost everytime the better loot at the end after a failed attempt is a nice addition to that terrible system.\nThe monster behaviour is a little bit better since the beginning but still terrible.\nUpdate 1.8: Loot droprate increased with a smidge more valueable gear. Circling crows are still annoying af and the monster spawn rate at the end of the level is beyond ridiculous. Whole screen is filled with monster even with AoE builds.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "An aggravating, grind fest. \nEquip an item that gives a skill a boost? \nProceed to do the next several runs NEVER getting that skill.\nBless a skill? (Blessing a skill makes it more likely to appear on level up) \nProceed to get that skill at the same rate as any non- blessed skill.\nItems are all roughly the same. After a few runs you will have all \"legendary\" and will simply get better versions.\nGetting gold is the only thing that matters in the end game. It might take several runs just to get a +1% increase in attack power.\nChaos runs are unfulfilling. \nIt is in early access. If I had to do it again, I would have let it cook more.\nIn it's current state, it's frustrating and not fun.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "The game has a novel roguelite + diablo approach. Unfortunately it is incredibly grindy for its limited content. The sheer number of loot items that drop is too much to go through after every level. Making it worse, top tier items (epic/legendary) drop constantly but are so watered down it makes no difference. \r\n\r\nThe game just isn't balanced properly. It would be better to drop 25% of the loot and make the drops more meaningful. Right now its just a grab-bag of stuff, 99% of which you'll never use.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "I liked it at first but it feels a little halfcooked.\r\nGear feels nearly useless besides the legendary bonuses.\r\nGear stats is simply too small to be impactfull, getting 1-2% skill speed.. aint much. \r\nSome skills are better at rank 1 than other are at max rank 25.\r\n\r\nThere's only 1 map on repeat.\r\nSome enemies explode for your whole hp pool which is fun when you've got a good run then BOOM dead out of the blue.\r\n\r\nBUT\r\nThis is early access, there's hope for this one to become something great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "This game is a combination of Vampire survivors and Diablo. Pretty much a copy of Death Must Die.\r\nI think theyre trying to make a better version of DMD but it needs work. \r\nIf you wanna play that card \"its an early access game\". DMD and Vampire survivors early access was wayyy better. Why do we enjoy these type of games? its to farm and break the game with different combos, in this game its wayyyy to difficult to pull its off. I'm not gonna go in dept of why the game is boring or how to fix it.\r\n\r\nJust don't waste your time or money on this game until full version? i recommend if the full version comes out check out some videos on youtube before buying.",
      "voted_up": false,
      "votes_helpful": 11
    }
  ]
}