{
  "positive": [
    {
      "review": "First off, FOR ALL NEW PLAYERS: the new prologue and storyline starting from a later act are there for a reason. Since recent updates, the game's main story has become FULLY VOICED. All older acts can be played after completing a couple of missions, but they won't feature full voice acting. For this reason, the developers divided the main story into two sections. I'll also add that if you're having problems with \"character graphical rendering,\" changing the game's \"localization\" should solve the problem. Google it or look in the discussions to see what that means. Now let's start talking specifically about everything else. \n\nStory:\nSo far, I'm enjoying everything. Story is presented to the player in the form of a visual novel. It's quite well done. We have a confrontation with a crazed AI, villains with their own agendas, and a tightly woven romance between adjutant and his charming squad. Yes, romance is part of the plot and involves several characters. These aren't fillers that ultimately have no connection to the story, so the game is officially a harem game. Thumbs up to the developers for the courage to make it official. Main character isn't just a cardboard cutout and has a personality. It's no surprise that female characters eventually fall for him.\n\nFanservice: \nThis is worth mentioning right after the story. I've noticed that many people are writing about revealing outfits and so on, attributing the game to hentai and sexual content. First of all, as someone said earlier, hentai doesn't mean porn, but rather pervert. Secondly, there's no hentai here. This is high-quality fan service. The heroines' outfits, while revealing, are detailed and beautiful. Special credit to the developers for the skins. There's no sexual content as such. There are hints of intimate relationships, but all the characters are adults, so I don't see anything wrong with that. Perhaps someone's innocent soul considers a simple kiss sexual content. That's not the game's problem. \n\nGameplay:\nA fairly simple third-person shooter with varied character abilities. It's easy and enjoyable to play. Almost every character has their own combat style. There are numerous game modes, both more serious and mini-games. Game modes change with each update, with some returning more frequently, and others arriving later in a more polished form. The developers regularly conduct surveys about game modes and truly listen to ideas. So if you didn't like a mode, please leave a review. Who knows, maybe it will pleasantly surprise you next time. The only downside for me is that the normal game modes lack difficulty. But that's more my fault, as I'm used to setting every game to the hardest difficulty, otherwise I'll just get bored. It's worth adding that daily tasks can be completed in one minute. This is perfect for those who don't have time on certain days. There is also a base where you can interact with characters, buy them furniture and all sorts of other activities that are expanded with updates.\n\nSystem:\nI saw someone writing about freezing and such on excellent hardware. I haven't noticed any of that at all. My PC isn't top-of-the-line, but it's adequate. I play at 2K resolution on maximum settings with 120 fps without any freezing or drops. What can I say, I even managed to run the game normally on my old potato (previous PC). I think you should check your system and identify the problem if such drops are occurring. I have friends who play with similar hardware and also have no problems.\n\nGacha:\nSince I started playing, I haven't spent a single penny on gacha. This is despite the fact that I have characters from every update. There's a 100% banner, and while there's a small chance of getting a character, just completing dailies, weeks, and events should easily be enough to get a character. This game also has double banners. Yeah, it sounds threatening, right? But with a double banner, the second character is given away for free. I haven't seen this tradition broken in over a year. Character copies are also optional. There's a tab where you can regularly obtain character parts. It might take time, but you can achieve the desired result. Of course, there's also the weapon banner, but I wouldn't say golden weapons are absolutely necessary. And then again, you can always save up extra spins. While not everyone has them, my characters do have personal guns. And a full upgrade only requires one more copy. Alternatively, there's a personal purple weapon. It can be fully upgraded simply by completing event objectives. That's all. The only thing that can really hit your wallet are the skins. I don't consider them expensive. However, given their quality and my desire to support the developers, I buy at least a couple with every update.\n\nEpilogue:\nAfter Destiny Child, which I played for a long time, closed, I wandered from game to game for a long time. However, my wanderings ended here. The game is truly well-made, the developers listen to the community and are constantly improving. My only hope is that someday they'll make suitable modes for those who enjoy higher difficulties like me. Ignore the dubious reviews and just try it for yourself. And I apologize for so many words.",
      "voted_up": true,
      "votes_helpful": 47
    },
    {
      "review": "My hours are on the official client, probably sitting at around 300+.\n\nI noticed this game has been review bombed by normie's, before that it had been sitting at 'very positive' since forever.\nI'll quickly highlight some positives that has kept me with this game for over a year.\n\n\n\n- Gameplay -\n\nWhile not complex, nor having a high skill ceiling, the gameplay loop remains very fun. Characters kits are distinctive enough that it keeps the combat fresh. \n\nImportant content can be completed without requiring meta teams and as a f2p, meaning you never feel locked out from progressing because you didn't swipe enough. The content for whales just gives an avatar frame that expires every week and some currency everyone gets in abundance.\n\n\n\n- Events & Content Schedule -\n\nEvents rotate every 40+ days and typically consist of various game modes, there's something for everyone here, you have a few co-op modes, casual mini-games, wave defence, etc. \n\nDevs are very responsive to community feedback, so events that see re-runs are improved from previous versions. They've taken event modes I disliked in their first appearance and fine tuned them to make them very enjoyable.\n\nEvery event releases with a new character, and the ability to easily farm their optimal weapon that's often only slight worse than the banner weapon.\n\n\n\n- Gacha -\n\nAt the end of the day, Snowbreak is a gacha, however although everyone will tell you their gacha is 'generous', Snowbreak actually is generous. Unlike other gacha's, you won't find yourself being forced to skip characters, you can get every character for for free and without heavy grinding.\n\nEvery character is usable at base copy, with dupes making them a bit stronger but not a night and day difference (barring 1 character), and weapon banners can 100% be ignored, but for those interested, you only need 1 extra copy to max the weapon, compared to the usual 5-6.\n\n\n\n\nOhh also, Fenny is best girl, anyone who says otherwise is lying.",
      "voted_up": true,
      "votes_helpful": 35
    },
    {
      "review": "easy game, generous currency, pretty tough playing with 1 hand tho",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Shooting gun with anime tiddies,\r\nWhat more could you ask for?",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Graphics are gorgeous and gameplay is good, but it has these bite-size little levels that take maybe 2 minutes to finish and that are completely linear and have no interactivity or possibility for exploration. As soon as I get in the groove, the level is over. The flow is terrible, and it just isn't satisfying. I'm assuming it is structured this way to force you to burn through your stamina faster. Given how little time you actually spend in each level, it seems unnecessary to have a team of 3 characters. Then, there are visual novel sections in between levels that take like 5 minutes to click through, which is, notably, longer than the actual levels. If these focused on lore and events I might be inclined to swiftly click through them, but I quickly started skipping them because they are full of cloying writing that focuses on the relationship between the self-insert protag and his waifu harem. A lot of the prose is also just flowery filler. I don't care about a breeze blowing through the autumn trees. Just let me shoot shit already.\r\n\r\nBeing an f2p gacha game, it has overly convoluted systems for everything from progression to currencies, and the UI is a nightmare to navigate. Anything and everything can be leveled up in minute detail, requiring materials that require grinding or money or whatever. You know the drill.\r\n\r\nThere is a lot of single-player content. There are at least 14 chapters in the main story, plus character-specific missions, time-limited chapters and events, and other activities you can do to get materials, etc. There don't seem to be any barriers if you just want to jump in and play the game normally, unless you approach this as a no-lifer, in which case you will hit a roadblock due to the stamina system.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "https://steamcommunity.com/sharedfiles/filedetails/?id=3613105873\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3614167355\n[h1][Pros][/h1]\n+ Cool aesthetic. (Futuristic girls with guns. I mean c'mon.)\n+ Tight gunplay and a variety of playstyles. Levels are cool too.\n+ There's a lot of lore and worldbuilding. If you're into that sort of thing.\n+ Great selection of characters to choose from.\n+ Lots to do. (sidequests, events, etc.)\n\n[h1][Cons][/h1]\n- [i]Horrifying english voiceovers.[/i] (So bad i had to turn them off entirely)\n- Cringe gooner fanservice and dialogue. \"S-Senpai... you saw me without my hijab! uwu...\" I mean hooooo my god lmao. It's a bit hilariously much at times and probably written by a sweaty fat dude.\n- Way too much dialogue and cutscenes that pull you out of the gameplay. (Unless you like a shit ton of lore and exposition.) \n- Convoluted and cluttered UI and menus with multiple currencies and other needless crap.\n\n[h1][Final thoughts][/h1] \nWhen you're shooting things and blowing things up as a cute waifu, it's pretty great. When the girls start talking or slobbering over the main character, it becomes total goonerville and i mentally check out. So it's kind of a 50/50 deal, depending on how you feel about those things. Overall, i think it's pretty cool. Put on some Doom music and give it a go. 8/10.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "This is game is more about fan service and harem-fantasy things, i think its quite good overall between the story and the mechanic. The only things that bother me is the top-up price that is so pricey and this game have a hard and boring way to grind for resource, even though the event minigame was very enjoyable and i like it very much (similar like genshin minigame). So if you want a \"good\" content you can get it for free, but for a \"very good\" content you must pay and its a bit expensive (not a problem if you have the money though and i think its quite worth it but as always consider before proceed).\n\nFor the gameplay balance and etc i can't say much because i'm more into story rather the gameplay, so don't blame me if i prefer characters that have skills that can single handedly finish the shooting part.\n\nAll in all expect it more into a visual novel which have shooting parts rather than shooting game with visual novel.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "[h1]Half decent date and shooter mobile game [/h1]\nthis is not \"FPS\" game, this are a pure date stimulation game, call this thing Warfame waifu version, the occupy tons of login problem such as freeze and connection lost, before enter this game I recommend stand still for a second so the game render some texture, that won't that freeze..\n\njust in start then endless cute waifu are maximum love rate in the run, that would never happen in real life, the voice over are English, I guess is batter cause one time clear all Language still there supply a lot of country, the graphic is triple AAA level, in most of the date element is small like playing a text game exist in the mobile game category.\n\nthis game support all movement you probable think about the RPG and FPS, such as jump and doge action or spirit, you could launch character skill or switch skill, there are skill tree that damage enemy or deal divest damage unlimited skill, not the best still holding up.\n\nThis is a campaign PvE base game The character have non balance, some with near infinite clip and some only hold few shot then need reload, the skill and switch keyboard is kind of cringy to push that may need adjusting, the enemy type own variety, you won't feeling repetitive for early stage.\n\nworth some round of fun, after that you may want to move on.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "A slick, stylish blend of third-person shooting and character-collection. It looks great, plays smoothly, and offers just enough depth to stay engaging.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is it a great game?\r\n\r\nCompared to other games outside of its genre i'd say its about average to decent at best\r\n\r\nCompared to other games inside its own genre , its pretty high up there definitely within the top 10 (on my personal list its clearly and definitely sitting in my top 3 )\r\n\r\nIs it a game anyone can play ? consdering its target audience i'd say no , i wouldnt recommend it to EVERYONE , just to people above the age of 20 , that being said , setting aside its aesthetic sensibilities and choice of romance trope the writers have chosen for the game's story , the story itself tackles psychological aspects and depicts situations that one must be both mentally and emotionally mature enough to understand \r\n\r\nEach and every character is well developed. \r\nEach and every character has their own troubles and tribulations to which some of us can relate to\r\nEach and every character has a lot of depth and growth and none of them feel shallow or one dimensional\r\n\r\nGameplay? \r\nIts simple , robust and very straightforward \r\n\r\nIs it difficult ?\r\nIf you're the type that wants a challenge that makes his forehead sweat and his fingers tired from all the button mashing then you need to go play something else because this isnt the game for you \r\nThis is a very casual and chill type of game where nothing's extremely difficult\r\n\r\nDoes it have PvP ? No and honestly ? its better this way , a thousand times better this way\r\n\r\nNow its time to address the elephant in the room whenever this type of game genre comes up \r\n\r\nDoes it have a Battle Pass , yes it does , does it turbo charge your progress by leaps and bounds ? Barely , it offers no advantage over the Free to play Player other than less time spent grinding for resources in one day\r\n\r\nNow as far as the gacha game element goes , compared to others within its genre Snowbreak has a way more generous system and drop rates/chances , character banner re-runs happen very often and it has no \"Limited time\" characters that once their time's up they're gone for good , its not the kind of gacha game that's actively trying to dry out your wallet and turn it to ash \r\nSo unless you're a habitual spender with poor impulse controll you can get pretty much all the characters at a decently sized pace\r\n\r\nOnce you pull your desired character you no longer need to  pull for more duplicates\r\n\r\nOverall and In Summary \r\nIts not gonna be everyone's cup of tea , if you like it you like it , if you wanna keep playing it you'll keep playing it \r\nIf you dont wanna keep playing it and you dont like it then you dont , you can go play something else since no one's holding you hostage other than yourself \r\n\r\nI love this game despite its quirkyness and lack of certain elements here and there but with enough time i'm sure they'll address them at\r\n\r\nOverall i'll give it a 9.5/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "this is a game that wanted to be something unique but almost died because of it... solution? boobs. lots of boobs, and being on the edge of the line at what makes an eroge and hentai game. its really depressing but at the same time impressive how the devs listen to everything the fans want. and it is also impressive that this is probably the only gacha game in the market that actually focuses on romance instead of random teasings girls do to the main characters, THIS IS THE ONLY GACHA GAME WHERE GIRLS ACTUALLY KISS THE PROTAGONIST. why? because the most insecure people are the loudest. this is precisely what kept the game alive. \n\ni was expecting a serious tone and a cool universe since my favourite gacha game is girls frontline that is very bleak and genuenly really well narrative driven game. and third person gatcha aspect was appealing to me. unfortunatly that is barely the case with snowbreak, at least not anymore. i was left dissapointed and confused why is there a serious story but so much eroge content. theres still a room for enjoyment but you need a different angle at it. \n\nsnowbreak is technically a game that had an very interesting aspect but it was turned into a romance focused instead because chineese incels are genuenly the most insufferable people in existence. actually thats not specificaly tied to china but in the case of  this game it was mainly the chinesse players and gfl 2 also had a controversy because chineese players got cucked basicaly so im starting to believe that china incels are the worst out of the entire world.\n\nim recommending it because im a simple person and women are hot in general and i am a very basic man. (jk i dont want angry incels to dox me)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Decent game.  They know their audience!  Free, so it's worth a try.  Combat is fun, and there is a lot to do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty enoyful and certainly have been playing for a week continously on a daily.\r\nIt can be challenging, but that's on the second prior, if not enjoying the game that is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful, I've always wanted to play as a harem protagonist commanding a strike force, of mostly autistic hot chicks in a PMC owned by big pharma, fighting off crystal zombies created by a loli AI clanker. I love Vidya games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played Snowbreak when it first released and it had a bunch of glaring issues, but the Devs stayed dedicated and the game has been vastly improved in every aspect. Plus the bonus waifu content has been great as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice relaxing shooting game, which is good and rare for shooter genre. Big plus: you need only second spare weapon for legendary characters, not 5 copies like others gacha games to max weapon. Many fun good mini-games. Characters has interesting backstory and beautiful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is actually good gacha game. I was playing a lot and much more then just 200 hours from mobile phone as well...But since it now has it's own launch I would rather to play on that launcher then from Steam\r\n\r\nAnyways, game itself good, if you like shooter and gacha and waifu well, take your time to discover this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun, not ground breaking or anything like that but if you want an anime/genshin impact shooter, it is a fun game to kill time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good waifu/harem simulator.  This is mostly told through visual novel gameplay.  There are numerous mini-games, and also a FPS Mode which is kind of forgettable.  The FPS is solid gameplay with good animations.  Just not the biggest draw in my opinion.  Also includes some modest dormitory base building, the massage mini-game is nice.\r\n\r\nBe warned this game has all the trappings of any free-to-play gacha game.  But even free-to-play there is good value here, with free 5 star characters offered every major patch.  And the major banners don't do  50/50 BS, it's 100 pulls guaranteed.\r\n\r\nSnowbreak knows what it is and is unashamed of that.  The girls are all fun with good personalities and great voice acting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very easy gameplay loop and very large boobs, also very easy to earn everything in game while not spending anything",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game feels like anime waifu mobile mini warframe but with \"real\" girls, not mutants. And this is a compliment.\n \nThis is literally only one gacha what I played without suffer. And what I returned after long time. (I played genshin, honkai 3rd, wuwa (maybe more I don't remember)).\nBut this is still a gacha, so, don't mind what I \"recommend\" this game and played not this long. I play games such this only in one of the worst state of myself.\nIf in future I will have a though about to play gacha again (what I played before), I will choose this again (If I don't find something better).\n\nAnd special good thing what I find in this game — optimization. Thx what game looks ok and fast loaded and without spikes and other lags (I played this game on old hdd).\n\nP.s. No, I didn't buy this 10/10 outfits :pensive: I haven't money for this.\nP.p.s Please give more reward for survey. U ask really many and I think all honest answers costs much more then 160 crystals or something.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "the gameplay is fun and responsive, the modes and events are pretty cool. still has fomo and grinding like any other gacha but with amazing rates you will get what you want at some point!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and very F2P.\n\nNeeds more risque costumes but it doesn't affect my enjoyment.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly pretty fun. I love my glop shooters. Ainoway it has a gf2 ah base mechanic. Just got thrown into a goofy as mini game. This game is so unserious man it’s funny.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you're one of those reviewbombers, you're ugly and insecure.\n\nNo wonder your boyfriend left you.\n\nGreat FANTASY game by the way.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "i find this game boring, i came during the special wedding patch bought the scenes had a bit of giggles and fun, 80 euros well spend, would give this game a 6/10 otherwise. it's fine just not for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gun and smoke, fog of war, they raised armies to bring you down. Titans stood before the world ready to devoir it, but I no. ME I DEVOURED THEM \r\n\r\nFYI Played most of the hours on the pre steam launcher",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is called Containment Zone because that's where all of gooner fetishes going to be buried deep down. Even if you don't want to pay for the game, the amount of \"plots\" this game given is still insane. And if you do pay for the game, well, those interactive scenes are ... ( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)\n\nJust don't treat the gameplay part too seriously and enjoy the stimulation.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Awesome 3rd person shooter that is constantly updated with new stories weapons and characters.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "leaving a like to help counter the pearl clutching tards with nothing to do with the continued decline of bluesky",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great great great great great Assets here! And totally enjoy the run, but there's some gap to fixing to make this game more fun with such as multiplayer friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Snowbreak is a very good F2P friendly gacha game where you can get most of what you want and guaranteed char pull for every 1-2 month of daily activity without paying. The shooting game is satisfying, grinding and levelling are exciting, and co-op is OK. Overall the gameplay (outside ecchi things) is great, much better than other gacha game like Genshin or Nikke.\n\nThe downside is that there is very limited fanservice and sexy clothes on recent patch because of Chinese govt. There is an unofficial patch to show the original sexy outfits (Note: but still no nudity at all). It has some fanservice romantic scenes behind paid-content though.\n\nIn general, if you are into action-based girl gacha games, this is the one you should be playing, but if you are looking for sexy outfits or fanservice you will be disappointed because this game is going on to direction of more and more restrictive clothing because of strict Chinese govt.\n\nThe problem is the aim of audience, at first this is released to 12+ where boys can play, but then some sexy outfits caused it to raise now into 16+ age and Chinese policy adds more to restriction where this game will lead to in future (it has become just an ordinary shooting girls gacha with normal outfit). Normal outfit I mean similar level outfit sexyness to ZZZ or Genshin.\n\nI think this game is better to be either 12+ with normal clothing with no fanservice (like Genshin), or R18+ with lots of sexy outfits and fanservice that satisfies \"cultured\" men in the first place.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a fun game. The storytelling is very visual novel and the gameplay isn't amazing, but it hits this sweet spot for me. Not many games go the full harem route. I like that this one does.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "i love anime and romantics that is like with rpg shooter game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent game with lots of waifus. i wud lik more shooting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What more can you ask for right, the male dream",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i didnt really see any snow, but the girls are hot some of them are fun to play",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Feel like this is what 100 girlfriends would be like if it were an action gatcha game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First game i can actually play with only one hand",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's fine i just wasn't expecting it to be chinese is all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun free to play game 1 of the best ones I ever owned",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Fun game wish there was more content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good fun game for past time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has better outfits than Infinity Nikki",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very poggers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not bad, good plot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing jiggle physics 😍🤤",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 very realistic jiggle physics",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I came, I saw, I came again, I conquered",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "peak gooner game",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "say yes to segss",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game of the year right here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a visual novel, with GUNS.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Underrated Game been playing since launch.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "จากเกมใกล้ดับสู่เกมที่โคตร GOON\r\nและผมรักเกมนี้ว่ะ\r\nเนื้อเรื่องฮาเร็ม เกมเพลย์ดี ฟาร์มง่าย ประจำวันเร็วและง่าย\r\nเนื้อเรื่องโดยรวมไม่ขัดไม่ฝืน\r\nสาวๆเนื้อๆเน้นๆ\r\nแนะนำสำหรับชาว GOON ครับสหาย",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "could be better tbh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 goon and Harem game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i think i'm really going to marry one of my wives but its kinda hard for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY GOOD RECOMMEND",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "JUST PEAK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "😍 😍 😍 😍 😍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No DEI",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "anime women",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "\"Gameplay\" is great. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Made me rethink my own life",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Boobs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "HEHEHE...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "rubber duckie physics",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Snowpeak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful Waifus",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Snowpeak",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "gosadgg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Luv",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Chadjutant",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "swag",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "w",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my wife mia is cute af. shes good puppy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EDIT: You need to go into the games files to turn localisation to (1) to remove the censors:\n\n[RIGHT CLICK GAME IN LIBRARY - BROWSE LOCAL FILES - COMMON (top of file explorer) - SCROLL TO BOTTOM - LOCALISATION.TXT - CHANGE FROM 0 TO 1 - SAVE]\n\nREVIEW:\n\nI played the game back in closed beta, and sadly i kinda immediately knew it wasn't really going to survive. \n\nThere just simply wasn't enough to do in the game to really justify playing it, coupled alongside a pretty boring and monotonous CO-OP mode you couldn't even really play with friends.\n\nFast forward to the game's 1 year anniversary and basically EVERYTHING had changed. \n\nIt's interesting they went down the gooner route and even though that brings a lot of downsides, be it sometimes unrealistic depictions of how people act and the obligatory incels. \n\nThey really turned the game around and it's a lot more fun. \n\nI do think adding more CO-OP game modes that aren't so restrictive is a good idea for the devs to take into account, but with the sheer amount of QOL improvement i've seen over that past year letting them do their thing certainly isn't hurting! \n\nThis is one of the most generous and respectful gatcha games i've ever seen, regularly giving away entire free 5* characters and offering a very generous amount of paid currency for free every patch. \n\nAside from some recent powercreep shenanigans they're generally pretty good at keeping everything balanced and since there isn't even really any reason to \"tryhard\" apart form bragging rights you never feel like you're explicitly missing out just because you don't have the TOP tier units. \n\nTack on a story that honestly has so much more effort than you'd expect from a game that that primarily markets itself to the sad and lonely, I can wholehearted recommend this game even if you're not really into the gooner type games.\n\nA truthful and honest BRAVO to the devs for saving the game!",
      "voted_up": true,
      "votes_helpful": 333
    },
    {
      "review": "Login to discord.\r\nDiscord Orb rewards!\r\nBut gotta, \"Play for 15 minutes\"\r\n😐\r\nInstall, start game.\r\nLeave on login screen.\r\nGet Discord Orbs.\r\nUninstalls.\r\n\r\nGreat doing business 🤝",
      "voted_up": true,
      "votes_helpful": 1099
    },
    {
      "review": "This game was featured on Discord Orbs reward then got review bombed by normies after they got their orbs. Doesn't seem very fair to the game, so I'm giving it a thumbs-up. The game itself is not my personal cup of tea, and the only thing I dislike is the how the tutorial (after the prologue) forced me to continue playing/reading through late-stage story missions. It's not a terrible game by any means; this review is simply meant to go against the unfair review bombing.",
      "voted_up": true,
      "votes_helpful": 219
    },
    {
      "review": "seasun promoting this game to discord is a mistake by how many tourists review bombing it just for discord orbs. could've just left but oh boy.. so i'm giving it a thumbs-up just because of how many triggered peeps are in this review section.",
      "voted_up": true,
      "votes_helpful": 90
    },
    {
      "review": "[h1]Don't trust negative reviews![/h1]\nAs someone who started playing this game 8-9 months ago for the gameplay, trust me when I tell you to not trust the bad reviews. The game is getting hit with false tags and review bombs by tourists or a specific group that is jealous to see it doing incredibly well in other countries. Warframe players might remember us Tenno dealing with something similar from certain *ahem* \"other games\", so I'll state some facts and opinions on the game as someone who is more interested in the gameplay. Get ready for a lot of reading, and sorry if I repeat anything.\n\n[h2]Facts:[/h2]\n[olist]\n [*] Character banners come in 100% and 50/50%.\n\n [*] The gacha is honestly one of the best I've seen. If you are doing all of the events and content when they refresh you can typically earn enough to get the on banner character without ever spending money. I've been playing for 8-9 months now and have almost every character and I've only spent money on a banner twice, and that was purely because they had banner events to bring back old banner characters and I didn't wanna wait for them to come back around. The ONLY issue I have with this games gacha is the weapon banner. I think the weapon banners are an outdated monetization practice that paints characters into specific playstyles and takes away a players opportunity to play around with different builds and mechanics; But I feel this way for weapon banners in ANY game, not just Snowbreak.\n\n [*] The Devs seem to care more about fun than profits, so much so they are going to start giving away 5-star characters starting next patch (but we still get one this patch because its a summer event).\n\n [*] The gameplay loop feels repetitive at times but the dev's actually listen, I know this because they took one of my character kit concepts and divided it into 3 characters that exist in the game; And when players commented on the 5-star weapons, they adjusted it so that you'd only need 2 of them to max it out instead of 5 like other games.\n\n [*] They aren't afraid to try new things, even things people might find boring. A few events have come out that people weren't too keen on, but instead of repackaging it with an even shittier bow and shoving it down our throats like some other games do, they ask for feed back and actually use it to try and improve the events in fun ways that aren't contradictory of the games core themes.\n\n [*] There is no nudity or sexual content unless you believe a woman's body is not inherently sexual, and at that point the issue falls on you, not the game. Sure there are sexual innuendos and fan-service, but the only hentai are the people falsely labeling this game specifically to try and limit this games audience. And for the uninitiated, \"hentai\" means pervert, not porn.\n\n [*] The game isn't difficult to figure out and it doesn't force you to play a specific chapter and you can get right into the settings (unless something changed since I started); The people making those statements are doing so with malicious intent and I'd suggest trying it for yourself.\n\n [*] The new tutorial takes about 10 minutes if you skip all the dialogue; 20-25 if you don't. You can't edit settings at first but I'm sure that will be fixed. However, after doing your first character summon and being pushed into a mission, you'll be able to to pause and adjust settings while in the mission. So no, you're not forced to do 10-20 missions, people are just dumb lol.\n[/olist]\n\n[h2]Opinions:[/h2]\n[olist]\n [*] The models are great. Anyone saying otherwise is using a potato phone or pc, and if I wanted opinions about potatoes I'd go to the nearest KFC and ask the Colonel or head to Five Guys and ask each of them to give me a fun fact... But I'm not gonna trust some dude with 0.3 hours of playtime to give me an honest review. Now do i think the graphics could use some improvement? Of course... But I also came to this game because it reminded me a bit of Warframe, so I'm spoiled and have seen them update their character models multiple times over 12+ years. The only true complaint I'd have is that the outfits, while really detailed, don't feel AS detailed as some other games. Do not come to this game expecting outfits on par with Love, Shinning, or Infinity Nikki... But I know if they did make the outfits look that good, they'd look absolutely stunning, especially the wedding dresses.\n\n [*] There is no nudity in the game, but as a fan of games with \"battle damage\" as a mechanic of gear, I personally wouldn't care if it did exist in that form. However I am aware that there are players that DO wish nudity existed in the game, but this isn't that kind of game. If you really want that, that is something you can probably find mods for, but this game is not a mature rated game so it's only cleavage and innuendos.\n\n [*] This game is not Genshin or ZZZ. It's a third person shooter with gacha mechanics; Gacha mechanics that honestly feel fairly generous if you're an active player. People saying that are specifically name dropping those games because Mihoyo has a toxic fanbase that go out of their way to mass report, review bomb, and anything they can think of to drive negativity towards any game outside of the Mihoyo wheel house of games because they fear any other game getting a crumb of success is somehow a detriment to their God Mihoyo. They have an active online \"terror group\" called XJJ that plans and plots ways to tear down other games. Just recently they released misinformation to get a voice actor fired from a game because they were afraid this other game would cause one of their beloved Mihoyo games to EoS... And honestly I feel that says more about how good this game is that its getting review bombed. It also tells me that Mihoyo games must be lacking if another game getting a bit of success shakes the faith these cultists. If you game is good, it shouldn't need you to attack other games to preserve it, and honestly you Hoyo-Cultists are slowly destroying the very games you love by turning people away, because frankly... People don't want to be bothered by it. I used to be play genshin impact, and I was interested in trying ZZZ... But the toxicity in the fan based and the corporate greed with their predatory monetization turned me away from mihoyo games completely, and others are starting to follow suite... You Hoyo-Cultist and terrorist groups did that, not other games.\n\n [*] I like me an anime game where all the characters are 18+. I was so sick of playing anime themed games where they'd have a character that looks like they'd easily be 32, but then they'd list them as 14-17. So when I first found this game I was hesitant, especially with a few of the petite characters, but each character is 18+, so if you will not find children in this game.\n\n [*] It's more single player focused right now, but it seems like they are slowly testing more cooperative game modes because there is a lot of players asking for more coop type content. So if you prefer playing with friends, you have a few options, and hopefully will have more in the future, until then I'd say hop on and start building characters.\n\n [*] This game mostly thrives off its outfit sales. Most people I know that play this game pull the banner character for basically free, and then (if its not a double banner event) they might go for the weapon, but everyone I know buys the outfits and battle pass SPECIFICALLY to support the game... Because no one I know really spends money on the banners. We generally earn enough to get them all, at least a copy; So we buy other stuff to support Dev's that are actually considerate of our time and money.\n[/olist]",
      "voted_up": true,
      "votes_helpful": 86
    },
    {
      "review": "First off, FOR ALL NEW PLAYERS: the new prologue and storyline starting from a later act are there for a reason. Since recent updates, the game's main story has become FULLY VOICED. All older acts can be played after completing a couple of missions, but they won't feature full voice acting. For this reason, the developers divided the main story into two sections. I'll also add that if you're having problems with \"character graphical rendering,\" changing the game's \"localization\" should solve the problem. Google it or look in the discussions to see what that means. Now let's start talking specifically about everything else. \n\nStory:\nSo far, I'm enjoying everything. Story is presented to the player in the form of a visual novel. It's quite well done. We have a confrontation with a crazed AI, villains with their own agendas, and a tightly woven romance between adjutant and his charming squad. Yes, romance is part of the plot and involves several characters. These aren't fillers that ultimately have no connection to the story, so the game is officially a harem game. Thumbs up to the developers for the courage to make it official. Main character isn't just a cardboard cutout and has a personality. It's no surprise that female characters eventually fall for him.\n\nFanservice: \nThis is worth mentioning right after the story. I've noticed that many people are writing about revealing outfits and so on, attributing the game to hentai and sexual content. First of all, as someone said earlier, hentai doesn't mean porn, but rather pervert. Secondly, there's no hentai here. This is high-quality fan service. The heroines' outfits, while revealing, are detailed and beautiful. Special credit to the developers for the skins. There's no sexual content as such. There are hints of intimate relationships, but all the characters are adults, so I don't see anything wrong with that. Perhaps someone's innocent soul considers a simple kiss sexual content. That's not the game's problem. \n\nGameplay:\nA fairly simple third-person shooter with varied character abilities. It's easy and enjoyable to play. Almost every character has their own combat style. There are numerous game modes, both more serious and mini-games. Game modes change with each update, with some returning more frequently, and others arriving later in a more polished form. The developers regularly conduct surveys about game modes and truly listen to ideas. So if you didn't like a mode, please leave a review. Who knows, maybe it will pleasantly surprise you next time. The only downside for me is that the normal game modes lack difficulty. But that's more my fault, as I'm used to setting every game to the hardest difficulty, otherwise I'll just get bored. It's worth adding that daily tasks can be completed in one minute. This is perfect for those who don't have time on certain days. There is also a base where you can interact with characters, buy them furniture and all sorts of other activities that are expanded with updates.\n\nSystem:\nI saw someone writing about freezing and such on excellent hardware. I haven't noticed any of that at all. My PC isn't top-of-the-line, but it's adequate. I play at 2K resolution on maximum settings with 120 fps without any freezing or drops. What can I say, I even managed to run the game normally on my old potato (previous PC). I think you should check your system and identify the problem if such drops are occurring. I have friends who play with similar hardware and also have no problems.\n\nGacha:\nSince I started playing, I haven't spent a single penny on gacha. This is despite the fact that I have characters from every update. There's a 100% banner, and while there's a small chance of getting a character, just completing dailies, weeks, and events should easily be enough to get a character. This game also has double banners. Yeah, it sounds threatening, right? But with a double banner, the second character is given away for free. I haven't seen this tradition broken in over a year. Character copies are also optional. There's a tab where you can regularly obtain character parts. It might take time, but you can achieve the desired result. Of course, there's also the weapon banner, but I wouldn't say golden weapons are absolutely necessary. And then again, you can always save up extra spins. While not everyone has them, my characters do have personal guns. And a full upgrade only requires one more copy. Alternatively, there's a personal purple weapon. It can be fully upgraded simply by completing event objectives. That's all. The only thing that can really hit your wallet are the skins. I don't consider them expensive. However, given their quality and my desire to support the developers, I buy at least a couple with every update.\n\nEpilogue:\nAfter Destiny Child, which I played for a long time, closed, I wandered from game to game for a long time. However, my wanderings ended here. The game is truly well-made, the developers listen to the community and are constantly improving. My only hope is that someday they'll make suitable modes for those who enjoy higher difficulties like me. Ignore the dubious reviews and just try it for yourself. And I apologize for so many words.",
      "voted_up": true,
      "votes_helpful": 47
    },
    {
      "review": "If you like anime-style sci-fi RPGs like Honkai Star rail, then this is the game for you.\nOn my 15 mins of playing, I found Snowbreak to be an action packed, where you can play solo campaign or multiplayer mode. There is a definite heavy gacha concept of the game with the way you can earn the highest ranked characters (5-stars), and daily logins to get rewards. \nMy overall gameplay was smooth, and bug-free with the occasional challenge of bosses that would have an element that my character is ineffective against. I plays as a 3rd POV with some grinding similar to Warframe. The overall story is simple but ongoing as the devs release more events; titans attack the world, and we go defeat titans. Rinse and repeat.\nAs someone who has spent over +1k hours on grindframe, I can't say I'd play this as frequently due to the burn out. But for other players. I'd say it's very beginner friendly and casual even for an action RPG. I recommend trying Snowbreak: Containment Zone!",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Seems there was a discord campaign and normies review bombed the game due to fear of women showing skin or some such non-sense. Giving it a thumbs up for justice",
      "voted_up": true,
      "votes_helpful": 98
    },
    {
      "review": "easy game, generous currency, pretty tough playing with 1 hand tho",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I usually don't post reviews on games, but with the recent Discord advertisement and the review bombings I decided to post a review of what I think of the game. \n\nPROS:\nThis game is full on a fanservice waifu collector where countless women fall under your spell because \"you're so perfect and awesome and cool and stuff\". It's very much a power fantasy and has been for quite some time. It's not shy about giving the player the full harem experience, to the point whee you are CANONICALLY married to multiple women. Not only is the story full of master love, but the characters are diverse and all have their different quirks that makes them stand out from each other. It's also a nice touch that each new patch brings more detailed models and environments, making it quite hypnotyzing to look at. Personally, I'm glad the devs are sticking to their guns and telling a fantastical story where the main character (self-insert) can just have fun and enjoy being the hero of the game.\n\nReally, all of that doesn't matter because this is a gacha game and we all know how they make their money. Power-creep, weapon banners, FOMO, you know the drill. However, I'm very much surprised to see how painless the gacha system is. A 100% banner for chars and weapons? Really a huge breath of fresh air to know your months of grind actually pay off instead of being stolen by a 50-50. That's not all. The game actively showers you with currency, pulls, and even free characters all the time. Why, you ask? Because their skins, and interactive skins, are the real bread winners. The skins + interactive skins are probably the most value you can find in a gacha game. You're telling me for ~$30 I get a character skin, weapon skin, and multiple interactive scenes for a character?  A lot of popular harem gacha games charge more just for a skin! Now the weird/conflated pricing for the premium currency does make it hard to tell how much you're actually spending, but if you do become a spender, I recommend the monthly pass or the $50 premium currency purchase (first timers get double the value) for the most bang-for-your-buck. \n\nCONS:\nNow, I want to say that I LOVE this game and that this game is perfect and blah blah blah but it's not. I started out from when the story was starting to embrace the fan service and moving away from the \"tacticool\" style. I really like that they are fully embracing a new identity that the fans enjoy, but the game play suffers as a result. A lot of the shooting aspects of the game have been sidelined for abilities that instagib the enemies with little need to even fire your weapon. It's almost too easy! Then again, it's been a while since I played it as a mobile game (I switched to PC a long time ago and the PC controls feel much better to play.) \n\nAdditionally, the story is being re-written to accompany this new change in direction, so the new retcons and \"prologue\" is an awkward middle child that players kinds have to ignore while the story re-writes occur. You'll notice the girls become more profound in their love to the point where you wonder how the adjuntant (MC) has the time to escape the bedroom! I really hope the writers put more work into the realities of juggling the many current (and new) partners but we all know that's probably not going to happen.\n\nCONCLUSION:\nIt's a power fantasy where you're Mr. #1 and all the girls swoon over you and think you're the next best thing since sliced bread. If that's not your thing then that's fine, but for those who like that then this is the game for you. The game is packed full of content that will keep you entertained while the patch progresses and you get your free anime girls to boot. \n\nIf this doesn't sell you, then I don't know what will.\n\nNOTE: If you actually want to experience the game without censorship, go into the localization file and change the \"0\" to a \"1\". If you don't know what that means or where to go, there are guides specifically on how to find and change this file. (Just wanted to spread awareness for the uninformed.)",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "My hours are on the official client, probably sitting at around 300+.\n\nI noticed this game has been review bombed by normie's, before that it had been sitting at 'very positive' since forever.\nI'll quickly highlight some positives that has kept me with this game for over a year.\n\n\n\n- Gameplay -\n\nWhile not complex, nor having a high skill ceiling, the gameplay loop remains very fun. Characters kits are distinctive enough that it keeps the combat fresh. \n\nImportant content can be completed without requiring meta teams and as a f2p, meaning you never feel locked out from progressing because you didn't swipe enough. The content for whales just gives an avatar frame that expires every week and some currency everyone gets in abundance.\n\n\n\n- Events & Content Schedule -\n\nEvents rotate every 40+ days and typically consist of various game modes, there's something for everyone here, you have a few co-op modes, casual mini-games, wave defence, etc. \n\nDevs are very responsive to community feedback, so events that see re-runs are improved from previous versions. They've taken event modes I disliked in their first appearance and fine tuned them to make them very enjoyable.\n\nEvery event releases with a new character, and the ability to easily farm their optimal weapon that's often only slight worse than the banner weapon.\n\n\n\n- Gacha -\n\nAt the end of the day, Snowbreak is a gacha, however although everyone will tell you their gacha is 'generous', Snowbreak actually is generous. Unlike other gacha's, you won't find yourself being forced to skip characters, you can get every character for for free and without heavy grinding.\n\nEvery character is usable at base copy, with dupes making them a bit stronger but not a night and day difference (barring 1 character), and weapon banners can 100% be ignored, but for those interested, you only need 1 extra copy to max the weapon, compared to the usual 5-6.\n\n\n\n\nOhh also, Fenny is best girl, anyone who says otherwise is lying.",
      "voted_up": true,
      "votes_helpful": 35
    },
    {
      "review": "ngl nice graphics and gameplay but too much feet, thanks for orbs tho\n(i love feet gang)",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Shooting gun with anime tiddies,\r\nWhat more could you ask for?",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Game is exactly what it advertises - not even trying to hide it.\n\nComing here to leave a negative review just because you're doing a discord quest in a game you would've never noticed or started anyways is so pathetic.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "https://steamcommunity.com/sharedfiles/filedetails/?id=3613105873\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3614167355\n[h1][Pros][/h1]\n+ Cool aesthetic. (Futuristic girls with guns. I mean c'mon.)\n+ Tight gunplay and a variety of playstyles. Levels are cool too.\n+ There's a lot of lore and worldbuilding. If you're into that sort of thing.\n+ Great selection of characters to choose from.\n+ Lots to do. (sidequests, events, etc.)\n\n[h1][Cons][/h1]\n- [i]Horrifying english voiceovers.[/i] (So bad i had to turn them off entirely)\n- Cringe gooner fanservice and dialogue. \"S-Senpai... you saw me without my hijab! uwu...\" I mean hooooo my god lmao. It's a bit hilariously much at times and probably written by a sweaty fat dude.\n- Way too much dialogue and cutscenes that pull you out of the gameplay. (Unless you like a shit ton of lore and exposition.) \n- Convoluted and cluttered UI and menus with multiple currencies and other needless crap.\n\n[h1][Final thoughts][/h1] \nWhen you're shooting things and blowing things up as a cute waifu, it's pretty great. When the girls start talking or slobbering over the main character, it becomes total goonerville and i mentally check out. So it's kind of a 50/50 deal, depending on how you feel about those things. Overall, i think it's pretty cool. Put on some Doom music and give it a go. 8/10.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I have been playing this game for over a year now through their official launcher. Downloaded it for review purposes. \n\nThis is an incredible game with fun gameplay and amazing characters you can officially marry in-game. This game is in a niche of it's own with how in-depth you can have a relationship with your waifus in a gacha. \nThe story is also pretty fun, and you get to play as a based adjutant who makes brilliant strategic decisions and takes good care of all his girls at the same time.\nAs this is a gacha, you might think it's very monetization heavy, but that's not the case at all. There is a 100% guarantee banner and you can easily pull a character every patch. You can get their 4 star weapon for free from events, and the grind is pretty easy. But that's not all, because every other patch they give you a free character (who is actually pretty strong unlike most gacha games) and starting November, they will be giving out a free character every patch! \nThe events are unique and creative, like they even had fun mini-games like cart racing and a jetpack joyride styled mode. And there's also a base where you can further interact with all your waifus.\n\nThe monetization is mostly for the skins and interactive scenes. But as someone who owns most of the interactable scenes in the game, they are WELL worth the money. I don't regret buying them for a single second. I also love how seriously Seasun takes player feedback. I am glad to be able to play a gacha game that actually values their playerbase.\n\nIf you like fanservice, master-love or fun gunplay, then definitely give it a go!",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Graphics are gorgeous and gameplay is good, but it has these bite-size little levels that take maybe 2 minutes to finish and that are completely linear and have no interactivity or possibility for exploration. As soon as I get in the groove, the level is over. The flow is terrible, and it just isn't satisfying. I'm assuming it is structured this way to force you to burn through your stamina faster. Given how little time you actually spend in each level, it seems unnecessary to have a team of 3 characters. Then, there are visual novel sections in between levels that take like 5 minutes to click through, which is, notably, longer than the actual levels. If these focused on lore and events I might be inclined to swiftly click through them, but I quickly started skipping them because they are full of cloying writing that focuses on the relationship between the self-insert protag and his waifu harem. A lot of the prose is also just flowery filler. I don't care about a breeze blowing through the autumn trees. Just let me shoot shit already.\r\n\r\nBeing an f2p gacha game, it has overly convoluted systems for everything from progression to currencies, and the UI is a nightmare to navigate. Anything and everything can be leveled up in minute detail, requiring materials that require grinding or money or whatever. You know the drill.\r\n\r\nThere is a lot of single-player content. There are at least 14 chapters in the main story, plus character-specific missions, time-limited chapters and events, and other activities you can do to get materials, etc. There don't seem to be any barriers if you just want to jump in and play the game normally, unless you approach this as a no-lifer, in which case you will hit a roadblock due to the stamina system.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Very Educational Game.\nPlayed it a lot longer on its own Launcher but made the switch to Steam.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This is game is more about fan service and harem-fantasy things, i think its quite good overall between the story and the mechanic. The only things that bother me is the top-up price that is so pricey and this game have a hard and boring way to grind for resource, even though the event minigame was very enjoyable and i like it very much (similar like genshin minigame). So if you want a \"good\" content you can get it for free, but for a \"very good\" content you must pay and its a bit expensive (not a problem if you have the money though and i think its quite worth it but as always consider before proceed).\n\nFor the gameplay balance and etc i can't say much because i'm more into story rather the gameplay, so don't blame me if i prefer characters that have skills that can single handedly finish the shooting part.\n\nAll in all expect it more into a visual novel which have shooting parts rather than shooting game with visual novel.",
      "voted_up": true,
      "votes_helpful": 8
    }
  ],
  "negative": [
    {
      "review": "Started out with a good and interesting story with decent mechanics, there was a cover system, there was a system for knocking enemies off the map to instantly kill them. Over time these mechanics were moved away from and the game devolved into generic press skill button gacha slop you've already played a million times before with games like genshin. Boss arenas are just big circles with nothing else to add depth to them.\n\nThe story devolved into a harem and the heroines' personalities were scrubbed to the point where they're not allowed to think about or care about anything other than the main character because the overly sensitive player base got really upset one time when one of the female character interacted with a male in a clearly non-romantic way. What used to be really endearing heroines now feel more like dogs than people which while dogs are man's best friends, it becomes really weird when said dogs look human. Even though the girls are very much human, i can't shake the idea that it feels kind of like bestiality due to the way they act. There's a huge master and slave dynamic with the \"romance\" in this game and it all feels  really weird and awkward.",
      "voted_up": false,
      "votes_helpful": 240
    },
    {
      "review": "This game went from pretty fun with some gooner bait to just pure gooner bait with no fun",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "⭐️⭐️✨ 2.5/5 – Snowbreak\r\n\r\nSnowbreak has potential, but it just doesn’t hit the mark the way it should. Visually, the game looks great — the characters, effects, and environments are solid. But once you start playing, the shine fades a bit. The gameplay loop feels repetitive, the controls can be clunky, and the grind gets tiring pretty quickly.\r\n\r\nThe story tries to pull you in, but it never fully lands. And the progression system leans too heavily on gacha and upgrades, which kind of kills the fun if you’re not ready to invest a lot of time or money.\r\n\r\nIt’s not a bad game, just not as enjoyable as it could be. There are some cool moments, but they’re buried under uneven pacing and repetitive missions.\r\n\r\nOverall: 2.5/5 — decent visuals, weak execution, and not something you’ll stick with for long.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Game has been falling apart over time, and the devs only care about pleasing CN whales",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "what the fuck did i just \"play\"\nthis aint even a game\ni had more fun watching the download progress than this shit",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "It sure have nice girls and some decent action gameplay but when a single player tutorial campaign ends I faced insane lags. Everyhere like gift, gacha or shop I have that annoying loading screens for like minute, just like the servers are too slow or on the another planet.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This 3rd person, rpg-shooter game is overkill with how it delivers and advertises shop features. Snowbreak: Containment Zone tries to trap and motivate players with a daily \"when you log-in, get x free y\" automated reward system, and SIGNIFICANT anime waifu style-art with questionable levels of sexual themes and nudity. The developers, Amazing Seasun Games also helped develop MECHABREAK.\n\n-BC",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "My fellow scholars and humble gentlemen we meet again. The game loop is fine. The gun play is fine. The graphics are fine. the characters are fine. The game is just that \"fine\". The big draw is of course the half naked girls of questionable ages. It does get a bit ummm odd when you can do things like a massage or take a shower in a fps game and it makes you feel like this a game that you can't play in front of say your girlfriend or wife. There is a solid foundation here but it feels like the game play wasn't the focus of the devs. If you want a mid game with anime girls barely clothed then this is for you. But if your looking for a solid fps looter shooter I'd say pass on it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "80% menu interaction 10% worst gooning bait youll ever see 5% shitty minigames 5% actual \"base\" game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Not even sex appeal can save such a boring game.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Yeah I think I had enough. Time to quit ... officially one of the many goon games in the market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Almost a great game, if only it wasn't a gacha...",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Tutorial is too long.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash game just full of Sexu",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Insanely boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Started out with a good and interesting story with decent mechanics, there was a cover system, there was a system for knocking enemies off the map to instantly kill them. Over time these mechanics were moved away from and the game devolved into generic press skill button gacha slop you've already played a million times before with games like genshin. Boss arenas are just big circles with nothing else to add depth to them.\n\nThe story devolved into a harem and the heroines' personalities were scrubbed to the point where they're not allowed to think about or care about anything other than the main character because the overly sensitive player base got really upset one time when one of the female character interacted with a male in a clearly non-romantic way. What used to be really endearing heroines now feel more like dogs than people which while dogs are man's best friends, it becomes really weird when said dogs look human. Even though the girls are very much human, i can't shake the idea that it feels kind of like bestiality due to the way they act. There's a huge master and slave dynamic with the \"romance\" in this game and it all feels  really weird and awkward.",
      "voted_up": false,
      "votes_helpful": 240
    },
    {
      "review": "⭐️⭐️✨ 2.5/5 – Snowbreak\r\n\r\nSnowbreak has potential, but it just doesn’t hit the mark the way it should. Visually, the game looks great — the characters, effects, and environments are solid. But once you start playing, the shine fades a bit. The gameplay loop feels repetitive, the controls can be clunky, and the grind gets tiring pretty quickly.\r\n\r\nThe story tries to pull you in, but it never fully lands. And the progression system leans too heavily on gacha and upgrades, which kind of kills the fun if you’re not ready to invest a lot of time or money.\r\n\r\nIt’s not a bad game, just not as enjoyable as it could be. There are some cool moments, but they’re buried under uneven pacing and repetitive missions.\r\n\r\nOverall: 2.5/5 — decent visuals, weak execution, and not something you’ll stick with for long.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Boring. The bots are inclredibly stupid. Holding left click and occasionaly press e/q does the job 90% of the time. Enemies almost deal no damage. Even the bosses, unless you are literally getting hit by everything or are vastly underleveled.\n\nThe menu is confusing (2 shops, millions of tabs) and for whatever reason you play chapter 14-16 before 1-13....\n\nMaybe it is fun if you get to the late game, but why would anyone bother going through this sleeper gameplay to get to the fun part. This game seems not to be made for PC - however it has a PC client. So it should not have the gameplay and AI of Counter Strike: CZ.\n\nAnd on top it's a gacha...",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Game forces you to start playing at around Chapter 14 instead of Chapter 1 with no way around that... Horrible and confusing mess for a new player that wants to get into the story .",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "I'm only giving this game a negative review because of the overused trashy \"tap this\" tutorial that literally does nothing but force you to play 10-20 levels before you can do anything... including change settings.\n\nIt's honestly so annoyingly bad i think i'm just gonna delete the game... I feel like they made it worse cause when i played originally it was 5 forced missions at most.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Gameplay-\n☐ You have to try it\n☐ Good\n☑ Decent\n☐ Okay\n☐ Bad\n\nGraphics-\n☐ Masterpiece\n☐ Beautiful\n☑ Good\n☐ Will do\n☐ Bad\n☐ Awful\n\nAudio\n☐ Amazing\n☐ Very good\n☐ Good\n☑ Decent\n☐ Not too bad\n☐ Bad\n\nStory-\n☐ Lovely\n☐ Good\n☑ Meh\n☐ Not great\n☐ None\n\nDifficult-\n☐ Just press a bunch of buttons\n☑ Easy\n☐ Significant brain usage\n☐ Easy to learn / Hard to master\n☐ Not so easy\n☐ Difficult\n☐ Dark Souls\n\nGrind-\n☐ Nothing\n☐ Only if you care about leaderboards/ranks\n☐ It isn't necessary to progress\n☐ A bit grindy sometimes\n☑ Average grind level\n☐ Too much grind\n☐ Insanity\n\n[h3] Improvement Ideas [/h3]\nSeasun, please spend more time designing the actual game instead of focusing more on events. I will give extreme credit to the dev team for the Cerulean Getaway update. The minigames in this patch are phenomenal, and I am really proud of their work in being able to add them to Snowbreak. However, I am [b]BEGGING[/b] you, most players end up leaving due to shallow gameplay, except for the degenerates like me who can't stop playing gachas. There are even ideas to improve the game that don't change the gameplay loop, like changing anything that isn't combat to be faster. Puzzles and interactions are painfully slow, like you might as well embed YouTube to keep me from just staring at my monitor thinking about why I'm doing this to myself.\n\nIt could be fun to make level selection more engaging, use features like the Base to give a player another reason to use the base if they want, but still keep the current click menu option. Think of Brown Dust II in their menu design.\n\nFor combat, please rebalance the design, make supports more than just damage buffers to make your current limited operative OP you can easily add healing/shielding or movement into their kit while raising the enemy damage. Also, greatly increase the critical hit scaling; this just makes shooters more satisfying. Rebalancing the importance of healing/shields lets players sustain enough to burst down enemies with head shots or buffs, or play with positioning and [b]FINALLY[/b] put use to your forgotten cover mechanic. This one creates more engagement with team building and combat while still giving players options to do whatever they want. You could even make a new operator gaining buffs using the cover mechanic. However, this will drastically change the current gameplay, so these combat ideas could be superficial.\n\nCombat flow is terrible. Walking miles across an empty map in a linear, pointed direction, and when you hit the late game, you instantly evaporate everything, and then keeping walking is not engaging. In some way, make the player move faster, either naturally or through supports or even add vehicles. Change the damage scaling depending on body parts, increase the damage for crits and head shots. Also, make snipers different, just being a long-range spam shoot that tickles is boring. They have no power when hitting head shots unless you are playing a mission that you are over-leveled in.\n\nFor operative balance, if they do rebalance combat and don't want to change operatives, then make supports be more meaningful. With a bigger support impact, at least players can still opt to use older operatives with stronger support. Again, credit to the dev team in the Cerulean Getaway update, with the new Fenny being refreshing to play.\n\nLevel design, think of Call of Duty campaigns, you mainly do the kill all enemies, but some change objectives. Could add a sniper level that isn't operative locked, or give them the option to let the players learn and use what they want. Another could be clearing an area and then surviving for some time, or just surviving in an area with turrets you can place on the map that you have to repair if damaged. These can be in the main story or just side levels you use from time to time. Something new to break the pattern of slop that is the same thing, but put a few mechanics in that are either new or old, and call it done. Also, change level transitions. If you really want to keep the core feature of shooting, then why tf are we spending more time in menus than playing? Instead of leaving the scene to go menu to menu, keep the player in the level, then prompt if they want to continue and generate the next level inside with seamless loading, like turning the camera to look behind while the operative walks/runs to load the next area. It's okay if the animation locks during big packets. At least it beats clicking static buttons and menus just to load for 2 total minutes. Edit: In the Defiant Bloom update, they do attempt the sniper mission in the event story, which was great. It was a bit stiff in nature, but I love that they are trying. Good stuff from the dev team. I hope this new design approach moves into the actual main story. If they find it hard to rebalance the current design, then adding these new mission ideas will help a lot.\n\nSkins could be more than what they currently are, and would make more money. For starters, add more effects like unique bullets/shooting or reloading effects/animations that are easily noticeable if you don't want to put more work into them. The biggest thing to add to skins is making them interactive in combat, each kill scales to the effect, or head shots make the skin do something, literally anything. Also, the game censors itself by default, but it is really easy to disable it even though it isn't in the game settings. For those that complain then maybe add a settings option that tones down the fan service and slightly alters designs, say a skirt is too short, then make one that is longer. Either way, I still buy their skins because I like the game and I think they look great. It just isn't godly, and in most cases, I say not worth it. They have been getting better after the Defiant Bloom update. This also adds value that skins are customizable, also regarding modding, it's odd behavior to spend resources countering mods when we can barely use them to improve our game. . .\n\nGacha system needs to fix the rate of income, for the rate of banners rotating compared to how much rewards give is horrendous. You can get around 20-40 pulls each event, and pity is 80 for 50/50 on operatives or 60 on weapons, with a direct power creep next event. If you take other gacha games seriously, then this one is not for you. The main reason for pulling in this game is if you like the character, and that is [b]ALL[/b]. There is no important mode that rotates for currency. They only rotate modes for materials, which only matters to the small percentage of players that want to max stats for a handful of modes that care about that.\n\nThe stamina system needs to be tweaked. The stamina system is so bad that they give you tons of items that restore stamina so you can continue playing. Why not rebalance the stamina or integrate those items into the stamina naturally, rather than using items that expire at that point? One positive is the other stamina system to farm shards to build copies of your owned operatives, even if it is painfully slow and capped to prevent quick upgrades. \n\n[h3] TLDR [/h3] \nThe game is unique, but it loses its charm after a few plays, and then you uninstall it, or you hate gooners and don't install. Sound design is 50/50, some good, some negligible. Art, graphics, and controls are good, but the gameplay loop contradicts its core design, making the game feel like it pushes you away, regardless of whether you like easy mobile game designs or shooters. The best feature is event minigames, which are popular games converted to fit within Snowbreak. Shooting = coolish, game balance = not cool, daily grind = extremely easy, max grind = jobless, skins = paid mostly, gacha = income painly slow but good odds, gooner = with more updates.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "Game has been falling apart over time, and the devs only care about pleasing CN whales",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Could've been a cool sci-fi anime shooter, now it's just gooner slop. \nLike, the devs could've at least made some futuristic skins fitting to the setting, but no, here's some normal ass bikini lol. Oh and the guns went from cool futuristic guns to shitty toy guns you'd see in a cheap chinese shooter game....oh wait.\nAlso why does this game take up 40GB of storage space? The game doesn't even look that good and there are plenty of games that have more content to play that take up way less storage space than this game.\nAnyways I'm just gonna get my discord orbs and then get this shit off my pc.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[h1]TL;DR: Lots of boobs with solid physics, but very lackluster shooter.[/h1]\n\nWay too much clicking on text for the story to continue so I just skip it altogether. The game settings during the ~30 min long tutorial are a joke as you can change exactly three aspects of keyboard sensitivity and that's it. No graphic settings or audio settings whatsoever.\n\nThe combat felt fun at first as you fight your way through a bunch of enemies at once with different kinds of enemies appearing after time. But once I stopped shooting and let the enemies attack me I found out that they are pretty much useless and I could stand still for 5 mins or more without getting killed.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Well how can i start this ?, this is pretty much the first i time i ever touched a gacha adjacent game and i know this kind of genre have some \"quirks\" that may not be appealing to the general masses so i wont judge the game on these \"intergral\" features, with that out of the way i will talk about the aspect not influence by the genre\n-Gameplay: I genuinely dont know if this is the quirk of the genre but my god the gunplay is so boring like watching literal paint dry, no recoil, no feeling, aiming is pretty much for show, enemies is brain-dead, singular attack strategy, lacking variations leading to stale engagements and bosses are so easy it is trivial, dodging is not exactly needed because why would you dodge when you can just walk out of the attacks like youre on a stroll in the park, overall lacking energy and not engaging\n-Characters: i know the game is supposed to be an eye candy type of game but like can they at least try some uniqe spin, twist on the tropes of each of these characters, they are like straight up walking tropes of every single character types from the interaction down to the design but with perfect physique for maxium \"attractiveness\", overall generic, uninspiring, forgettable, the voice actors performance sometimes feel forced and too scripted, sometime feel unbothered like they just want to get over this fast, and the whole experience feel like those cheap and cliche-filled isekai anime with the diolauges\n-Sound: average, run of the mill sound effects and music, corporate and feel manufactured, overall unimpressive and so dont expect much\n-Lore&Interactions: for some reason the game made me walk through 45 minutes of boredom-inducing gameplay and dialouges before the exposition and general world building, when playing i keep questioning what the heck are these things you guys talk about and general very confused, onto the interations, without build up of the relationships and character developments every single activities and voicelines by each characters feel so distant, foreign you dont really have a connection or resonate with their interactions at all, as a matter of fact i just skip the voicelines and just straight up read and skip all of their dialouge to obtain the information on lore and thats it, dont really feel the need or the drive to really sit and watch them interacting \nI came in expecting nothing and came out expecting even less, if you want to play some barely passable gunplay,boring gameplay and like watching anime girls then i think this could be your thing but if you want something of higher caliber then look somwhere else",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game went from pretty fun with some gooner bait to just pure gooner bait with no fun",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "its pretty good. but to me it feels like they dont know where they want to go with it fully. like its like half way to girls frontline 2 where they really want to lean into the girls aspect but they dont fully commit. then on the other side its like black beacon or zzz where the combat is really good and there halfway to that side but it like they dont fully commit to that either. its very good in both rights but not STELLAR. thats not why im dropping it though. my issue is that there are too many things going on game modes minigames etc. between work, life and the other games i play i cant commit that amount of time and it feels like if you dont you wont get pulls which is like the best part of these games. after the beginner rewards dried up ive signed in and play for like 2-3 hrs doing dailies and things and i havent been close to getting enough for a 10x in like 2 weeks. personally im more used to games where you can get like 1 maybe 2 a week and then give them money through skins and Battle pass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Saw an ad on Discord for 700 orbs for 15 minutes of game play. Clicked play game. Read through reviews during download. I have no interest in porn games. Got orbs. Deleted game.",
      "voted_up": false,
      "votes_helpful": 174
    },
    {
      "review": "Too long prologue, tutorial, other mechanics that new players or mid game players wont give a f-. \nOverusing bikini/other erotic clothing instead of fixing the actual gameplay. \nFalsifying the guarantee of getting orange star operator when you spend 4800 purple crystal on a 100% guarantee operator banner and getting jacksh- and the 4 armed girl\nThinking that using ch.14 as a prologue instead of ch.1 is a smart marketing move, to gaslight the new player that they will be getting OP operator.\nMaking the ch.1-10 as a legacy (Tf do you think of us, a darn fossil?) Just because you make them breast bigger and jigglier doesnt improve anything, not even your player in game count.\nPlain administrator (I've seen lot of games that using eye covered, tall, and mid bulky man as a self-insert.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The game itself is great but PLEASE play the standalone client. The Steam version is subject to an error that makes the game completely non-fuctional. Also, change localization file to 1 to remove the censors.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Spent a couple of hundred on this game, but everything is censored now",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "Cant Invert Y.. Forget about it. Game looks super cool. I would love to play it, but come on, no invert Y, seems like such an easy fix from the developer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hat mir unfassbaren spass bereitet dieses Spiel komplett nackt ausgezogen zu spielen, war super spanned die story und extrem bereichernt, danke fuer dieses Meisterwerk.\n\nEuer Ding\nLG\nPurple",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Got bored alr while tutorial. just run shoot repeat. boss u can just stand still and not die.\nThe focus of the game in on the tiddies overall kinda ass\nOverall gooner Gacha game\nthx for the orbs but not my cup of tea",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Imagine booting up a game and the “challenge” is surviving 15 minutes of bargain-bin menu music just to collect the currency on Discord. That’s not a reward system, that’s hostage negotiation with a soundtrack. If I wanted to feel trapped and nauseous, I’d ride public transport at rush hour. This isn’t gameplay, it’s an endurance test designed by someone who clearly hates both players and headphones.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The run of the mill Chinese gacha game. If you've played Genshin, ZZZ, or any others, this is essentially the same, except somehow worse. Movement is kind of slow and clunky.\n\nWhy is part of the tutorial to go to some island with a girl (that I did no choose), select desert stuff, and then have to play this clunky minigame about shooting the stuff into her cup? You can't even really 'accidentally' miss and hit her with it. That would actually be kind of s3xy maybe. \n\nI also don't understand why sometimes the game has the Hentai tag, and sometimes it doesn't. Nothing about this game is particularly hentai.\n\nThere are much better games with better Waifus. Goddess of Victory: Nikke is one of them.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "there's no returning bonus, so don't expect much when coming back to the game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Came for discord orbs. Froze on the launcher. Couldn't even try the game. Let the timer tick down. Uninstalled. Fix your shit if you want people to play.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "no, just dont its like genshin impacttt, but way way way worst so dont istall this game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Is this a gacha or a dating sim? \nI installed this game because of a discord mission, but I was genuinely willing to give it a try.\nDefinitely not recomended\nThe visuals are very poor, the controls are a mess, the story just seem to be a dating sim.... At least give me some animations in the dialogues!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Login to Discord.\n\nYay Discord Orb rewards!\n\nBut gotta \"Play for 15 minutes\" 😤\n\nInstall, start game. \n\nGoon af game 😐😐\n\nBut actually try to play it and... God have mercy. It was a suffering, this game is an empty shell with no purpose to exists. Everything feels weird to play, and the characters... Jesus Christ i'd rather let a 10yo child write the voice lines. I am UNABLE to connect with them at ALL.\n\nGet Discord Orbs.\n\nUninstalls.\n\nIt was a pain to play, thank you for my new traumas 🤝",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR: Mobile crap ported to PC...skip it. \nThe intro is classic Asian-gatcha design....an overly convoluted post-apocalypse jargon-laced blab followed by micro-seconds of gameplay between each hard stop forcing you to perform an obvious, specific action. Can't even interact with the main menu (once you get there) because the game is tutorializing how to start the next mission by pressing the *confused gasp* \"Play Next Mission\" button...how would I EVER have figured THAT out!?! The first character is the stereotypical asian-robo-girl that has no emotions...how endearing: a null blank of a person *sigh*.\nEach mission is about 2 minutes of walking down a street, blasting a few enemies and it's over, show an array of probably worthless loot and progress-bar levelling-up animation. If I wasn't on an SSD, it would probably take longer to load to and from each mission than it took to actualy play the mission.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Too much Goon not enough Game, tried it solely for the Discord orbs. The game play is good overall, but its way too easy. On top of that I don't want or need the characters to be calling me, \"darling\" every 15 seconds so I probably won't play much more of this game. I also noticed the camera gets locked and you don't have much freedom to look around in some levels.\nIt's got an interesting game's framework, just has a few small issues, and the relationship with the characters is just not for me.  I can see why the game has a player base though.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I saw this through discord, of course, and went through the reviews. I saw some super helpful reviews and alot of \"reviewbombs\" and after trying for however long I could. I can say this game is a do not play\n\nIn the ~30 minutes I played there was every bad harem anime plot I could think of, a character cosplaying as of legal age, and pretty middling gunplay.\n\nJust do anything else.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Done it for the 700 discord orbs but my god. The dialogues are awful. Every single encounter with one of the female characters ends with the player hugging or kissing them and like half the dialogue is spent on that. It feels like an overly horny teenager wrote this.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I downloaded this for discord orbs but Honestly, i had quite a good time with the gameplay, felt smooth & the artstyle is nice but it's sadly a visual novel when it's in between gameplay.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I can't overlook anything except how poor the draws felt in this game. It was fun but the dissapointment innurmable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "came for the discord orbs\n\nstayed for the waifus\n\n\n\n\n\n\nstill a sh1tty game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Are the stutters apart of the game? Also Mid shitty game only played for Discord Orbs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "played for discord orbs and this game honestly SUCKED. stereotypical harem game and incredibly boring and is just a lame gacha game for gooners",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The environments feel soulless, mission objectives are always killing enemies, which are never interesting to fight even with their attempted mechanics. The 2 times ive played there were different events with the exact same objectives. The english voicing is weirdly intertwined with other languages in this jarring shift in tone from speaking for the story to in combat japanese. By which i could not immerse in the story as i was too busy trying to figure out who's voice was who's. Obviously this game was meant for gooners, but not even i could get behind the empty feeling of everything else it needs to qualify as a \"game\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not 100% certain on what is going on with this game but it seems like you need to be permanently hooked up to it like Cartman and the boys from Southpark during their WOW fest ( same as Reddit mods that never leave their computer screen) or you need to drop 300$ to unlock everything.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "came for discord orbs, game has decent gamplay with guns and ults, but was unable to change any graphical settings and English to other languages VA throughout the tutorial, you're kinda stuck in a loop before even able to do any of this. Story is weak, but since \"hentai\" tag is on, I won't really fault the devs for this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game's Tutorial is never ending.... it will take hours and hours before you can have the freedom to click and browse... it was so frustrating....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Soulless and boring, seems to me like this discord quest has backfired slightly.\n\nGame bad, orbs good :))",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Snowbreak is by no means a bad game. sure it has jank. so if you are looking for a gacha game that is as polished as genshin, honkai, zzz or wuwa, you won't get it here.\r\nThe missions hae major stutters, even when i fps-lock to 60fps. and that is with a 3080, 32gb of ram and an i9 running the game at high graphics setting and under.\r\nIs the combat good then? is 'aight at best, every encounter feels like i use a nuke on a rat. the cover mechanic is useless, since i can tank all damage, and never get under 30% HP. \r\nBut for me, the worst is the sound, specifically the sound effects of explosions and guns. they all feel lackluster and without oomf.\r\nBut that being said, i really do enjoy the gameplay loop, the graphics and the story i did understand.\r\n\r\nHowever, if you are a gooner gamer like me, this is THE perfect game for you. As the MC of the game, it seems like you are in a pseudo-relationship with all of the operators (the gacha girls if you will).\r\n\r\nI say pseudo-relationship for one reason only. i did not ever get the chance to find out.\r\nI was lucky enough to experience a story glitch so aneurysm-indusing, that i HAVE to give this gacha game a negative review.\r\n\r\nWhat happened you might ask? Glad you didn't ask. I had just gotten around halfway into the second chapter, and decided to call it a night.\r\nwhen i log in next, i am FORCED into chapter 14 part 2, with no way to go back to where i should be in the story.\r\nSo i contact support, and what do they say? They tell me to follow the guide to switch chapter. \"yes!\" i thought to myself, only to go in and find out i needed to complete chapter 15 part 2 and another story to do so.\r\n\r\nSo now i am up to date with the story, have no idea what, why, when or why i should care.\r\nSo if you are unlucky enough to get the same glitch as me, i can only reccommend a quick unintall.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Install Snowbreak.\nDiscord : “Play 15 minutes for orbs.” \n😑\nAlt+Tab.\nWatch YouTube while characters boobs fly on idle screen. \nAchievement unlocked: **Free Stuff Collector.**\nExit, uninstall.\n\nPleasure as always 🤝",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Gameplay and Gacha seems fine, very intriguing in fact. But the hard cuts every Mission end, the overload on things to do right from the start and the confusion when you accidentally start some stuff that's storywise on a complete different point, it's so off putting, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it's like a really trashy meal you know isn't good for you, and wasn't that good anyways, but it was cheap and filled for the day\nthen you threw some of it in the trash and it started smelling putrid a few days later",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "what the fuck did i just \"play\"\nthis aint even a game\ni had more fun watching the download progress than this shit",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "My fellow scholars and humble gentlemen we meet again. The game loop is fine. The gun play is fine. The graphics are fine. the characters are fine. The game is just that \"fine\". The big draw is of course the half naked girls of questionable ages. It does get a bit ummm odd when you can do things like a massage or take a shower in a fps game and it makes you feel like this a game that you can't play in front of say your girlfriend or wife. There is a solid foundation here but it feels like the game play wasn't the focus of the devs. If you want a mid game with anime girls barely clothed then this is for you. But if your looking for a solid fps looter shooter I'd say pass on it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Snowbreak: Containment Zone is a 3D Waifu sci-fi RPG-shooter powered by the Unreal Engine 4 that offers a next-gen, cross-platform gaming experience, sharing your progress across all of your devices.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "80% menu interaction 10% worst gooning bait youll ever see 5% shitty minigames 5% actual \"base\" game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Not even sex appeal can save such a boring game.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Yeah I think I had enough. Time to quit ... officially one of the many goon games in the market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "only play if you like gachas and women with hella proportions",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Almost a great game, if only it wasn't a gacha...",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "trash game just full of Sexu",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Insanely boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Started out with a good and interesting story with decent mechanics, there was a cover system, there was a system for knocking enemies off the map to instantly kill them. Over time these mechanics were moved away from and the game devolved into generic press skill button gacha slop you've already played a million times before with games like genshin. Boss arenas are just big circles with nothing else to add depth to them.\n\nThe story devolved into a harem and the heroines' personalities were scrubbed to the point where they're not allowed to think about or care about anything other than the main character because the overly sensitive player base got really upset one time when one of the female character interacted with a male in a clearly non-romantic way. What used to be really endearing heroines now feel more like dogs than people which while dogs are man's best friends, it becomes really weird when said dogs look human. Even though the girls are very much human, i can't shake the idea that it feels kind of like bestiality due to the way they act. There's a huge master and slave dynamic with the \"romance\" in this game and it all feels  really weird and awkward.",
      "voted_up": false,
      "votes_helpful": 240
    },
    {
      "review": "⭐️⭐️✨ 2.5/5 – Snowbreak\r\n\r\nSnowbreak has potential, but it just doesn’t hit the mark the way it should. Visually, the game looks great — the characters, effects, and environments are solid. But once you start playing, the shine fades a bit. The gameplay loop feels repetitive, the controls can be clunky, and the grind gets tiring pretty quickly.\r\n\r\nThe story tries to pull you in, but it never fully lands. And the progression system leans too heavily on gacha and upgrades, which kind of kills the fun if you’re not ready to invest a lot of time or money.\r\n\r\nIt’s not a bad game, just not as enjoyable as it could be. There are some cool moments, but they’re buried under uneven pacing and repetitive missions.\r\n\r\nOverall: 2.5/5 — decent visuals, weak execution, and not something you’ll stick with for long.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Boring. The bots are inclredibly stupid. Holding left click and occasionaly press e/q does the job 90% of the time. Enemies almost deal no damage. Even the bosses, unless you are literally getting hit by everything or are vastly underleveled.\n\nThe menu is confusing (2 shops, millions of tabs) and for whatever reason you play chapter 14-16 before 1-13....\n\nMaybe it is fun if you get to the late game, but why would anyone bother going through this sleeper gameplay to get to the fun part. This game seems not to be made for PC - however it has a PC client. So it should not have the gameplay and AI of Counter Strike: CZ.\n\nAnd on top it's a gacha...",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Game forces you to start playing at around Chapter 14 instead of Chapter 1 with no way around that... Horrible and confusing mess for a new player that wants to get into the story .",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "I'm only giving this game a negative review because of the overused trashy \"tap this\" tutorial that literally does nothing but force you to play 10-20 levels before you can do anything... including change settings.\n\nIt's honestly so annoyingly bad i think i'm just gonna delete the game... I feel like they made it worse cause when i played originally it was 5 forced missions at most.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Gameplay-\n☐ You have to try it\n☐ Good\n☑ Decent\n☐ Okay\n☐ Bad\n\nGraphics-\n☐ Masterpiece\n☐ Beautiful\n☑ Good\n☐ Will do\n☐ Bad\n☐ Awful\n\nAudio\n☐ Amazing\n☐ Very good\n☐ Good\n☑ Decent\n☐ Not too bad\n☐ Bad\n\nStory-\n☐ Lovely\n☐ Good\n☑ Meh\n☐ Not great\n☐ None\n\nDifficult-\n☐ Just press a bunch of buttons\n☑ Easy\n☐ Significant brain usage\n☐ Easy to learn / Hard to master\n☐ Not so easy\n☐ Difficult\n☐ Dark Souls\n\nGrind-\n☐ Nothing\n☐ Only if you care about leaderboards/ranks\n☐ It isn't necessary to progress\n☐ A bit grindy sometimes\n☑ Average grind level\n☐ Too much grind\n☐ Insanity\n\n[h3] Improvement Ideas [/h3]\nSeasun, please spend more time designing the actual game instead of focusing more on events. I will give extreme credit to the dev team for the Cerulean Getaway update. The minigames in this patch are phenomenal, and I am really proud of their work in being able to add them to Snowbreak. However, I am [b]BEGGING[/b] you, most players end up leaving due to shallow gameplay, except for the degenerates like me who can't stop playing gachas. There are even ideas to improve the game that don't change the gameplay loop, like changing anything that isn't combat to be faster. Puzzles and interactions are painfully slow, like you might as well embed YouTube to keep me from just staring at my monitor thinking about why I'm doing this to myself.\n\nIt could be fun to make level selection more engaging, use features like the Base to give a player another reason to use the base if they want, but still keep the current click menu option. Think of Brown Dust II in their menu design.\n\nFor combat, please rebalance the design, make supports more than just damage buffers to make your current limited operative OP you can easily add healing/shielding or movement into their kit while raising the enemy damage. Also, greatly increase the critical hit scaling; this just makes shooters more satisfying. Rebalancing the importance of healing/shields lets players sustain enough to burst down enemies with head shots or buffs, or play with positioning and [b]FINALLY[/b] put use to your forgotten cover mechanic. This one creates more engagement with team building and combat while still giving players options to do whatever they want. You could even make a new operator gaining buffs using the cover mechanic. However, this will drastically change the current gameplay, so these combat ideas could be superficial.\n\nCombat flow is terrible. Walking miles across an empty map in a linear, pointed direction, and when you hit the late game, you instantly evaporate everything, and then keeping walking is not engaging. In some way, make the player move faster, either naturally or through supports or even add vehicles. Change the damage scaling depending on body parts, increase the damage for crits and head shots. Also, make snipers different, just being a long-range spam shoot that tickles is boring. They have no power when hitting head shots unless you are playing a mission that you are over-leveled in.\n\nFor operative balance, if they do rebalance combat and don't want to change operatives, then make supports be more meaningful. With a bigger support impact, at least players can still opt to use older operatives with stronger support. Again, credit to the dev team in the Cerulean Getaway update, with the new Fenny being refreshing to play.\n\nLevel design, think of Call of Duty campaigns, you mainly do the kill all enemies, but some change objectives. Could add a sniper level that isn't operative locked, or give them the option to let the players learn and use what they want. Another could be clearing an area and then surviving for some time, or just surviving in an area with turrets you can place on the map that you have to repair if damaged. These can be in the main story or just side levels you use from time to time. Something new to break the pattern of slop that is the same thing, but put a few mechanics in that are either new or old, and call it done. Also, change level transitions. If you really want to keep the core feature of shooting, then why tf are we spending more time in menus than playing? Instead of leaving the scene to go menu to menu, keep the player in the level, then prompt if they want to continue and generate the next level inside with seamless loading, like turning the camera to look behind while the operative walks/runs to load the next area. It's okay if the animation locks during big packets. At least it beats clicking static buttons and menus just to load for 2 total minutes. Edit: In the Defiant Bloom update, they do attempt the sniper mission in the event story, which was great. It was a bit stiff in nature, but I love that they are trying. Good stuff from the dev team. I hope this new design approach moves into the actual main story. If they find it hard to rebalance the current design, then adding these new mission ideas will help a lot.\n\nSkins could be more than what they currently are, and would make more money. For starters, add more effects like unique bullets/shooting or reloading effects/animations that are easily noticeable if you don't want to put more work into them. The biggest thing to add to skins is making them interactive in combat, each kill scales to the effect, or head shots make the skin do something, literally anything. Also, the game censors itself by default, but it is really easy to disable it even though it isn't in the game settings. For those that complain then maybe add a settings option that tones down the fan service and slightly alters designs, say a skirt is too short, then make one that is longer. Either way, I still buy their skins because I like the game and I think they look great. It just isn't godly, and in most cases, I say not worth it. They have been getting better after the Defiant Bloom update. This also adds value that skins are customizable, also regarding modding, it's odd behavior to spend resources countering mods when we can barely use them to improve our game. . .\n\nGacha system needs to fix the rate of income, for the rate of banners rotating compared to how much rewards give is horrendous. You can get around 20-40 pulls each event, and pity is 80 for 50/50 on operatives or 60 on weapons, with a direct power creep next event. If you take other gacha games seriously, then this one is not for you. The main reason for pulling in this game is if you like the character, and that is [b]ALL[/b]. There is no important mode that rotates for currency. They only rotate modes for materials, which only matters to the small percentage of players that want to max stats for a handful of modes that care about that.\n\nThe stamina system needs to be tweaked. The stamina system is so bad that they give you tons of items that restore stamina so you can continue playing. Why not rebalance the stamina or integrate those items into the stamina naturally, rather than using items that expire at that point? One positive is the other stamina system to farm shards to build copies of your owned operatives, even if it is painfully slow and capped to prevent quick upgrades. \n\n[h3] TLDR [/h3] \nThe game is unique, but it loses its charm after a few plays, and then you uninstall it, or you hate gooners and don't install. Sound design is 50/50, some good, some negligible. Art, graphics, and controls are good, but the gameplay loop contradicts its core design, making the game feel like it pushes you away, regardless of whether you like easy mobile game designs or shooters. The best feature is event minigames, which are popular games converted to fit within Snowbreak. Shooting = coolish, game balance = not cool, daily grind = extremely easy, max grind = jobless, skins = paid mostly, gacha = income painly slow but good odds, gooner = with more updates.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "Game has been falling apart over time, and the devs only care about pleasing CN whales",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Could've been a cool sci-fi anime shooter, now it's just gooner slop. \nLike, the devs could've at least made some futuristic skins fitting to the setting, but no, here's some normal ass bikini lol. Oh and the guns went from cool futuristic guns to shitty toy guns you'd see in a cheap chinese shooter game....oh wait.\nAlso why does this game take up 40GB of storage space? The game doesn't even look that good and there are plenty of games that have more content to play that take up way less storage space than this game.\nAnyways I'm just gonna get my discord orbs and then get this shit off my pc.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[h1]TL;DR: Lots of boobs with solid physics, but very lackluster shooter.[/h1]\n\nWay too much clicking on text for the story to continue so I just skip it altogether. The game settings during the ~30 min long tutorial are a joke as you can change exactly three aspects of keyboard sensitivity and that's it. No graphic settings or audio settings whatsoever.\n\nThe combat felt fun at first as you fight your way through a bunch of enemies at once with different kinds of enemies appearing after time. But once I stopped shooting and let the enemies attack me I found out that they are pretty much useless and I could stand still for 5 mins or more without getting killed.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Well how can i start this ?, this is pretty much the first i time i ever touched a gacha adjacent game and i know this kind of genre have some \"quirks\" that may not be appealing to the general masses so i wont judge the game on these \"intergral\" features, with that out of the way i will talk about the aspect not influence by the genre\n-Gameplay: I genuinely dont know if this is the quirk of the genre but my god the gunplay is so boring like watching literal paint dry, no recoil, no feeling, aiming is pretty much for show, enemies is brain-dead, singular attack strategy, lacking variations leading to stale engagements and bosses are so easy it is trivial, dodging is not exactly needed because why would you dodge when you can just walk out of the attacks like youre on a stroll in the park, overall lacking energy and not engaging\n-Characters: i know the game is supposed to be an eye candy type of game but like can they at least try some uniqe spin, twist on the tropes of each of these characters, they are like straight up walking tropes of every single character types from the interaction down to the design but with perfect physique for maxium \"attractiveness\", overall generic, uninspiring, forgettable, the voice actors performance sometimes feel forced and too scripted, sometime feel unbothered like they just want to get over this fast, and the whole experience feel like those cheap and cliche-filled isekai anime with the diolauges\n-Sound: average, run of the mill sound effects and music, corporate and feel manufactured, overall unimpressive and so dont expect much\n-Lore&Interactions: for some reason the game made me walk through 45 minutes of boredom-inducing gameplay and dialouges before the exposition and general world building, when playing i keep questioning what the heck are these things you guys talk about and general very confused, onto the interations, without build up of the relationships and character developments every single activities and voicelines by each characters feel so distant, foreign you dont really have a connection or resonate with their interactions at all, as a matter of fact i just skip the voicelines and just straight up read and skip all of their dialouge to obtain the information on lore and thats it, dont really feel the need or the drive to really sit and watch them interacting \nI came in expecting nothing and came out expecting even less, if you want to play some barely passable gunplay,boring gameplay and like watching anime girls then i think this could be your thing but if you want something of higher caliber then look somwhere else",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game went from pretty fun with some gooner bait to just pure gooner bait with no fun",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "its pretty good. but to me it feels like they dont know where they want to go with it fully. like its like half way to girls frontline 2 where they really want to lean into the girls aspect but they dont fully commit. then on the other side its like black beacon or zzz where the combat is really good and there halfway to that side but it like they dont fully commit to that either. its very good in both rights but not STELLAR. thats not why im dropping it though. my issue is that there are too many things going on game modes minigames etc. between work, life and the other games i play i cant commit that amount of time and it feels like if you dont you wont get pulls which is like the best part of these games. after the beginner rewards dried up ive signed in and play for like 2-3 hrs doing dailies and things and i havent been close to getting enough for a 10x in like 2 weeks. personally im more used to games where you can get like 1 maybe 2 a week and then give them money through skins and Battle pass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Saw an ad on Discord for 700 orbs for 15 minutes of game play. Clicked play game. Read through reviews during download. I have no interest in porn games. Got orbs. Deleted game.",
      "voted_up": false,
      "votes_helpful": 174
    },
    {
      "review": "Too long prologue, tutorial, other mechanics that new players or mid game players wont give a f-. \nOverusing bikini/other erotic clothing instead of fixing the actual gameplay. \nFalsifying the guarantee of getting orange star operator when you spend 4800 purple crystal on a 100% guarantee operator banner and getting jacksh- and the 4 armed girl\nThinking that using ch.14 as a prologue instead of ch.1 is a smart marketing move, to gaslight the new player that they will be getting OP operator.\nMaking the ch.1-10 as a legacy (Tf do you think of us, a darn fossil?) Just because you make them breast bigger and jigglier doesnt improve anything, not even your player in game count.\nPlain administrator (I've seen lot of games that using eye covered, tall, and mid bulky man as a self-insert.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The game itself is great but PLEASE play the standalone client. The Steam version is subject to an error that makes the game completely non-fuctional. Also, change localization file to 1 to remove the censors.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Spent a couple of hundred on this game, but everything is censored now",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "Cant Invert Y.. Forget about it. Game looks super cool. I would love to play it, but come on, no invert Y, seems like such an easy fix from the developer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hat mir unfassbaren spass bereitet dieses Spiel komplett nackt ausgezogen zu spielen, war super spanned die story und extrem bereichernt, danke fuer dieses Meisterwerk.\n\nEuer Ding\nLG\nPurple",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Got bored alr while tutorial. just run shoot repeat. boss u can just stand still and not die.\nThe focus of the game in on the tiddies overall kinda ass\nOverall gooner Gacha game\nthx for the orbs but not my cup of tea",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Imagine booting up a game and the “challenge” is surviving 15 minutes of bargain-bin menu music just to collect the currency on Discord. That’s not a reward system, that’s hostage negotiation with a soundtrack. If I wanted to feel trapped and nauseous, I’d ride public transport at rush hour. This isn’t gameplay, it’s an endurance test designed by someone who clearly hates both players and headphones.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The run of the mill Chinese gacha game. If you've played Genshin, ZZZ, or any others, this is essentially the same, except somehow worse. Movement is kind of slow and clunky.\n\nWhy is part of the tutorial to go to some island with a girl (that I did no choose), select desert stuff, and then have to play this clunky minigame about shooting the stuff into her cup? You can't even really 'accidentally' miss and hit her with it. That would actually be kind of s3xy maybe. \n\nI also don't understand why sometimes the game has the Hentai tag, and sometimes it doesn't. Nothing about this game is particularly hentai.\n\nThere are much better games with better Waifus. Goddess of Victory: Nikke is one of them.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "there's no returning bonus, so don't expect much when coming back to the game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Came for discord orbs. Froze on the launcher. Couldn't even try the game. Let the timer tick down. Uninstalled. Fix your shit if you want people to play.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "no, just dont its like genshin impacttt, but way way way worst so dont istall this game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Is this a gacha or a dating sim? \nI installed this game because of a discord mission, but I was genuinely willing to give it a try.\nDefinitely not recomended\nThe visuals are very poor, the controls are a mess, the story just seem to be a dating sim.... At least give me some animations in the dialogues!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Login to Discord.\n\nYay Discord Orb rewards!\n\nBut gotta \"Play for 15 minutes\" 😤\n\nInstall, start game. \n\nGoon af game 😐😐\n\nBut actually try to play it and... God have mercy. It was a suffering, this game is an empty shell with no purpose to exists. Everything feels weird to play, and the characters... Jesus Christ i'd rather let a 10yo child write the voice lines. I am UNABLE to connect with them at ALL.\n\nGet Discord Orbs.\n\nUninstalls.\n\nIt was a pain to play, thank you for my new traumas 🤝",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR: Mobile crap ported to PC...skip it. \nThe intro is classic Asian-gatcha design....an overly convoluted post-apocalypse jargon-laced blab followed by micro-seconds of gameplay between each hard stop forcing you to perform an obvious, specific action. Can't even interact with the main menu (once you get there) because the game is tutorializing how to start the next mission by pressing the *confused gasp* \"Play Next Mission\" button...how would I EVER have figured THAT out!?! The first character is the stereotypical asian-robo-girl that has no emotions...how endearing: a null blank of a person *sigh*.\nEach mission is about 2 minutes of walking down a street, blasting a few enemies and it's over, show an array of probably worthless loot and progress-bar levelling-up animation. If I wasn't on an SSD, it would probably take longer to load to and from each mission than it took to actualy play the mission.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Too much Goon not enough Game, tried it solely for the Discord orbs. The game play is good overall, but its way too easy. On top of that I don't want or need the characters to be calling me, \"darling\" every 15 seconds so I probably won't play much more of this game. I also noticed the camera gets locked and you don't have much freedom to look around in some levels.\nIt's got an interesting game's framework, just has a few small issues, and the relationship with the characters is just not for me.  I can see why the game has a player base though.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I saw this through discord, of course, and went through the reviews. I saw some super helpful reviews and alot of \"reviewbombs\" and after trying for however long I could. I can say this game is a do not play\n\nIn the ~30 minutes I played there was every bad harem anime plot I could think of, a character cosplaying as of legal age, and pretty middling gunplay.\n\nJust do anything else.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}