{
  "positive": [
    {
      "review": "1. open fifa\r\n2. get in carrer mode\r\n3. start carrer mode with manchester united\r\n4. buy players that joined manchester united\r\n5. somehow won againts liverpool\r\n6. won the carabao cup\r\n7. in fa cup i went againts crystal palace and lost\r\n8. broke my joystick and tv on acctident \r\n9.my mom beated me up\r\n\r\n\r\nOverall Very good Game",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "great game if u want to kill yourself after every FUT champs game.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "The game was suck and many bugs , unless you start a career mode with Manchester United and you find out everything was fine",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I have played 9 other fifa/ea fc games and I have to say this is not as bad as some other games\nBut with that being said this game has some major flaws too \nMain thing being the pay to win system in multiplayer\nThe career mode has some good features but main issue is that illogical price tags \nyou might score 60 goals and only get a million or two price difference in this and also the AI is not that great. The passing can be a pain to get used to compared to previous titles\nBuy this game if on sale but definitely not worth the full price I guess its the same for all the \"EA FC\" titles",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "FC 25 brings new ideas: its “Rush” 5-a-side mode is a fun, fast-paced alternative that’s more lively than the usual full-pitch matches.\nDidn't pay much for this soooo.....",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "And as for FC 25. Well, at this time, version 26 has also come out, but overall the game is of good quality and the bugs of FC24 have been somewhat fixed. Overall, I recommend buying it. (Of course, if you can buy FC26, if not, this is great)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first fc and i had a great experiance ,i know people roast  the game about its physics but that what made it fun for me .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a football fan & former FIFA/FC player, nothing to say new about FC25, just writing a review for the Steam Awards Badge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This review may seem obsolete because its successor has been released, but if you are looking for better bang-for-bucks option you should get EAFC 25!\r\n\r\nGameplay is good, but the downsides are no updates for matchday squad list. Kinda bum but it's okay tho since i get this game for very cheap price (about US$ 9.00) here in Indonesia",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trust me guys, do NOT ever play online mode for your own health. Career modes have some issues, but they can still be enjoyable. If you like football, there’s no better game than this (unfortunately).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "apart from the boring repetitive nature of the game, this is still a good entry in the series with a good career mode to just scratch the itch i get once in a blue moon to play fifA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great to play . no compitative full of bugs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "EA Sports FC 25 has good graphics and a few nice gameplay tweaks, but it suffers from inconsistent AI, frustrating defending, and frequent bugs. Career Mode is decent, but online modes feel unbalanced and sometimes scripted. Not a big improvement over FC 24. Worth it only if you’re a casual player or haven’t bought a football game in a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent gameplay with great graphics, it's not a bad game if you can grab it on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stay away from FUT, use gameplay mods and you're good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1. open fifa\n2. get in carrer mode\n3. start carrer mode with manchester united\n4. buy players that joined manchester united\n5. somehow won againts liverpool\n6. won the carabao cup\n7. in fa cup i went againts crystal palace and lost\n8. broke my joystick and tv on acctident\n9.my mom beated me up\n\n\nOverall Very good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like fc 25 but when i play with ea app is error n i can`t play now coz ea app can`t open. why not open press play button like dota?why creat this ea app to playin.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Controls needs to get a little used to and after that gameplay is fun and come on it's FIFA so Hell Yeah i'm gonna glaze it!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 20+ hours, I'm genuinely impressed with FC 25. The gameplay feels more realistic than ever - player movements are smoother, and the new tactical options add real depth to matches. Ultimate Team is still addictive (though expensive), and Career Mode finally got some meaningful updates. The women's leagues integration is fantastic. Yes, it has the usual EA issues with servers and microtransactions, but the core football experience is solid. Worth it if you're a football fan.\n\nRating: 8/10 - Recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't play FC much, but I've been enjoying this game lately. Don't care about the online matches though. Kickoff is really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EA Sports FC 25 delivers smooth, realistic gameplay with improved animations and smarter AI. Ultimate Team is still very engaging, and Career Mode gets some nice quality-of-life upgrades. While it doesn’t reinvent the series and still has some bugs and heavy microtransactions, it’s a solid and enjoyable football experience overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every year is a must game to play, its just i have an issue regarding ea anticheat couldnt install properly in my system and make 3 files failed to validate that have impact my stuttering gameplay and input lag experience. Even so i still support the EA Dev, just hoping that EA will support their customer too to solve this issue soon. Thanks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "skill games will have you on lock, also get more levels before trying to follow builds. PLAY CLUBS WITH FRIENDS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play for Fun, Dont Competitive too much. Sometimes people just having fun instead winning the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is kinda suck but good at the same time, but still suck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play for Fun, Dont Competitive too much. Sometimes people just having fun instead winning the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EA FC25 is a fantastic purchase… mostly because it saves you from buying EA FC26, which is basically FC25 with a new logo slapped on like a cheap sticker. Honestly, why pay again for the same thing? EA already perfected the art of Ctrl+C, Ctrl+V.\n\nGameplay? Oh, it’s exactly the same.\nMechanics? Carbon copy.\n“New features”? Yeah, sure.... if rearranging menus counts as innovation.\n\nSo do yourself a favour: buy FC25. You’ll enjoy EA FC26 early, because they’re literally the same game. Congratulations — you’ve just outsmarted EA’s annual “pay full price for nothing new” tradition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "as gay furry i really enjoyed the game as IT HAS some sparkles and sunshines the community is mostly like me so i get along very well with real madrid fans as they are mostly gay and like something inside them the game is very good reccomend - gay furry vuz if somebody wants to contact me as they are also gay my discord is vuziukas dont be scared i love foreplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "never tried or cared about the FUT, just grab it at the lowest price and play career mode, that’s enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an Fifa so it is worth playing, but EA needs to optimize this game for PC. I have no issue with this game graphic gameplay or anything, the only issue I'm facing is the fluctuation in FPS when I'm playing on my laptop.\r\nWhen I first purchased it, it was working fine no fluctuation constant 120fps but I don't know what happened after 2-3 months it wasn't running smooth I tried everything but it did't solved the issue for me. Also their is a new bug as well whenever my display is on OPTIMUS the game runs but as I change it to DISCRETE GPU it doesn't work. Don't know what is the issue with this game. I played it ROG ALLY it was working fine but in my laptop it is trash.\r\n\r\nTo sum it all, buy it on sale and hope that bugs won't affect you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the game's graphics especially the simulation and matches or difficulty changes in between",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought it but I can't play the game with the game, what's the problem, am I calling it a bug?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EA FC 25 feels smoother, more realistic, and more responsive. Animations, shooting, and overall flow feel upgraded. Fun for both casual and competitive players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a verry good game when you  use your wasd keys Most people dont know how to  the controls are So they are trash talking it is very good 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It a good game but the AI on your team suck. I would recommend if this was your first FC/FIFA game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good game but i cannot connect to ea server its some problem on my end",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After having 100+ hours on this game i would like to say this game lacks in some aspects",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good.\nEA must analyse indian market if fc 26 slashed to 999 just like fc 25\nEA can eliminate indian online sales site",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its my 1st fc game so cool i guess, also got it for dirt cheap so there's that",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a realistic game filled with different moves and styles of diiferent player with great specialities",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked the manger career, it's fun to manage and play the team, also I like how you can change game tactics in the middle of the match, overall good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game and maybe the load prepare a game long time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! The career modes are great but there r some minor issue: Barcelona players are lowkey slow some times the AI is making some stupid things in important matches. Now the career player menu also have some bugs: after i join new club the quests that r on menu doesnt disappear but it shows that i have completed it. Low key its great i bought for 20 dollars discount so yeah, it worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game very fun to play absolutely with friends if i win i can taunting them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For me, overall good.. cause i dont know what a problem.. maybe i just enjoy the game.. Football, just overall okey",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty buggy game but overall is a good game to play with friends or even by yourself because you have a lot of things to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I see this game have negative reviews but I like this game a lot mainly because this is my first ever EA FC. So I have no expectations with what new they will be bringing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better realism, animations & physicality — Thanks to new technology (HyperMotion V), many players and reviewers note that movements, ball physics, and overall animation quality feel more natural, making dribbles, tackles, and general play look and feel more lifelike.\nMore management / customisation in Career & Clubs modes — FC 25 expands on club-management: for example, you can create clubs, customise stadiums/teams, manage youth/academy, and enjoy a refreshed “manager mode” feel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game play experience with good skill movements.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its good if you love having local coop sessions with your friends\nEdit: UT sucks after the release of FC26",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good game but i don t like that iis too laggy in online matches",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game. anyways not doing it for the review farm tho",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good game i broke already 3 controllers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im neutral in this thing i only review for the sake of community awards lmao but my take is i like this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is good but idk why im so bad in this game bruh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When i play FIFA i only play manager career mode but overrall my top 3 games of all time\r\nBUY IT NOW",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i used to play this game since i was 12. I'm now 42! go one EA ;) there some thing annoying me and that is that you need to be on line! i just want to sit and play the game with some of my friends, maybe there no net! what should i do?!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kalian harus main game ini, karena ini bagus jangan lupa",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mia mancat portofelu viata sociala si anxietatea multumesc fifa",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play it its fun and entertainiing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In general game is good to play with friends or just for fun, but if u play it for ultimate team It loses its reality at higher ranks of rivals, cause everyone scores with overhead kicks from midfield.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very fun and entertainin i have played this game for hours and not got bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game but comes with a lot of optimization glitches especially on some specific monitors",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Go to game to play when you wanna chill or spend time with bro. Not an expert at this game but it is fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game until you play against thre svets",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mbappe miniscule hair always getting an offside, please fix",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Job bugging my game at Promotion ads",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game with soccer players",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played UT once and destruyed both of my controller. I adore ts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game so far IMO ... must play this game if you are football fan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game fifa 24 but changed the name to fc 25 love!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there are still some bugs that force restart on launch",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "same gameplay, but thats ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, can be better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a lil bit stress but overall its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dont mind me, just want to post review for steam award goal",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Asa si asa. Captivant dar are multe bugguri.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolute dogshit game, not scripted",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "have some bugs but overall i still enjoyed playing the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best, good technique. Good quality",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Being longtime Fifa/EA FC player I love these games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the game the skills you guys made is even better than fc 24",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good but same as last year game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very good and it has nice quality",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good with friends and works if you are a loner too :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it very fun game only problem is price",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great gamee but you need controller",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very good and i will recommend to all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EA FC Series is The Best Game Football in The World",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At least some updates in a career mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Almost the same game every year. Better wait for heavy discount :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game, started playing from fifa 21",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Many Bug but its a good game so nvm",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "understandable have a great day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "has its flaws but still good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For how bad it is, it's kind of good. It's got that wabi sabi to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well its good but a huge cash grab",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good performance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a good game to play with friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just average football experiance..",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The AI is so bad it sometimes makes me just press Alt + F4. Especially in Player Career mode — there’s no point in leveling up my player if the AI is going to decide where my shots will land. This is by far the worst FIFA game I’ve ever played in my life.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "EA has to be the worst publisher to have ever existed. Why do I have to log in with EA account to play on Steam, where I purchased the game.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Save your time, sanity, and money.\nStay far away from this game — it’s fully pay-to-win and drowning in microtransactions. \n\nEvery year they recycle the same game with a new player on the cover and somehow make it worse.\n\nThey even removed the only good thing — the story mode. EA really outdid themselves in disappointment; truly Microtransaction Simulator 25.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Save your time, sanity, and money.\nStay far away from this game — it’s fully pay-to-win and drowning in microtransactions.\n\nEvery year they recycle the same game with a new player on the cover and somehow make it worse.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "they just bring back match intro and change the name from fc24 to fc25. bug everywhere, gameplay same as the previous. they not seprate the UT game and Career mode gamepla. game speed is set by the player speed and pass speed slider. this thing make player overall rating useless",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game's trying to force me to buy FC26, has been doing it since 26 released, wont even let me play anymore, just a giant ad for FC26 comes up and doesn't let me go out of it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Every time i think it can't get any worse, IT GETS WORSE. \nI play career mode mainly. Players with 90+ pace can't run in career mode. They are fine in exhibition matches but can't run in career mode. \nbut the worst thing in this version is that they have removed player instructions(substituted with new lingo and 2 options max)  and manual player positioning on the tactics (can't change a player position manually from the preset formations). \nAlso can't see the defensive line when setting tactics - you have to imagine how high the defensive line is from the number\nhandball - if you're making a defensive action in the box, 90% of the time it's a handball somehow\n\nI'll add more details as i play further",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For some reason fifa continues the tradition of imput laging and slowdowns of players in every other match despite good internet connection ...Dunno if im buying another one ever again ...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the Dog Sh!t game, blacks out / crashes mid game, full of ads to buy fc 26 and nonsense garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only got it cuz it was on sale for dirt cheap\r\nsingleplayer mode is fun but the amount of bugs is just insane\r\nalso the fact that everytime u open the game it has to load for longer to load the unskippable fc26 ad is ridiculous and typical ea fashion\r\ndont buy this game for full price nor any other of these shitshows",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Same fucking joke as every year. Bought it when it was like 90% off - wouldn'tve payed a cent more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not Recommended\n\nThis game is a laggy mess. The performance is terrible on PC because it’s clearly not optimized at all. Stuttering, input delay, frame drops, you name it. It honestly feels like they slapped new menus on top of the same broken engine and called it a day.\n\nWhat makes it worse is that the gameplay hasn’t improved either. In fact, FIFA 14, a 10-year-old game, plays smoother, feels more responsive, and is way more enjoyable than this. It’s embarrassing that a decade-old title offers a better football experience than a brand-new release.\n\nUnless they fix the optimization and overhaul the gameplay, I can’t recommend this at all. Total disappointment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Scripted, Scripted and Scripted.\nMaybe try removing the script instead of making the same game every year.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EA purposefully allow cheaters in FC25 so peoplecan buy newer game. Every game had so much cheaters. We are not stupid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you are looking for a realistic football simulator, keep looking.\r\nThe game is still buggy, unrealistic and it will never be better because the next version is out and that one is equally as shitty. Lets stop giving EA money until the do something right...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FC 25 is NOT working at all!!! This is honestly the worst update and worst game production I've ever seen. Fix this!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "people scoring a goal and passing the ball around until the game finishes. fix the freaking game. i want to shoot myself after each game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "⚽ Gameplay\nEA SPORTS FC™ 25 feels more like a minor update than a true evolution. The mechanics are familiar, almost identical to the previous entry, and matches often feel unbalanced. Attacking is overpowered, while defending feels clunky and unrewarding. Instead of realism, the game leans toward an arcade style that doesn’t capture the depth of football strategy.\n\n🎮 Modes & Features\nUltimate Team and Career Mode return, but with very little innovation. The new additions don’t feel substantial enough to justify calling this a fresh experience. Rush mode is interesting at first, but quickly becomes repetitive. For players who expected a bold step forward after the FIFA era, this feels underwhelming.\n\n👎 Weak Points\nToo similar to last year’s game.\n\nGameplay balance issues make matches frustrating.\n\nLack of meaningful new features.\n\nFeels more like a reskin than a new release.\n\n🎯 Final Verdict\nEA SPORTS FC™ 25 is polished but uninspired. If you’re hoping for a football game that pushes boundaries, this one may leave you disappointed. It caters more to casual play than to fans who value realism, strategy, and innovation.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant even play this game after fc 26 came out. Stuck on loading screen after every game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very bad performance dan unplayable on career mode. Whenever i play againts Liverpool, it got stuck at halftime.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the teammate AI in this game is absolutely retarded. meanwhile, the opponent AI seems to be the amalgamation of GPT-5, Stockfish, Gemini, and Deepseek, creating the smartest possible computer in existence just to piss me off",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s the most toxic game and it also has a lot of bad mechanics. Don’t buy it—please don’t give EA money for nothing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is still not playable on SteamOS or the steam deck. I don’t get why this is not being prioritized.  Reminds me why I hate origin and the entire EA anti cheat system. Extremely annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm so tired of this piece of shit. Let me explain what AIs are doing in the game. Every single time I go for the ball on the wing, it ends up out of play. Even when it's rolling super slowly, the player starts to jog like your old grandma. Additionally, my player always acting like a dumb ass, tripping over the opponents on the ground, only to show me that he has no choice but to lose the command of the ball. The game is totally scripted. Players seem to be so fucking dumb. So am I as an EA subscriber. Fuck your scripted match and fk you too, EA.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bl,e es tulit izdrazisu visus aiz ea games man zajebal ka to pisto gigu nevar ieslegt ir japisas pus stundu kamer vina iesledzas",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Deberian poner compatibilidad con Ps4, sacando eso de lado.. Es perfecto la jugabilidad.\nThey should put compatibility with Ps4, taking that aside. The gameplay is perfect",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute garbage. Game is just unplayable on keyboard and while they've added more \"stuff\" in Career Mode, gameplay is just unbearable. Tried too hard to create \"a realistic gameplay experience\", destroyed the only thing that was fun in FIFA - the gameplay.\n\nLiterally, just fuck EA.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass game striker doesn't shoot, , goal keeper does not know how to ♥♥♥♥♥♥♥ catch a ball defenders keep jerking off to each other, 10/10 game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is okay although the career mode is less developed than older versions. But the game is unplayably buggy. Constantly crashes and after updates there's new problems. \r\n\r\nThen they start forcibly advertising FC26 in the game. That is just absolutely unacceptable. Gross.\r\n\r\nI probably won't buy another EA game again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bugged so hard recently that I can't even do anything inside the main menu. And they keep shoving their ads about FC26 into my face + keep forcing me to be online when all I care about is the offline modes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The worst experience ever. I've spent more time fixing a crash issue when starting a match. Finally after hours of struggling, I figured it out MYSELF. But was so tired and frustrated+disappointed that decided to pay the game another time. Next day: I launch the game and run into ANOTHER black screen problem. Purely with my whole heart I hate everything about this game now. I'll never pay money to this company ever again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it will crash upon launching, i played for days before but i cannot play at all anymore, terribly optimized game it crashes and wont work, i have tried everything yet no troubleshooting fix works",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "- generally Anti Consumer \r\n- Game issues that havent been fixed for years\r\n- Pay to get\r\n- bad/ edgy gameplay\r\n- Gender mixing \r\n- \"Electronic Arts\"\r\n3.8/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unplayable, always stuck at the half time or full time, completely piece of shit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "player career is pretty buns. maybe this game is made so FC26 stand out, but taking out the skill tree is just too much.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sa suga pula tot EA-u! EA sports worst company, fooling people, banned me after 5 hours of playing, ea sports they all on my dick they suck me so hard!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buggy mess controller disconnects constantly, EA more like GEA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute piss take. Hadn't played for a couple of months and asked again for my credentials. Sick of it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "same same game over and over with upgraded bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EA is trash, the games have been bad for decades, now the company is following suit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only play FC for career mode and my goal is to become a legend when i start a career, with their new Man of the Match and Player of the Month and Ballon D'or system its moronic, If there are two players with a match score of 10, No matter how much better you performed, the awards always goes to the second best, Dont know what the hell EA is doing with their game year after year getting worse, Going back to FC 24 ... Skipping all new games till they either fix it or a new company starts making football games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "После хуйни 24, и 240 часов в этой великой игре, я могу спокойно сказать что это хуйня 25)))",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DONT BUY EVEN IF ITS 1 CENT .... Review from someone who has played fifa since 2013 and only career mode ... I'm saying this is trash ! 🗑️ Don't even think about playing it ... Players running feels like skating, Can't dribble it feels jitterish , header ? Never heard of ... U will be fuming i gave one last shot maybe they fixed in update... But damn I was wrong !!! U can see my Game hours ... Fifa 24 260 plus hrs fifa 25 20plus only !!! Came after so long to play this game coz I was having a bad day ... Now I'm having even badder day ! Flip you EA",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ako hoces secer i dugtrajnu bolest igraj ovo govno od igrice",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCK after spending many hours ,my  game is always crashed",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "gameplay is fucking terrible, please dont buy it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "THIS GAME IS NOT LOADING I HAVE PAYLED IT BEFORE WORKED PERFECT NOW NO IT NOT WORKING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont buy, even tho is the best soccer game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is ass don't buy. save your money and nerves.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Does not working with Linux and Proton.. EA Sucks!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game crashes as soon as i progress to next season in career mode",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute Garbage do not buy!!!!!!. 10$ too expensive than what you should pay....................... Doesnt even run on 3060 super with 32gb ram. There's no hand ball in the fking game. EA greediest company ever. Made their own football rules. download fifa 22 or 18 from fitgirl do not pay them any money. Doesn't deserve anything. I have played every fifa since fifa 15 and this game is actually the worst thought it would get better after fc 24 but they didnt take any reviews into consideration and still released the same game with more bugs. Fuck this company.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought the discounted version, idk. I think my system should be sufficient, but the game gives random endless loading and sometimes a blank screens.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i have 3080 but this shit still lags on my laptops others games runs perfect only this shit just wasted my money on this.. fifa 23 was better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Same old, same old! No game play improvements in a decade, but lots of money grab features.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT SPEND MONEY ON THIS GARBAGE.\n\nBoth the online and offline gameplay experience are horrible. Even Fortnite is a better developed game than this (I HATE FORTNITE). No matter how good your internet, SKILLS, settings, PC/ console and input devices are this game will purposely fight your inputs and follow a script to let your opponent score some very dumb goals and you miss dead on goals, especially if you win too many matches back to back. \n\nThe passing will have you tweaking, I swear it will purposely give your opponent the ball after a few very good passes.\n\nI have done multiple driven shots and sometimes the ball goes flying over the bar (Yes I time it very well I play on 180hz and 120fps or more). The training grounds is rubbish, it is nothing like a real match. Some games the computer will give you a fair game and others make you want to break your controller and everything you own.\n \nCheck online and you will see that a bunch of people have the same exact issues.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game sampah, isinya script semua, jangan beli ini bukan game bola, game penuh script udah di setting semua anjing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "scripted gameplay vs AI, you can't stop opposition when the game decides you have to take a goal (at least once per match)\r\n\r\nUT is rigged, stay away!!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is like the trashiest game ive  ever played don't buy this stupid game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "jebem li vam mrtvu decu nerodjenu i AI i moj clubs player koji ne bi mogao u supak kurac da ubaci a ne loptu u gol jebem i njemu kikice one roze",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the graphics n my pc are shit but i have very good pc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "basura, todo lo que esta mal en la industria de los videojuegos, representado en uno solo",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Przez tą grę straciłem 10 padów i swoją godność",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worse than 24, probably the worst fifa in years",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its crashes so much on my arc a 580 graphics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck fifa this number one bullshit... ufl is better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Classic EA, shitty gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sup yo this sucks play a real game like https://store.steampowered.com/app/3602290/FEMBOY_FUTA_HOUSE/",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "powiesze sije kurfaaaaaaaaaaaaaaaaaaaaaaaaaa za jaj a japierd0le",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "کص ننشون بالا نمیاد انلاینش بدون فیلتر شکن",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ea did something and nów it wont run",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit game, big fat pig dev",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just get 26. Don't bother with this pile of steaming shit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Does not allow in game updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad game bad mechanics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "career ended early from pubalgia",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "connection is the worst",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why this game not supported on steam deck?? Useless..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "only worth buying at a 90% discount",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Same game as last year lmao.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Deleting this game is more fun than playing it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game crashes all the time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cannot start the game...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game don't buy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It crashes a lot.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "might be the WORST game in the series",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the defensive system in manager mode is absolute rubbish",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fifa street better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a hassle starting on pc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Same shit different year",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game makes no sens",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I FUCKING HATE THIS GAMEEEEEEEEE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the bug count is off the roof",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "stupid game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game sybau",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it sucks ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game so suck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont waste your time. stutters",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}