{
  "positive": [
    {
      "review": "When I first saw the announcement for this game I was excited. Then I found out it was a souls-like and I was no longer interested. I'm fine with souls games but sparingly. A friend urged me to try the demo and that was the end of it.\n\nThis game is fantastic. Full stop.\n\nFirst, technical:\n\nI'm running on a 4080 Super/Ryzen 7800X3D. The game has the typical UE stutter. It's infrequent but it happens enough to be noticeable. A couple times it stuttered and got me killed. Also, I got 4 crashes while playing the game.\n\nThose hiccups aside, I played at 4k maxed settings with DLSS Qualiity and the game hovered in the 120s-130s fps. Absent the occasional stutter, the game is smooth and responsive and looks fantastic.\n\nI'd played a couple hours of the game before the update and had thought I was playing the game on Normal. It wasn't until I was at the end of the game that I realized I was playing on Expert. lol. Suffice it to say, if you play this game on expert, be ready for a challenge. It's brutal at times. BUT, Khazan's mobility (one of my biggest issues with souls-likes) is great. He's quick and his dodges are great. I hate the rolling of souls games, so this was a breath of fresh air. Brink dodges are incredibly satisfying in this game, the controls are snappy and responsive, and the combat can be quite fast depending on your build. \n\nThe audio is another great thing about this game. If you have headphones, it sounds great, but if you have a home theater setup with 3d audiio, hearing sounds from ceiling speakers is awesome.\n\nThere are two bosses that crossed the line from challenging to cheap/frustrating. Magic users. No satisfaction in beating them, only relief, so be ready for that. Only one boss had a camera issue for me and that was a boss that was huge. You could only target one area of it and if you get to close, the camera becomes a second boss for you to fight. This was poorly done and should have been addressed.\n\nThe story is good, but grim. Another reason I don't gravitate to souls games is they tend to be grimdark. That's a \"Me\" issue, obviously, but if you like that sort of thing, you'll be happy here. If you're like me and not much for grim stories, you may still enjoy it, as I did. Greatly. \n\nThe game is fun. There are plenty of things to find, loot to acquire, and secrets to uncover via hidden portals. Enemy types are cool and well animated, though optional bosses are simply recycled main bosses you fought earlier in the game. Not a huge deal but worth noting. \n\nConclusion, IMO First Berserker Khazan is peak. The combat, story, visuals, sound, and fun factor are all there in spades, and although the technical hiccups are annoying and SHOULD BE ADDRESSED, they are not so egregious as to ruin the experience. I loved this game and I hope you do as well. \n\nThank you for reading.",
      "voted_up": true,
      "votes_helpful": 43
    },
    {
      "review": "My Score: 8.7/10\nI'd call it the Anime version of Dark Souls 3. It took me a while to really enjoy and appreciate the game in view of the fact that I have long list of souls like games played already. What I truly have to point out is the quality in production value. \n\nDespite having a similar medieval fantasy setting, it boasts Anime graphics, good combat, great detail and a ridiculous creative amount on armor pieces, which I find is the best feature by the way. Positive and negative summary below. \n\nTHE GOOD STUFF\n\n+ Just like with AI Limit, this game boast an incredible beautiful Anime style game design which is very refreshing and fun! \n+ Great visual presentation and plenty of cutscenes, from intro to backstory. Some boss fights have good cutscenes too. This is one of the points where I say you can clearly see the effort and production value. They also put effort in storytelling and trying to convey an actual background. This is also where I give credit \n+ Easy UX/UI and great overview on the skill tree. Plus, there are plenty of special skills for each weapon type\n+ Combat is fun\n+ I actually like the \"functional level design\" that is a mix of linear and free roaming. Compared to other souls like games, I don't get lost at all. It's not as confusing as similar titles. This is another plus point. Also, plenty of loot\nHowever, at the same time the level design in terms of atmosphere and environment is pretty dull and nothing special. More below. \n+ A crazy amount of armor pieces, from top to bottom. You can mix up your appearance and make a weapon look like whatever weapon from the same category you like. THIS is a must for all souls like games. This feature is similar to NIOH and Assassins Creed games. \n+ The Korean approach and design philosophy is very detailed. I can sense they love souls like games. They respect the legacy games such as Dark Souls.\n \nMinor things I don't like or fall under the negative sides: \n\n\t- You can use only one main weapon… No swapping like in other souls like games, in which you can instantly change between two weapons or weapons slots. In this game: NO. You're restricted to only ONE weapon slot. Choose carefully. Quite annoying to be honest.. I LOVE TO swap weapons instantly, because that's how I always done it. You have to go to the menu and select gear - that's where you can select one main weapon. Note: If you get ATTACKED while on the menu and trying to change gear, the whole menu will disappear. \n\nThe main headquarters or home base (crevice) feels confusing. The design of pathways is confusing as hell. Not only that, it has basically TWO worlds where you need to traverse between. Either serves different purposes. One is for NPCs and blacksmith, the other world is to travel to other locations. WHY NOT COMBINE BOTH into one?! I didn't like it from the start and till now, I still hate it! \n\n- LEVEL DESIGN: Castles and other areas can inherent insane details on the floor, statues etc. The overall design looks very good. Functional level design as described above is alright but in terms of atmosphere, It doesn't really spark an interest to explore. We got the SAME stuff and atmosphere:\n\nCastles, temples, plenty of caves and dungeons that look very, very, similar and dull. Missions often take place at night or dusk. It's just so boring and I understand when people say \"levels look the same\" because the environment and atmosphere IS. Personally this is the biggest WEAK POINT. There are a few castle areas where I'd say \"ok this looks different and NEW\" but in general everything looks exactly like you've seen before.\n\n- I hate to be THE GUY, but since it is my personal and honest review, and how I feel about it, I got to say the title strikes amusement. \"THE FIRST BERSERKER KHAZAN\" - Couldn't it just be \"KHAZAN\"? Or \"BERSERKER KHAZAN\". \n\nMy verdict: GET THE GAME, especially if you've played any other souls like games, it's that simple. You'll feel familiar and get used to quick. On the other hand, the game can be newcomer friendly too. If you like fantasy action games, it's also for you. Give it a try.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "I actually bought First Berserker: Khazan when it first came out, played a few hours, and wasn't feeling it. The dodging and combat timing just weren't clicking with me, so I put it down and kind of forgot about it.\n\nRecently, I decided to give it another shot, and I'm genuinely so glad I did.\n\nOnce I got used to how the combat flows, everything suddenly made a lot more sense, and it became really fun. The more skills I unlocked, the more my whole playstyle changed, and it kept the game from ever feeling repetitive. It's one of those games that rewards you for sticking with it, and you can actually feel yourself getting better as you go.\n\nThe world design is absolutely gorgeous, too. And the bosses? I ended up loving most of them some for their looks, some for their mechanics, and some just for how satisfying it was to finally beat them.\n\nI ended up 100% completing the game, which is crazy considering how I felt at the start. But honestly, it turned into one of the most enjoyable Soulslikes I've played. If you tried it before and bounced off like I did, give it another chance. It was totally worth it.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "One of the best soulslikes I've played along with Lies of P.\r\n\r\nThe combat is impeccable, the artstyle and presentation are unmatched, and the bosses... I think that bosses in this game are perfect.\r\n\r\nDefinitely recommend it to anyone who likes soulslikes, or action games in general.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "This is the most Venom-Eddie Brock relationship you can see in a game ^^ (second most tbh, first belongs to The Darkness 2 imo)",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "🎀I received this game as a gift from my daughter who is nordic and the fact that it draws deeply from norse mythology makes it feel even more special to me.\n\nI honestly cannot remember the last time a game made me feel every hit so physically. In this, Khazan has a rare gift because it manages to make even the air before a fight feel heavy. There are no layers of systems piled on top of each other, no attempt to look more complex than it is. Just you, a weapon, and that annoyingly honest feeling of knowing that if you mess up, it is your fault. \nThe game offers a ton of builds and full sets that are normal, rare, epic and legendary, even upgradeable, and a lot of skills depending on your playstyle.\nWhat surprised me the most though is the rhythm, because it is neither frantic nor slow, it is just right. The game forces you to breathe at its pace, almost as if it wants to teach you how to fight in its world instead of adapting to yours. And when you finally start to understand, when the movements become instinctive like parries and counterattacks, that satisfaction kicks in that only truly well made games can give you.\nThe narrative and atmosphere go straight to the point. No wordy detours, no useless layers because everything is built to make you feel a world that has no time to waste. Cutscenes are short but sharp, and the way the story locks into the gameplay gives the sense that every step forward is earned.\n\nThere are some truly wonderful environments, one even reminds me of Anor Londo from Dark Souls while another reminds me of the dungeons in Elden Ring, and there are also huge castles to explore, collectibles to find, and texts that explain the lore in more detail.\nI also really appreciated the care in the details and worldbuilding. I am not just talking about the artistic direction but about the way the environments communicate what has happened in those places, not only beautiful in the classic sense but also interesting. Every location feels like it is telling a story.\nOn top of that, the game on ultra settings is incredibly smooth and well optimized. I did not encounter a single bug or performance problem, none at all. On the technical side it is exceptional work.\nThe game is quite rough and difficult and that is exactly what gives it character. It is a game that is not afraid to show its seams because what truly remains is the experience, not the polish.\nI usually don’t like using two handed weapons because they are too fast and I can’t savor every hit, but with my greatsword build the female berserker becomes a true earthquake with charged attacks and every swing is as heavy as a mountain.\nHonestly, it is exactly what I look for in a game like this and I hope for a sequel or even a trilogy.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3612001325",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The combat mechanics in this game feel great. I like it a lot. It has its unique style for a soulslike game. Plus, the art style and OST(Reese) goes crazy.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I wasn't a souls-like enjoyer until I tried this game. I am now a khazan-like enjoyer. combat so good",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Overall, a solid experience for me. It was nice to see some good QoL changes where an OCD person like myself may see where and what they missed. It was very comfortable to play in that regard.\n\nThe gameplay itself is nice. I was playing the game on expert to get the achievement and damn some of these bosses were brutal. But, like in any souls game, it gets easier after mid game. \n\nThe plot was a meh for me, typical formula but surprisingly unexpected conclusion(except the main villain thing ofc). The plot is just there.\n\nAnime like visuals were okay but the game sometimes dropped fps in very weird places.\n\nIf you are a soulslike enjoyer, then this game is just about right.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "the combat style is amazing, its level of difficulty is excruciating, at times, but satisfying and so much fun to learn. i LOVED playing this game andlearning mechanics it was an unmatched level of accomplishment to beat it and i will continure playing just for the fun of it. 10/10 in my opinion would HIGHLY recommend. Also the devs are incredible, beautiful caring people just the same.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Pretty cool linear souls-like. I enjoy playing as buff barbarian dude.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "IF YOU LIKE SOULS-LIKE GAME  POP IN YOU WILL NEVER BE DISAPPOINTED.\nHAS  FAST MOVEMENT AND PRETTY NICE COMBOS.\nKILLING BOSSES ARE SATISFYING.\nEasy 9/10 Game.\nVisual Art and the graphic design in this game is fantastic.But the Story could of been stronger.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First time playing a souls-like on pc with mnk, and second ever souls-like I've played. \n\nJust finished the main story on normal difficulty, and gotta say it's easily my favourite game I've played this year. the combat mechanic's are super smooth and feels polished. Even though there are only 3 weapon types, the skill trees and armour set bonuses allow for you to use each weapon in so many different ways, that you can use the same weapon throughout the whole game and make it feel very different. The levels all feel very unique and fun to go through, and fighting the boss at the end and unlocking new weapons and sets is rewarding. Each of the bosses feel very unique and towards the second half of the game they all bring a new level of hype and emotion when attached to the story. Speaking of which, I went into this game knowing that the story would be pretty basic, but I was really invested by the time I fought Maluca, and from there on I was playing the game for the story more than the gameplay and loot itself. The final few bosses are some of the best choreographed fights I've ever seen, and they all feel fair and honest to go against (very few if any cheap moves). \nOverall, the game runs very smoothly, looks beautiful on 1440p, and I highly recommend to anyone who likes souls-like/rpg games. \n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ok so this is by far my new favorite souls like all the way from the anime inspired art to how satisfying combat feels has left me wanting more. More story I mean the game ended on a Freking cliffhanger.\n\n The boss battles are peek and I cant wait for more epic bosses if this game gets a sequel or a dlc.\nCombat is  very responsive: movement, blocking, parrying, dogging are Tite. \n\nThe weapons fell heavy and satisfying especially when you have crafted any build you want and it comes together and all the combos land with that anime vibe Im not playing im watching my Favorite anime show in real time.\n\nThe game takes a lot of inspiration from nio so if you have played nio you will fell right at home.\n\nMy only grievance with this masterpiece is a lack of weapon variations meaning you have 3 weapon options : dual weald , great sword and spear ,i would have and am still hoping  to see the game add more weapon options like fists , katana , Glave, all with there custom skill tree and so on. But to all souls game fans this is a masterpiece hope you enjoy it as much as I have.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game's combat and presentation alone makes it one of my favourites to play, definitely one of the best souls-likes I've played next to Lies of P. Combat feels very satisfying and can remind you of a mix of Nioh's attack combos and Sekiro's parrying. While technically you can parry through the entire game, brink dodges are very good as well and I believe that the game will naturally teach you to weave in both parries and dodges.\n\nI'm also usually very picky with souls-like games having a parry/deflecting system in their combat thinking its probably not going to be as good as Sekiro's but Khazan does it flawlessly. \nThe sound design, risk and reward, satisfaction, and enemies having good visual tells for attacks, all of these tick the boxes for me.\n\nOne of the weaker points of the game for me were the levels themselves and sidequests. Considering that the sidequests just reuse a section of a level you had previously played, the sidequests felt like an excuse to have you replay a level just to reach the recommended level for the next story mission. The levels themselves are also quite linear but I personally don't find that much of an issue.\nThe game clearly focuses more on the in-depth combat system more than anything, which also means getting into combat is mad fun and boss fights are the absolute peak of the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game with great characters, cinematics, and combat that feels almost as euphoric as Sekiro. The art style of the game is also amazing with its anime-like visuals. Highly recommend playing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game took me by surprise - demo pushed me away so much, that I actually felt like this was another meh game.\nCame back to it after some time to test it and fell completely in love - simply put this is Nioh + Darksiders.\n\nSo many beautiful weapons. Combat is very good, with some nice combos to it.\n\nGraphics are crisp and with a solid style.\n\nPerformance is good as well - hitting constant 90FPS (locked myself) with High/Med settings. Works on Steam Deck surpisingly well!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Listen, Imma be real, this game ain't the ABSOLUTE best is it a great game? Kinda.\r\nThe game starts off pretty strong, but half way thru it becomes a bit of a slog because this game has side missions, side missions are copy and pasted with reused enemies, literally the biggest problem enemy variety. Bosses tho? They are actually great in the sense of presentation, they PRESENT THEM VERY WELL, their fights? Hit or miss depending on the weapon you use (I used a greatsword all game, cause I like big swords), I cannot tell you anything about the other weapons since I haven't and will not try them, so in that regard I am sorry. \r\nGame is not long, I've seen people say it took them 35-50 hours to complete? As you can see I did it in 30? Idk if im a god gamer or not but hey not long.\r\nGame is decent tho! Would recommend! But get it at a sale or from other sites if they have better deals, all in all 7, no 8/10 because the presentation was good for the game!\r\nOh yeah, story, literally Berserk (don't know what that is google it, or find a brief summary for it), idk if the story is boring or I just didn't care but it didn't get me that much? Maybe it's cause the side stories fucked the pacing? Either way story is very straight up! 8/10, give it a try from a sale!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "love it so much and got 100% achievement, and i got disappointed to know that i can only play 3 times in the same load hope they will make it without limit. overall the game 10 out of 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Damn... i wasn't expecting this game to be this good.\n\nThe combat system is probably my favourite in all souls game, even with only 3 playable weapons the game offers lot of different builds/replayability thanks to the skill tree.\nThe story is pretty simple and is nothing too original or special, but it's a good enough story to be enjoyed (true ending is peak).\nVoice acting is top notch in both english and japanese, same thing with sound effects that makes the game much more immersive.\nThat said i recommend the game to everyone.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Be aggressive! Be a berserker!\r\n\r\nThis hack and slash combines the best of the souls-like genre with incredible style and visuals. It's design is brilliant and combat is satisfying to perform and to see. Parries have the perfect *CLANG!* and there's such a diverse move set for each of the weapons that it feels fantastic. \r\n\r\nHighly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "khazan is so good as hack and slash with souls-like's heaviness. combat and boss fights are so so good. artstyle and music are good as well. skill tree and weapons are good enough. I loved spear and perfect dodge. I cannot review negative cause the rest is almost perfect so devs, if you're seeing this please be careful about the enemy variety and map design in your next game. sometimes it's boring as hell with spiders, undeads and minibosses. I loved sen's fortress for example. I know khazan is not dark souls but khazan includes discovery up to a point. map design is mediocre even compared to non-discovery games tho. khazan is substance. people are missing this. this is the best after lies of p and maybe could compete and win with some upgrades. we'll just wait until you fix this. I've finished and platinumed it in two weeks after release. please listen to me. I bought it when 60 dollars but you've changed it to 35 dollars in my country. thanks for this btw",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The only downside of this game is that it didn't come from a popular company. If it was the case, my bet would be that we would have definitely seen it as a GOTY nominee.\n\nOne of the best souls games out there. It's just more polished and smoother version of previous souls games. It's taken the best parts from many different games and combined in one place + added more from itself. Hands down the best telegraphed game, this goes for everything in the game, from start to end, not just bosses, but regular NPCs as well. Every main boss fight is a pure cinema.\n\nI also wanted to add, parry enjoyers will love this game and we all know how rare are those. But game is not just parrying of course, it offers both parry and dodge and MORE (don't want to spoil anything).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game! Character is responsive, skill move sets kick ass. The zones are good enough, music is good and the story is decent. What sets this game apart for me is the fact that check points (bonfires) are always close to boss arenas. When you die your Lacrima (souls) spawn outside of the boss arena, never really at risk. If you need to level up you gain XP and Lacrima while learning the boss. I prefer this in lieu of running around farming mobs. Additionally, you can farm Revenants of Adversity at will. These offer a plethora of drops that can potentially improve your equipment. You can teleport to any checkpoint and re-farm any revenant of adversity or boss at anytime. Love it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best Soulslike game.\n\nAs a huge fan of the Souls series, Elden Ring, and Sekiro, I was immediately drawn to First Berserker: Khazan. What hooked me from the start was its combat system, which, while not a traditional Soulslike, delivers a refreshing twist on the genre.\n\nThe combat is more dynamic and combo-oriented, yet it still keeps the familiar stamina management that punishes reckless button-mashing. Parrying and dodging feel incredibly satisfying. As a Sekiro veteran, I naturally gravitated toward parrying, but the game allows you to rely entirely on dodging if you prefer. That freedom to shape your own approach is one of my favorite things about it.\n\nThe boss fights are a real highlight. They’re challenging, especially on Expert, but always fair. Like any good Soulslike, success comes from learning patterns and adjusting your playstyle, sometimes going full offense, other times taking a more cautious approach. I didn't encounter a single \"bad\" boss; all were solid, and a few were genuinely outstanding.\n\nThe soundtrack is excellent, especially during certain boss encounters where the music perfectly enhances the tension and atmosphere.\n\nAs for the story, I was a bit skeptical at first, but the more I progressed, the more curious I became. It’s not the deepest narrative I’ve experienced, but it’s engaging enough to keep you invested.\n\nMy main criticism is the level design. It can feel repetitive and lacking in variety, sometimes making the environments look a bit dull. It doesn’t ruin the experience, but it’s definitely the weakest aspect of the game.\n\nOverall, I’d place Khazan just below Lies of P in my personal ranking. For me, and many others, Lies of P is the best modern Soulslike thanks to its story, combat, music, level design, and art direction. Khazan isn’t far behind, though.\n\nIf you're a Soulslike fan, I highly recommend starting on Expert difficulty, which clearly feels like the intended experience. You’ll get frustrated, you'll have fun, but you’ll definitely feel accomplished.\nIf you're more of a casual player, Normal or even Easy will still let you enjoy the game without the steep learning curve.\n\nHope you find this helpful!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got this game after the difficulty rework, I haven't had the same problems as the early adopters. This game feels great. I can do the perfect parries in this game and I usually have relative difficulty with them in other games like Lies of P and Elden Ring. Upon completing a \"spear\" run, I immediately started a \"greatsword\" run. Saving the Dual Wield for the final Hard core... maybe. It has some boss rush modes that unlock upon completion and has New Game +. 2 thumbs up",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoyed playing this game. You can expect from Khazan the classic gameplay mechanics of a souls-like game. I think the art is really cool, and the story, though it's not particularly original, suits the main character perfectly. Besides, I always find more interesting a main character with his own background, rather than the nameless characters of typical souls-like games.\r\n\r\nOne thing that did not convince me is the fact that each piece of equipment comes with a level. It forces you to spend a lot of time after every mission to maintain your inventory. In my case it also made completely useless to upgrade/forge my equipment in the first half of the game, cause your level scales so much more rapidly that it's completely worthless to focus on some specific equipment, you just go with the flow and switch to whatever you found in the last area you visited. Things become much more enjoyable towards the end of the game, when the pace at which your character levels up gets slower, at that point (and also because you already met the majority of the bosses and found their sets) you can really focus on choosing the equipment you prefer. I think the idea of sets is cool, which grant you buffs and skills depending on how many pieces you equip.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "+ Visuals\r\n+ Level design\r\n+ Bosses & intense combat\r\n\r\nGreat and challenging ARPG that follows known formula, with more simplified character progression, strong level design and visuals, and satisfying combat.\r\n\r\nThe story offers quite linear path, divided into main and side missions that you access from the main hub. The revenge plot is straightforward but supported by few good side stories and characters. And if you’ve played FFXVI, you’ll definitely find Khazan's voice familiar.\r\n\r\nCombat feels good and offers a handful of builds tied to each of the three weapon types. Progression is focused on the main character and includes familiar elements like crafting, upgrading equipment, and unlocking new abilities.\r\n\r\nWhat stands out for me are strong visuals using cel-shaded technology and level design. \r\nIt doesnt have confusing layouts and game gradually introduces bigger maps where shortcuts are well-placed, and each zone has a distinct dark atmosphere with beautiful castles, temples and fortresses.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Was gifted the game from a friend.\nI had seen the game and thought it looked good.\nThen I played it.\nIt's great. It's hard. It makes you think.\nI got frustrated. I put the controller down. I picked it up. I put it down harder. I picked it up.\nSome of the later fights had a lot of cursing to the ceiling.\nBut getting to the end [spoiler]as the First Berserker[/spoiler] was an amazing journey.\nIf you like Soulslikes, if you like a challenge, if you're into learning and self-punishment.\nPlay it, you'll love it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Khazan hit hard, boss fight good, make heart boom-boom. Story small, but smash and dodge feel real strong — UGH, good game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A game that souls-likes should seek to look as a rubric for what makes a good souls-like. Takes good parts from other titles and mixes them into its own unique game. Highly recommend. One of the only games I have done multiple playthroughs of (other playthrough was on a different console).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely fantastic Game! It is a mix of action/hack n slash and souls-like.\r\n\r\nBest combat system and Boss roster I've ever experienced. Great player expression and replay value.\r\nThe story and setting are interesting and the music is also really good and makes some of the fights feel very epic.\r\nExploration is rather simple and linear but that is not really a bad thing, makes it easy to run through and collect all important items on consecutive playthroughs. The mission structure of the game also makes it possible to replay every encounter as much as you like.\r\n\r\nIf you like deep combat mechanics, you have to try this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very thrilling game that has a lot of depth to it's combat system. It is alot more difficult than Dark souls and I think its safe to say its a mix of DarkSiders, DarkSouls, and Sekiro. One of the few games that I recommend at full price. I will say if you are not good at difficult games or are tired of the Souls formula, stay away from this one. It is not for you.\n\nOverall a super solid 8.5/10. \nGreat Gameplay\nCompelling Story\nInteresting Enemies \nBoss Fights\nVisuals and Graphics\nRuns very well on High settings for me(3060)\nQoL(like respecs) is done well\nSUPER satisfying combos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good game, rich story, good upgrade system, and well-executed combat . If you like this type, you'll definitely play it 2–3 times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play it on it's highest difficulty to enjoy the way the game was intended to be played. The gameplay is tense, satisfying and rewards skill based gameplay by having good timing/dodging/perfect blocking. The visuals are stunning and the sound design is exceptional. A must play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great souls like game with a borderlands art theme. Combat is amazing and I definitely recommend this game. For those who love exploring and fighting sick bosses, this game is for you. Also, the combat feels like an anime game, which is peak!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First i still have a lot to explore in this game but for the short amount of time I've played this game, has been a blast i enjoy the music and the game itself looks very nice. controls took a sec to get used to but most souls like games start of like that, sincerely recommend giving this game a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with a great story! The combat mechanics are nice and it's been a lot more enjoyable with all of the updates that have happened since the release date!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the best souls-likes available. If you don't like the genre, this probably won't win you over. But if you do, it's right there with Lies of P and Nioh 2 - FromSoft quality. \r\n\r\nCombat is top tier, possible my favorite of any souls or souls-like and has lots of build variety due to skills and gear sets despite only 3 weapons in the game. The game also has some of the best boss fights in the entire genre. \r\n\r\nProgression is a lot like Nioh's mission based system. Level design is solid with a mix of short and expansive levels, but lacks the interconnected world you'll find in Lies of P or Dark Souls. \r\n\r\nThe loot is similar to Nioh as well, but it's much more streamlined and user friendly with easy to understand stats and set bonuses. It has an excellent crafting/upgrade system that requires minimal (if any) grinding. It's easy to respec and change build/playstyle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable game. Very much reminds me of a Nioh title. I understand what people mean about the enviroment and enemies not having variety but I didn't find it mattered all that much while I was playing through the game. 8.5/10 overall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Makes me feel like a mix of old ps2 hack n' slash games and souls games. The combat is really fun and responsive. The difficulty is great and can be adjusted to your preference. The art style is great. Overall, a very solid gaming experience with some memorable bosses!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really cool souls like with surprisingly fast and fun combos, and the cell shading is really pretty",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I usually don't write reviews but i just have to for this one. \nThe gameplay is like that of a souls-like but a lot more digestible for players who suck at souls like games (me). The combat is overall pretty good, it has a few janky mechanics but it's not too frustrating, the leveling takes forever, the skills are locked to one weapon so if you feel like changing weapon types you have to reset the skill tree and it can be difficult to figure out what skills you want for your build. \nThere are only 3 weapon types and they are pretty balanced but it becomes a bit repetitive after a while, the weapons themselves have several attributes which kind of helps it feel a bit deeper than it actually is, and the weapons also have transmogs that you can use to make it less dull. The weight, stamina and damage system is pretty simple but also rather versatile which makes it fun to try and make builds that cater to your playstyle however the phantoms kind of ruin it for me, it's very easy to just make a build and then be stuck with it just because the phantoms take so long to level up and their traits are incredibly strong.\n\nThe design is beautiful, it uses lighting and contrast to make the artwork pop and the artwork itself isn't bland or overly colorful which you usually see in other \"anime\" style games. The maps are fantastically designed in my opinion it has a lot of world building hidden in the designs themselves, but the lore is not that deep and the side characters mostly feel like cardboard, if they had spent more time creating more dialogue options i think the story would feel more impactful, which is sad because this game is pretty great.\n\nFor me this is a solid 8/10 IF sold for less than €60, even with my criticisms the game feels so good to play that you can overlook a lot of it, it would be a higher score if the side characters were more lively or you could somehow interact with the world a bit more, but if you are on the fence about buying this game id say, go for it. You'll get at least 20-30h from it if you don't try and rush things to fast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so fucking fun it's not even funny.  The combat is so satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game games combat is amazing. It reminds me of Nioh 2, parries feel good, and the skill tree keeps things interesting throughout all the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game I've been playing for three days straight, but it's very punishing. I get pissed off very easily if the character doesn't do what I want him to do. The attack animation has to be finished,for him to block; you either block or you attack, there's no in between...\r\n\r\nSo, I couldn't get used to this system since this is my first Dark Souls-like game. I played the DMC series and third-person hack and slash series a lot, but I don't have the patience for either the attack or block mechanics in these games. It pisses me off so fast, so I took a break. It's a great game, but I guess not for me, haha.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Khazan is a fun and fast paced game where everything hits hard, including you. A great souls-like that will make you throw your controller through a wall and put a hole in your monitor with the best of them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great combat, good pacing, runs well, good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The First Berserker: Khazan is just the kind of game for your weekend getaway; it makes sure you're busy fighting the same boss for hours, listening to an amazing soundtrack, and enjoying the game's unique visual style and atmosphere. I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Khazan is a tough but fun action game with smooth combat and exciting boss fights. The controls are easy to learn, and every battle feels rewarding once you get the hang of it. If you like challenging games and don't mind dying a few times, Khazan is a great choice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLDR; BIG SWORD, MAD GUY, SMASH. YES. 7,5/10 Enjoyable experience. \n\nI rarely write reviews, but this game gave so many different feelings I just have to put it somewhere, might as well here. I think that TFB: Khazan is really solid game with a lot of virtues, but also has some flaws, unfortunately some quite unforgiving. Kind of feels like there was a lot of diffrent \"borrowed\" ideas from multiple games...\n\nI would like to split it all into three sections, things I realy like (PROS), things I realy don't like(CONS) and things that I do not really know how to feel about(IDK).\n\nPROS:\n+ Combat - like holyyy this feels really satisfying. The animations all flawless, combos are fluent, attacks have appropriate weight to them (greatsword hell yeaa). Skill tree points actually change a lot, unlocking new powerful attacks is rewarding. This is the biggest asset of the game and this is what makes you keep going. Counters feel great, there are different types of it, dodges too. Skills hit really hard, like really hard. SEXY.\n+ BERSERKER!!! - Khazan is a badass, his armor is badass, weapon is badass, he is shredded, has a badass voice acting (japanese version) and he is pissed off. Perfect berskerer. I love the character and big ass swords. Feels good to help him get his revenge.\n+ Boss encounters - this is what \"souls-likes\" are all about, the fights are pleasant, bosses differ a lot, have some cool mechanics and designs. Some of them have some enjoyable backstories too. No spoiler this is just some cool shit you gotta kill.\n+ Equipment - different weapon and armor looks awesome and the perks that they provide are really meaningful\n+ Visuals - the game looks absolutely gorgeous and runs really smoothly. (4070ti)\n+ SFX - sounds are crisp and well balanced. Truly enriching the combat, helps out with counterattacks for boss patterns, directional sound helps with collectibles.\n\n\nCONS:\n- Level design - This is the worst part of the game, already mentioned by many players. I have to agree. The levels even though created with beautiful assets, fell really repetetive, the way the world is designed does not really feel like actual world. The main \"base\" is too big, a lot of unnecessary running and confusion. Not a single location feels memorable (outside boss encounters). If you visited one basement and one cave, you have seen it all, it will just be the same everywhere. There are some small exceptions with somewhat nice view's but that is it unfortunatelly. Enemies outside bosses are well designed, but it does not change the fact that you are killing the same mobs in (what fells like) the same corridors, over and over and that gets me to the next point.\n- Length of the game/content - The game is just too long for what it has to offer. The combat is amazing sure, but in the half of the game you literally know all it has to offer, besides some late game armor set skills. I was really excited at the begining of the game, but then the longer I played, it was really just going through some boring parts to get to another cool boss. Same corridors, same mobs, same \"traps\", meaningless loot.\n- Crafting & looting - even though armors & weapon you will get is really great, the way the game is serving it to you seems lacking. You find a lot of different equipment parts through out the game, but what realy only matters are scrolls (blueprints) for the sets so you can collect it and then craft it. Unfortunetly, crafting is boring, there no super rare materials, just materials you get from farming over and over the same boss (or buying from one of the vendors). There is no resources managment pretty much. The level of the equipment makes some shitty whites better then your super legendary equipment in no time. The only thing that stands out are cool perks from sets. \n\n\nIDK:\n? Weapon variety - Three weapon types is not a lot, but I think it is better to have obli three, but really good, than 10 shitty ones I guess. Just wish it was the same attitude in all aspects. \n? One weapon at the time - You can only have one weapon at the time because you need all the perks, this is how the game was designed, I am not sure how could that be enchanced.\n? Story & characters - The story is simple, there is nothing mind blowing really, but looks like a good background for all the slashing & smashing. Characters are somewhat unique, it is just that there is not enough story and interaction showed in the game to really care about what is happening. I wish there was a little bit more of an introduction to the story, little more relationship building between the characters, I want to know more just so all that fighting actually feel more personal.\n? No item requirements - It is cool you can wear everything you have in your inventory, but it does kind of kill the purpose of stats, there is just some small changes between how much damage you deal,how much damage you can take and how long will it take to make you stop swining/blocking.\n? Difficulty - I find normal mode too easy, most of the bosses were I first tried and it just kind of sad, because I wanted to work a little harder, then I changed the difficulty to expert and from being really tanky and dealing crazy damage now I did no damage and was being one shotted by almost everything. It is really personal, but I wish there was some \"middleground\".\n\n\nAll in all, fun game, hopefully there will be sequel that enchances the game, because it really has some great potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Femal Khazan makes it hard to play the game with one hand.\nPretty good game otherwise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid combat soulslike with a decent story. Levels are very linear and no open world map, but instead you get a fully fleshed out combat system with enough depth for multiple builds on each of the three very different weapons. Solid game all around.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sure, very difficult game though. So many complex mechanics, and fights are insanely grindy.\r\nIf you know what you are doing though, it looks smooth, and fights can be over quite quickly.\r\n\r\nI just don’t have the time/patience for this. It needs to be more fun for me to want to do that; this just seems a bit excessively hard. Even on the easier difficulties it takes a bit of an effort, more than I’m willing to give.\r\n\r\nDon’t get me wrong though. This is a great game, and I love that they have a lot of difficulty options. Cation though, no part of this game is ever a cake walk =)\r\n\r\nI’m out! But best of luck to you =)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i played this game without knowing how good was it i like every battle combat system but didn't like parry one but overall it very good also trying to complete all achievement",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game not being up for ANY Game Awards is a travesty. I was hoping to vote for it in Best Action Game, because it simply is that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best souls-like I've ever played, great art design and combat mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to think Sekiro has the best combat, but Khazan has changed my mind. Out of all the Souls games I’ve played, it is definitely the best in combat. This is not a traditional dance of attack, dodge/block/parry, and heal. Its engaging combat has a lot of depth in both its offensive (actual skill combos) and defensive (Brink Dodge/Brink Guard/Reflection/Counterattack) mechanics. Add the fact that you can min-max your gear rolls for different weapons/playstyles (Dual Wield/Greatsword/Spear), making it a wet fever dream.  \r\n\r\nThe difficulty of this game is brutally punishing due to the bosses' relentless aggression when combined with the usual stamina system. There’s a common misconception of the game’s “artificial difficulty” in the form of bosses being big HP sponges. You need to be doing combos to actually do damage to bosses. With optimized gear, you can melt bosses, especially when played correctly. This is a game that rewards players who make meaningful decisions in both micro and macro aspects of the game. Not only is it fulfilling when you overcome that difficult boss who’s been kicking your ass for a while now, but you feel like a badass.   \r\n\r\nWhile the game’s story and level design are its weaknesses, its amazing combat makes up for it, along with its absolute cinema bosses. Khazan’s boss roster, especially the mage-types, is a treat visually and in combat mechanics. If you are an action combat and difficulty enjoyer, I highly recommend Khazan, as it has a satisfying combat system that I think all future action combat games should strive for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, more similar to Nioh(1 and 2) than dark souls, which IMO is a good thing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "...And the \"most satisfying combat\" award goes to:\n\n\nSeriously though, this game's bosses are better than any drug. I can't wait to see what the studio cooks up next!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100% recommend it to play  great soul game \ngreat art \nnice story \nthe gameplay run smoothly making you love playing in this world and combat so fun will make you dont stop playing\n\n9/10 great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best bosses in any soulslike by far, the combat is incredibly fun, parrying feels extremely satfisying, the combat arts are done well and the amount of polish given to boss fights is exceptional.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really great game. I really liked the visuals and the gameplay. Few weapon options but each bring a different gameplay with the help of the skill system that exapnd each move sets",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had a great time playing through this game. Great combat and fun bosses, so if you're looking for a souls-like that feels somewhat fresh, then this is a good option for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The First Berserker Khazan is a game that doesn't pull any punches. From the moment you start, you'll face a steep challenge with low stamina and weak stats, making early bosses feel nearly impossible. However, the game’s unique mechanic of awarding XP even for failed attempts provides a sense of progress, easing the frustration. This makes the difficulty feel fair, though it may not sit well with hardcore players seeking a more traditional experience.\r\n\r\nOne of the game’s biggest strengths is its flexibility. The ability to respec your attributes and skills means you can try different weapons and builds whenever you hit a brick wall. The variety of skills and strategies available keeps combat fresh and engaging. NPCs also play a crucial role, offering opportunities to craft, upgrade, and trade gear, which adds another layer of depth to your character progression.\r\n\r\nVisually, The First Berserker Khazan is great, with a striking art style that complements its immersive atmosphere. The sound design is excellent, with each strike feeling weighty and impactful, especially when delivering a brutal finishing blow after exhausting an enemy. It makes combat feel satisfying and visceral.\r\n\r\nThat said, the game isn’t without flaws. Enemy and map variety can start to feel repetitive as you progress, and while the story is decent, it lacks depth. Some bosses with excessive HP or multi-phase mechanics can feel tedious, prolonging battles unnecessarily.\r\n\r\nDespite these drawbacks, The First Berserker Khazan is a tough but rewarding RPG that rewards perseverance and creativity. It’s a compelling journey, and I’m looking forward to see where the story leads.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like Nioh you will like this game it is very similar in level structure and gear. Big levels that you come back to later with doors now open or closed for side quests.   You don't summon other players for bosses only summon AI bots they do a good enough job of taking a few hits for you in the boss battles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Writing this just as the credits rolled after 100%’ing the game - wow, I was blown away by this one. I went into it with very tempered expectations. Despite having played almost every mainstream soulslike, I find myself not too particularly engaged with the majority of them.\n\nMy main issue with the genre is that most games in it are just “x Fromsoft game but worse and with a superficially novel gimmick.” I won’t get into which ones exactly I feel this way about, it’s easier to say which ones I don’t feel that way about - Nioh 1/2, kind of Lies of P, and that’s it.\n\nBasically, I find the vast majority of games in this genre to not really be worth playing unless you’re just a massive fan of the genre and need more. What exactly is really compelling me to play The Surge or Lords of the Fallen when they’re just… worse than every Souls game?\n\nThis is not Khazan. Khazan is deeply flawed game, with numerous objective issues. The enemy variety is terrible, calling the level design uninspired would be the understatement of the century, the loot system is extremely superficial and in an attempt to ape Nioh it just completely falls flat, most of the soundtrack is very boring despite being serviceable… I could go on and on, but suffice to say, Khazan is not a 10/10. It might not even be a 9/10 or an 8/10, when evaluating the game holistically.\n\nDespite that, I find Khazan to be massively more worth actually playing than many games that are maybe objectively more “polished.” In fact, it’s probably my second favorite non FS soulslike after Nioh 2, and is solidly a tier or two above Lies of P, which is probably my third favorite.\n\nWhat’s special about this game is the combat and boss design. I won’t go too into what exactly makes these special, as I think it’s hard to do it without spoiling anything, but it is truly an incredible achievement. I would say that the boss movesets and visual designs are possibly the best in the genre, including FS games. There are multiple bosses in this game that would have been my favorite boss in any other game, and even the worst bosses aren’t too bad.\n\nThe game is also hard as balls. I played on expert without summoning, and I found it to be the hardest soulslike content out there besides maybe Shadow of the Erdtree. This game is not messing around and it absolutely takes you seriously and expects you to take it seriously as well.\n\nI don’t know. This game has so many issues, and really only a couple of strong points, but man those strong points are just unbelievably incredible. One of my favorite experiences from this year and without a doubt my favorite surprise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is amazing. The parry mechanic and boss fights in this game is peak. Not really much else to say.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the skill tree system is kinda bad, because you unlock the moves that make the game fun little to late, but once you unlock them it becomes peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has the best greatsword moveset in any Soulslike game I have ever played.\nIt's moveset is similar to a Monster Hunter game. If you like Monster Hunter greatsword you will love this. \nIt also has a wide variety of enemies and bosses, from humans to monsters, that does not fight the same.\nThe level design can be better, because it's level design is like Nioh 1 .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommended! Cool anime art style and extremely satisfying combat. I was reluctant to buy it at first, but finally did and have zero regrets. I was instantly hooked once I started playing.\n\nAs an added bonus, it runs on Steam Deck!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played the demo on my SteamDeck for hours on end, it's really a good game, it has a decent story, amazing views but what gets to me the most is the combat.\r\n\r\nThe combat feels like a combination of Sekiro meets Nioh, the parries and comebacks are just sooo satisfying especially when they connect properly.  10/10 \r\n\r\nThe animation art is also very unique and blends with the world of Khazan beautifully.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best action games out there.\nIt costs blood, sweat and tears.. but it's all worth it.\n\nIf you like Lies of P, play this sure !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing souls like game, with more focus on action rather than memorizing mobs and bosses scripts. Beautiful style, good story, stylish animations. Worth mention - variable difficulty, let you play on the pace you want.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "combat is 11/10, story is fine, visuals are amazing, levels are built well. Overall very good, solid game. Brutal but its definitely worth the play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Think more cartoony version of Dark Souls.  The game is as frustrating as it is fun, I put it down for 2 months because of  part I was stuck at.  Deciding to start at the highest difficulty you can for your first run isn't a smart choice but, it has been fun so far.\n\nAt the time of this review I haven't even beat the game yet however, I have 3 total saves going trying different things and definitely not doing the other 2 saves on expert.\n\nOther than being a game to make you want to flip your desk, it is so fun.  Even though it is linear not all things are easy to spot that you need if you want to 100% it.\n\nThrow it on your wishlist and have fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is THE action game of 2025, what a phenomenon game.\r\nAt first the parry focus playstyle combined with a Stamina system turned me off coming from Sekiro, but they balance it really well by making bosses need stamina for their moves too and you have a lot of control on how you can regain those stamina back (with skills, weapon moveset, stat etc...). It gives a good mix of heavy meaningful action from soul games with fast pace, parry gameplay from Sekiro.\r\nThe RPG is fine, not outstanding but not a slob either, you can kinda feel the impact of each level up (not as heavy as the stat in Elden Ring, but it's close).\r\nDon't like the color choice of the game, or the artstyle, but to each their own (personally i feel the artstyle feels cheap, especially when the gameplay is THIS good).\r\nSolid 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only after collecting enough concussions from basing your head against the wall will you finally appreciate this MASTERPIECE. \n\nBy far the most difficult souls-like I've played, certainly more so than ANY Dark Souls games and it's definitely comparable to Elden Ring's difficulty, if not even harder. \n\nBut you know what they say - you catch more flies with dying over and over and over and over and over and over and over again than with winning immediately. \n\nAt least i think... wait what was i talking about?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feeling too easy? Looking for a Dark Souls/Elden Ring/Lies of P experience? Play on Expert mode. Great game, lots of fun, challenging bosses. Normal is way too easy if you're used to Dark Souls--it'll feel like an ARPG. Expert will make the experience challenging, fun, and rewarding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was initially skeptical about this one. Gave it a go regardless and damn does it slap.\n\nThe level design and story isn't anything exciting; the combat and boss fights is where this game shines, and for me personally, that's good enough for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't really say that this is a bad game – it's quite a good one actually, but with some unfun decisions made.\r\n\r\nI'm not sure about the whole elements system (their debuffs in particular). If you get afflicted by one, you're basically forced to stop pressuring the boss, which is very important for some bosses in this game.\r\nThe whole secret to this game is learning how to parry attacks and understanding that enemies are very vulnerable after a parry. Almost all of them allow you to combo them until you exhaust and stun them, which in turn lets you deal even more damage (if you stun them without a parry, that window will be much shorter).\r\n\r\nSome bosses don't allow you to parry them (some mages) and need a different approach. On first glance they might seem pretty unbalanced and unfun, until you figure it out. I still hated it, but in this game you need to adapt to some bosses. If you're unwilling to use consumables (buffs), skills, etc., then you're basically handicapping yourself, and that's on you if you're struggling with something in this game.\r\nAnother game like this is Nioh, where if you use everything available to you, you'll breeze through the bosses without much trouble.\r\n\r\nThe only advice I want to give to people who struggle with the game is to understand that your equipment matters a lot. Some pieces even define your playstyle, which makes a major difference for some encounters. That's why sub-quests are important as well, since you'll get a lot of stuff that will make it easier to progress further. If you have trouble with a specific boss, there's usually a set that can help you if you think you can't defeat the boss with your skill.\r\nOnly once did I decide to farm something, and that was before the Final Boss, because the set I wanted dropped from the previous boss, so I couldn't get it earlier.\r\n\r\n[spoiler]I'm not a fan of bosses with 3 phases in any game. After several tries, the whole fight took me probably around 5 minutes (hard to remember, was quite long ago), but still, 3 whole phases with different attacks is quite taxing and might be unfun for a lot of people, especially if you're unwilling to learn how to properly utilize your kit to basically stunlock the boss for at least 50% of his HP.[/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10\r\namazing game \r\namazing art style\r\namazing gameplay\r\namazing bosses (well its not elden ring tier bosses but still good)\r\n\r\nwould like to have more weapon types thouge 3 is a bit repetitive unfortunately \r\nbut that's the only thing I can complain about.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Music, great bosses",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play this! the boss fights and combat are awsome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent story, great combat, wonderful art style.\nIs good game. Much fun. Big recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I consider myself a Souls-Like-Connoisseur and played almost any game in this genre thats worth playing.\nThis is my personal Top 10:\n\n1. Sekiro\n2. Bloodborne\n3. Demon Souls Remake\n4. Elden Ring\n5. Khazan\n6. Dark Souls 1\n7. Nioh 1 and 2\n8. Dark Souls 3\n9. Lies of P\n10. The Surge 2\n\n\nI think that says a lot... \nIf you those games are your cup of tea, buy Khazan!\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid 9.5/10 for Soul-Like/Nioh-Like RPG.\n\nReally enjoying the action-packed game play, design and contents. \n\nThings I would love to see if there's ever a DLC:\n1. less copy + paste of some bosses\n2. more rare mobs\n3. possibly co-op missions with a friend, and it'll make all the mobs/bosses harder = better loot\n4. survivor towers filled with waves of mob + bosses for loot or set or for achievements",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty good. I think a solid 8/10. The visuals are great and I think it has the best spear moveset implemented in a game like this. The game does seem to struggle with if its a hack and slash or a Soulslike, including some obtuse level design with frustrating elements like Khazan can't figure out how to step over a broken, low hanging fence. But the combat itself is visceral, impactful and almost has a fighting game rhythm to its inputs. There's a ton of loot you can discover, much of which can change your appearance and there's always treasure chests hidden all around the maps that makes exploration really fun. Just a really well put together package that I think was slept on when it released.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "combat is a of of fun and the story is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed game's parry very much as it was tight and precise and it was enjoyable to block bosses attacks. I hope they make a second entry.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent Soulslike. Great Art Style and good mechanics. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Khazan is a game that I resonate with heavily, mainly due to its berserker aesthetic but also due to how heavy yet fluent the game feels. That along with a gripping story and addicting combat, I can easily say that this game was not only my favorite of this year but also one of my favorites of all-time. The expansive skill tree that it has is very fun to work with in terms of making different combos, and the overall leveling system of the game is quite engaging. The story of the game is also pretty hard on the soul I'd say, since even to this day I still think about most of the events that took place. If you're looking for a really good action RPG with great gameplay, an interesting story, and music that'll have you both raging through levels and soaking in the environment? Khazan has no competition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like playing souls game, definitly try this one. Really loved the anime art style, combat mechanics and the boss fights are also great.\nI rate this 8.5/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the overall concept and mechanics to this game, definitely worth the price",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the must fun games i have ever played. rich story mode and side quests. really fun combat mechanics and all that. is fully action packed and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not the most innovative game out there, but it got inspired by great games and everything is well implemented. \nNioh-like/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(Posterior Deltoid, Serratus Anterior, Latissimus Dorsi) \n\nI learned to appreciate manly muscles more and the game is hard enough, fast enough, as well as complex in its combat enough to make you feel that you the player look and attack like a real boss after sucking hard enough where in a single twitch of an enemy locks you in by default due to trauma\n\nThanks for Khazan F I almost became gay with so much muscle in my face",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not even very far in and I can tell this is a gem. Polished Gameplay that scratches even the eluded Sekiro itch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so streamlined combat feels great a joy to play recommend to every gamer that likes these type of games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, very much the perfect blend between Sekiro and Dark Souls. Story is also quite fun, even if it's dark and broody.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I played demo and it was funtastic. and now it's not, just frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The boss fights are fun, a little gimmicky, but still really fun. Everything else kinda stinks though. There is no reason to explore, the item system doesn't feel that great, and they just kinda swarm you with ranged units and trash mobs. Not difficult at all and it is mind numbing. So the boss fights are awesome and rewarding, but not worth the slog that is the levels to get there.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not very good. Enemy scaling is fine but the bosses are just damage sponges, overall just kind of boring to play",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I would recommend this game only if you seek for a mindless challenge and don't care about anything else. Below are some things which I don't like about the game.\r\n\r\nThere are several archetypes of levels in the game such as castle, cave, village etc, and all of them are extremely generic, I think \"generic\" is the best word to describe the game. Everything looks exactly the same and I can't tell a difference between a castle at the beginning vs at the end of the game. If you played any Dark Souls game you'll be able to remember any location by it's screenshot but it's not the case in this game. It's just the same bland greyed-out generic castle/village/cave and there are absolutely no memorable places in the game.\r\n\r\nI don't really like the progression system: you gain like 0.4-0.7 percent in attributes or +3 AR increase which is basically nothing when the weapon AR is 400+\r\nYou complete missions, gain some \"memories\" things and increase the hp/poise damage by 1% at best. Wow what a generosity\r\n\r\nThe game desperately wants to be hard and full of cliches from any souls-like:\r\n- If you see an item somewhere in a room be sure to be ambushed by multiple mobs which appear from nowhere\r\n- If walk on a narrow bridge be sure to get attacked by an enemy who would try to push you off the bridge\r\n- Like a half of glowing red items/chests are traps\r\n- Tons of mobs, especially towards the end of the game\r\n\r\nSometimes I had weird input drops, especially on the heal/use item button when you press it while not in an animation or animation recovery but the character just does nothing.\r\n\r\nAlso I don't really like the difficulty approach in this game. The \"intended\" difficulty is \"expert\" and I have the only question - really? Is this really what the game is intended to be? Bosses have HUGE amount of health and it takes ridiculous amount of time to get them down while they destroy you in 3 hits. You may expect to commit some massive damage when you deplete the poise bar like in Sekiro but no - the damage amount is laughable. Maybe somebody would enjoy such a compelling gameplay but personally for me at some point it became just dull and boring. The weird thing is that if you switch the difficulty mode from \"expert\" to \"normal\" then the game becomes ridiculously easy removing any challenge whatsoever. I have no idea what's happening on the easy mode, maybe bosses are damaging themselves.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Bosses are perfect, spent at least an hour on each of them. Everyone is unique and has a huge skill set. \n\nRegular enemies are a bit of challenge at first, but that’s all. \n\nI was disappointed in level design: there is no level design. Game consists of enumerous amount of separated linear levels. \n\nIf you played dark souls and enjoyed the fact that at some point you can navigate in the game world as if you were at home, then I guess you would be disappointed as well.\n\nAfter the first three of them each level it’s just one hour of running through to finally see the boss. On top of that the game is very long. If it was half that long I wouldn’t get so tired of it at the end.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Don't buy this game. The developer likes to nerf gears/loadouts/skills every few month. Making all past guides useless. This is absurd for a single player title.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really want to enjoy this game but the lack of diversity in weapon choices really turned me off, I was hoping I'd be able to try out weapons like longswords or great axes or even katanas, but just being limited to 3 types while I don't really like either type makes it hard to have fun in the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Oyun cok guzel ona bi lafim yok ama olumsuz vermek zorundayim cunku oyun bireysel beceriye dayali.\r\nBende de o yok.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great visuals, garbage story and uninspired gameplay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the game until the last boss ozma. 3rd phase is not fun at all and feels just like work. To me it does not make sense to introduce an easy mode and then not allowing it when I decide to do that. I would have used that but was not allowed anymore at that point in time. That decision was game braking for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Starts off pretty good but pretty quickly devolves into typical bad souls-like tropes like an abundance of poison, instant death pits, bosses with extremely long attack strings and massive health bars, etc. Really disappointing too since it starts off pretty good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Repeptitive, boring and same enemies over and over again. Game pushes you to loot gring repeat which feels like a job then fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overall I think its a fun game if this is your cup of tea. \n\nhowever for me, too many things are going on that I dont like for me to leave a positive review.\n\n1. I want to play as Female Khazan... why do I have to play 5 hours of the game to unlock her and then I lose access to all cutscenes and story bits. so strange.\n\n2. Why is the default difficulty set to normal? I didnt know about the difficulty change they made, selected normal because thats what I heard others did. come to find out Normal is really just the old easy difficulty, and now im locked out of the difficulty achievement and everything I do feels pointless knowing im playing on baby mode. (yes I know i can change it, but not getting the achievement as a reward for doing it is just debby downing me). I didnt do research first cause previous players I know got the achievement playing on normal... but there was no good way to know \"normal\" changed.\n\n3. I have the weirdest frame drops even using a 7900 xtx beefy set up. Im able to play very taxing games on a very high setting easily, however, in this game im getting wild frame drops (20% drops randomly) even on high settings (not max) which is really strange and annoying.\n\noutside of that its been an okay experience tho.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ":Dear skalpel I wish nothing but the worst for you and your entire bloodline. i have came to a understanding/conclusion that you are the all mighty supreme leader of my dick and balls you own me and i cant do anything about it. your moveset is so unhinged it makes fluster in despair. i hope one day i can overcome your overwhelming stinky gay coffin and pack you up in it.. and maybe inna another life u wasnt a FuckKnuckle Cotten headed ninny muggins....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played demo and it was funtastic. and now it's not, just frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Khazan is a hard game. Its not as hard as dark souls but at the same time its harder than dark souls. Let me explain.\n\nThe bosses are easier than dark souls, they have very generous windows to block or dodge, and usually attacks well telegraphed so devs decided to half damage of weapons and quadruaple boss hp bars to raise difficulty. So every fight boss is 12 minute slogfest with constant spam that preys that you gona fuck up one of 400 parrys/dodges you preform and die because of it. You gona learn every single move, do everything perfectly and still die to boss simply because humans are not made for repeatedly doing same pattern flawlesly in course of 10 minutes or more(average ds fight is quite fast mind you), and monkey funbase of this game gona spam \"GIT GUT GIT GUT\" knowing that there is no way to get better-you already learned every move of boss, but since battle is so long its inevitable that you gona screw up sooner or later, every boss fight is more of test of endurance than skill. It will take on average much less encounters to kill a boss here than in dark souls, but you waste muchh more time on average because of huge hp bars and constant time wasting jumps around arenas.\n\n\"Its not like dark souls, you dont attack once and then go roll back to defend, you should DANCE with bosses\"- is another fat lie of defenders of this mess. Yes you can pull VERY sweet combos and moves, problem is you stamina bar is non existent and bosses LOVE to jump around/spam attacks so you constantly in the dilema are you attacking for 2-3 hits or are you regenerating stamina. So yeah, any effort to combo non staggered/resting boss will result in akward steam loss in the middle of combo string, even if you invest heavy in to stamina.\n\nGame frequently breaks rules in order to punish specific builds , for example, you have heavy stamina drain build that dedicated? Damn whould that be a shame that there be several bosses that REGENERATE STAMINA CONSTANTLY NO MATTER WHAT. Oh you cut all limbs of spider boss and staggered him and preparing to do full combo on his ass? Nevermind he just  gona walk away from arena  WITHOUT STAMINA OR LEGS, only too come back in 2 seconds withh full stamina and all legs regenerated. Oh you are a glass cannon with tons of damage? Too bad, final boss attacks makes all floor is lava and boss is too chonky to die in few seconds that it takes you to die even with op build of yours. Time to respec biatch.\n\nIf you  are a dark souls vet you gona master moveset of any boss on your 3rd or 4th try and then constantly fail and die too some stupid shit, adn when you win you not gona feel like sekiro master swordsman or ds parry expert, you gona feel like you filled excel spreedsheet on time limit, no satisfaction, no great feelings, no realisation of how GUD you GIT, just aknowledgment that endurance test is over.\n\nWhy im talking only about bosses? Because since this game balance is unfun mess, enemies that are not bosses just pop like baloons. Rest of the game is just resource gavering for boss fights. If you want unique enemies and locations that rival some bosses and make you talk about them with your palls-you are in wrong neighborhood. Skyrim caves level of map development and mmorpg style of farm is what awaits you beyoung grey weil of bossrooms.\n\nHonestly it would benefited greatly to the game if they actualy made it boss only, thats how trivial and unimaginative non boss pve is.\n\nOverall its a dark souls clone that does not realise that dark souls is good NOT BECAUSE IT DIFFICULT, BUT BECAUSE ITS FUN.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only reason why I got this game is to try out female Kaz wearing a Ghost Knight set which I later found out that it was a limited time DLC. Will change my review once they bring it back as a normal purchasable DLC which would probably be unlikely since it's Nexon lol.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "כוס אמאמאמאמאמאמאאממאא של המשחק המזדיין הזה בחיים לא חשבתי שישבר משהו חוץ מהמצב המנטלי שלי לצערי איך זה הגיוני שאני צריך להילחם עם בוס שכל מה שיש לי זה חרבות וסנדלים ולו יש נשק אינטרגלקטי בין לאומי אוניברסלי בכל הגלקסיה כוס אמאמאמא שלכם יוצרים אוטיסטים יא בני זונות חולי סרטן אמן תמותו ולא יחוס עליכם אפילו טיפה של רחמים יא חתיכת זונות שרמוטות",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I will not recommend this game for the casual gamer. The bosses are far beyond over tuned, and this game caters to those that have far too much time to focus on nothing more than being a professional gamer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad game and it made me appreciate lies of p more!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Weak and clunky with grab attacks. No thanks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game should have been like darksiders 2, instead of a soulslike.\nstamina mechanic that gets in the way of enjoying this game, the enemies in expert difficulty are spongy, and the reflect mechanic is badly implemented, finally the games optimization is bad, fuck unreal 5.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its a good game for the first few hours then everything is reused and you regret spending your money on it because of how absolutely boring it is, the combat is the only thing making it playable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not what i expected",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too hard to play.  :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "MINUS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dropped",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a souls-like, just a bad copy. Bosses are cookie cutter repeats and often very frustrating. Levels are cookie cutter repeats too. Literally, they just copy the same level and same boss except you go backwards the next time. Or you run through a much smaller section. Over and over. Every level is a repeat and every boss is a repeat. Ran this level before? Yes, five times. Boss? Same.\n\nLevels are more or less all just straight through. There are shortcuts, and a little backtracking, which is incredibly boring when you're running the same straight path back and forth over and over. Then you do it again on the next level, which is just a carbon copy of the last one.\n\nThey tried to copy Dark Souls without understanding what made Dark Souls good.\n\nTedious and pointless.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Where do I begin...? I was really looking forward to this game but alas it is a disappointment, at least in my eyes.\nThe first few hours of the game are enjoyable, however the later levels are complete clusterfluff. All late levels looks the same, a lot of re-used assets, and enemies, etc. What is most annoying is the terrible game design, the further you progress, the more obvious it becomes that they wanted to use all souls like tropes, to annoy and artificially make the game more difficult, which makes this a complete trash. Annoying broken platforming, placing enemies on ledges and teleporting enemies, to one shot you and push you over the ledge, just because...traps that are not marked, just to fuck with you...absolute non sense.\nThe bosses also have a lot to be desired. They look cool, but after a awhile you relealize, they are not difficult, cards are just stacked against you for no good reason than poor design. A lot of bosses(not only bosses), have animations during which they are invincible, a lot of them...you cannot damage them, the attacks just go through them. They can damage you anytime, anywhere, but you can't, why, because...reasons...\nOn technical level this game is a mess - the constant stutter (shader comp) is beyond frustrating. I am running this garbage on 9800X3D and RTX 5090 and the shader comp stutter is beyond belief. First time an effect or attach occurs, stutter, traversal stutter is also a big issue. I lost count how many times I have died because of stutter during attacks. Do not even get me started on the dragon boss, omg, what a joke that it. Hitboxes are beyond broken, 70% of your attacks just miss it. This is the most frustrating experience I've had in a while. The camera is also trash half of the time.\nThere are also bugs, there was an elite enemy who was invincible for absolutely no reason, no matter what I did, it won't take damage. I had to restart the game to kill it, I died probably 5-6 times until I realized that this is a bug. \nOverall the game is more annoying than difficult, it is just full to the brim with head scratching decisions that destroy the whole experience, especially during the second half of the game.\nI cannot recommend this game, not untill of that is fixed and it doesn't look like it will be. Shame.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "The game itself is a very good action game with elements of Souls, Nioh and Sekiro.\n\nI tried to replay it today. Apparently Nexon changed the terms of service and accepting the new terms is required to launch it. I've already paid for the game, agreed to the previous EULA, and obviously can't refund it anymore. \n\nI'm not precious about licensing agreements and such but this is pretty sleazy. Probably the original agreement states they can change the terms but I've never actually seen this done in such an egregious fashion. Hardly distinct from ransomware. Do as I say or I steal your $60. Can't recommend paying for this game. Find an alternative perhaps....",
      "voted_up": false,
      "votes_helpful": 107
    },
    {
      "review": "It is a great game, but it has denuvo\r\nwhy the hell i, a paying customer, must pay with processor heat and lost frames to have this garbage. Will change once removed",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "After about 20 hours i've decided to drop this game.\nDon't get me wrong, it's a solid take on souls-likes with QoL improvements and general difficulty being more accessible, but it lacks something vital.\nIt is simply not fun for me.\nEvery boss i've beaten was dull, from start to wherever i am now, well past the half of the game by the looks of it, and it doesn't get better. There's no thrill in it like in the other similar games. \nNot all, but most of the locations aren't interesting to explore, because there generally isn't much to explore anyway.\nStory feels like it's there just to be there. There's no intrigue in it. It's as generic as it possibly can be.\nThe only real redeeming quality is probably combat. Maybe the game would've been better off as a boss rush only type of deal, without all the drag.\n\nAnyway, 6.5/10. Maybe i'll finish it some day but i highly doubt it. Back on the shelf it goes.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Khazan wants to combine combat aspects from Nioh and Sekiro:\nFrom Nioh: Three different weapon types with own skill trees and a phantom form which is similar to the guardian spirits in Nioh.\nFrom Sekiro: Parry and deflect mechanics.\n\nOverall, this game reminds me a little bit of Darksiders and I wouldn't say that it's a bad game if they weren't those bosses with their HP bars.\n\nYes, bosses have WAY TOO MUCH HP. I don't have any problem fighting a boss over and over again. \n\nIn Elden Ring, it took me over 100 tries to beat Malenia.\nIn Nioh, it took me over 100 tries to beat side mission Tachibana Muneshige.\nIn Sekiro, I died 50+ times against Genichiro Ashina.\n\nYet, I managed to keep up my motivation and beat them because it was still fun. Nothing interrupted the flow of these fights. You knew that the only reason a fight took so long was your own lack of skill which you could improve.\n\nIn The First Berserker: Khazan, I faced the final boss, Ozma. It is the first boss ever in a souls-like game which I dropped voluntarily after about 20 attempts, because it just wasn't worth my time. It's not like he's that difficult to adapt to. It's rather that it takes eons of time to reduce his health to zero due to flying, certain spell animations and other disengage tools - even if you counter or reflect his attacks perfectly and pull out the best combo damage output possible during his stagger phase. By repeating this annoying first phase, you barely get to see his second/third phase and upon death, you have to repeat this shit again. That's not fun at all if there is no way to speed the first phase up with your own skill.\n\nWhat I described is also true for a lot of other bosses like Hismar. Instead of giving those bosses tons of HP, reduce it and increase their damage in exchange to make those fights more fast paced instead.\n\nI don't understand how people can compare this game to Nioh or Sekiro. \nIn Nioh, you have hard boss fights, too, but once you know the move set of your enemy, you can play more aggressively and finish most bosses off in less than one or two minutes.\nIn Sekiro, you can beat the first phase of Genichiro in less than one minute if you put pressure the right way.\n\nThey really wasted a lot of potential since the core idea of Khazan's combat system is not bad at all. Unfortunately, they fucked it up by artificially stretching those boss fights.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The boss fights are fun, a little gimmicky, but still really fun. Everything else kinda stinks though. There is no reason to explore, the item system doesn't feel that great, and they just kinda swarm you with ranged units and trash mobs. Not difficult at all and it is mind numbing. So the boss fights are awesome and rewarding, but not worth the slog that is the levels to get there.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very fun and complex combat, but very unbalanced. Normal mode is very easy and the \"Expert\" mode is bsically a mode for psychos that make an Elden Ring no hit run look like a joke, the normal enemies are ok, but the bosses are literally insanity, seriously,",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'll be quick with this review. The visuals are very anime, which is not in a problem most of the time. The issue I take is the layout and design of these levels is very unbelievable and it feels like there was no attempt at creating an immersive setting. Performance is very stable, with a few hiccups that don't affect combat often, if at all.\n\nThe combat is very fast and fun, outside of boss fights. Enemies encounters are almost always well-balanced, and the speed with which you can combine combos is very satisfying.\n\nBut all that goes by the wayside when you get to boss battles. The damage you do to bosses is absolutely pathetic, so players have to rely on breaking their poise (stamina, in this game). Except that the bosses, especially towards the endgame, are quick to create great distances from the player, allowing them to regenerate their stamina bar (If you don't create builds that utilize Proficiency, the stat that increases enemy stamina damage, as the highest-rated scaling attribute, you're going to be in for a rough time). So boss fights become this slog of trying to learn boss mechanics, while slowing whittling away at their health bar and hoping you're able to break the bosses stamina before they fly or teleport away and spam you with ranged attacks. Boss fights take WAY too long, and I often found myself groaning towards the end of the game whenever I would encounter one. What made matters worse is that, whoever designed these fights, really, REALLY likes status effects, with attacks that can be parried/blocked, but still build up status ailments. It makes already frustrating experiences and makes them infuriating.\n\nThere are boss fights that are exceptions to my gripes, but there are too many that follow the norm of time-consuming, grueling battles of attrition.\n\nComing from an extensive background of playing souls games and souls-likes (Elden Ring, Bloodborne, Dark Souls, Lies of P, etc) I can easily say the boss designs for this game are some of the worst I've encountered in souls games. Instead of feeling a sense of elation after beating these challenging fights, I would feel relief for the fight being over rather than feel the elation that comes from the accomplishment. Which is a real shame, because the mechanics for most, if not all the fights, were very, very well designed. If it weren't for the fact that boss fights are so instrumental to the enjoyment of souls-likes, this game would be one of the best paced and action-heavy in the genre. But as the flow and pacing of the game is designed now, I can't recommend this game to anyone, especially souls game fans.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its mid, but gets old fast, same mobs, repetitive gameplay, all you do is running and sweeping same mobs, till u go to the boss, and many story with voiceless laz-ass dev",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The boss fights are pretty fun, but the rest of the game feels like filler and the combat didn't do it for me with its limited weapon types and abilities.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "horrible design , imagine sekiro with stamina bar , just for the sake of so called difficulty . massive health pool , with boss applying status effects in all fights , because of this \"genius\" design the devs gave difficulty settings , making the game a joke , so in short this game feels bad to play in all difficulties .i am guessing most of the people changed the difficulty to make the bosses a joke. else on expert this is so annoying to play.\nEdit: still everything above holds , and it goes downhill real fast. go with nioh instead of this royal bag of tr@sh. monotonous trash , one one way to solve boss . watch any YT vid only one wat to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At first glance, Khazan looks a lot like Nioh. You've got a mechanically impeccable melee combat foundation featuring your choice of weapons, a heavy emphasis on stamina management and stance breaking, a Soulslike level structure, and an RPG layer that feels simultaneously perfunctory and hilariously over-designed, with an indiscriminate shower of Diablo loot to sift through. At second glance, Khazan looks *exactly* like Nioh, almost feature-for-feature, except kind of less cool in every way.\n\nIt's hard to pinpoint exactly what feels so mediocre about Khazan because, aside from the well-manicured combat fundamentals, mediocrity kind of permeates every aspect of it. To put it shortly, it has very little personality. Visually, it's a very unexciting introduction to the DFO universe, both artistically and technically, featuring a lot of generic fantasy biomes washed in dull palettes and garish color-grading. Khazan himself is a pretty flaccid lead character, and weirdly, going berserk isn't really featured in either story or gameplay. He mostly just seems bored most of the time. The story is a nothingburger to a hilarious degree, but I actually found that part kind of charming. (\"It's Rangkus's twin brother, Brangkus!\") The voice cast, weirdly, is excellent, despite the fact that the script gives them nothing to work with. They're all bought in regardless - my hat's off to all of you. The soundtrack... Look, I don't keep up with AI-generated music, but if operatic orchestral slop is out in the wild, I kind of imagine this is what it would sound like.\n\nSo yeah, Khazan is disinterested in leveraging any aspect of creative direction to establish an identity for itself. But the real problem is that, despite the solid combat mechanics, the levels aren't any fun to play at all. This is primarily because they're trivially easy most of the time. Encounters are an artless mishmash of mostly toothless enemies that demand nothing and teach you nothing, and man, there's so damn many of them. Every level runs about twice as long as it merits, only occasionally seasoned with any bespoke scripting beyond the kickable ladders and one-way door unlocks that have been systematized to the point of feeling completely prosaic. Also, they feature the worst crit path layout I can remember in a game, which somehow manages to make me feel like I'm stoned trying to navigate it despite being almost always completely linear. Like, there's a level where the crit path routes you off the main street, into the first floor of a house, out the back door, around a U-turn, up some stairs, back into the same house, just so you can reach a staircase that only spans the second and third floors, cause the construction crew got bored with that staircase halfway through or something. The complexity of the layout never matches the actual complexity of your routing decisions; it's just convolution for convolution's sake. I'm not exaggerating when I say that navigating these mostly linear levels is, somehow, the most challenging thing you do in any Khazan level before you reach the boss fight.\n\nIn short, these levels really suck. And they're long, too. This pattern is established early and doesn't really change, leaving you feeling constantly blueballed waiting to get to the bosses, which are.... far and away the best thing about the game, actually! Now at this point, I've played so many Soulslikes that the quirks of their combat have a tendency to irritate me. Gone are the days when I can I die while trying to drink from a full stash of flasks (sorry, \"Netherworld Energy\") without getting at least a little grumpy. But even allowing for that, the boss fights here pretty consistently entertain, even when they're being annoying. There are 17 in total, and only two or three of them were duds. Even though they're pretty visually plain compared to what Fromsoft can do these days, the level of care put into tuning every attack is evident. The final boss, in particular, gets nearly perfect marks. I do think they're tuned too stiff overall, especially considering the low difficulty of the rest of the game. None of them do anything unfair, but I'd have enjoyed the journey more if only *some* of them took an hour-plus of committed attempts, instead of nearly all of them.\n\nOn that note - the difficulty settings in general are wacky. I started on Normal and found the game pointlessly easy, eventually discovering this was a postgame patch and that Hard was the original normal difficulty. So I switched to Hard and started over after a few stages. On Hard, the game is still pretty easy, except for the routine skullfucking you get from bosses. There isn't really a happy medium to be found here and it kind of sucks.\n\nThe other thing breaking up the monotony of the levels is your intermittent engagement with the game's RPG systems. For better or worse, Khazan has just copied Nioh's loot system whole cloth, warts and all. Sets are still kind of fun to collect, because the set bonuses actually do something. Parameters on the non-set items still feel like the devs trolling you (i.e \"-4.2% guard stamina damage while in critical health\"). Trying to actually engage in earnest with all the information the game throws at you will still give you brain damage. It's just as well you don't, because almost none of it actually matters. In practice, you pick which set bonuses you want, get them to a semi-decent level, and ignore everything else. Farming a specific set is now a little less painful, since you can restart a mission from the boss checkpoint as often as you want. The game isn't stingy at all about crafting set pieces either, once you find the recipe. I'm pretty unimpressed at the lack of initiative to iterate more meaningfully and improve on Nioh's obvious flaws in this area, but the gear does its basic job.\n\nAnd the skill tree... Well, Khazan has one of *those* skill trees. You've seen them before. You know, where you think something like \"My biggest problem seems to be stamina management,\" and then you take all of the skills related to stamina, and then your biggest problem is still stamina management. Every skill is parameterized with conditional clauses  that imply build specificity (i.e. \"Gain a small amount of Spirit after breaking an enemy's stance\") But ultimately, they're all templated to be generically, marginally useful; the boundaries you get to play inside here are tiny. None of them will significantly change the gamefeel or the way you play. The only real decision to make here is which Spirit skills (resource-gated special abilities on an arts palette) you take, and you will eventually be able to get all of them. In short, it's like most mediocre skill trees, inoffensive and kinda pointless.\n\nI don't really know how to rate Khazan as a strict yes/no. Objectively speaking, it's not a bad game, even occasionally great, but I also kinda wish I had spent my time playing something else. I guess I'd put it like this: Khazan has no aspirations beyond being a Decent Soulslike for People Who Are Obsessed With Soulslikes. If that's you, then you'll probably have a good time playing it, and also, you have probably already bought it. If it's not you... Well, you've probably got better games to play than Khazan.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Honestly.. Its a fun game but the bosses have too much HP. You hit like a wet noodle.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played until the weird mutated dog boss and dropping it, would give the game a mixed review leaning on not recommended so my review isn't just buried by other positive reviews.\n\nI'll echo what other reviewers have said, the game has phenomenal combat and boss fights but everything else kinda sucks. I wanna focus on the gear/loot system which was honestly atrocious, most loot you pick up is not even worth looking at due to 1) The emphasis on sets, 2) Weapons in the same category having the same moveset. The only time you would change loot is for rings/necklaces (these are also lame, they mostly just give boring passive effects) or you find a weapon/armor set that is more interesting, and even then, its rarely worth switcting until you've looted/crafted the full set. Rarity system is also baffling, there is zero dopamine when looting a higher rarity weapon as the miniscule passive stat buffs don't scale based on rarity, they just give you an extra one per rarity level. Common weapons are basically as powerful as rare ones. \n\nI'm focusing on this because gear/loot is imo often the main factor determining whether exploring is fun or not (in a soulslike where dialogue and lore is sparse). Compare this game to Lies of P. In Lies of P, even for weapons that don't fit your build (eg. dex weapon on str build) you can still dissassemble them to make use of the handle. Or Fromsoft games where even weapons in the same class have slight variations in their moveset/scaling.\n\nStudio has potential so I am hopeful for their next project but this one just has too many boring moments for me to keep playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing for almost 40 hours. I'm reaching Ballerian (no summons, expert difficulty, as you can see on my achievements). I have some things to say:\n\nCONS:\n--------\n- Levels are copy paste same layout-ish, quite lazy?\n- Enemy repetitive as hell, same ol' 2 enemies or 1 elite, 2 archers to spam arrows behind, or 1 elite 3 dogs. Seriously, what is up with this dog shi enemy placement?\n- Reused bosses all over the place. Recycle Khazan\n- STOP WITH THE ARCHERS AND SPIDERS. LIKE SERIOUSLY STOP\n- Every single god damn boss have an elemental that spams you and melts you like crazy, that's just bull crap artificial difficulty\n- Enemy variety is bad, even after almost 40 hours. Yes, you see same reskined enemy doing another elemental spam.\n- Bosses are HP sponges. While I understand it is to engage with the fast and fluid combat, it's becoming a chore where I don't have fun, but roll my eyes instead, let's get over this bullcrap, type shet.\n- Why there is platforming in this god forsaken movement type of game? Like seriously souls like games, stop with the platforming, I ain't playing crash fooken bandicoot.\n- If you don't use your sets/gear and scale them accordingly, you're going to have a bad time. Game is intended to make use of every single thing is throwing at you, that including obnoxious loot. God damn borderlands souls like lmao.\n- I crashed 3 times randomly during boss fights.\n- Stop with the \"haha, got you\" level design where you step on shiet, die, have to come back a loooong way to where you died. Is is not funny, it was never funny, in any souls like game.\n- Delayed attack simulator. You took a nice funny thing from fromSoftware and you applied it to every god damn boss available. I've yet to see a boss who doesn't have a delayed attack. SHOW ME ONE.\n- Mediocre at best game, in terms of souls like and balance.\n\nPROS:\n--------\n- Free skillset respec. So you can try different builds without the worry of having to farm a specific item.\n- Transmog very early in the game, so you can be fancy while keeping your stuff intact.\n- Best combat I have ever seen (apart Sekiro, still the goat), with reflection/deflection and parry, counter attacks, after images etc. It's a very very fast combat, it's amazing.\n- Game runs buttery smooth for an unreal engine game. I've had like 1 stutter all 40 ish ours?\n- Very nice and cool art style, I love it.\n- Good voice acting and some memorable characters.\n- Good boss and elite enemies mini bosses variety. I am not complaining about bosses, but their overtuned bullshiet hp pool.\n\nI love the game, I will 100% it, but don't try it unless you read all my rant review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The best way for me to describe Khazan is \"mid.\"\r\nIt does a lot of things decently, but doesn't really stand out. It's fine, but there are so many games that overshadow Khazan, it's hard to recommend unless you are craving an acceptable nioh-like.\r\n\r\nOf course, the closest game to compare Khazan to is Nioh 2, as the combat is much faster and combo focused using specific weapon types, rather than the more deliberate pace of Souls/Lies of P combat.  Loot is also uses random drops and levels, and everything is mission based. However, while Nioh 2 had over 10 different weapon types, Khazan has only 3, so you better hope you like one of them.\r\n\r\nThe Nioh 2 inspiration goes further in some rather bad ways as well. Enemies are often scratching at the ground for no reason (except to get backstabbed), massive exposition dumps after a boss kills, NPCs who do nothing aside from stand at the start of a mission to say a few lines.\r\nNPCs and the story in general are handled quite poorly. Civilians just stand there quietly weeping, major NPCs have nothing interesting to say, all of them blurring together, often babbling about \"their beloved\" or some other person you'll never meet (alive).\r\nThe most common lines you'll hear are \"Gasp! You too?\" and \"Why?! Aaaaahhh!\" \r\n\r\nThe graphics are, fine. Sadly, the colorful outdoor regions are quickly overshadowed by: ruined town, ruined castle, ruined laboratory, ruined church, ruined mine, ruined theater, etc. Most of them also use the same beige and grey stonework with washed out lighting. The \"ruined\" aspect is so overdone, it can feel like the level designers wanted to leave no hall, no corner without a healthy heaping of rubble.\r\n\r\nCombat is, fine. If you played Nioh, you're most of the way there. Oh, no magic and only one dedicated ranged attack. Still Khazan, moves smoothly and has lots of offensive and defensive options. \r\nUnless there is any kind of height different. In which case Khazan can't jump, can barely attack higher or lower than waist height, and drops like a stone.\r\n(On base difficulty, NG) Game difficulty is generally on the low side. If you've played a decent number of these games, you'll regularly 1-2 shot bosses. If you're new to these games, the game is very gentle, with free skill respecs, easily accessible stat repecs, and generous support for boss fights.\r\n\r\nKhazan isn't a bad game, it's just a decent game in a space with a lot of competition.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its like dark souls if it was made by a couple of money hungry long nose tribe members who didn't care about flushing out the lore or characters or story or enemies or bosses or anything really, its vaguely ok to look at but the combats clunky and way too easy even on the hardest difficulty (not the new game+ one) tons of purchased assets (audio was the primary issue for me) (aka lazy dev work) meh orchestra which is doing it a service and overall just a soulless wannabe Nioh(and the nioh games arent even great so what are we really doing here), not good at any particular thing and generally bad at many things, (too easy, extremely linear level design, horrible equipment mechanics, clunky combat, early 2010s visuals, etc) if they would have just taken an extra year i could see this being a good game but it really just falls short in every category. they TRY to be edgy but it just comes off weird and gross, they TRY to be a Godfall/Nioh type of game but fail miserably (literally one resource to gather; any equipable items)which you can then break down into way way way too op weapons which you can use to slam the next 2-3 bosses without using any thought or skill im writing this a little under halfway through the game and I hope I will find  a reason to change this review. \n\nREAD THE REVIEWS MOST SEEM LIKE BOTS LOL\n\noverall not great, not even good to be honest. 5/10 (and thats being pretty generous just buy mortal shell if you need something to play in-between dark souls releases)\nill finish the game and hopefully come and change my review from negative to positive? (unlikely)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not very good. Enemy scaling is fine but the bosses are just damage sponges, overall just kind of boring to play",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I would recommend this game only if you seek for a mindless challenge and don't care about anything else. Below are some things which I don't like about the game.\r\n\r\nThere are several archetypes of levels in the game such as castle, cave, village etc, and all of them are extremely generic, I think \"generic\" is the best word to describe the game. Everything looks exactly the same and I can't tell a difference between a castle at the beginning vs at the end of the game. If you played any Dark Souls game you'll be able to remember any location by it's screenshot but it's not the case in this game. It's just the same bland greyed-out generic castle/village/cave and there are absolutely no memorable places in the game.\r\n\r\nI don't really like the progression system: you gain like 0.4-0.7 percent in attributes or +3 AR increase which is basically nothing when the weapon AR is 400+\r\nYou complete missions, gain some \"memories\" things and increase the hp/poise damage by 1% at best. Wow what a generosity\r\n\r\nThe game desperately wants to be hard and full of cliches from any souls-like:\r\n- If you see an item somewhere in a room be sure to be ambushed by multiple mobs which appear from nowhere\r\n- If walk on a narrow bridge be sure to get attacked by an enemy who would try to push you off the bridge\r\n- Like a half of glowing red items/chests are traps\r\n- Tons of mobs, especially towards the end of the game\r\n\r\nSometimes I had weird input drops, especially on the heal/use item button when you press it while not in an animation or animation recovery but the character just does nothing.\r\n\r\nAlso I don't really like the difficulty approach in this game. The \"intended\" difficulty is \"expert\" and I have the only question - really? Is this really what the game is intended to be? Bosses have HUGE amount of health and it takes ridiculous amount of time to get them down while they destroy you in 3 hits. You may expect to commit some massive damage when you deplete the poise bar like in Sekiro but no - the damage amount is laughable. Maybe somebody would enjoy such a compelling gameplay but personally for me at some point it became just dull and boring. The weird thing is that if you switch the difficulty mode from \"expert\" to \"normal\" then the game becomes ridiculously easy removing any challenge whatsoever. I have no idea what's happening on the easy mode, maybe bosses are damaging themselves.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Bosses are perfect, spent at least an hour on each of them. Everyone is unique and has a huge skill set. \n\nRegular enemies are a bit of challenge at first, but that’s all. \n\nI was disappointed in level design: there is no level design. Game consists of enumerous amount of separated linear levels. \n\nIf you played dark souls and enjoyed the fact that at some point you can navigate in the game world as if you were at home, then I guess you would be disappointed as well.\n\nAfter the first three of them each level it’s just one hour of running through to finally see the boss. On top of that the game is very long. If it was half that long I wouldn’t get so tired of it at the end.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Don't buy this game. The developer likes to nerf gears/loadouts/skills every few month. Making all past guides useless. This is absurd for a single player title.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really want to enjoy this game but the lack of diversity in weapon choices really turned me off, I was hoping I'd be able to try out weapons like longswords or great axes or even katanas, but just being limited to 3 types while I don't really like either type makes it hard to have fun in the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Oyun cok guzel ona bi lafim yok ama olumsuz vermek zorundayim cunku oyun bireysel beceriye dayali.\r\nBende de o yok.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great visuals, garbage story and uninspired gameplay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the game until the last boss ozma. 3rd phase is not fun at all and feels just like work. To me it does not make sense to introduce an easy mode and then not allowing it when I decide to do that. I would have used that but was not allowed anymore at that point in time. That decision was game braking for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Starts off pretty good but pretty quickly devolves into typical bad souls-like tropes like an abundance of poison, instant death pits, bosses with extremely long attack strings and massive health bars, etc. Really disappointing too since it starts off pretty good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Repeptitive, boring and same enemies over and over again. Game pushes you to loot gring repeat which feels like a job then fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overall I think its a fun game if this is your cup of tea. \n\nhowever for me, too many things are going on that I dont like for me to leave a positive review.\n\n1. I want to play as Female Khazan... why do I have to play 5 hours of the game to unlock her and then I lose access to all cutscenes and story bits. so strange.\n\n2. Why is the default difficulty set to normal? I didnt know about the difficulty change they made, selected normal because thats what I heard others did. come to find out Normal is really just the old easy difficulty, and now im locked out of the difficulty achievement and everything I do feels pointless knowing im playing on baby mode. (yes I know i can change it, but not getting the achievement as a reward for doing it is just debby downing me). I didnt do research first cause previous players I know got the achievement playing on normal... but there was no good way to know \"normal\" changed.\n\n3. I have the weirdest frame drops even using a 7900 xtx beefy set up. Im able to play very taxing games on a very high setting easily, however, in this game im getting wild frame drops (20% drops randomly) even on high settings (not max) which is really strange and annoying.\n\noutside of that its been an okay experience tho.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ":Dear skalpel I wish nothing but the worst for you and your entire bloodline. i have came to a understanding/conclusion that you are the all mighty supreme leader of my dick and balls you own me and i cant do anything about it. your moveset is so unhinged it makes fluster in despair. i hope one day i can overcome your overwhelming stinky gay coffin and pack you up in it.. and maybe inna another life u wasnt a FuckKnuckle Cotten headed ninny muggins....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played demo and it was funtastic. and now it's not, just frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Khazan is a hard game. Its not as hard as dark souls but at the same time its harder than dark souls. Let me explain.\n\nThe bosses are easier than dark souls, they have very generous windows to block or dodge, and usually attacks well telegraphed so devs decided to half damage of weapons and quadruaple boss hp bars to raise difficulty. So every fight boss is 12 minute slogfest with constant spam that preys that you gona fuck up one of 400 parrys/dodges you preform and die because of it. You gona learn every single move, do everything perfectly and still die to boss simply because humans are not made for repeatedly doing same pattern flawlesly in course of 10 minutes or more(average ds fight is quite fast mind you), and monkey funbase of this game gona spam \"GIT GUT GIT GUT\" knowing that there is no way to get better-you already learned every move of boss, but since battle is so long its inevitable that you gona screw up sooner or later, every boss fight is more of test of endurance than skill. It will take on average much less encounters to kill a boss here than in dark souls, but you waste muchh more time on average because of huge hp bars and constant time wasting jumps around arenas.\n\n\"Its not like dark souls, you dont attack once and then go roll back to defend, you should DANCE with bosses\"- is another fat lie of defenders of this mess. Yes you can pull VERY sweet combos and moves, problem is you stamina bar is non existent and bosses LOVE to jump around/spam attacks so you constantly in the dilema are you attacking for 2-3 hits or are you regenerating stamina. So yeah, any effort to combo non staggered/resting boss will result in akward steam loss in the middle of combo string, even if you invest heavy in to stamina.\n\nGame frequently breaks rules in order to punish specific builds , for example, you have heavy stamina drain build that dedicated? Damn whould that be a shame that there be several bosses that REGENERATE STAMINA CONSTANTLY NO MATTER WHAT. Oh you cut all limbs of spider boss and staggered him and preparing to do full combo on his ass? Nevermind he just  gona walk away from arena  WITHOUT STAMINA OR LEGS, only too come back in 2 seconds withh full stamina and all legs regenerated. Oh you are a glass cannon with tons of damage? Too bad, final boss attacks makes all floor is lava and boss is too chonky to die in few seconds that it takes you to die even with op build of yours. Time to respec biatch.\n\nIf you  are a dark souls vet you gona master moveset of any boss on your 3rd or 4th try and then constantly fail and die too some stupid shit, adn when you win you not gona feel like sekiro master swordsman or ds parry expert, you gona feel like you filled excel spreedsheet on time limit, no satisfaction, no great feelings, no realisation of how GUD you GIT, just aknowledgment that endurance test is over.\n\nWhy im talking only about bosses? Because since this game balance is unfun mess, enemies that are not bosses just pop like baloons. Rest of the game is just resource gavering for boss fights. If you want unique enemies and locations that rival some bosses and make you talk about them with your palls-you are in wrong neighborhood. Skyrim caves level of map development and mmorpg style of farm is what awaits you beyoung grey weil of bossrooms.\n\nHonestly it would benefited greatly to the game if they actualy made it boss only, thats how trivial and unimaginative non boss pve is.\n\nOverall its a dark souls clone that does not realise that dark souls is good NOT BECAUSE IT DIFFICULT, BUT BECAUSE ITS FUN.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only reason why I got this game is to try out female Kaz wearing a Ghost Knight set which I later found out that it was a limited time DLC. Will change my review once they bring it back as a normal purchasable DLC which would probably be unlikely since it's Nexon lol.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "כוס אמאמאמאמאמאמאאממאא של המשחק המזדיין הזה בחיים לא חשבתי שישבר משהו חוץ מהמצב המנטלי שלי לצערי איך זה הגיוני שאני צריך להילחם עם בוס שכל מה שיש לי זה חרבות וסנדלים ולו יש נשק אינטרגלקטי בין לאומי אוניברסלי בכל הגלקסיה כוס אמאמאמא שלכם יוצרים אוטיסטים יא בני זונות חולי סרטן אמן תמותו ולא יחוס עליכם אפילו טיפה של רחמים יא חתיכת זונות שרמוטות",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I will not recommend this game for the casual gamer. The bosses are far beyond over tuned, and this game caters to those that have far too much time to focus on nothing more than being a professional gamer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad game and it made me appreciate lies of p more!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Weak and clunky with grab attacks. No thanks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game should have been like darksiders 2, instead of a soulslike.\nstamina mechanic that gets in the way of enjoying this game, the enemies in expert difficulty are spongy, and the reflect mechanic is badly implemented, finally the games optimization is bad, fuck unreal 5.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its a good game for the first few hours then everything is reused and you regret spending your money on it because of how absolutely boring it is, the combat is the only thing making it playable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not what i expected",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too hard to play.  :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "MINUS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dropped",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a souls-like, just a bad copy. Bosses are cookie cutter repeats and often very frustrating. Levels are cookie cutter repeats too. Literally, they just copy the same level and same boss except you go backwards the next time. Or you run through a much smaller section. Over and over. Every level is a repeat and every boss is a repeat. Ran this level before? Yes, five times. Boss? Same.\n\nLevels are more or less all just straight through. There are shortcuts, and a little backtracking, which is incredibly boring when you're running the same straight path back and forth over and over. Then you do it again on the next level, which is just a carbon copy of the last one.\n\nThey tried to copy Dark Souls without understanding what made Dark Souls good.\n\nTedious and pointless.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Where do I begin...? I was really looking forward to this game but alas it is a disappointment, at least in my eyes.\nThe first few hours of the game are enjoyable, however the later levels are complete clusterfluff. All late levels looks the same, a lot of re-used assets, and enemies, etc. What is most annoying is the terrible game design, the further you progress, the more obvious it becomes that they wanted to use all souls like tropes, to annoy and artificially make the game more difficult, which makes this a complete trash. Annoying broken platforming, placing enemies on ledges and teleporting enemies, to one shot you and push you over the ledge, just because...traps that are not marked, just to fuck with you...absolute non sense.\nThe bosses also have a lot to be desired. They look cool, but after a awhile you relealize, they are not difficult, cards are just stacked against you for no good reason than poor design. A lot of bosses(not only bosses), have animations during which they are invincible, a lot of them...you cannot damage them, the attacks just go through them. They can damage you anytime, anywhere, but you can't, why, because...reasons...\nOn technical level this game is a mess - the constant stutter (shader comp) is beyond frustrating. I am running this garbage on 9800X3D and RTX 5090 and the shader comp stutter is beyond belief. First time an effect or attach occurs, stutter, traversal stutter is also a big issue. I lost count how many times I have died because of stutter during attacks. Do not even get me started on the dragon boss, omg, what a joke that it. Hitboxes are beyond broken, 70% of your attacks just miss it. This is the most frustrating experience I've had in a while. The camera is also trash half of the time.\nThere are also bugs, there was an elite enemy who was invincible for absolutely no reason, no matter what I did, it won't take damage. I had to restart the game to kill it, I died probably 5-6 times until I realized that this is a bug. \nOverall the game is more annoying than difficult, it is just full to the brim with head scratching decisions that destroy the whole experience, especially during the second half of the game.\nI cannot recommend this game, not untill of that is fixed and it doesn't look like it will be. Shame.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "The game itself is a very good action game with elements of Souls, Nioh and Sekiro.\n\nI tried to replay it today. Apparently Nexon changed the terms of service and accepting the new terms is required to launch it. I've already paid for the game, agreed to the previous EULA, and obviously can't refund it anymore. \n\nI'm not precious about licensing agreements and such but this is pretty sleazy. Probably the original agreement states they can change the terms but I've never actually seen this done in such an egregious fashion. Hardly distinct from ransomware. Do as I say or I steal your $60. Can't recommend paying for this game. Find an alternative perhaps....",
      "voted_up": false,
      "votes_helpful": 107
    },
    {
      "review": "It is a great game, but it has denuvo\r\nwhy the hell i, a paying customer, must pay with processor heat and lost frames to have this garbage. Will change once removed",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "After about 20 hours i've decided to drop this game.\nDon't get me wrong, it's a solid take on souls-likes with QoL improvements and general difficulty being more accessible, but it lacks something vital.\nIt is simply not fun for me.\nEvery boss i've beaten was dull, from start to wherever i am now, well past the half of the game by the looks of it, and it doesn't get better. There's no thrill in it like in the other similar games. \nNot all, but most of the locations aren't interesting to explore, because there generally isn't much to explore anyway.\nStory feels like it's there just to be there. There's no intrigue in it. It's as generic as it possibly can be.\nThe only real redeeming quality is probably combat. Maybe the game would've been better off as a boss rush only type of deal, without all the drag.\n\nAnyway, 6.5/10. Maybe i'll finish it some day but i highly doubt it. Back on the shelf it goes.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Khazan wants to combine combat aspects from Nioh and Sekiro:\nFrom Nioh: Three different weapon types with own skill trees and a phantom form which is similar to the guardian spirits in Nioh.\nFrom Sekiro: Parry and deflect mechanics.\n\nOverall, this game reminds me a little bit of Darksiders and I wouldn't say that it's a bad game if they weren't those bosses with their HP bars.\n\nYes, bosses have WAY TOO MUCH HP. I don't have any problem fighting a boss over and over again. \n\nIn Elden Ring, it took me over 100 tries to beat Malenia.\nIn Nioh, it took me over 100 tries to beat side mission Tachibana Muneshige.\nIn Sekiro, I died 50+ times against Genichiro Ashina.\n\nYet, I managed to keep up my motivation and beat them because it was still fun. Nothing interrupted the flow of these fights. You knew that the only reason a fight took so long was your own lack of skill which you could improve.\n\nIn The First Berserker: Khazan, I faced the final boss, Ozma. It is the first boss ever in a souls-like game which I dropped voluntarily after about 20 attempts, because it just wasn't worth my time. It's not like he's that difficult to adapt to. It's rather that it takes eons of time to reduce his health to zero due to flying, certain spell animations and other disengage tools - even if you counter or reflect his attacks perfectly and pull out the best combo damage output possible during his stagger phase. By repeating this annoying first phase, you barely get to see his second/third phase and upon death, you have to repeat this shit again. That's not fun at all if there is no way to speed the first phase up with your own skill.\n\nWhat I described is also true for a lot of other bosses like Hismar. Instead of giving those bosses tons of HP, reduce it and increase their damage in exchange to make those fights more fast paced instead.\n\nI don't understand how people can compare this game to Nioh or Sekiro. \nIn Nioh, you have hard boss fights, too, but once you know the move set of your enemy, you can play more aggressively and finish most bosses off in less than one or two minutes.\nIn Sekiro, you can beat the first phase of Genichiro in less than one minute if you put pressure the right way.\n\nThey really wasted a lot of potential since the core idea of Khazan's combat system is not bad at all. Unfortunately, they fucked it up by artificially stretching those boss fights.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The boss fights are fun, a little gimmicky, but still really fun. Everything else kinda stinks though. There is no reason to explore, the item system doesn't feel that great, and they just kinda swarm you with ranged units and trash mobs. Not difficult at all and it is mind numbing. So the boss fights are awesome and rewarding, but not worth the slog that is the levels to get there.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very fun and complex combat, but very unbalanced. Normal mode is very easy and the \"Expert\" mode is bsically a mode for psychos that make an Elden Ring no hit run look like a joke, the normal enemies are ok, but the bosses are literally insanity, seriously,",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'll be quick with this review. The visuals are very anime, which is not in a problem most of the time. The issue I take is the layout and design of these levels is very unbelievable and it feels like there was no attempt at creating an immersive setting. Performance is very stable, with a few hiccups that don't affect combat often, if at all.\n\nThe combat is very fast and fun, outside of boss fights. Enemies encounters are almost always well-balanced, and the speed with which you can combine combos is very satisfying.\n\nBut all that goes by the wayside when you get to boss battles. The damage you do to bosses is absolutely pathetic, so players have to rely on breaking their poise (stamina, in this game). Except that the bosses, especially towards the endgame, are quick to create great distances from the player, allowing them to regenerate their stamina bar (If you don't create builds that utilize Proficiency, the stat that increases enemy stamina damage, as the highest-rated scaling attribute, you're going to be in for a rough time). So boss fights become this slog of trying to learn boss mechanics, while slowing whittling away at their health bar and hoping you're able to break the bosses stamina before they fly or teleport away and spam you with ranged attacks. Boss fights take WAY too long, and I often found myself groaning towards the end of the game whenever I would encounter one. What made matters worse is that, whoever designed these fights, really, REALLY likes status effects, with attacks that can be parried/blocked, but still build up status ailments. It makes already frustrating experiences and makes them infuriating.\n\nThere are boss fights that are exceptions to my gripes, but there are too many that follow the norm of time-consuming, grueling battles of attrition.\n\nComing from an extensive background of playing souls games and souls-likes (Elden Ring, Bloodborne, Dark Souls, Lies of P, etc) I can easily say the boss designs for this game are some of the worst I've encountered in souls games. Instead of feeling a sense of elation after beating these challenging fights, I would feel relief for the fight being over rather than feel the elation that comes from the accomplishment. Which is a real shame, because the mechanics for most, if not all the fights, were very, very well designed. If it weren't for the fact that boss fights are so instrumental to the enjoyment of souls-likes, this game would be one of the best paced and action-heavy in the genre. But as the flow and pacing of the game is designed now, I can't recommend this game to anyone, especially souls game fans.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its mid, but gets old fast, same mobs, repetitive gameplay, all you do is running and sweeping same mobs, till u go to the boss, and many story with voiceless laz-ass dev",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The boss fights are pretty fun, but the rest of the game feels like filler and the combat didn't do it for me with its limited weapon types and abilities.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "horrible design , imagine sekiro with stamina bar , just for the sake of so called difficulty . massive health pool , with boss applying status effects in all fights , because of this \"genius\" design the devs gave difficulty settings , making the game a joke , so in short this game feels bad to play in all difficulties .i am guessing most of the people changed the difficulty to make the bosses a joke. else on expert this is so annoying to play.\nEdit: still everything above holds , and it goes downhill real fast. go with nioh instead of this royal bag of tr@sh. monotonous trash , one one way to solve boss . watch any YT vid only one wat to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At first glance, Khazan looks a lot like Nioh. You've got a mechanically impeccable melee combat foundation featuring your choice of weapons, a heavy emphasis on stamina management and stance breaking, a Soulslike level structure, and an RPG layer that feels simultaneously perfunctory and hilariously over-designed, with an indiscriminate shower of Diablo loot to sift through. At second glance, Khazan looks *exactly* like Nioh, almost feature-for-feature, except kind of less cool in every way.\n\nIt's hard to pinpoint exactly what feels so mediocre about Khazan because, aside from the well-manicured combat fundamentals, mediocrity kind of permeates every aspect of it. To put it shortly, it has very little personality. Visually, it's a very unexciting introduction to the DFO universe, both artistically and technically, featuring a lot of generic fantasy biomes washed in dull palettes and garish color-grading. Khazan himself is a pretty flaccid lead character, and weirdly, going berserk isn't really featured in either story or gameplay. He mostly just seems bored most of the time. The story is a nothingburger to a hilarious degree, but I actually found that part kind of charming. (\"It's Rangkus's twin brother, Brangkus!\") The voice cast, weirdly, is excellent, despite the fact that the script gives them nothing to work with. They're all bought in regardless - my hat's off to all of you. The soundtrack... Look, I don't keep up with AI-generated music, but if operatic orchestral slop is out in the wild, I kind of imagine this is what it would sound like.\n\nSo yeah, Khazan is disinterested in leveraging any aspect of creative direction to establish an identity for itself. But the real problem is that, despite the solid combat mechanics, the levels aren't any fun to play at all. This is primarily because they're trivially easy most of the time. Encounters are an artless mishmash of mostly toothless enemies that demand nothing and teach you nothing, and man, there's so damn many of them. Every level runs about twice as long as it merits, only occasionally seasoned with any bespoke scripting beyond the kickable ladders and one-way door unlocks that have been systematized to the point of feeling completely prosaic. Also, they feature the worst crit path layout I can remember in a game, which somehow manages to make me feel like I'm stoned trying to navigate it despite being almost always completely linear. Like, there's a level where the crit path routes you off the main street, into the first floor of a house, out the back door, around a U-turn, up some stairs, back into the same house, just so you can reach a staircase that only spans the second and third floors, cause the construction crew got bored with that staircase halfway through or something. The complexity of the layout never matches the actual complexity of your routing decisions; it's just convolution for convolution's sake. I'm not exaggerating when I say that navigating these mostly linear levels is, somehow, the most challenging thing you do in any Khazan level before you reach the boss fight.\n\nIn short, these levels really suck. And they're long, too. This pattern is established early and doesn't really change, leaving you feeling constantly blueballed waiting to get to the bosses, which are.... far and away the best thing about the game, actually! Now at this point, I've played so many Soulslikes that the quirks of their combat have a tendency to irritate me. Gone are the days when I can I die while trying to drink from a full stash of flasks (sorry, \"Netherworld Energy\") without getting at least a little grumpy. But even allowing for that, the boss fights here pretty consistently entertain, even when they're being annoying. There are 17 in total, and only two or three of them were duds. Even though they're pretty visually plain compared to what Fromsoft can do these days, the level of care put into tuning every attack is evident. The final boss, in particular, gets nearly perfect marks. I do think they're tuned too stiff overall, especially considering the low difficulty of the rest of the game. None of them do anything unfair, but I'd have enjoyed the journey more if only *some* of them took an hour-plus of committed attempts, instead of nearly all of them.\n\nOn that note - the difficulty settings in general are wacky. I started on Normal and found the game pointlessly easy, eventually discovering this was a postgame patch and that Hard was the original normal difficulty. So I switched to Hard and started over after a few stages. On Hard, the game is still pretty easy, except for the routine skullfucking you get from bosses. There isn't really a happy medium to be found here and it kind of sucks.\n\nThe other thing breaking up the monotony of the levels is your intermittent engagement with the game's RPG systems. For better or worse, Khazan has just copied Nioh's loot system whole cloth, warts and all. Sets are still kind of fun to collect, because the set bonuses actually do something. Parameters on the non-set items still feel like the devs trolling you (i.e \"-4.2% guard stamina damage while in critical health\"). Trying to actually engage in earnest with all the information the game throws at you will still give you brain damage. It's just as well you don't, because almost none of it actually matters. In practice, you pick which set bonuses you want, get them to a semi-decent level, and ignore everything else. Farming a specific set is now a little less painful, since you can restart a mission from the boss checkpoint as often as you want. The game isn't stingy at all about crafting set pieces either, once you find the recipe. I'm pretty unimpressed at the lack of initiative to iterate more meaningfully and improve on Nioh's obvious flaws in this area, but the gear does its basic job.\n\nAnd the skill tree... Well, Khazan has one of *those* skill trees. You've seen them before. You know, where you think something like \"My biggest problem seems to be stamina management,\" and then you take all of the skills related to stamina, and then your biggest problem is still stamina management. Every skill is parameterized with conditional clauses  that imply build specificity (i.e. \"Gain a small amount of Spirit after breaking an enemy's stance\") But ultimately, they're all templated to be generically, marginally useful; the boundaries you get to play inside here are tiny. None of them will significantly change the gamefeel or the way you play. The only real decision to make here is which Spirit skills (resource-gated special abilities on an arts palette) you take, and you will eventually be able to get all of them. In short, it's like most mediocre skill trees, inoffensive and kinda pointless.\n\nI don't really know how to rate Khazan as a strict yes/no. Objectively speaking, it's not a bad game, even occasionally great, but I also kinda wish I had spent my time playing something else. I guess I'd put it like this: Khazan has no aspirations beyond being a Decent Soulslike for People Who Are Obsessed With Soulslikes. If that's you, then you'll probably have a good time playing it, and also, you have probably already bought it. If it's not you... Well, you've probably got better games to play than Khazan.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Honestly.. Its a fun game but the bosses have too much HP. You hit like a wet noodle.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played until the weird mutated dog boss and dropping it, would give the game a mixed review leaning on not recommended so my review isn't just buried by other positive reviews.\n\nI'll echo what other reviewers have said, the game has phenomenal combat and boss fights but everything else kinda sucks. I wanna focus on the gear/loot system which was honestly atrocious, most loot you pick up is not even worth looking at due to 1) The emphasis on sets, 2) Weapons in the same category having the same moveset. The only time you would change loot is for rings/necklaces (these are also lame, they mostly just give boring passive effects) or you find a weapon/armor set that is more interesting, and even then, its rarely worth switcting until you've looted/crafted the full set. Rarity system is also baffling, there is zero dopamine when looting a higher rarity weapon as the miniscule passive stat buffs don't scale based on rarity, they just give you an extra one per rarity level. Common weapons are basically as powerful as rare ones. \n\nI'm focusing on this because gear/loot is imo often the main factor determining whether exploring is fun or not (in a soulslike where dialogue and lore is sparse). Compare this game to Lies of P. In Lies of P, even for weapons that don't fit your build (eg. dex weapon on str build) you can still dissassemble them to make use of the handle. Or Fromsoft games where even weapons in the same class have slight variations in their moveset/scaling.\n\nStudio has potential so I am hopeful for their next project but this one just has too many boring moments for me to keep playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing for almost 40 hours. I'm reaching Ballerian (no summons, expert difficulty, as you can see on my achievements). I have some things to say:\n\nCONS:\n--------\n- Levels are copy paste same layout-ish, quite lazy?\n- Enemy repetitive as hell, same ol' 2 enemies or 1 elite, 2 archers to spam arrows behind, or 1 elite 3 dogs. Seriously, what is up with this dog shi enemy placement?\n- Reused bosses all over the place. Recycle Khazan\n- STOP WITH THE ARCHERS AND SPIDERS. LIKE SERIOUSLY STOP\n- Every single god damn boss have an elemental that spams you and melts you like crazy, that's just bull crap artificial difficulty\n- Enemy variety is bad, even after almost 40 hours. Yes, you see same reskined enemy doing another elemental spam.\n- Bosses are HP sponges. While I understand it is to engage with the fast and fluid combat, it's becoming a chore where I don't have fun, but roll my eyes instead, let's get over this bullcrap, type shet.\n- Why there is platforming in this god forsaken movement type of game? Like seriously souls like games, stop with the platforming, I ain't playing crash fooken bandicoot.\n- If you don't use your sets/gear and scale them accordingly, you're going to have a bad time. Game is intended to make use of every single thing is throwing at you, that including obnoxious loot. God damn borderlands souls like lmao.\n- I crashed 3 times randomly during boss fights.\n- Stop with the \"haha, got you\" level design where you step on shiet, die, have to come back a loooong way to where you died. Is is not funny, it was never funny, in any souls like game.\n- Delayed attack simulator. You took a nice funny thing from fromSoftware and you applied it to every god damn boss available. I've yet to see a boss who doesn't have a delayed attack. SHOW ME ONE.\n- Mediocre at best game, in terms of souls like and balance.\n\nPROS:\n--------\n- Free skillset respec. So you can try different builds without the worry of having to farm a specific item.\n- Transmog very early in the game, so you can be fancy while keeping your stuff intact.\n- Best combat I have ever seen (apart Sekiro, still the goat), with reflection/deflection and parry, counter attacks, after images etc. It's a very very fast combat, it's amazing.\n- Game runs buttery smooth for an unreal engine game. I've had like 1 stutter all 40 ish ours?\n- Very nice and cool art style, I love it.\n- Good voice acting and some memorable characters.\n- Good boss and elite enemies mini bosses variety. I am not complaining about bosses, but their overtuned bullshiet hp pool.\n\nI love the game, I will 100% it, but don't try it unless you read all my rant review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The best way for me to describe Khazan is \"mid.\"\r\nIt does a lot of things decently, but doesn't really stand out. It's fine, but there are so many games that overshadow Khazan, it's hard to recommend unless you are craving an acceptable nioh-like.\r\n\r\nOf course, the closest game to compare Khazan to is Nioh 2, as the combat is much faster and combo focused using specific weapon types, rather than the more deliberate pace of Souls/Lies of P combat.  Loot is also uses random drops and levels, and everything is mission based. However, while Nioh 2 had over 10 different weapon types, Khazan has only 3, so you better hope you like one of them.\r\n\r\nThe Nioh 2 inspiration goes further in some rather bad ways as well. Enemies are often scratching at the ground for no reason (except to get backstabbed), massive exposition dumps after a boss kills, NPCs who do nothing aside from stand at the start of a mission to say a few lines.\r\nNPCs and the story in general are handled quite poorly. Civilians just stand there quietly weeping, major NPCs have nothing interesting to say, all of them blurring together, often babbling about \"their beloved\" or some other person you'll never meet (alive).\r\nThe most common lines you'll hear are \"Gasp! You too?\" and \"Why?! Aaaaahhh!\" \r\n\r\nThe graphics are, fine. Sadly, the colorful outdoor regions are quickly overshadowed by: ruined town, ruined castle, ruined laboratory, ruined church, ruined mine, ruined theater, etc. Most of them also use the same beige and grey stonework with washed out lighting. The \"ruined\" aspect is so overdone, it can feel like the level designers wanted to leave no hall, no corner without a healthy heaping of rubble.\r\n\r\nCombat is, fine. If you played Nioh, you're most of the way there. Oh, no magic and only one dedicated ranged attack. Still Khazan, moves smoothly and has lots of offensive and defensive options. \r\nUnless there is any kind of height different. In which case Khazan can't jump, can barely attack higher or lower than waist height, and drops like a stone.\r\n(On base difficulty, NG) Game difficulty is generally on the low side. If you've played a decent number of these games, you'll regularly 1-2 shot bosses. If you're new to these games, the game is very gentle, with free skill respecs, easily accessible stat repecs, and generous support for boss fights.\r\n\r\nKhazan isn't a bad game, it's just a decent game in a space with a lot of competition.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its like dark souls if it was made by a couple of money hungry long nose tribe members who didn't care about flushing out the lore or characters or story or enemies or bosses or anything really, its vaguely ok to look at but the combats clunky and way too easy even on the hardest difficulty (not the new game+ one) tons of purchased assets (audio was the primary issue for me) (aka lazy dev work) meh orchestra which is doing it a service and overall just a soulless wannabe Nioh(and the nioh games arent even great so what are we really doing here), not good at any particular thing and generally bad at many things, (too easy, extremely linear level design, horrible equipment mechanics, clunky combat, early 2010s visuals, etc) if they would have just taken an extra year i could see this being a good game but it really just falls short in every category. they TRY to be edgy but it just comes off weird and gross, they TRY to be a Godfall/Nioh type of game but fail miserably (literally one resource to gather; any equipable items)which you can then break down into way way way too op weapons which you can use to slam the next 2-3 bosses without using any thought or skill im writing this a little under halfway through the game and I hope I will find  a reason to change this review. \n\nREAD THE REVIEWS MOST SEEM LIKE BOTS LOL\n\noverall not great, not even good to be honest. 5/10 (and thats being pretty generous just buy mortal shell if you need something to play in-between dark souls releases)\nill finish the game and hopefully come and change my review from negative to positive? (unlikely)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not very good. Enemy scaling is fine but the bosses are just damage sponges, overall just kind of boring to play",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I would recommend this game only if you seek for a mindless challenge and don't care about anything else. Below are some things which I don't like about the game.\r\n\r\nThere are several archetypes of levels in the game such as castle, cave, village etc, and all of them are extremely generic, I think \"generic\" is the best word to describe the game. Everything looks exactly the same and I can't tell a difference between a castle at the beginning vs at the end of the game. If you played any Dark Souls game you'll be able to remember any location by it's screenshot but it's not the case in this game. It's just the same bland greyed-out generic castle/village/cave and there are absolutely no memorable places in the game.\r\n\r\nI don't really like the progression system: you gain like 0.4-0.7 percent in attributes or +3 AR increase which is basically nothing when the weapon AR is 400+\r\nYou complete missions, gain some \"memories\" things and increase the hp/poise damage by 1% at best. Wow what a generosity\r\n\r\nThe game desperately wants to be hard and full of cliches from any souls-like:\r\n- If you see an item somewhere in a room be sure to be ambushed by multiple mobs which appear from nowhere\r\n- If walk on a narrow bridge be sure to get attacked by an enemy who would try to push you off the bridge\r\n- Like a half of glowing red items/chests are traps\r\n- Tons of mobs, especially towards the end of the game\r\n\r\nSometimes I had weird input drops, especially on the heal/use item button when you press it while not in an animation or animation recovery but the character just does nothing.\r\n\r\nAlso I don't really like the difficulty approach in this game. The \"intended\" difficulty is \"expert\" and I have the only question - really? Is this really what the game is intended to be? Bosses have HUGE amount of health and it takes ridiculous amount of time to get them down while they destroy you in 3 hits. You may expect to commit some massive damage when you deplete the poise bar like in Sekiro but no - the damage amount is laughable. Maybe somebody would enjoy such a compelling gameplay but personally for me at some point it became just dull and boring. The weird thing is that if you switch the difficulty mode from \"expert\" to \"normal\" then the game becomes ridiculously easy removing any challenge whatsoever. I have no idea what's happening on the easy mode, maybe bosses are damaging themselves.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Bosses are perfect, spent at least an hour on each of them. Everyone is unique and has a huge skill set. \n\nRegular enemies are a bit of challenge at first, but that’s all. \n\nI was disappointed in level design: there is no level design. Game consists of enumerous amount of separated linear levels. \n\nIf you played dark souls and enjoyed the fact that at some point you can navigate in the game world as if you were at home, then I guess you would be disappointed as well.\n\nAfter the first three of them each level it’s just one hour of running through to finally see the boss. On top of that the game is very long. If it was half that long I wouldn’t get so tired of it at the end.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Don't buy this game. The developer likes to nerf gears/loadouts/skills every few month. Making all past guides useless. This is absurd for a single player title.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really want to enjoy this game but the lack of diversity in weapon choices really turned me off, I was hoping I'd be able to try out weapons like longswords or great axes or even katanas, but just being limited to 3 types while I don't really like either type makes it hard to have fun in the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Oyun cok guzel ona bi lafim yok ama olumsuz vermek zorundayim cunku oyun bireysel beceriye dayali.\r\nBende de o yok.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great visuals, garbage story and uninspired gameplay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the game until the last boss ozma. 3rd phase is not fun at all and feels just like work. To me it does not make sense to introduce an easy mode and then not allowing it when I decide to do that. I would have used that but was not allowed anymore at that point in time. That decision was game braking for me.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}