{
  "positive": [
    {
      "review": "Commander, the aliens continue to make progress on the avatar project. If we're going to slow them down, we'll need to move fast.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "98% chance to land a shot. *Misses*\nGet's one shotted by Aliens.\n\nThis game makes me want to watch Hentai.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Great sequel and overall the best \"modern\" turn based game, even after 10 years. The sequel bait ending though is awful.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Very engaging and fun, no other game has the same feel in terms of franchise, design and mechanics \nAn Absolutely goated game\nThank you Xcom for getting me through depression",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "One of the best game ever made.\n\nAnd if you got bored of it, try my collection.\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3609736864",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Playing this for the first in 2025. \n\nI gave XCom 2 a thumbs up as the developers did an excellent technical job with their creation. The game looks great, sounds great, and plays great but the problem I have with the game is the same issue I have with most of these turn-based combat grid systems. Once I select my characters and builds, I find myself going into every mission with the same tactics. In other words, just going through the motions which becomes very tedious after awhile. \n\nThe one thing that kept me motivated was the story which is obviously based on the 1980's TV show \"V\". The narrative is great and tapped hard into my 80' nostalgia but there simply was not enough supporting content inbetween missions to sustain my interest once the combat began to feel repetitive.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "You can look at other reviews for detailed reviews but all I will say is that reviving the old format of XCOM and putting it in this art style revolutionized top-down gaming. It will be almost 10 years now and this game still holds up really well. It desperately needs a sequel, Firaxis, please at least try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Addicting as hell. Especially when you use Mods to customize your squad to whatever you want it to be. In the current mission my team is made out of 2 clone-commanders,  1 Mandalorian , 2 space marines and 1 dreadknought from Warhammer. \nI grabbed the game + DLCs on sale for 8 bucks and i regret that i did not try it out earlier.\n\nIf you play the game for the first time ever and have the DLCs: \nPlay Vanilla for 5-6 hours. That is enough to know at least a little bit what is going on.\nThen start a new run with War of the Chosen DLC enabled. It enhances everything by a lot.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "XCOM 2 — игра, к которой я возвращаюсь снова и снова уже много лет. При том что у меня большая библиотека хороших игр. Очень продуманная пошаговая тактика, одновременно динамичная и адреналиновая: каждая миссия как мини‑боевик, где одно неверное движение может сломать всю кампанию.\n\nВчера начал новую кампанию на высокой сложности в режиме терминатора. Дошёл до миссии, где впервые появляется Ассассин на мосту — заранее готовился, что потеряю половину ключевых солдат. Но всё вышло наоборот: из миссии я ушёл всего с одним ранением, которое нанёс обычный огнеметчик, а не босс. Ассассина я засёк сразу после его спавна и с одного хода просто уничтожил. На этой сложности такое вызывает прямое уважение к самому себе.\n\nТактика в игре глубокая: считай каждый шаг, думай наперёд, строй базу, развивай отряд, выбирай миссии. Ошибся — сам виноват.\n\nПлюсы:\n- глубокая и требовательная тактика\n- реально разные враги с разными подходами\n- миссии не повторяются по ощущениям\n- глобальная стратегия важна так же, как и бой\n\nМинусы:\n- на высоких сложностях ошибок не прощает\n- новичкам придётся потеть",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, better when I can assign Simpsons voices to all my characters with mods.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good, tactical and fun. plus pew pew alien scum",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "XCOM 2 is a successor to both the ups and downs of Enemy Unknown, and it shows in its design. Firaxis directly compensated for many of the most popular complaints people had about playing EU, and while that flattened some of the highs, it also brought up some of the lows. For the average player, it's a significant net gain. For hardcore players, you'll need to turn to mods to achieve something as wondrous as Long War 1, or just to fix up all your gripes with the vanilla game; in order to make things more reliably enjoyable, some replayability was sacrificed by scripting the experience more behind the scenes. You won't notice this on your first playthrough, but play enough and it'll be clear too many things feel the same each time.\r\nThis is why XCOM 2 is a much better game for the average XCOM player - someone who plays it for a couple weeks, or maybe just one full campaign at most, enjoys it, and never touches it again. For those of us who live and breathe this series, the sameyness between repeated campaigns becomes apparent, but can be solved with mods, and that is XCOM 2's greatest improvement for us - it is extremely mod-friendly compared to EU. The steam workshop is absolutely bursting with entries, and you'll be hard pressed to find any other turn-based game with this many mods created for it. Thank you to all the modders who've given this game so much life.\r\n\r\nBut to be honest, if you're the kind of person affected by all that, you already know about XCOM 2 and have likely played it to death already. For those of you who actually need this review to decide whether to try this or not - do try it. It doesn't reinvent the wheel of EU, just builds on it in deep ways befitting a true sequel, and if you like these kinds of games you're near guaranteed to have a great time. The massive moddability is a blessing and curse - just like Skyrim, you can practically turn this game into whatever kind of modded overhaul you want, but just like Skyrim, expect to lose hours and hours putting together such modlists. There's a reason I still play EU as well - when I want a great package that Just Works, I play EU + Long War. When I want more, that's when I come back to XCOM 2.\r\n\r\nThanks again to Firaxis and 2K for such a wonderful game, again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still in late 2025 This game rocks, these was the times and xcom2 still has a place.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game contains super heavy galactic stuff.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fantastic game on its own, lots of good mods to boot. \n\ni made all of my friends into in game characters, and now i feel bad when they die. \n\nit goes on sale often, so pick this up with the war of the chosen dlc when its cheap. the dlc makes the game better in every way. in all itll run you back like 7 bucks on a good sale, and its easily worth that.\n\nwhen you get bored of shooting aliens, you can turn all of your soldiers into clone troopers space marines, and then you can turn the enemies into the flood from halo, and then you can throw in senator armstrong because why the fuck not.\n\nor you can goon to the snakes.\n\ngooning to the snakes is always an option.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "XCOM 2 is still a great game 8 years after its release. The XCOM Community has created a large number of modes that give it almost infinite replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played a lot longer than 8 hours, and the game is fun with mods. I would advise to get it on a steam sale with a dlc package deal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most addictive and frustrating games, love it! .... early game is the real challenge and if you make it through, the late game is pure joy and revenge. Personally, i like the overkill factor of fielding a troop that has been on so many covert ops it's frothing at the mouth and has nearly as many hit points as a Sectopod, and cannot miss. Where is X-COM 3? The teaser at the end gave us hope. Started this series with Terror from the Deep many moons ago, would be great to see it reimagined:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nothing to dislike about this game other than there's no 3rd installment or at least not yet. Hurry up and make the 3rd one please and thanks for making a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "XCOM 2 is one of those strategy games that grabs you right away, lets you think you’re doing great, and then completely destroys any illusion of having an easy time. The mix of tactics, customization, and constant pressure makes every mission feel different, and the DLC—War of the Chosen especially—adds so much personality and chaos that it’s hard to imagine playing without it. Shen’s Last Gift and Alien Hunters pile on even more variety, and even the cosmetic packs help bring the squad to life. It’s tough but it’s incredibly satisfying, and I keep coming back for more punishment. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To be fair, I don't really know why I like this game. I kinda liked more the aesthetics of the first game but this one didn't fail to deliver. Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game the gameplay is fun as well as frustrating to beat with characters but the different items/ classes make it worth while. The story, characters and music are fine for the game but real appeal is the mods which has ridiculous effect on the characters to gameplay with unique classes or story content. Overall, buy this game for a good challenge and for the mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love tactical turn-based strategy, care about your squad, and enjoy games that don’t simply let you coast once you’ve mastered them —  XCOM 2 War of the Chosen is gold. It turns the base game into a richer, higher-stakes experience, one worth revisiting many times over. After 900+ hours I’m still discovering something new, still feeling the flush of victory, still dreading the moment I lose a veteran soldier.\nIn short:  Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is stressful as hell, frustrating sometimes, but overall fun! It's something I already feel addicted to, and I can tell there's a lot of strategy involved. Combat feels like it actually requires thought, rather than just shooting as much as possible. Aliens are ruthless and will either bomb you, kill civilians, mind control you, or even reanimate the dead. This game is a wild experience and I love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the tactical combat, and coordinating your squad to take down aliens is so satisfying. And the kills cams are great, go play this game y'all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BRING US XCOM 3!\nThere is nothing like XCOM.   When this game first arrived on the scene, it was a breath of fresh air for those of us who were looking for the next level of gaming.  This is the thinkers chessboard.   If you play chess, you will love XCOM.  You will love the idea of planning your moves 3-5 steps ahead to beat the enemy.   Military veterans will love it.  Take that military strategy and experience you have to beat the enemy.  The graphics and modular design to upgrade make this game an definite 10/10 game to play.  Even in 205 it beats a lot of the games out there!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addicting turn based strategy game that turns hours into minutes. I just finished the game for the first time and I am already looking forward to my next play through and eventually XCOM 3!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good, better than the Epic Games version because the Evacuate VIP mission doesn't glitch out.  I recommend buying the full collection around Halloween for discount- and look out for recommended mods after your first playthrough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The greatest strategy game ever created and nothing else comes even close.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good, but XCOM 1 was just tighter and cleaner. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, finished 1 normal run and 2 or 3 lwotc runs, had plenty of fun and now I'm waiting for xcom 3 commander. If you like round-based combat this game is a must it still holds strong to this day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super game, not overly complicated but enough diversity in strategy and customization to keep it interesting for several playthroughs. You really get attached to your squad members and promotion is very satisfying. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super sick love it \r\n\r\ncant get the nexus mod to work tho\r\n\r\nno naked on workshop that i can see...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it, but the Rulers mechanic breaks the game imho. But whatever, mod it so they take normal turns instead of wiping your squad off the battlefield every time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Realized I never rated this game, oops ! \nIt was incredible honestly, the battles were interesting and flowed well, the customization of characters really got you invested in their well being. \nFrom top to bottom amazing, just wish there were more like it. \nIt will leave a void in you when you finish trust.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good but its still very annoying when my guys are standing right next to the enemy and they have a 97% hit chance and the still miss, that shit grinds my gears but other than that, great story, great UI menu for the avenger and great gameplay of how to fight back against a alien invader that took over the world, and wotc isnt that hard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9 years later and Xcom 2 is still the best tactical game ever made hands down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "XCOM 2 scratches an itch that no other game does when it comes to wardrobe customization, character sculpting, and creating elite squads. The strategy and gameplay are excellent—and often rage-inducing—but this can be managed with the right doctrines and tactics.\n\nYes, you will miss 90% shots if you take enough of them. That’s how probability works. If you’re OCD about that sort of thing, save-scum to your heart’s content. If you’re an achievement hunter and enjoy a challenge, don’t.\n\nBack to the main point: the game’s customization options are incredible, especially with the right mods. You can have clones fighting stormtroopers, Titanfall pilots dropping in to decimate the alien threat, and if you want to listen to the Demoman while committing war crimes—you absolutely can.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite a good game even after all this time. Get it on sale, we all worry about money, and check the workshop. Running a long war with 40k mods and it is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game and Xcom franchise has always been excellent. I started playing since XCOM 1 and I still enjoy it today.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "xcom 2 is pinnacle of tactical games, it's a stample of genre, no game are able to produce same level of quality!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest games of all time. would've been the greatest if it wasn't 75 fucking gigabytes and the mod launcher worked. mods take this thing to a whole nother level, especially long war of the chosen",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the absolute best tactical turn-based strategy games out there. The original XCOM and the newer OpenXcom are amazing and probably even better in many ways, but the older graphics will turn away 90% of players. XCOM 2 and it's amazing MOD community gave this game infinite longevity. I played LWOTC in a 500 hour+ campaign and I even modded it further with TONS more enemies per map and stronger weapons etc. It turned the game into a brutal insane global war where I ended the game with over 16,000 ADVENT and Alien kills! What a game. Nothing comes close in this genre. I HIGHLY recommend this game and it's amazing MODs. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply amazing game.  Improved on the first.  Very tight, tense action packed battles and global map campaign.  You always feel like you are on the edge, outclassed, outgunned, outproduced, and scrambling to keep up.  But it keeps it exciting in a good way and you are forced to constantly make tough choices-- both in a battle, and in prioritizing research or manufacturing.  Fantastic game, definitely worth it.  One last caveat- think of the tactical battles not as trying to emulate realism but as a challenging combat given the game's parameters (like you can only carry one grenade, so use it wisely etc).  It works well as a game this way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Miles better than the previous XCOM title, but there's something inside me that feels that this game needs a sequel but they abandoned it. \n\nBuy this game on a discount, and may RNG bless your aim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Holds up very well for it's age. Great fun, and nice to have your own customised squad of resistance fighters who you care about. Quality tactical squad based game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love a good turn-based strategy game, and this definitely falls into that category. The actions each class has are dynamic, and both the graphics and storyline capture and keep my attention. I've been an avid Civ player since Civ II, but this this is my first XCOM game. I will definitely be trying out the others in the series!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Let's be honest, it's a comfort game at this point. Lots of replayability, and the upper difficulty modes are challenging, especially when you start getting attached to your soldiers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If the game didn't have percentage chances on hits or at least have more consistency in percentage mechanics I would enjoy the game more. This is one of those games where you can tell the game itself does not like you and works against you. \r\n\r\nIt may be a setting, but increasing the speed of the game would be appreciated. A lot of time waiting around for movements and actions to be completed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A excellent way to spend time - you can always fit in one more 30 minute battle in - for better or worse.  Fun tactics, excellent visuals, and varied enemy design make for great replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great tactical/rpg, the lack of classes on the base game and the reliance on dlc is a bit of a turn off tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good fun game, and one of the best tactical shooters. Story dragged a bit, but was a great game overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great tactic game with tons of customization.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game for many years and enjoy trying different strategies to accomplish the same ends. I don't grow weary of the great variety of options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grew up playing the first Xcom games. Xcom 2 is just as challenging. With every move there is a sense of anxiety about where the aliens might be and whether your cover is sufficient. The agony of losing a high ranked soldier is terrible. \r\n\r\nThis game will put you through the emotional ringer. One of the best purchases that I have ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, grew up playing it. Definitely try it out if you enjoy turn based strategy stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought it again on steam just to play the workshop mods, they add SO MUCH hours of content, i'd bet more than 80% of my playtime is on LWOTC alone\n\nOh yea, about the game, absolute peak, give me XCOM 3 now please I'm begging",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game for 10 years now and I keep coming back. Fantastic tactical turn based game, endless fun. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best turn-based strategy games out there, especially with mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun game but missions tend to be samey and bugs never get fixed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Damn good game, had lots of fun with it have been playing it for several days nonstop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really well made tactical game. It has a lot of great ideas. loads of content, and manages to make both the base and missions fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best tactical games, specially with War of the Chosen.\n\nAnd the there are mods. This game have one of the best mods scene of all games, if not the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The original is an amazing entry in turn-based strategy games.  But this improves on the original in every way.  The UI is much smoother and the gameplay is even better than the original.\n\nI don't have many hours on PC yet, but I've beaten the game 4 or 5 times on PS5.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this on the PlayStation 4 previously, I ticked around 400 or so hours on there. \n\nThis game is tight, tight, TIGHT... !! 🔥\n\nEverything to me is enjoyable, near enough permissible. You get creative in each scenario your units are placed in, and I grew attached to my squadron as they grew. It sucks when they get caught with their pants down from a flanking position, but it's the reminder of cherishing each unit to make the best decision for them in order to survive the alien onslaught. \n\nSteam Workshop's availability, the mods really open this game up to it's true potential compared to the console version. (Currently using Resident Evil & Call of Duty mod packs) \n\nI believe that is what makes this the best version of the XCOM series.\n\nI'm glad I picked this game up again, I can find myself replaying this often. \nIt's a game worthy to pick up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "xcom is such an awesome game! its punishing but so worth it. You can find this game on sale all the time for like $2-$3 and its worth so much more than that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played xcom 2 years ago and it was just ok (Enemy Within is one of my favourite games ever and xcom 2 didn't live up to it). With the expansions, however, this game became pretty awesome!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've ever played I keep coming back to it every year, War of the Chosen is the only DLC id say was a requirement unless you want to use mods ( Highly Recommend LW2 or LWOTC)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, what to say? This game brings exactly the feel of a tabletop wargame to the screen. Nail-biting t, moments of absolute glory and amazement, all of it! I've always been a fan of XCOM games and even though this one is far from perfect, The War of the Chosen brings such a magnificent twist to the gameplay and the modding community is frankly unmatched!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best tactical strategy ever made. There are tons fo replayability and cool things to do and test with your squad. It is also extremely hard on higher difficulties. Definitively recommend getting it especially if you manage to get it on one of those 90% off sales !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got this game for 3 dollars years after it came out and I feel like I robbed them. Strategy abounds, decision making is incessantly important, I cannot wait to play it through to the end, because if it's anything near as fun as it's been so far, it's promising",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Way too many hours in, I am ready to recommend this game. Still the best in the genre after 9 years. don't forget to try the Long War 2 mod in the workshop :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a game that makes you feel connected with these soldiers under your command, smart and thoughtful as you manoeuvre them tactically through the battlefield then crushes you completely as your mistake causes them to get injured, go crazy or perma-die. You'll want to do it all again. Highly reccomend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the games i keep coming back to. I sometimes uninstall it, thinking i'm done, but everytime i do i feel the urge to play again soon after.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The camera makes this unplayable on steam deck. Fair warning. But yeah, a fantastic game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "XCOM 2 WOTC is just the best there is in the genre. It's pretty much a straight improvement on every aspect of XCOM EU/EW, which was already an awesome game. Combat is sick, enemies are cool, locations are beautiful and replayability is excellent. And don't forget the mods. Pretty much a perfect game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Xcom 2 is a great improvement over Xcom 1 EU/EW, especially with the War of the Chosen DLC. Excellent graphics, turn based combat, research tree, and game replay. It is tough though, as most missions are timed, which adds pressure. At higher difficulties, it can seem impossible at time. However, I found it to be extremely rewarding. There are many mods which can improve game play and provide additional challenge. Unfortunately, the game is far from being bug free, but it mostly works. This is my favorite game of all times and you can sink hundreds and thousands of hours into it, as no campaign game is similar to prior one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Old game...but there is no other like it. Top notch XCOM game play...for anyone who have played the original from long time ago...this is a must play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game doesn’t want you to win. It wants to watch you suffer. You’ll name your squad after your friends, send them on a “simple” mission, and five minutes later, Samad the sniper misses a 95% shot and gets vaporized by a Sectoid or random Trooper. You’ll rage-quit, swear you’re done… and then boot it up again five minutes later.\n\nIt’s the perfect mix of strategy, chaos, and emotional damage. Managing your base feels like juggling grenades, and every mission feels like a movie directed by your anxiety. You’ll scream, you’ll panic, you’ll celebrate, and then you’ll cry when your MVP grenadier gets one-shot.\n\nBut when you do win—when that desperate plan somehow works—it’s pure bliss. You feel like the smartest person alive. For about five minutes. Until the next mission.\n\nPlayed on rookie, played on mods. Enjoyable with and without indeed. \n\n⭐ 11/10 – Tactical pain, emotional trauma, and the best “one more mission” game ever made.\n(Remember: 95% means 5%.)(yes you will miss)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the gaming equivalent of sadism and being addicted to it.\n\nI'm am truly scared of this game and sometimes find a brave day to play it on both on my PC and my phone. It's a lot of fun to watch other pro players play it but I don't think I could ever beat it with the difficulty scaling eventually getting too high. Too many losses can bring down your spirit and make it impossible to beat the game. I'd like to think I've gotten better about it but I still get stuck in the early game.\n\nAdding War of the Chosen raises the difficulty, adds a bigger story and more unit types to the game. The vanilla XCOM 2 resembles XCOM 1 a lot more and is probably a bit easier to play with fewer features and challenges to deal with. Don't expect to win every mission as keeping your soldiers alive is more important.\n\nSpeaking of soldiers, the default character customization is pretty good but limited when compared to the sims. Obviously, this is made better thanks to mods but I hope the next game will have a more thorough character customizer that rivals that of a MMO game. Being able to add entire backstories to characters is amazing and I've spent hours writing fan fiction with it. We love and care for our characters and cry when they die.\n\nSpeaking of MODS, it's obviously the big reason the game is still super popular to this day. I only use voice mods to add characters, clothes and new faces to the game. There are mods for anything you want that changes the game drastically but I mostly just stick the voice mods.\n\nSo, hope to see an XCOM 3 probably never. XCOM 2 will probably live forever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fuck this stupid fucking game why is the normal difficulty so god damn fucking hard fuck this shit i fucking hate this god damn masochistic turn based stratslop bullshit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, played over and over on multiple platforms.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite it is almost 10 yrs old it is still a very good game, with a good story.\nEven the additional DLC is worth it.\nIt was however a real shame that the knowledge of the melt from \"XCOM : Enemy Within\" did not ultimately come back to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still a classic turn base. so many options to win a flawless battle trick is to practice every move",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's quite good!  A worthy successor to both the original games and the first reboot.\r\nBut since when I played the War of the Chosen content last time (~2018), that DLC seems to have gotten much more difficult (almost smashing your head into the wall difficult) - a lot of save scumming is necessary with WotC unlike the base game at the same difficulty level.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the best strategy games of all times, so much content can be enjoyed from the base game and expansions, even more with mods. The start might be a little rough for new comers but eventually you'll build your own avengers team even before you reach late game and it's pretty damn satisfying.\n\nPersonally always run ironman mode since save scumming kinda wastes more time plus the added thrill of consequences is exhilarating.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most addictive substances on Earth. This game nearly ruined my architectural thesis project back in 2022. Now it ruined my social life and romantic relationship. Definitely a 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Modded version of the game is great (Long war of the chosen)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game started as a quick buy while discounted, to a swift kick in the balls with difficulty, to being the most enjoyable game I have played in a very long time. My first session was 4 hours long and the entire time I just could not stop playing. The first level was hard and the game was unforgiving, but while I noticed my mistakes and weaknesses in my tactics, I started to adapt and overcome the Advent horde and now kicking ass in every level I have played since. I love this game and think anyone considering it should give it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HOW DOES AN OFFICER GRAZE 4 SHOTS IN A ROW, MISS 2 95% IN A ROW, STUN LANCERS EXISTING, THIS GAME IS PURE UNADULTERED CBT.\r\n\r\nI recommend, very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I keep playing on and on this game. Now I 'm trying Iron man-way, medium difficulty.  This comes close to the real life experience of warfare (as close as possible, with all respect for those who know/knew real warfare experience, that is still a million miles from a game). You will mourn when your colonel dies after 30 succesfull mission and 50+ alien killes, because of the stupidity of a rookie or the simple luck of an alien shot. No one can replace him. And you realize that this is the tipping point of the campaign and you will loose the war after the coming series of failed missions, because you loose the veterans able to withstain the strains of the battlefield. Although your newbies will have the best equipment, they never will have the experience needed to win the war.  Still you fight on for a loosing cause, because there is no alternative. And then you realise why the Germans fought on during 1944-1945, why Lee only surrended in 1865, why Napoleon took on the gamble in 1815. That is quite an achievement for a game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the tactics and strategy involved and adds a awesome element to it: Aliens!! :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pro: Classic Tactical Strategy RPG. The gold standard to which others are to be judged. I have played this more on PS than on PC. But enjoy all the modding options on PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Commander, the aliens continue working on the Avatar Project, if we are to slow them down we need to move fast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun tactical shooter. The percentages will drive you crazy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my \"Sharpshooters\" never landed a single overwatch or aimed shot during his service, and then an alien collapsed the floor he was on and he died. Classic XCOM.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent for people who enjoy turn based combat and strategic sci fi games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic turn based strategy fun with loads of cool decisions and scenario choices and management. Always loved this series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is a good mix of hard tactical combat while being rewarding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My best advice for a new player is sectoid are your lowest priority target, flashbangs will break mind control and dont play with the dlc tell you know what you're doing",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Am stopping playing all 2K games as now 2K games install spyware to collect deep personal user info, device info, IP address, GPS location, internet activity-browser history etc for its use/sale to third parties and potentially pass on to US/UK/EU government. F Off 2K..",
      "voted_up": false,
      "votes_helpful": 91
    },
    {
      "review": "2k TOS for each passing day have become more and more outrageous. XCOM have been fun but i will never ever buy any game from 2k or installing game from 2k again for that matter",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The turn timers are absolute ass and way too overdone. The mods to get rid of them would work if 2K wasnt so stupid with their dumbass launcher. I regret buying this game despite really enjoying the first one.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is basically 50/50 whether my saved file will get corrupt. The auto save files were completely unloadable so i had to manually save just in case the game crashes which it regularly does. Twice i completed a mission just for the game to crash at the loading screen and when i run it back all my save files even the ones I manually saved are corrupt and I am forced to start the mission again. The game is fun but for me was completely unplayable due to all the techical issues with it. I don't know whether this is a common problem but I have never had any problems with games ever. I feel like i wasted my time on a broken product.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad and really annoying game design compared to xcom enemy unknown. \nit has some more features but that's about it when it comes to actual good things of xcom 2.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I could enjoy these games. They might be excellent, fun, innovative but none of that matters when they come bundled with pseudo-spyware, shady anti-cheat, or any intrusive software running in the background.\nI absolutely refuse to install anything that messes with my PC more than necessary. 2K and Gearbox for me are more than dead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "XCom2 is a wonderful, very frustrating game. But sadly, the main issue which trumps anything anyone has to say about it, is that it is super unstable and at a certain point I just haven't been able to proceed due to the constant crashing of the game. It's a real shame because the game itself is very compelling, if a little irritating at times. So I can't recommend because as it is the game doesn't work! \r\n\r\nHappy to revise this review if anything changes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played through it, but found it boring. The endgame in particular dragged on forever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its fun in its own twisted way. i would put neutral if i could. it shoves so much garbage down your throat at once and you cant skip useless dialog, those 2 things cause a lot of annoyance for me. its has its fun moments and it has its moments where your sniper has a 99% hit and FUCKIN MISSESSSSSSS that might make you want to send your fist though your monitor. overall worth the $8 steam sale (of course) but also raises my blood pressure over stupid shit and it making me stay on rails of dialog and not being able to skip a single thing ever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely ridiculous random number game. So much tech is utterly useless.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As an avid darkest dungeon fan, this game is actually dogshit for it's RNG. I've tried extensively to enjoy it, but it's just too much.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A good game, just not for me, I do not enjoy playing on anything besides Legend, and Legend difficulty is just unfair",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The voice acting and writing is corny and not in a good way, the gameplay is clunky, the viewmodel is claustrophobic, shooting at someone 3m away is literally a coin toss, and you have no idea what your characters can see before you make a move, making savescumming the only reasonable choice.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After 19 hours Idk where the fun begins, xcom 1 was actually really good, this one tries to be edgy and difficult, the first hours it was the missed shot simulator. After you get \"good weapons\" the enemies get much tougher so the weapons actually felt useful for maybe 3 missions, I'm no stranger to turn based combat, BG3 while newer it's a far, FAR, better game than this, thankfully I just payed them alms for this so I don't feel much cheated. The random events are not enjoyable, it's just pure stress. Thanks to this game I actually recapacitated and I'm retaking my japanese lessons, learning something actually useful, while stressful is a far better experience than this. If you have a life and are a normal human being, just use your time in another stressful but productive thing, like setting a business. Maybe next week I'll replay kcd2, in hardcore mode is a difficult but ENJOYABLE experience. This is the first time I rage quit a game by the way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is great till you are hit with “Pure virtual function being called while application was running (GIsRunning == 1).” error. There's no patch or a way to fix it, your only option is to start from scratch.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I mean this game is for me because I'm a nerd and I love to challenge myself and be creative so this game is probably one of the best I've played...\n\nBUT JESUS CHRIST! THIS GAME HAS SO MANY WRONG WITH IT ITS INSUFFERABLE! ITS GAMEPLAY DESIGN, THE LACK OF INFO, THE UI IS STUPID, THE GAME CONTROLS DOES'T SUPPORT THE GAME MECHANICS. THIS GAME IS SO BEAUTIFUL IF ONLY ITS NOT BEEN MADE BY DUMB ASS PEOPLE WHO ARE INCOMPETENT. MY GOD WHAT A WASTE! THIS COULD HAVE BEEN A GOD GAME.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "XCOM 2 is like food poisoning so bad, it makes me want to avoid the entire genre so I'm never reminded of it again.\n\nThe worst of its series, the worst of its genre. It's the kind of bad that makes you wonder if you're participating in a social experiment. Or maybe a prank?\n\nWas excited for this game for years and only finally had the time to sit down and play it. Total shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really want to like this game. I've tried playing it multiple times, but it’s just not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gun turn based combat systems pmo. It's still a decent game but I'm not crazy for it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Garbage game, lazy devs, not worth the money I spent on the game. For any of the devs reading this, you are a sorry excuse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rampant DLC-ification of a good franchise; how are you going to lock content that was in the first behind multiple separate DLC packs? Even the WotC DLC pack won't get you SPARK units, etc. Shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Coming from the Mass Effect franchise from hour one, I basically found the atmosphere in this game pretty alike from the storytelling. First upfront: I didn't play with mods, I never played XCOM 1 but I played a lot of games like that I wasn't frustrated with half that much, not even on peak cases. Not only dated back to Commandos, ect, but also one \"more recent\" example I still measure other games on would be Phantom Doctrine. Same game rule set with tiles and turns, a hit chance, - that doesn't make you question if for the programmer 1+1 is 2 also - a slightly more intelligent options to handle overwatch directions and yet challenging still. And if you wanted, you turn up difficulty still, without needing you to reload because of every minimal enemy encounter. But let's first get to the ups first and best-possible-objectively [u]fair[/u]...\n\nThe pro share:\n- Immersive story telling. \n- Variation of localisation and VA is well picked. At least from the limited VA's I tested.\n- Demi-Free Campaign leaves an impression of being in charge of the direction, even if it's only an illusion, it works so far.\n- Lot of research and upgrade-potential for equipment.\n- The \"biotic\" class as I call it from Mass Effect has a nice vibe to the sister-franchise (atmosphere wise).\n- The cutscenes between the missions are repetitive, but still they're done in a way you still don't rly wanna skip them. Also the camera cuts in-fight are nicely done to give the impression of a dynamic and action in the skirmish going on.\n- The Threat aka avatar project as a main mission pressure point brings a nice overall-tension with it and if you're mindful, you can somewhat get a hand on slowing it down as much as possible.\n\nThat might sounds like a lot. And if you have your most vital points checkmarked in a game like this, go and buy it. But I recommend to hear out the cons first to be warned about what's ahead. Bc as you know, this isn't a recommendation feedback for a reason. And that's not primarily about Take 2's crap policy lastly, - despite them deserving it to be cancelled only for that - it's more the stuff ingame that strips the overall gameplay the long term fun and makes it tedious and energy consuming instead of giving a great experience. And you can see, the points are 'weighty'. So let's get to the...\n\nThe Con share:\n- It's a \"human resources\" shooter: The game clearly aims to bury your characters alive, so you better get used to the fact you have no characters but meat on legs, bc the moment you give them a name and background is the moment your problems start with this game, because you want certain characters to live and survive, but the game does have exorbit-hard difficulty jumps on some missions that you ultimately lose people, if you don't reload on every yet-so-small mistake you do but can't foresee, because some things the game doesn't tell you upfront and the fog of war is nothing else but a \"surprise-you're-frakked\"-courtain most of the time.\n\n- Uber-super-exaggerating-much elite-enemies: If you're new to this game and don't know anything about what's going on and how the game expects you to handle it, you'Re basically borked already, but don't know it in the early hours yet, because it's a problem if a game turns out to become crappy by midgame and while you're still able to refund it. At least that seemed to be the Devs' POV. Point being: The Boss mechanics are ridiculous. Having an already overpowered enemy on the battlefield with 500% of your highest soldier's health, a good armor rating and the special ability to act \"every in-between action you do with one soldier alone\" is a bit of an overkill. I can understand the case of them being very sturdy, fine. But always the exaggerating \"super-nemesis\" based on an imaginary power level you barely reach, if you're not on drugs, or playing by guides only. But playing by guides only is not playing a game, it's stupid assembly line working to progress to the end and being able to say \"I got a savegame that finished the game too\". These elite enemy mechanics trait to be able to act in every turn have no counter spell and they're using skills with that much AOE that you're losing very likely all your high skilled team members and stuff only because of such encounters. This is one of the most frustrating things you can offer in a game and that's a dead end. There's no discussion on that, because base games should not be measured on hardcore RPG rules, which clearly this game tries to be. I've been playing and monitoring games since mid 90's, so don't piss in my ear and tell me it's raining, folks.\n\n- Hit Chance. Yeah, problem is, with all the games having had a hit chance that delivered (mostly, as in being a chance) what it promised, it is - in the very end - no real hit chance. I know: People have been discussing this a lot and I have read a lot of ego talk or fanboy-dom out of it instead of being reasonable analysing it. Fact is, I don't care about your camp wars, I'm here to make my own mind, so I tested it on long term before I even knew there was a camp war about this going on long ago. So trusting my own 'demi-scientific' - aka best possible repeatable-same circumstances - experiments I did a test that was anything but a rocket science! Srsly, everyone could do it, just don't go astray on the repetitive tests.\nMeans => Make a savegame with a shot of 60% hit chance, do the shot and reload the exact savegame over and over again. Make notes on how often you hit on a minimum of 20 times and multiplicate it with a factor of five. Then tell me you've got a hit chance reflecting a 60% likeliness to hit something in this game. I didn't want to believe it, but I had a case in an unmodded (base) game in which I reloaded the game 30 times with always the same 64% of hit chance. And it missed every single time. I mean, this is insane, right? Not one hit. What exactly is one to think about that, I ask everyone claiming math in this game being this or that? I mean, how's that even possible? I even changed the parameters after this by doing another action after save then to see if it's a case of PRNG, as developers claim, but it didn't change a single case. The hit chance in this game is everything else BUT truthful or accurate. It may be mathematical, but that means basically [i]everything and nothing[/i], as it only says something gets calculated, but hit chance rating displayed and true-hit-chance are not even playing in the same league in this game. It though seems half of the time accurate enough so it gives an impression of being reliable. But it's not. And with over 30 times of reloading and 20 more with changed order of orders, nobody is able to call it \"bad luck\" anymore. This is intentionally rendered a hardcore RPG mechanic to go against the player. That simple and not the first game that time frame to go that way.\n\n- REELOAD-Doctrine! Aka \"Savegame shooter\": You only have a fair chance, if you know where the enemies are and WHEN the enemies are there. So scouting is s joke at the second you do shoot the very first time and the first-move reaction from enemies jumping to cover can turn out to be your coffin's nail, if it's the last movement in your turn you made while uncovering them. So REELOAD it is. If the games wasn't so annoyingly out to put you on a time pressure in turns half the missions, this wouldn't be a solid negative point. But it is, so here we are.\n\n- 2K. Bc it's the longest point I put it at the end of the list, even if it belongs on the top with a huge spotlight show on it to tell the world about this atrocity! Selling personal data is a no-go and everyone doing so belongs on the banish list forever. This is breach of trust between customer and the one stealing data from your PC on a demi-legal way. Walk of shame ahead.\n\nIs there a fix for this mess?\nOnly if you can find a way to disarm some of those game(?) breaking(!) points above in the cons-section. Sadly there are no mods to fix it all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Play rookie difficulty\nEnemies scatter to cover on sight\nSoldiers panic over the slightest of inconvenience\nAliens cause panic too\n2 out of 4 soldiers are controllable now\nOne gets flanked, instant dead\nOne of the panicked run into overwatch, dead\nHave 1 controllable soldier and another panicked\nKill 1 alien\nPanicked gets flanked\nLast man standing\n*5 aliens and 1 mech enters area*\nDead, gg\n\nAnd it feels like that in every single mission. How the fuck do you have fun with this!?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Doesn't support the co-op mod, kinda a bummer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "XCom2 is a wonderful, very frustrating game. But sadly, the main issue which trumps anything anyone has to say about it, is that it is super unstable and at a certain point I just haven't been able to proceed due to the constant crashing of the game. It's a real shame because the game itself is very compelling, if a little irritating at times. So I can't recommend because as it is the game doesn't work! \r\n\r\nHappy to revise this review if anything changes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "READ 2025\n\nI love this game I really do, but the eula reads like it's the deep state. They will set up spyware and sell off to governments. leave negative reviews to get them to do something about this horrendous system.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "funny how XCOM games are the only games I collect but don't play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "frustrating unlike dark souls. rng is repulsive.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Humans bad... what a load of woke crap.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A poorly made and lazy developed game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let's make number generator God. Everyone liked that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i fucking hate this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "controller doesn't work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nope, just nope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dogshit, broken RNG trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Am stopping playing all 2K games as now 2K games install spyware to collect deep personal user info, device info, IP address, GPS location, internet activity-browser history etc for its use/sale to third parties and potentially pass on to US/UK/EU government. F Off 2K..",
      "voted_up": false,
      "votes_helpful": 99
    },
    {
      "review": "I officially hate this game. I missed 4 shots in a row with a 94% success chance... Otherwise a great game...",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "This is a really bad game. I love Xcom: Enemy Unknown. And when I tried to play this one I will instantly rage quite because of the scatter move. I cannot believe how bad it is.\n\nThe moment you see an alien, those bastards instantly get a free turn from nowhere and sprint straight into cover. What on earth were the developers thinking? It’s supposed to be my turn, yet the enemies suddenly start running around like it’s theirs. Every single time it happens, I feel like throwing my PC out the window.\n\nWhy does this exist? Who thought giving the aliens a free reaction move on my turn was a good idea? Either let them move during their turn, or make them stay where they are. Those are the only two options that make sense.\n\nIt’s unbelievable that spotting an alien somehow triggers a mini-turn just for them. Do I get a free move when they spot me? Of course not. It’s completely one-sided, infuriating, and honestly one of the worst design decisions I’ve ever seen in a tactics game.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "On release, this game was good (with mods).  Now, it's crap.  Do yourself a favor, and forget this entire franchise exists.\n\nThe game has workshop support, but half the mods don't work because the game has been patched to death for marketing purposes.  If you do manage to get some mods working, pray the game is stable enough to not crash on startup.  There are probably mods on Nexus, but i really don't care enough to troubleshoot anymore than i already have.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really want to like this game, but several early missions listed as must do, \"don't recommend skipping\", just almost guarantee squad wipe. One alien can mind-control right at the beginning and drop a grenade on your squad. I get that's the point, it's a hard game but XCOM 1 from what I saw actually looked challenging and enjoyable - not just gg random paniced now squad wipe. Or maybe I'm just bad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The turn timers are absolute ass and way too overdone. The mods to get rid of them would work if 2K wasnt so stupid with their dumbass launcher. I regret buying this game despite really enjoying the first one.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Tried any number of mod combinations and all the game does is crash now. Tried every troubleshooting guide over the last 3 months, no luck. Just played a 40 minute round and the game crashed without having autosaved anything 2K needs to fire everyone for not supporting players and the community more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is basically 50/50 whether my saved file will get corrupt. The auto save files were completely unloadable so i had to manually save just in case the game crashes which it regularly does. Twice i completed a mission just for the game to crash at the loading screen and when i run it back all my save files even the ones I manually saved are corrupt and I am forced to start the mission again. The game is fun but for me was completely unplayable due to all the techical issues with it. I don't know whether this is a common problem but I have never had any problems with games ever. I feel like i wasted my time on a broken product.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "XCOM 2 and WOTC, are amazing games.\n\nBut, 2K has allowed the games to fester in a broken state on consoles. I just lost an Ironman save file on Xbox, due to a bug that has been around since launch. 2K doesnt GAF.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played through xcom 1 and... kind of liked it. I tried twice with this damn game. It's just not fun to miss 6 84% chance shots in a row. Everything I loved about the original xcom games just isn't in these new ones. The limited time frame on game, the tiny squad sizes, and the hideously balanced hit ratios are just... stupid.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Would have been a really cool tactical game, but the Timers force you to disable your head and rush in on every mission, what a shame",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "only play if you're willing to admit that the odds are significantly stacked against you regardless of what the percentage says.   I've played tons of games that have to do with probability and this game legit lies to to you on probable odds.  Don't believe me?  Then play it idgaf.  Just be warned - you will rage over what probability should be verse what it is in this game.  There is some sort of 'counter' against a 'player' playing this game.  Don't believe me then just play the game for yourself.  Don't recommend unless you want to save scum you're entire way through this game.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Encounter new alien every mission that has new busted bullshit mechanic. you miss all the time and you always feel weak. this must be a game that was made to be fun for the NPC.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "unbalanced and unlogic, start till end. that's why old games are always the best, if you wanna play a good strategy game just play to xcom enemy unknows/within.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "bad and really annoying game design compared to xcom enemy unknown. \nit has some more features but that's about it when it comes to actual good things of xcom 2.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game would be good if it wasn't for the dogshit piece of shit fucking RNG. Fuck do you mean I am 5 tiles away, on the high ground and the MARKSMAN (at least a Lieutenant) misses with a 75% chance and now my entire squad gets wiped? I lost my shit just trying to play one single mission.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is ass, the percentage says 80% hit chance but high chances of missed attack. freaking lies. and the alien turns so bugging slow, the alien just stood there doing nothing for 1 min, then it moves.. freaking insane",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Most frustrating game I've ever played. Constantly yanking the camera from you, combat is PURELY based on numbers, no logic (behind a building? to bad, the enemy had a more than 0% to hit so they hit)\nTutorial is horribly \"handholdy\" to the point where you HAVE to do what they say step by step. Forget exploring the menus yourself. \n\nTutorial says that you have two \"actions\" per turn, moving takes one, and shooting takes one.. you can move then shoot. But God forbid you want to shoot THEN move..\n\nGot a Sniper unit, and ran into a good line of sight, but suddenly my only options were to shoot with a pistol at a lower hit rate??? \n\nFor a game that prides itself on being heavily tactical and unforgiving combat, they sure do love to ignore logic..\n3/10 shitty game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I could enjoy these games. They might be excellent, fun, innovative but none of that matters when they come bundled with pseudo-spyware, shady anti-cheat, or any intrusive software running in the background.\nI absolutely refuse to install anything that messes with my PC more than necessary. 2K and Gearbox for me are more than dead.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No voiceover or team sound. Unplayable - wouldn't know it existed if you'd never played it before.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Everything you found infuriating about the first game, but in high definition.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "READ 2025\n\nI love this game I really do, but the eula reads like it's the deep state. They will set up spyware and sell off to governments. leave negative reviews to get them to do something about this horrendous system.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played through it, but found it boring. The endgame in particular dragged on forever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its fun in its own twisted way. i would put neutral if i could. it shoves so much garbage down your throat at once and you cant skip useless dialog, those 2 things cause a lot of annoyance for me. its has its fun moments and it has its moments where your sniper has a 99% hit and FUCKIN MISSESSSSSSS that might make you want to send your fist though your monitor. overall worth the $8 steam sale (of course) but also raises my blood pressure over stupid shit and it making me stay on rails of dialog and not being able to skip a single thing ever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What's the line in which Random becomes a problem? Xcom, is that line. \r\n\r\nI think this is a unique case of a game in which most loops work, but the primary loop doesn't. In the end of the day, I can take only so many 70% shots missing in a row before this is not worth my time. Chance plays far too big of a role in the mechanics and while surely they will average out in infinity, they won't in a mission nor a playthough. Increasing the dificulty only to have the dice more heavily weighted against you seems like a tough sell. \r\n\r\nIf you wish to play a skill game whose results are heavily influenced by chance, play Poker. It's a better time, more dynamic and you can play with friends. And the kicker, its less influenced by chance than this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely ridiculous random number game. So much tech is utterly useless.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As an avid darkest dungeon fan, this game is actually dogshit for it's RNG. I've tried extensively to enjoy it, but it's just too much.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The voice acting and writing is corny and not in a good way, the gameplay is clunky, the viewmodel is claustrophobic, shooting at someone 3m away is literally a coin toss, and you have no idea what your characters can see before you make a move, making savescumming the only reasonable choice.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After 19 hours Idk where the fun begins, xcom 1 was actually really good, this one tries to be edgy and difficult, the first hours it was the missed shot simulator. After you get \"good weapons\" the enemies get much tougher so the weapons actually felt useful for maybe 3 missions, I'm no stranger to turn based combat, BG3 while newer it's a far, FAR, better game than this, thankfully I just payed them alms for this so I don't feel much cheated. The random events are not enjoyable, it's just pure stress. Thanks to this game I actually recapacitated and I'm retaking my japanese lessons, learning something actually useful, while stressful is a far better experience than this. If you have a life and are a normal human being, just use your time in another stressful but productive thing, like setting a business. Maybe next week I'll replay kcd2, in hardcore mode is a difficult but ENJOYABLE experience. This is the first time I rage quit a game by the way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good pain in the ass simulator. Bad way to implement a chance based combat system. It doesn't respect your time, and not only because every turn has at least 1 irritating thing happen. \n\nThe game makes you watch every animation all the way through for all turns for all actors on screen from movement to combat despite the game instantly knowing the outcome of every action the moment you click the button. FFS you get achievements the moment you hit the damn fire button and not when you finish showing me the dumb thing on screen. \n\nIf you play this game for 100 hours 80% of that playtime will be pointless animations and navigating the avenger and not making tactical decisions. Hell, the entire avenger could be a single tabulated menu screen. Yes, it's a video game, visuals are cool. Are the exact same passively consumed visuals cool for 100+ hours on repeat and without variance? Not to me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Some great game play features that I wish were in XCom1\n\nHits all the right notes except the enemies that insist on having 4 or more actions when it's not their turn.\nImpossible to plan for this level of contrived difficulty.  You need to be playing conservatively to protect the squad that you're trying to build up. Especially early and mid game.\n\nBut you can't take your time, there is an endless cavalcade of missions where time is a factor and a very short amount of turns are given to you to get the objectives.\n\nTherefore 2 is the lesser game by far.\n\nI tried to get into it but I just can't.  So my play time is a shadow of my time in the original.\nA shame really, I'm just glad that I purchased on a very heavy discount.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is great till you are hit with “Pure virtual function being called while application was running (GIsRunning == 1).” error. There's no patch or a way to fix it, your only option is to start from scratch.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I mean this game is for me because I'm a nerd and I love to challenge myself and be creative so this game is probably one of the best I've played...\n\nBUT JESUS CHRIST! THIS GAME HAS SO MANY WRONG WITH IT ITS INSUFFERABLE! ITS GAMEPLAY DESIGN, THE LACK OF INFO, THE UI IS STUPID, THE GAME CONTROLS DOES'T SUPPORT THE GAME MECHANICS. THIS GAME IS SO BEAUTIFUL IF ONLY ITS NOT BEEN MADE BY DUMB ASS PEOPLE WHO ARE INCOMPETENT. MY GOD WHAT A WASTE! THIS COULD HAVE BEEN A GOD GAME.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really want to like this game. I've tried playing it multiple times, but it’s just not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gun turn based combat systems pmo. It's still a decent game but I'm not crazy for it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ridiculous balance. I play on default difficulty. I need like 2-3 attacks to kill one of the weaker human like soldiers in the second mission but if that guy gets an attack on me my guys just instantly die with no chance to revive or heal or whatever. I HAVE 4 GUYS AND THERE ARE LIKE A DOZEN OF THEM... AND THEY CAN REVIVE LMAO. Instantly deleted and removed from my steam account.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rampant DLC-ification of a good franchise; how are you going to lock content that was in the first behind multiple separate DLC packs? Even the WotC DLC pack won't get you SPARK units, etc. Shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cannot use a controller. So many interfaces, I just want to kill aliens like XCom 1.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Play rookie difficulty\nEnemies scatter to cover on sight\nSoldiers panic over the slightest of inconvenience\nAliens cause panic too\n2 out of 4 soldiers are controllable now\nOne gets flanked, instant dead\nOne of the panicked run into overwatch, dead\nHave 1 controllable soldier and another panicked\nKill 1 alien\nPanicked gets flanked\nLast man standing\n*5 aliens and 1 mech enters area*\nDead, gg\n\nAnd it feels like that in every single mission. How the fuck do you have fun with this!?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Doesn't support the co-op mod, kinda a bummer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "funny how XCOM games are the only games I collect but don't play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "frustrating unlike dark souls. rng is repulsive.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Humans bad... what a load of woke crap.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A poorly made and lazy developed game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let's make number generator God. Everyone liked that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "XCOM 1 absurdly better!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The engineer is a useless bum",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "controller doesn't work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nope, just nope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dogshit, broken RNG trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Am stopping playing all 2K games as now 2K games install spyware to collect deep personal user info, device info, IP address, GPS location, internet activity-browser history etc for its use/sale to third parties and potentially pass on to US/UK/EU government. F Off 2K..",
      "voted_up": false,
      "votes_helpful": 99
    },
    {
      "review": "2k TOS for each passing day have become more and more outrageous. XCOM have been fun but i will never ever buy any game from 2k or installing game from 2k again for that matter",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I officially hate this game. I missed 4 shots in a row with a 94% success chance... Otherwise a great game...",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "This is a really bad game. I love Xcom: Enemy Unknown. And when I tried to play this one I will instantly rage quite because of the scatter move. I cannot believe how bad it is.\n\nThe moment you see an alien, those bastards instantly get a free turn from nowhere and sprint straight into cover. What on earth were the developers thinking? It’s supposed to be my turn, yet the enemies suddenly start running around like it’s theirs. Every single time it happens, I feel like throwing my PC out the window.\n\nWhy does this exist? Who thought giving the aliens a free reaction move on my turn was a good idea? Either let them move during their turn, or make them stay where they are. Those are the only two options that make sense.\n\nIt’s unbelievable that spotting an alien somehow triggers a mini-turn just for them. Do I get a free move when they spot me? Of course not. It’s completely one-sided, infuriating, and honestly one of the worst design decisions I’ve ever seen in a tactics game.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "On release, this game was good (with mods).  Now, it's crap.  Do yourself a favor, and forget this entire franchise exists.\n\nThe game has workshop support, but half the mods don't work because the game has been patched to death for marketing purposes.  If you do manage to get some mods working, pray the game is stable enough to not crash on startup.  There are probably mods on Nexus, but i really don't care enough to troubleshoot anymore than i already have.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really want to like this game, but several early missions listed as must do, \"don't recommend skipping\", just almost guarantee squad wipe. One alien can mind-control right at the beginning and drop a grenade on your squad. I get that's the point, it's a hard game but XCOM 1 from what I saw actually looked challenging and enjoyable - not just gg random paniced now squad wipe. Or maybe I'm just bad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The turn timers are absolute ass and way too overdone. The mods to get rid of them would work if 2K wasnt so stupid with their dumbass launcher. I regret buying this game despite really enjoying the first one.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Tried any number of mod combinations and all the game does is crash now. Tried every troubleshooting guide over the last 3 months, no luck. Just played a 40 minute round and the game crashed without having autosaved anything 2K needs to fire everyone for not supporting players and the community more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is basically 50/50 whether my saved file will get corrupt. The auto save files were completely unloadable so i had to manually save just in case the game crashes which it regularly does. Twice i completed a mission just for the game to crash at the loading screen and when i run it back all my save files even the ones I manually saved are corrupt and I am forced to start the mission again. The game is fun but for me was completely unplayable due to all the techical issues with it. I don't know whether this is a common problem but I have never had any problems with games ever. I feel like i wasted my time on a broken product.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "XCOM 2 and WOTC, are amazing games.\n\nBut, 2K has allowed the games to fester in a broken state on consoles. I just lost an Ironman save file on Xbox, due to a bug that has been around since launch. 2K doesnt GAF.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Would have been a really cool tactical game, but the Timers force you to disable your head and rush in on every mission, what a shame",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "only play if you're willing to admit that the odds are significantly stacked against you regardless of what the percentage says.   I've played tons of games that have to do with probability and this game legit lies to to you on probable odds.  Don't believe me?  Then play it idgaf.  Just be warned - you will rage over what probability should be verse what it is in this game.  There is some sort of 'counter' against a 'player' playing this game.  Don't believe me then just play the game for yourself.  Don't recommend unless you want to save scum you're entire way through this game.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "unbalanced and unlogic, start till end. that's why old games are always the best, if you wanna play a good strategy game just play to xcom enemy unknows/within.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}