{
  "positive": [
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 84
    },
    {
      "review": "very good game, easy to mod, can be realistic and is also fun i have poured about 4k hours into the game since it's launch and i can say that this is my favorite game of all time",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "i thinks its better then planet coaster 1 with the scaling and the more themes but there are some flaws.  7 / 10",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Frontier have a glowing reputation for committing to projects and listening to their fanbase. When PC2 launched it was very unwhelming. I held off writing a review until the game had had some time out there and Frontier had some time to fix and update. Its not perfect, its not all plain sailing but Frontier are heading in the right direction at last. Glad I held my tongue for a bit and allowed the company I love to come through.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Game is better than launch. Waiting for some features from Planco 1 to come over but it’s worth buying and playing now.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Planet Coaster 2 is a good game,\r\nat first.\r\nI do enjoy it, and think there's still way more for me to discover - however, it does have its problems. Some things glitch for seemingly no reason, like workers not responding even if they have nothing scheduled and aren't on break, or guests not being able to enter the park at all even though the rest of them can.\r\n\r\nThat said, I do still love this game. This isn't a bad review for a reason. The UI is just absolute bliss, the rides are interesting, and there's DLC for days so you never get bored! The campaign keeps you hooked, with fully voiced NPC's to guide you if you're stuck! If you get frustrated with the campaign, you can try your hand at the sandbox mode or just making your own park from scratch. There's a lot to do in this game, and I am still discovering it. But putting the main negatives aside, it truly is a wonderful game, you just have to be a liiiiittle patient haha!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Game is excellent. The amount of improvements and fixes done from the release reminds you of No Man Sky. Great job!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Surprised to see people say they got bored of this game after an hour. What did you expect? I think the devs did a great job balancing the management aspect with creativity and freedom to make your dream park.\n\nThis game has something for everyone, but you won’t enjoy it if you’re not a creative person. There’s sandbox mode if you want to build your dream ride, park, or simply screw around. Franchise mode if you’re a tryhard, and career if you don’t feel like building the entire park, just fixing and managing existing ones.\n\nYou can discover other players parks, and watch as others discovers yours. A special shoutout to the planet coaster 2 facebook group where lovely people share builds and ask questions.\n\nI’m one of those that shouldn’t like this game. I’m not a theme park nerd, I don’t care too much about rollercoasters. But the freedom this game gives you, while still challenging your management skills, is imo unmatched. There’s only one other game I’d say lives up to planco 2 and that would be Planet zoo, unsurprisingly.\n\nThe devs have made sure this game did not flop and keep improving it. Sure dlcs suck but at least they’re still dropping updates for everyone. I’m excited to see what the future holds for this game, and I’m glad to recommend it (despite my disappointment on launch… 😳)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Now that we have moved past the very bad launch of PC2 I feel that the game is now lightyears ahead of the original. The new pathing system, once you figure it out, is amazing and makes park layout much easier. The toolset, while challenging to learn, is extremely powerful and you can almost build anything that you can imagine.\n\nI usually play in Sandbox, so I can not speak for the management aspects of the game. I tried it a few times in the beginning and was not impressed. I have heard that it improved, so I will eventually try it again.\n\nOverall, the game is a lot of fun. Even though it has hard to master tools, once you \"get it\" it becomes much easier. If you are a fan of the original, or theme park games in general, then you should definitely check this out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still very new to Planet Coaster as I have 10.5 hours on it... However I LOVE this game! I adore everything to do with theme parks and have always been obsessed with them, also being a gamer this game is the perfect combo! Endless fun, I can't wait to successfully build my own theme park! This game gives both the serotonin of a video game and the adrenaline of a roller coaster. In love.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great game, grew up with RCT and finally having the freedom to design in 3D is amazing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very cool coaster game, it is amazing doesnt get boring build big coaster kingda ka hell yea this games awesome",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great expansion on the original Planet Coaster, path system, pools, more editable ride mechanics make it a great game. highly recommended and it will only get better over time with extra content packs.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I hate this game. Please play the first one its great. If you want to know my in depth review about why I enjoy the first one find my review for the first game on its page. This will make you understand the differences and dynamics about why I believe this since I have many hours on Planet Coaster.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Better than planet coaster 1 and the dev team is absolutely amazing. Cant wait to see what comes in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its pretty good if you like coasters and overall management games (sim city, etc.)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Although it initially had a rocky beginning, Planet Coaster 2 is proving more and more with each update, that it is one of the most expansive and customizable theme park tycoons out there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of, if not the BEST game and theme park simulator. It can be laggy sometimes but a pretty good game overall      9.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Only a couple hours in but I'm loving it. The music/graphics are fun, menu's pretty easy to grab, my first attempt at making a coaster not too daunting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its the game that it has always been. Frontier is working to make the game and game play better thru free patches and scenery. Yes DLC has recently become available for sale and its worth the investment for the game and to fund back Frontier to make a better product.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is great! If you have a love for theme parks, roller coasters and water parks this game is for you! Frontier has committed to this game and they keep updating and adding more content/fixes based on community feedback.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "THE best theme park game I have ever played!!! \n-Best graphics and physics\n-Best game play ever \n-Just amazing \nI would definitely recommend playing this game if you haven't",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite seemingly rushing out the game before it was ready, the devs spent an entire year fixing the game and getting it to a very enjoyable state. With continued updated and new DLC on the way, the game is definitely an improvement over the original and has a long lifespan ahead.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. You can bulid a waterpark or a theme park. One thing i did not like is in planet coaster 1 you have a backwards launch coaster but in this one you dont have it. Other than that the game is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game has improved since launch and I'm glad to see that Frontier continues to make updates and add content. If you  liked the first and have not tried PC2 yet, I'd say it's in a good spot and you should give it a go if it's on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun-ish. Its an amazing game and satisfies all of my needs for new coasters, not only that the graphics are imaculant and theres hundreds of scenery peices for me to build a good park with. The games pricing is not making me happy but i bought it to my own peril. And im happy to say i cease to regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Planet Coaster 2 is a good game; however it does have some issues. Some of the rollercoasters from the original game are locked behind a DLC, and some coasters aren't even there at all. With all of those issues, it's still a fun game that i would recommend. I would love if there were more roller coasters, like the bobsled kinds and the swinging suspended coaster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "they really have come a long way since release, basically adding some free dlc (which should've been in the game at launch), but they haven't abandoned it, and it is really fun for people who like theme park sims.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite literally one of the most relaxing games I have ever played. Hugely recommend if you liked RCT, and want a chilled game to sink a couple of hours in to. It's a staple in my library and is everything I've ever wanted in a theme park game. The love I have for this title cannot be overstated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely love this game miles better than Planco one and the graphics are fantastic also the variety of rollercoasters is unmatched 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty fun there is alot to do in this game, price is a little high. But overall fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "On first release I thought this was almost unplayable, now I think it's better than Planet Coaster 1!  Frontier has done a good job.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't play on this account, but on my other account/device I can play it, this is by far the best roller coaster sim out there, it has got (basically) everything from the past game & even more: switch tracks, new lighting, drop tracks, attach scenery to rides, moving platforms & more. Get it, it will be the best theme park sim you've played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with realistic physics! (most of the time)\nIf you like roller coasters this is a MUST-BUY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay, after a year, I think this game is finally where I expected it to be at launch. Especially with the upcoming Update 8, I can definitely recommend it for PC1 fans and everyone else.\n\n\n[hr][/hr]\nStuff still missing/broken, etc. (not exhaustive):\n\n[list]\n[*]drum lifts for some coasters\n[*]light occlusion in large buildings\n[*]Block lights from shining through scenery/ray tracing for lights (per-light toggle for performance?)\n[*]Toggle for stock attraction/coaster lights (maybe make them triggerable?)\n[*]Redo of the event sequencing (bulk copy, paste, etc.)\n\n[/list]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They have made the game so much better since launch. Wonderfull to see.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Planet Coaster 2 is where my best shower thoughts. Standing in that queue at Thorpe park on a rainy Saturday wishing people didn't queue jump, my best dreams and hours of my time. Being able to watch someone create a park that's so detailed, realistic and thoughtful to try and create my own but totally fails. I'm meaning that its a boring as a stone. Detail is weird/ off putting, colours don't match. Makes you think it looks good while making it but after 5 mins and one YouTube video later its awful. So I decide you know what lets demolish this and go again. It is a rinse and repeat process. Now theme park season is back. I'm in queue once again at Alton towers getting thoughts of how to make a cool theme park. Even at work after spending hours on the game I still think about how my theme park should be. Once I get home play for a bit and all the ides that rushed to my head just don't want to come out. Every day stuck in this cycle of wanting to make something grand like many other creators but translating these into the park well that's a struggle.  Sorry what was this about? Oh right its a review yeah the games good and constantly being developed. Get it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "muitas melhorias em relacao ao 1 e principalmente em relacao ao lançamento",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a good improvement on the first planet coaster but some parts i do personally think are better in 1 but overall it is a good purchase when on sale and its still being updated so the game will continue to improve.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After a rough launch and having putting it aside for months I can finally say I enjoy PC2. Good work from the devs on listening to the community!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an absolute masterpiece.\nIf you like rollercoasters, this game is especially for you.\nThe devs really listen to the community and try to make the game better with each update.\nYou can be so creative inside of this game, nothing is impossible to make. The only things you need are creative ideas that you can make reality.\n10/10, would definitely reccomend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game if you want to mess around with rollercoasters or if you want to play seriously",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! lots of things to do and if your creative you can build whatever you can imagine! coaster building is a lot better than the first game. \r\n\r\nThe only thing i dont like about the game is that there arent enough scenery pieces so i cannot build the things i really want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great sequel game to PlanCo 1. Innovative new ride systems and improvements overal. Glad that there are regular (free) updates to the game. Also the paid DLC's have content the players have asked/longed for.\r\n\r\nKeep up the good work! :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game was kind of a mess at launch, but the devs really did their best and updated it regularly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked Planet Coaster 1 you will love this. There are some great improvements of the game mechanics and they are always updating the game with more features and content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super chill game, give it a try if you like casual city builders",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game and has much potential and its fun but they can put a little bit more rides in the game but overall a very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have had 0 bugs, 0 optimization issues, 0 issues all around. The pathing tool and all the other things i saw in the negative reviews are not present for me. They have definitely improved on the first game in huge strides and I am loving it so far. I cant wait to see what they add in the future and I HIGHLY recommend the game in its current state, especialy if you are a fan of the first one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Planet Coaster 2 es simplemente increíble. La creatividad que te permite tener es enorme, las herramientas de construcción son más intuitivas que nunca y cada detalle del parque cobra vida de una forma espectacular. Si te gustan los juegos de gestión o construir mundos desde cero, este juego es una joya absoluta. ¡Me encanta!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got 400 hours on console it was great but the max build limit was annoying. \r\n\r\nThe game is great on pc but the max draw distance / lod / render is extremely annoying pls fix\r\n\r\nother than that frontier have done a great job over the last year, one of the best studios in the industry compared to everyone else. the game is worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The design options are limitless. It is so satisfying to see your park come to life with coasters being ridden, amongst the scenery items. Graphics are on another level. \n\nThe tycoon feel of this game could use some improvement, as it currently feels too easy to make money and keep a high satisfactory level even when your park is trash. I hope this can be address in future updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great sequel to planet Coaster 1. The Dev team has put so much love into this game fixing a lot of launch day issues",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very realistic compared IRL coaster types. Fun to play. Defo recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun game, plenty to do, heaps of cool features compared to previous game. Water park stuff done really well.\r\nHats off to the devs and all!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun but very frustrating at times.\nHere are some of the things that I have experienced:\n- Game crashes (sometimes without even loading a saved game or starting a new one....just launch it and wait for the crash). This has only happened 2-3 times and may be fixed (now I just immediately select a game to avoid waiting on the main menu).\n- Gondola transport ride just stops and cannot be restarted without exiting the game and relaunch. There is no service required and all stations have staff assigned.\n- Trying to do some detail work with a lot of scenery around can be a bit frustrating. Sometimes zooming in can cause the camera to instantly be moved very far away.\n- Playing on the Steam Deck or a PC with a controller is definitely more frustrating than using a mouse and keyboard. This is very apparent when adjusting staff schedules going into advanced options and setting the zone and workstation. Trying to apply the changes to \"All day\" results in being sent back to the full staff schedule just to find that the change did not happen. The only workaround is to manually set each 1 hour shift separately. This gets old very fast.\n- The in-game help is not very helpful. Example: try to find out how to keep people in the pool away from the flume/slide exits. Many more instances of there not being enough detail in the in-game help to actually solve a problem that many users experience.\n\nThe above issues are only some that I experienced.\n\nThere are a lot of things that still need to be worked out but overall the game is still pretty fun just be prepared for a little frustration from time to time. For now, I'll still recommend the game. If Frontier does not address some/all of the issues in the next 6-12 months, I may change my recommendation.\n\nCheers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun and creativ ebut I have coaster experience with building so I like making the roller coasters more than decoration that is why I bought the sorcery pack becuase it had the intamin in it. very very fun overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having played this game for over 100 hours, I feel that I have had a real sense of this game. There are so many things that I could talk about, but I don't want to make this long, so I'll make it a bit more concise. First of all, the different types of scenery that you can build, and the level of detail is so precise. I LOVE IT! Secondly, the different rides available and the roller coasters that you can build is really great! You can chop and change the different theming of the rides depending on the type of park you want to build, and the flexibility of it all is very good. Finally, I personally really like all of the different game modes; franchise, sandbox, career, to name but a few. This is really good so that you can challenge yourself throughout all aspects upon building up to create a BRILLIANT theme park! Everything in this game is SO GOOD and would definitely recommend to anybody who likes to let your imagination run free (and also likes theme parks)! \nHope this is helpful, BYE! :D\n\n\nP.S: I also like the new addition of waterslides (flumes) and pools to this game! :D :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a smoother experience than PC1, it takes a bit of time to get to grips with the basic controls but once you do, it becomes second nature! Good variety of ride options from the beginning & good customisation of difficulty level. A good amount in career mode from what i had the option of playing even from the very beginning; if you like PC1, you'll love PC2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can be really creative with alot of objects and triggers and a great selection of coasters and flat rides. I wish maps could be bigger and more creative for the money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MY REVIEW\n\nGraphics:\n☐ Ask Nasa if they have a spare PC\n☐ Very good PC\n☑ Average\n☐ potato\n\nPrice:\n☐ You will wait 5 sales for this\n☑ Expensive\n☐ Okay Price\n☐ Basically free\n☐ free\n\nGameplay:\n☐ Very good Story\n☐ Good story\n☐ Some logic\n☐ okay Story\n☐ No Story\n☑ Sandbox game you just build\n\nDLC's/Packs\n☐ You WILL become broke\n☑ Cities Skylines Amount\n☐ Okay amount\n☐ Very little\n☐ One. Just One",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a amazing game to express your enginerring skills(im srry if i speeled anything wrong)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Whilst not yet as polished as the first game, Planco 2 is still an incredible game that just keeps getting better and better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Fun game for those who are creatively minded.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Un increíble juego, tiene las mejores herramientas de construccion hasta ahora de todos los juegos de Frontier. Ojalá Planet Zoo 2 pueda tener todas estas opciones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best coaster tycoon, but terrible CPU performance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It might LOOK similar to Planet Coaster 1 at first glance, but there are so many improvements here. I personally don't care much for the water park aspect, but the pathing system is MUCH better, the scaling option makes theming SO much more versatile. The performance is also much improved, as even my relatively old laptop can it decently.\r\nThe passion of the developers is clear to see. The presentation, the music, the attention to detail and the enormous freedom to build whatever you want are all delightful. When I used to play Rollercoaster Tycoon back in the day, Planet Coaster 2 is exactly the game I dreamt of back then.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun in sandbox mode! tweak the settings a bit and you have a perfect park. highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plenty to do and build and the rides increasing slowly with each expansion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun. You get to launch someone out of a water slide at mach 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and is such a fun game when you just wanna relax",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing game that gets regular updates highly recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best coaster game ever. Its worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good although is outdone by even theme park tycoon 2 on roblox in some aspects",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been doing nothing but getting better since it was released. Just need my spooky pack now :sad_seagull:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] An incredible game that redeemed itself from its rocky launch to become an amazing theme park sandbox.[/h1]\nOver the course of the year Planet Coaster 2 has gone from a messy console focused tycoon game with flawed mechanics to an outstanding sandbox for the creation of any coaster. The coaster creation UI helps new players understand the basics while letting those who want to go off the deep end create masterpieces of storytelling.\n\nThanks to its many free updates the game allows you to customize challenge scenarios to your liking and features almost every original scenery theme from the first game.  However, the water and electricity management aspects of the game can be a  turn off for veterans of the first game or those who want a less management heavy game which thankfully may be disabled with ease when making a challenge scenario.\n\nOverall if your interested in creating highly themed roller coasters and rides planet coaster 2 is one of the best options out there, with much more support planned for the future with a teased second year of content updates both free and paid [b]Planet Coaster 2 might be what your looking for.[/b]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "PlanCo 2 is a fantastic easy-to-use coaster sim and park sim game. There is an incredible attention to detail with a huge variety of real coaster models to choose from. The best part is you can get as detailed as you want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This completely supercedes the original PlanCo and is thus the best amusement park sim currently available. I will literally spend days just designing coasters on this thing. This is my happy place.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After a rough launch the game is now looking better than ever, a worthy successor to the first game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unlimited posibilites, with accessibility to newer players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game like the sims but better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, better version of pc1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Could not recommend more! very smooth, beginner friendly and rediculously fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The controls are alittle hard to understand",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "there is an infinite amount of things that you can build in this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a fun game.  building paths could definitely be improved though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good and fun game MACKPRODUKT 👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD GAME ASLONG AS YOU DOT PAY FOR DLC   DLC IS OVER PRICED AND  JUST THINGS THAT SHOULD BE IN THE GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game!  Great upgrade from the original",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game its so good defo recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and nice. Who wants more?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game if you like sandboxes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very engaging and fun game to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game\r\nwant cheaper though \r\nthx",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best coaster game by far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so good if you like to make coaster and theme parks 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "all clear enjoy ur ride or whatever wonderland made me say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's funny, seeing People scream.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A major improvement from Planet Coaster 1",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game but not worth $65",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Very disappointed in the number of rides included in the base game and the cost of ride packs. I find the game uninspiring as it is and don't feel terribly inclined to throw more money at it to make it into what it should have been in the first place. I don't quite want to give it a down vote but I certainly won't give it an up vote so there you have it.",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "I'm sad to say, i'm disappointed with this game. I spent many hours and money on the original and was excited enough to get the deluxe edition of this game, only to find out that have the original stuff was missing and then was released and you had to pay for it. wouldn't it have been better to include everything you paid for from the original, themes, rides ETC. but like alot of companies are doing, they sell what is basically an upgrade of the original which is half finished and then make you buy everything again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Controls are wierd, can't explain it but nothing feels intuitive. Shops don't snap to paths, and also don't make paths automatically anymore to attach to nearby paths.\n\nI just constantly do the opposite of what I'm trying to do because the controls just feel off. I'm going to reinstall PC1 and refund this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "lets you play it for a bit then kicks you off i literally had to reinstall the game and it still isn't working it only says loading steam then saying \"playing planet coaster 2\" then it just shuts off. It doesn't even let me get to the home screen anymore.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "If you want a good coaster building game, get the original. I love planet coaster, but 2 has a long way to go. If you're reading this months in the future, it may be better now but I doubt it. 6.5/10 game, get the original (Satisfactory is also a good game to try as well)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just a downgrade to the better games. It's fun, just not for this price! If you're going to charge the full price, than give me the full game. Everything is locked behind DLC and the game is just buggy and weird. Wouldn't recommend for this price. Below 10$ i would",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't start the game anymore. Even when playing without mods. Don't buy the game. You'll get 20 playable hours out it at most.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty but the interface is one to be desired.  It is difficult to line things up and i could not find a functional and visible grid.  I have all the DLC content yet I cannot access said content in the game.  The flat rides keep disappearing in the menu, replaced with No content found.  They need more restaurant options, more flat rides, especially rides that are common in carnivals and theme parks globally.  The big disappointment is items keep vanishing in the menus with content not found.  That makes this unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game feels underbaked, and not worth the price tag. Power system condition requirements are weird and make no sense, and has been an issue for a year now with no changes afaik.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I regret that I kept giving it chances instead of just refunding in the 2 hour window. There's no need to buy this is you own the original Planet Coaster. There are a few improvements but they are minor compared to everything PC1 offers. The UI is made for consoles and the plastic-y graphics are for mobile games, yet somehow it requires a decent machine to even run this underwhelming moneygrab.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Glitchy ...   they tried to make the paths better,  but they are worse.  The game is buggy - sticky - slow and not as much fun as the first PC.\n\nI'll come back to it with time,  maybe they will fix it.... sure hope so!   \n\nHope they don't do this to the upcoming Planet Zoo redo........",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game's ride stuff is very annoying, and too limited.\nIts very hard to make a simple ride, for me atleast.\nThis game is still good, just hard to build tracked rides.\nAnd this games may be and IS a cashgrab.\nBugs, Glitches, They wanted MONEY.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As a huge PC1 and PZ fan, this game is an abject disappointment. It was clearly built for consoles and it almost holds your hand too much. The menus have been reduced to the dumbest idiot friendly screens. The overall aesthetics are worse and the game handles even poorer than the 1st game did at its buggiest. I tapped after the prologue. Maybe i'll revisit this in a year or so and see if anything has improved or it Frontier has dog walked their excellent franchise.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, it's an okay game, but it is way too easy. There is no challenge to anything unless you imagine one for yourself. The difficulty settings mean nothing. In hard mode all you need to do is build one ride or pool and suddenly you're rich. The scenery options are fine, but I wish it were easier to make large curved pieces to create big towers or other such buildings. \n\nIf you like fiddling with things in sandbox forever with no challenge then this game will be great for you. I like the challenge so it's not great for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It keeps crashing and is basically unplayable because of it. Disappointing and a waste of money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Even with all settings maxed out, shadows still disappear every time you zoom out, completely unacceptable for a game of this scale. There isn’t even a LOD or shadow distance setting to mitigate it. This has been an engine issue since the first title, and it’s disappointing to see it still not fixed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Embarrassing end to the Planet Coaster name.\r\nThis game is very incomplete and sloppy. Names of roller coasters are jumbled characters and unreadable. There are only 6 food options. I hope you guests are willing to live off vegan food and hot dogs. Its a complete step back from Planet Coaster 1 (PC1). The pathing system has some improvements, but still doesn't connect correctly and angles when not prompted. You'll spend house just trying to connect paths to no avail. Flat ride list is severely lacking compared to PC1. The response is that PC1 had a series of updates and paid for content. Yet, so has this game. PC2 just doesn't want to complete the game and offer a real experience. Scenery pieces do not load right, and when they do the pieces start .25 meters under ground so snapping to flat ground is a struggle. This game a very cheaply made, stripped down version of PC1 with no development road map to complete the game. Yes, its nice to be able to create pools with water slides. But that is all this game is good for. It really should just be an Indie game called \"Wave Pool Builder\".  Frontier really screwed what was a gem of a concept and turned it in to cease pool of garbage. Welcome to the end of the Planet Coaster franchise.  \r\nAWFUL game compared to earlier title. This remake never was \"remade\". DO NOT BUY THIS!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not what I expected. Making coasters is really hard and adjusting for different types of coaster paths is really hard and confusing. I liked the looks of the game, but wouldn't recommend. Maybe buy on sale if its at least 40% off.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've played this game since it's came out it's great I have over 350 hours in it. I started playing it a lot since november 1st. I built a entire area and it was great I made sure I saved it. before I got off. Than all of a sudden my entire save file from starting from november 1st got deleted.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There is no Shrek in game. At first glance, the sequel appears to be a laudable successor to its predecessor: the user interface gleams with modern polish, the physics of roller coaster dynamics are executed with admirable fidelity, and the park management systems have been reengineered to a level of granularity that would make any simulation enthusiast salivate. Yet beneath this façade of innovation lies a vacuous chasm where cultural substance should dwell. The exclusion of Shrek. PLEASE USE SHREK. you have knowledge. There is an entire movie!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a pretty good game but for 60 canadian dollers its extremly overpriced. I enjoy playing theme park tycoon 2 on roblox more then this because its so much easier to play with and it actually fells like your a human. I never post reviews but for something this bad and overpriced and relly have to. for me its garbage but a lot of people like it so its your choise to get this game or not.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I liked this fresh and new take on an already great game. This version now has more annoyances with notifications that continue to bug you while you are playing. The security/pickpocket notifications are so absurd. If they are automatically being taken care of why in 30 min do I get over 100 notifications. I like the new park management, but you also just want to play the game.\n\nDon't waste your time. Play something else. Don't waste your money. As someone who has ridden hundreds of coasters and has traveled the world with a passion for the amusement park and it's industry this was a complete failure.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This really isn't what I Was expecting when I saw water parks... I'm a bit disappointed. I'll try it again eventually. If you just want a continuation to Planet Coaster with some mechanics that truly could be a DLC, buy this. Otherwise, just keep on your Planet Coaster. I can't really recommend this to everyone.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Too many bugs prevent you from achieving all your goals (for example, the cable car stops working, people get stuck on a path, which has a considerable impact on the park's rating, etc.).\nCreating paths and managing employees is a real nightmare.\nI am a huge fan of planet zoo but definitely not of Planet Coaster 2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately, a year after release the controls on PC are still exceptionally clunky, with no good way to build scenery without first placing a blueprint down and then deleting everything. The lack of transport rides is also disappointing (even though the category exists in game?). The first game is still head and shoulders above the sequel.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Doesn't launch and only has ever once. I don't know what the issue is and i contacted support twice about 4 months ago and they said a fix may come in a patch. I'm not sure if its a compatability issue or what. Not happy as this was a game which i was really looking forward to playing when i got my new PC last year.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a deluxe edition that doesnt include the previous DLC is a clear rippoff....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's very difficult to place scenery.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not enough baddies when i build pools:(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it to hard to  beld im mad now i foll i got sacm",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no native linux + denuvo",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too picky/complicated",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "only fun for bout' an hour",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll start off by saying I'm enjoying this game but there's several things irritating me and keeping me from fully loving it (and giving a thumbs up). \r\n\r\n-Bugs: Way too many bugs still. PC1 never was this bad at least from what I can recall. Especially at this price point. Some things are game breaking.\r\n\r\n- Breakdowns make no sense: Seems as long as you keep renewing this service badge, rides will never, ever break down. I miss in the OG RCT seeing coaster trains stuck on lifts, restraints stuck open or closed, etc.\r\n\r\n- Goofy pricing: Guests will pay $50 + to ride 1 ride if it has scenery. There's no option to charge park entry and keep rides free. RCT did this perfectly and added some multiplier that made it sustainable to run a park like this if you chose to. (Parks don't charge per ride anymore)\r\n\r\n- Multi color coaster trains: If you have 2 + trains on a coaster there's no option to select colors for each one. Such a simple thing that's in all the other games except this one. Very irritating.\r\n\r\n- Transfer tracks: With the added electricity element it costs more to run more trains on coasters - there is still no ability to add & take off coaster trains without closing entire ride. I wouldn't even care if there was no animation; let us do this!\r\n\r\n- Lack of variables: Parkitect does this PERFECTLY. You'll randomly get news like \"Merry go round went viral on social media - expect extra crowds for this ride\" or \"there's a shortage of salt. food costs will go up\". And they are very random and there's a bunch of em to keep the game fresh.\r\n\r\n- Lights (still) can't snap to paths: It's way too tedious to place lights. Give an option to snap em to the path or include them in the auto placement option when making paths.\r\n\r\n- No scenario editor: This gives the game way more replay value with ability to share scenarios and empty parks. The first one had it, why not this one?! I want more to do when I finish career mode!\r\n\r\n- Lack of shops: Still only 3 from the first one. I don't even care if it's shops where guests buy stuff you really can't see but it shows in the guest inventory (like Parkitect), just make more shops with different items!\r\n\r\n- Menus are janky: Doing certain things require too many clicks and don't make sense. The UI just isn't the most user friendly. \r\n\r\n- No option to resize parks in sandbox. \r\n\r\n- Closing park causes all guests to leave line: In the first one, closing a park, guests in line would stay and finish their ride then leave (which is how it should be) - now they just all leave. I loved simulating days / seasons in PC1 - I hope this gets fixed / updated.\r\n\r\n- No theme maker toolkit: Again, if it was in the first one, why is it not in this one?! There's many things I don't feel like making myself and its much easier to get stuff from the workshop. \r\n\r\n- Weather seems broken: I have yet to see it rain once. I have it enabled. \r\n\r\n- No RNG terrain maker: Would love an option to generate random terrain. I personally don't like starting with a flat empty park in sandbox. Give option for us to generate random maps. \r\n\r\nSTUFF I ENJOY:\r\n- Pools + Slides: probably just a fun as the coasters to build and one of my fav things to create.\r\n- Scenery stamper: Makes placing scenery sooo much easier! You can even make custom brushes with your own items!\r\n- Separate load + unload stations for coasters: finally they listened to something!\r\n- Onride photos\r\n- Better coaster smoothing.\r\n\r\nThis game needs a lot more love and I hope to see it. The bugs are the big thing but stuff that seems like common sense to add to a game like this just isn't there yet.",
      "voted_up": false,
      "votes_helpful": 80
    },
    {
      "review": "Planet Coaster 2 brings cool waterparks and smoother coaster-building, but it falls short in too many ways. Many features from the first game, like the Scenario Editor, hotels, and varied biomes, are missing, which really limits what you can create. The sandbox maps feel smaller, making big park ideas tough to pull off. Terrain textures look worse than in the original—kinda blurry and low-quality. The UI is clearly built for consoles, so building coasters on PC takes too many clicks, and the tiny sliders for path heights are super hard to adjust accurately with a mouse. No reset option either! Updates have fixed some issues, but it still doesn’t feel complete. Hold off until they add more of what made the first game great.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "Very disappointed in the number of rides included in the base game and the cost of ride packs. I find the game uninspiring as it is and don't feel terribly inclined to throw more money at it to make it into what it should have been in the first place. I don't quite want to give it a down vote but I certainly won't give it an up vote so there you have it.",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "In a few hours of playing in Planet Coaster I had a playable park with tons of enjoyment building.  In a few hours of playing Planet Coaster 2 I have only encountered extreme frustration at trying to find things like park benches, how to build and connect power (which is over and over with repeated behind the scenes things to accomplish to get this danged game to work) and figure out how to place things like scenery.  I understand the basics but the rules of the game and the lack of tutorial make it almost impossible to get started to the point of enjoyment.  Isn't that why you buy a game after all?  I will keep trying but I have to take frequent game breaks to pull out my hair.  If anyone can actually find park benches under facilities then custom let me know.  It only pulls up an empty page with nothing.\n\nUpdate:  After a couple of weeks I have given more time to playing Planet Coaster II.  Previously, I have played countless hours of Planet Coaster 1.  This new game is not worth $50.  They turned it into a cutesy looking game.  Most everything you try to do is cumbersome and requires lots of clicking and digging to figure out what to do.  There is retread on a lot of the items that are brought over from 1. Many of the features of placed items in the first game are weirdly tweaked so they are not as customizable.  For instance - shop menus.... There are little icons of ingredients but it will take you a bit of digging to figure out what the icon represents... i.e. gluten is bread, a cup means caffeine, etc.  And sometimes you can't change them even if customers don't want them. I continue to be very disappointed and likely will just go back to playing Planet Coaster 1 and be sad about spending $50 on a game I dislike so much.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "Not Recommended\n\nI loved the first Planet Coaster, but Planet Coaster 2 is a huge step backwards. This barely feels like a theme park game anymore – it's focused way too much on water parks and pools, while the classic coaster-building and park management from PC1 is stripped down or missing entirely.\n\nThe game feels empty, with less creative freedom and fewer rides compared to the first one. It’s frustrating that after waiting so long for a sequel, we get something that feels like a spin-off instead of a true follow-up.\n\nIf you loved Planet Coaster 1, be prepared to be disappointed.",
      "voted_up": false,
      "votes_helpful": 50
    },
    {
      "review": "I'm sad to say, i'm disappointed with this game. I spent many hours and money on the original and was excited enough to get the deluxe edition of this game, only to find out that have the original stuff was missing and then was released and you had to pay for it. wouldn't it have been better to include everything you paid for from the original, themes, rides ETC. but like alot of companies are doing, they sell what is basically an upgrade of the original which is half finished and then make you buy everything again.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "i loved the first game but this game is kinda bad. Too many limitations on coasters. Its my imagniation let me build. Just because i want to make something fun dosnt mean it shouldnt run because its too scary. Let me create something cool. Please remove coaster limitations from sandbox. YOUR SUPPOSED TO BE ABLE TO BUILD ANYTHING IN SANDBOX NOT LIMIT THINGS!",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Controls are wierd, can't explain it but nothing feels intuitive. Shops don't snap to paths, and also don't make paths automatically anymore to attach to nearby paths.\n\nI just constantly do the opposite of what I'm trying to do because the controls just feel off. I'm going to reinstall PC1 and refund this.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This feels like a game designed for consoles. The controls are clunky on keyboard/mouse, the tutorial is terrible and the limit on only 6000 guests in most modes basically renders any modern CPU or GPU irrelevant. The overpriced DLC leaves a bitter taste in the mouth and i'm glad i waited for a sale to try this game. Having said that, it feels like a waste of $30.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Even on Hard difficulty, you just print money. Has potential but wouldn't recommend because of the lack of a challenge. Loses replay ability real quick as a result.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good, but can't recommend it at the moment. The new pathing and pool system is still too buggy and finicky to use comfortably. But as soon as this is adressed, it's a worthy successor.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "As a planet coaster 1/Planet Zoo lover, i can't reccomend this game, purely for the fact i just can't sit and enjoy it the way i do the others. Building seems more tedious, i miss having the steam workshop, and i'm still experiencing bugs like guests getting stuck on wide open paths..",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It feels like Planet Coasater 1 with a less intuitive UI in exchange for a water park expansion. It feels too much like an expansion with a slightly better graphic overhaul. I'm not feeling it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "What a complete joke! i'm unable to play the game for 10 minutes before it crashes, and when I do play it, it wouldn't stop freezing and stuttering every second. Do I need a Nasa super computer to run this cartoony simulation game?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Waste of Money. Neither offering as much new features as expected compared to the original Planco, nor do i see why they are already releasing DLC's in the \"early\" phase of the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "building keeps getting bugged and won't show the rides and it completely locks the game :(\ni had hopes for this sequel but it's still way too buggy to enjoy",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Buggy and unfinished, still.  Laying out basic necessities is way too clumsy and feels like an Early Access game.  I can't complete an early campaign level because of bugs.  \n\nAlso, the management aspect of the game is severely lacking, it's basically just a sandbox game, and ultimately an unfinished one at that.\n\nCan we go back to finishing games before we rush them to market?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I never played the first one, but I expected a lot more from the creators of Planet Zoo. It's just clunky, and the mechanics feel like they weren’t fully thought out. The UI is frustrating, and I kept running into little bugs that pulled me out of the experience. Honestly, it’s just… underwhelming compared to what I was hoping for.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you dont care about challenge mode, and handling a tight economy, this game is for you.\n\nBut when i saw this game get announced i finally though yes another economy manage game. But no, challenge mode on the absoulute difficult settings are like playing sandbox. I feel like you could place down 1 ride, and hire 100 staffs, and you would still be in profit. \n\nThis game is to \"easy\" i know its a sandbox game. But its no near like planet zoo where you could easily go bankrupt.\n\n\nBUGS\n\nSince the release they fixed plenty of bugs, but many still occours. \n\nQOL \nThe game have deffiently improved since last game, you have access to so much more. Such as resizeable objects.\nGenerally the game nails down QOL.\n\nMy wishes and perspective for me to play the game again.\nI want a difficult where it can absolutely ruin your run, i want to see more expense, maybe a generally higher staff pay, and coaster maintaience just higher. \n\nThe income pr coaster - maintence is to high\n\nIncome/Coaster - Maintence gives you a positive profit nearly no matter what.\nI think there should be some coaster that are marked with [Non-profit] Where it gives you a minus income, but the coaster are very attractive for guest.\n\nOverall the economy ruins challenge mode. There isn't anything challenging about it. \n\nI hope you DEVS of frontier see this. You are a great studio, but you just underestimated the challenge in the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "lets you play it for a bit then kicks you off i literally had to reinstall the game and it still isn't working it only says loading steam then saying \"playing planet coaster 2\" then it just shuts off. It doesn't even let me get to the home screen anymore.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Haven't been able to enjoy the game because of the crashing while building. Always when customizing colors. It's killed my momentum enough times now that I don't really want to play anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is perfect, my only problem and glitch so far are the crowds, they keep gathering in one space and not going anywhere but moving up and down.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was in a sandbox mode, downloaded a few rides from creator. But whenever I selected the ride, the game crash. I didn't show up the ride, and I can't deselect and select the other rides, or even shop, i chouldn't reload my park, i couldn't even exit game. So stressed about it. I always go back to PC1 since I don't have a choice...",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i loved the first game and purchased this game as soon as it launches. Not expecting much - as long as it is an upgraded version of the existing game I would be happy to spend hours in it. I am sad to find out the game turn out to be halfly done, completely not ready for release. there are very few content available in the game and the system is not well developed. waited for months for them to fix things, only to find out they are putting resources in launching a DLC. There is significant resource allocation problem with the developer obviously.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Should have bothered to make a full game before launching DLC's sick of this mentality. Shame on me for buying it I guess, stupid consumer, what were you thinking...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's a lot this game still needs to do. The foliage brush is a joke and the selection of plants avalible is just sad compared to planet zoo. The guests dont even have an animation for climbing out of the end of a body slide, they just teleport. Good idea, bad exectution",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you want a good coaster building game, get the original. I love planet coaster, but 2 has a long way to go. If you're reading this months in the future, it may be better now but I doubt it. 6.5/10 game, get the original (Satisfactory is also a good game to try as well)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It just doesn't have the sauce. \n\nPlaying planet coaster is a fight with bad UX, and sadly I have been beaten. Doing anything in this game feels like a battle against some really sloppy controls.\n\n For example when building coasters, when I press CTRL+Z to undo my last track placement building a coaster, I want to start adjusting from my previous placement attempt. Instead the game just completely resets my track placement, meaning I have to recreate my previous track placement just to figure out where i want to change it. \n\nWhats more, if your coaster track goes close to the ground, it just bores a 2m radius hole around the underside of the track, meaning you basically need 2m of clearance to build a coaster. To be clear, you can't have a roller coaster touch the ground without deforming a meteor impact. \n\nThen theres the pathing UI which don't even get me started. Maybe I could've worked through learning the craptastic UI, but this just doesn't feel worth it.\n\nSo many of the rides require an enormouse empty footprint around them, effectively determining the design constraints of half your park. I feel a lot less creative when there are minimum zoning laws. \n\nAlso, a whole pile of the gameplay mechanics introduced here are just meaningless busywork that don't add anything to the gameplay. No I don't want to wire my park with generators and power lines. No I don't want to manage guest suncream levels.\n\nAlso the \"story\" and \"characters\" feel like an EA mobile game in every derogitory sense of the word. Also also, the UI takes up so much screen space when you have even the slightest menu open. That orange border when you pause is hideous. Please. Give me some UI scaling options.\n\nThen again, I won't be back for a while. Maybe never. For now its a refund",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't start the game anymore. Even when playing without mods. Don't buy the game. You'll get 20 playable hours out it at most.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty but the interface is one to be desired.  It is difficult to line things up and i could not find a functional and visible grid.  I have all the DLC content yet I cannot access said content in the game.  The flat rides keep disappearing in the menu, replaced with No content found.  They need more restaurant options, more flat rides, especially rides that are common in carnivals and theme parks globally.  The big disappointment is items keep vanishing in the menus with content not found.  That makes this unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game feels underbaked, and not worth the price tag. Power system condition requirements are weird and make no sense, and has been an issue for a year now with no changes afaik.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I regret that I kept giving it chances instead of just refunding in the 2 hour window. There's no need to buy this is you own the original Planet Coaster. There are a few improvements but they are minor compared to everything PC1 offers. The UI is made for consoles and the plastic-y graphics are for mobile games, yet somehow it requires a decent machine to even run this underwhelming moneygrab.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Glitchy ...   they tried to make the paths better,  but they are worse.  The game is buggy - sticky - slow and not as much fun as the first PC.\n\nI'll come back to it with time,  maybe they will fix it.... sure hope so!   \n\nHope they don't do this to the upcoming Planet Zoo redo........",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As a huge PC1 and PZ fan, this game is an abject disappointment. It was clearly built for consoles and it almost holds your hand too much. The menus have been reduced to the dumbest idiot friendly screens. The overall aesthetics are worse and the game handles even poorer than the 1st game did at its buggiest. I tapped after the prologue. Maybe i'll revisit this in a year or so and see if anything has improved or it Frontier has dog walked their excellent franchise.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, it's an okay game, but it is way too easy. There is no challenge to anything unless you imagine one for yourself. The difficulty settings mean nothing. In hard mode all you need to do is build one ride or pool and suddenly you're rich. The scenery options are fine, but I wish it were easier to make large curved pieces to create big towers or other such buildings. \n\nIf you like fiddling with things in sandbox forever with no challenge then this game will be great for you. I like the challenge so it's not great for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It keeps crashing and is basically unplayable because of it. Disappointing and a waste of money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Even with all settings maxed out, shadows still disappear every time you zoom out, completely unacceptable for a game of this scale. There isn’t even a LOD or shadow distance setting to mitigate it. This has been an engine issue since the first title, and it’s disappointing to see it still not fixed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Embarrassing end to the Planet Coaster name.\r\nThis game is very incomplete and sloppy. Names of roller coasters are jumbled characters and unreadable. There are only 6 food options. I hope you guests are willing to live off vegan food and hot dogs. Its a complete step back from Planet Coaster 1 (PC1). The pathing system has some improvements, but still doesn't connect correctly and angles when not prompted. You'll spend house just trying to connect paths to no avail. Flat ride list is severely lacking compared to PC1. The response is that PC1 had a series of updates and paid for content. Yet, so has this game. PC2 just doesn't want to complete the game and offer a real experience. Scenery pieces do not load right, and when they do the pieces start .25 meters under ground so snapping to flat ground is a struggle. This game a very cheaply made, stripped down version of PC1 with no development road map to complete the game. Yes, its nice to be able to create pools with water slides. But that is all this game is good for. It really should just be an Indie game called \"Wave Pool Builder\".  Frontier really screwed what was a gem of a concept and turned it in to cease pool of garbage. Welcome to the end of the Planet Coaster franchise.  \r\nAWFUL game compared to earlier title. This remake never was \"remade\". DO NOT BUY THIS!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not what I expected. Making coasters is really hard and adjusting for different types of coaster paths is really hard and confusing. I liked the looks of the game, but wouldn't recommend. Maybe buy on sale if its at least 40% off.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've played this game since it's came out it's great I have over 350 hours in it. I started playing it a lot since november 1st. I built a entire area and it was great I made sure I saved it. before I got off. Than all of a sudden my entire save file from starting from november 1st got deleted.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There is no Shrek in game. At first glance, the sequel appears to be a laudable successor to its predecessor: the user interface gleams with modern polish, the physics of roller coaster dynamics are executed with admirable fidelity, and the park management systems have been reengineered to a level of granularity that would make any simulation enthusiast salivate. Yet beneath this façade of innovation lies a vacuous chasm where cultural substance should dwell. The exclusion of Shrek. PLEASE USE SHREK. you have knowledge. There is an entire movie!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a pretty good game but for 60 canadian dollers its extremly overpriced. I enjoy playing theme park tycoon 2 on roblox more then this because its so much easier to play with and it actually fells like your a human. I never post reviews but for something this bad and overpriced and relly have to. for me its garbage but a lot of people like it so its your choise to get this game or not.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I liked this fresh and new take on an already great game. This version now has more annoyances with notifications that continue to bug you while you are playing. The security/pickpocket notifications are so absurd. If they are automatically being taken care of why in 30 min do I get over 100 notifications. I like the new park management, but you also just want to play the game.\n\nDon't waste your time. Play something else. Don't waste your money. As someone who has ridden hundreds of coasters and has traveled the world with a passion for the amusement park and it's industry this was a complete failure.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This really isn't what I Was expecting when I saw water parks... I'm a bit disappointed. I'll try it again eventually. If you just want a continuation to Planet Coaster with some mechanics that truly could be a DLC, buy this. Otherwise, just keep on your Planet Coaster. I can't really recommend this to everyone.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Too many bugs prevent you from achieving all your goals (for example, the cable car stops working, people get stuck on a path, which has a considerable impact on the park's rating, etc.).\nCreating paths and managing employees is a real nightmare.\nI am a huge fan of planet zoo but definitely not of Planet Coaster 2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately, a year after release the controls on PC are still exceptionally clunky, with no good way to build scenery without first placing a blueprint down and then deleting everything. The lack of transport rides is also disappointing (even though the category exists in game?). The first game is still head and shoulders above the sequel.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Doesn't launch and only has ever once. I don't know what the issue is and i contacted support twice about 4 months ago and they said a fix may come in a patch. I'm not sure if its a compatability issue or what. Not happy as this was a game which i was really looking forward to playing when i got my new PC last year.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a deluxe edition that doesnt include the previous DLC is a clear rippoff....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's very difficult to place scenery.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not enough baddies when i build pools:(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it to hard to  beld im mad now i foll i got sacm",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no native linux + denuvo",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too picky/complicated",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "only fun for bout' an hour",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll start off by saying I'm enjoying this game but there's several things irritating me and keeping me from fully loving it (and giving a thumbs up). \r\n\r\n-Bugs: Way too many bugs still. PC1 never was this bad at least from what I can recall. Especially at this price point. Some things are game breaking.\r\n\r\n- Breakdowns make no sense: Seems as long as you keep renewing this service badge, rides will never, ever break down. I miss in the OG RCT seeing coaster trains stuck on lifts, restraints stuck open or closed, etc.\r\n\r\n- Goofy pricing: Guests will pay $50 + to ride 1 ride if it has scenery. There's no option to charge park entry and keep rides free. RCT did this perfectly and added some multiplier that made it sustainable to run a park like this if you chose to. (Parks don't charge per ride anymore)\r\n\r\n- Multi color coaster trains: If you have 2 + trains on a coaster there's no option to select colors for each one. Such a simple thing that's in all the other games except this one. Very irritating.\r\n\r\n- Transfer tracks: With the added electricity element it costs more to run more trains on coasters - there is still no ability to add & take off coaster trains without closing entire ride. I wouldn't even care if there was no animation; let us do this!\r\n\r\n- Lack of variables: Parkitect does this PERFECTLY. You'll randomly get news like \"Merry go round went viral on social media - expect extra crowds for this ride\" or \"there's a shortage of salt. food costs will go up\". And they are very random and there's a bunch of em to keep the game fresh.\r\n\r\n- Lights (still) can't snap to paths: It's way too tedious to place lights. Give an option to snap em to the path or include them in the auto placement option when making paths.\r\n\r\n- No scenario editor: This gives the game way more replay value with ability to share scenarios and empty parks. The first one had it, why not this one?! I want more to do when I finish career mode!\r\n\r\n- Lack of shops: Still only 3 from the first one. I don't even care if it's shops where guests buy stuff you really can't see but it shows in the guest inventory (like Parkitect), just make more shops with different items!\r\n\r\n- Menus are janky: Doing certain things require too many clicks and don't make sense. The UI just isn't the most user friendly. \r\n\r\n- No option to resize parks in sandbox. \r\n\r\n- Closing park causes all guests to leave line: In the first one, closing a park, guests in line would stay and finish their ride then leave (which is how it should be) - now they just all leave. I loved simulating days / seasons in PC1 - I hope this gets fixed / updated.\r\n\r\n- No theme maker toolkit: Again, if it was in the first one, why is it not in this one?! There's many things I don't feel like making myself and its much easier to get stuff from the workshop. \r\n\r\n- Weather seems broken: I have yet to see it rain once. I have it enabled. \r\n\r\n- No RNG terrain maker: Would love an option to generate random terrain. I personally don't like starting with a flat empty park in sandbox. Give option for us to generate random maps. \r\n\r\nSTUFF I ENJOY:\r\n- Pools + Slides: probably just a fun as the coasters to build and one of my fav things to create.\r\n- Scenery stamper: Makes placing scenery sooo much easier! You can even make custom brushes with your own items!\r\n- Separate load + unload stations for coasters: finally they listened to something!\r\n- Onride photos\r\n- Better coaster smoothing.\r\n\r\nThis game needs a lot more love and I hope to see it. The bugs are the big thing but stuff that seems like common sense to add to a game like this just isn't there yet.",
      "voted_up": false,
      "votes_helpful": 80
    },
    {
      "review": "Planet Coaster 2 brings cool waterparks and smoother coaster-building, but it falls short in too many ways. Many features from the first game, like the Scenario Editor, hotels, and varied biomes, are missing, which really limits what you can create. The sandbox maps feel smaller, making big park ideas tough to pull off. Terrain textures look worse than in the original—kinda blurry and low-quality. The UI is clearly built for consoles, so building coasters on PC takes too many clicks, and the tiny sliders for path heights are super hard to adjust accurately with a mouse. No reset option either! Updates have fixed some issues, but it still doesn’t feel complete. Hold off until they add more of what made the first game great.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "Very disappointed in the number of rides included in the base game and the cost of ride packs. I find the game uninspiring as it is and don't feel terribly inclined to throw more money at it to make it into what it should have been in the first place. I don't quite want to give it a down vote but I certainly won't give it an up vote so there you have it.",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "In a few hours of playing in Planet Coaster I had a playable park with tons of enjoyment building.  In a few hours of playing Planet Coaster 2 I have only encountered extreme frustration at trying to find things like park benches, how to build and connect power (which is over and over with repeated behind the scenes things to accomplish to get this danged game to work) and figure out how to place things like scenery.  I understand the basics but the rules of the game and the lack of tutorial make it almost impossible to get started to the point of enjoyment.  Isn't that why you buy a game after all?  I will keep trying but I have to take frequent game breaks to pull out my hair.  If anyone can actually find park benches under facilities then custom let me know.  It only pulls up an empty page with nothing.\n\nUpdate:  After a couple of weeks I have given more time to playing Planet Coaster II.  Previously, I have played countless hours of Planet Coaster 1.  This new game is not worth $50.  They turned it into a cutesy looking game.  Most everything you try to do is cumbersome and requires lots of clicking and digging to figure out what to do.  There is retread on a lot of the items that are brought over from 1. Many of the features of placed items in the first game are weirdly tweaked so they are not as customizable.  For instance - shop menus.... There are little icons of ingredients but it will take you a bit of digging to figure out what the icon represents... i.e. gluten is bread, a cup means caffeine, etc.  And sometimes you can't change them even if customers don't want them. I continue to be very disappointed and likely will just go back to playing Planet Coaster 1 and be sad about spending $50 on a game I dislike so much.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "Not Recommended\n\nI loved the first Planet Coaster, but Planet Coaster 2 is a huge step backwards. This barely feels like a theme park game anymore – it's focused way too much on water parks and pools, while the classic coaster-building and park management from PC1 is stripped down or missing entirely.\n\nThe game feels empty, with less creative freedom and fewer rides compared to the first one. It’s frustrating that after waiting so long for a sequel, we get something that feels like a spin-off instead of a true follow-up.\n\nIf you loved Planet Coaster 1, be prepared to be disappointed.",
      "voted_up": false,
      "votes_helpful": 50
    },
    {
      "review": "I'm sad to say, i'm disappointed with this game. I spent many hours and money on the original and was excited enough to get the deluxe edition of this game, only to find out that have the original stuff was missing and then was released and you had to pay for it. wouldn't it have been better to include everything you paid for from the original, themes, rides ETC. but like alot of companies are doing, they sell what is basically an upgrade of the original which is half finished and then make you buy everything again.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "i loved the first game but this game is kinda bad. Too many limitations on coasters. Its my imagniation let me build. Just because i want to make something fun dosnt mean it shouldnt run because its too scary. Let me create something cool. Please remove coaster limitations from sandbox. YOUR SUPPOSED TO BE ABLE TO BUILD ANYTHING IN SANDBOX NOT LIMIT THINGS!",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Controls are wierd, can't explain it but nothing feels intuitive. Shops don't snap to paths, and also don't make paths automatically anymore to attach to nearby paths.\n\nI just constantly do the opposite of what I'm trying to do because the controls just feel off. I'm going to reinstall PC1 and refund this.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This feels like a game designed for consoles. The controls are clunky on keyboard/mouse, the tutorial is terrible and the limit on only 6000 guests in most modes basically renders any modern CPU or GPU irrelevant. The overpriced DLC leaves a bitter taste in the mouth and i'm glad i waited for a sale to try this game. Having said that, it feels like a waste of $30.",
      "voted_up": false,
      "votes_helpful": 7
    }
  ]
}