{
  "positive": [
    {
      "review": "Fun game, worth it on sale.\r\n\r\nI'll come back to play more in a new season similiar to poe/poe2 if i have some build i wanna try in mind.\r\n\r\nUnique items have less fancy build defining effects, most of the customisation happens in character skill tree (kinda like skill gem effects that boost aoe/dmg/etc, with one node that changes how the skill works you can choose out of 4).\r\n\r\nSeason starts can be unplayable for a day or more. Local play is possible. Endgame.... Idk about it, I've never reached the 'uber' bosses, i'm inclined to play hc and stop for that season when i die.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I'm a big fan of the loot system in this game as it fries my neurons over the span of a season. so yes fun, give it a try.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Dopamine hit go brrrr. Classes are fun and all play differently. A pixel Diablo-like that intensifies my alt-aholic tendencies. A nice cozy way to worry if your build can cut it doing the content. I have been enjoying this with a friend and solo. After dodgy mtx transactions moves by the devs in the past, they seem to be correcting their behaviours going forward and have made more classes free with skins for the players who have bought those classes in the past. Totally recommend this title.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been playing this game since 2015 and it's not the same game as it was then. They have improved and changed the game so much for the better, it now has this Diablo/Path of Exile feeling to it and soon they will even add in a huge skill tree. If you're looking for a fun game to just run around and kill monsters and lay back in your chair with a controller I highly recommend this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game\nBut the online maps are extremely boring and there nothing to do\nThe local game isnt this incredible game but its quite fin so i suggest you to only but it on sale as it not cost too much and its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "buen juego.. buena historia.. mejorando dia a dia.. esperemos la s9 a ver que tal todas las cosas nuevas..-",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and keeps getting better with each season",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, devs really care for the game and keep improving it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has ups and downs. Also, this game anticheat sucks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "banger game if u like d2 or poe or anything. Itemisation is fun, builds are cool, grind feels good. the mixed reviews are weird imo - some drama relating to it being less ARPG like in the past or something. Some characters are paywalled, which isn't great I guess, but they go on sale frequently. Everything else is cosmetic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game but my problem and only problem with the game is that it lags when i have my map out and also i didnt get the level 10 and so on achievements for some reason.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Personally i never reviewed any game. but this game, i give an exception.\r\n1. Low end PC? No prob.\r\n2. Grind fest? not really.\r\n3. Difficulty spike? for beginner it is.\r\n4. Is graphic good?. go play FFF7R.\r\n5. Game is very forgiven.\r\n6. Sountrack is ok.\r\n7. A lot of class. Yes. i mean it.\r\n\r\nLast thought, want to buy?. wait for discount. it worth it fellas.\r\nThanks for this trully REMARKABLE game DEV and team.\r\nWill always be looking forward to the awesome update in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For just over a dollar this game is 100% worth it. \n\nBased on what I've played so far, it's worth the full asking price.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good ARPG for people who enjoy the older fast zoom zoom style of ARPG's\nendgame your blasting through zones very quickly looking for loot.\nalso has some funny skills and builds to try out with a solid variety but does sometimes have issues with balance but overall every class can do everything in the game.\nis often on sale for incredibly cheap prices that you can easily put 100's of hours into so would recommend it especially at those prices where you can often get the full package on a sale for like £10-15 that includes a ton of skins and every class.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started playing this game after being introduced to it by a friend, a close friend. Since I think season 1 or 2. The developer is somebody special who really deserves a lot of attention for people to understand what he really does. I hope the best for him, and I believe this is one of the greatest games I have ever played. thank you so much for the experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game has come a very long way since the negative reviews were accurate and they started removing character DLCs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game, specially with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "started bad, now is good. dev can be sus but the game's good.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "waiting for season 9 to sink even more hours into this great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] IGNORE THE BAD REVIEWS, ITS PEAK, TRUST [/h1]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I came into this game years after it was released from a friend and at first I didn't 100% enjoy it compared to Diablo, POE, Last Epoch, but I gave it another shot with the help of some content creators and began to really enjoy the game.  The simplicity, art, and game design is welcoming and fun.  It does seem that only a few characters can do most of the content which puts a ceiling on some of the end game but overall I have enjoyed it.  I rotate Hero Siege with the other games mentioned above for a nice change of pace",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "still love it !\na lot has changed, actually most of the game is different now, with maps that aren't random, without the labyrinths and puzzles, but still with the same vibe and feeling of being unstoppably strong :'D\n\nif you like diablo, or PoE, but in 2d with pixel art, you'll like this aswell <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun pick up and play game with out having to commit long time to play. Lot of options for rpg players to pick from classes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Every time I turn around it seems like this game has become a new game.   Can't deny that does have me reinstalling it to see what it's like now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is it fun? Yes.\n\nDoes it constantly pop open windows to the steam store, thereby ensuring that I will never buy any DLC content for the game? Also yes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is still updating and it got so much fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "гра цікава, але місцями реально нудно",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are 30+ wanna chill and have fun... This is your game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is good game. waiting for next content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "looks like Diablo 2. awesome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "huge fan of this kind of games",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "GREAT GAME VERY GOOD FRIENDS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can’t wait for Season 9 ...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "freaky . 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thats A life",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sarıyo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Хероичная осада, то шо надо =)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ambatakam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "oke",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Let's GOOOOOOOO",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "FUN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "uuuuuuuuuuuuuuuuuuuuuuuuuuuuu",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Si",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "why not))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "вцфцвфвф",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "U",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IMO the best ARPG on the market, it's as if D2 had kept getting updates and actually cared about it's player base. Lots of classes and lots to do, the devs seem to care but the player base is pretty toxic. If you play with friends or keep away from global chat it's a fantastic time. \n\nTLDR\nIf you like ARPG's this is a master class on how to make a good game, every season brings new and engaging updates. Just be sure to stay away from global chat.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Patch 2.0 is bad. Destroyed the game.\nOn the good side they allowed old version (for local play at the moment) in latest patch.\nHopefully they'll see their mistake with 2.0, accept it as failure, remove it from the game and move from older version.\nI understand that they spend time in development of it and don't want that time be wasted but a failure is a failure.\nRecommended for single player mode in old version, not recommended for 2.0.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Almost everything is behind a paywall.. inventory, housing, character classes, Skins /etc.\n\nFeatures that should be standard feels locked away\n\n\nStill, the core gameplay can be surprisingly entertaining, and there's potential if the dev ever decides to listen.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "I never played the game back in the day and I stayed away for along time due to bad reviews, I wish I would have tried it earlier. Its d2/poe so if thats what youre looking for you will enjoy this game. Added to my rotation between PD2, and PoE.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "In my opinion, it's the ARPG with the most potential right now. I've spent a lot of time since 2.0's release, and it's clear the developers are adding a lot with each season. The only downside is the \"present\" option to play with others. Early in the game it's not a problem, but in the endgame, the number of effects makes party play impossible.\n\nMost of the negative reviews stem from the change in gameplay style. I played the first version (still available in single-player), and it was mostly a bullet-hell game, but now it's more of an ARPG. In my opinion, both versions are very good.\n\nI recommend them.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Fun game, worth it on sale.\r\n\r\nI'll come back to play more in a new season similiar to poe/poe2 if i have some build i wanna try in mind.\r\n\r\nUnique items have less fancy build defining effects, most of the customisation happens in character skill tree (kinda like skill gem effects that boost aoe/dmg/etc, with one node that changes how the skill works you can choose out of 4).\r\n\r\nSeason starts can be unplayable for a day or more. Local play is possible. Endgame.... Idk about it, I've never reached the 'uber' bosses, i'm inclined to play hc and stop for that season when i die.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I'm a big fan of the loot system in this game as it fries my neurons over the span of a season. so yes fun, give it a try.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I AM ONE OF THOSE who got dismayed by the sheer ammount of negative reviews for this game.\n\nFor a long time i thought this game would be nice to play but something under 50% reviews just kept telling me to stay away.\nAt long last, once i saw the sale and the bundle, I took up courage to play this game.\n\nGot swayed by my friend who has played this game and kept telling me it is like Diablo but better...\n....and i would have to agree, so far i like this game more than any Diablo game.\n\nAlso some of the positive reviews genuinely seemed to like this game...\n...so what`s up with all the negatives going to the extreme opposite end...\n...was the old version really that much better, are the devs really that bad...\n...I don`t know really.\n\nI can say this about monetization though, yes, it is kind of all over the place but i also find that once you buy the Bundle on sale with maybe a few addons, you have pretty much a full game for yourself, with lots of class variety, which will keep you occupied for quite some time, therefore I think it is worth the price of about 1 big game. And once you are out there killing stuff and looting, you will mostly forget about it.\nAfter that it is just how much you are willing to spend on cosmetics, really. You do start with some auras, pet skins and some others, honestly that seems enough.\nAlso you do not need to buy that many stash tabs, if any. \nIf your goal is to get to 100 with each character, you can do that just fine.\n\n\nTLDR; If you think you`d like this game but are freaked out about negative reviews, don`t be, get the bundle on sale, with \n          ONE extra inventory space and you are set to have fun for hundreds of hours.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Dopamine hit go brrrr. Classes are fun and all play differently. A pixel Diablo-like that intensifies my alt-aholic tendencies. A nice cozy way to worry if your build can cut it doing the content. I have been enjoying this with a friend and solo. After dodgy mtx transactions moves by the devs in the past, they seem to be correcting their behaviours going forward and have made more classes free with skins for the players who have bought those classes in the past. Totally recommend this title.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly played too much of this to say its bad. Sure there can be improvements but this is a very good game for those who enjoy the genre. It has a easy to understand loop once you get into it and also for those looking for dopamine hits this is a very good game. Just open youtube and chill, the community is a bunch of stupid mofos including the mods and devs but thats also a feature tbh. Anyways /roll /roll /roll",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Well... I have been reading a few of the reviews on this game and gotta say y'all got something wrong in the head.\n\nThe game has a smaller base cost so people can actually try it, not like other dumb AAA games that launch unfinshed and filled with bugs at 90$ prices. The cost just allows the devs to keep working on the game since there is no big investors or whatever else bigger companies have. The whole game (bundle), as in all the classes and the last *not required/irrelevant* act, costs somewhere around 30-35$ at the time of this review (incl. the base game), this while on sale which is like 4+ months of the year. The price can be even lower too, I bought the bundle for 17.21$ back in March and I'm only missing the last class (Bard).\nThe microtransactions everyone is freaking out about are just skins, by which logic literally any \"free\" ARPG on steam is filled with. And isn't pay2win like some mobile games *cough cough* Torchlight *cough cough*.\nAnd about the inventory expansion and bank/chest tabs, it's the same with PoE, where without the currency tab which is like 10$ you legit can't play the endgame as your currency will fill all the free tabs very quickly. On here tough I never ever filled more then the 2 basic inventory tabs unless was picking everything (which would be dumb to do), and you can very quickly drop a portal back to town and deposit whatever you want to keep. I do have an extra one from the bundle but mostly only used it to keep 1-2 items to switch in case I ever wanted to do so. And for the bank tabs you have 1 entire tab PER CHARACTER, on top of the shared one, so technically you have 22 total tabs since you can make 21 characters when buying the game. And for people complaining about being 21 character slots while there is 23 classes, believe me, you will never play all of them at once, and like in any season based ARPG you will play 1-2 maybe 3 classes in a season then at some point you will have to delete the classes from the \"Standard\" server. But with campaign being so quick this will never really be a problem.\n\nNow for the actual review:\nThe game has a nice and quick campaign and you can play with up to 3 friends (4 total/game), and if someone is willing to help you rush it you can be done in ~30mins, this is especially nice when you want to grind the endgame and not be stuck on only 1 class (like PoE 2, where is annoyingly long imo, though nice).\nAnd like any other ARPG ever, the endgame just consists in running something on repeat, whether they are codexes, boss rush/farm, dungeons or whatever else is there.\nI personally enjoy all types of ARPGs and love this grindy aspect, where your heart skips a beat when something super rare just dropped, or enjoy seeing myself rich on the trade server.\nThe class diversity is also really nice, you have a lot of classes with plenty of skills to choose from, it's basically impossible to not find a class you love playing.\nI give the game an easy 9/10, and I know the devs just keep cooking more and more cool seasons and updates.\nGood luck and have fun gamers!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This is a great arpg. \n\nThere are some weird UI choice that takes you out of the game to pay for a random tab which honestly feel terrible ngl.\n\nOtherwise it's a fun game that you can sink a lot of time to min max your character.\n\nThe current endgame does need a more fun approach. The codex are not fun, have less pack size then satanic zones, and just overall feel unfun to roll and run. The time limit is also very unfun to deal with. Because you end up having to lock in for 25min no breaks allowed. Not cool.\n\nA lot of classes are very unbalanced and there are no mid season patches to balances them out which also feel terrible.\nThe current season has like 4-5 classes that are okay to run the maximum difficulty, the rest is in the gutter and deep in it. Which feels terrible because all classes are Pay to play.\n\nWith big improvement in communication (the way some of the devs talk in the discord is ODD to say the least, very unprofessional) and endgame, this game could become incredible.\n\nCan't wait for next season either way, fun game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I almost never post any review, but this game is a gem. devs are improving the game for 11 years now its not your typical game that just fade on early access. its keeps on getting better.\n\nif you like ARPG games like Path of Exile, Diablo, GrimDawn, well you just found another that's actually worth your time :).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So far the game itself has been fun. Talking to my girlfriend about it, going to try to get her to play. \n\nI understand the dev may have made some questionable decisions here or there but that's not what my review it about. \n\nPersonally I believe you should wait for sales to get the classes, but on a base level I don't find them to be over the top. Convenience or additional classes. The game itself is 8 dollars and for the amount of content that alone is worth it. Look up review and get a class you like or wait for a sale and get them all\n\nOther than that get a couple of additional tabs and be good if you like one of the included classes. \n\nI agree that the additional classes should be included but overall I think for the low entry price the game is fine.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I have hundreds of hours in the game. Well worth the price. Bought the characters on sale, got a few inventory slots, and I didn't find any unreasonably priced. \n\nA lot of really, really butthurt people that the game changed from what it was...years and years ago. I would say it changed almost exclusively for the better. If you like autistically maximizing your character and arpg mechanics, then this is a solid game, and really the only one that's doing it in this style.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Having played all the ARPG's at this point , this ones not bad . Definately worth it for $7 , it's abit annoying to having to pay for different characters ( base game has 6ish characters and theres 20more at $4 each ) .\n\n  Overall the game plays nice , but simple.\n alot of gear choices which is nice .\n\na good game for $7 , worth a try if you like bullethell/horde games and want a bit more character building / gear .",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been playing this game since 2015 and it's not the same game as it was then. They have improved and changed the game so much for the better, it now has this Diablo/Path of Exile feeling to it and soon they will even add in a huge skill tree. If you're looking for a fun game to just run around and kill monsters and lay back in your chair with a controller I highly recommend this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game\nBut the online maps are extremely boring and there nothing to do\nThe local game isnt this incredible game but its quite fin so i suggest you to only but it on sale as it not cost too much and its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, devs really care for the game and keep improving it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has ups and downs. Also, this game anticheat sucks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "banger game if u like d2 or poe or anything. Itemisation is fun, builds are cool, grind feels good. the mixed reviews are weird imo - some drama relating to it being less ARPG like in the past or something. Some characters are paywalled, which isn't great I guess, but they go on sale frequently. Everything else is cosmetic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game but my problem and only problem with the game is that it lags when i have my map out and also i didnt get the level 10 and so on achievements for some reason.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved the old necesse vibe mixed with the diablo 4 and very cheap for good quality game and is cheap with its characters as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An unholy amalgamation of every popular ARPG to be released since Diablo 2, brought together into a fun little package. Definitely recommend, especially when looking for something to play during the off-seasons of your other ARPGs.\n\nOnly complaint is paying for classes, but the game goes on sale often and you can pick them all up for cheap.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great, simple addicting ARPG with a lot of inspiration from the all time greats like PoE, Diablo 2 and others. Devs are quick to pump out content.\n\nOnly negative so far is that the build diversity is a bit lacking and could use a better endgame system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best pixel aRPG. Tons of build potential for those looking to experiment. Devs are still active and making great updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game can be fun. i usually play to turn my brain off and pass time. but probably won't play until next season. recent false ban drained my will to play the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been with the game since the beginning, way before the \"2.0\" sprung up and I still play every season to some extent. Hero Siege definitely has its' ups and downs and the constant changes sway people away from the title, but it has always been fun to me. It's one of my fallback games for when I just want to shut my brain off and grind away.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoyable game - there's a lot of optional DLC's and characters, but plenty of hours of enjoyment for the base game and classes. \n\nI've sunk far too many hours into the game - It's like a casual POE. \n\nI still don't understand how defence works... or a lot of the mechanics, and I've never gotten a character to max level. But, every season I create a new char to sink a dozen hours in or so. (In truth, about eight chars on Hardcore and die at max level 50...) \n\nI recommend the game for anyone who doesn't feel like they need to own everything related to the game. For £6.69 it's a bargain. \n\nIf you buy ALL the DLC and Optional stuff in it - probably a bit expensive for what it is. \n\nI got the Shield lancer DLC after realising I'd spent 100 hours in game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hero Siege embodies everything I want from an arpg. It’s nice to see that with each season the developers add something new to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Devs are constantly working on the game for a couple of years now. Maybe some changes are questionable, but atleast they try new things out and the game stays fresh every big update and they communicate most of the changes in their Discord, which is also very active. One of my favorite games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game since season 2 or so...and it wasn't to great, took a couple years break. Started to notice the newer major updates and stuff so decided to give it a try again, and to my surprise its SO much diff then a couple years back. It has a entirely diff system, animations, way more balanced classes, more items, much better sprites. It seems like the devs work hard and listen to the community. So id say if you are deciding to play, those older reviews are entirely irrelevant to what this game is now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hero siege has been on my watch list for a long time and when they announced the PoE skill tree coming to the game in Season 9 i got hyped. it looks amazing and i cannot wait to see the ether tree (Atlas Tree from PoE). so i played thru the game and got to max lvl and Hell 5 and its really fun especially with the LE skill trees they put in. the player AH is pretty active too and i like that. also the micro transactions are not as bad as people say. yeah you have to buy each class and yes you have to buy stash tabs. . . but that it it. they give you alot of classes for free and if you find one you like then get it for 3 or 4 bucks. at least give it a try and just buy the base game and make your own opinion of it especially if you find the art style appealing. my rating so far it about a 6.5/10. possibly an 8/10 with the changes in the upcoming season 9.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hero siege is an amazing ARPG. It has great replayability, builds, classes, farming methods, etc. Its very comfortable to play, specially with WASD playstyle. 100% recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun diablo-like(more poe-like) game, maybe a bit too buggy in some places, but it doesn't really matter while you having fun.\n\nPaid content is not necessary, you can play game perfectly fine without bying anything, but i recommend at least buy dlc, also whole bundle pretty cheap on sales.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive played/followed this game for many years. they are constantly evolving the gameplay and it is truly amazing. so much fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great ARPG that combines elements from other popular titles across the genre.  The developers are great at adding content to the game each season and it's always a blast to play!  I would highly recommend any ARPG fan to check out this rework of a classic genre.  I look forward to blasting in this game for many seasons to come!  Also, just kudos to the devs for making such a fun game.  I look forward to new seasons in this more than some of the other 'bigger' titles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I never played the game in its original form, I have only played the ARPG version. Drama and DLC concerns aside, which you can read about in other reviews, this is a fine ARPG. I really enjoyed my time with it and am looking forward to season 9!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and addictive game. Ofc there will be issues as the dev team is small and they cant get to everything. \n\nTo those that say there is a lot of DLC and that you have to buy characters: there are frequent sales and you can find the game for cheap very often. \n\nDef worth the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game, scratches my itch on diablo 3 pushing / competition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLDR:  The reviews about the devs are unmerited.  The game has a lot of depth to it not visible at first glance.  There's a lot to do in the end game.  There are 23 classes all VERY unique from one another.   For first time players, remember to equip a pet, they pick up a lot of items for you.\n\nAll these negative reviews about \"Toxic Dev team\" is ridiculous.  I've spoken to the majority of the Dev team in the discord and they have always been responsive and listen.  Several QOL features I asked them about were added the very next season release.  That being said, on to the actual review.\n\nHero Siege is a deceptive game.  It used to be a completely different genre long ago and has since become a full fleshed out ARPG.  There are 23? classes, each with their own very unique play style.  Each main skill has a small passive tree that has small nodes as well as 4 unique large modifiers that in most cases completely changes how the skill functions.  \n\nThe gearing is fun and pretty straight forward as far as base stats go, but there are things like triggered skills, passive abilities, whole new usable skills etc. that get mixed into the gear as well.   There is plenty of gear to get you into endgame, and then a TON of chase items to go after from many different sources.   After you get what you were looking for, there are several ways to add to and modify the gear using crafting items and armor imbuement in the long run.  It has a way of making your character feel complete and ready while also leaving you room to constantly upgrade.\n\nThere is a Diablo 2 Esq rune word system for those familiar.  Socket specific runes into a white item in a specific order and it will convert it into what is essentially a unique item. There are a LOT of runewords.  The nice thing extra on this, any stats on the white item are also added to the rune word item.  It is possible to get some really nice high stats on white gear, making those items, despite being the lowest rarity, worthwhile to keep for yourself or to sell on the auction house.\n\nThe endgame has consists of boss farming, uber bosses, Wormholes with infinitely scaling difficulty, Chaos towers that are essentially 10 floor survival levels with select-able monster/loot modifiers, Chaos zone farming (after beating the bosses on hell+ difficulties chaos zones appear with unique modifiers on them. They can also be hand crafted), challenge dungeons, , rifts to random increased difficulty zones, a shadow realm with a special vendor and special boss fight, and even keys to special levels with their own unique loot rewards.  There's a good bit to keep you going.\n\nI've played every major ARPG to speak of with thousands of hours in POE1, POE2, Last Epoch, etc.   Hero siege, despite looking more like a cartoon at first glance, definitely holds it's own against all these titles.  I actually find myself going back to it more often than all the others with their most recent updates.   Coming up in December they are even adding a massive 1100+ node passive tree and even a loot passive tree. I am HUGELY looking forward to it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Jogo bacana, bonito, formoso, divertido, vale a pena cada centavo, me lembra o saudoso diablo, recomendadíssimo...",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is it. Simple grinding with variety of classes... I literally am mesmerized by the very possibility that tiny RNGs can reward you worlds....",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I don't mind all the various DLC's, classes, inventory, stash tabs, unique tab, expansions. I really don't mind supporting a game that offers such options. BUT...\n\nBut they encourage people to participate in seasonal content, and at the end of every season they decided that it's okay to wipe 90% of what you collected during your playthroughs. Because you are only allowed to keep a single \"personal\" stash tab and your very limited inventory.\n\nThat's arguably a very bad design by itself,  but the worse part is that at no point and no where it is being clearly communicated that this wipe happens and that you only get to keep whats in your inventory and that one personal stash tab.\nAlso this is the same issue with the \"unique\" stash tab where your purchase a storage where your are able to store 1 of every unique item, and well you guessed it right, if you play in season, those get wiped as well. (according to their discord)",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "It was good in 2016 when I bought the 4-pack and played local co-op with my friends. Game has gotten worse and worse over time, would've been better if the game stayed in the form it was 10 years ago :(",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "Banned from the steam forums for making fun of their dogshit DLC policy, most recent update is that they're changing the DLC policy because its making them look like disgusting pieces of shit to the general public. It's so funny bc everyone insults them for it under literally EVERY post they made until they actually couldn't ignore it. It must have been hurting sales pretty bad if these greedy losers are giving out anything more than 12 cents for free and not making it some giga MTX package. \n\nDon't let ANYONE tell you that these loser devs shouldn't be mocked and bullied for their dogshit unethical anti consumer practices, it gets results more than just permasucking them off\n\nreality and humor are toxic and ragebaiting to these slime but 100 6 dollar DLCs is completely wholesome and you have to be nice to us because we \"just didn't have a plan\" for 10 years in a row \n\nhalf expecting the dev to comment under this with some goofy doublespeak defense about how you're \"moving in the right place\" and how that should be rewarded with positivity.\n\n People like you only make the \"right\" decision when it aligns with your bank account, if you thought you'd be economically rewarded for it you'd just keep banning anyone who shit talks it and collect 6 dollars for your 1 hour commission pixel art shitshow powerscaled garbage class that 50% of people steal anyways bc your code is so dogshit.\n\nWorst 7 dollars of my life tbh, complete dogshit game, ugly, derivative, genuinely would rather play chronicon by slapping my penis on the keyboard than this with every class in the game\n\nAlso I forgot to mention all these hack devs just steal the runeword system from Diablo 2 for no reason, if it was Nintendo you guys would be scrubbing toilets at their HQ to pay off the debts",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Dev try to DLC milk a paid game like a F2P fortnite game.\n\nAlso, not even what we originally paid for. Dev 180 changed the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is ok - repetitive but kinda fun. I decide to go for the thumbs down because this could be a good relaxed H&S for the Steam Deck, but they decided to add the worst imaginable controller support and call it a day. I have high hopes for the upcoming season though, so I'll update my review if they fix the controller support.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Servers disconnect every couple mins, dlc extortionately expensive for what you get, seems like it tries to mimic every other arpg like diablo/poe by taking their mechanics and putting them in but the game still feels shallow and boring",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Toxic Monetization practices\n\nI promise all the other reviews saying the same thing aren't lying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Devs are begging for players to edit their reviews for thumbs up. Maybe I will when they optimize the game and actually remove easy anti cheat. The restructuring of their monetization and PoE-style stat increases are nice, but they mean nothing if I can't play.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Horrible, egregious, slimy, uncanny dlc bait. There are literally buttons in the inventory designed for you to accidentally click so it drags you into a buy window like a fucking mobile game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lazyness of these devs has no limits. It's 60 days after season start and banner on game says season has started. It's not just only little details. Engaging with devs in discord is just sad, and the product is not better.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I would recommend not getting this game as the developers say there is no p2w features but it is riddled with p2w features.\n\nEdit: This developer tried to justify the p2w features as not p2w. To anyone BUT the developer there is p2w features like any mobile game out there. It has p2w and a monthly subscription with $150+ dlc. If I could give it a worse rating I would. Thank you for reading my TED talk.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "long forgot about this game but dev is asking for good reviews when they're just toxic, joke",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Game has been out since 2014, tried it for the first time in 2025 during a deep sale, with an open mind. \n\nCombat is rather dull, repetitive, or could say brainless even \nClasses a bit simplistic, not many skills, you'll use 1-2 skills most of the time. \nGame does not seem that dynamic, whether its monsters, map/terrain mechanics, in terms of 2025 standards.\nMaps don't have much immersive feel, story basically non-existant\nCould say the \"game needs a lot of work\" but it's been out for more than 10 years, so don't hope for massive playstyle changes. \nPoE2 blows this out of the water, but it's more expensive. As for 2D alternatives, I find the combat, UI, dynamics, cohesive play, etc. much more satisfying, reactive and modern in Heroes of Hammerwatch 2 and Slormancer. \nDid have high hopes for this game, but it's outdated, despite the updates each year (mostly in the cosmetic store) it hasn't managed to keep up with modern quality standards. If you get this on the 1 dollar/euro sale, try for yourself, but I wouldn't buy any of their DLCs before a good 5-20 hours of play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's kind of impressive to directly copy so many things from Diablo 2 yet still manage to make such a boring game.\r\nWhile the itemisation is interesting due to all the aspects taken straight out of mainly D2, the visual and audible feedback makes the gameplay loop still feel bland.\r\nMore importantly, the developer's greedy business practices are enough for me to never want to recommend this game. The more you see ingame and the more you read from other people the worse it gets.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I could write an extensive review about this game, with the previous and current, pros and cons... \nBut instead I leave you with a famous quote that perfectly encapsulates my feelings for Hero Siege.\n\n\"Look how they massacred my boy!\"",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Dev/creators think they've created the best game to have ever existed, proof? Check the several recorded times these people have negligible to the people who play their game. Also, the ceo a while a go said some racist things about a certain type of people, funny coming from some kid who barely washes his hair, with a high bmi and a lip piercing, the superiority complex on this boy is unmatched.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I don't remember how I ended up buying this game. All I know is it reminds me of this mobile game I used to play from 2010 or so. Very boring and very dull.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It was nice game however currently it is not recognisable. Problem isn't coming from me either. So, you might say you didn't \"recognise it\", but that's not the case. \r\nIf I were to critisize it as it currently stands, it feels like a different game altogether... \r\nBy adding \"the season\" it has unfortunately become something of a abomination locking away all its content. This has left me feeling rather disappointed. \r\nGame was legend, everyone knew its name at the time, it \"was the game\" you play when internet was down or for fur in late at night . Damn, what have you done to my baby...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "used to be good. Now they collect your info and they use the worst kernel level anti-cheat",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "So boring and ugly, bad mobility, horrible graphics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're tired of playing PoE 1 or 2, go play Hero Siege. You'll forget you were tired and you'll go back to PoE really quickly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unfortunately i can't even register an account to play online.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pentagram killed it for me. \nError messages never got addressed. \nForgot log-in. \n0/10",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Was great before 2.0, now it's just ass. I don't recommend it to anyone.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A paid game riddled with microtransactions to unlock things.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "One of those trash games where half the buttons open microtransactions IN GAME. You pay your way through with real-world money. The initial cost fo buying the game is just a hook to get you in, so they can extract more money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The controls are wrecked on Steam Deck, unplayable for me. And they have some how locked out the ability to map our own controls, baffling really. Its been this way since i bought the game a few months ago. i asked for a fix in the forums and the answer the dev gave was \"my friend plays on Steam Deck and he hasnt complained about the controls\". \nAnyways dont trust the verification tool for controls on Deck, its obvious no thought was put into the way the are mapped.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "over 80 dollars of DLC for an 8 dollar game. \n\nawesome.\n\nno.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Game lost all of its identity",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Don't waste your time, DLC money grab game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "When did this turn into P2W garbage?",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "No. Just no. It was great when new, but now, you couldn't pay me enough to play this trash. If anyone if leaving this slop a positive review now, it's either a bot or a paid positive review. Don't waste your money one this.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "game sucks man",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "scam dlc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So much pay2play...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Quote from their last community post:\n\n\"Also my humble request: If you have time, please consider checking your steam review for Hero Siege and update it to what you think about the game now, this helps the game tremendously!\"\n\nWhat they say on Discord:\n\nhttps://imgur.com/a/DPOII6C\n\npathetic",
      "voted_up": false,
      "votes_helpful": 149
    },
    {
      "review": "Mid game, but some absolute Dog ass Creators that went full redditor mode on their Playerbase, and there is like 50 Billion DLC's, i do not recommend this game for anyone",
      "voted_up": false,
      "votes_helpful": 128
    },
    {
      "review": "Sometimes games are ruined by toxic community around them. This game was ruined by toxic dev team. \nI was one of the first players, but It is not a game I have been purchased anymore. \nMaybe my second negative review of all time on the Steam.",
      "voted_up": false,
      "votes_helpful": 104
    },
    {
      "review": "I don't mind all the various DLC's, classes, inventory, stash tabs, unique tab, expansions. I really don't mind supporting a game that offers such options. BUT...\n\nBut they encourage people to participate in seasonal content, and at the end of every season they decided that it's okay to wipe 90% of what you collected during your playthroughs. Because you are only allowed to keep a single \"personal\" stash tab and your very limited inventory.\n\nThat's arguably a very bad design by itself,  but the worse part is that at no point and no where it is being clearly communicated that this wipe happens and that you only get to keep whats in your inventory and that one personal stash tab.\nAlso this is the same issue with the \"unique\" stash tab where your purchase a storage where your are able to store 1 of every unique item, and well you guessed it right, if you play in season, those get wiped as well. (according to their discord)",
      "voted_up": false,
      "votes_helpful": 58
    },
    {
      "review": "This game used to be a lot of fun. Back in Season 1, it had a simple but addictive loop — kill enemies, collect artifacts with cool effects, and speedrun through waves before starting fresh on the next run. It was fast, satisfying, and genuinely unique.\n\nIt originally felt like a game in the spirit of The Binding of Isaac — simple, replayable, and full of cool item synergies. But now, it looks and plays more like a cheap Diablo knockoff. They could’ve just kept the original gameplay loop, added multiplayer, and expanded the artifact system with more item combos. Instead, they completely changed the formula, adding clunky ARPG mechanics and pay-to-play systems that ruined what made the original so fun.\n\nNow it’s a completely different game. It barely resembles what I originally bought. The core gameplay that made it special is gone, and there’s no way to revert to earlier builds or replay the classic version. Honestly, it feels like false advertising at this point.\n\nWhat we have now isn’t the game I paid for — it’s bloated, paywalled garbage. The developer clearly doesn’t listen to the community, and instead of gutting the old version, they should’ve just made Hero Siege 2 instead.\n\nI wouldn’t recommend anyone buy this game in its current state. Spend your money on something like The Binding of Isaac or Heroes of Hammerwatch — you’ll have a much better time and be supporting developers who actually care about their players.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "[h1] 3/10 [/h1]\n \nGreat art and music, but the game is buried under a predatory live service model. Everywhere you look it’s “BUY ME!” storage, saves, cosmetics, even a house subscription. €140+ worth of DLC after a decade is absurd. POE or Grim Down shows how to do it right; here it’s just paywalls and dev drama.\n\nHero Siege should’ve been called Wallet Siege.",
      "voted_up": false,
      "votes_helpful": 142
    },
    {
      "review": "It was good in 2016 when I bought the 4-pack and played local co-op with my friends. Game has gotten worse and worse over time, would've been better if the game stayed in the form it was 10 years ago :(",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "Not the game I bought. Filled with micro transactions. Should've made 2 separate products.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "Too bad, this game used to be quite nice, but the monetization went too far. It used to be simple and fun, but it's lost the charm it had, at least for me.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "Haven't really played this in years.  But I have to give it a thumbs down because it definitely isn't the game it originally was.  They turned a Binding of Isaac-esque / vampire survivors-esque game into a nightmare of an mmo theme.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Yeah, I gotta give this a thumbs down.\nThe developers changed the game so much from what it used to be (a Binding of Isaac-like game). To what is now a live service ARPG with insane amount of monetization. It really didn't need all this bloat and it is a big ol' grind.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Why do they keep radically altering this game so significantly?\n\nThis is not the first time.\n\nRegarding this most recent update and node system, dev with Jared Leto Joker avatar is trying to assure people, \"dw I got friends who have played TONS of ARPGs\" \n\nOh, thank goodness! If that's the case! Lol...\n\nWhy are there so many microtransactions?\n\nDon't touch this thing with a twelve foot pole.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Dev try to DLC milk a paid game like a F2P fortnite game.\n\nAlso, not even what we originally paid for. Dev 180 changed the game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Hero Siege is NOT fun! Not worth your money, not even for free! Not recommended",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is kind of heart breaking one for me. The game is a lot of fun and quite specifically something I love. Lots of build options to test with lots of loot and lots of monsters. I really should have looked harder into the dev before buying, thankfully i got it for like 70 cents US. They are open facsist supporters, just look at the CEOs steam page. The Trump shit is bad enough but Putin, really? Eat shit fuck heads.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Hero Siege is a game that's basically just Diablo, PoE or Grim Dawn but with a shit ton of DLCs, Microtransactions on top of being a PAID game, honestly surprised this is not made by EA\nAnd you should go ahead and play those instead, because Hero Siege is not fun as well.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "random update a while ago changed a bunch of shit, and now they are using AI art in promotional media, like the thumbnail for the most recent update, true shame because i did genuinely enjoy this game at first.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The game is ok - repetitive but kinda fun. I decide to go for the thumbs down because this could be a good relaxed H&S for the Steam Deck, but they decided to add the worst imaginable controller support and call it a day. I have high hopes for the upcoming season though, so I'll update my review if they fix the controller support.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I first played Hero Siege shortly after it came out on Steam. I thought it was all right - a Vampire Survivors-esque kind of game - but it was a buggy mess. I figured I'd try it again when it's a bit more polished.\n\nI just tried it again and, while it's a lot more polished, it still feels unfinished. The worst thing, though, is the prolific addition of In-App Purchases throughout the game. It's bad enough that triple A games try to sell additional content at every turn without little indie games capitalising on it as well.\n\nUnfortunately given that this game is 11 years old and is still being maintained, someone must be buying this crap, so the business model is clearly viable. I'll stick to other games, though.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bought this ages ago, never played it, got a PC for the TV and was enjoying family sharing and playing downstairs with partner as a simple arpg. \nDevs have turned off family because they cant be bothered to fix issues with cheaters bypassing bans, many different ways to stop people avoiding bans. but this has made the game redundant for me now. waste of money buying DLC. shame i cant refund the game, and refuse to buy it a second time.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Came back to try again , and it wont start. Plus that AI art stuff.. shame.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "use to be a cool rogue lite now it's a sad depressing ironically repetitive diablo clone.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Terrible game, terrible monetization practices. I can't refund it but I'm removing it. The decline over years as the developers have tried to grift as much as they can from the game is sad. \n\nDon't buy.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Servers disconnect every couple mins, dlc extortionately expensive for what you get, seems like it tries to mimic every other arpg like diablo/poe by taking their mechanics and putting them in but the game still feels shallow and boring\n\nEdit: Responding to Rexi [Developer]. \nThis is a lie and responding a month later makes me assume now there's now chat server issues too, I never had issues with the chat server but the actual game would kick me out back to the login screen every couple mins. Discord mods seemingly ignore people reporting bugs/issues.\n\nRegarding the DLC he mentions, they scammed players with DLC that no longer did anything as it had been added to the game for free and didn't remove it from the store. They're now moving to a skin/pay for convenience plan. There's a fine line between pay to win and pay for convenience and given their track record of blatant scamming, I'd keep a close eye on what anyone purchases in this games future.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Horrible, egregious, slimy, uncanny dlc bait. There are literally buttons in the inventory designed for you to accidentally click so it drags you into a buy window like a fucking mobile game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Original game used to be fun.\n\nEvery time I look now, there's more paid DLC. It would take me about $100 just to unlock the new classes and areas.\n\nGame has been completely changed more than once, so good luck with the game staying the same if you even do enjoy where it's currently at.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I enjoy the game but it has too many issues.\r\n\r\nPro's:\r\nGood class designs.\r\nLoads of items to find.\r\nFast gameplay \r\nRespec at any time. \r\nSynagies are in the tooltips \r\n\r\nBad: \r\nIt sometimes looks bland.\r\nVisibility from enemy attacks is very bad.\r\nRed indicators on the floor go away too early.\r\nEffect on death from enemys are basically invisible and you die out of nowhere.\r\nAlmost all classes use arcane as an element dispite the skills looking like fire/lightning/poisen/cold.\r\nYou get stuck on corners and cant jump over opsticals.\r\n\r\n\r\nThe potential from the Game is there and it can be fun at times.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Loved it as a concept few years back, but what they do now its just stupid. They name it as a live service game, while its a paid product. Even worse, the developer saying that this help keep the money, while spending his money on knives in cs2. How can you support that?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lazyness of these devs has no limits. It's 60 days after season start and banner on game says season has started. It's not just only little details. Engaging with devs in discord is just sad, and the product is not better.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Toxic Monetization practices\n\nI promise all the other reviews saying the same thing aren't lying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Devs are begging for players to edit their reviews for thumbs up. Maybe I will when they optimize the game and actually remove easy anti cheat. The restructuring of their monetization and PoE-style stat increases are nice, but they mean nothing if I can't play.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm just trying to get this game to work and every button keeps bringing up the steam store page asking me to buy stuff",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game has become extremely predatory with the MTX, i own nearly all classes and am now unable to use ANY outside of the base nor can i access other content that i paid for, DO NOT purchase.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The state of the game is everchanging in order to squeeze out more money every so often.\n\nDon't fall for it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I would recommend not getting this game as the developers say there is no p2w features but it is riddled with p2w features.\n\nEdit: This developer tried to justify the p2w features as not p2w. To anyone BUT the developer there is p2w features like any mobile game out there. It has p2w and a monthly subscription with $150+ dlc. If I could give it a worse rating I would. Thank you for reading my TED talk.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "its way to heavy priced for what it is atm and i read the dev is toxic idk if its true but atm i will still play it but will not make more microtransactions than i did already",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I do not recommend that you get this game. It used to be fun for a good long while and it was pretty cool to play around with builds, while there was still a player managing the builds website. There were some Problems for that player and he asked the developers for help but never got any.\nNow everything they do just seems greedy and against the natural fun for the player.\nThere are other games in this genre, i suggest you give those a try.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's a decent game but literally every part of this game past the base costs money. \r\n\r\nI.e., Six or so heroes are free to play from the start. The remaining 15ish are individual purchasables ranging from 6-20$ EACH. Like really??? \r\n\r\nGarbage. Dev likes to argue with some of the reviews that you \"don't need to buy anything\" when every part of this game has purchases incorporated into it. You get \"lootboxes\" from various parts of the game... and the only way to open them is with 0.99$ per key.  \r\n\r\nAbsolute garbage lmao. The base game was entertaining enough but between the developer drama and the amount of purchases stuffed into this game, it's not worth it. Don't buy this dumpster fire.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is not the same game it was when they first released it back in 2014, and the progression they keep going in just keeps turning off more and more of the player base. It went from being a fun little Diablo-esque dungeon runner/rogue-lite with fun mechanics, but they decided to pivot in another direction and make in game purchases almost a necessity.\r\n\r\nThere are also multiple early game bugs where if you don't do EXACTLY as you are supposed to it locks you out of being able to progress; the best part about it is it was a bug that got introduced with the updates many of the original player base have been vocal about disliking. This has been a known issue that players have commented on for years, and I am still seeing people reporting it to this day.\r\n\r\nWhat used to be a fun little Diablo-esque dungeon runner/rogue-lite is now nothing like what they originally advertised and released. IMO I see this as false advertising, and I would never have bought this game today (9/14/2025). Sad to see what was a great game ruined by developers that couldn't leave well enough alone.\r\n\r\nAlso, if you look at the developer's responses to some feedback, or even asking about features they will make excuses and blame others, even saying the person that was supposed to make \r\n\r\nThis all comes off the back that Elias Viglione, the CEO of Panic arts Studio went on a racist tirade back in 2020 where he called for the murder of immigrants, and called them animals. You can find more on it here: https://www.gamesindustry.biz/panic-art-studios-ceo-in-racist-twitter-thread-fiasco\r\n\r\nThen in the years following they allowed their discord and game to be used to racially attack and DOX people, along with allowing the posting of racist comments and images.\r\n\r\nThis is not a good game, and it is ran by some not so great people.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Hero Siege used to be an amazing game, but now it’s just a cash grab. The devs keep adding overpriced DLCs and pointless updates that break the game even more. They don’t care about players anymore — only about squeezing every dollar they can. I honestly regret buying this game; wish I had saved my money.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "long forgot about this game but dev is asking for good reviews when they're just toxic, joke",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "tl;dr: Once a great game, updated using the same title game, but far away from the \"vision\" it started on. The reviews from recent years are more than proof. I do not recommend for you to buy it. Sadly.\n\nI played this game for few of the first seasons, i got top ladders, i got a lot of fun, the game once played isnt this game anymore. They make huge updates and huge gameplay/monetization decisions, realeasing it upon the name of Hero Siege, should have been a separate launch. The game now has a few of the still pretty good gameplay, but behind a team and a vision that is slowly going far and far away of those few things that was build upon.\n\nThe interaction in discord was always bitter-sweet, at the same time is very nice to have close contact to devs that build a game you like, in the other hand, is disappointing when they are inflexible in decisions that end up being sponsored by some players therefore momentary monetary good decisions, but horrible in the long run.\n\nIf anything, the recent reviews say more than anything, how a great game was turned into something that wasnt what it was in the launch, its sad that is something that steam don't care about, launching/remaking games and updating it upon the same name (they even did that with CSGO/2, so im not surprise that will continue happening to other titles too, sadly).",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Way too many microtransactions.. i can handle cosmetics and different classes.. but once I saw they also sell things like character inventory tabs.. so sad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game has been out since 2014, tried it for the first time in 2025 during a deep sale, with an open mind. \n\nCombat is rather dull, repetitive, or could say brainless even \nClasses a bit simplistic, not many skills, you'll use 1-2 skills most of the time. \nGame does not seem that dynamic, whether its monsters, map/terrain mechanics, in terms of 2025 standards.\nMaps don't have much immersive feel, story basically non-existant\nCould say the \"game needs a lot of work\" but it's been out for more than 10 years, so don't hope for massive playstyle changes. \nPoE2 blows this out of the water, but it's more expensive. As for 2D alternatives, I find the combat, UI, dynamics, cohesive play, etc. much more satisfying, reactive and modern in Heroes of Hammerwatch 2 and Slormancer. \nDid have high hopes for this game, but it's outdated, despite the updates each year (mostly in the cosmetic store) it hasn't managed to keep up with modern quality standards. If you get this on the 1 dollar/euro sale, try for yourself, but I wouldn't buy any of their DLCs before a good 5-20 hours of play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "absolute dog ass game, with even worse creators\nevery second button is some sort of DLC, which they're charging abnormally for",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's kind of impressive to directly copy so many things from Diablo 2 yet still manage to make such a boring game.\r\nWhile the itemisation is interesting due to all the aspects taken straight out of mainly D2, the visual and audible feedback makes the gameplay loop still feel bland.\r\nMore importantly, the developer's greedy business practices are enough for me to never want to recommend this game. The more you see ingame and the more you read from other people the worse it gets.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I remember playing this game back when i still had a laptop, and this game was more a  survive each wave which honestly was fun, just wish they had fixed the online play with friends, because it had never worked. \r\n\r\ni came back to this game around 5 years later  finally with a proper pc and the game had completely changed, sure it had some of the same things, but it had become diablo( honestly i enjoyed that even more albiet waves of monsters still coming, but  controller play was pretty simple could assign skills easily, and i always had enjoyed diablo).\r\n\r\ni just recently  started it up again, wanting to come back to where i was at before, only to see they had revamped again, im level one, storyline as well as all the controls had changed where its just a pain in the ass.  make the dang game more user friendly. even the sprites  move so janky now. sometimes  updating a game makes it worse. and you certainly did that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Actually can't play the game in mutiplayer, constantly getting freeze frames every few seconds and i tried physically everything to fix the problem.\r\nUsed to like the game, now i can't even play it anymore.\r\nSad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Was gonna play with a group of 4, one of them opened up the game with cheat engine opened by mistake, got instant perma-banned. We haven't touched the game since",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game itself is ok, but there are quite a few gamebreaking bugs and unreal droprates for endgame items( 100+h this season and 1 angelic)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unrespectful devs towards customers and players.\nThe whole game has been changed into a mix of other games, ruining what it once was.\nPaywalls for basic in-game things such as QOL, housing, etc.\n\nInsane cashgrab. Don't come back because of nostalgia.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I used to play Hero Siege for a bit, hence my 450+ hours into the game. But recently they started copying certain games without doing anything new themselves. Just look up Path of Exile / Last Epoch, they nearly copied everything out of those games. \n\nThe direction the game is going is just sad. The Devs just want to make everything monetized. And trust me, I've got some DLC since I liked the game, but now... yeah skip it if you don't want to pay for nearly everything.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I would recommend this game but I really can't. The overall game is quite fun, even though it requires a bit of grinding, it's still enjoyable. What makes me not recommend it is that the game always has controller issues no matter how many seasons it gets updated. If you play this game on the Steam Deck, you will find that it has serious controller issues and the game crashes frequently. In short, the developers don't care and don't care about improving the controller system at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like with many others: my opinions on this game have changed.. because the game has FUNDAMENTALLY changed. simply; from being good to being bad. It used to be a huge go-to for some bullethell zone outs. the casts were fun and there was enough variation and potential difficulty. i really dont even know what it is now. just a mess. its like seeing a childhood friends obituary. sad. i wish the devs had just started a new project and left the game alone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "after the recent updates the game has become unplayable. constant lag and anytime i try to interact with anything the game just freezes. im happy for those who can still enjoy the game. i might try again later in the season",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stuck in the first town. There's no way to progress forward or even go back. The portals and waypoints do not function. Game looks interesting but I can't be bothered with glaring bugs like that.\n\nEdit\nI've since made it past the waypoint and dug into the game a bit.\nSeems ok for a $8 arpg but it is monetized to death",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A paid game riddled with microtransactions to unlock things.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I could write an extensive review about this game, with the previous and current, pros and cons... \nBut instead I leave you with a famous quote that perfectly encapsulates my feelings for Hero Siege.\n\n\"Look how they massacred my boy!\"",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Dev/creators think they've created the best game to have ever existed, proof? Check the several recorded times these people have negligible to the people who play their game. Also, the ceo a while a go said some racist things about a certain type of people, funny coming from some kid who barely washes his hair, with a high bmi and a lip piercing, the superiority complex on this boy is unmatched.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I don't remember how I ended up buying this game. All I know is it reminds me of this mobile game I used to play from 2010 or so. Very boring and very dull.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It was nice game however currently it is not recognisable. Problem isn't coming from me either. So, you might say you didn't \"recognise it\", but that's not the case. \r\nIf I were to critisize it as it currently stands, it feels like a different game altogether... \r\nBy adding \"the season\" it has unfortunately become something of a abomination locking away all its content. This has left me feeling rather disappointed. \r\nGame was legend, everyone knew its name at the time, it \"was the game\" you play when internet was down or for fur in late at night . Damn, what have you done to my baby...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "used to be good. Now they collect your info and they use the worst kernel level anti-cheat",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "So boring and ugly, bad mobility, horrible graphics",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you're tired of playing PoE 1 or 2, go play Hero Siege. You'll forget you were tired and you'll go back to PoE really quickly.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}