{
  "positive": [
    {
      "review": "-> New league released\r\n-> Try new class (or class changes)\r\n-> Grind all act until endgame and mapping\r\n-> Clear all superbosses at endgame\r\n-> Got bored after min-maxing build\r\n-> Wait for upcoming new league\r\n-> Rinse and repeat\r\n\r\nThe players are not bored getting exiled anyway",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "New to the series so the absolute farthest thing from an expert on the subject but been having fun with the game. There are a couple things, however, that did not take long to realize need to have a bit more time in the oven, fortunately that's what early access is for. \n\nGood:\n- satisfying gameplay with more depth and difficulty than similar arpgs on the market. I like this slightly slower and more technical gameplay more than Diablo personally but ymmv.\n-boss encounters, at least during the campaign, can require a bit more planning. I.E. I lose to a boss that does lightning damage so I stop and adjust gear for resist and go back and win.\n- simple one here, the game has a nice style to it. Not too cartoony and not too edgelord. \n\nNow the bad\n- passive skill tree is dog water. Too cluttered and too spread out at the same time and too many unmeaningful points. Until you're at endgame with resources for gear crafting it all feels super underwhelming and characters end up playing similarly throughout the entire campaign. So basically if you have a play style in mind you may be autopiloting your way through hours just to get to it. \n- item rarity and crafting has way too many layers of RNG, with far too many different items for crafting. I get that this is effectively the gameplay loop, but the current iteration just sucks. Uniques are underwhelming and low roles on rares of considerably higher level than higher rolls on low level weps can mean upgrades are far too uncommon. At level 40 on my second character I've only used 2 weps (not counting the one you start with). It's ridiculous that I can't find at least a little upgrade to a level 16 weapon in the 30s. Some modifiers being straight up required is a lot to be blamed here (like %physical damage)\n-personal inventory space is hilariously small. If you can teleport back and forth at will there's literally no reason for that crap. All it does is serve to interrupt gameplay which is nothing more than tedious. If I have 100k gold I've probably left 150k on the floor in the time it took to earn just to avoid that crap. It's stupid. Doubling the current space, and a separate pocket for quest items would go very far in improving fluidity of play. \n\nI suspect I'll sink a fair amount of time into it, especially once 0.4 drops as I came in late to 0.3 so no reason to work hard on this season.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Cool Action RPG game from Grinding Gear Games, and it has co-op for up to six players. Fun to play solo or with friends. Many quests to complete and monsters to defeat. Fun game.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Path of Exile 2 is shaping up to be one of the most ambitious ARPGs in years. Even in its current state, it’s clear that Grinding Gear Games has taken everything that made the original great and pushed it to an entirely new level. The combat feels heavier and more responsive, the environments are richer and more atmospheric, and the new class archetypes offer a refreshing variety of playstyles.\n\nThe redesigned skill system is a standout feature. Linking skills through support gems feels more intuitive, and the visual impact of spells and abilities has been upgraded across the board. The game rewards experimentation, and every build feels like it can evolve into something unique.\n\nPerformance has been surprisingly stable, and the visual overhaul is stunning without feeling overwhelming. The soundtrack and sound design also deserve praise-every hit, spell, and monster roar lands with weight.\n\nIf you enjoyed Path of Exile 1 or simply love deep, loot-driven ARPGs, Path of Exile 2 is absolutely worth your time. It’s still evolving, but the foundation already feels extremely promising. I’m excited to see how the game grows from here.\n\nRating: 9/10 - A bold and exciting evolution of the ARPG genre.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Still waiting for more classes to be released. So far, I'm enjoying the beta.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Never thought I would enjoy a game like this but after 130 hours of on and off gaming i can comfortably say this has been an amazing experience.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One thing to keep in mind whilst playing this game is that it is still in early access and thus, not complete. We don't yet even have all the classes unlocked so to judge completely is quite difficult, since it is a work in progress. But what is there is done very well in my opinion.\n\nThe game is visceral, graphically quite stunning with combat feeling impactful. The campaign arc i enjoyed, albeit unfinished. Out of the two POE games from GGG, i enjoyed the POE 2 campaign way more than POE 1.\n\nDespite my Steam account only showing 41 hours, i switched to using GGG's own client for both games a while ago since, for me, both feel more performant doing so. I actually have close to 1000+ hours in each game.\n\nThe not so enjoyable:\n\nOne thing to note however, and this is what annoys me about GGG, and also to iterate that this is my own perspective as a player as i see it and how it makes me feel. They, GGG, tend to favour end-gamers, those who like to min-max their characters over casual players, and this is blatantly obvious with how the loot drops have been programmed to work in this game.\n\nYou can roll a character and for that run end up being extremely lucky with currency / gear drops. You can roll another character and have the inverse happen where your drops-luck tanks to the point of frustration. This essentially soft-locks you from progressing in any meaningful way and forces you to grind (pun intended) previous completed levels to power up your character for the upcoming harder content. This, in turn, actively slows down your character from progressing normally.\n\nThis is one of the most agregeous and infuriating aspects which exemplifies how GGG truly perceive their player base. And you can defend this all you want but, in my view GGG do not respect their player's time enough. They want you to grind, really grind for minimal reward, until you hit end-game. And it's this kind of thinking that alienates a potentially larger player base from engaging in the product.\n\nThis stems from the fact they, GGG themselves are gamers and are developing a game 'they' want to play which isn't a bad thing per say but, i do think it blinkers the company when their choices instantly alienate those of us that do not have the free time to dump thousands and thousands of hours into a title to feel like you are not being rewarded enough for your efforts. In fact, sometimes it feels like you are being punished for progressing which i find very distasteful. Almost sadomasochistic in effect.\n\nHowever, with all that said, if you enjoy arpg's and want a somewhat challenging experience i would still recommend this game. It does scratch an itch that other titles fall short on.\n\nI just hope GGG try in the future to think about the choices they make from outside of their own personal bias and maybe we'll end up with something really special!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A fun game, similar and better than diablo.\nI have spend hours playing alone and with friends.\nCan make a lot of different builds for each class.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "No idea what the story line is about but the action and the RPG aspect of this ARPG is top notch. It's only in beta and already has more content and dynamics than Diablo 4 ever had. It's biggest problem right now is performance, which I'm sure they will fix eventually.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Games absolutely great, can't get enough. Way more meat than other ARPG's",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Can’t downvote it, but I also can’t enjoy it (yet).\n\nI’ve tried starting Path of Exile 2 several times now and every single time I drop it before finishing the first chapter.\nFor me, it’s.. surprisingly boring in the early game, and I genuinely don’t understand why I should play PoE2 when there are so many other great ARPGs out there.\n\nAnd I love this genre.\nDiablo 1, 2, 3, Titan Quest, Sacred - these are comfort games I replay every couple of years without fail. But with Path of Exile (both 1 and 2) something just doesn’t work for me lol.\n\nAt the same time, I can’t give this game a bad review.\nPoE2 looks great, feels weighty, animations are excellent, sound design is good (and the soundtrack is honestly beautiful, I listen to it outside the game all the time).\n\nBut I still don’t understand the hook. Maybe on my 4th or 5th attempt I’ll finally get it ^^\n\nAnother big thing that scares me off is the endgame.\nEvery video I’ve seen looks like the screen turns into a chaotic storm of visual effects it’s overwhelming to even watch, let alone play. And the idea of spending dozens (hundreds?) of hours learning builds, systems, crafting, and mechanics… it feels like picking up a second job or starting a new business. (Which is funny but also kinda true.)\n\nSo for now.\nRespect for the craft. But the fun part is still locked for me.\nMaybe someday I’ll understand what makes PoE so special for thousands of players I’m just not there yet.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "dont let the haters fool you; this game is not as complicated as people make it out to be. im super casual and enjoy this game immensely when I get to play it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Pretty fun game especially with friends. Its diablo but better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely love not being able to see shit on the screen while playing with my friends. My favorite feature is that this game constantly keeps crashing on DX3D, but doesn't do so on a Vulkan, but let's you experience a jolly good shader compilation stutter as a tradeoff, while taking a gorillion gigabytes space on your hard drive for a shader cache. All the while giving you a silky smooth one hundred to single digits FPS-range experience. I love this game, fr fr no cap.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Path of Exile 2 is a pretty good game. It has a very complex build system that allows a lot for build variety. I am thankful they finally allow the same support skills to be added to multiple spells. I had a lot of fun playing the game, especially with friends. Though after you reach end game once, it gets kind of stale trying a new character and going to end game again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "150 hours in and still having a blast. The developers are very responsive to feedback and are building a game with incredible value for money. Looking forward to the next 150 hours.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Path of Exile 2 is already shaping up to be a strong evolution of the series. I played a minion Necromancer throughout my entire run, and the minions feel powerful, responsive, and fun to manage. Combat has a smoother flow, and overall movement feels great. I did not enjoy using WASD for movement, but the traditional mouse controls are tight and reliable, so it never became a real problem.\n\nThe story is engaging from the beginning and stays strong all the way through Act 4. The atmosphere, pacing, and visual upgrades create a world that feels richer and more alive than the first game. I have not tackled the bonus content yet to reach the Atlas, but the core campaign already shows impressive polish for an early access release.\n\nPath of Exile 2 still has room to grow, but the foundation is exciting. With satisfying classes, fluid gameplay, and a story that pulls you forward, this early access build is off to a promising start.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the ARPG to beat. Even in early access, it has so much going for it. Excellent visuals, amazing sound and music, and deep gameplay. \n\nYes, there’s balance issues, performance issues, and missing content. But for the asking price, it’s an incredible experience that very few other games can match.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Compared to most aRPGs I like the pacing of this game. You can still get ridicilously strong and the screen melts but it feels more meaningful than others where I'm just walking doing nothing and things die. Can't wait to see what further content and classes are delivered as this progresses!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Diablo 4: 'Here is a legendary item every 5 minutes so you feel special.'\n\nPath of Exile 2: 'Here is a rusty sword. The enemies have more health than you, they move faster than you, and if you mess up your build, you will have to restart your entire life.'\n\nFinally, a game that treats me like the worthless exile I am. The abuse feels like home. Combat doesn't feel like I'm slapping enemies with a wet noodle. Every hit has weight. Every spell looks like a nuclear test. I spent 4 hours on a campaign boss, he beat me so bad I apologized to my monitor. The most humbling experience of my life. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is really fun, really.. i did not expect to like ti much, but all the promises of being slower than the first game, all the combat changes and the movement on the WASD, it really made the game feel better to play.\nBut, the game does feel bad on the same side i praise it about, the combat, the enemies more specifically, they stunlock you, and 99% of the times you die without knowing what happened, normal white mobs hit like a truck, and rare ones sometimes feels like \"why does it exists?\" also if you don't know how to create a efficient build, you're screwed to do any of the endgame.\n\nI do love that the devs are trying to change the game to fit its community but maintaining the differences between the first game and this one, i just hope they make it a bit more acessible to players not wanting to follow guides.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great sound design, i like the gameplay but after the first 1-2 week the endgame falls off",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "O jogo está bem divertido. Mas a otimização/performance é um grande ponto negativo, que espero que seja resolvido.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game will be THE game all other ARPGs in the next DECADE will be compared to. It is already an OUTSTANDING Title in Early Access with an insane amount of content and love put into it. And seeing the pace in which GGG is supporting the game it will most likely even eclipse its predecessor someday. The graphics are the best in the whole genre, WASD Movement was implimented so well that it is hard to play any ARPG without it now and the combat feels weighty but responsive. It blends fast paced screen clearing mapping with more intense thematic boss fights, the only thing it needs is more content and some balancing, two things GGG have shown to be on point and which can easily be added through updates and patches.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I haven't played the first one so I can't say anything about how it compares as a sequal, but the game is really fun and I love the customizability of what you can do with all the classes. There is so much time and thought and effort you can put into your build, and it feels really rewarding to plan skill tree pathing like what nodes to take in what order and so on. If you like customizability and spending lots of time reading and planning out things, this is definitely a game for you, if you're not into that you can also just use a build guide i suppose. But for me, a lot of the fun is trying to piece together something that works well. \n\nThe gameplay feels responsive and the bosses and gameplay-loop are fun. A lot of the maps are way too big in my opinion, but the fact that that is my biggest issue with the game says a lot. I definitely recommend this game if you want something to either think about endlessly or just do some mindless killing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What do I like about the game ?\n\n1) Complexity ( There was a lot to learn but in my opinion it wasn't overwhelming. But that depends on how much time you've got on your hands )\n2) Graphics & sound\n3) Difficulty ( I think it is pretty hard to find that sweet spot in game but PoE 2 is very close to it )\n4) Campaign ( Usually I am that guy that rushes to the endgame, but this game's campaign managed to pull me in. Although I wouldn't complain if chapters 3 & 4 were shorter )\n\nWhat I dislike about the game ?\n\n1) The importance of knowledge in trade leagues ( I haven't played PoE 1 so I had to learn the game from scratch when I started PoE 2. I like playing in the trade league, but it feels like inflation is your biggest enemy if you don't possess enough knowledge about the game. The prices get out of hand quickly. So if you don't keep up, you are left behind. )\n2) RNG ( I have played for over 1000 hours and I got 0 Kalandra's mirror, 0 Hinekora's lock, 0 Kalandra's touch, 0 Dream fragment, 0 Rite of Passage. I only got 1 Astramentis and 1 Headhunter. I could go on with the examples but you've got the idea. Crafting also involves rng, although much less in 0.3. Eventually, if you play a lot, you will get really good items. But the difference between a good item and a great item is an extra socket or better stats like an extra gem level. Aka winning a Vaal orb corruption or winning in a sanctification. Which involves RNG again. )\n3) A lot of smaller problems put together like: Delirium fog, FPS drops, some maps layouts, balance etc\n\nDespite all the problems, I still managed to enjoy the game a lot and I'm most likely going to keep on playing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "a fitting follow up to POE 1, takes features form the first game and improves upon and reimagines them",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The early access has been really good.\r\nI hope they manage to even out the builds somewhat, as of now, there are some builds that totally outperforms other.\r\nAlso, the endgame needs to be more engaging, this is supposed to be a forever game after all.\r\nBut, I really like the direction.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun gameplay with a variety of content to go through, good replayability to considering the wealth of available classes and viable builds for each. Highly recommended if you're looking for a well-craft and even better supported ARPG game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game all around,, constantly evolving in the better direction. Hyped for the Last of the Druids League.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A superb grind fest. Not yet cooked as well as the first one, but is on the way. \n\nIf you have a job or a life it's not for you. It's in the game title.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic storyline, but gameplay still need some improvements when compared to original PoE.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall, it is a good game, but still needs work on core systems and mechanics to best PoE 1.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "PoE2 is a great start to what will eventually be a great game. There is no doubt that someday it will rival or even surpass PoE1. But these are fundamentally different games (currently) with different target audiences and visions.\r\n\r\nI recommend PoE2 for the campaign at the moment to play at your own pace and go through the various class stories. The game is visually stunning with wonderful audio, and some great-feeling skills. If you are having trouble, follow a guide to forego the difficulty or preferably just play with a friend. It is good for what it is in a vacuum. I am hopeful in some years it will stand on its own and in (inevitable) comparison to the first.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game for nerds who are sick and tired of their normal life",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just like Path of Exile 1, great fun, but cant make a build by myself.....still.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game looks real promising in EA. Can't wait for the complete package is out...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is for Gacha gamers who love to see RNG in every part of buildcrafting.\r\nRNG/10 — Would brick my best item again.\r\n\r\nThe Hardcore Gambler: \"10/10 - Live by the Vaal, Die by the Brick.\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "DISCLAIMER: The game needs a lot of optimization, take that into consideration because it is a real problem if you don't have a good setup (Like me) and even if you have it doesn't run as smooth as it should. This review does not take that into consideration, I'm just talking about game feeling, mechanics, art, music and basically everything besides performance. If you're okay with a game that is not running on prime performance, then you can use my advice about buying it (Because even if I play with really bad FPS, I enjoy the game like I was a kid again).\n\nPath Of Exile 2 is just the best way you can approach this genre, even with the learning curve, it's 100% worth it investing your time on it. It's just an early access but it does have so much content already that is sometimes even too much if you're not used to it, but you get used to everything. It's somewhat difficult, and is really, really fun! I really want to see what GGG does with this game within the next year getting ready for the 1.0! I'm excited to try every mechanic they create and play the next leagues.\n\nBuying this game is totally worth it, if you're going to play even just 50 hours, it gives you the option to buy the stashes in-game so it's 100% worth your money, you never feel like you wasted not even a single penny, and if you're going to play a lot (Like me) you'll feel like you need to buy more stashes so the supporter packs not only give you coins, but cosmetics too. So, why are you even here still reading this and not doing check out of this game?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good iteration on PoE while keeping the style and aesthetics similar.  PoE 2 is slower than the first game while changing how movement works.  If you like the first game, the second one will take some time to get used to.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Never really could find a top down ARPG that clicked for me but this one has the sauce. Don't get it twisted I'm getting my butt clapped like a standing ovation, but souls like games have turned me into a masochist for such endeavors",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game — with more time and polish, it could easily become one of the best ever made. The end game is easier to play after update.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "a type of game where you can play for 200 hours and still feel like a beginner. although somehow not entirely overwhelming as stuff is introduced at a good pace throughout the campaign. I love it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nothing game changing, but the game is fun and monetization is fair.\r\n\r\n\r\nMy downsides:\r\n\r\n- The game becomes a AOE fest in the late game (which degrades performance),\r\ngear and char feels discartable, and there are no ways to target uniques.\r\nHowever, you can buy stuff in the market (no P2W).\r\n\r\n- I think the visuals of the game are very bad.\r\nChar looks horrible, and sometimes it is hard to distinguish map boundaries and enemy AOE. Because of this, a lot of the times I died because I was stuck or there was no way to see the enemy AOE on the ground. But hey, gamepley > visuals.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Although not a complete game...yet. It is fun to play. It is an arpg that in my opinion has better let's say mechanics than poe.  I believe it will change until is fully released but in a good way. For those which want a fun game consider to buy it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played since 0.1 Early Access. Having played both 1 and 2, 1 still offers more content, is much better optimized and builds are way more flexible over there. But I do see potential of build diversity in POE2. It's just not there yet.\n\nCampaign is quite more interesting that POE1 imo, and with 0.3 it was less grindy and brutal compare to 0.1 with performance issues and map scaling, and 0.2 with more of that and nerfs. Performance is worse but does get better with every release. Hopefully will be close to POE1 upon a few releases after 1.0 but now it's not there yet. If you love POE1, get yourself POE2 to support the devs and have a sorta fresh new league and content to grind in between POE1 league. If you're coming from other ARPG, try POE1 first and play something else while POE2 cooks. \n\nThis game has potential to be as good as the announce trailer back in 2023, but currently it doesn't quite deliver it (especially bosses, some have gameplay mechanics or design new to POE, but most are just DPS hard enough and it'll be dead in seconds.) And because the player base is not as large as POE1, trading economy goes bad after 1 month.\n\n3/5 Getting there, but not quite there",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The slightly more casual POE1.\r\nYou don't have to min-max to be able to clear maps, you don't have to play optimally to have fun.\r\nThere is asynchronous trading now which makes good gear much easier to get and it helps a lot with keeping the end game accessible to everyone.\r\n\r\nIt will become f2p later, so would recommend at least giving it a try then.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You have to Play this game. Its PoE but bigger, better and note b4dass !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Poe1 never hooked me while I love ARPGS in general. \nThis game was different, from the first moment the game felt epic, bosses,music,enemies,sfx everything. I knew I spent my money wisely by supporting the early access! \nThe character building alone and the variety of combos you can pull off is insane!\nHyped for the full release!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is looking good so far, excited for future updates...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ARPG where the game begins during the campaign, not after.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fantastic, not been this addicted to a game in ages, but can still enjoy and feel like you can keep up as someone with a full time job",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For context of this review I first purchased this on the Xbox Series X at launch. I initially enjoyed the game, until many glaring problems showed their ugly heads. These problems included sluggish movement (compared to most mobs and bosses), slow attack speeds (even with gear and skill points), poor loot quality from even bosses and rares, slow and sometimes unresponsive controls (on Xbox), and the game overall felt like a chore to play. The boss mechanics were refreshing, but at the same time something felt forced about the way you had to play. So I had given up for the time being. I returned when they release the huntress, and boy do I tell you that somehow ALL of the issues I had were even worse this time! Mobs did insane damage to you even with a good build, even less loot, and overall just worse. So I left the game again in frustration. I was on the brink of quitting POE 2 entirely.  \r\n\r\nFast forward to now. Someone told me to check the game out again. I had just built my PC, but I didn't want to buy the game again to try it out. Although, I figured the controls would at least be better this time around so I bought it again. I am genuinely impressed with how well they have balanced the game since last time I played. \r\n\r\nThe Good Stuff:\r\n\r\nStarting a new character does not feel like a chore now. The first few areas are easy enough to get through them without much effort or thought. Where as before it was a slog just to get past the first few areas. \r\n\r\nThe loot has vastly improved. No longer do you have to clear the same boring map 10 times just to get lucky enough to find a decent magic item, get enough supplies to make a magic item, or hit the jackpot to find a rare item. Now you just get decent loot from progressing. Rare loot actually feels rare, but not so rare that finding one makes you scream in amazement. Dropped magic items are more useful now, but crafting is still superior. \r\n\r\nDodge rolling, movement, hit-boxes, and overall timing in combat is night and day from how it was at launch. At launch you had to execute a roll down to the millisecond to successfully move out of the way of an attack. On top of that enemy abilities and movement were just plain faster than you, making even the simplest of mobs a nightmare to fight. Hit-boxes and dodge rolls are now more lax, you can actually avoid most attacks now (at launch there were unavoidable attacks from certain enemies), control input is more responsive now (this may be just me switching to PC from Xbox), and while the game flow and movement is still \"slow\", it now feels much more natural and fair. \r\n\r\nAbilities are now streamlined and much easier to manage. POE 1 was awesome and I still play from time to time, but getting enough sockets (usually a minimum of 4+) was a chore to do at times and felt like something that was unnecessary. Not anymore. You just get this gems that you use to unlock and level your skills. Same with the support gems. You just slot the support into the skill and go. You unlock more support slots as you progress too. The game also shows EXACTLY which supports will go into the skill and work, no need to carefully read each gem to see if they are compatible. I thought I would hate this new skill slotting system, but I actually love it more than POE 1. I really like how weapons like the wand and staff just have skills attached as part of the equipment too. \r\n\r\nBosses and mobs have been toned down. This ties in with the last point, but it is still worth mentioning. Combat now feels like a good challenge, but not a sweat fest anymore. My main gripe with POE 2 at launch was how brutally punishing the game was. Nothing turns off the average player more than coming home from a long day of work and trying to play a game, only have have your ass handed to you every 3 seconds despite your best efforts. Bosses are still challenging don't get me wrong, but not to the point where a single wrong move in a 10 minute fight gets you insta-killed like they used to. You will still likely die a few times when first fighting a boss, but you actually have a chance to win now. \r\n\r\nPerformance is fantastic. I run a 3090 with a 7600x Ryzen CPU and I have no performance issues whatsoever. The graphics are great, sound design is GOD TIER, and the art style is oh so tasty.\r\n(These have never been an issue, just something nice to point out)\r\n\r\nThe Bad Stuff:\r\n\r\nNow onto the \"bad\" things. These are just personal opinions for the most part, although I am sure others may agree with them. \r\n\r\nThe game is early access. Low-hanging fruit I know, but it does diminish the game to an extent. They are working on adding more content, but it still sucks playing a half finished game (and having to pay to play a free game at the moment). There is plenty of content to keep most people occupied for a while, credit where credit is due. \r\n\r\nThe skill tree. I adore the skill tree in POE 1. Maybe its just from the hundreds of hours put into that game, but for the most part I understand that skill tree. This game however, I am struggling to find the same love for the skill tree. It seems like they really just need to rethink the skill tree a bit. There is simultaneously tons of choices, but also almost no meaningful choices if that makes any sense. Tons of useless clusters, and any major node you would want is so far away from the starting point you may as well not even bother. By the time you get there you'll be level 30+ and by that point will need other basic nodes just to survive. Personally I think they need to redo most of the skill tree. If they truly want to broaden their player base they need to seriously consider doing away with the need theory craft every single build just to play. I love to theory craft builds, but even I am having trouble doing it with this skill tree. I am sure they will address this as they update and eventually fully release the game. \r\n\r\nLack of weapon variety at the moment. Its not like there is no variety at all, just that its not as robust at it could be. Especially when you can see what is coming soon in the skill gem tab. Not a huge gripe, just something to point out. If you want loot and customization like POE 1 then you may or may not be disappointed in POE 2 for the time being. \r\n\r\nIn my opinion, since this game is early access and is basically a glorified beta test (a fun one that will carry over progress to full release), they should add in an easier way to respec your skill points. You can definitely do that already, but it takes time and resources. Why not let the players try out more things without forcing them to grind or start a new build? It could even just be a mode where your character has unlimited respecs in a training area where you test damage on dummies or something. No actual changes to your skill point allocation outside of there. Let the players experiment and try to break the game. I fully understand not letting players change skill points at anytime, as many times as they want in the actual game, but there still needs to be a way to test things out easily. \r\n\r\n\r\nFINAL SCORE: 7/10 (as of the date of this review)\r\n\r\n(These points reflect how the game has improved upon itself or just innate qualities, not comparisons to POE 1)\r\n\r\n-2 right off the bat for being early access (sorry not sorry)\r\n+2 for the visuals, graphics, and sound design\r\n+2 for having vastly improved combat and overall balance\r\n+2 for improved loot drops\r\n+1 for smooth performance\r\n-1 for much needed skill tree fixes\r\n+1 for slower, but fair and natural feeling progression\r\n+2 for developer communication, dedication, and effort put into this game since launch",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First time playing these kind of games, its fun but the finding builds is bit hard for a beginner",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "140 hours in and I finally understand the truth: this game is just Loot Sorting Simulator 2025. Half my playtime is me squinting at stats like a confused dad reading tiny text. And somehow… I love it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is the first time i have played this genre and I was verry impressed with the gameplay.\nI have skipped Diablo series but this one is so nice that makes me question the gameplay I have missed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wish there was an rating in-between recommended & not. Feels way too overtuned; some classes can easily HC to endgame while others struggle clearing campaign. Visuals and Audio is on par with LE/D4 and gameplay feels similar to a slowed down version of PoE with a dodge roll. Gearing and Progression is also slower than PoE, and the build-crafting is objectively worse than PoE due to the very small number of viable specs.\n\nGGG Please guys stop buffing deadeye ranger, there are other classes </3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Except for the ascendancy trials, it's shaping up to be a good game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is awesome to play... except for late game, when it should be cooler. It's already hard to play for hours even days for get 1 level up, however the xp losses after death make it even more frustrating. I reached level 90, my build and gear are not terrible but I kinda don't wanna play it anymore.\r\nI hope the team still watching for this.  It's not like I don't think losing xp after death on late game isn't just. But maybe this can be reworked... I don't know, Lose maximum 50% of current xp per map or other kind of threshold. Being possible to reset from 30% to 0% in one map in late game is really frustrating. Still, I had good time, I just don't wanna expend more hours to die on some breach or a check point close to a abyssal depth and reset to die in succession and lose more xp than the map will give me",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Path of Exile 2 is an interesting take on the ARPG genre, iterating upon the original game to include some minor Souls-like mechanics, more complex bosses, and improved graphics and animations. The campaign is pretty good (albeit a little long compared to the original) but the endgame leaves a lot to be desired. Hopefully that will change in the near future but we will just have to wait and see.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So much customization and randomization. Deep systems. Lots of great builds. Game constantly gets better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best ARPG in the world.\r\nIt's amazing, and it's still in early access. Imagine how great this game will be after launch.\r\nIf you're new my advice would be to follow build guides on Mobalytics.gg\r\nI received my Early Access key via a Twitch giveaway, but my review is fully my own.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "POE II is a really good game. I honestly wasn’t expecting it to look this good, it’s visually impressive, and as someone who loves medieval fantasy, I really enjoy the monsters, the weapons, and the variety of builds you can play.\nThe game gives you a huge number of ways to progress through the story.\n\nI’ve played it quite a lot, and I even bought a few cosmetics. I’m satisfied with them, even if the shop itself is a bit limited.\nThe world is large, full of content, and offers a lot of exploration. The game becomes even more interesting when you play it with someone else.\n\nThat sense of accomplishment is very present, especially when you start leveling up and feeling stronger.\nMy opinion is subjective, of course. To have a truly expert view of the game, you’d need far more hours than I currently have.\n\nI think the game is genuinely good, but I do want to emphasize that the in-game shop is pretty sparse.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My friend went back to playing Diablo 4 because that one doesn't need a lot of focus or skills to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I gotta say, it definitely fills in the \"make anything you could ever dream up\" itch, though it seems that just like the first one, there are definitely metas you need to build to to push the boundries of content. I guess I would rate this a meh? Not super great, not terrible, just kinda in the middle.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i bought in full lock stock and barrel solely because of the promise the devs made about transferring all bought items from POE to POE2, that sort of support across games is unheard of, by any devs.\r\n\r\nAs for the game, its an Arpg that is in early access, there may be bugs (frequently fixed, but we all know the saying \"100 programming bugs in the game, 100 bugs in the game, take one bug and patch it out 150 more bugs in the game\") For what its worth, i leave playing for around 2 patches before i mess about with another run, dont expect much because balancing is happening, and they seem to be taking the same exact route to making the release candidate that they did for POE. THIS seems to make people think they didnt learn from POE, but for me, they knew that process made a winner, trusting that process again should make another winner.\r\n\r\nOne reason for the low hours of gameplay is that i have been ill since before launch, was planning to have a lot more hours on the game even this week alone, but again, in and out of hospital means no additional hours, but soon i will get back into it all.\r\n\r\nFor most people the free part of the game will be enough, others will just say \"play POE instead\" thing is, you can play both, nothing stopping you from playing 2 free games and making your own decision",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"Path of Exile 2\" is a highly anticipated sequel that builds upon the solid foundation of its predecessor, offering a deeply complex and engaging action RPG experience. While it's still in Early Access, it already demonstrates significant potential to become a genre standout, though it comes with some expected rough edges .\n\n[h3] A Rich and Evolving World[/h3] \nThe game plunges you into a dark fantasy world, with a storyline that, while not entirely original in its tropes, shows promise through its intriguing characters and the compelling cultures you uncover . Since its Early Access launch, the game has received substantial updates like \"The Third Edict,\" which added a new fourth act and interlude chapters, expanding the narrative and providing a non-linear path to the endgame . The world is vast, with maps so large that traversing them can take considerable time, making the world feel expansive even after dozens of hours of play .\n\n[h3] Refined Gameplay and Stellar Combat[/h3] \n\"Path of Exile 2\" makes substantial improvements to moment-to-moment gameplay. The addition of a dodge roll and support for WASD movement make combat feel more dynamic and responsive than in many competitors, arguably surpassing the fluidity of titles like Diablo 4 . The game is challenging, often compared to the difficulty of \"Souls-like\" games, with no easy mode available . Boss fights are a major highlight—they are intense, require learning attack patterns, and deliver a great sense of achievement upon victory .\n\n[h3]  Unmatched Build Diversity[/h3] \nThe game's greatest strength lies in its incredible depth of character customization. With multiple base and Ascendancy classes, the skill gem and support gem system allows for an almost limitless number of build combinations . Each class feels distinct; for example, the Mercenary plays like a twin-stick shooter, while the Warrior is a close-quarters brawler . This flexibility is a dream for theory-crafters, even if the massive passive skill tree can be intimidating for newcomers .\n\n[h3]  Areas for Improvement[/h3] \nAs an Early Access title, it has its share of issues. The loot system can feel unrewarding, often dropping items not suited to your class or of low quality, which is particularly punishing for Solo Self-Found (SSF) players . Some players report that certain endgame monsters feel overtuned, leading to frustrating difficulty spikes . Technical problems like bugs and crashes have also been noted, though they are common for a game still in development .\n\n[h3] Conclusion[/h3] \n\"Path of Exile 2\" is a compelling and massively ambitious ARPG that refines its predecessor's formula with more dynamic combat and staggering build depth. Despite current issues with loot and balance, its robust endgame content and continuous improvements make it easy to lose dozens of hours to its dark world . If you're a fan of complex ARPGs and are willing to overlook the growing pains of Early Access, \"Path of Exile 2\" is well worth your attention and has a bright future ahead.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Path of Exile 2 plays it safe with the story, it swings for the fences when it comes to ambitious gameplay.\n\n[First Impressions]\n\nEntering an early access title is always a bit of a gamble. It can range from blatant cash grabs to passion projects that still need time to cook. What I didn’t expect from this early access experience, however, was to genuinely have fun.\n\nFrom the dopamine hits of loot drops to the thrill of exploration and progression, and the challenging yet rewarding boss fights—this game really hooked me. It’s rare for a game to make the challenge itself the reward, rather than just handing out participation trophies for showing up or logging in.\n\nThere’s a ton of content here for theory crafting, boss farming, mapping, and end-game crafting. But, of course, being early access, it does come with its share of issues. \n\n**[Graphics]**Total Score: 8/10\n\nVisually, the game looks great overall. While it’s an upgrade from its predecessor, Path of Exile, the visual improvements aren’t exactly groundbreaking. That said, one thing Grinding Gear Games continues to do right is their animation graphics—they look phenomenal.\n\n**[Sound]**Total Score: 8.5/10\n\nThe sound design isn’t a massive leap from Path of Exile, but it is still an improvement. What stands out, however, is the music. Kamil Orman-Janowski’s compositions are absolutely fantastic and really elevate the experience.\n\n**[Gameplay]**Total Score: 8/10\n\nIn terms of gameplay, it feels fantastic. There’s a real sense of progression and the animations are crisp and satisfying. Playing as a Monk, I did encounter moments where I felt underpowered, but I attribute that more to user error—nothing a little farming couldn’t fix.\n\n**[Design]**Total Score: 5/10\n\nNow, this is where things start to get tricky. The map size and layout are one of the most talked-about aspects of the game, and for good reason. While the design and visual aesthetics are solid, the maps are just too huge, and there aren’t many ways to counter the lack of mobility (not many movement speed buffs). This makes exploration feel more like a walking simulator than an engaging adventure.\n\nHowever, with the recent patch introducing checkpoint porting, this could improve in the future. As for character design, while it looks good, there’s not much of a departure from Path of Exile.\n\n**[Technical]**Total Score: 4.5/10\n\nAs an Early Access game, bugs and glitches are to be expected, but surprisingly, I didn’t encounter as many as I thought I would. The few I did find were pretty significant, such as bypassing certain boss mechanics entirely, but they were rare compared to what you’d normally see, even at launch.\n\nThe big issue here is the game’s balance, specifically melee combat. It’s in a really awkward spot, making it largely inaccessible to anyone other than Path of Exile veterans. The majority of the critical feedback I’ve seen—aside from complaints about map size—has been centered around the imbalance in melee combat.\n\n**[Quality of Life & Accessibility]**Total Score: 3/10\n\nUnfortunately, I didn’t notice any accessibility options, which was pretty disappointing. As someone who’s colorblind, I would have really appreciated some filters or settings to help with that. Because of this, I’m scoring this aspect low. But hopefully, this will be addressed upon full release.\n\nTHIS HAS BEEN ADDED so now 6/10 I feel resize of hud etc is needed\n\nThe menus and interface also need some improvement. Things like the missing stats on the character sheet are definitely early access issues, but they should be addressed before launch. And the map layout, without any customization options, feels cluttered and overwhelming, especially when full screen.\n\n**[Immersion]**Total Score: 6/10\n\nThis game isn’t heavily focused on its story, and that’s totally fine. What really stands out here is the build diversity and skill customization. If you’re a fan of theory crafting, this game is a dream come true, much like its predecessor.\n\n**[Value]**Total Score: 9/10\n\nEven in Early Access, this game offers incredible value. Monetization is present, but it’s not in the typical pay-to-win style. The store mainly offers cosmetics and quality-of-life items that don’t impact gameplay. There is one downside, though: stash tabs feel almost essential, but they’re not required to enjoy the game.\n\nThe game is set to be free at launch, but even at the Early Access price of $30, it’s a solid deal, especially with the bonus $30 worth of in-game currency.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played it for a few hours liked it, moved on to another game, came back and now fully invested in builds and farming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have played a few seasons and find the games balance and feel all really well i prefer it to D4 or LE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good combat even though i don't like top down action RPGs, very good content and grind loop, the visuals and audio design is also a cherry on top of all that, you get the price you pay back with in game premium currency so the money you pay is worth it if you want to check out or support the game during it's beta. A must try in my book, do not miss on it when it goes f2p and I suggest you to try during the early access if you do not have anything else to play or wondering how the game is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game more 700  hour I still haven't scratched the surface Everyone I know says it's better than Diablo Should you play this game? Yes, if you're a nerd.\n10/ 10 Diablo game \n need more bosss\nmaps 10/10\nThe monsters are well designed We just need Steampunk maps and monsters and all good for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is great until maps.  Excellent mob density, scenic, cool spells, easy to figure out etc. \n\nThe map system is a gigantic cluster.  Maps take way too long and have no personality in them other than scenery.  Juicing maps is confusing - just bring back scarabs. \n\n3rd and 4th ascendancies are a joke to get IF you can even get them.  They're mostly RNG and take about 30 mins per attempt.  A way to ascend is a sanctum where you can get 1 shot and lose your \"honour\" regardless of honour resistance.  4th is a RNG ultimatum event which is more doable bit depends on when modifiers you get during the run.  You can get runs on TFT but they're generally about 2 divs and that say a lot about a mandatory step in progression if people are struggling to complete them.  Level 80+ you'll likely unlock your 3rd ascendancy. \n\nPlay through the campaign and stop shortly after entering maps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "2nd best isometric ARPG ever made and has the potential to become even better than its predecessor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like Diablo games you will definitely like this. I like it more than Diablo thb. It's so deep, the soundtrack is great, and it's easy to just play for hours and hours!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A deluxe improvement of everything in POE. More difficult  gameplay, better skills, graphics and everything. Well worth whatever they're charging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very challenging game great evolution and they listen very well and ajust the game for the community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The combat system is a game-changer, dodging feels amazing and the bosses are genuinely thrilling to fight. It’s looks gorgeous, new hideout store/market is amazing no need to DM people. What are you waiting for, go play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great ideas to make the game much more enjoyable. Lots of content currently available and more to come.\nThe only downside is the optimization, which still needs some work, especially in multiplayer mode.\nThis will surely come with time, as with the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very time consuming game i thought i beat it turns out that was only act 1 then i quit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is all the things that a player of this genre would love to see! very good story, nice graphics, interestig animations, grim atmosphere, fun mechanisms, challenging boss fights, addictive gameplay, fine voice acting. much better than other games of this type. twice as much better than that joke of a game Diablo 4...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This will become the best arpg game out there, just let ggg cook. Tbh tho, I wish ggg would have made poe 1 4.0 instead of splitting the game in two.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Diablo2 experience out there. XD\r\nGreat story with a nice transition from pulp jungle adventures to a sci-fi aztec horror mix.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're into games like Diablo, definitely give it a go. It's fun solo or with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game, the best ARPG on the market after PoE1. With a couple more improvement and expansion, it might as well take over PoE1 as the best. But until that time, we just enjoy both games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game at introducing new players to ARPG's. The gradual progression through the story mode perfectly introduces you to all the mechanics you could encounter without being cluttered with too much information.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is great game with a lot of buts. However, considering it is still in early access, i can forgive most of its flaws. My only complain is huge difference in playstyle between the story mode and the endgame, not in favor of the endgame.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I know nothing about this game, but steam lets me write a review and even rewards me to do so, so I will.\r\nThis is why public reviews are utterly pointless and unreliable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, epic game play. Aweesome graphics and stroy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More deliberate choices, smoother and the different moving feels even better then POE 1, and I loved that Im sure ill play this game for thousands of hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice gameplay and graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not gonna lie, I'm just writing this because a banner in the steam awards told me to...\nanyway, this is a pretty good game.\nstill impatiently awaiting the druid class though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PoE2's combat is a symphony of chaos: fluid, responsive, and brutally fair. The new 3D movement—dodge-rolling through enemy hordes, chaining skills mid-air—turns every encounter into a dance of death. Classes like the Monk deliver dopamine-fueled highs with Hollow Palm builds that feel godlike, while bosses demand mastery of positioning and adaptation, echoing Souls-like intensity in an isometric world. Unlike Diablo 4's sometimes floaty action, PoE2's fights are tactile and consequential—one mistimed dodge, and you're paste. Recent patches have refined hitboxes and animations further, making it even more satisfying than launch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a whole lot of fun through out the campaign to end game chaos, i have 240 hours already played at the time of this review and plan on playing another 1000 hours. I understand it that the game is to be free on full release though the current price point for the game beats most all 'triple A' games this is by far a buy if you have the cash to enjoy the pre-release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent ARPG not quite beating POE1 yet but give it a few more patches and we will be cruising.  You cannot go wrong with this game honestly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with it's own set of quirks. Provides variety for the Diablo-ish games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really glad that the review scores grew up from  mixed to very/mostly positive! both Path of Exile I and II are a league of its own.\n\nThe game did really good QoLs  and improved some league mechanics that came out from POE I",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like its predecessor, it is an absolute blast of a time sink.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best action RPG at the moment. With every new big patch its like a new and refreshing game to learn. That can be a good or bad thing. The content is huge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game, beautiful graphics. The controls (WASD) make it playable over the original which was click-to-move. Flasks from the original were simplified so players only need to manage health and mana. This game is easy to get into, even for casual players, providing they follow a build guide. While getting to max level is time-consuming (35 hours for me and I was going extremely slowly), the endgame definitely respects your time and is very suitable for those who need to frequently get up from the PC.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Enjoyed the game until I tried to refund my passives and lost a whole bunch of them due to the game bugging out when reallocating points (there are multiple threads on this issue). Devs have been aware of this issue for a year now and haven't fixed it. Customer service lets you generate a code to contact them and then immediately sends a template email saying that they \"don't have the information\". Be better.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to leave a neutral review, but that's not an option. \n\nPlaying Witch Minion build (currently lvl 92) - My gripes are first:\n\nPerformance is bad once you hit late game builds. 5950X/5070ti all low settings DLSS performace.  Anywhere from 100+ when there's not much going on all the way down to 15 fps. There's things that will help, deleting your shader folders when performance starts to dip, changing your audio settings, etc, but this legit has horrible performance. \n\nInventory management, it almost feels like a job.\n\nStash tabs are way over priced for what they are. Making problems, especially QOL ones then selling solutions is just dirty.\n\nCosmetics aren't cheap, but they're good. I wouldn't mind the price of them if it wasn't for the insane costs of stash tabs. If stash tabs cost 50% less it'd give the MTX store a much better overall feel.\n\nI don't mind the death penalty, but with the performance being as bad as it is, it sucks pretty hard getting one shot by something you can't see and losing xp and your map. \n\nI know it's EA still, but once you get mapping, it gets pretty boring after some hours and then with the performance it makes it harder to enjoy.\n\nBalance of the overall game seems off. Certain campaign bosses are very difficult with certain classes where they are just a cake walk with others, due to movement ability/attack speed/etc. \n\nWhat I like:\n\nStory\nCosmetics\nThe build variety/diversity\nThe overall world building\nBeautiful maps\nCustomer service was great for the one issue I've had to reach out to them about\nThe challenge is fun most of the time until you hit some of the things that are grossly unbalanced against a few classes\nThere is a lot of content to enjoy, even at this point of EA\n\nOverall, I do recommend the game, but knowing it's going to be f2p, I would suggest waiting at this point and hope they at least get the game performance in check",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is unplayable. Textures would never load, and it wouldn't let me leave town. This is after waiting 2+ minutes just to get INTO town.\n\nUnacceptable.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Only 3 hours in and not liking the shoot-dodge-shoot-dodge-dodge type of gameplay. Bosses are damage sponges with one shot kills and move faster than you can dodge their attacks. I'll be going back to POE 1 until they fix the disparities or come out with the full version of the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good looking game but many of the bosses are just not fun. One-shot skills, AOEs hitting the whole screen and a ton of health. Fights become just too monotonic. There is not any difficulty selector in the game.\r\nAlso you cannot play just by LAN with your friends, you're obligated to use their servers and they're sometimes laggy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The following is my opinion alone. I'm not trying to convince anyone.\r\n\r\nI was expecting more from this game. I've been told that it was way better than Diablo 4, even in its early access, but I have to say I reached my boredom threshold way faster than in Diablo.\r\nFirst, let's be honest, it's more or less the same game as Diablo 4. There's a good chance that in few month I don't remember which game had what content, because everything is extremely similar.\r\nHowever diablo was getting boring once you reached the end game, here the boredom got there pretty fast (i went up to mid act 3, and felt I was doing always the same boring stuff)\r\n\r\nThe reasons are the following IMHO\r\n1. Serioulsly this invertory size... The fact that your inventory is so small when the games shovels tons of loot at your face constantly is really the pinacle of frustration to me. if I wanted to tidy up a closet I wouldn't be playing video games. I don't know what twisted mind believed that constantly going back and forth to the camp selling / dismantly / desenchenting your loot could be a fun mechanic. I know it's not a POE2 specific thing, but this game bring this things to the edge of insanity.\r\nSo of course people are going to say \"don't loot everything\", sure, but then what? You have to at some point else this mechanic is even more useless.\r\n2. Progression feels numb. That's also the thing with these loots, 99.9% of the time they are uninteresting. Even the big yellow loot or even the unique loots are underwhelming at best, trash aimed at filling your inventory most of the time. To get decent gear you need to \"craft\" them, with a nebulous system, that feels overly complicated for the sake of being complicated. And once you made something descent there is a good chance you won't find anything better before long, making the whole thing kind of hollow,\r\n3. The progression tree is a bit of a scam. When I first saw it I was kind of excited because there is the promise of being able to make really hybrid characters, the mutliclassing at its best. Well nope. The tree is so huge and the progression into it so slow that there is no way you will reach the area of another class in the entire game. you starting class determines the direction in which you can progress in the tree, then sure, you have a lot of choices, but only passive that will compound with the skills you equip. Yes skills are actually not in the tree you equip them, and the weapon you have equiped condition what skills you can have. So basically this promisse of super multi classing disapear pretty fast, because you are basically going to be able to fill 1 or 2% of the tree at best, and the core of your game play is driven by your equiped weapon.... \r\nTbh, it's as if Diablo was putting all the classes progression tree on the same screen, without being allowed to go to another class tree, It looks big and full of promisses... but in the end that's the same classic thing.\r\n4. The game loop, is boring. The story is dull at best. Not that diablo one was good, but at least you had really compelling cinematics that were bringing some interest. Here it's basically jumping from map to map with new people every time except 1 or 2 recurent characters that are classic \"guides\" that could do everything themselves but ask you because you're the hero. Maps are huge, and for once it's IMHO not a good thing. Clearing a map is very long and extremely repetitive. At first it can be challenging but once you get the hang of it, find out what passive to unlock in the tree, get some good gear, difficulty is gone. You kind of roll over the map mashing buttons obliterating anything that enters the screen. That said, pretty similar to Diablo in that regard. Some bosses present some challenge, but they are very few of them, and even then you can so easily and completely bypass bosses mechanics with some skills, that boss fight become mashing your buttons as fast as possible and would be the same as htting a training dummy.\r\n5. Character look... they look bad. Not one of them looks good. And you can't make your own character like in diablo. Each class has a character assigned, gender locked and appearence locked. Gears in general look quite dull, always the same brownish color and quite few variations of the same gear over and over. On top of that no \"glamour \"system where you could keep the apearance of a gear you find and you like, but a buy only cosmetic system, with prices that are complemently over the top... like 10€ (or $) for a hat, some complete Armors are reaching 70€. I mean you can get one or 2 other good games for that price. The nice part is that they also look meh, and you're not really tempted to buy one.\r\n\r\nThough There are good things in the game like:\r\n- Overall graphics are very good. the maps are really nice, the lighting is really smooth. This is extremely pleasing to the eye.\r\n- Musics are good, I enjoyed them quite well.\r\n- There is 10 ish hours of fun to me. I enjoyed it at first.\r\n\r\nMaybe this game has been oversold to me, I was waiting a lot more from it. Like the revolution of \"diablo likes\". IMHO it's just another one, which emphasis on the mechanics you'd like to see disapear from these kind of games.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "the game promises, but don't delivers.\r\nOn what? \r\n1 - create your own way to play the game.\r\nthat just BS, you HAVE to follow the build meta, or you will eat shit.\r\n2 - balance\r\nWhat a shit balance, classes 0 DMG on any skill, other classes already have high DPS, and get buffed FOR MORE on the same skill, so we have a lot of the same shit build, on the same classes, so no variety on balance for other classes.\r\n3 - the game so far.\r\nTHE SAME FK CRAP, play act 1.2.3 and now INTERLUDE!!!!!! UHUUL what a bunch of crap, In other words, the game is just boring and tedious.\r\nDon't make the same mistake that i did, don't buy it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm so regret paying money for this game \r\nthe screen is keep lagging it become so unplayable \r\nIt was suppose to be a very amazing game \r\n\r\nJust so regret",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please optimize your game since its have been realeased 4 chapter, the game itself is good but the playing experience is not satisfied because lagging. Hopefully developer will make it count after full realease. Thank you for speding your time to read my opinion",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, hard to recommend now. These server are just terrible. Getting kicked out is just a common occurrence. Constant glitches with spirit and minion builds. Frustrating gaming experience. Always fun when you get kicked in the middle of a boss fight and then you have to make your way back to the boss and start all over again. Sure it will be better when released, but its been 6 years and here we are (supposed to be released in 2024, then 2025 and now 2026). Will it be fun at some point? Probably. But after 40 hours and all the glitches and kicks, not worth the headache at this point in time.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Network latency makes it unplayable.\r\nServers are very slow",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I can't recommend this to anyone.\r\n The constant nerfing of characters, the deaths from the game freezing (and losing 10% of experience), the loss of all connections for over 20 minutes and losing the map and waystone. I've played this game for 600+ hours, restarting new builds, enjoying getting to the endgame to just be let down by a stupid luck system (ROI), Connection losses and loot drops that are so ubiquitous they are worthless. The constant reminders of \"sales\" of the microtransactions (you can't have a sale on an infinite resource, it's just a price change). GGG constantly previewing builds (youtube etc) that only a few can afford, and the ROI system won't allow others to get the resources to enjoy those builds.\r\n  Absolum, sorted most of this out with 2 simple options, and the ability to play offline. Follow in Absolums footsteps, GGG. You expect us to support you, yet you don't support us in return.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Unless you are dropping major bucks on a PC...do not get this, it is constanly just bugging out and the optimization is a joke, 700 hours and my brand new PC is still not enough to handle it on low detail, very dissapointed and will not be back till it is fixed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game sucks right now, save your money and just play the better option of POE 1",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "My opinion is that this game is a bit false advertised.  It is really just a crafting/stock market simulator and not an ARPG at heart like say D2 or LE was.  The best loot is ALL crafted by a tiny fraction of the player base.   Literally zero BIS gear is dropped which kills any desire to grind campaign/maps as this is completely inefficient.  Why grind maps when you can sit in your house, be a day trader and make currency faster on the POE 2 stock market.  It just feels like a waste of brainpower and time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not recommended, very addicting and time consuming game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is fun, but it constantly crashes my entire internet and/or completely freezes up to where I have to ctrl/alt/del out. They need to fix the technical issues before I'd recommend playing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It’s way too early to buy. The game keeps crashing. Even though I have a high-end PC, it crashes after a while once I get into the game. It’s been almost a year since it was released in early access, but the developers still haven’t found a solution. I guess their only goal is to produce new content instead of fixing the bugs. I’ve tried almost everything suggested by other users on the forums, but the crashing issue still hasn’t been resolved. In the end, I’m giving up and uninstalling the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No floating damage numbers...  The game is fun, but like, come on? Makes me want to refund. Maybe I'll get used to it but seems like a weird Hill to die on. I'll try to find a mod for it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "They made the inventory management atrocious on purpose just to squeeze out money for microtransactions. And those purchaseable upgrades add just a little bit more comfort but the management still is EXTREMELY clunky compared to ANY other game with ANY inventory whatsoever.\r\nThe game loop itself is kind of satisfying (though there are some confusing mechanics at first)",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Im a long time player of ARPGS, name one ive played it. POE2 is too overtuned no one, and i mean no one asked for an arpg soulslike. Arpgs are meant to be a power fantasy, poe2 is just too overtuned to be hard. The graphics are great the class system the skills tree amazing you can get lost in the build crafting, but the enemies and bosses are just too much. So few people want to or have the time to spend 3-4+ hours more for many people on a single boss. Even basic mobs are just too hard. I feel like the devs are ignoring the mass of players who have stated this and the game balance just been unfair to the player it takes away any sense of power fantasy or freedom the player has. Its dissaointing. I was massively looking forward to this game but it just turns into a slog and hitting ur head on a wall. To the DEVS youtubers and streamers are not the be all and end all listen to the thousands of other players and fix the difficulty make it less souls-like and back to dungeon/zone diving fun,  this could be one of the best arpgs out there, ive been gaming for 30+ years listen to the feedback please.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I got scammed from ggg. I bought and played the game and now whenever I try to play it says that I dont have access to the game. I contacted support and they refused to help me even though I sent screenshots of my poe2 character from the official poe2 website and a confirmation from steam that I own the game. Dont buy this game you might just lose access to it just because the devs feel like it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game does not run well, even on computers exceeding the recommended specs. There are frequent stutters anytime more than a few effects are on screen and boss fights are a laggy mess. Lowering settings does improve fps but does not fix stutters or boss fight lag. Also this game is already over the, already high, 100 gb of install space and its not even finished yet.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No balance at all, you can comfortably play only on one class, if you take others you will just have trash dmg. Multiple bugs, sometimes game lags, imput lags too somehow.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just overall not a good game. It is better than D4 in some aspects but thats about it.\nI wouldnt pay for it again, even though i thought that about PoE1.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Runs bad/not at all\nHundreds of dollars of DLC on Steam alone for an EA game that doesn't work\nMentally unstable people will defend this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There are so many things about this game that suck but the worst offenders are the poor damage scaling at lower levels compared to swarms of mobs, the utter lack of loot drops (especially on solo self found,) the ridiculously slow leveling that makes waiting to even find out if a skill is worth using when you unlock it unsatisfying and the overall feel of trash combat specifically. Bosses are fun but when youre working on a setup of skills it is exremely annoying that you get killed by trash left and right. This is coming from someone with hundreds of hours in POE 1, all the Diablos and 1000 hours in Last epoch. This game coukld be great but then need to tune some stuff.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a dopamine trap. It doesn't respect your time. It's not well designed in many ways, but has addictive aspects that can keep your theory-crafting mind spinning. \n\nJust look at the thousands of reviews with astronomical hours of playtime, people pained to ultimately say this game actually stinks. Seriously. Sort by negative reviews and read genuine sorrow from people who really want to like this game. I really wanted to like this game too.\n\nI don't want to go into every single grievance I have, but I will point to the most mind-boggling thing I can think of: Trial of the Sekhemas; a mode of gameplay that, when you take a certain amount of damage, regardless of your actual defenses and health pool, you lose. There's nothing in addition to this mechanic that makes it interesting in any way. It's like they forgot that taking damage is part of some builds. Think about the person who designed this, and extrapolate it across every aspect of the endgame experience.\n\nI paid GGG $30 to playtest what will probably one day be a good game. Happy to take this one for the team. Keep farming those whales during early access!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I like this game and played  a whole lot of path of exile 1. My biggest gripe with this game are the insanely bad loot drops and the insanely overpriced shop. They have managed to monitize every aspect of the game.. but the worst thing is when you try hard to kill a difficult group of abyss enemies and absolutely nothing of value drops EVER... its insanely frustrating.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "longtime poe 1 player and this game just hasnt scratched the itch for me everytime i play it just feels like a chore",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At first, I was having issues because of optimization. It made me not play until it got fixed. Now the servers seem to be the latest problem. My ping will go from 75 to 10k+. My game freezes then fast forwards to catch up. Not only does it happen while walking, which is annoying enough. It also, and mainly happens when I'm fighting mobs. When the game finally catches up I instantly die. This happens every 10 to 20 seconds. If I'm lucky I can go a whole minute without it happening. \n\nTLDR: Don't get this now because servers are trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was doing Trials for my third set of ascendancy points and early on the third trial for a chalice fight I got a rare monster that would not take damage for 5 minutes meanwhile he's just whittling away at my honor, finally as I'm down to 300 honor he suddenly dies and I only get one honor restore before the boss for 300 honor. As soon as the boss fight starts the game glitches out, screen goes black and the loading symbol appears, meanwhile I can hear movement and attacks happen, when the screen finally loads back I'm dead at 0 honor. \r\n\r\nDon't waste your time with a game that doesn't respect your time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THIS GAME IS TRASH.\r\nSERVERS CRASH. \r\nUNDERCOOKED AND WHACK.\r\nSTEAM WON'T GIVE ME MY MONEY BACK.\r\n\r\n500 PING NO MATTER THE LOCATION\r\nWAY TO RUIN MY GAMING VACATION.\r\nAT LEAST LE/GD DON'T CRASH, MY DEARS\r\nTHIS CRAP THESE CLOWNS PUT OUT REALLY GRINDS MY GEARS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pretty pissed off. bought the game twice for me and my brother to play before. we got busy and could not play it. it was like 40 dollars. why am i not allowed to play the game when i bought it on steam? If I have to pay again im gonna be very annoyed. I was very excited to play this but i guess not",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "when will this game be free as promised? until then i can not recommend it because so many games stay in early access for years and because this game is not as popular as everyine expected i have a feeling it wont be free and complete for a while i hope im wrong asap.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game was pretty good up until Endgame. Then I got bored. Signed out for a while, and when my brother and I go to play again a few months later, both my POE 1 and 2 accts are locked. Ive never made it past level 5 in POE 1, and all I ever did in 2 was play their game..\n\nWish I could refund my money tbh.\n\nDo I recommend the game? Yes. Do I recommend you purchase it? No, it seems like the better bet is wait for full release so if your acct is locked they at least dont take your money from you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Your character will grunt and moan all the time like a small child immitating weapons. Your character will also say stupid action movie lines all the time. It is very repetitive and there is no way to turn this off.\n\nIts a shame, the rest of the game seems good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game, everything about it, exceeds any expectations you may have had for it.\r\nit IS that good.\r\n\r\nHowever there are boss encounters that so far out scale your play and expectation in difficulty that it really just takes all the fun away.\r\n\r\nThese bosses 1 shot kill with complicated mechanics that you will need to learn as on a first play character you can not out scale purely by grinding your level(the diminishing exp reward wont reach).\r\n\r\n\r\nI'm not done yet with the game yet, but as it stands this game truly awesome as it is, can not be recommended to new players whatsoever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's a beautiful game with outstanding visual design and effects\n\nunfortunately I didn't get to enjoy any of it because of the fucking delirium fog",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game looks like crap. No matter what graphics I use It looks like crap. Early access garbage. Trashhhhhh......",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has great potential with actual game play but it's being held back by technical issues. It's absolutely unplayable when you are inevitably hit by network spikes. It WILL happen, and it will kill you. At later levels you lose XP on death so losing a day's worth of progress due to the network ping spiking from 20ms to 600 ms constantly just feels bad. \r\n\r\nWait until the game's forum no longer has a +160  page long Network lag thread being posted to before you buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know I don't own the best computer but this game is so unoptimized that it's damned near unplayable playing solo. I have been waiting for updates to optimize it better but after a month still nothing that has helped me. Once there is an update and I can get through the first act with minimal stutter than I will give it a thumbs up because it is a fun game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "By most metrics, a great entry into the ARPG genre. So... why the thumbs down?\n\nWell, something you might notice early on is that, under the default key binding, \"M\" doesn't bring up the Map - it brings up Microtransactions. That right there tells you just about everything you need to know about this game's underlying design ethos. Granted, it's not pay-to-win as such, but a number of QoL features and virtually ALL character visual options are gated behind additional charges. These are, of course, paid for with a premium currency, the only true purpose of which is to add a layer of separation keeping the real-money cost out of mind while you're window shopping as an end-around for the psychological defense mechanism of \"sticker shock\". And yes, there are lootboxes. Of COURSE there are. Frankly, it's all a bit too predatory.\n\nAnd that's hardly the end of it. There's no customization of the basic characteristics of each class - sex, skin tone, hairstyle, facial features - whatsoever (presumably because if the ability to play a black sorcerer were put behind a paywall people would riot, so the financial incentive isn't really there). And rather than doing the sensible thing and just identifying individual players by username, they've stuck with the approach of \"no two characters can have the same name, EVER,\" which is just bizarre.\n\nOf course, this is still very much an Early Access game - it hasn't even got SWORDS at time of writing - so any of these issues could still be addressed. If so, I'll update this review accordingly. But as it stands, I can't in good conscience recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was extremely excited until I learned they just wanted a Diablo VI x Dark Souls x Torchlight feel that is as sluggish as a drugged up herion addict.\n\nIf I wanted the sluggish memorize attack patterns I'd go back to the good OG Console classics that started it.\n\nDodge rolling as sluggish as a windows ME machine running bitcoin mining.\n\nI'll be surprised if you people don't start demanding they add paid DLC and P2W microtransactions with what this has given.\n\nStay with PoE 1.  That is when they gave a fuck about their product, playability, seemlessly smooth combat and worked with player feedback on an impossibly complex system.\n\nThis is something they have openly admitted has fucked up both games.\n\nI guess they really are following in Blizzards footsteps.\n\nI have never once regretted buying a game, full release or early access until this fuckin mistake.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PoE2 is an awesome looking game. I am always looking for these types of games and I have played a decent amount of them. The bosses are fun and scary but I just can't come back to this game. I do not enjoy the difficulty of this game. I wish it was easier for the more casual player. There is already crazy difficult content in the endgame and I just don't want to struggle just to get out of the campaign.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game this horrible because new update kills a build, the potions at higher levels suck level 50 get a potion that gives 1 hp and mana this game is peak. Don't forget the REALLY bad drops",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Chapter 1 story is fantastic. After that, you'll feel the downfall. This is always a bad omen.\n\nAlso, Takavai should DIE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too difficult, and I've played a lot of ARPG's, with hundreds of hours into Diablo. Its fine if gamers enjoy the game, but its too difficult for my taste and not fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst piece of crap I have ever played, somehow it's even worse than POE 1 \navoid at all cost even on discount, devs should be paying you to beta test their piece of shit game, if you can even call it a game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "typical poe, grind grind grind. Good visuals but bad gameplay, you will keep dying from invisible lethal 1 shot spells, rays through walls, random disconnects. There is only few playable classes, classic classes just suck. Very unbalanced difficulty after 80lvl for classes, you can level your class until 80 and only then on the maps to see that you just wasted your time. if you character is walking that means you already screwed, there is only jump blink leap style of gaming. It could be a great game but high game content is too unbalanced",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has an amazing base. Cool skills, items and talents with tons of potential options. It plays well and the devs have done a good job of mixing attributes of ARPGs and Souls games. The problem? None of that cool customization really matters, because the damage output of enemies is so high that the game essentially boils down to \"don't get hit\"\n\nAre you playing a Spell user with high energy shields? doesn't matter. You get one shot\nRanger with high evasion stats and cool bow skills? you too, get one shot\nMaybe the warrior with his high str, HP pool and shield? Nope, you get one shot.\n\nThe damage is more egregious than the endgame of elden ring. It strangles all the fun and novelty of making builds out of the game because \"did you dodge the boss\" is the only thing that really matters. Well that and optimizing your DPS since that's really the only thing you can do. So I hope you enjoy dodging and reading build guides so that killing bosses is less of a slog with their spongey HP pools. Thus defeating the purpose of the RPG mechanics entirely.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For something that was announced to leave Early Access within 6-12 months of its original release, this game is nowhere near 1.0 with the game in its current state being worse than the original Path of Exile.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cringe grindfest even during the story. D4 is better because you start grinding after reaching max level with all skills unlocked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really want to recommend this over PoE, but I simply can't.\nExcept for the visuals, this game is below or on par with PoE.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is certainly a work in progress. It has a ton of potential, but the play experience is filled with rough edges and needlessly hampering systems. This uneven design makes it hard to recommend at the moment, but maybe in a years time things will have improved.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game runs like crap even though when it first came out as beta it ran smooth as butter",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s a great new idea for the Diablo-like genre. I had a great time going through all the acts and discovering new things on my first run.\nThe problem is that the game has so many elements that make creating a second character or starting a Season feel like a massive chore you want to avoid. The movement is very slow, the stuns are frustrating, the endless mazes get annoying, and many bosses feel extremely overtuned—even with a full group. There are tons of bosses, yet you almost never get a drop that gives you the dopamine rush you’d expect, especially compared to Diablo 2.\n\nWhy is Act 1 the most liked act in Diablo 2? Because it’s linear, the maps are simple, and the quests are straightforward. The most disliked acts are probably Acts 2 and 3: more complicated layouts, dead ends, bridges and rivers that force you to backtrack, and questlines where you have to assemble multiple items from different places that clutter your inventory. Unfortunately, this kind of design seems to be everywhere in PoE 2.\n\nAs you can tell, I’m a Diablo 2 player. I couldn’t get into PoE 1, Diablo 3, or Diablo 4. I really hope PoE 2 can eventually become my cup of tea.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game makes me nut and piss everywhere a lil but i cannot do that too good because game is so horribly optimized :( please ggg fix your game instead of adding more transactions so i can keep nutting and pissing thanks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so far i hate the 4th ascendancy trial, feels too time consuming to get those last 2 points and the fact that u either have to do ultimatum trial or the other one with the floors feels too forced (i hate both mechanics). thus far i didn't like the builds i went for, so i tried a flicker strike for a change since i know it is fun. and man it must be the most bugged skill in the game. it works by consuming power charges, BUT i have noticed that whether i have 1 or 7 charges, it sometimes just attacks 2-3 enemies in front and stops, completely ignoring the other 20+ enemies around me and i just die. other times i use it with 1-2 charges and it goes for a while. Also some times i seem to randomly teleport around while running, don't know if it coz of headhunter rare mob buff or some bug with flicker. Then there is the almost infinite flicker strike on the last 1-2 mobs left that does 0 dmg and wont stop unless i stop it. I also like and hate how the new atlas works, and instead of maps u have waystones now, i did like choosing simple maps to run that weren't absolute headache labyrinths, but it does seem more interesting. Then there is the spirit mechanic, seems a bit interesting but i did like how in poe1 u could choose to reserve health as well,  and i did like how it was either a flat reserve or % reserve of mana. Spirit feels a bit lucking and underwhelming, same with buff skills.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is probably just me but the power imbalance seems off. I am level 8 going up against monsters that I cant even  put a dent in there heath bar.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fix end game plz not fun when try do max level shit and just keep deading about monter are to op",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pressing 3 keys for dozen of hours is not my thing. Multiplayer makes most fight trivial, but if I want to play solo I'd rather play hades for much more rythmic gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Holy lag and crashes servers are still azz very cool game when you can play without crashing every 20 minutes. Fix the servers and release all the classes and this game gonna do some numbers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a good game but i can't recommend it. \nI thought I enjoy the game but I am just falling asleep every other map or instance. It is too slow paced and the loot is horrible. I don't get the feeling I get from playing POE 1 or grimdawn, diablo, most of the ARPGs in general. \n\nI think it has a good direction but as a fan of a few thousand hours in POE 1... this has lost me good. Back to keepers of flame league poe1",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely frustrating with extremely poor-taste gameplay mechanics designed to ragebait you into continuing to play rather than being fun.  It's only a better game (technically; better graphics controls, less fun) than POE1 because it is essentially an update to POE1.  Hopefully they make some choices in full release that actually make the game enjoyable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad game. only good if u want to be a sweat who has to constantly google meta builds. not good for casual players just tryna chill not worrying too much if a build will be decent. better off playing diablo instead atp",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cant recommend due to GGG not fixing server-side network lag after 2 years in beta, and they're releasing 0.4 in December but it wont be playable because your game will lag every literal 3-5 seconds in 5 second intervals. Absolute trash that this game cant be played at random times because of network spikes ranging from 30ms all the way up to 150ms. This alone ruins the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The good: End game has a lot of choices or variety compared to D4.\n\nThe bad? If you are a casual gamer like me who can't play all day like the hardcore players, forget it! By the time you finish the story and play the end game, the season is almost over. They should make a way for players to jump straight to end game without going through the story for the 100000th time. If there's a new chapter let us at least start from that. If no new chapter, just let us start from the atlas map. Maybe add new mechanics so we can level up using the end game content.  \n\nCrafting is so complicated as well that if you are a casual gamer, forget about crafting decent weapons/equipment to enjoy the end game content without dying all the time. You'll need a lot of crafting materials (or currency) that you will never able to collect enough of without sinking in so many hours to this game.\n\nAs an added bonus, if you ask for help like if some one has spare weapons/equipment or crafting items, you'll be vilified because apparently \"begging\" or asking for help in this game is crime against humanity. The community (not a lot but enough) will report you and get you muted or banned for asking for help. Compare to D4 where people help you or the very least ignore you when you ask for some help.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game has been in early access for almost a year. How do we let devs come out with games like this. Found the game to be tedious and exhaustion to play and that is without the crafting part. I'm all for grinding but this takes things to other level, and maps are a joke. Lets talk about Seasonal metas, Season 1 lightning. What about Season 2, that's right lightning. Surely for Season 3, nope lightning. Any guesses for Season 4? Lack of build diversity makes this game a one character play through for the season. Do I regret getting the $100 early access supporter pack? No, I'm all for supporting games but when Devs don't listen to the fan base it becomes demoralizing. As long as Jonathan keeps telling us we are playing it wrong cause he's having fun then my time will be spent on other games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "omg no .too many problems and not beginner friendly game aty all .dont wasste your money if you want to play casual or to enjoy after your hard work in real lif. just avoid this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Repetitive slop, attracts the worst players and the staff is horrible on enforcing anything.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Account was stolen by  Russian hacker. GGG refuses to give it back. Now my steam account is tied to a locked account. Stolen game account, stolen money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At first, Path of Exile 2 seems wonderful — the animations are great, movement feels responsive, and dodging looks and plays nicely.\r\nBut the further you progress, the more its problems start to show.\r\n\r\nThe game is extremely grindy. You’re pushed toward spending real money for features that feel essential, such as trading with other players. In the evenings the servers become overloaded, causing constant lag and stuttering.\r\n\r\nGetting good equipment feels like pure gambling — either you spend an unreasonable amount of your time grinding for a small chance at upgrades, or you’re expected to spend real money. Optimization is also poor, with inconsistent performance even on good hardware.\r\n\r\nMost builds feel similar as well, because everything is centered around dealing as much damage as possible. Secondary effects like frost, ignite, or shock barely provide any meaningful benefit early on, so there’s little sense of build identity or specialization.\r\n\r\nMaybe I’ll try the game again at full release, but right now, for me, it’s not in a playable state.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is getting worse by the day. Even when you more then double the PC requirements to play the game it will crash, graphics freeze and they offer NO SUPPORT. You can try emailing them, they will email right back saying they don't support emails right now and to check out their bug forum. You can go to that forum follow every step make every update and nothing. You can attach screenshots and show everything that is not working and not a freaking peep. The game worked okay on launch, not great but okay for an early release most issues were solved with a quick restart or hot patch. This has been happening for weeks and they have been useless. Don't waste your money on a game they don't support or show signs of finishing in the next year or 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If they genuinely think they can release the open beta by the end of the month to the start of December this game will flop on release. It's reputation will be ruined forever. It is actually unplayable, the game skips and lags and eats so many resources to support what appears to be malware disguised as \"shaders\" (Joke). It's ridiculous how poorly optimized this game is. I can run MONSTER HUNTER WILDS on my shitty HDD pigbox PC without lag, or at least with only a bit of lag on loading and then its smooth sailing. On low of course. But on this game? I put everything low and I get massive lag spikes forever, nothing loads, and the shaders on the graph looks like dubstep. How do you honest to god make your game run worse than MHW. Like I expect long loading times cause HDD, but this game just does not load anything and the shaders seem to absolutely pigstomp the game. Even if they add more and better content than poe1 this game will forever be a piece of shit if they don't fix this garbage. Even my friend who has a supercomputer lags in this game it's horrible.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Honestly it was fun and still is fun, but do not t\\get this game. They have taken a page from many other developers and learned that keeping a game in early access forever and milking the payerbase (intentionally spelled like that) is the way to get rich and avoid criticism. game is getting worse at optimization? its early access. game is unbalanced? same. game is full of greasy pay walls for the stash? just plain greedy especially with the new trade system that you have to buy new tabs to use.  in conclusion, if they weren't greedy this game would be great.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So full release when? As far as i remember when i supported this game last year it was gonna be in a projected 6 months from Early Access to Full Release. Nearly one year later and it doesn't seem the developers aren't going to deliver on that projection.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I tried so hard to like this game, playing far longer than I should have because some friends were playing too. But the bottom line is the whole thing is just terrible. From the glacial campaign pace, to the terrible level designs, to the horrid disaster of a loot and crafting system, to the absolute joke of the end game, nothing about it makes sense or is fun to play. It's just a frustrating mess full of random arbitrary nonsense. And no, nothing about this game is \"brainy\", it's just laughable facade, and everything about the design makes it clear that the number one design choice was not fun or interesting game play, but to suck up as much time as possible. It's screams through the entire time you play.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The most interesting classes are female characters, which makes gender lock in RPGs as a 'genius' idea.\n\nThe optimisation is poor, with a lot of performance issues and crashes. Tuning for gamepad/steamdeck play seems to need improvement.\n\nApart from the above, the game feels great, like a mixture of a Souls-like and an ARPG, but it's not worth the money yet -> it's better to wait for the release",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would not buy this again until the shader caching issue is fixed. Loading into maps it takes minutes (I used a stopwatch) to cache the shaders and make the game playable. Many other people report similar issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wouldve give this game a 10/10, but after 630 hours I just simply cant play the game because of the latency spikes. Nowadays I just open the game, look at the latency indicator and just close the game because its just going up to 100k+ even tho my live connection is perfectly smooth. Rarely I find a day where the latency looks normal, only to get slapped on the face by the instant latency spikes right as I start a juiced map. Unplayable, but a really good game...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe it's a bug, but the controls for this game suck. Playing a ranged character sometimes you will just run into packs of monsters for no reason and die. \n\nIf they fix this I will change my review and the rest of the game is good. But this control issue or bug makes it genuinely unplayable for ranged characters",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you are effectivly always single player still affected by other players on the servers... servers are potato based",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hard but fun, not really fun unless you invest over 100hrs and know every items detail to the core!\nRecommend it? Nah not really,  bought it, it was ok, but updates ruined it and now it sucks!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get tricked and pay for this game. Also don't get tricked and buy anything in-game. Low FPS and performance, also like other people have said the game has 100's of different builds and about 2-3 that are valid if you want to play past lvl60",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "do you think i have lots of time to play this game ? nope\ndo i enjoy it ? yes\ndo i like it ? no\ngrind too much of it i cant spend 26 hours of gaming just to reach a point of satisfaction-level(here i speak character-wise). i cant just change every now and than my favorite build juist to play and be creative aint simple for me. make if you wish 2000 classes,  50000000 items that random spawn yeah im outta here. thank you",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "End game is so bad i just cant play it anymore, the devs want everyone to just play deadeye apparently since everything else gets nerfed to the ground. Do you have hundreds of Divine orbs to spend on 1 piece of gear? No? then you're screwed. Can't kill everything before it's on screen you're screwed. Melee characters are unplayable. Market is terrible for new comers because everything is priced unreasonably high. I have almost 1500 hrs played and never seen a mirror and i run maxed quantity on my maps constantly (prejuiced). Perfect exalt will still land you at a tier 3 modifier. Game freezes and crashes at random which you'll lose all progress and items in that map and be told the map was failed. This game was 1000x better when it first started. I'm done playing this game for a while until they fix alot of stuff (if they fix it). 1/10 would not buy a supporter pack to play",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Singapore, Hong Kong servers have been crashing and lag spiking like crazy over the past 7 days. One lag spike and dying and I lose 2-3 hours of exp grinding. FIX YOUR DAMN SERVERS",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Been excited about playing this game for a few months now and when I finally purchase it its now forcing me to play as a black guy if I want to play the warrior class. That's not representative of me nor will I be forced to play as one and I damn sure dont want to spend money on a game that's going to force me to.  Requested refund roughly 5 minutes after seeing this bs give a skin tone option you gd losers. So frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Top of the line PC, 5090, 7800x3d, 64gb ddr5, gen 5 nvme\n\n<10fps in endgame maps with deli and playing lightning arrow. With frequent crashes.\n\nThis should not be ok for todays standards.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Whats the point of buying a FTP game I cant believe people pour thousands of hours in this game when its a worst version of diablo.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to like this game. I loved the original, but this one just isn’t enjoyable for me.\n\nDungeon crawlers are supposed to be about mindless fun. Killing monsters, grabbing loot, exploring cool areas. But for some reason the devs decided to inject Dark Souls-style combat into the mix, and it just doesn’t fit.\n\nThe boss fights boil down to five straight minutes of dodge-rolling nonstop, and if you slip up even once, you’re dead. It stops being fun and starts feeling like a chore.\n\nReally disappointed with the direction they took.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tencent bought GGG and is its sole owner now, so I don’t expect much. Definitely do NOT buy until full release.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gotta be honest with you. I'm not impressed. Has little to no real content to do and the combat system and items are way too simplified and uninteresting when compared with what came before it (not even just talking about PoE 1 here). Maybe in a year or two with more time in the oven it'll get there, but with what's here  as a foundation it's not that great. Back to hundreds of hours in Diablo 2 I guess while I wait for something to come along to dethrone it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is a significant downgrade from PoE 1 and is also just not remotely ready to be played atm.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "new engine?nah\nnew classes?nah\nnew mechanics?nah\nnew expansion?nah(maybe...but just give him another old mechanic with new same graphics)\ngo to coffee break and then home...\nso many hours work and steel bad versus original one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is not a simple way to check if a piece of gear or skill will make you stronger or not. Respec is a pain in the ass. It lacks several quality of life features that are well stablished and expected in the genre.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Banned for no reason in act 3.\n\nVery cool. Checked the forums and see that this is a common thing to happen where I was at. Has been happening apparently since last year to people in the exact area I was. Neat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game overall LOOKS pretty (When its running) so far. The negative review is because new games like this and say \"SilkSong\" are literally trying to give me a swollen fingers AND a heartattack at every moment. I get that you want mobs, totally understandable, BUT MY ISSUE is strictly with the surprise element that i have to go through for every MAP. At least one runner-type that requires that you use that ONE skill, a skill that stops enemies from rushing YOUR position. not a huge problem in MOST games BUT this one has \"Legendary\" creatures who use skills OFFSCREEN. NOT only do you have to use that one skill for an enemy that appears out of the side of the screen, giving you just barely enough time to try to use that skill (Or that shitty dodge mechanic which i WILL discuss later) BUT ALSO to have Legendary shooting their big skill when you can barely react. some of these guys have a massive SLOW/STUN that cause that one skill to STOP YOU DEAD as the dmg kills you. Over and Over again. This feels like you're just abusing MY lack of ability to 'zoom' my camera out to one-shot me from enemies who are firing at me (or USUALLY winding up a big shot) that i have ZERO time to react to. This is a function that the dev's created with intent to make it a challenge BUT it gets annoying due to the absolute lack of a true dodge that causes one to \"Do a barrel roll!\" meaning that once the roll is over i \"should\" be able to move and act BUT the dodge is SO lame and weak against bosses and \"Legendaries\" who can dmg you through with far more than just ONE skill. I LOVE the graphics and the way that skills interact and upgrades BUT these are mere features inside of a GIANT Mob battle game with a bug that never even lets me get one full hour of playing time without cutting out (USUALLY during big battles). Please, either let me zoom out WAY further with the CAMERA OR stop giving creatures the ability to kill me from off camera that the game gives you ZERO warning or clue for. Shits ridiculous....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "0.1 Haven't played in a while, but last time I played it was the very antithesis of fun.\n\n0.3 (I skipped 0.2) The game is way better now. We'll see how 0.4 goes.",
      "voted_up": false,
      "votes_helpful": 5
    }
  ]
}