{
  "positive": [
    {
      "review": "It might be a copy of Forza Horizon, but what they put in the game is quite interesting, like the history of Bugatti and other brands. The game is also very beautiful. People say that the Ubisoft launcher is buggy, but I didn't have any problems. I liked the game and I recommend it.",
      "voted_up": true,
      "votes_helpful": 43
    },
    {
      "review": "The vibes? Immaculate.\nThe visuals? So gorgeous it made me feel bad for every wall I accidentally introduced my car to.\nThe handling? Smooth enough to make me think maybe I can actually drive in real life. (Spoiler: I cannot.)\n\nIt’s chaotic, stylish and somehow turns every playlist race into a wild showcase of vehicles where they get their own spotlight moment.\n\nIn short: I loved it. Would floor the accelerator into paradise again.\n9/10 This can't be a Ubisoft Game",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "Amazing game 9/10 the most time, though the engine still being capped to 60 frames for gameplay reasons is still a bummer.\n\n(For the Steam Awards 2025, I voted motorfest for the labor of love category due to the game getting content every week, with amazing effort put into each.)",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "If you came to this game disappointed by the fact that Forza Horizon 5 turned out to be a lazy reskin of Forza Horizon 4 without new ideas and features, a boring map, and dripfeeding you cars conveniently cut from the game beforehand, then you've come to the right place. Don't get me wrong, FH5 is a fantastic!!! game if it's your first Forza Horizon, but for a fan of the series, it's quite disappointing in terms of missed opportunities and lazy practices in post-release support. \n\nIn my opinion, Motorfest is better than FH5 in every way except of graphics, it's not bad by any means, FH5 just has a more technologically advanced engine, but Motorfest wins with vibe and style!!! The map is infinitely better, the visual customization of the cars is incredibly cool, the cars feel like cars and not like collectibles, i don't know how to explain it, you want to drive them, not just collect them in the garage, they feel more weighty and the first-person camera is done gorgeously, with slight shaking and all sorts of animations of the character's hands, and not like in Forza where the crab-like hands are made like \"insert a steering wheel into them\". \n\nAnd what always turned me off about Forza in terms of customization is that visual customization is tied to the car's characteristics... you put on your favorite bumper... that's it, your car is no longer meta, but here visual tuning is untied from the characteristics, and therefore it brings pleasure, and you don't need to be a mechanic to stick on your favorite body kit. The game also features an interesting reimagining of playlists, where the races within them are linked by a single theme with tons of activities. \n\nDevelopers support the game with free updates featuring new playlists, cars, map expansions (and not like in FH, where you have to load each new area separately) and features like chase mode. That's why I give the game a solid 9/10. It has some bugs, it has some flaws in the multiplayer component, and the engine is limited to 60 fps, but for me these are minor issues. For me, this game beats the latest iteration of FH.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I really enjoyed this game. The best part is that I can play with my friends, even if they don’t buy the game. The demo lets them join my crew and play for many hours, and that makes the game way more fun.\r\n\r\nThe grand races are super exciting, and the graphics look amazing. The cars, the roads, and the whole world look very beautiful. Sometimes I just drive around to enjoy the views because they look so real and colourful.\r\n\r\nIf you like racing with friends and love big open-world games, this one is really good. I had a great time playing it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "If you like racing games and exploring open worlds, it’s a great choice.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i'm glad when ubisoft finally add some official rims in motorfest + some stance customization. i hope the next update there will be more customization parts & features",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "VERY similar to Forza Horizon 5, but with more schenanigans... and bikes! and Boats! and Planes!\r\n\r\nHowever it is locked at either 30 or 60 fps, which is stupid for PC games. \r\n\r\nGraphics are great and game runs well. \r\n\r\nThe ubisoft launcher requirement is STUPID though, and absolutely detracts from the experience of the game. Overall if you enjoy Forza Horizon 5 this is a nice silly arcadey extension to that gameplay while we wait for 6 to come out in 2026.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stunning, artistic visuals and very pleasant sound design, from the roar of vehicle engines to the ambient effects, though it could have been much better.\nGreat for both leaderboard competition and for chilling out while cruising Hawaii’s winding roads.\n\nWeaknesses:\nThe game is called The Crew, but sometimes there are major problems with syncing and playing via invites with friends, and I wish you could form a crew with more than four people.\nSome special items require spending a huge amount of CC to obtain, which isn’t worth it, and some playlist challenges don’t give rewards that match the large number of challenges you complete. I wish playlist rewards included better items.\nGrandrace still has HUGE problems.\nLow FPS glitch!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bought it expecting something on the level of a Forza Horizon game, but it falls a bit short.\r\nI don’t really understand the point of collecting cars when most events just loan you the vehicles you need anyway.\r\nThat said, it’s still a fun game for free roaming around the island and customizing your own cars.\r\n\r\nWorth grabbing on sale, but not at full price.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game actually the game is so cool. Game is hard but you need to try this one",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game, good story, very beautiful graphics, absolutely fun physics(fun not realistic) Would absolutely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, this game is solid. I can't speak on the Crew feature since I'm always solo but I've had a ton of fun going through the different playlists. Grand Races are a mixed bag (it honestly depends on well you can drive and how other people around you are driving) but there's still some fun to be had there too. 8 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The graphics are honestly good, grand races are fun, the playlists got variety so worth the shot imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THe game is very fun, very similar to forza but it has something about it that just makes me choose it over forza though. Especially when real life creators collab with the game to release new cars. THe game just has somewhat of a pull on me when i got the demo first but now that i have the full game its kinda tuff. Money well spent if you ask me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its great game with tons of customization for a car.Sure NFS have a mile better customization.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "please can anyone tell the experince of racing with sim wheels ,i already good with controllers just want to know if its worth upgrading to a wheel .Thanks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty good alternative to forza 5,the graphic's are decent,gameplay is smooth,the only thing I slightly dislike is the fps cap as I feel my monitor isn't being used to its full capacity alongwith the gpu,but if your looking for an arcade game this is it! Would reccomend a controller or a sim for a better experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Being honest, this game is better than FH5 by far. The playlists are good, the map is great, the cars offer more customization, and it works pretty well on both controller and steering wheel. The downsides would be the 60 fps lock, the lack of fullscreen, and the fact that you can't use your own cars in the playlists.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game in racing genere,good graphics,physics and over all good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For me, this is the best open world racing game right now. I love cruising around the Hawaiian islands in my favourite cars and bikes. I cannot recall any other open world racing game which has such a diverse set of vehicle categories including monster trucks, demolition derby cars, planes, boats and also a jet and a helicopter. The graphical quality is much better than the previous game The Crew 2. I can't wait for the third island to be added next year.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better cars added every season with unmistakeably smooth graphics, 11/10 as always",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love how big the map is. It took me sometime to travel across the map even with plane. \n\nLots of vehicle here unlike its competitors. But the grind is a little bit hard. It'll be a little bit of pain to grind for hypercar",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "would help if the controls were more fluid like forza\nfelt stiffy but ig the graphics make up for it\nchanging from car to plane or boat when youre about to crash is worth it\n10/10 transformer mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of events and content to enjoy, an absolutely stunning map, and a surprisingly vast and varied roster of vehicles, with a majority of them having quite a lot of customization.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute amazing game and incredible colour-rich gameplay which makes it so much more fun to play for hours and not getting bored by how good the vehicles look in different places, lighting and speeds. I am absolutely amazed by this game since I started playing and it made me way more competitive in racing games. It is wonderful and way more playable than the older game which had a bit of a lack in colours and graphic settings.\nThat got me less excited to keep playing although my friends made me play longer than I would have done myself if it wasn't for them.\nRating: 11+/10 would definitely recommend anyone into 'Vehicular Culture'.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seriously one of the best racing games ever made imo, its really underrated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "personally i like this game more than motorfest- the missions are just more unique its very enjoyable and also i just like the progression in this game much more- you can get cars or just really good rewards for most missions and also the intro music slaps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good racing game, tries to be original without going too off-road (no pun intended).\nI especially like the new direction of the year 3, and since the game is still getting new updates compared to most of the other popular racing games, it's great to play now and then.\nAnyway, if you want to get the game, i'd suggest you to get it on sale. I got it for like 20 bucks and it was a really good decision (for once).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some may say Forza Horizon 4/5 > TheCrew Motorfest. You know what? I say TheCrew Motorfest > Forza Horizon 4/5. \n\nUbisoft Launcher isn't buggy (atleast I never had a problem), with each update game just keeps getting better (new islands, cars, content, etc.).\n\nGive the game a chance atleast with those 4 hours full game demo. It's the least you can do before you judge the book by its cover.\n\n\nPraise be Ubisoft!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game's graphics are very realistic. The variety of cars, the size of the map, and the racing adrenaline are all excellent. As a BMW enthusiast, I really loved the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love The game recommended for anyone looking for racing in variety of vehicles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game for me is like Forza but less complicated and pay to win. like everything is unlocked automatically or by completing tasks, but in Forza you have to pay to unlock some of the gamemodes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game and graphic Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great graphics and overall a fun game to play, especially with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fix the optimization, make some daytime filters less disgusting, increase the car adding frequency (not one useless car that no one asked a month), and finally fix the feel of speed. like bro why 400kmh barely feels like 200 and 200 feels like 100? just add some lens distortion and shakes at high speeds and the game would feel so much more immersive, i cant believe you guys are satisfied with how the high speeds feel like now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Motorfest is such an amazing racing game !!! ⭐⭐⭐⭐\n There’s honestly so much to do in it—driving cars, riding bikes, taking boats and even planes out, plus off-road, on-road, and track racing. The variety of vehicles keeps the game fun every time I play. And when you team up with friends, it gets even better. I really enjoy this game a lot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Options > Audio & Language > Volume > Cara: [b]OFF[/b], CARA VOICEOVERS (AI ASSISTANT): Switch everything to [b]OFF[/b].\n\nHave fun :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "go vroom vroom and the game is pretty fun cars sound nice and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It might be a copy of Forza Horizon, but what they put in the game is quite interesting, like the history of Bugatti and other brands. The game is also very beautiful. People say that the Ubisoft launcher is buggy, but I didn't have any problems. I liked the game and I recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Crew Motorfest has quickly become one of my favorite racing games on Steam. Every update they release makes the game feel fresh and exciting, and I genuinely love hopping in to grind for new cars and money.\n\nAs a proud collector of Ferraris and BMWs, this game keeps me hooked with its huge variety of vehicles and the satisfaction of expanding my garage. The driving feels great, the world looks amazing, and there’s always something new to do.\n\nIf you enjoy racing, collecting, or just cruising around, I can’t recommend this game enough. Motorfest keeps getting better and better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to just drive around with friends on, if you have a wheel its even better, i have the g29 and it doesnt disapoint!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is excellent but the account linked to ubisoft got hacked cant play despite owing it such a shame",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is just something else beauty everywhere from the map to the cars to the devs support to the game really the best game if you car lover",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plenty of cars, plenty of fun and things to do around, the graphic is amazing and the game is nice to play with steering wheel. there are still so many bugs and ubi servers are overloaded and you will get kicked from the game offten.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rating: 9/10\r\nGot 100+ hours in Crew Motorfest and I’m still not bored. The driving just feels good and the whole vibe of the game keeps pulling me back. I hop in for “just 10 minutes” and end up playing for an hour.\r\nYeah, the start is kinda grindy, but once you unlock more stuff it gets really fun. Only real cons are some small UI weird stuff and matchmaking being slow sometimes, but nothing deal breaking.\r\nHonestly, this game is a banger. I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is really good, yeah getting expensive cars in this game is a grind but its still fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First time player here and I liked to say I loved the game, this was the first game I had to buy a controller for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Race game that somehow suck you in, the graphic is decent and the gameplay is fun. The posibility to play multiplay or solo makes the game a lot more playable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its an very fun driving game with lots of fun tasks.\r\nthe only sad part is the optimisations. i have an gtx 1650, and get 30 fps on lowest settings.\r\noverall good game but a bit overpriced\r\n\r\n7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played so many racing games in my life, all the way from Arcade games like outrun, PC games like every single NFS and even Simulators like Assetto Corsa and Grand Turismo. But out of all those racing games, This in my opinion is the best, it is like a love letter to everything automobile, Ranging from Cars and bikes to boats and planes. This game took the spot of my favorite racing game from NFS UG2. This game is truly beautiful and makes me happy playing it everytime. Thank you Ivory tower for this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice drive sensitivity, good design on competition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing for 100 hours, i find the game is great\n\nCons:\n- Stuck at 60fps\n- Ranked GR is flawed\n- Playlist really gave you loaned cars, which itself is fine, but not giving us our car to drive first time was just insane\n- RNG upgrades for the things like skill and boost stuff\n- Car prices are insane\n\nPros:\n- Some car customization lookin fine\n- Street Riders playlist is good, just drive from destination, you'll see\n- Hawaii is good\n- Car sound\n- Cars\n- Vehicle Import from TC2\n- Quality of Life updates (if only they could do hotfixes and add those features from time to time instead of waiting the next season)\n-\n\nI may not good review person, i enjoy the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played so many racing games in my life, all the way from Arcade games like outrun, PC games like every single NFS and even Simulators like Assetto Corsa and Grand Turismo. But out of all those racing games, This in my opinion is the best, it is like a love letter to everything automobile, Ranging from Cars and bikes to boats and planes. This game took the spot of my favorite racing game from NFS UG2. This game is truly beautiful and makes me happy playing it everytime. Thank you Ivory tower for this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean it's not as realistic as Forza but this is more fun to play and that's what matters most.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay and visuals. Best current Ubisoft game hands down. Has good wwekly content and great updates every 3 months. \n\nFrame cap at 60FPS isn't the best, but workable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A thrilling, vibrant racing experience with stunning visuals..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With the updates coming for now, this seems to be a better live service racing game. Lets hope they continue with the updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Crew Motorfest to REWELACJA w świecie gier wyścigowych! Przeniesienie akcji na Hawaje było strzałem w dziesiątkę.\nŚwietna atmosfera: Festiwalowy klimat na pięknej wyspie O’ahu jest po prostu zaraźliwy.\nSuper różnorodność: Mnóstwo pojazdów (auta, łodzie, samoloty) i trybów (Playlists) sprawia, że gra się nigdy nie nudzi.\nGenialny model jazdy: Dynamiczny i satysfakcjonujący, idealny do arcade'owej zabawy.\nGrafika jest cudowna, a ściganie się po tych malowniczych trasach to czysta przyjemność. Must-have dla każdego, kto kocha szybkie samochody i otwarte światy.\nWskakuj za kółko! Baw się świetnie!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best racing games ever. \nThey never stop with the great free updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Далеко не форза, но как аркада на пару вечеров затягивает, машинки делают врум врум и уже прикольно",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good arcade racing game with great variety, PvP racing needs major reworks , certain aspects are not looked after correctly, but frequent updates with new content are great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun, give it a try, remember to boost your sensitivity and dynamic lock in control settings (default 50/50), as close to 100 as u can, otherwise u cannot steer in the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the map & events are good the playlists are great when u want underglows etc i would recommend getting it from the cosmetic show rather than the cosmetics shop it costs 100$ but is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly fun, love the car sounds, to me they sound quite realistic. I prefer the driving physics of this game over the crew 2. The garage import is nice too, when it works.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To be honest, I’ve never enjoyed a racing game as much as The Crew Motorfest. The engine sounds, the car selection and the world design are all incredibly well done. I can spend hours just driving, exploring, and disconnecting from everything. It’s the kind of game that lets you breathe and just enjoy the ride",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a pretty fun racing game. Lot's of grind compared to Forza.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nothing but good also please if the developer sees this comment i recommend to optimize the size and reduce lag for those player that have a lower device",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I know that it is fun to hate on Ubisoft and honestly everything about this is justified.\n\nAll i want to say is that Motorfest actually is one of the better Racing Game Festival Styled Titles delivering a truly ridiculous amount of content.\n\nBesides the Monthly Main Stage Content and Weekly Summits being themed individually bringing fresh experiences; I'm still not done with the Singeplayer Content after 115 hours of playtime and they keep releasing more and more Playlists each with appreciatable narrative and detail\n\nIvory Tower has removed the FOMO aspect entirely by making it possible to not only play all the \"missed\" content from the monthly Main Stages, they even let you unlock Exclusive Vehicles from Past Summits by earning Prestige Points inside the Custom Mode\n\nSince there is a lot of people not being able to properly link their Ubisoft Account to Steam; i'm here to tell you that this game indeed is worth your time; just be aware of the game being like 80% off in sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goated game pretty fun map kinda mid frl forza maps are better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game with different stories and background about the most popular car brands",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, but you have the worst fucking ranking system i have ever seen in a game. what kinda fucking team do you have? just a bunch of retards in the office?? how can i win and still loose rank? fix your fucking game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i swear this game has such a cool map, and it's fucking big as heck, and not only that but there's a lot to the game, and whenever you get a new car, you feel like you've actually earned it and it feels satisfying as heck, in comparison to forza horizon 5, which never feels satisfying to get new cars, because the game just makes earning wayyyy to easy, and it just pours you with money like as if money grows on trees.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "second best racing game after forza horizon series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vehicle controls are definitely more on the arcade side but the element you'd enjoy the most is the Environment they've built in game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lot of fun. Many things to do. Only thing is not open multiplayer but more coop experience overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well shit I missed the 1K mark by 14 hrs\nIts fine it will still be THE GRAND 1K hrs review\nThe Crew Motorfest a.k.a TCM\nThis game is the best arcade/simcade racing game I have ever played, the only game that I could consider to be on par is Burnout Paradise\nMotorfest\n\nThe game is built upon \"playlists\" which is more or less a set of races under the same theme. I think rn there are 27 playlists and later today when Season 8 drops another one will be added.\nIt takes roughly about 30 hrs to complete all the playlists, it used to be much shorter bcs the game didnt have as many playlists as it does now when I started playing which was April 27th 2024 towards the end of Season 3.\nThese playlists are basically your \"Career\", the game doesnt have a story or a real career in that sense u just do these playlists and thats it. It felt very weird the first time I played it bcs of exactly this.\n\nAs for online, the game is very restricted. There are only two PvP gamemodes, \"The Grand Race\" and \"Demolition Derby\" \n\"The Grand Race\" is a huge 28 player race which takes anywhere between 7 to 10 minutes to complete. The twist is that the race is divided into 3 different sections where u swap between disciplines midrace. This swap is most of the time seamless and I love \"The Grand Race\" bcs its a unique concept and its hella fun.\n\"Demolition Derby\" on the other hand is more or less a joke within the community, nobody competitive plays this as it isnt even a race. \nDD is just like a battle royale gamemode where u pickup powerups and try to crash into the other players with specialized DD cars that are also extremely slow, all while the \"circle of death\" is shrinking. Its not terrible but its neglected by the devs and has basically been the same throughout all seasons.\n\nThere are 2 other \"PvP\" things to do that arent races but still competitions.\n\"The Summit\" and \"The Custom Show\"\n\n\"The Summit\" is a 6 event + 3 feats weekly competition where each event gets u points from 0 to 157 850, which is the maximum possible amount of points for 1 event. There are 4 reward levels: Platinum, Gold, Silver and Bronze. Nowadays Platinum is ridiculously easy to get so u pretty much get all rewards every week. Its basically like Forza Horizon's \"Horizon Playlist\" but executed in a much better way with points and far less events that u have to do and the rewards are actually things u want and not just some random garbage car. (most of the time atleast)\n\n\"The Custom Show\" is also a weekly competition except there is no racing u just register a car and hope u get votes to win stuff, u can vote for yourself every 12 hrs tho so u can just get plat yourself\n\nThere is also \"The Main Stage\" which lasts for the whole month and u just get XP and levels and u get stuff with level 50 being the highest rn with no point in going any further then that.\n\n\nPROS:\nPhysics are insanely good for high speed racing\n\nGraphics are absolute peak, probably the best looking racing game of all time\n\nThe Summit is PEAK\n\nCONS:\nPhysics are bad for going relatively slow (more or less everything under 200 km/h)\n\nThe price of Crew Credits, Crew Credits or \"CC\" is the ingame currency that can only be bought with real money and u can buy visual customization called \"Vanities\" for your vehicles with CC. The price of CC is more or less 5€ or 10€ for one single vanity. Considering there is about 1.3K vanities thats alot of money if u want them all.\n\nEvery single season either retains current bugs or adds more bugs to the game\n\nThis Review definitely isnt that grand but I have to upload ts bcs im starting to go well past 1K hrs now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't know why but this game screams to me \"Nothing beats a jet2 holiday'' maybe because of the AI?\r\nTruly our The crew Motorfest",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderfull game if ur looking to kill time pretty arcady so dont be expecting to much physics wise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very often I was positively surprised by this game but at the same time with each next hour I feel that this game is lacking depth. To put it simply new players need to play this game lots of hours to even know how to compete with other players and in leaderboards. It might seem obvious but the problem is that this game doesn't invite new players to compete against other players and to play with friends. So most new players (possibly me too) will play some playlists (which are really good, maybe perfect for new game feature) and when they will finish most of them game will simply end. \r\n\r\nThis game doesn't have lots of great ideas, it's not like every new thing you see is great. There's a challenge to drive with a car you win for 10 min on highway during night. Another tasks are done only at \"Dusk\" or \"Dawn\" and there's no way to tell exactly when this will happen because there's no timer. Instead of doing a few things in a row you wait for this certain moment to take some photo. Same with upgrading cars, you get lots of parts for car category you use (street 2 for example) but it takes lots of time to get those parts and any other category of vehicles is completely empty. There's lots of travelling around whole map because at the beginning there's no fast travel (each next playlist unlocks one place) and after first few playlists I had over 400 miles driven possibly only in freeroam. For such game design this map is very monotonous. I know every inch of 1 mile circle around every fast travel point. Reward boxes respawn in same places after log out or few in game days - I found maybe 10 such places, maybe more, finding them after some time gets repetitive. Not to mention some grandpa telling us stories about nothing for 1 hour straight and giving us at least 24 reasons to have photogenic epilepsy unlocked or simply yelling at him. What I mean is that this game is super creative but many of those ideas aren't optimized.\r\n\r\nSo why 4/5? I didn't play previous Crew games, here racing can be really fun. AI at expert difficulty is just right to keep me focused with a few examples of real challenge. Lots of nice cars. Nice boat races, nice combination of different vehicles, after a few hundred hours I might actually stand a chance to win some awards in multiplayer.\r\n\r\nThe Crew Motorfest is a challenger for Forza Horizon leadership but as such this game from the start loses \"innovation points\". Every repetition in this game feels worser than in FH because it's already repeated from FH. It didn't beat Forza in any way in my opinion but some ideas I saw in TCM are well worth implementing in new games (themed, diversed races, climatic intros etc.). I can recommend this game for some weekend players but rather with Ubisoft+ subscription. There's at least 50 hours of content worth seeing, the rest depends on whether you'll like driving model and cars presented in the game. They are nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's fun and engaging, especially doing the events which sometimes they give free unique cars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun. You can unlock cars and even F1 cars. The best gameplay is on steering wheel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is good some bugs but other than that i like the game they update alot and i was in love with the crew 2 this is a upgrade alot of cooler stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Q: Is it better than Forza Horizon?\nA: Depends on what you are looking for.\n\nQ: Does it offer good longevity?\nA: Heck yeah, you can play it for several hours without getting bored, it is even better if you have someone who can play it with you.\n\nQ: How is the driving / gameplay feel?\nA: Good, fun. Of course there are gonna be times where you crash and you do 360 backflip, because this isn't BeamNG.drive.\n\n[h2]\n[hr]Any other questions? Ask me by commenting![/hr]\n[/h2]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good, I like the map, reflections on cars are good, I hope this game need more optimizations for budget GPU's, less realistic but, too fancy i guess.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The avatar creation system is a mess. Cara is annoying as hell. The notifications on the left side of the screen — the Year Pass and all the other BS — keep popping up nonstop. The game has more cutscenes and videos than actual gameplay. Overall, just a terrible experience.\n[b]3/10 on a sunny Hawaiian day at best.[/b]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It might be a copy of Forza Horizon, but what they put in the game is quite interesting, like the history of Bugatti and other brands. The game is also very beautiful. People say that the Ubisoft launcher is buggy, but I didn't have any problems. I liked the game and I recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is just about b u s s i n\r\nengine sounds are great, car models are solid, lighting is nice, world looks great. it's a solid simcade racer and is definitely giving FH5 a proper run for its money.\r\neconomy is grindy though. so many great cars but so hard to get them even after all these hours. AND i had a boost from owning the crew 2. would also be nice to have simple races where we can actually use our own cars because right now the only way you can do that is by completing a playlist and unlocking custom mode. that sucks. but decent game otherwise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Review by [url=https://store.steampowered.com/curator/33369540-Abrix/]Abrix\n Gaming[/url] – 4K quality gameplay reviews and recommendations.[/b]\n\n[b]The Crew Motorfest – A Stunning Celebration of Cars, Speed, and Style[/b]\n\n[i]The Crew Motorfest[/i] is an absolute blast from start to finish. Ubisoft has taken everything fans loved about open-world racing and pushed it to a whole new level with vibrant locations, gorgeous lighting, and a festival vibe that keeps the energy high every second you play.\n\nThe driving feels smooth, responsive, and incredibly fun—whether you're drifting down mountain roads, tearing through beaches, or weaving through city streets. The variety of vehicles is fantastic, and each one feels distinct and satisfying to control. The playlists system is a standout, turning every event into a themed adventure, from classic racing culture to modern motorsport experiences.\n\nWhat really makes this game shine is the atmosphere. The world feels alive, the soundtrack amps up every race, and the festival setting makes even casual cruising exciting. Whether you're competing, exploring, or customizing your dream ride, there's always something new to discover.\n\n[i]The Crew Motorfest[/i] is a love letter to car enthusiasts and a must-play for anyone who enjoys high-speed open-world racing. Fun, stylish, and endlessly replayable — it's easily one of the most enjoyable racing experiences out there.\n\nYou can check the gameplay videos [b][url=https://www.youtube.com/playlist?list=PLxvWbrDkSJsA-xiLYIQ8CWbOHsnVZvTkz]here[/url][/b]\n\nSubscribe To My Youtube - https://www.youtube.com/channel/UC1ZOvQERjGtRkl7ImTcDzdw?sub_confirmation=1\nJoin My Discord - https://discord.gg/uM94ehT7hv",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "There are things that i like better in the crew 2 but it is still an upgrade worth buying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty good if you have ever played Crew 2 as you can import your complete collection from Crew2 to Crew Motorfest",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very hyper realistic with the cars and missions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like this very much becuase of the playlists that it have and tells about every car where and how it all started",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ну короче машинка типо врррра там типа брбрбрбр а еще типо уиииииии ну короче четко ниче не скажешь",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think if Need For Speed making a ProStreet 2 with this kind of content and giving us seasonal update, they'll make millions and the NFS franchise will be saved.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its fun, they should add more things tho. Like online with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The controls feels alot better than the crew 2, Thats a huge plus, 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "physical is the best for the crew series (not so good, but not so bad). And is a little hard to race on the main stage",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good map fun to play but it needs more cars like other games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "idk , as max once said \"guy goes left , goes left he deserved to put on wall\"\r\nbut i am on wall all the time . matter of skill i guess \r\n10/10 for my drifted controller",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "no out im done. they want $29 for 3 cars year 3 I'm sooooo done with live service games I'd rather pay full price for complete games then this",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "Game claims crossplay, but that's ONLY for races, you can't freeroam with friends on the xbox/ps5, can't join crews with them. Game is also capped at 60fps and feels extremely sluggish due to the fact.\n\nDo not recommend, find another open world racer.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "it is pain just to launch this a game, and car physics are bad.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A shell of what could have been a much needed good sequel to tc2. The TAA is so trash you'd think you need lasik which sucks because I feel that overall the game is beautiful and displays a wide variety of vibrant colors and landscapes. The handling is meh (I've never been much of a fan of the crew handling except for pre wild run tc1). The gameplay can get old fast. Plus I get occasional crashes while not even maxing out my pc during gameplay. Also locked 60 fps in the big 25 is diabolical especially when I could easily get 30 or more fps if it wasn't locked.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is awesome, but the multiplayer has too many issues. Unfortunately, you often can’t find each other, or you appear as a team but still can’t play together. Timeouts and similar problems are almost always present in the lobby :-/ Sadly, Ubi doesn’t fix it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Context: I've put in 1000+ hours across TC, TC2 and TCM across PS4, PS5 and PC on both Uplay and Steam (Steam hours are low because I switched from Uplay recently). As well as played almost every other racing game released in the past 2-3 decades. With thousands of hours in Gran Turismo, Froza, as well as hundreds of hours in each of at least a dozen other racing games. Spent nearly 4000 in GTA:O, with most of that time spent racing.\r\n\r\nBAD:\r\n-3 season passes in less than 2 years, which is mostly paid cars you can buy through normal gameplay \r\n-Monetisation on cosmetics like never before!\r\n-Constant disconnection errors\r\n-Main campaign is playlists you can't use your own cars in (until you complete them)\r\n-Blurry low LOD visuals with LOADS of stuttering, still has weird dynamic FOV shimmer\r\n-Bare-bones multiplayer I'd rather avoid\r\n-Weekly/monthly XP grind for rewards is unreasonable\r\n-Planes and boats are kinda pointless now, except for exploration\r\n-No semi-auto transmission option (can be annoying when TCS is off)\r\n-No houses or garage, just the horrible main stage\r\n\r\nGOOD:\r\n-Handling is better than ever!\r\n-Map is refreshing\r\n-Better visuals than previous titles (kinda)\r\n-Finally get rear-view mirrors\r\n-Better vehicle mods, with new wheels!\r\n-Importing TC2 garage is a great feature\r\n-Lots of new cars, with good variety of old and new\r\n\r\nMIXED:\r\n-Playlists can be decent, but the TALKING is constant, and cringy! (muted so I don't go insane)\r\n-Visuals overall are hit or miss. Some minor changes would really improve this\r\n-Performance is bad until shaders are compiled\r\n-Controls can be dialed in to be very good, but it takes trial and error\r\n-Sounds can be decent, but the sound fade-out when jumping gets annoying fast\r\n-Fast traveling with the 3D map is snappy, but is mor elimiting than TC2\r\n\r\nI probably missed a bunch of things, but I avoid some areas of the game I don't like, so can't speak to them.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Awesome game, but still many bugs and drops need be repaired!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I tried multiple times and cannot even finish the tutorial because I always get disconnected from the server during the off-road section just before or after the second jump. After four attempts, uninstall has now happened.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Constant disconnects after finishing grand races, so you can't progress your rank. GG ubisoft\n\nEdit: \nThey partially fixed it, still got massive stutters at the beginning of each grand race. Good luck trying to get first place",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Absolutely undeserving of Steam Deck Verified badge simply because any interaction with Ubisoft Connect simply freezes the game. My windows PC isn't immune to this issue as well. However on gameplay side, it's within expectancy, defaults to most Low settings, with average of 35-40 fps depending on what's going on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can’t, in good conscience, recommend this game to anyone expecting a true continuation of The Crew series. However, I’ll try to be as fair and balanced as possible in my assessment.\r\n\r\nPros\r\n\r\n• Visuals\r\nThe game looks fantastic. Environments, vehicles, and effects are all beautifully done and easily among the best in the series.\r\n\r\n• Driving Physics\r\nThe racing feels surprisingly lifelike. Every setting adjustment genuinely impacts how the car behaves. ABS is especially impressive, reacting in a way that feels close to real-world behavior. Even aerodynamic modifications noticeably affect performance.\r\n\r\n• Story\r\nThe narrative is engaging and well-constructed, offering a solid reason to progress through the content.\r\n\r\n• UI/UX\r\nThe user interface is clean, intuitive, and easy to navigate—no unnecessary clutter or confusion.\r\n\r\n• Off-Road Racing\r\nOff-road segments actually feel like proper off-roading. While the sliding is a bit exaggerated for my taste, it’s still manageable and fun overall.\r\n\r\nCons\r\n\r\n• Airplane Handling\r\nFlying is, frankly, terrible. There are barely any flying or acrobatic races, and when you do encounter them, they feel frustrating and poorly designed.\r\n\r\n• Boat Gameplay\r\nBoating doesn’t fare much better. While the water feels smoother than before, there are very few races or activities tied to boats, making this mode feel neglected.\r\n\r\n• Off-Road Bikes & Quads\r\nMotorcycles, stunt bikes, and quads handle almost as poorly as planes. Their controls feel unwieldy and awkward, making them more frustrating than fun.\r\n\r\n• Lack of Community Races\r\nAs far as I could tell, community-made races are completely absent, which removes a major element of replayability from previous titles.\r\n\r\nOverall\r\n\r\nThe game can be fun, but compared to The Crew and The Crew 2, The Crew Motorfest feels like an entirely different experience—one that leans more toward a reskinned Forza than a true successor to the series. Fans expecting the familiar formula may end up disappointed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you want to play a driving game with friends DON'T BUY THIS, the multiplayer in this game is a joke.  I only get 2 races with my friend and that is it  after that we can not race together.  This game should be called The Solo Driver Motorfest.  It also looks like they are not going to fix it because I tried to find a work around to get it to work and all I found was thousands of posts saying what I am saying here and all the posts are over a year old.  So if the devs have not fixed it by now they are not working to fix it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game stunning eh, but they \"gdr\" drop for the gear and the fact that you are stuck with the car that THEY want for each event until you finish everything is kinda pupu caca my buddy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Games fun, new wheels and stance customization is great but the thing i was really looking forward too was its verification for handheld PC's and because of that I cannot recommend at this time.\n\nSteam Deck performance and load times are absolutely abysmal. All low settings, 1280x800, resolution scale down to 75% and no native upscale means sub 30fps when almost anything happens. Seen reports that the game wont even run if you try to use lossless scaling either. Would try on any of my more powerful handheld's but those all run Bazzite since SteamOS isnt offically supported on other machines but those pop error codes and the game fails to load.\n\nUpdating my review after the release of the Loseless Scaling Decky Plugin. Game doesnt even boot when using launch commands.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "games alright if you just like to drive cars with annoying ass ai yappin in your ears the whole time. updates are a fkn nightmare every time they release one. this most recent update has the whole pvp part of it to just crash after every race. 10/10 for \"cool\" cars -10/10 for experience. would rather kick the chair then buy another bs release of theirs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm 50/50 with this game. I do actually find it kinda fun to play however, the driving is rough. Feels like you are controlling a boat on wheels. There is so much purchasable content in this game which is fine. However, I do have a problem with my garage being full of locked cars which I have never bought or used... The cars are locked because I do not own Year 1 or 2 pass nor do I want to. So why can i not just remove the cars from my garage? Oh yeah, The Crew is a Ubisoft game, nothing s simple with them... If this game is on sale for like £10-£15 then sure grab it, Otherwise go grab CarX Street, Tokyo Xtreme Racer, Forza Horizon, NFS... I think you get where I am coming from",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you are planning on playing this game with your friends, just choose another game. The online servers in this game are some of the worst I've ever seen. To play with your friends you have to do crazy amounts of troubleshooting and even then it doesn't fully work. Playing by yourself, the game is fine, but do not buy this game if your goal is to play with friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash game ever, it crashed sometimes and i cant join when the event start and we waited so long.\nthis game is trash ever it launched 1 year ago when they fix? never.\n\nstar is 3!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Since i started this game importing from the crew 2 has been broken, pretty sure It's been over 2 weeks\nOn top of that It's party system is fundamentally broken, often times inviting people doesn't work,  when it does races will get stuck and only load one person in and kick the other, while in a party you also frequently disconnect or simply cant see your friends in the open world.  \n\nIf you want to play this alone, by all means get it, It's a fun game, even the pvp you queue up for works fine, but the party system? completely utterly broken, you may get one good play session a week but the rest of the time it'll be broken.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "None of my cars transferred I waited a full 2 days and still none of them transferred and yes i went to settings and pressed the transfer button and yes its the same account for both games and still none of my cars transferred game refunded never buying again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not as fun as the 2nd or first one waste of time and money updating after a year and adding small stuff servers always having issues and game is still buggy after a year of release",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really liked it. Then suddenly it just stops working and none of my game has been saved. That seems to be the new standard here, so no, I cant recommend this. The few hours i got to play, it seemed like a really good game. A real bummer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1. Join Grand Race.\n2. Go racing while avoiding some m***fker whose ruin my race.\n3. Finish the race.\n4. Got message popup said that i got disconnect from the server not once but 3/5 race i join.\n5. Got no reward and rank point, so i race for nothing.\n6. Frustrated and quit the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "De game is niet zo als crew 2 je hebt geen lossen race en je kan ook niet teleporterem. De map is er on handig in gedeeldt dus je zit heel saai naar de een race te rijden voor 10 minuten lang. \r\nDe graphic zijn prima, hooger dan crew 2 maar nog steeds ver van realistich,  gedetaleerdt is die helemaal niet bijvoorbeel je ziet je arm nieteens als je schakelt of toetert en met zo veel andere.\r\nDe auts voelen ook niet echt lekker om in te rijden, gelukig kan je wel trick doen op de motors.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "With all honesty this game is NOT worth its full price\n\nIt has one of the worst physics I've ever seen. It has a lot of content but there is not much point to grind it since it is painful to play.\n\nJust buy forza if you want somewhat realistic racing game or NFS if you want arcade",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Season 8 is more like Stuttering fest every 2 minutes im getting major stutters now thank you ubisoft for an amazing unplayable update !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After season 8 update I can no longer launch the game, either it does nothing and acts like I never tried to start it or it gives a Ubisoft Connect Crash report with nothing to go off of besides sending a report.\n\nI have about 10 hours in the game through multiple sessions before the update, everything maxed and running at a constant 60 fps at 1440p. It is not my rig, trust me. I've tried everything I can think of, looking at guides on what to do if it crashes and still no help (rollback drivers, verify files, uninstall everything and reinstall even Ubisoft Connect itself, Admin privilages, Anti-virus permissions, Windows is already updated. Everything should be fine as I was playing completely fine before said update. Support seems to be non-existent for the game as well. So, as of right now, I can not recommend the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They say its steamdeck verified but you still need an internet connection to play, you can launch the game but when your on the titre screen it says that it his impossible to connect to the servers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game launches on my steam deck but I can't get it to run on my pc. I've been trying to trouble shoot it for days now and am fed up. GARBAGE!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just play the massive back log of fantastic older racing games please i beg of you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buggy af cant even play with your friends cuz u cant see em then when u start races it says failed and makes u race alone this offbrand ahh forza wannabe game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game doesnt even launch half of the time because of the garbage Ubisoft Connect that is mandatory to use",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "keeps signing me out of my account and wont let me sign it witch makes me start all over for a 5th time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's like a dollar store version of forza horizon.. The crew has always had some cool features but this game got rid of most of it to rip off another game and couldn't even make the experience half as good. I can see kids enjoying it and those who are crew fan boys but nobody that really loves racing games. Don't even think about using a wheel with the game either.. The physics are worse than that of rush 2 from the bowling alley arcade,",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant launch it without crashing, just waste of money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The silver rank should not play with platinum and legends only with gold!!!! The silver rank should not play with platinum and legends only with gold!!!! The silver rank should not play with platinum and legends only with gold!!!! The silver rank should not play with platinum and legends only with gold!!!! The silver rank should not play with platinum and legends only with gold!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "These reviews are:\neither A: rigged \nor B: made by people with very poor expectations of a finished game.\nThe few things this game did right are:\n- Graphics: They are not the worst or the best, but they can do. Characters are aweful though, faces look like their designed after monkeys instead of humans.\n- Performance: It runs fine(on Linux that means once you get it running).\n- Cars: Plenty to choose from.\n- Content: it looks like it has a lot of content to go through.\nEverything else is just poorly designed, broken, or plain bugged.\n- racing line: It will go through walls and off track... Terribly broken.\n- guidelines: They're a joke. It makes you drop down from mountains and cliffs to reach the road at the bottom. Sometimes they break so hard, it can only show a straight line to the objective. No matter if you're in the right vehicle or not.\n- vehicles, seriously, get rid of boats, motorcycles and planes all together, they're nothing but a joke.\n- controls are the worst, compare it to any game in the last 40 years, never have you driven with controls shitty as these.\n- popups, during races, menus, free drive, popups are all around. Challenge here, Rival there, feats... I'm heading for my next destination, please let me get there. Heck while typing this review a popup showed up across my screen, but surely it disappeared when I switched to the window. Good stuff.\n- NPC drivers in races: They follow the racing line. Remember what I said about the racing line? Crashing into walls and going off track on weird places? Guess what, NPCs just drive themselves in to the walls and and go off track.\n- NPC drivers in free roam. There are 2 kind of NPC drivers, normal slow traffic, they're everywhere and always in the wrong places. Then there are obnoxious 'replayers' as Ubi calls them. Ghosts of cars racing, often showing up in groups of 10 or more cars, blasting through everything. I guess it's a pro you can turn these drivers off.\n- Feats: small objectives in free roam. Those are things like slalom courses or getting away from uhm, something? So, remember those slow traffic nps? They are everywhere, blocking the slalom routes and blocking you from getting up to speed to get away. Don't be surprised when you reset 15 times just because these npcs keep you from getting anywhere.\n- Physics are the worst. They seem totally random. One of the feats are the so called long jumps. I was doing one and simply aiming for the target got me 20 meters short, no matter how fast I was driving. It felt like the game just decided at points that I had covered enough distance and then dropped me straight down to the ground. I got annoyed and didn't aim anymore. That's when the game decided my angle was now good enough or something and immediately got me 100 meters over the target. Same speed as before, just not pointing at the target as well as before. I was glad I got it done. But it was ridiculous how it got done.\n- Stash: after a few races you find out the upgrades you win are send to a stash'. That stash has very low inventory and then you find out how deep the game has sunk: you get to play a merge-3 game to clear your stash. But only if you have made enough currencies.\nNow that I've played this game a bit, I also looked it up on the reddits and discords and such... guess what, most of these bugs and funny things were there from the start. As I play on Linux, I highly doubt the SteamDeck rating. Normal Proton, as well as a bunch of forks, do not even get the Ubisoft Connect services running.\nI want to explore the islands and see and experience more, but the game makes it very hard to actually enjoy it. I found myself multiple times just quitting mid-objective because of the many things mentioned, not willing to be bothered with the same bug or quirk over and over again.\n\nA few more hours has gone into it, not as much as is shown, since Steam thinks the game is running while it's just the stupid Ubisoft Launcher. Tried some PVP... There is no serious PVP in this game. Zero! There's a grand race, with not just 1 car, nooo, the race is divided in 3 parts with different cars for each track. Terrible races with what looks like random tracks, as sometimes solid objects are in the middle of tracks. Then there's a destruction derby in teams. Which is equally terrible. This is the perfect example of what you get if you put everything in the same game, nothing is good, I'd even go as far as nothing is medium, as everything is done better in games < €20.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Will not play. Keeps crashing my pc. I am playing on a ROG strix 4080 with 16gb ram, I have tried updating and downgrading the drivers, running in admin mode. I have watched every video! Nothing makes it run!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Season 8 M4 CSL Summit, In order to get M4 CSL, I bought the package of LBWK 720s with M5 CS and 993 GT. When I need to use my M5 CS, I found my M5 was changed to a whole new level. Slammed, put on widebody, different paint and livery, And after I tried so many time to recover it, I found out, the slammed read wheel can not be recovered. Suddenly, I lost my motivation for playing this game. \nFor me personally, I don't like Hella-Flash or slammed, I like a little bit of bodywork without changing the original style.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i have played the game maybe an hour the rest of my time has been trying to load up the game but it never does.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cheap of Forza Horizon 5\r\n& the graphics look terrible(tested on ultra settings).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Crew motorfest seems to be one of those games for a beefy gaming PC. I launched it and it took ten minutes to load and then game crashed on me. The Crew 2 is a lot more stable and more fun to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't recommend this game, I boot it up every once in a while to see why I stopped playing in the first place, there is no progression, you can't use your own cars so there is no point in owning or upgrading, it's just a series of playlist races in a beautiful environment but that's it, the dialogues and music are both horrendous, I muted everything just to make it \"normal\" I guess the vibe is more like a music festival than anything related to cars.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THIS GAME IS SUCK . I INSTALL IN SSD NVME BUT TAKE LONG TIME TO LAUNCH...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can’t comprehend how in The Crew Motorfest I’m unable to use my own car in any event. Why even have the option to customize cars if I can’t use my own car anywhere?",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "this game has the worst controls ever....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "kernel level anti-cheat = malware\nuninstall",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "setelah uptade season 8 server kayak tai",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SORRY, THE SERVER IS UNDER MANTAINANCE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "60 fps lock in 2025? Am I missing something?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ubisoft connect",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ubisoft ruins everything.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Cringe Brokenfest",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the engine is shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the crew 2 is way better!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "IS BAD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dtrh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Love the game, BUT it has several big (mostly graphical) issues where it makes me unable to leave a positive review and i'm really hoping they are solved in year 3 update (1 through 3 at least)\nEdit: None fixed so far\n1) There is no option to unlock fps or at least set the limit to 120 fps. And this is the complaint of all my friends who got the game or tried it. If the physics is really that dependent on fps and there is no option to untie it from render, at least add DLSS, DLSS FG, AMD FSR. FSR FG. Because Smooth Motion performs terrible and integrated solution, where dlss has motion vectors and doesn't impact HUD will be miles better.\n\n2) TAA - no option to disable it. While it mostly looks fine-ish, there is huge halo behind the car on mid-high speeds, especially visible at night with rain weather and other different conditions, if there is no way to solve this issue separately for a car and its underglow, MSAA option should be added. This is really immersion breaking for me.\n2.1) allow resolution scale more than 100 so nvidia DSR is not required\n\n3) Half fps mirrors - please add option to have full rate on car mirrors refresh\n\n4) Load distance for some objects. While I understand this is done for optimization, there should be either an option to load further or logic rework where it loads important objects like traffic which might be on your way or mission objectives/obstacles in events sooner/further\n\n-- No matter how much content is added a lot of people not gonna play because of issues mentioned above, especially the first one\n\nControls (not a big deal but worth mentioning)\n5) add custom linearity curve for direct drive users, so they dont have to emulate it on controller on top of linearity 100, especially when some controllers dont have custom curve option\n6) for keyboard would be great to control how fast wheel returns to center w/o user input, maybe even some kind of curve\n\nPhysics\n7) Driving off-road feels like driving on soap compared to eg fh5, and offroad cars feel somehow worse than road or drift ones\n8) Bikes also feel quite questionable",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "If only the Ubisoft Connect is stable enough, then this game would probably be good. Unfortunately, Ubisoft Connect is TRASH! One moment I can play the game, then I logged out of the game to rest or work. The next time I want to play, Ubisoft Connect seems to be offline or error ALL THE TIME. THIS HAPPENED TOO MANY TIMES",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Cant play the game, im only getting auto-generated messages from Ubisoft support.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "no out im done. they want $29 for 3 cars year 3 I'm sooooo done with live service games I'd rather pay full price for complete games then this",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "Game claims crossplay, but that's ONLY for races, you can't freeroam with friends on the xbox/ps5, can't join crews with them. Game is also capped at 60fps and feels extremely sluggish due to the fact.\n\nDo not recommend, find another open world racer.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "it is pain just to launch this a game, and car physics are bad.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "can't even play the game. I've tried many different ways, looking for ways on google, reddit and steam forums but still the game just put me in demo version.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "how is this a 2024 game but only cap at 60 fps are we serious ? also my game freezes in cut scenes with the best pc",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A shell of what could have been a much needed good sequel to tc2. The TAA is so trash you'd think you need lasik which sucks because I feel that overall the game is beautiful and displays a wide variety of vibrant colors and landscapes. The handling is meh (I've never been much of a fan of the crew handling except for pre wild run tc1). The gameplay can get old fast. Plus I get occasional crashes while not even maxing out my pc during gameplay. Also locked 60 fps in the big 25 is diabolical especially when I could easily get 30 or more fps if it wasn't locked.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is awesome, but the multiplayer has too many issues. Unfortunately, you often can’t find each other, or you appear as a team but still can’t play together. Timeouts and similar problems are almost always present in the lobby :-/ Sadly, Ubi doesn’t fix it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Context: I've put in 1000+ hours across TC, TC2 and TCM across PS4, PS5 and PC on both Uplay and Steam (Steam hours are low because I switched from Uplay recently). As well as played almost every other racing game released in the past 2-3 decades. With thousands of hours in Gran Turismo, Froza, as well as hundreds of hours in each of at least a dozen other racing games. Spent nearly 4000 in GTA:O, with most of that time spent racing.\r\n\r\nBAD:\r\n-3 season passes in less than 2 years, which is mostly paid cars you can buy through normal gameplay \r\n-Monetisation on cosmetics like never before!\r\n-Constant disconnection errors\r\n-Main campaign is playlists you can't use your own cars in (until you complete them)\r\n-Blurry low LOD visuals with LOADS of stuttering, still has weird dynamic FOV shimmer\r\n-Bare-bones multiplayer I'd rather avoid\r\n-Weekly/monthly XP grind for rewards is unreasonable\r\n-Planes and boats are kinda pointless now, except for exploration\r\n-No semi-auto transmission option (can be annoying when TCS is off)\r\n-No houses or garage, just the horrible main stage\r\n\r\nGOOD:\r\n-Handling is better than ever!\r\n-Map is refreshing\r\n-Better visuals than previous titles (kinda)\r\n-Finally get rear-view mirrors\r\n-Better vehicle mods, with new wheels!\r\n-Importing TC2 garage is a great feature\r\n-Lots of new cars, with good variety of old and new\r\n\r\nMIXED:\r\n-Playlists can be decent, but the TALKING is constant, and cringy! (muted so I don't go insane)\r\n-Visuals overall are hit or miss. Some minor changes would really improve this\r\n-Performance is bad until shaders are compiled\r\n-Controls can be dialed in to be very good, but it takes trial and error\r\n-Sounds can be decent, but the sound fade-out when jumping gets annoying fast\r\n-Fast traveling with the 3D map is snappy, but is mor elimiting than TC2\r\n\r\nI probably missed a bunch of things, but I avoid some areas of the game I don't like, so can't speak to them.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "classic Ubisoft making another game that barely works. half the time joining a race in a crew fails.\n\nI can assure you it is not my internet as the dev suggested. I can get online and join a crew in the overworld just fine. About hald the time When starting/joining an event it just loads for a very long time, then says failed to join event, then it will start the event in a solo race.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Awesome game, but still many bugs and drops need be repaired!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I tried multiple times and cannot even finish the tutorial because I always get disconnected from the server during the off-road section just before or after the second jump. After four attempts, uninstall has now happened.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Constant disconnects after finishing grand races, so you can't progress your rank. GG ubisoft\n\nEdit: \nThey partially fixed it, still got massive stutters at the beginning of each grand race. Good luck trying to get first place",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Very fun game, lots of content, but I just can't get myself to recommend it to other people because of the amount of times the game crashes, it's just annoying and it ruins the whole experience.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "fucking shit game everytime i open it it just crashed no wrror no warning no nothing fucking piss piece of shit game",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Absolutely undeserving of Steam Deck Verified badge simply because any interaction with Ubisoft Connect simply freezes the game. My windows PC isn't immune to this issue as well. However on gameplay side, it's within expectancy, defaults to most Low settings, with average of 35-40 fps depending on what's going on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can’t, in good conscience, recommend this game to anyone expecting a true continuation of The Crew series. However, I’ll try to be as fair and balanced as possible in my assessment.\r\n\r\nPros\r\n\r\n• Visuals\r\nThe game looks fantastic. Environments, vehicles, and effects are all beautifully done and easily among the best in the series.\r\n\r\n• Driving Physics\r\nThe racing feels surprisingly lifelike. Every setting adjustment genuinely impacts how the car behaves. ABS is especially impressive, reacting in a way that feels close to real-world behavior. Even aerodynamic modifications noticeably affect performance.\r\n\r\n• Story\r\nThe narrative is engaging and well-constructed, offering a solid reason to progress through the content.\r\n\r\n• UI/UX\r\nThe user interface is clean, intuitive, and easy to navigate—no unnecessary clutter or confusion.\r\n\r\n• Off-Road Racing\r\nOff-road segments actually feel like proper off-roading. While the sliding is a bit exaggerated for my taste, it’s still manageable and fun overall.\r\n\r\nCons\r\n\r\n• Airplane Handling\r\nFlying is, frankly, terrible. There are barely any flying or acrobatic races, and when you do encounter them, they feel frustrating and poorly designed.\r\n\r\n• Boat Gameplay\r\nBoating doesn’t fare much better. While the water feels smoother than before, there are very few races or activities tied to boats, making this mode feel neglected.\r\n\r\n• Off-Road Bikes & Quads\r\nMotorcycles, stunt bikes, and quads handle almost as poorly as planes. Their controls feel unwieldy and awkward, making them more frustrating than fun.\r\n\r\n• Lack of Community Races\r\nAs far as I could tell, community-made races are completely absent, which removes a major element of replayability from previous titles.\r\n\r\nOverall\r\n\r\nThe game can be fun, but compared to The Crew and The Crew 2, The Crew Motorfest feels like an entirely different experience—one that leans more toward a reskinned Forza than a true successor to the series. Fans expecting the familiar formula may end up disappointed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you want to play a driving game with friends DON'T BUY THIS, the multiplayer in this game is a joke.  I only get 2 races with my friend and that is it  after that we can not race together.  This game should be called The Solo Driver Motorfest.  It also looks like they are not going to fix it because I tried to find a work around to get it to work and all I found was thousands of posts saying what I am saying here and all the posts are over a year old.  So if the devs have not fixed it by now they are not working to fix it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Keeps crashing and the few times it doesn't the coop simply does not work.\r\nno working coop in a game advertised as coop called THE crew? no thank you Ubisoft!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The developers set out to make a cheap Forza Horizon copy. The map is incredibly boring, and the multiplayer doesn’t work at all. I don’t understand how Ubisoft isn’t embarrassed to release such garbage.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i bought the game but they keep saying the free trial ended go to store and buy the full game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game stunning eh, but they \"gdr\" drop for the gear and the fact that you are stuck with the car that THEY want for each event until you finish everything is kinda pupu caca my buddy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Games fun, new wheels and stance customization is great but the thing i was really looking forward too was its verification for handheld PC's and because of that I cannot recommend at this time.\n\nSteam Deck performance and load times are absolutely abysmal. All low settings, 1280x800, resolution scale down to 75% and no native upscale means sub 30fps when almost anything happens. Seen reports that the game wont even run if you try to use lossless scaling either. Would try on any of my more powerful handheld's but those all run Bazzite since SteamOS isnt offically supported on other machines but those pop error codes and the game fails to load.\n\nUpdating my review after the release of the Loseless Scaling Decky Plugin. Game doesnt even boot when using launch commands.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "utterly terrible TAA implementation, with no ability to opt-out. as an insult to injury the game features a [i]second[/i] anti-aliasing option: \"TAA + FXAA\" - in other words: \"would you like some dogsh*t with your trash as well?\"\n\ndo not purchase this if you have a working set of eyeballs.\n\n[hr][/hr]\n\nignoring this extreme glaring issue, the aspects in which Motorfest shines compared to its primary competitor, Forza Horizon, are:\n\n\n[list]\n    [*] a really immersive and realistic first-person cockpit view. the way the camera shakes, pans, bobs, and generally moves around, combined with the stellar steering wheel animations - a high degree of rotation and realistic maneuvering (the way the character manually attempts to keep it under control) at both low and high speeds, and other immersive bits (like the character occasionally resting their arm on the window, or adjusting the rear-view mirror), all make cruising around super satisfying\n    [*] more realistic sounds (vehicles, but also especially weather-related ones, particularly so thunder and rain)\n    [*] more realistic weather-related visuals - the difference between any two distinct weather conditions are really profound which makes for consistently gorgeous presentations.\n[/list]",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "games alright if you just like to drive cars with annoying ass ai yappin in your ears the whole time. updates are a fkn nightmare every time they release one. this most recent update has the whole pvp part of it to just crash after every race. 10/10 for \"cool\" cars -10/10 for experience. would rather kick the chair then buy another bs release of theirs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Was expecting a better pvp experience .\r\nYou cannot race other people except on the \"Grand Race mode\" which is extremely frustrating since it locks you into specific types of vehicles which  you might not like/enjoy as much.\r\nAlso for a game called \"The crew\" I find it impossible to meet / crew up with randoms.\r\nUnless you are coming in this game with friends I do not recommend it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For a game called The Crew you sure can't play with yours. Constant server issues. Also if you want to know how it feels to drive a car with the handling of a cruse ship play this game on controller.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not sure how it is mostly positive when the game is capped at 60fps LOL",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just opened it, cannot connect to servers or something, altough I have internet connection, was forced to stay 2 or more minutes into the a ubisOfT gaMe or something screen, uninstalled it, regret purchasing it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "genuinely one of the worst handling models i have ever tried in my 10+ years of playing racing games, overpriced garbage, get it when they discount it to 1 euro like the crew 2",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm 50/50 with this game. I do actually find it kinda fun to play however, the driving is rough. Feels like you are controlling a boat on wheels. There is so much purchasable content in this game which is fine. However, I do have a problem with my garage being full of locked cars which I have never bought or used... The cars are locked because I do not own Year 1 or 2 pass nor do I want to. So why can i not just remove the cars from my garage? Oh yeah, The Crew is a Ubisoft game, nothing s simple with them... If this game is on sale for like £10-£15 then sure grab it, Otherwise go grab CarX Street, Tokyo Xtreme Racer, Forza Horizon, NFS... I think you get where I am coming from",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you are planning on playing this game with your friends, just choose another game. The online servers in this game are some of the worst I've ever seen. To play with your friends you have to do crazy amounts of troubleshooting and even then it doesn't fully work. Playing by yourself, the game is fine, but do not buy this game if your goal is to play with friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash game ever, it crashed sometimes and i cant join when the event start and we waited so long.\nthis game is trash ever it launched 1 year ago when they fix? never.\n\nstar is 3!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Since i started this game importing from the crew 2 has been broken, pretty sure It's been over 2 weeks\nOn top of that It's party system is fundamentally broken, often times inviting people doesn't work,  when it does races will get stuck and only load one person in and kick the other, while in a party you also frequently disconnect or simply cant see your friends in the open world.  \n\nIf you want to play this alone, by all means get it, It's a fun game, even the pvp you queue up for works fine, but the party system? completely utterly broken, you may get one good play session a week but the rest of the time it'll be broken.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "None of my cars transferred I waited a full 2 days and still none of them transferred and yes i went to settings and pressed the transfer button and yes its the same account for both games and still none of my cars transferred game refunded never buying again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not as fun as the 2nd or first one waste of time and money updating after a year and adding small stuff servers always having issues and game is still buggy after a year of release",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really liked it. Then suddenly it just stops working and none of my game has been saved. That seems to be the new standard here, so no, I cant recommend this. The few hours i got to play, it seemed like a really good game. A real bummer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1. Join Grand Race.\n2. Go racing while avoiding some m***fker whose ruin my race.\n3. Finish the race.\n4. Got message popup said that i got disconnect from the server not once but 3/5 race i join.\n5. Got no reward and rank point, so i race for nothing.\n6. Frustrated and quit the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "De game is niet zo als crew 2 je hebt geen lossen race en je kan ook niet teleporterem. De map is er on handig in gedeeldt dus je zit heel saai naar de een race te rijden voor 10 minuten lang. \r\nDe graphic zijn prima, hooger dan crew 2 maar nog steeds ver van realistich,  gedetaleerdt is die helemaal niet bijvoorbeel je ziet je arm nieteens als je schakelt of toetert en met zo veel andere.\r\nDe auts voelen ook niet echt lekker om in te rijden, gelukig kan je wel trick doen op de motors.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "With all honesty this game is NOT worth its full price\n\nIt has one of the worst physics I've ever seen. It has a lot of content but there is not much point to grind it since it is painful to play.\n\nJust buy forza if you want somewhat realistic racing game or NFS if you want arcade",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}