{
  "positive": [
    {
      "review": "A good simulator, nothing to say really tbh (very similar to ETS2) also.. multiplayer servers are dead.\n\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind ( ! with mod ! )\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☑ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 64
    },
    {
      "review": "literally bought a pc just to play this and its amazing.",
      "voted_up": true,
      "votes_helpful": 33
    },
    {
      "review": "The best game to play on the weekend, fully addictive if you're into trucks!",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "The Game is so realistic. The Map, Licensed Trucks, Traffic AI, etc. All good. I will recommend this game to every gamer who wants to play truck simulator games.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "It is easy to recommend ATS and it's cousin ETS2 to anyone who is looking for a calm game to destress with. When comparing ATS and ETS2, I believe ATS has more detailed locations, denser urban areas, and a wider variety of \"biomes\" to visit. While using a wheel and pedal is best, a controller with a throttle trigger will get you most of the way there. With all the DLC available the cost owning all of ATS quickly adds up, but wait for sales and bundles, and know that the developers are good people who give away quite a lot for free with new trucks, updates and reworks of older areas.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "A very nice, relaxing time. I like to have a few drinks and take in the sights and sounds while enjoying the comforting feel behind the wheel. Then I get home and I turn this game on.\n\nIt's a pleasant way to spend an evening without violating parole again. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Great game if you love driving, lots of mods to improve the realism however SCS are really ramping this up so less mods are needed.\n\nfully enjoying the open road",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "a fun game to play with friends and jam out to ur own music while driving in same convoy....Its a Great Game wait till u play it",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "great game. really scenic moments pop up that the player  can choose to admire the environment around them.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Is this a cozy game? No. But it does hit me like one. I keep coming back to it over and over. Great driving game not hard or complicated unless you turn on the settings to make it so. It made it onto my top games a number of years ago and it is unlikely that it will ever come off.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ATS is a great cozy game. Switch on the radio or play your own song selections as you take a drive. Long road trips in gorgeously rendered landscapes. I enjoy visiting famous landmarks I've heard about in American movies. Each DLC adds a lavish new region to the map to explore. Years of endless gameplay available. Thanks to the devs for such a great game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i love this game. like love is an understatement. i am extremely proud of the team at ATS for working to better than game all the time.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "great game, servers are good when you connect with other to convoy and cruise along. This game doesn't give you the grind your gears, it's laid back and chill. Play every night in LLCC",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "super good with a wheel and pedals, severe lack of wyatt wason tho...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I drive me Peterbuilt go past the speed limit take a corner way to fast fly of the hill land upside down. And then come home and play this game 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very realistic handling and a relaxing game to play. The developers are still adding fresh content to the game and the environmental diversity that comes with the different states keeps the game feeling fresh.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its a good game, but the copious amounts of dlc turns me off a little bit. I do like that the devs are actively adding new dlc with new states and cargo, but i cant justify buying it all at full price. I would reccomend playing the base game first, and if you get hooked, buy some dlc while on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Some crazy American scenery that's only gotten better over time as SCS releases more states. Great game, great variety of load, and of course, great community with many mods. Amazing to still see a developer keep up with their game years after release. Cant wait for British Columbia!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even without using any extra accessories, this is a wonderful game. Being able to add your own music is a blast and even though I am barely starting in the world of delivery, driving in this world feels wonderful. Reminds me of my days at amazon and this is a great game for anyone who wants a good driving game without all the racing culture this is a good get when discounted. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very meditating. There is just something so calming for me, to just drive a truck for 2 hours. A great way to relax after work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just cruising along while listening to my favorite streamer yap in the bg in my fav pastime in the evenings",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First time I bought this game after pirating it for a long time. I must say, I still enjoy playing it from the beginning after all this time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "American Truck Simulator has pros like realistic driving physics, detailed US landscapes, a relaxing atmosphere, and business management features. Cons include a less varied road network compared to its European counterpart, potential for repetitive gameplay, and a lack of extreme cargo options in the base game.\n\n[h3][b]Pros[/b][/h3]\n[list][*][b]Realistic and immersive:[/b] Features a 1:20 scale map of the United States, realistic physics, and detailed truck models. The AI is more alert and less prone to causing accidents, making for a smoother driving experience.\n[*][b]Relaxing and atmospheric:[/b] Offers a chill, low-stress gameplay loop centered on driving. Players can enjoy the changing scenery and unique identity of different states, making it a great way to \"soak in\" the sights.\n[*][b]Business management:[/b] Allows players to start their own trucking company, hire drivers, and manage a fleet of trucks and trailers.\n[*][b]Deep customization:[/b] Offers extensive customization for trucks, with many options for paint jobs, accessories, and engine tuning.\n[*][b]High replayability:[/b] With numerous DLC packs adding new states and jobs, the game has potential for long-term engagement, especially for those who enjoy simulation games. [/list]\n[h3][b]Cons[/b][/h3]\n[list][*][b]Less varied road network:[/b] The road network can be less dense and varied than in Euro Truck Simulator 2, with more large, flat stretches of highway.\n[*][b]Repetitive gameplay:[/b] The core gameplay loop of picking up and delivering cargo can become repetitive, especially without mods or other DLC.\n[*][b]Limited extreme loads:[/b] The base game does not include extreme cargo options like oversized or overweight trailers, which are available in other trucking simulations and may be added in future DLCs.\n[*][b]No \"quick travel\" or \"teleport\":[/b] This is a pro for some, but for others it can be a con, as it removes the ability to skip driving parts of the map and requires players to drive the entire route, even for short trips. [/list]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, possibly more than words can describe.\r\nI've spent +100hrs creating a logistics empire, and now i have the freedom to use a car mod to cruise around and explore the new States the team lovingly creates as dlc\r\ni highly reccommend. <3\r\n\r\ni do have to say tho, I will not be purchasing any more dlc until SCS increases the hirable driver limit, becuase as it stands theres no point buying more garages in new the states.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its so simple but so fun, long drives with trucks and you can play with up to 8 friends, its peak im telling you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VR is awesome, but it's a pain to setup. Had this game for years, and just never really got into. Since I have a Pimax Crystal Light I decided to give VR a try.  After many, and I mean many videos VR is working and I have not stopped driving. I didnt even think I would like just driving around but it is actually a lot of fun...and for some strange reason in this game I obey traffic laws :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Coming from console where the trucking games are brutal, I cant really complain. Bought a wheel and shifter and look forward to coming home from work and putting in some miles.Having to buy extra parts of the map sucks but it is what it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game for price great for people who like sims",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really like this game even though it is a little laggy (which i have demined to be my pc not the game itself i play this game any second i got that i'm not doing anything and i would recommend to more people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is possibly the best game I have ever played. The gameplay is riveting to say the least",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The American brother of Euro Truck Simulator 2. It's the same devs and a slightly newer engine. Journey across the American West and enjoy the scenic views of desert, desert and more desert. Pay $25+ to experience the flat American Midwest. And another $15+ another to customize your truck. \n\nIf you're considering this game it's worth it. Just note they have raised the sales price of State DLCs. I remember when they were $2.49 each on sale, but they're bordering on $5.99 a piece which is a bit too much especially the early DLCs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most chill game there is except when you accidentally crash into something",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to chill and talk with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trucking sims were some of my first pc games from around 30 years back.  So, when ATS came out, it was an immediate buy, even though I didn't have a proper rig to immediately play it.  Fast forward to today and I pre-order every map pack upon learning about it.  I highly recommend a proper wheel kit (ex: HORI truck control system) and an eye tracker, but even without any of that, the experience is spot-on.  I've never personally driven a rig before, but I've ridden with a friend many times who did.  I've also watched numerous videos of former/current truckers also playing the game in their free time.  \r\n\r\nI wish the world wasn't as scaled down (I believe I've read it's at 1:20 scale)...not to say I want anywhere remotely close to a 1:1 experience, but maybe 1:10 wouldn't be that bad?  I've been waiting till ATS gets to my home state of PA to see how the recreation goes, but recent bits I've been hearing does bring to light concerns about the eastern corridor and how close many cities along the East coast are, especially the northeast.  Philly, DC, Newark, and NYC are feared to be practically touching one another unless something else is figured out.  Maybe once the Mississippi is passed, the scale switches to 1:10 or 1:15?  \r\n\r\nScale aside, the only other thing that takes me out of the game is the lack of damage modeling, the ability for police to instantly fine you rather than you have to pull over first (spending time, etc), and likewise, how the towing system works.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing and captivating. keeps getting better with every update!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an addictive fun to play game with great looking scenery.  I found and added cabover mods which take me back to my childhood.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "American Truck Simulator provides a refined and unified trucking gameplay compared to Euro Truck Simulator 2. The layout of the map is more compact, featuring organized road systems that make long-distance driving seem organic instead of monotonous. The control of vehicles is steadily. The games focus on environmental detail-particularly in lighting and local ambiance-enhances the feeling of location. Although ETS2 includes a range of geographic diversity ATS seems more intentional and generally better balanced. In my view, it’s the superior title for players who want a focused, streamlined simulation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is fun to play.  there are a lot of bugs and cannot buy or upgrade trailer.  Not sure how to do service at shop that I own.  Don't know how to sell that shop and get one where I like to drive at.  Do not like California.  \r\n\r\nFew questions have not found answers for yet:\r\n\r\n1.  Why are trucks under contract governed to 65 mph?\r\n2.  Why are there so many cops, fire trucks and ambulances?\r\n3.  Why do AI trucks/cars just pull out in front of you and cause wreck and damage?\r\n4.  How to buy a second shop?\r\n\r\nI am sure that there are more, but having fun with game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, especially if you are planning on becoming a trucker one day, since it will help you figure out how to steer trailers. It features a lot of customization for your truck. They keep adding more and more states and I hope that they get up to 48 states eventually. They always seem to continue updating the game, even if you don't pay for more dlc. Tons of mod support which is awesome. AI could still be improved imo, and sometimes they can get in your way or steer into you. All in all this is a relaxing game, great support from the developers and just a great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can not believe I have not reviewed this game yet but worth especially if you can at least get the state DLC then very worth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely give it a try even if you have ETS 2. The world building and environment/level design are superior by most accounts. The American trucks are objectively cooler as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought the game, not knowing much about it. I thought it would be fun to drive around in a truck since I play GTA V and NFS games and have a lot of fun on the road. I also decided to buy some DLC to make it a bit more enjoyable. I have has so much fun in the past 8 hours that I'm looking for a sim wheel setup now lol. I would highly recommend this game to anyone who wants a fun/realistic/strategic driving game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its verry realistic and fun. just in the mirrors, the wheels on a car need to be spining. yours, follow buyer of your game. :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "country music trucking playlist while doing a convoy with your homie. i was lost in the sauce for 7 hours straight playing this game on my sim wheel. amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fire game for sure worth the money, even on crappy laptops like mine it runs smooth but poor quality because its a laptop. Ginueinly worth the money i paid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love relaxing to any driving sim then you will love crossing the North America in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a former truck driver, This game is amazingly realistic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is pretty expensive for $20 but its worth it for the high price but beamng.drive is a little bit better but its still a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Damn you tricked me\n\nI bought this game when it was on sale and it was so good that I ended up buying a lot of DLCs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐️⭐️⭐️⭐️⭐️ 10/10 — An Absolute Must-Play! ⭐️⭐️⭐️⭐️⭐️\n\nThis game is outstanding on so many levels. In a world overflowing with “just kill everything” titles and cookie-cutter simulators, this one rises above the noise with something genuinely fresh. It’s engaging, creative, immersive, and unbelievably easy to sink hours into without even realizing it.\n\nWhat really blows me away is how accessible it is — even if you’re not the most skilled player, the game welcomes you in and gives you room to enjoy yourself. It’s fun, it’s addictive, and it’s built with real heart.\n\nI seriously can’t recommend this game enough. Whether you’re a casual player or a hardcore gamer, this is an experience worth diving into.\n\n10/10. Absolutely fantastic!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still love this game, currently waiting to see them finish the two new car packs so i can try them out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very fun game but I have for sure had issues. Starting off with modding. It was very irritating because the mods weren't up to the games version so it didnt work. But that caused even more. Even after deleting all of my mods it would still crash my game. Currently redownloading it. But it is a pretty cool game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've only played on a few states and haven't done a whole lot of missions. Despite this I am shocked that my old racing wheel still works with a modern day game like this with very little jankiness that honestly I can blame on older drivers that I just needed to update. Which now it works fine.\nThis is by far the most realistic experience I've had in a truck driving game of any kind and the maps are ACCURATE, obviously some towns and roads are left out but the main things you would remember if you actually drove down that road WILL be there in the game. I can say this with experience, I've personally driven from the mid west to the west coast and had the most driving experience in CA which the map ingame was very good at capturing the entire state. \nThe details you can change and upgrade, to running your own trucking business, to having to do maintenance on your own truck and employees trucks is done very well and is simple to traverse. \nI could say a lot and compliment what the devs have done here all day, it's worth buying and I've gotten all the DLCs out so far and am hyped for the coming updates. Definitely worth every penny!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty unrealistic honestly, can't even hire lot lizards or rub shit into the floor of your truck",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am the first to admit, driving a truck long distance... might be a little boring. It isn't a game for everyone. If you have ever played a \"flow state\" racing game. Stay in the lines, watch your speed and corners. Turn off the cops, damage, and automate the parking. The game changed for me. You start picking up jobs, customizing your trucks, grinding routes. Making enough money to hire drivers to do more routes that drop money into your bank, steam rolling your cash flow. It has a odd feel, part management, part sim. All laden into a insanely massive recreation of the U.S. The DLC is on sale 4-5 times per year for dollars. When you start amassing states and they all become connected. It morphs into the largest map I have seen in gaming. To me, that was a huge pull to playing it and expanding my trucking company. And when you start driving, flowing, looking at the scenery. It is one of the best driving sim games ever created. Just remember, it isn't a racing game, but you can turn it into one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You wanted to drive a truck while not having a license at all? Well guess what, I've got a game for you! Euro Truck Simulator 2 and American Truck Simulator are one of the best games to learn to drive a truck without having to drive an actual truck at all! Not only you can do that, you can also manage your trucking business. I highly recommend this game to anyone who loves driving sim. On top of that, this is one of the games with the easiest mod system to install (Other games have tedious ways and programs to install mods). You just drag a mod to a folder, open your game, and use the mod you want. It's that easy! DLCs too, especially map DLCs, are also amazing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and somewhat realistic driving, I enjoy driving very much in real life so this just expands that to trucking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Therapeutically Hauling Cargo for Hours on End Across State Lines you can follow Traffic Rules signaling at every intersection. getting fined for Speeding by State Troopers There are  beautiful prairie Landscapes of Grass Mountainous Peaks Desert Dunes Coastal Beaches & Reefs it’s all just too darn peaceful. The realism of this Game is perfect just perfect no critiques :).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game. Unfortunately, just like ETS2, it relies heavily on mods to be at full potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm sure every gamer that played it wanted to become truck driver because of it. \n8.6/10 just because i dont own a truck by myself",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wasn't interested in a trucking game till a friend convinced me when I saw the price was at 6 bucks. Can safely say I love driving in this game a lot. good game 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just started to play it and I can tell is an amazing experience great quality 👌 \nIs what u really expect on a simulator!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty realistic game and good features.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the chill, yet realistic gameplay along with the states being very accurate to irl! Waiting for Michigan to release, but I can feel its coming soon!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for sure my kind of game to just put spotify on and drive i enjoy making money buying used trucks then hiring new drivers to expand my company im currently at 3 garages and 13 total trucks on the road ...only real complaint i might have is not all trucks sound realistic ...best sounding imo is the kenworth w900...and biggest complaint is the roads alot of them are good ...but some of them your in a 70mph zone then all of sudden corner you cant take at 70mph have to slow down to 40mph to make it...completely unrealistic to how real roads are designed but considering its only a few areas its not enough to make me hate the game...my tip to new players... keep your eyes peeled for corners pay attention dont trust the road and speed limits like in real life...id give this game a 8/10 also mod support is nice lot of cool stuff on there just access them thru the steam workshop and voila",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Same as Euro Truck Simulator, but with an American Flavour. But not sure about each single state being an add on by it's own. Makes a lot more inb spending than Euro Truck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its basically staring at a road for an hour at a time but ts pretty fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game 10/10 very fun with friends, realistic features",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I personally suggest this game especially if you have a steering wheel and pedals. This game has given me a lot of fun and also has a bunch of mods and DLC's which make the game even more fun👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trucks are bigger and faster than Euro Truck sim.  They depiction of American towns and cities and even the rural areas is pretty spot on with a few subtle digs that I find hilarious.  A steering wheel is a must (not sure if I have to tell you that) and it's a fun dopamine hit dropping off heavy loads across the country.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for people to pretend to drive over the road. This game have a few real pictures of the real thing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a fun game i just got it yesterday i just hope this game can be updated and have everything 100% perfect like real life for example have Portland in its actual spot not next to Astoria",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun, and i definitely recommend it. it is quite realistic and any high quality laptop can handle the game. the only thing i have a problem with is that you need dlcs to make the game fun. the base game comes with 3 states. nevada, arizona, and california. even with the california refresh. parts of california are outdated. and most of nevada and arizona too. you can see the clear difference in between dlcs like louisiana and texas compared to nevada and arizona. one second you are in a ultra realistic setting. another you are in a old game that looks nothing like real life. so the game is enjoyable, just try buying more newer dlcs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really good game, well made and the detail is best to none. Best played with a wheel and pedals.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a rare good game like we don't see anymore, graphically very beautiful and realistic, no technical issues, it runs well on the Steam Deck—I confirmed this with the Steam team, the trucks are ultra-realistic, and when you drive on sand you can clearly hear the sound of the pebbles. You did a great job! Keep going and stay humble! I love the radio streaming—it has a lot and works well, which makes it more fun! You really feel like you're in the United States, your sense of immersion is good, there are drones, planes, and lots of small details. You can set the options you want to be comfortable in the game, adjust your seat, mirrors, use the talking GPS—so many good ideas. Well, I missed the promotion, but the price is not expensive at all and is reasonable. For such a game, we shouldn't ask for more, as I've read, because you developers have optimized it in KB, which is good. What's left are just minor things; all the good stuff is in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like how realistic it is and that you can play a solo, with others and that they are constantly adding new content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game it is good too sit back relax and listen to country truck with mates or play by your self the i wish there was an australian trucking game made by these guys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game for driving across America. Love the continuous additions of states.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a game I feel I come back to whenever I don't have much to play. It's something to chill out, play and explore. Would recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolute vibe and simply amazing game to just zone out and relax with. The handling of the trucks feels good, the locations are shockingly accurate to their real life counter parts, and it's just a nice and peaceful way to unwind after a long day. Very excited to see them starting to add Canada too! Can't wait until we get to Michigan so we can go over the bridges.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything about ATS and the community in general is great!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Driving slowly is boring in this game but driving too fast and crashing to cars is fun 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun sim hours of relaxation and fun for whole family of many different age groups.  The customizations are endless to custom paint,motor mods, custom trailers,etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For me, this game has become an addiction. tons of great content and updates over the years and there's no end in sight thanks to SCS Software. 10/10 sim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game 100% better with a controller or wheel so I recommend playing with one of the 2, overall great game even if you're on a lower end pc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just like starting a real company, beginnings aren't easy. But in this case it really serves to get you started and comfortable. By the time your company is up and running and making a little money is where the fun really starts. In a world that's ever expanded (with DLCs) and reworked, you're never done. Grow your company, stop worrying about money and enjoy the scenery while hauling cargo and taking in the sights. A relaxing game if there ever was one!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game and the modding community so much! The Cadillac CT5-V Blackwing mod has kept me in the game for a year and a half now, including the Chevrolet Impala. And I love the base game semis as well, their models are perfect!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, as you can see I put a lot of hours into this game. I mainly use it to relax and listen to some music or podcasts while I am driving virtually all across North America. Since the modding community is so big and resourceful, there is literally not any object in this game you can modify to your taste. The mods improve the game a lot and take the game to an even bigger scale (especially when you use a map mods). I also like that the developers are taking care about their game regularly although sometimes I wish the updates would happen a bit faster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. Amazing  visuals. Amazing Physics. Amazing Endless grinding. Amazing everything",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is lots of fun if you just wanna relax and vibe and truck across America. Only downside is you need to spend a pretty penny on a lot of dlc, otherwise the map is a bit small.\n\nGet the dlcs on sale if possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "easily my favorite game, very fun gameplay and feels about as real as I imagine any reasonbaly sized and priced game could ever be. mods and dlc's certainly elevate the game but overall an awesome sim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gives a very  realistic gameplay for truck drivers or want to be truck drivers or just people in general. One of my go to games when im feeling bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The  best game ever I played this is  the best I ever game that I will play over and over again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Calm and relaxing. Really helpful when you wanna get your mind off things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I needed a break from Farming Simulator 25, so I downloaded the Demo of American Truck Simulator. WoW! I am now hooked on this game, bought a bunch of states, have 10 garages, 16 trucks, 15 drivers, and I bought a steering wheel which gives the game a whole new feel! For years I couldn't justify the cost of a steering wheel and pedals, but now that I'm retired, down the rabbit hole I go! This game is really fun if you've ever wondered what it is sort of like to drive a truck instead of passing them!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After a rocky start years ago, it just keeps getting better and better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game for relaxation, without stress, without busyness, which I enjoy playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please hurry up and drop it on console already, I wanna kick back in bed and play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "American Truck Simulator's store page includes part of a review from Destructoid, in which the reviewer describes the experience of driving into Las Vegas at night while listening to Eric Clapton's \"Wonderful Tonight\". The reviewer also says that moment will probably stick with them forever. After reading that, I began to wonder if I would ever have a similar experience.\n\nThen, one day...it happened.\n\nI hadn't played in a couple of days, but I still had a delivery to finish. So I opened the game to do just that. One of my favorite things about ATS (and ETS2) is that it offers live radio. Listening to any of the variety of available stations is a really nice way to pass the time on long journeys. I tuned in to one called 80s Planet, and was treated to a number of great songs such as \"Everybody Wants to Rule the World\" by Tears for Fears, \"Crazy Crazy Night\" by KISS, and \"The Way You Make Me Feel\" by Michael Jackson, among others.\n\nThen everything went quiet for a moment. I noticed the sun starting to rise. As it did, \"True\" by Spandau Ballet began playing. The stars must have aligned to make it happen right at that moment. Why that song? Because it's kind of a comfort song for me. It's special to me, just as \"Wonderful Tonight\" may be special to the Destructoid reviewer. To put it another way, listening to Spandau Ballet's \"True\" while driving a big rig at dawn through the New Mexico desert is something that will stick with me probably forever.\n\nAmerican Truck Simulator as a whole has become somewhat special to me partly because of little things like this. I can say the same for Euro Truck Simulator 2, although I haven't played that one as much as I've played ATS. If you're thinking of trying either one, I say go for it. Maybe you'll get to experience something just as pleasant as what I've described.\n\n8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I quit my job and left my family to become a full-time in-game trucker. My parents aren't very supportive of my decision, as I moved back in their basement... but if they give me a hard time about it, I will start playing Crime Scene Cleaner.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Firstly I want to say that this job is the reason I became a truck driver.  I fell in love with the idea of this career because of this game.  Anyone considering the career could start with this game before researching the industry further and deciding if its for them. \n\nThat being said... This game is almost 10 years old and only 18 states are available.  As far as I can tell, all but three are still paid DLC.  That's fucking ridiculous.  My issue isn't that all 50, or even the contiguous 48 aren't available yet.  This team puts in a stupid amount of work and detail into these releases.  My problem is they still charge for DLC that came out in 2016.  SCS needs to start including older states in the base game as new states are released.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Would I recommend this game to other players? It really depends on what you're looking for and (!) how many money you want to spent. I love the game, but there are some reasons why I rather would say No than Go, and I chose to pull the \"No\" unfortunately despite being a great game.\n\nI got used to ATS as a long time ETS2 player and ATS has some benefits in comparison to ETS2, but it also has some huge downsides.\n\nLet's start with the advantages.\n\n1.) Although the map scale is actually a tad smaller than ETS2 (ETS2: 1:19 - ATS: 1:20) if often feels bigger and more realistic than ETS2 because of the larger size of the countryside and increased distance between bigger cities in real life. That's a big pro for me.\n\n2.) The game mechanics as a whole are equal to the ones in ETS2. Menus, Settings, 99% of the gameplay mechanics are identical. Yet, it is complete different experience to ETS2, because of the american topography, terrain, infrastructure, traffic rules, vehicles, etc. A big advantage of the american traffic system is that you can turn right on a red light. However, I feel that this is evened out by needing to wait for left turns longer at the intersections and their used system.\n\n3.) Another advantage is that ATS offers (currently) a more immersive gameplay. You have the weigh stations, which you have to go to if your truck and trailer exceed a certain value, and the most times you do jobs you have to go to them. In ETS2, weigh and customs stations of that kind are optional if they offer any gameplay at all and are just a visual aspect.\n\n4.) The trucks are so cool. A lot cooler than the ones in ETS2 with the big nose and the huge room in the back. But they also have disadvantages to the increased size up front and behind you. It's a lot more difficult to park and do driving manoveurs than in ETS2. With the big nose in front, you don't have as much space to park and vision to see on the roads. Also the big cabin sleep room (which is optional and not given for the Day Cab versions of the trucks, which by the way have window to the back which is very cool), can be a problem. And the trailers can be larger than the ones in europe as well. So parking and driving requires more effort and is more challenging than in ETS2.\n\nNow let's come to the downsides in comparison to ETS2.\n\n5.) The base map that comes free with the game just consists of California, Nevada and Arizona. For every other state of the US (doesn't matter how small), you need to pay full price for. While I personally think it's absolutely okay to charge for extra maps, I'm not so okay with the DLC policy of SCS Software for ATS like I do and highly appreciate for ETS2.\n\nFirst of all, the base map is not as versatile as the one for ETS2. To 90% it covers desert zones only, which indeed displays a very important character of america but for anyone who wants to drive in more cooler climate zones, you have to pay for some extra map DLCs.  \n\nAnother aspect is that SCS Software decided to start in California (West) and then slowly progress to the east over the years. While 99% of ATS players are okay with that, I'm not. I think it's very bad that they decided to avoid the east coast of america in the past, present and the foreseeable future and rather focus on the midlands and now even British Colombia. New York, Florida and any other east coast states or areas (including canadian Toronto, Ottawa, Montreal and Quebec regions) will be still a long long long way to go to, which maybe (who knows what will be and happen in a few years) maybe never will come to fruition. This decision was and is wrong in my opinion. Many people come from these states and areas and also would like to have their areas represented in a game called \"American Truck Simulator\", not \"West American Truck Simulator\".\n\nSCS did it very differently with ETS2, as they chose the free base map to consist of the map part of most popularity and importance for the main market to come first. And then build any additional areas from inside out. \n\nWith these facts, I feel that ATS is unfortunately moreover in a category of being a cash grab, which other developers do and actually was the thing I liked so much on SCS Software in regard to ETS2. Every ETS2 DLC is reasonably and fair priced (even often undervalued for the maps offered if you ask me). I'm a bit disappointed by SCS Software, that they apparently did not chose the same way for ATS and push hands out for full price money even for the tiniest states. If you ask for full price on biggies like Texas and British Columbia with huge size and road network. No problem. I'm gladly willing to pay more for more effort. But not if you decide to charge for the smallest pieces of road networks in an equal way. SCS easily could have bundled 2 or 3 states together and then sell them in an equal way they did and do for SCS. But no they didn't.\n\nMy assumption is that due to mistakes in planning the location and amount of the free base map and the DLC strategy heading from the base map slowly to the north and east, it requires them to have and keep this business model because ATS has not nearly the same amount of players as ETS2 does. \n\nBut it all depends on how the developers decide to build their game and continue to go forward with it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its 2025 and this game has no native way to display on anything but your primary monitor without changing system settings or messing around with configs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is fun and looks pretty good.  The big downside is that it constantly resets all my controls with every update.  This game has too many controls and settings to be doing that.  It's very annoying and has really kept me from playing recently because I don't want to go through the hours of setup every little update they do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game kees crashing after couple of minutes, literally unplayable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controller no longer works properly. All icons change on screen to controller button, Only some buttons work correctly and in the setup wizard under advanced setup it shows that it is working. When I go to change controls, my triggers and other buttons do not register. Also, in the controls section it shows my controller as what it is (8bitdo,registers as an xbox controller). Works fine with any other game. Fix and I will change thumb.\n\nIt's a good game. I keep leaving and coming back to it. I can recommend it but maybe at a steep discount. Honestly the way the are doing this game is a little scummy. Base game only has a couple states and they are selling you the rest as dlc, so it will be over $100 for the full game when/if they finish it.\n\n There are a few things that are un-realistic like the acceleration (I am a truck driver). My current load I left the game with is 1 pickup truck. I have an 18 speed and should not struggle going up hill or taking as long to accelerate. The way they track milage is un realistic as well but I get why its like it is. Gas stations should not be labeled on map since you would not disconnect from trailer in roadway just to get in to fuel.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "finished a job in nevada only to get teleported to kansas, glitched in the sky with the only way out to be emptying all the money id earned to get towed across to seattle. it was fun until a glitch crippled my career run. glitch is also contagious to anyone else in convoy. so ruined others runs too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so bad Euro truck is good euroo truck has good trucks the game is crashing out while i play the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Devs broke game and want players to fix there problems. Devs are expecting we all rich and we all players have hi end pcs. Devs r garbage  people",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm done with this game and i'm tired of SCS and others like them.\n\nThey've had 10 years. 10 bloody years, TEN to improve the simulation but they don't care about making the game better for us they just want to sell DLC after DLC.\nThere's over 250€ worth of DLC for the game and they have hundreds of employees so this is not a small, poor indie dev team that simply doesn't have the manpower or can't afford to hire more staff or didn't have the time.\nThey had the time, they have the manpower but why would they improve the game when there's an army ready to buy every DLC they release and not question anything they do?\n\nCan't say i blame them for their approach but i'm done supporting them.\n\nThey can't fix the traffic, fix the AI, fix the stupid damage model where trucks turn off because of damaged wheels, improve the driving model, etc etc... why would i bother listing everything when they're not gonna fix it?\nThey refuse to add a single new feature into the game.\nInstead they have modders working for them for free addressing these issues. Free labour so they can make even more money. Nice.\n\nScrew you SCS.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Why is there no way to decrease the mouse sensitivity in the settings? After a web search, I found that I could change a config file to decrease it for the in-game camera, but that still doesn't help me in the menus, where the mouse is too sensitive. This was annoying enough for me to not pick up the rest of the DLC after trying out the base game. I don't want to find out what other base expectations are not present.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "physics are horrendous, game tries to crash every 45 seconds and makes you constantly crash your truck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game but they just remade ALL the company logos with lazy minimalist corpo-slop made of 3 shapes at most, with NO way to go back. This by itself is minor, but they also decided the only logo that doesn't get a remake and just doesn't exist in game anymore was the only one that represented native americans.\n\nDon't support the erasure of native american culture. This is Land O' Lakes all over again, you are removing the natives and keeping the land, making yourselves look more racist than the social justice warriors (that don't even own the game) who complained for you to remove it in the first place.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maps suck, not towns and when there is one its bland and tiny. No different road sounds, all boring. All highway, which gets old. I love driving but there are better games. I do not recommend this game to anyone. Go play ets2 where they put in some effort. They don't even add trucks to these games anymore. They just keep coming out with new, old boring maps and states. so much so they moved to Canada. These devs suck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I play ETS 2, and tried this one too. First of all the mirror placement is really awkward, you are forced to use a high FOV just to see the mirror without being forced to stay with the hand on the mouse all the time, that is not the case in ETS 2. The rest is pretty much the same. I would recommend this game but I can't. USA does not have only 3 States. FFS, you need to buy every state witch makes this game cost over 500 euros to get all the DLC's, if you include all USA, witch by the way, still isn't included, WTF!? The engine is outdated, with no collision damage physics, and it's pushed to the maximum, it's a 2016 game and you have the audacity to ask for so much money!? You guys have no respect for your customers. Buying this, it's like buying a 20 euro Demo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "absolute dog wont load nothing works never playing this ever again fix the ah game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to like it but the Trucks being huge albeit realistic poses a bit of a challenge combined with much bigger trailers make some missions too hard unless you have experience driving big rigs your self.\r\n\r\nPersonally I'm sticking with ETS 2 + You get 2 states and 1 free, the rest you have to pay which is typical 2025 devs at this point",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I honked at random cars for 5 hours straight. then i hit a family of 4 and their dog. eventually I couldnt take it anymore and tried to drift and flew off a bridge...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it keeps crushing while playing the game pls fix the issue",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After update 1.51 i don't wanna play this sh!t anymore, controller settings fuсkеd up, and it's not fixable, i tried remap my old settings, game just ignores this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Made me register to play online. Did. Wouldn't send verification email because I have an outlook email. Installed to play with a friend and the need to route me into their ecosystem completely got in the way of that. \n\nGreat game. Don't make me make an additional account, especially if you have a boofed system that doesn't even let me do it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hey yall this game is so poop bro like my freind cuts me off and i get hit stick by a derek henry aka a big ass white \ntruck white  like tell me how i have more jiggle effects than ice spice bro pleases fix this i have a clip just contact me if you want this. and dont get me started on the music bro i was born in 2010 i am listening to got damn anime shi bro",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is crashing  can fix it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buh I got gifted this game they forced me to accept it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i havent play the game yet and its done",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it doesnt work!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "to mini to list",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gAME SUCKD DIH",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No thanks!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "le jeux fais que crash calisssssssssssssssssssssssssss",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "is bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Firstly I want to say that this job is the reason I became a truck driver.  I fell in love with the idea of this career because of this game.  Anyone considering the career could start with this game before researching the industry further and deciding if its for them. \n\nThat being said... This game is almost 10 years old and only 18 states are available.  As far as I can tell, all but three are still paid DLC.  That's fucking ridiculous.  My issue isn't that all 50, or even the contiguous 48 aren't available yet.  This team puts in a stupid amount of work and detail into these releases.  My problem is they still charge for DLC that came out in 2016.  SCS needs to start including older states in the base game as new states are released.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Would I recommend this game to other players? It really depends on what you're looking for and (!) how many money you want to spent. I love the game, but there are some reasons why I rather would say No than Go, and I chose to pull the \"No\" unfortunately despite being a great game.\n\nI got used to ATS as a long time ETS2 player and ATS has some benefits in comparison to ETS2, but it also has some huge downsides.\n\nLet's start with the advantages.\n\n1.) Although the map scale is actually a tad smaller than ETS2 (ETS2: 1:19 - ATS: 1:20) if often feels bigger and more realistic than ETS2 because of the larger size of the countryside and increased distance between bigger cities in real life. That's a big pro for me.\n\n2.) The game mechanics as a whole are equal to the ones in ETS2. Menus, Settings, 99% of the gameplay mechanics are identical. Yet, it is complete different experience to ETS2, because of the american topography, terrain, infrastructure, traffic rules, vehicles, etc. A big advantage of the american traffic system is that you can turn right on a red light. However, I feel that this is evened out by needing to wait for left turns longer at the intersections and their used system.\n\n3.) Another advantage is that ATS offers (currently) a more immersive gameplay. You have the weigh stations, which you have to go to if your truck and trailer exceed a certain value, and the most times you do jobs you have to go to them. In ETS2, weigh and customs stations of that kind are optional if they offer any gameplay at all and are just a visual aspect.\n\n4.) The trucks are so cool. A lot cooler than the ones in ETS2 with the big nose and the huge room in the back. But they also have disadvantages to the increased size up front and behind you. It's a lot more difficult to park and do driving manoveurs than in ETS2. With the big nose in front, you don't have as much space to park and vision to see on the roads. Also the big cabin sleep room (which is optional and not given for the Day Cab versions of the trucks, which by the way have window to the back which is very cool), can be a problem. And the trailers can be larger than the ones in europe as well. So parking and driving requires more effort and is more challenging than in ETS2.\n\nNow let's come to the downsides in comparison to ETS2.\n\n5.) The base map that comes free with the game just consists of California, Nevada and Arizona. For every other state of the US (doesn't matter how small), you need to pay full price for. While I personally think it's absolutely okay to charge for extra maps, I'm not so okay with the DLC policy of SCS Software for ATS like I do and highly appreciate for ETS2.\n\nFirst of all, the base map is not as versatile as the one for ETS2. To 90% it covers desert zones only, which indeed displays a very important character of america but for anyone who wants to drive in more cooler climate zones, you have to pay for some extra map DLCs.  \n\nAnother aspect is that SCS Software decided to start in California (West) and then slowly progress to the east over the years. While 99% of ATS players are okay with that, I'm not. I think it's very bad that they decided to avoid the east coast of america in the past, present and the foreseeable future and rather focus on the midlands and now even British Colombia. New York, Florida and any other east coast states or areas (including canadian Toronto, Ottawa, Montreal and Quebec regions) will be still a long long long way to go to, which maybe (who knows what will be and happen in a few years) maybe never will come to fruition. This decision was and is wrong in my opinion. Many people come from these states and areas and also would like to have their areas represented in a game called \"American Truck Simulator\", not \"West American Truck Simulator\".\n\nSCS did it very differently with ETS2, as they chose the free base map to consist of the map part of most popularity and importance for the main market to come first. And then build any additional areas from inside out. \n\nWith these facts, I feel that ATS is unfortunately moreover in a category of being a cash grab, which other developers do and actually was the thing I liked so much on SCS Software in regard to ETS2. Every ETS2 DLC is reasonably and fair priced (even often undervalued for the maps offered if you ask me). I'm a bit disappointed by SCS Software, that they apparently did not chose the same way for ATS and push hands out for full price money even for the tiniest states. If you ask for full price on biggies like Texas and British Columbia with huge size and road network. No problem. I'm gladly willing to pay more for more effort. But not if you decide to charge for the smallest pieces of road networks in an equal way. SCS easily could have bundled 2 or 3 states together and then sell them in an equal way they did and do for SCS. But no they didn't.\n\nMy assumption is that due to mistakes in planning the location and amount of the free base map and the DLC strategy heading from the base map slowly to the north and east, it requires them to have and keep this business model because ATS has not nearly the same amount of players as ETS2 does. \n\nBut it all depends on how the developers decide to build their game and continue to go forward with it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Well, game isn't bad, but:\r\n- stay away from heavy and special cargo DLC's - there's no suitable trucks for that. Hauls up to ~ 60k lbs are more, or less, but higher - ouch... 4 example - MACK in-game model have just 505 HP max, despite having 600+ IRL long ago, not to ment \"Titan\" series, introduced 1995. ...\r\n- AI drivers developers probably never ever have seen or drived real Truck, those unexpected lane \"jumps\" right before you on way lover speed are simply terrible, IRL such actions ends just one way - destroyed car, counting in mass and inertia of a Truck...\r\n- if you would like to play - disable \"road accidents\" and next option - \"detours\" ASAP. IRL first, police have to do, is open way for use, in game - it's just a trap, often - close to the point of destination. In most cases you have enough time and fuel for detour, but it steals your time...\r\n- but most annoying are those countless \"weight stations\" in the middle of nowhere, often - right before hills... As soon as you raise speed - ups, another one, not far away from previous, sometimes even in the middle of hills serpentine... Feels like developers messed runaway truck ramps with weight stations. Guys, it's 21-st century outside, cameras and software are able to detect truck registration numbers and all that stuff, and yes - there's Internet to exchange data between stations... Or is it a prob in USA? xD\r\nBut, in general, as mentioned before - game isn't that bad... :-)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its 2025 and this game has no native way to display on anything but your primary monitor without changing system settings or messing around with configs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Is the base game fun? Yes. Is it even better with friends and maybe a few mods? Yes.\n\nWhat isnt fun is paying $12 per state you release. 40+ states @ $12 a pop is $500 for a game that should be no more than $100 for all that content. Do you need to do research in order to make these states, yes. Do you need THAT much money? no. Just to give you an idea of how simple their process is (insert garage and places for jobs at every MAJOR city in a state. For some states that's only 1 or two, like Arizona. The rest is pure roads and topography, which is so fucking easy since most of the assets are copy and pasted. No, I cannot recommend paying $500 to drive in every state. Fuck that noise.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is fun and looks pretty good.  The big downside is that it constantly resets all my controls with every update.  This game has too many controls and settings to be doing that.  It's very annoying and has really kept me from playing recently because I don't want to go through the hours of setup every little update they do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game kees crashing after couple of minutes, literally unplayable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controller no longer works properly. All icons change on screen to controller button, Only some buttons work correctly and in the setup wizard under advanced setup it shows that it is working. When I go to change controls, my triggers and other buttons do not register. Also, in the controls section it shows my controller as what it is (8bitdo,registers as an xbox controller). Works fine with any other game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "finished a job in nevada only to get teleported to kansas, glitched in the sky with the only way out to be emptying all the money id earned to get towed across to seattle. it was fun until a glitch crippled my career run. glitch is also contagious to anyone else in convoy. so ruined others runs too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so bad Euro truck is good euroo truck has good trucks the game is crashing out while i play the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Devs broke game and want players to fix there problems. Devs are expecting we all rich and we all players have hi end pcs. Devs r garbage  people",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm done with this game and i'm tired of SCS and others like them.\n\nThey've had 10 years. 10 bloody years, TEN to improve the simulation but they don't care about making the game better for us they just want to sell DLC after DLC.\nThere's over 250€ worth of DLC for the game and they have hundreds of employees so this is not a small, poor indie dev team that simply doesn't have the manpower or can't afford to hire more staff or didn't have the time.\nThey had the time, they have the manpower but why would they improve the game when there's an army ready to buy every DLC they release and not question anything they do?\n\nCan't say i blame them for their approach but i'm done supporting them.\n\nThey can't fix the traffic, fix the AI, fix the stupid damage model where trucks turn off because of damaged wheels, improve the driving model, etc etc... why would i bother listing everything when they're not gonna fix it?\nThey refuse to add a single new feature into the game.\nInstead they have modders working for them for free addressing these issues. Free labour so they can make even more money. Nice.\n\nScrew you SCS.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Why is there no way to decrease the mouse sensitivity in the settings? After a web search, I found that I could change a config file to decrease it for the in-game camera, but that still doesn't help me in the menus, where the mouse is too sensitive. This was annoying enough for me to not pick up the rest of the DLC after trying out the base game. I don't want to find out what other base expectations are not present.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "physics are horrendous, game tries to crash every 45 seconds and makes you constantly crash your truck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game but they just remade ALL the company logos with lazy minimalist corpo-slop made of 3 shapes at most, with NO way to go back. This by itself is minor, but they also decided the only logo that doesn't get a remake and just doesn't exist in game anymore was the only one that represented native americans.\n\nDon't support the erasure of native american culture. This is Land O' Lakes all over again, you are removing the natives and keeping the land, making yourselves look more racist than the social justice warriors (that don't even own the game) who complained for you to remove it in the first place.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maps suck, not towns and when there is one its bland and tiny. No different road sounds, all boring. All highway, which gets old. I love driving but there are better games. I do not recommend this game to anyone. Go play ets2 where they put in some effort. They don't even add trucks to these games anymore. They just keep coming out with new, old boring maps and states. so much so they moved to Canada. These devs suck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I play ETS 2, and tried this one too. First of all the mirror placement is really awkward, you are forced to use a high FOV just to see the mirror without being forced to stay with the hand on the mouse all the time, that is not the case in ETS 2. The rest is pretty much the same. I would recommend this game but I can't. USA does not have only 3 States. FFS, you need to buy every state witch makes this game cost over 500 euros to get all the DLC's, if you include all USA, witch by the way, still isn't included, WTF!? The engine is outdated, with no collision damage physics, and it's pushed to the maximum, it's a 2016 game and you have the audacity to ask for so much money!? You guys have no respect for your customers. Buying this, it's like buying a 20 euro Demo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "absolute dog wont load nothing works never playing this ever again fix the ah game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to like it but the Trucks being huge albeit realistic poses a bit of a challenge combined with much bigger trailers make some missions too hard unless you have experience driving big rigs your self.\r\n\r\nPersonally I'm sticking with ETS 2 + You get 2 states and 1 free, the rest you have to pay which is typical 2025 devs at this point",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I honked at random cars for 5 hours straight. then i hit a family of 4 and their dog. eventually I couldnt take it anymore and tried to drift and flew off a bridge...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it keeps crushing while playing the game pls fix the issue",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After update 1.51 i don't wanna play this sh!t anymore, controller settings fuсkеd up, and it's not fixable, i tried remap my old settings, game just ignores this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Made me register to play online. Did. Wouldn't send verification email because I have an outlook email. Installed to play with a friend and the need to route me into their ecosystem completely got in the way of that. \n\nGreat game. Don't make me make an additional account, especially if you have a boofed system that doesn't even let me do it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hey yall this game is so poop bro like my freind cuts me off and i get hit stick by a derek henry aka a big ass white \ntruck white  like tell me how i have more jiggle effects than ice spice bro pleases fix this i have a clip just contact me if you want this. and dont get me started on the music bro i was born in 2010 i am listening to got damn anime shi bro",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is crashing  can fix it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buh I got gifted this game they forced me to accept it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i havent play the game yet and its done",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it doesnt work!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "to mini to list",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gAME SUCKD DIH",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No thanks!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "le jeux fais que crash calisssssssssssssssssssssssssss",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "is bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Firstly I want to say that this job is the reason I became a truck driver.  I fell in love with the idea of this career because of this game.  Anyone considering the career could start with this game before researching the industry further and deciding if its for them. \n\nThat being said... This game is almost 10 years old and only 18 states are available.  As far as I can tell, all but three are still paid DLC.  That's fucking ridiculous.  My issue isn't that all 50, or even the contiguous 48 aren't available yet.  This team puts in a stupid amount of work and detail into these releases.  My problem is they still charge for DLC that came out in 2016.  SCS needs to start including older states in the base game as new states are released.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Would I recommend this game to other players? It really depends on what you're looking for and (!) how many money you want to spent. I love the game, but there are some reasons why I rather would say No than Go, and I chose to pull the \"No\" unfortunately despite being a great game.\n\nI got used to ATS as a long time ETS2 player and ATS has some benefits in comparison to ETS2, but it also has some huge downsides.\n\nLet's start with the advantages.\n\n1.) Although the map scale is actually a tad smaller than ETS2 (ETS2: 1:19 - ATS: 1:20) if often feels bigger and more realistic than ETS2 because of the larger size of the countryside and increased distance between bigger cities in real life. That's a big pro for me.\n\n2.) The game mechanics as a whole are equal to the ones in ETS2. Menus, Settings, 99% of the gameplay mechanics are identical. Yet, it is complete different experience to ETS2, because of the american topography, terrain, infrastructure, traffic rules, vehicles, etc. A big advantage of the american traffic system is that you can turn right on a red light. However, I feel that this is evened out by needing to wait for left turns longer at the intersections and their used system.\n\n3.) Another advantage is that ATS offers (currently) a more immersive gameplay. You have the weigh stations, which you have to go to if your truck and trailer exceed a certain value, and the most times you do jobs you have to go to them. In ETS2, weigh and customs stations of that kind are optional if they offer any gameplay at all and are just a visual aspect.\n\n4.) The trucks are so cool. A lot cooler than the ones in ETS2 with the big nose and the huge room in the back. But they also have disadvantages to the increased size up front and behind you. It's a lot more difficult to park and do driving manoveurs than in ETS2. With the big nose in front, you don't have as much space to park and vision to see on the roads. Also the big cabin sleep room (which is optional and not given for the Day Cab versions of the trucks, which by the way have window to the back which is very cool), can be a problem. And the trailers can be larger than the ones in europe as well. So parking and driving requires more effort and is more challenging than in ETS2.\n\nNow let's come to the downsides in comparison to ETS2.\n\n5.) The base map that comes free with the game just consists of California, Nevada and Arizona. For every other state of the US (doesn't matter how small), you need to pay full price for. While I personally think it's absolutely okay to charge for extra maps, I'm not so okay with the DLC policy of SCS Software for ATS like I do and highly appreciate for ETS2.\n\nFirst of all, the base map is not as versatile as the one for ETS2. To 90% it covers desert zones only, which indeed displays a very important character of america but for anyone who wants to drive in more cooler climate zones, you have to pay for some extra map DLCs.  \n\nAnother aspect is that SCS Software decided to start in California (West) and then slowly progress to the east over the years. While 99% of ATS players are okay with that, I'm not. I think it's very bad that they decided to avoid the east coast of america in the past, present and the foreseeable future and rather focus on the midlands and now even British Colombia. New York, Florida and any other east coast states or areas (including canadian Toronto, Ottawa, Montreal and Quebec regions) will be still a long long long way to go to, which maybe (who knows what will be and happen in a few years) maybe never will come to fruition. This decision was and is wrong in my opinion. Many people come from these states and areas and also would like to have their areas represented in a game called \"American Truck Simulator\", not \"West American Truck Simulator\".\n\nSCS did it very differently with ETS2, as they chose the free base map to consist of the map part of most popularity and importance for the main market to come first. And then build any additional areas from inside out. \n\nWith these facts, I feel that ATS is unfortunately moreover in a category of being a cash grab, which other developers do and actually was the thing I liked so much on SCS Software in regard to ETS2. Every ETS2 DLC is reasonably and fair priced (even often undervalued for the maps offered if you ask me). I'm a bit disappointed by SCS Software, that they apparently did not chose the same way for ATS and push hands out for full price money even for the tiniest states. If you ask for full price on biggies like Texas and British Columbia with huge size and road network. No problem. I'm gladly willing to pay more for more effort. But not if you decide to charge for the smallest pieces of road networks in an equal way. SCS easily could have bundled 2 or 3 states together and then sell them in an equal way they did and do for SCS. But no they didn't.\n\nMy assumption is that due to mistakes in planning the location and amount of the free base map and the DLC strategy heading from the base map slowly to the north and east, it requires them to have and keep this business model because ATS has not nearly the same amount of players as ETS2 does. \n\nBut it all depends on how the developers decide to build their game and continue to go forward with it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Well, game isn't bad, but:\r\n- stay away from heavy and special cargo DLC's - there's no suitable trucks for that. Hauls up to ~ 60k lbs are more, or less, but higher - ouch... 4 example - MACK in-game model have just 505 HP max, despite having 600+ IRL long ago, not to ment \"Titan\" series, introduced 1995. ...\r\n- AI drivers developers probably never ever have seen or drived real Truck, those unexpected lane \"jumps\" right before you on way lover speed are simply terrible, IRL such actions ends just one way - destroyed car, counting in mass and inertia of a Truck...\r\n- if you would like to play - disable \"road accidents\" and next option - \"detours\" ASAP. IRL first, police have to do, is open way for use, in game - it's just a trap, often - close to the point of destination. In most cases you have enough time and fuel for detour, but it steals your time...\r\n- but most annoying are those countless \"weight stations\" in the middle of nowhere, often - right before hills... As soon as you raise speed - ups, another one, not far away from previous, sometimes even in the middle of hills serpentine... Feels like developers messed runaway truck ramps with weight stations. Guys, it's 21-st century outside, cameras and software are able to detect truck registration numbers and all that stuff, and yes - there's Internet to exchange data between stations... Or is it a prob in USA? xD\r\nBut, in general, as mentioned before - game isn't that bad... :-)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its 2025 and this game has no native way to display on anything but your primary monitor without changing system settings or messing around with configs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Is the base game fun? Yes. Is it even better with friends and maybe a few mods? Yes.\n\nWhat isnt fun is paying $12 per state you release. 40+ states @ $12 a pop is $500 for a game that should be no more than $100 for all that content. Do you need to do research in order to make these states, yes. Do you need THAT much money? no. Just to give you an idea of how simple their process is (insert garage and places for jobs at every MAJOR city in a state. For some states that's only 1 or two, like Arizona. The rest is pure roads and topography, which is so fucking easy since most of the assets are copy and pasted. No, I cannot recommend paying $500 to drive in every state. Fuck that noise.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is fun and looks pretty good.  The big downside is that it constantly resets all my controls with every update.  This game has too many controls and settings to be doing that.  It's very annoying and has really kept me from playing recently because I don't want to go through the hours of setup every little update they do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game kees crashing after couple of minutes, literally unplayable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "finished a job in nevada only to get teleported to kansas, glitched in the sky with the only way out to be emptying all the money id earned to get towed across to seattle. it was fun until a glitch crippled my career run. glitch is also contagious to anyone else in convoy. so ruined others runs too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so bad Euro truck is good euroo truck has good trucks the game is crashing out while i play the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Devs broke game and want players to fix there problems. Devs are expecting we all rich and we all players have hi end pcs. Devs r garbage  people",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm done with this game and i'm tired of SCS and others like them.\n\nThey've had 10 years. 10 bloody years, TEN to improve the simulation but they don't care about making the game better for us they just want to sell DLC after DLC.\nThere's over 250€ worth of DLC for the game and they have hundreds of employees so this is not a small, poor indie dev team that simply doesn't have the manpower or can't afford to hire more staff or didn't have the time.\nThey had the time, they have the manpower but why would they improve the game when there's an army ready to buy every DLC they release and not question anything they do?\n\nCan't say i blame them for their approach but i'm done supporting them.\n\nThey can't fix the traffic, fix the AI, fix the stupid damage model where trucks turn off because of damaged wheels, improve the driving model, etc etc... why would i bother listing everything when they're not gonna fix it?\nThey refuse to add a single new feature into the game.\nInstead they have modders working for them for free addressing these issues. Free labour so they can make even more money. Nice.\n\nScrew you SCS.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Why is there no way to decrease the mouse sensitivity in the settings? After a web search, I found that I could change a config file to decrease it for the in-game camera, but that still doesn't help me in the menus, where the mouse is too sensitive. This was annoying enough for me to not pick up the rest of the DLC after trying out the base game. I don't want to find out what other base expectations are not present.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "physics are horrendous, game tries to crash every 45 seconds and makes you constantly crash your truck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game but they just remade ALL the company logos with lazy minimalist corpo-slop made of 3 shapes at most, with NO way to go back. This by itself is minor, but they also decided the only logo that doesn't get a remake and just doesn't exist in game anymore was the only one that represented native americans.\n\nDon't support the erasure of native american culture. This is Land O' Lakes all over again, you are removing the natives and keeping the land, making yourselves look more racist than the social justice warriors (that don't even own the game) who complained for you to remove it in the first place.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maps suck, not towns and when there is one its bland and tiny. No different road sounds, all boring. All highway, which gets old. I love driving but there are better games. I do not recommend this game to anyone. Go play ets2 where they put in some effort. They don't even add trucks to these games anymore. They just keep coming out with new, old boring maps and states. so much so they moved to Canada. These devs suck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I play ETS 2, and tried this one too. First of all the mirror placement is really awkward, you are forced to use a high FOV just to see the mirror without being forced to stay with the hand on the mouse all the time, that is not the case in ETS 2. The rest is pretty much the same. I would recommend this game but I can't. USA does not have only 3 States. FFS, you need to buy every state witch makes this game cost over 500 euros to get all the DLC's, if you include all USA, witch by the way, still isn't included, WTF!? The engine is outdated, with no collision damage physics, and it's pushed to the maximum, it's a 2016 game and you have the audacity to ask for so much money!? You guys have no respect for your customers. Buying this, it's like buying a 20 euro Demo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "absolute dog wont load nothing works never playing this ever again fix the ah game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to like it but the Trucks being huge albeit realistic poses a bit of a challenge combined with much bigger trailers make some missions too hard unless you have experience driving big rigs your self.\r\n\r\nPersonally I'm sticking with ETS 2 + You get 2 states and 1 free, the rest you have to pay which is typical 2025 devs at this point",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I honked at random cars for 5 hours straight. then i hit a family of 4 and their dog. eventually I couldnt take it anymore and tried to drift and flew off a bridge...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it keeps crushing while playing the game pls fix the issue",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After update 1.51 i don't wanna play this sh!t anymore, controller settings fuсkеd up, and it's not fixable, i tried remap my old settings, game just ignores this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Made me register to play online. Did. Wouldn't send verification email because I have an outlook email. Installed to play with a friend and the need to route me into their ecosystem completely got in the way of that. \n\nGreat game. Don't make me make an additional account, especially if you have a boofed system that doesn't even let me do it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hey yall this game is so poop bro like my freind cuts me off and i get hit stick by a derek henry aka a big ass white \ntruck white  like tell me how i have more jiggle effects than ice spice bro pleases fix this i have a clip just contact me if you want this. and dont get me started on the music bro i was born in 2010 i am listening to got damn anime shi bro",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is crashing  can fix it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buh I got gifted this game they forced me to accept it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i havent play the game yet and its done",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it doesnt work!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "to mini to list",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gAME SUCKD DIH",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No thanks!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "le jeux fais que crash calisssssssssssssssssssssssssss",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "is bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Firstly I want to say that this job is the reason I became a truck driver.  I fell in love with the idea of this career because of this game.  Anyone considering the career could start with this game before researching the industry further and deciding if its for them. \n\nThat being said... This game is almost 10 years old and only 18 states are available.  As far as I can tell, all but three are still paid DLC.  That's fucking ridiculous.  My issue isn't that all 50, or even the contiguous 48 aren't available yet.  This team puts in a stupid amount of work and detail into these releases.  My problem is they still charge for DLC that came out in 2016.  SCS needs to start including older states in the base game as new states are released.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Would I recommend this game to other players? It really depends on what you're looking for and (!) how many money you want to spent. I love the game, but there are some reasons why I rather would say No than Go, and I chose to pull the \"No\" unfortunately despite being a great game.\n\nI got used to ATS as a long time ETS2 player and ATS has some benefits in comparison to ETS2, but it also has some huge downsides.\n\nLet's start with the advantages.\n\n1.) Although the map scale is actually a tad smaller than ETS2 (ETS2: 1:19 - ATS: 1:20) if often feels bigger and more realistic than ETS2 because of the larger size of the countryside and increased distance between bigger cities in real life. That's a big pro for me.\n\n2.) The game mechanics as a whole are equal to the ones in ETS2. Menus, Settings, 99% of the gameplay mechanics are identical. Yet, it is complete different experience to ETS2, because of the american topography, terrain, infrastructure, traffic rules, vehicles, etc. A big advantage of the american traffic system is that you can turn right on a red light. However, I feel that this is evened out by needing to wait for left turns longer at the intersections and their used system.\n\n3.) Another advantage is that ATS offers (currently) a more immersive gameplay. You have the weigh stations, which you have to go to if your truck and trailer exceed a certain value, and the most times you do jobs you have to go to them. In ETS2, weigh and customs stations of that kind are optional if they offer any gameplay at all and are just a visual aspect.\n\n4.) The trucks are so cool. A lot cooler than the ones in ETS2 with the big nose and the huge room in the back. But they also have disadvantages to the increased size up front and behind you. It's a lot more difficult to park and do driving manoveurs than in ETS2. With the big nose in front, you don't have as much space to park and vision to see on the roads. Also the big cabin sleep room (which is optional and not given for the Day Cab versions of the trucks, which by the way have window to the back which is very cool), can be a problem. And the trailers can be larger than the ones in europe as well. So parking and driving requires more effort and is more challenging than in ETS2.\n\nNow let's come to the downsides in comparison to ETS2.\n\n5.) The base map that comes free with the game just consists of California, Nevada and Arizona. For every other state of the US (doesn't matter how small), you need to pay full price for. While I personally think it's absolutely okay to charge for extra maps, I'm not so okay with the DLC policy of SCS Software for ATS like I do and highly appreciate for ETS2.\n\nFirst of all, the base map is not as versatile as the one for ETS2. To 90% it covers desert zones only, which indeed displays a very important character of america but for anyone who wants to drive in more cooler climate zones, you have to pay for some extra map DLCs.  \n\nAnother aspect is that SCS Software decided to start in California (West) and then slowly progress to the east over the years. While 99% of ATS players are okay with that, I'm not. I think it's very bad that they decided to avoid the east coast of america in the past, present and the foreseeable future and rather focus on the midlands and now even British Colombia. New York, Florida and any other east coast states or areas (including canadian Toronto, Ottawa, Montreal and Quebec regions) will be still a long long long way to go to, which maybe (who knows what will be and happen in a few years) maybe never will come to fruition. This decision was and is wrong in my opinion. Many people come from these states and areas and also would like to have their areas represented in a game called \"American Truck Simulator\", not \"West American Truck Simulator\".\n\nSCS did it very differently with ETS2, as they chose the free base map to consist of the map part of most popularity and importance for the main market to come first. And then build any additional areas from inside out. \n\nWith these facts, I feel that ATS is unfortunately moreover in a category of being a cash grab, which other developers do and actually was the thing I liked so much on SCS Software in regard to ETS2. Every ETS2 DLC is reasonably and fair priced (even often undervalued for the maps offered if you ask me). I'm a bit disappointed by SCS Software, that they apparently did not chose the same way for ATS and push hands out for full price money even for the tiniest states. If you ask for full price on biggies like Texas and British Columbia with huge size and road network. No problem. I'm gladly willing to pay more for more effort. But not if you decide to charge for the smallest pieces of road networks in an equal way. SCS easily could have bundled 2 or 3 states together and then sell them in an equal way they did and do for SCS. But no they didn't.\n\nMy assumption is that due to mistakes in planning the location and amount of the free base map and the DLC strategy heading from the base map slowly to the north and east, it requires them to have and keep this business model because ATS has not nearly the same amount of players as ETS2 does. \n\nBut it all depends on how the developers decide to build their game and continue to go forward with it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Well, game isn't bad, but:\r\n- stay away from heavy and special cargo DLC's - there's no suitable trucks for that. Hauls up to ~ 60k lbs are more, or less, but higher - ouch... 4 example - MACK in-game model have just 505 HP max, despite having 600+ IRL long ago, not to ment \"Titan\" series, introduced 1995. ...\r\n- AI drivers developers probably never ever have seen or drived real Truck, those unexpected lane \"jumps\" right before you on way lover speed are simply terrible, IRL such actions ends just one way - destroyed car, counting in mass and inertia of a Truck...\r\n- if you would like to play - disable \"road accidents\" and next option - \"detours\" ASAP. IRL first, police have to do, is open way for use, in game - it's just a trap, often - close to the point of destination. In most cases you have enough time and fuel for detour, but it steals your time...\r\n- but most annoying are those countless \"weight stations\" in the middle of nowhere, often - right before hills... As soon as you raise speed - ups, another one, not far away from previous, sometimes even in the middle of hills serpentine... Feels like developers messed runaway truck ramps with weight stations. Guys, it's 21-st century outside, cameras and software are able to detect truck registration numbers and all that stuff, and yes - there's Internet to exchange data between stations... Or is it a prob in USA? xD\r\nBut, in general, as mentioned before - game isn't that bad... :-)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its 2025 and this game has no native way to display on anything but your primary monitor without changing system settings or messing around with configs.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}