{
  "positive": [
    {
      "review": "Had a customer steal items from my store, beat the shit out of them 10/10 game",
      "voted_up": true,
      "votes_helpful": 81
    },
    {
      "review": "MY WORKERS NEED TO HURRY THE FUCK UP! I SWEAR TO FUCKING GOD IF THEYY DONT HURRY THEIR BITCHASSES UP IM GOING TO KILL THEM!!!!! Great game",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "Very chill and relaxing. Way better than the other Supermarket sim game with a similar style. the active updates are pretty good and sensible, promising more stuff that the player should be engaged with rather than being just an ordering mule. \n\nControls are simple, cosmetics funny, there's hubs for the price gun's automation, and plenty of tools to get everything handled. the hired workers currently don't need a copy of the tools to function, but I suspect that'll be an option down the line. \n\nIt's really satisfying to understand and sort your own shelves, of which products do fine on the half shelves rather than the big full shelves.\n\nThe only nitpick I'd have is for the blue trays to stack items like they do on the shelves, it's kind of tedious to shuffle 300 boxes of toothpaste without having to just run and buy an empty box. The NPCs also ignore the product on the trays, so it can be tricky to empty them. But on the other hand that's just idiot tax. haha",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Relaxing to play with friends, the game is a really good to play with friends",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Fun co-op game, Definitely play it with your friends, you’ll be laughing non stop for 2–3 hours.\n5.5/10",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Sit back and Chill out\n\n-add some nice musics to this game please",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is amazing, better with friends and family members, great that this game is free that makes it much more attractive, funny game to play with people, very hard and boring game to play alone. Highly recommend !",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great game with regular updates! Running the store is very satisfying and playing with friends is so much fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For being a Free Game, this is quite extensive and detailed.  Some might find that the game gets quite grindy towards the end, but I would consider it reasonable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a really fun experience to play with friends, Building your store and dividing tasks among friends and employees is a great time, and best of all... ITS FREE, as opposed to supermarket simulator, which sports a 20$ price tag, has no multiplayer and plays and acts virtually the same as this game. It's a clear choice which game is the better value.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is just fun and made with much love, call your friends and build an empire :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game, especially for being free. At first glance it maybe doesn't look quite as polished as some other supermarket sim options out there but I have found it to be my absolute favorite by far. Lots of features, customization and cosmetics, plenty of goofy nonsense and the ability to play with friends all make it a winner. As of this moment it is still being supported and updated which is very cool and appreciated. I had no problem spending the extra few dollars for The Cool Pack even though the cosmetics are the part I'm least interested in. With the hours I've spent enjoying the game it was an easy $5 to spend.\n\nSmacking the snot out of shoplifters is hilarious but don't forget to try smacking your friends around a bit too",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "there is no need to get supermarket simulator. This is free and very well supported. Fun with friends, a bit of a challenge solo, but definitely a good game with a good dev.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Supermarket Together feels like the kind of game you launch expecting a quick, harmless session and suddenly realize you’ve been laughing, yelling, and sprinting through aisles for an hour. The charm is in the simplicity: a small store, a growing list of tasks, and the inevitable chaos that unfolds when you and your friends try to act like responsible employees. It’s fast, goofy, surprisingly satisfying, and the perfect type of co-op experience where even failure feels like part of the fun. If you enjoy lighthearted teamwork with just enough pressure to keep you on your toes, this one delivers exactly what it promises.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "For being a free game it is fun. A little challenging but it does show how to actually run a store money and prices. Super fun game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Played this for almost 3 days in a row now and have been having dreams about my supermarket. I love this game! Just throw some lo-fi music on in the background and chill.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy playing this Game so much!\nMany different Products, can play with Friends or alone and have a lof of fun with creating your own Supermarket.\n\nDLC was bought too, to support the Devs and because it has nice extras.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "To start, this is, so far, one of the best free games I’ve been able to play. It’s true that it’s entertaining, but for some, it might get a bit repetitive—unless you really enjoy simulators. I’d also add that it’s much more fun to play with friends, and the achievements aren’t too difficult to get. There are a few that take a bit more time to unlock, and others are cumulative, but I don’t think it’ll be too hard if you’re an achievement hunter. Oh, and the lost cat is on the 2nd or 3rd floor of the building next to the store, in one of the windows facing the main street. Enjoy the game as much as I have—or even more!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Tonnes of fun, especially with a friend. And it's free. What are you waiting for? Give it a go.\n\nBeating the customers with a broom, whether they're thieves or not, is very cathartic.\n\nAlso, the Cool Pack really is cool.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun to play with friends. Randoms will join too if you want. \n\nSeems really overwhelming at first but after day one is over and you learn some basics its only laughs and fun from there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love shop simulators so it was very fun to me. I was playing solo and i didn’t notice my shop was open world, some guy came spent all my money and made a huge pile of boxes so yeah i didn’t play it since.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is pure, hilarious chaos. Controlling a car where one person steers and the other handles the gas and brakes is a recipe for disaster—the good kind! It's super fast-paced, ridiculously frustrating, and genuinely fun with friends. You will yell, you will laugh, and you will crash a lot.\n\nWarning: Will test the strength of your friendships.\n\nVerdict: Essential party game for local multiplayer nights.\n\nDefinitely worth the screaming match!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very chill and love the frequent updates. This game continues to draw me back in as a late night chill vibe game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have plugged so many hours into this game and will always return to it when I fancy stocking shelves or working the tills. This is an excellent little free game that the developer continues to improve. I haven't tried the multiplayer aspect of this yet. But if you fancy a supermarket simulator I definitely recommend this one!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game given its free and multiplayer and not pay to win",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game and i play it with my father on daily basis. I learned math faster then in school :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay, this game is way more entertaining than it has any right to be. Grab a few friends and try to shop together—it’s pure mayhem trying to find items while bumping into each other with the carts. Definitely a goofy, relaxing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for people with ADHD! \n\nAlso, despite being an amazing free-to-play game, the devs are far from death.\nThey continue to put out updates, new content, and seasonal events; just a lot of love to this game. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I. Love. This. Game!! Supermarket Together is my favorite game to play with friends, and it gives a very authentic and fun experience! It can be silly, it can be serious, it can be seriously silly. This game is something that I regularly clock into and fully immerse myself into the owner side of owning and operating a business. The shop expansions, in-game perks, and achievements allow the game to have longevity that will keep me playing for hours to come! In addition, the team is actively working on the game and providing great improvements time after time. Overall, would recommend to anyone, especially seeing as it is a FREE GAME!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Best grocery store simulator on the market and it's for free? Yes please. It is addicting and even better with a close knit crew. Not ghosted by the devs like many games you have to pay for, fun events (Halloween event was a blast.) Thanks devs, we appreciate you. 11 out 10; even with our current game maxed out, we have plans for other runs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For being free this game is super fun and its really cool and awesome to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely life changing game, helped me come out as gay to my parents and helped my sex life perfectly. This game actually made me a wonderful person and helped me through hard and challenging times. thank you to the producers of the game and thanks for helping me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderfull to abuse my stealing costumers, and anyone else for that matter to. They probably deserved it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a good game, you can recommend it for fun with your friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute and chaotic co-op experience. Feels like Overcooked in a grocery store. Fun with friends, dull solo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Upside I'm addicted to it, downside- I'm addicted to it lmao. So far, just playing solo, but thinking about the multiplayer aspect. May go on their Discord to find a group or something.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive little game, that reminds me a lot of my old retail jobs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice cozy game esp if you've worked in an actual grocery store",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "chaotic and so much fun to play especially with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its actually pretty nice, its free and the devs keep on updating and working on it. I like the game but I overall prefer playing it with friends as its more fun for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I come home from my job at the grocery store to then play virtual grocery store. At least in this I can beat up both my co-workers and customers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun game to play with friends or by yourself. i cant wait to see what else gets added into the game. i love decorating my store with plants. Id love to see more products in pets like bird food, puppy pads, and cat litter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very fun, entertaining, and well made for a simulator game :) I love lots of little things about it, and the overall game play. The only thing I would probably suggest is more information about the items, what they are, how to use them, and something to hold smaller items :) I have some things for sale in my store that even on a half shelf it still holds almost 200 items, when they come in like boxes of 20-50 lol. For the longest time in the game I had NO idea what the blue trays were for as an example. It is a really good game though, it keeps my ADHD happy for HOURS at a time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Supermarket together is a fun casual game to play with your friends when you have no idea what to do. It's quick to install, and you can just play it with your friends for a short time, and you can just uninstall it anytime if you won't be playing it anymore. \r\n\r\nIts simple gameplay mechanics and straightforward end goal doesn't pressure you in any way, shape, or form. The freedom you have with some mechanics makes it a very fun game to play short-term and I highly recommend playing this with at least more than 3 people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "F2P with friends, fun, engaging, replayable and goofy.\nAlso you can beat the s*** out of the customers. \nI guess, the customer it's not always right heh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the perfect game if you want to just chill and manage a store. Alone? Great. With friends? Even better. There are a lot of things and systems that come into play to keep you engaged, and the dev keeps bringing updates regularly. Also, the game is free, which makes it even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it! but please have more items. I have unlocked almost everything but the shelves and spare is more than the items available",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun. Can spend hours playing. Best played with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun with a good group of friends. Much more depth to the game than I expected for a free game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was a game I was expecting to be just another, play for a couple of hours and never think about again.\nBut, with all the updates and the itch it scratches with ordering and keeping supplies going, we kept finding ourselves constantly going back to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came back after several months of release and it's SO much better now. More on par with regular supermarket simulator. Really needs to save my hotkeys after reopening it tho, its very annoying to price items.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great mutliplayer game to chill, laught and have fun with friends. We just LOVE it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is super great! Im having so much fun doing things I could be doing in real life but in a video game. Instead of working an actual job play this game for free or $4.99.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "disgustingly addicting. I have a problem. Literally have had it for 3 days and have slaved away as if this was a full time job",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game to play with friends with a lot of interesting features and the developing team is updating constantly to give us almost every week new feature of QOL, events and development.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun game to play with friends, complete with grinding elements and progression.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, hard to unfocus, hard to learn some of the actions but otherwise easy to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly a labor of love 🩷🩷🩷\nThe devs update very frequently and the game keeps getting better!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've gotten to the point where I don't really need to play the game anymore besides organizing my storage.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly this game is more fun than you think. Playing with friends and talking about random stuff is a vibe for some reason. It's literally just running and building up a supermarket, nothing else to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes the best! XD Very entertaining, engaging, time-consuming, and fun to play. Picks the brain.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game you get to beat the crap out of customers and buying 200 chairs making your employess happy.\n\nIt's a calm experience that's fun to play while chating with your friends, all though some of the people that I've played with felt the game took to much time to invest to sit down and play aswell as being \"eventful\" so to each of their own. \n\nI enjoyed playing it, but with out friends that are willing to play I don't think it will be so enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game overall, haven't come far with my playtime, but watching others and just reading the changelogs makes it clear this game is loved by the devs, update activity, constant improvement and a really fun *FREE* game to boot up and play with some friends. \n\nJob well done, hope to see even more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No form of digital entertainment has quite encapsulated my attention like this one. Supermarket Together has some semblance of a challenge to it. Its realistic structure forsakes all fictional quests. This made me stay playing until the sun rose. The cleanliness of the aisles and the sheer CQD of constantly changing and updating my shelves kept my psyche in check. A battle or challenge, as stated before, is the cognitive effort of trying not to buy more storage to make the market prettier — a force so strong that I have barely played the actual game, instead relying purely on aesthetics.\r\n\r\nSupermarket Together is no game, but instead a mental journey — one where you must find the true meaning of what it takes to be a store manager. The organisational skills that are developed are truly experiential, and the act of stocking shelves has even led me to begin my own shop in real life. I manage everything as if I were still in the store itself.\r\n\r\nSixteen straight hours has been nowhere near enough time for my abilities to surpass the fourth dimension, but with practice, one can hope. The dark magic this game holds is quite malevolent. Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grate game so far, Looking forward to more updates and items to be added to the game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game made me say the n word so many times because jamal keeps stealing my goods from my store i will go to O-Block and fan out that neighborhood with the swich and proceed to dis king von.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a fun game. but with one or more people it is even more fun an enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just voted it for Steams \"Labor of Love\" award\n\nThe updates keeps amazing me, the events are better than AAA titles. And all of this for free. \n\n\nDeadDevsTellNoLies WE SALUTE YOU!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Realy fun game for friends. Was hard for us in the begining but at the end we figured it out and actualy enjoyed the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Supermarket Together is a really fun and charming game that’s easy to enjoy whether you’re playing solo or with friends. The quirky tasks and cooperative chaos make every session entertaining. I’m definitely looking forward to more cool updates there’s a lot of potential for even more hilarious and creative content in future patches!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a pretty fun game to play with friends, despite the lower quality graphics. just beware that it can be rather glitchy sometimes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s a really great game, and it’s admirable that the developer has been working on it alone for such a long time, paying attention to players’ feedback and ideas. Even today, it remains a very chill and high-quality game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dawg its good but very repetitive over time of you playing it, but overall its really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fantastic, free-to-play co-op supermarket simulator for friends!\r\nThe gameplay is a mix of satisfying stocking, careful pricing, and hectic checkout management.\r\nThe chaos really starts when you chase shoplifters or just start a broom fight with your teammates.\r\nProgression is satisfying early on, but gameplay can get repetitive for larger groups later.\r\nOverall, a Very Positive experience and an easy download for group fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is interesting and funny if you play with your friends, this is really funny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IDK why this amazing game is free, it should be pay, but thanks to the developer god bless you :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill and fun for a laid back game. If you like simulator games this is a cool one to try out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hell yeah, game is super addicting. I recommend difficulty three, and make sure you know the game basics and do NOT skip the tutorial or you will be confused as hell.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is fun to play with friends, though frustrating when the customers get stuck. Upgrades cost a lot but if you plan ahead and coordinate it's not too bad. Overall would recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well fleshed out and very fun, worth 10$ but its free, yes, F, R, E, E.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun game. I've played this for hours. Make sure you close your lobby though, or you may be griefed. lol. One of my favorite free small games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7.9/10\nAWESOME game, once it finally loads... launching the game is quick, but you cannot say the same for loading in to a save.\nloading into a save, and joining a save both take forever, but honestly its worth it.\ni come from a time of extremely slow internet and load times, so i can be patient for a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When i first saw this game i wasn't sure if it would be enjoyable for a long period of time but i was so very wrong! I have been playing this with my husband and we have so much fun playing that we don't realize how much time has passed when playing.  The dedication to updates and the thought put into them makes this game amazing and the fact that its free is shocking to me because it plays better than alot of 60 dollar games.  Thank you to the team that made this!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill game to play with friends, there is not much depth to it - but its still fun to manage your own store",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, love it and its a free version of the paid one but this one much better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Supermarket Together is the most addictive game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun chill game especially with friends , it is a bit of a grind but this game is worth your time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is great and good for mulitplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game with lots of free content and tons of laughs.  Highly recommended!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible amount of content and it's frequently updated. buy the cool pack, the devs deserve every cent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a nice game to play with friends. They keep updating the game and add new stuff so you can play longer but when your store is maxed out it starts to get a bit boring",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thought this would be a calm little grocery game.\nNext thing I know I’m screaming at my friend because he put tomatoes in the cereal aisle.\n10/10 would lose friendships again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty fun game to play with your friends and developers still add new features and fix problems .\nHighly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "UNBELIEVABLY fun for a free(!!) game, especially in multiplayer. I love resource management! And I love getting off work and coming home to boot up my little fake job. So relaxing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome! I havent figured out the multiplayer aspect just yet but even without it, the game is awesome!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not enough good things can be said about this game. I've been captivated since it first came out, it's extremely fun especially if you're playing with friends, even though it's pretty silly. \nThe devs honestly care about their project and they keep delivering updates regularly even though it's a free game. \nI definitely recommend you try it and also buy the cool support pack, because they are worth it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive and relaxing. Better than some of the paid versions out there. Now if only the devs would add a Store vs store mode so we could have some friendly competition, this would be nigh on perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you can beat the crap out of costumers, staff and friends - 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game to play with friends and not so fun to play alone and grind achievements. If you have friends or you don't care about achievements this game is must have. No bugs, fun gameplay and hitting your customers. Enjoyment 10/10!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so good. Over the course of the game's exisitence, they have updated so much and listened to their users and changed things overtime to be better and more fun. I've watched a friend play on his own with no issues, I've gotten to play with a bunch of friends with no issues. It's the best Supermarket sim out there. For a free game, it's amazing.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Me and my friend didnt really enjoy this game. its rather silly however it was lowkey bunz after 10 minutes the controls are really odd to work. emotes werent working and i loved beating people",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "my laptop isn't gamming but it runs hard games like, call of duty. But in this game it crashes out, idk why, I hope you guys fix that problem cause it kinda fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game was lowkey buns after 10 minutes, but i like the feature of beating your co-op teammates with brooms. I thought that was funny, though the emote button didn't work. I didn't try hard enough I guess, maybe. Uhm, the purchase amount was lowkey cray cray and the skill tree is very long. I don't like it much, maybe I'll pick it back up in the future. Who knows. At least I didn't spend any money on this game, though for being a free game I'll admit it has a lot variety and gameplay. If you're too poor to afford supermarket simulator, this is definitely a good alternative though not the best. Also, make sure you give the customers the right amount in change or else you'll lose money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game used to work. Now it crashes my entire computer whenever loading a world.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cannot even make or join a store, have tried several different times, and keeps getting stuck on loading screen forever, all of my hours in this game are from trying to just load in",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not optimized for single player, and the Loaning system is really messed up, and start up money is even worse, I think it would be good if you had someone to play with, but there is hardly anyone that plays this. I want to like it but the way it is right now is just not enjoyable at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feature creep, and with it, lack of optimization, has made this game nearly impossible to play with my friends; a game like this shouldn't take up as memory as it does.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "my laptop isn't gamming but it runs hard games like, call of duty. But in this game it crashes out, idk why, I hope you guys fix that problem cause it kinda fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Me and my friend didnt really enjoy this game. its rather silly however it was lowkey bunz after 10 minutes the controls are really odd to work. emotes werent working and i loved beating people",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game looks so depressing. Basically looks like new york if it was in england. And its just so mundane and tedious. The tutorial has more reading than a 500 word college grade essay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I BOUGHT \"THE COOL PACK\" BUT NO ONE CAN SEE THE VIDEOS I PLAY ON THE TV/COMPUTER!! PLEASE FIX THIS MAKE IT SO OTHERS CAN SEE IT TOO!! But, make it be able to sync with other players or not so we could all watch the same thing or our own stuff",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game was lowkey buns after 10 minutes, but i like the feature of beating your co-op teammates with brooms. I thought that was funny, though the emote button didn't work. I didn't try hard enough I guess, maybe. Uhm, the purchase amount was lowkey cray cray and the skill tree is very long. I don't like it much, maybe I'll pick it back up in the future. Who knows. At least I didn't spend any money on this game, though for being a free game I'll admit it has a lot variety and gameplay. If you're too poor to afford supermarket simulator, this is definitely a good alternative though not the best. Also, make sure you give the customers the right amount in change or else you'll lose money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Grocery store simulator is better and easier game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The shop upgrades feel overly restrictive and don't provide a satisfying sense of growth. Ultimately, after a certain point, the game fails to provide a compelling goal, leaving you with a distinct lack of purpose.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "your updates have made the game even more annoying then it already was and to join a friend is just to stupid to do cant even figure it out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gaidys kažkoks draugelis įkalbėjo sakė bus įdomu.... hujnia yra, PANOM tik ir žaist šitą gaidy.....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is quite fun and stuff, but it always crashes like 5 times before i get to load up my save. i hate this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Load screen shouldn't take over 2 minutes and music/beeping in the background is annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game ought to be illegal. I have PTSD from being a slave, erm, worker at a major company that starts in A and ends in -zon. The RF scanner immediately gave me a horrible flashback. This game is basically grooming for future slaves, erm, employees.\n\nAt the very least, players should be paid to \"play\" this game, because it is work not play.\n\nThe only ethical use of this game might be to try and scare bad students into getting better grades so that they will be able to get decent jobs in their future.\n\nIf I could give this game negative stars, I would give it negative stars.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "id rather sit and fiddle my nutsack for 3 hours straight than play this game again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Incredibly unbalanced, keeping shelves stocked is a nightmare.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only good thing about this game is making the sign the funniest thing ever",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Friend had me play then kicked me, never playing again, this sucks, go play A Few Quick Matches",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so ass, it sucks. Dont download it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got hacked super quick, hella hackers don't recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty boring game in my experience",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dONT DOWNLOAD.. GAME DOESNT EVEN LOAD UP AFTER NAMING YOUR STORE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This shit ass soooo long and bad nothin on tim",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "madarchod game h timewaste bc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Keeps crashing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if yall want the wish.com version of supermarket simulator, then this is ur game for sure",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "these games are made in a factory i swear man",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "piece of shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "OKKOKKOKK",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "soooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooboring, repetive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my laptop isn't gamming but it runs hard games like, call of duty. But in this game it crashes out, idk why, I hope you guys fix that problem cause it kinda fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "haven't played in quite some while so i was excited to get back in with all the updates. not sure what changed but having no controller support, and it being buggy at best, is leaving me to 'not recommend' this game. not everyone plays games with mnk, and as a disabled gamer, controller is much more accessible for me and many others. i really hope the devs decide to do official controller support for this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cannot even make or join a store, have tried several different times, and keeps getting stuck on loading screen forever, all of my hours in this game are from trying to just load in",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Feature creep, and with it, lack of optimization, has made this game nearly impossible to play with my friends; a game like this shouldn't take up as memory as it does.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game used to work. Now it crashes my entire computer whenever loading a world.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not optimized for single player, and the Loaning system is really messed up, and start up money is even worse, I think it would be good if you had someone to play with, but there is hardly anyone that plays this. I want to like it but the way it is right now is just not enjoyable at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The shop upgrades feel overly restrictive and don't provide a satisfying sense of growth. Ultimately, after a certain point, the game fails to provide a compelling goal, leaving you with a distinct lack of purpose.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't want to be too harsh since its free.. but the UI isn't very intuitive and seems like using the keypad when checking out only sometimes works.\n\nAlso I know it isn't realistic but I downloaded this because I saw a review that you don't pay bills/employees, but that isn't the case.  I'm just trying to find a sim game that's as relaxed as possible, and no bills would be nice.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "J'ai fait 26 min de jeu et ces 26 ce sont passer sur les chargements, je ne peux rien et le jeux se ferme tout seul, j'ai le processeur, la cartes graphiques la ram qu'il faut, et nn, rien à faire, ça ne marche pas",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "your updates have made the game even more annoying then it already was and to join a friend is just to stupid to do cant even figure it out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gaidys kažkoks draugelis įkalbėjo sakė bus įdomu.... hujnia yra, PANOM tik ir žaist šitą gaidy.....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game made me hate the gaming on pc .. not gonna lie \n\nwhy this game checking whats on my pc .. and why it taking a lot of CPU .. and why is not on console ? i think yall know the answer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is quite fun and stuff, but it always crashes like 5 times before i get to load up my save. i hate this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Load screen shouldn't take over 2 minutes and music/beeping in the background is annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game ought to be illegal. I have PTSD from being a slave, erm, worker at a major company that starts in A and ends in -zon. The RF scanner immediately gave me a horrible flashback. This game is basically grooming for future slaves, erm, employees.\n\nAt the very least, players should be paid to \"play\" this game, because it is work not play.\n\nThe only ethical use of this game might be to try and scare bad students into getting better grades so that they will be able to get decent jobs in their future.\n\nIf I could give this game negative stars, I would give it negative stars.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "id rather sit and fiddle my nutsack for 3 hours straight than play this game again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its terrible. it keeps saying its not loading. I  would NOT recomend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly unbalanced, keeping shelves stocked is a nightmare.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "autosave function doesn't work and the \"save and quit' doesn't actually save the only real save is when you start a new day and press continue",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not really a fun game, had issues trying to get into a game in the first place with a friend and ended up just making the game public, and then actually playing it, just didn't have fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Enjoy the game however the bug in the join game section is annoying. Makes joining a friends game not easy to do if at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only good thing about this game is making the sign the funniest thing ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Friend had me play then kicked me, never playing again, this sucks, go play A Few Quick Matches",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boxes on ground dont save lost lots of money because of this hope the devs will fix this issue",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Abysmal performance, unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got hacked super quick, hella hackers don't recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game gets boring after an hour. Wouldn't recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty boring game in my experience",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dONT DOWNLOAD.. GAME DOESNT EVEN LOAD UP AFTER NAMING YOUR STORE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is trash is supermarket simulator from temu. Real life better get a job :):):):):):)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This shit ass soooo long and bad nothin on tim",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "madarchod game h timewaste bc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not fun, the only thing I liked about this game was putting my friend in prison",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Keeps crashing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if yall want the wish.com version of supermarket simulator, then this is ur game for sure",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "these games are made in a factory i swear man",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "piece of shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "OKKOKKOKK",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "soooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooboring, repetive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "haven't played in quite some while so i was excited to get back in with all the updates. not sure what changed but having no controller support, and it being buggy at best, is leaving me to 'not recommend' this game. not everyone plays games with mnk, and as a disabled gamer, controller is much more accessible for me and many others. i really hope the devs decide to do official controller support for this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cannot even make or join a store, have tried several different times, and keeps getting stuck on loading screen forever, all of my hours in this game are from trying to just load in",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not optimized for single player, and the Loaning system is really messed up, and start up money is even worse, I think it would be good if you had someone to play with, but there is hardly anyone that plays this. I want to like it but the way it is right now is just not enjoyable at all.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}