{
  "positive": [
    {
      "review": "This might just be the greatest game of all time. The fast-paced gameplay, the difficulty, the Gunplay, the characters, the story, and oh my god, the soundtrack. This game proves that sometimes, less is more. A game which makes you yearn for a continuation of a story of which you know there can be no more. Underappreciated.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "A perfect sequel to a perfect game, and while it ended on a bittersweet note, the game lives on with its replayability and level editor.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "boot up the game\r\npress new game\r\nfriend tells me theirs a pilot\r\ni do pilot\r\ni grape a teen\r\ni kill for 27 levels",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "so good but holy fuck its so much harder than the first game. The Hawaii missions and that one on the docks especially. Trying to do the game in hard mode currently- which makes the maps upside down and adds like 3 times as many enemies. Trying is the key word there",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "potentially my favourite game of all time with for sure the greatest videogame soundtrack of all time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is so peak. The gameplay feels good, the \"artstyle\" is pretty unique, it has one of the best soundtracks ever, and it's story is also really fire. The only thing that could possibly get in the way is the difficulty, this game is sometimes so unfair or just hard by requiring you to react fast and without doing any mistakes. Even being hard, it was worth every single second spent on this game. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "супер крутая игра но но сложная  сюжет крутой интересный и игра очень затягивает всем советую",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"Don't fix something that ain't broke\" might be the perfect way to describe the problem I have with Hotline Miami 2. I think Dennaton Games ruined the essence of Hotline Miami 2 by trying too hard to make it a better game than the OG, but in doing so, only made it worse by missing what made the OG great, a.k.a. the simplicity. It's not like everything they did with the second game was bad, like polishing the game to a new level, but everything else felt a little bit too complicated, from its story to the level design. As a result, these questionable but well meant choices made Hotline Miami 2 end up as a downgrade to its predecessor.\n\nFinal Verdict:⭐⭐⭐(3/5)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hotline Miami 1+2 are two of my favorite games ever made. The music being one of the biggest draws, and the over the top violence being the other. There were multiple times while playing I said \"holy shit\" from how I either finished a guy off, or from how brutal one of the cut scenes were. Gameplay wise, it's top down, you kill in 1 shot, but you also die in 1 shot. Some levels are brutal, but it's also fairly generous checkpoint wise, so you never lose a ton of progress if you die. I've found the faster and more frantic you can be, the easier of a time you will have. The main difference between this and the first is the level editor, and some people have made some really amazing campaigns with custom music and everything.\r\n\r\nJust an amazing game overall I would recommend to anyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay and story, allthough some of the map layouts couldve used a bit more work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game still after all these years with a surprisingly complex story. Its just sad too see that half the people nowadays who say they are fans of the games haven't even played Hm1 or Hm2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "off the rip, if u are looking into trying out this game, i would recommend grabbing the regular hotline miami first, honestly there is too much to talk about in this game, i think it has a fairly interesting developing story, though the chronological order is a bit messy, hotline miami 2 is a slightly harder sequel compared to the first game i would say, the maps are larger and some areas, enemies are scattered in various places, a bit tricky to get the hang of when i first got to this game after beating the first one, that's why i mentioned on looking into the original game first, everything is possible with a bit of effort, and if you've already played the 1st game or even this one, by now u alr know that you're gonna be dying quite a lot, though i'd say it's part of the fun where u can either go blazing guns rushing into rooms, killing russian mobsters almost in a speedrun style, or sort of taking it more cautiously to just finally be done with a particular chapter, you are rewarded for recklessness and i like that it promotes some action in that regard, i will say that the soundtrack for both games is quite phenomenal, genuine headbangers from the 2nd one especially, i was too zoned in to truly appreciate the soundtracks for what they really were in most moments, though there were cases where i felt i was pretty immersed, after finishing off most mobsters or when i know i'm in the clear or when i would have to search for remaining enemies, sometimes would be getting crazy goosebumps from that kind of music that would be playing in more intense levels, on my first review for hotline miami i don't think i gave it justice as i felt kinda fatigued at the time, but yeah, way back in time when hotline miami was sort of picking up traction, i never gave it justice, never considered it the time of day, but now that i can buy games myself, i'm glad i got to 100% it, was a pretty fun and interesting experience, after some fun i'm interested in seeing what else devolver studios has in store :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is better than most AAA games by far and the gameplay is dih touching\n\nAbsolute masterpiece 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game\r\nwhile funky sometimes it has good mechanics and a great story and characters\r\nhighly recommend if you like emotional rollercoasters and lots of blood",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest stories ever told in a video game; A digital warning of fearmongering and ultranationalism. It's a shame that the presentation makes it such that you need to watch an entire video essay to fully understand the plotline.\n\nGameplay is rage inducing for the first 50 hours or so, and then it gets addictive. Arcade-style gameplay feeds into the addictiveness.\n\nClassic from the mid-2010's and it gets an A+ for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every single character was so cool, especially The Son. Insane ending, did not expect that. Hotline miami 1 was too short but this game is perfect. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite story game ever. Incredible gameplay, amazing lore, and great characters. Plus mods for custom levels? What are you waiting for, just buy this game already.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this game quite a lot. I've played through Hotline Miami 2 on both difficulties multiple times over the years (play hard mode at your own peril). I also used to play a lot of workshop levels and campaigns. As others have already pointed out, Hotline Miami 2: Wrong Number has more refined gameplay mechanics for the most part. It also has considerably larger, more challenging levels than it's predecessor IMO. The story here is definitely done a lot better than in the first game. The OST for this game is also amazing. If you've played the first game but have yet to play this one, I highly recommend that you do. If you haven't played either game but are considering it, get the series bundle when there's a sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the gameplay and the unique art style.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games i have ever played to be honest and if you get bored of the mainn levels there tons of good workshop content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first, I hated this game. Why on earth are there windows everywhere?!?! How on earth was I supposed to predict the enemies off my screen?!?! Why is every character so much weaker than Jacket?!?!\r\nBut the more I played it, the more I enjoyed it. This game is a diamond in the rough. I began to understand the philosophy of the level design, the playstyles of the characters, and the beautiful story. Not only is Hotline Miami 2 a truly worthy and enjoyable challenge, it has a story that has left a deep impact on me, with unique, memorable characters, and the message that violence achieves nothing except to perpetuate itself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's been ten years boss, and there are still few games that have the same punch that this one does. It's only fault is being so much better than hotline miami 1, i struggle to replay that one. So many levels are my favourite. So many songs are my favourite.\n\nYou know how everyone does the same joke of saying that Ultrakill and Guilty Gear are really just Albums that come with free games? This is the GOAT in that regard. It's all peak - every. single. song.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hotline Miami 2: Wrong Number is the brutal conclusion to the Hotline Miami saga, set against a backdrop of escalating violence and retribution over spilled blood in the original game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best investment ive made in my life. its very replayable and not to mention that there is a second mode alongside the editor which allows you to get modded campaigns",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Final entry of the saga—and it makes it very clear that there will no continuation.\r\n\r\nFar more story-focused than its counterpart, explaining and expanding the world, answering many questions posed by its predecessor while perhaps posing even more... which will never have an answer, I'm assuming.\r\n\r\nThe maps are far more open, forcing you to learn where every enemy is, lest you get shot by a guy who's not even onscreen, which I wholeheartedly disagree with. Other than that, it's as addictive and hot as the first entry, and as you're forced into the lives of different characters, different playstyles are mandatory.\r\n\r\nIs it as good as the first? It certainly lives up to the name; the focus in character development is understandable, though, unless it was hidden and I missed it somewhere, there are so many Chekov's guns left unfired, sinking to the bottom after being thrown into a river for no reason.\r\n\r\nIt's so very close—it's nearly there, but it needed one more level or two... or maybe I just didn't get it, or the writers and I have different impressions of what constitutes a masterful story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fucked up as shit and surprisingly eerie. Game makes me mad as fuck but it's sick so it balances it out at least.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice follow-up to the first game. Definitely feels like the difficulty ramps up, this will push your reaction times to the absolute limit to finish the late missions in 'nam and russian night clubs. Put up padding on the walls ahead of time for when you inevitably throw your controller from your 100th death in a row",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7.5/10 same thing as hotline miami 1, good on the fly studying and fast reflexes for a simple yet fun gameplay loop but then flips it on its head and adds more gameplay features, W sound track but cringe story",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Even after 10 years, the game is still awesome, the music never gets boring, the variety of characters always keeps you on your toes so you don't relax, and the hard mode makes it clear that you're far from a pro",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basically the first game but MORE, you get better as you play and its satisfying to clear levels quickly when you used to struggle for 30mins or more\nHard mode...................",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The soundtrack goes so hard. I really like how they added more story to this one, even if it remains ambiguous at times. Very fun. The combat does feel unfair at times though, with enemies shooting you from far away or slightly off hitboxes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good story and good gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely worth it not only is it less buggier than the 1st hotline miami, but there are also more levels,soundtracks, play styles (even if it isn't in the form of a mask at times) and characters sure the difficulty might turn off a lot of people during their 1st time playing the game, but everything else ultimately outweighs the unexpected increase in difficulty and combine all of that with the workshop and you get an almost endless amount of content and things to do even after you beat the game or get all achievements",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AMAZING game , totally cool for people who are used to bloody action games that are skilled",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "most painfull experience of my life trying to get all achivements.\r\nIncredible game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have never played a game better than hotline miami 2 in my entire life and i could tell you for sure this game will change you \r\n\r\nI just never knew this amount of peak could be achieved in a game\r\nEven for its age hotline miami 2 is still better than every single game out there and i am not over exaggerating.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cada paso q doy en este juego es un paso que doy en mi vida\n\ngracias jose por haberme dejado jugar en tu compu cuando tenia 7 años\n\nHOTLINE MIAMI 2: WRONG NUMBER   top 1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is peak. But the levels can  bee soooooooo longggg and excrutiating tho i do love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the mask feature is a great way to make the game more replay and the story is one of the best I've ever seen",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is genuiennly rreally fun like its worth the $12 alot like yeah the soundtrack is great, the story is fun, the levels make me want to curb stomp a small child god i fucking hate hard mode dead ahead BUT LIKE THIS IS SO FUN I LOVE HOTLINE MIAMI SO MUCH also the level editor is pretty cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Along with the first one, these are for sure one of the best games I have ever played in my life.  The instant restart after death mechanic makes this incredibly addictive and you want to keep pushing on, no matter how many times you just died in a row.  My only complaint is that I wish that the camera was zoomed out a bit more so you could see more of the danger around you.  I love how there is a level editor in pt 2 because it really adds a ton of content that shows a ton of creativity from the community... and people are still putting out levels on a regular basis.  I would say check out the first one and if you love it, then definitely get this one as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want to experience kys without actually kys, play this masterpiece. Despite it being a ragebait simulator in some brutal scenes, It's still pretty good, not better than the first one though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is straight up bodaciouss!!!! feels like stepping out of an old vhs collection into the wildest Miami chaoss. This game sweats neon and synth and is so retro fresh feels like your old arcade machine is flirting with you,  It is a non stop action packed radical massacre that feels like you are starring in the wildest Miami  action flick blockbuster never dared to rent out front!!! you storm into each level like some righteous vigilante who ran out of patience smashing goons to rhythm of pure adrenaline. The kind of game you would want to wear fingerless gloves and scream \"Lets boogieeeee!!!!\" Its a retro fuelled slaughter party that reminds you why the 80s would never die.\nIt aint for everyone... its challenging , brutal, unapologetically violent. But thats exactly why its purely iconic. For players who crave intensity, style, and a story that keeps you thinking long after credits roll its a masterpieceeee!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pero que buen juego, lo que lo mantiene vivito es el modo editor y, aún si no lo tuviera, seguiría vivo. Un juego 10/10, explica la trama del juego anterior más detalladamente",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "two words: Absolute True Nature.\ni 100%'d both games in a month.\nbest playable movie ever made :)\ndefinitely one of my top 3 games ever; best OST, gameplay, intensity, emotion, satisfaction and TESTOSTERONE\ni luv you, Dennaton :D\n\n[Hotline Miami 1+2 movie anyone?]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like good. gotta get a grip or something i say as i die for the 600th time on the 5th level.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Publix Deli Buffalo Chicken Tender Sub\r\n\r\nIndulge in our irresistible Publix Buffalo Chicken Tender Sub and experience a revelation of flavors in one amazing sub. What makes it so good? Our famous chicken tenders coated in Buffalo sauce and topped with cheese and vegetables. Making a sub this delicious requires the ingredients Publix is known for.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't get to play this game as much as I used to, but it will forever hold a place in my heart.\n\nHotline Miami forever.\n\nI just wish I could finish the campaigns I started making!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "-Man unhappy\n-Man turns on computer\n-Man breaks baseball bat into gang member\n-Man happy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great characters and story but a bit depressing and dives into dark themes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Waaay more difficult than the first game but pretty enjoyable",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game ever, just really grindy to get all achivements",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "under a haze of ultraviolence is a really good story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good, the editor is easy and cool, 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you liked the first game but it wasnt gruesome enough, this game is perfect for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man, this party stinks. I fucking hate these people.\nЧувак, эта вечеринка отстой. Я, бля, ненавижу этих людей.\nЧувак, гэтая вечарынка адстой. Я, бляха, ненавіджу гэтых людзей\nЧувак, ця вечірка хрінова. Я, блін, ненавиджу цих людей.\nStary, ta impreza jest do dupy. Nie znoszę tych ludzi, kurwa.\nAlter, diese Party ist so scheiße. Ich hasse diese Leute, verdammt noch mal.\nMan, dit feest is zo klote. Ik haat deze mensen, verdomme.\nTío, esta fiesta es una mierda. Odio a esta gente, joder.\nMec, cette soirée est nulle. Je déteste ces gens, putain.\nAmico, questa festa fa schifo. Odio questa gente, cazzo.\nCara, essa festa é um lixo. Odeio essa gente, porra.\nDostum, bu parti berbat. Bu insanlardan nefret ediyorum, lanet olsun\nيا رجل، هالحفلة زبالة. والله أكره هالناس\nおい、このパーティー最悪だよ。マジでこの人たち大嫌い。\n哥们儿，这派对烂透了。我他妈真讨厌这些人。\n야, 이 파티 냄새 나. 나 이 사람들 진짜 짜증 나, 씨발",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "i love the son i love the son i love the son i love the son сын моя любовь сынок сырок i love the son son son son i love him i love the son i love the son love of my life гота гет а грипп one brazillion out of ten hotline miami cured my psychosis",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "guys i got the wrong number i was calling my friend but dialed the conck department 😨😨😨",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolute peak. but i couldnt get a grip and walked off a building sadly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bunch of paid bangers songs wrapped to a free 7/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра супер! Расслабить нервы самое то.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good freaking game uhh play it because its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing story great gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The last time I was truly happy was the day this game came out.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "i cant with these stupid fucking dogs \r\n10/10 would replay again",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just get it, you won't regret it. Play the first game first.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "muder fun but richter levls no fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game for cs players who hates russians",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its hard but fun once you get the hang of it (use mark he's the best)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worse thing about the game is it's the last one in the series .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game if your mindset is not fun = easy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "why tf was first trial harder to A+ than take over and dead ahead",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "seriously one of if not the greatest games i've ever played i 100% reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hotline Miami 2 is absolutely violent and I LOVE IT!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "не шутите с русскими, а то в вашу ебаную страну прилетит пара десятков ядерок based",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If there was a game that would unleash my demons, its this one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yet another perfect synthwave compilation album with a peak videogame as a bonus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dead Ahead is the worst thing ever created by man but everything else is peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "shot 999 people with two machine guns wearing a bear mask then went home and played hotline miami 2 very hard and good game i recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "scene 24 is itching my hairs, fix those god damn dogs near the fountain pls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "no words needed its simply a must to buy when its on a discount (or not)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really hard to play but good game tbh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i got a phone call from some place and wore a snake mask while killing everyone\r\ni then played both hotline miami's",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is really fun till you decide to go achievement hunting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "incredibly frustrating but legendary soundtrack",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man, this party stinks. I fucking hate these people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game of all time with a level editor perfect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super good and f the fat guys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the best game i ever played i recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the adrenaline bump this game gives shouldn't be legal",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "furry discord server vs cs:go players",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "blood for everyone and anyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hard game but cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HM 2 is easy AF tbg. HW 1 was much harder.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect sequel. Hard mode goes hard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "şişmanlardan ve köpeklerden daha fazla nefret etmeye başladım",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game fun asf but to hard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect and fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please update your redactor(is so fucking buggy)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun and kinda hard",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "half the fandom hasn't even played the game and it pisses me off, the game is decent but it costed me my mental sanity to get past most of the levels. And now the game's soundtrack makes me react violently because of how long I've listened to it whilst dying repeatedly",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its just hotline miami but worse. The characters are samey, theres far less mask variety, the music is worse, the game mainly(completely) focuses on gunplay(the worst part of it), its just a far inferior product save some money and just play the first game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "blood dead russians rave 2? But add dead columbians and psycho detective to this mix.\nThe story is more interesting but gameplay is much more boring. Its not even close to the drive from 1 part",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has bugs and you'll waste more time with it. Once you complete the game, the ending has a bug where the dogs get stuck in the textures.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story was great the game was nightmarishly hard and genunely unfun to play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Les contrôles sont juste infernaux.. Surtout le double personnage, une purge, j'ai joué 4h ça me suffit je desinstale",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like previous game, this was not something I found good. Controls seemed better, but a turd with a free peanut in it is still a turd.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love restarting the level because of unfair deaths from enemies off screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is cool but its not like the first one and the lore doesnt make sense u just bounce between like 5 characters every chapter",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Сомнительно но окей.Первая часть лучше во всех механиках,картах и геймплее ,даже графон  во второй части значительно деграднул",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuh naw corey doesnt want to sit on my face 0/10 fuckass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not good game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "oh my god bruh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "норм",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the levels are not fun at all, spent too much time trying to tell myself that i was having fun",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Dead Ahead is the shittest level ever, 0/10, boring, ass plot the first hm was better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its just hotline miami but worse. The characters are samey, theres far less mask variety, the music is worse, the game mainly(completely) focuses on gunplay(the worst part of it), its just a far inferior product save some money and just play the first game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How do you manage to take every single FUCKING aspect of the first game and make it worse, how do you manage to fucking not only make the maps worse but you also make them 10 times larger. NOT ONLY that but 90% of the enemies have guns, instead of being varied in approach and strategy its just strafe corner with gun. On TOP of this they got rid of the fact that your points per kill decreases if you keep doing the same thing so it's clear that they want you to just strafe corners with guns. You can step into a room, kill two people and get shot across the map by some dude with a shotgun because the maps are literally just full of empty corridors with no variation.\n\nI was expecting something fun like the first game, what the fuck is this. This is probably what it feels like to get penetrated in all my holes by those 30 inch bad dragon horse dildos with no lube. I am an hour in for fucks sake",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "half the fandom hasn't even played the game and it pisses me off, the game is decent but it costed me my mental sanity to get past most of the levels. And now the game's soundtrack makes me react violently because of how long I've listened to it whilst dying repeatedly",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a no for me. The game doesn't introduce much new content compared to the previous one. I'd recommend it for following the story (which is great) and enjoying the music, if it weren't for the biggest problem with this game: the terrible level design. Unlike the previous game, this one has much more spacious areas, which is the worst possible idea for a top-down game. I spent most of the time shooting enemies blindly across levels. I really love challenging games, but in this one, the difficulty comes from abundant windows, poorly drawn maps where you can't tell what's in front of you or whether it's an obstacle, enormous spaces, and ridiculously dumb—yet unexpectedly capable—enemies. Play the first part instead.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "One reddit post called Hotline Miami 2 \"the best worst\" (the worst best?) sequel ever made, which I think is a pretty apt description. It’s so much more ambitious and polished, with a number of new cool mechanics, an incredible OST, and a varied campaign that’s 3-4 times as long and climaxes twice, akin to the A/B-sides of old cassette tapes. It absolutely nails the mood of frenetic violence spiraling out of control, and its highlights deserve to be mentioned among the most iconic indie gaming moments, especially Death Wish.\n\nYet at the same time, it fundamentally misses the core of what made the original work in the first place. It feels like the developers got too committed to creating an unapologetic, unfriendly art project, which meshes well with the themes of crime and destruction but no longer translates into a reasonable gaming experience. It almost feels like a puzzle now, with only a couple correct ways to beat a level and an immediate serving of \"press R to restart\" whenever you deviate from those. \n\nThe floors got much bigger and more open, leading to long-distance, gun-based action, yet the base design was never adjusted enough to reflect that (including the oft-criticized situation of getting shot by somebody off-screen). There’s no room for frantic improvisation or spontaneous wins anymore, at least not until you learn the layouts and enemy placements through pure trial and error, and even then it’s subject to unpredictable split-second variations.\n\nTo be fair, a couple of things actually got more consistent compared to the original, like the baiting of enemies or the knockback effect of doors, but it’s still nowhere near enough to feel in control. And if you go for high scores/ranks, it becomes three times as pronounced, since you’ll be forced to rush ahead to maintain the combos instead of being careful, turning the process into blind repetition until memorization skills and/or RNG take mercy on you.\n\nThe story is impressive and memorable once you put it all together, but much less so when you’re still experiencing it, sabotaged by the equally unfriendly and obtuse delivery. If you want to understand wtf is going on here, you need to remember the first game near-perfectly, down to character appearances and specific dates. You’d better jot down every date mentioned here, too, or the constant timeline jumps might get you lost quickly.\n\nAlso, hopefully, you’re really good at processing visual storytelling and taking in the scenes, since the most important clues are often only shown in the background while conversations happen. Oh, and just to confirm, you’re in the right mental state to patiently sit through cutscenes, right? The fast-paced, frantic gameplay didn’t make you agitated and simply itching to get back to action, right?\n\nAlternatively, you can just play it once, look up the explanations, then play through it again to appreciate the author’s intent, which is probably what the majority of the fans ended up doing. It really is a convincing, sprawling tale about the endless cycle of violence and its only logical conclusion, and even though the metacommentary is still very on the nose, the extra scale makes it much more fleshed-out and impactful. Going back to the main screen after the credits to realize what that background imagery means is quite an existential moment. Too bad you have to crawl through hours of frustration to experience it.\n\nThe same could probably be said about all of Hotline Miami 2’s strong points. There’s a thin and subjective line between being challenging and being unfair, but unless you’re fine with hundreds of retries that rarely feel like your fault, this sequel will likely be the latter.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I was really digging this in the beginning but, I got so frustrated the more it went on. The game outstays its welcome. The level design is worse compared to the first game. The soldier sections especially became a massive pain in the *ss. One level in particular is very open and filled with ranged enemies that will shoot you before you can even see them on the edge of your screen. Some of the new enemies like the ones that dodge your bullets and can only be killed by melee and the fat enemies with guns are so f*cking annoying. Music is way more generic. They decided to do more with the story for this game but, eventually it completely lost my interest. It's a shame because I really liked the first game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game takes everything fun about the first game and replaces it with terrible level design and enemies that will shoot you from offscreen.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "everytime i play this game i have the urge to make my review harsher\nwhere do i even start\nhotline miami 1 was a fast paced top down horror game where you play as the monster while still keeping a good amount of natural difficulty\nhotline miami 2 is the ogs cousin from the south who posts his 4 wheeler on tiktok to seem cool\nslow paced walking simulator where you fire a gun wait behind a corner shoot an enemy rinse repeat the entire game\ni haven't even made it to the son levels so maybe it gets better but im like halfway through the game so it is sure taking its sweet time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "imagine your being bent over a desk and being railed by a BBC and when you ask him to stop another big black guy comes out the closet and spitroasts you thats what it feels like to play this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "blood dead russians rave 2? But add dead columbians and psycho detective to this mix.\nThe story is more interesting but gameplay is much more boring. Its not even close to the drive from 1 part",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has bugs and you'll waste more time with it. Once you complete the game, the ending has a bug where the dogs get stuck in the textures.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story was great the game was nightmarishly hard and genunely unfun to play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Les contrôles sont juste infernaux.. Surtout le double personnage, une purge, j'ai joué 4h ça me suffit je desinstale",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like previous game, this was not something I found good. Controls seemed better, but a turd with a free peanut in it is still a turd.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love restarting the level because of unfair deaths from enemies off screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is cool but its not like the first one and the lore doesnt make sense u just bounce between like 5 characters every chapter",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Сомнительно но окей.Первая часть лучше во всех механиках,картах и геймплее ,даже графон  во второй части значительно деграднул",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuh naw corey doesnt want to sit on my face 0/10 fuckass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not good game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "oh my god bruh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "норм",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the levels are not fun at all, spent too much time trying to tell myself that i was having fun",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Dead Ahead is the shittest level ever, 0/10, boring, ass plot the first hm was better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its just hotline miami but worse. The characters are samey, theres far less mask variety, the music is worse, the game mainly(completely) focuses on gunplay(the worst part of it), its just a far inferior product save some money and just play the first game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How do you manage to take every single FUCKING aspect of the first game and make it worse, how do you manage to fucking not only make the maps worse but you also make them 10 times larger. NOT ONLY that but 90% of the enemies have guns, instead of being varied in approach and strategy its just strafe corner with gun. On TOP of this they got rid of the fact that your points per kill decreases if you keep doing the same thing so it's clear that they want you to just strafe corners with guns. You can step into a room, kill two people and get shot across the map by some dude with a shotgun because the maps are literally just full of empty corridors with no variation.\n\nI was expecting something fun like the first game, what the fuck is this. This is probably what it feels like to get penetrated in all my holes by those 30 inch bad dragon horse dildos with no lube. I am an hour in for fucks sake",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "half the fandom hasn't even played the game and it pisses me off, the game is decent but it costed me my mental sanity to get past most of the levels. And now the game's soundtrack makes me react violently because of how long I've listened to it whilst dying repeatedly",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a no for me. The game doesn't introduce much new content compared to the previous one. I'd recommend it for following the story (which is great) and enjoying the music, if it weren't for the biggest problem with this game: the terrible level design. Unlike the previous game, this one has much more spacious areas, which is the worst possible idea for a top-down game. I spent most of the time shooting enemies blindly across levels. I really love challenging games, but in this one, the difficulty comes from abundant windows, poorly drawn maps where you can't tell what's in front of you or whether it's an obstacle, enormous spaces, and ridiculously dumb—yet unexpectedly capable—enemies. Play the first part instead.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "One reddit post called Hotline Miami 2 \"the best worst\" (the worst best?) sequel ever made, which I think is a pretty apt description. It’s so much more ambitious and polished, with a number of new cool mechanics, an incredible OST, and a varied campaign that’s 3-4 times as long and climaxes twice, akin to the A/B-sides of old cassette tapes. It absolutely nails the mood of frenetic violence spiraling out of control, and its highlights deserve to be mentioned among the most iconic indie gaming moments, especially Death Wish.\n\nYet at the same time, it fundamentally misses the core of what made the original work in the first place. It feels like the developers got too committed to creating an unapologetic, unfriendly art project, which meshes well with the themes of crime and destruction but no longer translates into a reasonable gaming experience. It almost feels like a puzzle now, with only a couple correct ways to beat a level and an immediate serving of \"press R to restart\" whenever you deviate from those. \n\nThe floors got much bigger and more open, leading to long-distance, gun-based action, yet the base design was never adjusted enough to reflect that (including the oft-criticized situation of getting shot by somebody off-screen). There’s no room for frantic improvisation or spontaneous wins anymore, at least not until you learn the layouts and enemy placements through pure trial and error, and even then it’s subject to unpredictable split-second variations.\n\nTo be fair, a couple of things actually got more consistent compared to the original, like the baiting of enemies or the knockback effect of doors, but it’s still nowhere near enough to feel in control. And if you go for high scores/ranks, it becomes three times as pronounced, since you’ll be forced to rush ahead to maintain the combos instead of being careful, turning the process into blind repetition until memorization skills and/or RNG take mercy on you.\n\nThe story is impressive and memorable once you put it all together, but much less so when you’re still experiencing it, sabotaged by the equally unfriendly and obtuse delivery. If you want to understand wtf is going on here, you need to remember the first game near-perfectly, down to character appearances and specific dates. You’d better jot down every date mentioned here, too, or the constant timeline jumps might get you lost quickly.\n\nAlso, hopefully, you’re really good at processing visual storytelling and taking in the scenes, since the most important clues are often only shown in the background while conversations happen. Oh, and just to confirm, you’re in the right mental state to patiently sit through cutscenes, right? The fast-paced, frantic gameplay didn’t make you agitated and simply itching to get back to action, right?\n\nAlternatively, you can just play it once, look up the explanations, then play through it again to appreciate the author’s intent, which is probably what the majority of the fans ended up doing. It really is a convincing, sprawling tale about the endless cycle of violence and its only logical conclusion, and even though the metacommentary is still very on the nose, the extra scale makes it much more fleshed-out and impactful. Going back to the main screen after the credits to realize what that background imagery means is quite an existential moment. Too bad you have to crawl through hours of frustration to experience it.\n\nThe same could probably be said about all of Hotline Miami 2’s strong points. There’s a thin and subjective line between being challenging and being unfair, but unless you’re fine with hundreds of retries that rarely feel like your fault, this sequel will likely be the latter.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I was really digging this in the beginning but, I got so frustrated the more it went on. The game outstays its welcome. The level design is worse compared to the first game. The soldier sections especially became a massive pain in the *ss. One level in particular is very open and filled with ranged enemies that will shoot you before you can even see them on the edge of your screen. Some of the new enemies like the ones that dodge your bullets and can only be killed by melee and the fat enemies with guns are so f*cking annoying. Music is way more generic. They decided to do more with the story for this game but, eventually it completely lost my interest. It's a shame because I really liked the first game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game takes everything fun about the first game and replaces it with terrible level design and enemies that will shoot you from offscreen.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "everytime i play this game i have the urge to make my review harsher\nwhere do i even start\nhotline miami 1 was a fast paced top down horror game where you play as the monster while still keeping a good amount of natural difficulty\nhotline miami 2 is the ogs cousin from the south who posts his 4 wheeler on tiktok to seem cool\nslow paced walking simulator where you fire a gun wait behind a corner shoot an enemy rinse repeat the entire game\ni haven't even made it to the son levels so maybe it gets better but im like halfway through the game so it is sure taking its sweet time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "imagine your being bent over a desk and being railed by a BBC and when you ask him to stop another big black guy comes out the closet and spitroasts you thats what it feels like to play this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "blood dead russians rave 2? But add dead columbians and psycho detective to this mix.\nThe story is more interesting but gameplay is much more boring. Its not even close to the drive from 1 part",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has bugs and you'll waste more time with it. Once you complete the game, the ending has a bug where the dogs get stuck in the textures.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story was great the game was nightmarishly hard and genunely unfun to play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Les contrôles sont juste infernaux.. Surtout le double personnage, une purge, j'ai joué 4h ça me suffit je desinstale",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like previous game, this was not something I found good. Controls seemed better, but a turd with a free peanut in it is still a turd.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love restarting the level because of unfair deaths from enemies off screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is cool but its not like the first one and the lore doesnt make sense u just bounce between like 5 characters every chapter",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Сомнительно но окей.Первая часть лучше во всех механиках,картах и геймплее ,даже графон  во второй части значительно деграднул",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuh naw corey doesnt want to sit on my face 0/10 fuckass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not good game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "oh my god bruh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "норм",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the levels are not fun at all, spent too much time trying to tell myself that i was having fun",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Dead Ahead is the shittest level ever, 0/10, boring, ass plot the first hm was better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its just hotline miami but worse. The characters are samey, theres far less mask variety, the music is worse, the game mainly(completely) focuses on gunplay(the worst part of it), its just a far inferior product save some money and just play the first game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How do you manage to take every single FUCKING aspect of the first game and make it worse, how do you manage to fucking not only make the maps worse but you also make them 10 times larger. NOT ONLY that but 90% of the enemies have guns, instead of being varied in approach and strategy its just strafe corner with gun. On TOP of this they got rid of the fact that your points per kill decreases if you keep doing the same thing so it's clear that they want you to just strafe corners with guns. You can step into a room, kill two people and get shot across the map by some dude with a shotgun because the maps are literally just full of empty corridors with no variation.\n\nI was expecting something fun like the first game, what the fuck is this. This is probably what it feels like to get penetrated in all my holes by those 30 inch bad dragon horse dildos with no lube. I am an hour in for fucks sake",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "half the fandom hasn't even played the game and it pisses me off, the game is decent but it costed me my mental sanity to get past most of the levels. And now the game's soundtrack makes me react violently because of how long I've listened to it whilst dying repeatedly",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a no for me. The game doesn't introduce much new content compared to the previous one. I'd recommend it for following the story (which is great) and enjoying the music, if it weren't for the biggest problem with this game: the terrible level design. Unlike the previous game, this one has much more spacious areas, which is the worst possible idea for a top-down game. I spent most of the time shooting enemies blindly across levels. I really love challenging games, but in this one, the difficulty comes from abundant windows, poorly drawn maps where you can't tell what's in front of you or whether it's an obstacle, enormous spaces, and ridiculously dumb—yet unexpectedly capable—enemies. Play the first part instead.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "One reddit post called Hotline Miami 2 \"the best worst\" (the worst best?) sequel ever made, which I think is a pretty apt description. It’s so much more ambitious and polished, with a number of new cool mechanics, an incredible OST, and a varied campaign that’s 3-4 times as long and climaxes twice, akin to the A/B-sides of old cassette tapes. It absolutely nails the mood of frenetic violence spiraling out of control, and its highlights deserve to be mentioned among the most iconic indie gaming moments, especially Death Wish.\n\nYet at the same time, it fundamentally misses the core of what made the original work in the first place. It feels like the developers got too committed to creating an unapologetic, unfriendly art project, which meshes well with the themes of crime and destruction but no longer translates into a reasonable gaming experience. It almost feels like a puzzle now, with only a couple correct ways to beat a level and an immediate serving of \"press R to restart\" whenever you deviate from those. \n\nThe floors got much bigger and more open, leading to long-distance, gun-based action, yet the base design was never adjusted enough to reflect that (including the oft-criticized situation of getting shot by somebody off-screen). There’s no room for frantic improvisation or spontaneous wins anymore, at least not until you learn the layouts and enemy placements through pure trial and error, and even then it’s subject to unpredictable split-second variations.\n\nTo be fair, a couple of things actually got more consistent compared to the original, like the baiting of enemies or the knockback effect of doors, but it’s still nowhere near enough to feel in control. And if you go for high scores/ranks, it becomes three times as pronounced, since you’ll be forced to rush ahead to maintain the combos instead of being careful, turning the process into blind repetition until memorization skills and/or RNG take mercy on you.\n\nThe story is impressive and memorable once you put it all together, but much less so when you’re still experiencing it, sabotaged by the equally unfriendly and obtuse delivery. If you want to understand wtf is going on here, you need to remember the first game near-perfectly, down to character appearances and specific dates. You’d better jot down every date mentioned here, too, or the constant timeline jumps might get you lost quickly.\n\nAlso, hopefully, you’re really good at processing visual storytelling and taking in the scenes, since the most important clues are often only shown in the background while conversations happen. Oh, and just to confirm, you’re in the right mental state to patiently sit through cutscenes, right? The fast-paced, frantic gameplay didn’t make you agitated and simply itching to get back to action, right?\n\nAlternatively, you can just play it once, look up the explanations, then play through it again to appreciate the author’s intent, which is probably what the majority of the fans ended up doing. It really is a convincing, sprawling tale about the endless cycle of violence and its only logical conclusion, and even though the metacommentary is still very on the nose, the extra scale makes it much more fleshed-out and impactful. Going back to the main screen after the credits to realize what that background imagery means is quite an existential moment. Too bad you have to crawl through hours of frustration to experience it.\n\nThe same could probably be said about all of Hotline Miami 2’s strong points. There’s a thin and subjective line between being challenging and being unfair, but unless you’re fine with hundreds of retries that rarely feel like your fault, this sequel will likely be the latter.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I was really digging this in the beginning but, I got so frustrated the more it went on. The game outstays its welcome. The level design is worse compared to the first game. The soldier sections especially became a massive pain in the *ss. One level in particular is very open and filled with ranged enemies that will shoot you before you can even see them on the edge of your screen. Some of the new enemies like the ones that dodge your bullets and can only be killed by melee and the fat enemies with guns are so f*cking annoying. Music is way more generic. They decided to do more with the story for this game but, eventually it completely lost my interest. It's a shame because I really liked the first game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game takes everything fun about the first game and replaces it with terrible level design and enemies that will shoot you from offscreen.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "everytime i play this game i have the urge to make my review harsher\nwhere do i even start\nhotline miami 1 was a fast paced top down horror game where you play as the monster while still keeping a good amount of natural difficulty\nhotline miami 2 is the ogs cousin from the south who posts his 4 wheeler on tiktok to seem cool\nslow paced walking simulator where you fire a gun wait behind a corner shoot an enemy rinse repeat the entire game\ni haven't even made it to the son levels so maybe it gets better but im like halfway through the game so it is sure taking its sweet time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "imagine your being bent over a desk and being railed by a BBC and when you ask him to stop another big black guy comes out the closet and spitroasts you thats what it feels like to play this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "blood dead russians rave 2? But add dead columbians and psycho detective to this mix.\nThe story is more interesting but gameplay is much more boring. Its not even close to the drive from 1 part",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has bugs and you'll waste more time with it. Once you complete the game, the ending has a bug where the dogs get stuck in the textures.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story was great the game was nightmarishly hard and genunely unfun to play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Les contrôles sont juste infernaux.. Surtout le double personnage, une purge, j'ai joué 4h ça me suffit je desinstale",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like previous game, this was not something I found good. Controls seemed better, but a turd with a free peanut in it is still a turd.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love restarting the level because of unfair deaths from enemies off screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is cool but its not like the first one and the lore doesnt make sense u just bounce between like 5 characters every chapter",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Сомнительно но окей.Первая часть лучше во всех механиках,картах и геймплее ,даже графон  во второй части значительно деграднул",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuh naw corey doesnt want to sit on my face 0/10 fuckass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not good game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "oh my god bruh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "норм",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the levels are not fun at all, spent too much time trying to tell myself that i was having fun",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Dead Ahead is the shittest level ever, 0/10, boring, ass plot the first hm was better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its just hotline miami but worse. The characters are samey, theres far less mask variety, the music is worse, the game mainly(completely) focuses on gunplay(the worst part of it), its just a far inferior product save some money and just play the first game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How do you manage to take every single FUCKING aspect of the first game and make it worse, how do you manage to fucking not only make the maps worse but you also make them 10 times larger. NOT ONLY that but 90% of the enemies have guns, instead of being varied in approach and strategy its just strafe corner with gun. On TOP of this they got rid of the fact that your points per kill decreases if you keep doing the same thing so it's clear that they want you to just strafe corners with guns. You can step into a room, kill two people and get shot across the map by some dude with a shotgun because the maps are literally just full of empty corridors with no variation.\n\nI was expecting something fun like the first game, what the fuck is this. This is probably what it feels like to get penetrated in all my holes by those 30 inch bad dragon horse dildos with no lube. I am an hour in for fucks sake",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "half the fandom hasn't even played the game and it pisses me off, the game is decent but it costed me my mental sanity to get past most of the levels. And now the game's soundtrack makes me react violently because of how long I've listened to it whilst dying repeatedly",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a no for me. The game doesn't introduce much new content compared to the previous one. I'd recommend it for following the story (which is great) and enjoying the music, if it weren't for the biggest problem with this game: the terrible level design. Unlike the previous game, this one has much more spacious areas, which is the worst possible idea for a top-down game. I spent most of the time shooting enemies blindly across levels. I really love challenging games, but in this one, the difficulty comes from abundant windows, poorly drawn maps where you can't tell what's in front of you or whether it's an obstacle, enormous spaces, and ridiculously dumb—yet unexpectedly capable—enemies. Play the first part instead.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "One reddit post called Hotline Miami 2 \"the best worst\" (the worst best?) sequel ever made, which I think is a pretty apt description. It’s so much more ambitious and polished, with a number of new cool mechanics, an incredible OST, and a varied campaign that’s 3-4 times as long and climaxes twice, akin to the A/B-sides of old cassette tapes. It absolutely nails the mood of frenetic violence spiraling out of control, and its highlights deserve to be mentioned among the most iconic indie gaming moments, especially Death Wish.\n\nYet at the same time, it fundamentally misses the core of what made the original work in the first place. It feels like the developers got too committed to creating an unapologetic, unfriendly art project, which meshes well with the themes of crime and destruction but no longer translates into a reasonable gaming experience. It almost feels like a puzzle now, with only a couple correct ways to beat a level and an immediate serving of \"press R to restart\" whenever you deviate from those. \n\nThe floors got much bigger and more open, leading to long-distance, gun-based action, yet the base design was never adjusted enough to reflect that (including the oft-criticized situation of getting shot by somebody off-screen). There’s no room for frantic improvisation or spontaneous wins anymore, at least not until you learn the layouts and enemy placements through pure trial and error, and even then it’s subject to unpredictable split-second variations.\n\nTo be fair, a couple of things actually got more consistent compared to the original, like the baiting of enemies or the knockback effect of doors, but it’s still nowhere near enough to feel in control. And if you go for high scores/ranks, it becomes three times as pronounced, since you’ll be forced to rush ahead to maintain the combos instead of being careful, turning the process into blind repetition until memorization skills and/or RNG take mercy on you.\n\nThe story is impressive and memorable once you put it all together, but much less so when you’re still experiencing it, sabotaged by the equally unfriendly and obtuse delivery. If you want to understand wtf is going on here, you need to remember the first game near-perfectly, down to character appearances and specific dates. You’d better jot down every date mentioned here, too, or the constant timeline jumps might get you lost quickly.\n\nAlso, hopefully, you’re really good at processing visual storytelling and taking in the scenes, since the most important clues are often only shown in the background while conversations happen. Oh, and just to confirm, you’re in the right mental state to patiently sit through cutscenes, right? The fast-paced, frantic gameplay didn’t make you agitated and simply itching to get back to action, right?\n\nAlternatively, you can just play it once, look up the explanations, then play through it again to appreciate the author’s intent, which is probably what the majority of the fans ended up doing. It really is a convincing, sprawling tale about the endless cycle of violence and its only logical conclusion, and even though the metacommentary is still very on the nose, the extra scale makes it much more fleshed-out and impactful. Going back to the main screen after the credits to realize what that background imagery means is quite an existential moment. Too bad you have to crawl through hours of frustration to experience it.\n\nThe same could probably be said about all of Hotline Miami 2’s strong points. There’s a thin and subjective line between being challenging and being unfair, but unless you’re fine with hundreds of retries that rarely feel like your fault, this sequel will likely be the latter.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I was really digging this in the beginning but, I got so frustrated the more it went on. The game outstays its welcome. The level design is worse compared to the first game. The soldier sections especially became a massive pain in the *ss. One level in particular is very open and filled with ranged enemies that will shoot you before you can even see them on the edge of your screen. Some of the new enemies like the ones that dodge your bullets and can only be killed by melee and the fat enemies with guns are so f*cking annoying. Music is way more generic. They decided to do more with the story for this game but, eventually it completely lost my interest. It's a shame because I really liked the first game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game takes everything fun about the first game and replaces it with terrible level design and enemies that will shoot you from offscreen.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "everytime i play this game i have the urge to make my review harsher\nwhere do i even start\nhotline miami 1 was a fast paced top down horror game where you play as the monster while still keeping a good amount of natural difficulty\nhotline miami 2 is the ogs cousin from the south who posts his 4 wheeler on tiktok to seem cool\nslow paced walking simulator where you fire a gun wait behind a corner shoot an enemy rinse repeat the entire game\ni haven't even made it to the son levels so maybe it gets better but im like halfway through the game so it is sure taking its sweet time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "imagine your being bent over a desk and being railed by a BBC and when you ask him to stop another big black guy comes out the closet and spitroasts you thats what it feels like to play this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "blood dead russians rave 2? But add dead columbians and psycho detective to this mix.\nThe story is more interesting but gameplay is much more boring. Its not even close to the drive from 1 part",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has bugs and you'll waste more time with it. Once you complete the game, the ending has a bug where the dogs get stuck in the textures.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}