{
  "positive": [
    {
      "review": "I have never played a deck builder with any real dedication before and for whatever reason this one has kept my attention. \r\n\r\nFirst. The mushrooms are the best, a machine that springs to life with enough ease that even a consummate 'can't see the forest for the trees person' (me) is able to yield positive results. \r\n\r\nSecond. Gilda is the worst. \r\n\r\nThird, the writing in this game, the little scenes where we get asides with the characters are charmingly bad but they're so sincere that I'm pleased each time I get a small interior shot of the internal drama of the various factions. \r\n\r\nThe art in this game can be a bit all over the place but by god if they're depicting a little guy they're going to nail it. \r\n\r\nI think probably after 300 hours of game play I should have something to say about the systems or the tactics or the deck building but again, I've played one deck builder so I feel like my opinion is just too shallow for it to be worth while and probably not what a person who is interested in deckbuilders is looking for. \r\n\r\nThat said, the daily challenges are the best part of this game compared with the 'standard runs' you can customise for yourself. They have a 'boutique' customised vibe to them that the pure randomness of the standard runs lack.\r\n\r\nAnyway, thank you to the creators.\r\n\r\nP.s. please buff Gilda, she has so much room for potential.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Fantastic deck-builder. New clans and cards, events, and mechanics improved an already amazing game. Tons of replay value. Highly recommend",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "hundreds of hours in the first game. they imrpoved everything about the first game, basically gave us a second game and added the first game so you can mix them as well. perfect card game me like monsters me like trains",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Monster Train 2 is a worthy sequel that expands the original’s deckbuilding roguelike formula with fresh ideas. \n\nThe game keeps its signature mix of card strategy and tower-defense combat, set on a train climbing toward a corrupted Heaven. \n\nFive new clans bring unique mechanics, offering plenty of replayability and creative deck synergies.\nVisually, it’s polished and vibrant, while the gameplay remains fast-paced and addictive.\n\nFor me it is better than MT1 and I recommend it to everyone.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I think it's the GOAT of deckbuilders. I'm as excited for Slay the Spire 2 as everyone else, but, and this is a big if, even if it does somehow end up being better than MT2, I can't imagine it'll be better by much.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Monster Train 1 is an excellent game. Monster Train 2 is Monster Train 1 that has been improved in all aspects. If you enjoy deckbuilding games then you will enjoy this as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Everything the original did but better, you can hardly ask for more.\n\nBut if I did... I would ask that Shiny Shoe take a second look at adding back Hell Rush. Absolutely loved the multiplayer mode from the first game and was a bit disappointed to hear it was cut from this game due to low player count. With proper lobby support and even daily mutators it would be a hit!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Honestly one of the best sequel games I've ever played. Brought back the things I loved from the first game added a bunch of new content. The art style is wonderful and the characters sound effects range from goofy to menacing and the soundtrack is first class. Will immediately buy any and all DLC for this game. Was worried how the sequel was going to match and exceed the first, and by god did you manage it. Highly reccomend if you, like me, love deck builder card battlers.\n\nCheers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is just amazing, it's so huge and complex, I am ready to say that it is better than Slay the Spire and that is no easy feat!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A sequel to a game I enjoyed that kept exactly what made the first game such a good deck builder and adds to that",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic game! Great mechanics and replay-ability.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Monster Train was one of the best Rogue-Deckbuilders, and 2 is a step up in almost every way",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Play Time: 358.7 hours\nAchievements: 49 out of 50\nCards Mastered: 452 out of 452\nDate/Version: November 14th 2025\nRating: 9\n\nMonster Train 2 is a strategic roguelike deck building game with a twist. Set on a train to hell, you’ll choose from multiple tracks to send your train down, with different potential Roguelite benefits in each location. Ranging from Unit Buffs, Spell Buffs, New Cards, Equipment, and random events that may allow you to create broken combos.\n\nMonster Train 2 is an improvement on Monster Train 1, I had a total of 204.7 hours on Monster Train1, I currently have 358.7 hours played with Monster Train 2. The game isn't the same but is the same, it's hard to explain.\n\nThe difficulty settings I believe transition better as compared to Monster Train 1.\nThe units feel a bit more balanced. You'll still come across builds that overall are better than others. And honestly sometimes I believe a few things need to be balanced differently. \n\nThere are some unique challenge levels that give you some in game cosmetics. Thees challenges are more like puzzles, where you have to figure out what way can you win with what you are provided or not provided. \n\nThere are more clans, more combos to come up with, more challenges, and some funny little stories added into the game. The little easter eggs here and there are fun. \n\nA must buy DeckBuilder. \n\nPROS:\nUnique Characters\nUnique Team Combos that work\nRandom Mode\nHundreds of in game rewards\nChallenges galore\nFun bosses\nChallenge adjustment difficulty setting\nA huge! Amount of content\nGood Price\nCool looking characters\nFantastic Art\nA bit of a learning curve\nA nice small story \nVery Optimized \n\nNEUTRAL:\n\n\nCONS:",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay is the best of its kind, better then all other rouge like deck builders.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Slow yet very tactical card game, you need to think you every move if you want to beat the final boss which is fun and very challenging",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Monster Train 2 is not only the best card battler /deckbuilder of 2025, it's also one of the best games of 2025 and a top tier card battler along with its predecessor, Slay the Spire and Beneath Oresa. This game only needed to bring back all the things that were good about the first one and maybe touch up a few things to keep the experience fresh... It did a heck of a lot more than that. There are FIVE new factions as of this moment in addition to five of the six factions we already had in the first game. \n\nMonster Train 2, like its predecessor, is a roguelite card battler in which you embark upon runs. Each run has a series of combat encounters, and after each combat encounter you arrive to a resting area where you can upgrade and modify your deck in various ways. Combat encounters take place in a train of sorts. There are four floors, enemies enter the bottom floor and try to make their way to the fourth floor where your pyre is to destroy it. And it is, of course, up to you to stop them. When your pyre’s health reaches zero, it’s game over. \n\nIn Monster Train 2 there are factions… and this time you have all the original factions you had in Monster Train… and no less than five new factions. Each of these factions has a broad array of unique creatures and spells that have the potential to work in beautiful tandem depending on your strategy. You choose two factions at the beginning of the run: a primary faction and a support faction, and the best news is that every faction has an insane number of cross-class synergies that make one plus one equal five. And this translates into a deliciously rewarding tactical experience. \n\nShiny Shoe don’t seem to be running out of ideas, quite the contrary. Some of the new factions are even better than the ones we already had  were pretty awesome. \n\nIn the original Monster Train you had Spells and Creatures as your primary card types. Monster train introduces the Equipment card type. This card type is comparable to enchantments in Magic The Gathering. You have creature equipment cards and room equipment cards. \n\nCreature equipment cards need to be attached to a creature during an encounter, and they last until the creature dies. These cards add all sorts of new effects and skills. And there are many other components in the game that synergize really well with equipment cards. There are effects that trigger every time an equipment card is used, for example. There is also the Graft skill which many creatures from the Lazarus faction have. These creatures come with a built-in piece of equipment and when they die, said equipment returns to your hand and you get the chance to use it again on some other creatures. In fact, equipment-based builds are very much a thing with the Lazarus faction. \n\nThen you have Room Equipment cards. These cards are applied to an entire floor and they have effects that affect allied or enemy creatures every time their conditions are met.  \n\nCreature cards already had a bunch of skills in the original Monster Train and now there are many more, and they aren’t just there to bloat the gameplay meaninglessly, they have tactical value, they can be used as the turn-stone of your deck’s build and they can work in beautiful synergy with other skills. It’s in-freaking-sane, no other card battler comes close to this. Some creature cards now have skills that can be triggered by the player after he or she has summoned them, Magic the Gathering style. And I always thought the original game needed something like this, skills that you could activate and use on allied or enemy units. \n\nIn the first Monster Train you could boost your creatures with shield, armor, spikes, regenerate and lifestel amongst other things, and now you have new ways to boost them like various retaliatory effects. \n\nSpell cards also go way beyond your typical damage and boosting effects. You can pull enemies to the front or push them to the back, you can root them so that they don’t move to the next floor or, daze them so that they lose their turn or weaken them so that they don’t do damage or force them to an upper or lower floor. There are spells that serve to accelerate certain mechanics or trigger certain conditions. And they are all also very tactical. You already had the Stygian faction in Monster Train, which relied very heavily on magic. Now you also have the Luna Coven, which is also very magic focused but uses a completely different approach.\n\nAfter every combat encounter you reach a resting area, in which you can upgrade your cards, restore your pyre’s health or try your luck with a random event. There are two mutually exclusive paths that you can follow and it’s always a good idea to look at the upcoming resting areas and their facilities to plan your journey more efficiently. Cards don’t have fixed upgrades like they do in some card battlers or a choice of two like they do in some others. Not that there’s anything wrong with that, but Monster Train 2, just does it better. \n\nUpgrades are purchasable items that you can attach to your cards. And you have two upgrade slots by default. Creatures with the “sweep\" skill damage all enemies every time they attack. So if you give them the upgrade that makes them quick and adds 10 damage to their attack, you can wipe out an entire floor of enemies before they even know what’s going on. It’s crazy fun and the possibilities are endless.\n\nSo your goal is to prevent your pyre from dying, but in the original monster train your pyre could only attack. In monster train two you can unlock different pyres with different abilities and tradeoffs. There is a pyre, for example, that has an ability that you can trigger once per encounter that gives you plus three energy.\n\nNow you have a new game mode: the dimensional portal. And it’s actually pretty freaking fun. This is a mod in which you have a series of unlockable pre-designed challenges. You don’t get to choose your factions or your pyre and you usually get an insanely powerful modifier and one that’s equally punishing. This a mod that you have to unlock, so by the time you get to sink your teeth into it, you are already going be more than familiar with the game’s mechanics. And this is a good thing. Because this mod is about using your knowledge of the game’s mechanics and the mechanics of each faction to solve an additional problem that gets thrown at you.\n\nSo new factions with new cards and synergies, new card types, new skills and new pyres... this is all crazy good especially if you consider that they are not there to bloat the experience but to make the game replayable in meaningful ways. And a new alternative game mod that makes the game more about tactical puzzle solving than about deck building. What's not to like about this bad boy???\n\n(Full video review on my Youtube Channel: Ye Old Entertainment)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Monster Train 1 was a top-tier entry into the Spire-a-like subgenre from the moment it dropped, and Monster Train 2 improves upon it in almost every way! Continuing the musically excellent, artistically beautiful and altogether cohesive backdrops upon which Shiny Shoe craft their roguelite deckbuilders, this game feels like it refines the IP's innovative 3-tier approach to combat, comments on the blossoming potential left in the wake of other giants in the genre, and undoubtedly also cements itself among them.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Do I recommend? Yes. but not without some reservations. There is alot of play time to be had in this game and it the basic game play structure is decent. But when it gets down to the nitty gritty this game is a painful, grinding time sink. You will have to keep repeating the same play through hoping to unlock something better to get further in. It`s slow going and very repetitive. Also very luck related. Wish it could have offered more choices and paths so that victory felt like it was based on your strategic brilliance rather than luck.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When Wendy's released the Baconator, they asked the question \"What's better than a bacon cheeseburger?\" and answered it with \"TWO bacon cheeseburgers stacked on top of each other.\" Monster Train 2 is the Baconator of rogue-like deck builders. They took everything that was great about the first game and just piled on more: more factions, more cards, more enemies, more relics, etc. If you liked Monster Train 1, Slay the Spire, or any of the many other games in this genre, you will easily be foundered by this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Have been fortunate enough to be an official playtester for this absolute gem of a game, the amount of blood sweat and tears the devs poured (and still keep pouring) into this game to make it the best it can be is absolutely amazing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you were a fan of the first Monster Train, you'll be right at home with this one. It's a lot of the same formula, and a fair bit more. Quality of life improvements go over well, and it breathes some new life into some of the original content, at that. As far as completing runs, you'll probably find it easier than Slay the Spire, but this is moot, considering you could argue most runs in either game can become trivial if you find a good game plan. \n\nWhile this seems a bit extra to add, if these sorts of things matter to you, it might be worth considering. \n\nI was a little hesitant to purchase instantly, considering the vibes I got toward how the first game was handled initially. It felt like the content hit a brick wall and gave the feeling that it was abandonware at a point, as they were all-in on their next venture, Inkbound. This game, sadly, had been shaping up to be a DLC and cosmetic-addled mess, despite the gameplay being decent. \n\nI WILL give them credit for responding to the near instantaneous backlash. They backpedalled on that format and removed the leveling and season pass stuff pretty quick. While they did not give refunds to anyone who spent money, they did give them double the currency or more to unlock things, or instantly unlocked everything that would be in \"Supporter packs\" that you can buy that served more as expansions. I've seen these things handled a lot more poorly before. That said, that game is now sort of in that \"abandonware\" state, now that they're focused on Monster Train 2. I'm not thoroughly convinced Monster Train 2 won't hit that kind of vibe eventually if they get another venture going.\n\nHOWEVER, their games are still fun, and complete packages (though there are more bugs in Inkbound that are a bit iffy.) A developer isn't beholden to their games forever, no matter how good they are, and it's absolutely a reasonable way of handling stuff, thus, I am still giving this game a positive review. \n\nIf you prefer living games that just keep on giving though, there's plenty of other options out there. You're still going to get your value out of buying this game, even when it's not on sale.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is the best game in my opinion when it comes to roguelike deckbuilding games, I love this game and concept so much and highly recomending it \n\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The first Monster Train was a great time, but Monster Train 2 is a prime example of developers taking lessons learned and effectively making a sequel that is better in every way. If you've never played MT1, it's okay, jump right in to MT2! It's excellent!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoyed the first game, the second one will be right up your alley.\r\n\r\nThe problem with Roguelikes however is there are just so many of them and not a whole lot of room for your 'best' one that you will play regularly.\r\n\r\nI really enjoyed the Original Monster Train and MT2 is more of the same but better - except my 'best' roguelike is Slay the Spire, with Balatro a close second.\r\n\r\nThat leave MT sitting on the outer for me personally, but not at all because it's not a good game.  \r\n\r\nIt's simply because I have so many roguelikes in my collection demanding my time.\r\n\r\nAs mentioned before, if you enjoyed the first game then the second one is great.  Get it.\r\n\r\nI recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sequel done right... and it's much better than the first game IMO. My personal GOTY for 2025. (I'll update this review later.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's better than the first and that was a very good game. Whenever I have an hour or two to burn, this is what I open and every time, I'm engaged. Every turn requires your attention without being overwhelming and being able to restart your turn, or the entire battle, lets you plan and struggle to salvage a run, or really see what you're missing more than any tutorial ever could. You can always do better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A huge upgrade from the first game\nSo many possibility from different clan\nChallenging in new dimensions and mutators are fun (some of them annoying af)\ngreat game so sit back and relax(not quite LOL) \n1 game a day for brain exercise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is easy to learn and play, but punishingly difficult to fully \"beat\" and put down.  I constantly lose at it, yet I find myself hitting \"New Run\" over and over again...hopping right back on the failure train!\r\n\r\nThe combinations of cards, clans, relics, etc...is astonishing, and the inclusion of the first game's clans into the second is a delightful feature!\r\n\r\nThey have also added two free content patches that have added numerous cards, events, etc... so the game is still evolving.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More of the same as the first game, with new clans and mechanics. High replay value.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. Very relaxing and plenty hours of gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Direct upgrade to the first game in every metric. This game along with Slay the Spire are the strongest games the genre has to offer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're even remotely into card games, roguelikes, or setting up stupid broken combos, you should be playing this game.\n\nYou will need to stomach some of the most juvenile dialogue ever shoved into a video game to advance the plot, though =/\n(Hey developers, please strongly reconsider rewriting literally all of that from scratch, it actively reduced my enjoyment of the game)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game love it, especially since it builds on the original!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fast paced, endless combinations, sometimes insanely frustrating, but I always seem to come back to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game mechanics, music, and artwork. Love what Shiny Shoe has brought as a sequel in the franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so massively underrated. If you liked Slay the Spire this is the closest thing that comes to it.\nThere is no best clan. They all have unique things that they can do. And later in the game, you unlock ALL OF THE CLANS FROM THE FIRST GAME \n\nSo yeah, 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm a big fan of Slay the Spire and trying to get into this game as well. I will keep trying, it's overwhelming, but makes fun nontheless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, includes races from first game too! Is easy to pickup, easy to have a game here and there as they're short and easy to pickup/putdown. Well worth the money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This and Slay The Spire are definitevily the best deckbuilder rougelikes you can buy it's not even close.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like deckbuilders, I can say this game scratches that itch. I usually tell people to start with the first in a series but this is the exception. This game is the kind of sequel that just does everything more and better than the original. Spend the time to unlock all the races and you will never be bored unless you want to try and power game, which is again an option but seems like beating this game is the least fun part about it. Enjoy the experimentation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game far eclipses the original in my opinion, even though sometimes it makes me want to cry hysterically",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the improved version of the first, with better clans and options. It's nice to have the option to play with the legacy clan too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A genuine pleasure to play. I don't always have fun losing, but I can lose three games in a row and have a blast with this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've finally played this enough I should review it.\n\nits my favorite roguelite deckbuilder. Its exactly the right amount of length and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A perfect follow up to the first game in every way. Really everything you'd ever want from a sequel, it took everything the first game did and just doubled it and innovated on the concepts. Easily my favorite Roguelike deck-builder of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely incredible,  takes everything from the first game and some how makes it even better. Its also more challenging but in a good way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game so much...Most of my friends found the visuals and soundtrack cheesy but idk I somehow love it. The music is on point. The new plot is cute. Gameplay is as good as the first one and it runs perfectly smooth on SD. Also how nice of the team that they credit each individual artist for each card and song. Anyways I will always support this game and hope the devs all the best<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked the first Monster Train (MT1), this is a no-brainer. It adds new gameplay and QoL systems that really enrich the experience. My favourite new QoL feature is the ability to reset your turn (no penalties, no limits) or the battle (you cannot change your trial decision though). I've managed to scrape through battles I thought were unwinnable thanks to that feature, and it felt so satisfying!\n\nIf you like deck builders in general but have not played MT1 before, I highly recommend this game (I really enjoyed Slay the Spire too). There's no real need to get MT1 either because this game supersedes its predecessor in every way.\n\nIn fact (spoilers for those who played MT1), [spoiler]at a certain point of progression in the game, you'll unlock ALL the base game clans from the first game (the DLC clan from MT1 excluded)[/spoiler]\n\nOverall, what I enjoy most about this game is how it does not shy away from letting you build decks that feel so broken in the best synergistic ways. If you like that feeling too you'll probably enjoy this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, and continuation of the series. Always fun to get some broken combo and the free are a plus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is light, fast to pick up, but also offering depth and allows for creativity in building your decks.\n\nI appreciate that they keep adding content (cards, monsters, artefacts).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, interesting, unique, no political agendas shoved in your face, and affordable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, both relaxing and challenging. well balanced experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably my favorite card battler game of all time, and I buy all of the good ones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A bit like Slay the Spire but much much better. \r\n8 different archetypes to unlock each with alternate choices. Lots of stuff to unlock for completionists.\r\nNever gets boring. Heavily recommend!\r\n\r\nDefinitely a \"just one more game\" and then its 3 AM situation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best way to do a sequel.  The game is just as good as the original, but literally doubles in content making the original nearly seem obsolete.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Head and shoulders above the first game. The new factions and combinations allow for a ton of build variety and complex expression. Absolutely recommend it for anyone that's a fan of deck builders.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the first game quite a bit and I love roguelikes, this game does a lot better than the first. The mechanincs of the different hearts is very nice as well as the factions, new and old, that the game has. I think the different features of the factions are varied and unique, and if you get stale with one faction switching leaders or changing to a whole new faction really keeps the game very replayable. Definitley worth getting, or even trying the first game out before trying this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked the first game, this one is more of the same. More cards, more clans, more bosses.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great deckbuilder game, fun mechanics with many combinations and sets of decks. Synergies abound. \nMy only grip is that the ending animation is unskippable; I just want to get back to the gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "monster train 1 is easily in my top 3 deckbuilders and this game is an improvement over that, easy 10/10 (minus the story events which I mostly ignore)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game!\nGreat mechanics and replay-ability.\n\nMy only regret is that I haven't played enough of it.\nIn some weird way I like it for how at times I have to think of it as a puzzle due to needing to get out of a tight situation.\nWith the undo turn button it means you can try plenty of different combinations in each turn to get the best result possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Takes what the first game had and amps it up! More clans, more challenge, more combos!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and crazy rng game recommend for any one who like slay the spire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A quality game that adds more than the original while still having the original content. If you were thinking about getting the first or already have the first the sequel is definitely worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic Sequel in every way. Music, gameplay, mechanics are a direct upgrade from the original.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I figured it was hard to top the previous Monster Train as my favorite deck builder, but this one tops even that. Somehow they've made unit shops less of an absolute need and more of a choice, as well as introducing rooms, weapons, and a whole lot of new clans. A true sequel that almost completely replaces the original. It's got near endless replay value, and a challenging, but not impossible, top difficulty ascension.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best STS-like game (distinguishing it from roguelikes, STS being Slay the spire type progression where there are branching decisions every level) I have ever played.\n\nThe amount of builds and variety of plays you can do is astronomical. You can even play for bulky decks which is almost always counter intuitive to card games where you play as thin as possible to always draw the cards you want; they made mechanics for that kind of gameplay.\n\nOn the highest difficulty, the amount of viability to strategies becomes a little bit more narrow, but I have only 2 clan combinations left that I haven't been able to make work.\n\nAll in all, it's a fun game to kill time when you're in a plane or traveling far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A direct improvement on the original.  While it does not yet have all features from the base game (some aspects of DLC are missing) if you are only going to play one, this is the one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just as fun as the first game, if a little more complex.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love how quickly each run starts becoming unique with its own powerful synergies and combos. There is also a LOT of content in this game. Personally I prefer it to Slay the Spire.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kickass music, fun gameplay. Go play MT1 and then MT2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you have played the first one, look no further.\r\n\r\nThe sequel improves by actually adding more clans, more more artifacts, more enemies, more effects and much more replayability.\r\n\r\nIf you haven't played the first one, then this is also a great game to start because most of stuff from the 1st game are still present on the sequel. If anything this feels like a huge expansion from Monster Train 1.\r\n\r\nThere's more stories and backgrounds from each clan to discover over playing the game; the dimensional challenges and the custom challenges add a lot of replayability.\r\n\r\nThis is one the best roguelike card battlers out there and if you're a fan of the genre you should not miss out on this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it scratches the itch\r\nscratching occurs because of addiction and withdrawl",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A true sequel that takes, builds, and improve upon the original. Core gameplay remains near identical to the first Monster Train, but the improvements such as the Deployment Phase and Pyre Hearts offers more substances to Monster Train 2.\r\n\r\nThe first Monster Train was quite the trip through the rings of Hell, but Monster Train 2 expands it to the Heavens themselves, figuratively and literally.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's really good, I would need another roguelike to play next from this game maybe.\n\nMust play game if you like Slay The Spire and here there are lots of Heroes to play with. So, lots of playtime and unique ways to win (or lose).\n\nAs usual be prepared to get punished.*\n\n* at least the game forgive you if you misclicked or misunderstood the card descriptions (yes, you can undo your turn or even restart battle - which I liked the most for testing purpose)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is gem and a spectacular sequel to one of my favorite deck builders. Then new clans all feel unique and have their own identities that mix and match well and the game is fun as hell... or heaven.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a more crazy and fun slay the spire except you have 3 floors to work with instead of 1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good. To me it has improved on every aspect of the original. It continues to be updated, with balance changes that, to my mind, have only improved how the game plays.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's MT1, just MORE. All the numbers are bigger, the game is 2x-3x the size and depth, the graphics are MUCH better. As difficult as you wanna make it really. If you want to zone out and cruise to crushing your enemies, you can elect to start a run on a lower setting. Every turn is a puzzle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun game that helps me relax, it has the perfect run time, and gameplay loop, to hit that almost vampire survivors style itch, or more fittingly slay the spire\nI have found the game only better than its first\nAnd that...reveal was FIRE!\n\nAlso the story bits are very cute, and I love them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who bounced a little off of Monster Train 1 with how it set the stage for progressing thru the harder difficulties, Monster Train 2 has felt like an across the board improvement. The new clans are all interesting, the difficult scaling feels more intuitive and the tools you have to create wild, fun and powerful floors to talk those difficulties feel more engaging.  Altogether it's been an even more enjoyable iteration of this builder series and I happily recommend it to anyone interested in this game genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shiny Shoe Took a 9.5/10 game, made a sequel, and builded like they were out to ensure no one played another strategy deckbuilder game for years to come. They've added so much functionaly & ease of replability, build on already existing gameplay loop and fed it everything they could their hands on. You are tired and on the edge of your seat from the very first round? You've a deployment mode now. You feel  Quick + Sweep is OP, they introduce Corruption, and have you face 3 Bosses in the end, and an Endless mode to boot! So many Strategies that you just cant yelling \"Strats on Strats on Strats on Strats!\" as you employ Equipment, Room Cards, better Artifacts and everything else in between. \r\n\r\nThe only thing I miss from MT1 (initially their art but no longer) the flavortext of the cards! I'm glad they focused on writing and some conversation cutscenes, but I miss dense and cryptic flavortext on cards from before!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great roguelike deckbuilder, tons of replayability, accesibility options, and even googly eyes setting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked the first Monster Train well enough, but the sequel is of an entirely different caliber. MT2 is right up there with the likes of Slay the Spire among the all-time greats of roguelite deckbuilders, just pure addictive catharsis as number go up and enemy go down. Phenomenal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely one of my favorite deck builders.  It has a great sense of humor and the mechanics are great fun to play around with.  There's so many different factions and strategies to mix and match that different runs can vary wildly.  Add to that different challenges and modifiers and there really is a ton of replay potential here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just like monster train one but back with even funnier challenges and gameplay. Best of all, glorious return of Dante.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good expansion on what made Monster Train fun.  Lots of re-playability with lots of cards, artifacts, and mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While I deeply enjoy Shiny Shoe and all the games they have released I am slightly disappointed in Monster Train 2. The game is generally good and a decent improvement from the design of the first. The sheer number of factions and options makes the game varied and replayable and the addition of room cards added new layers to the game. It is hard to describe the exact reasons it felt underwhelming to me but most likely the path they force you to follow. The inability to move to end game content until unidentified actions are taken outside of regular gameplay rubbed me the wrong way. Additionally, the game feels like there are more dead cards than previously which leads to more feel bad moments when you grind. Overall I still recommend it and believe it is a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME SLAPS!!\n\nI just unlocked all the achievements the other day. Theres loads of replayability along with dasily challenges that always feel fresh <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played Monster Train 2 for almost 50 hours now, and I am still finding new builds to try. The new faction mechanics are my favorite part. They add fun new ideas that expand on what the old clans could do, and they open the door for a lot of different synergies. It feels like there is always another combination of units, relics, or spells to experiment with.\r\n\r\nThe difficulty feels pretty consistent. After a few runs you start to learn what each challenge is going to throw at you, and you can plan your build around it. I liked that it rewards learning instead of just punishing you randomly.\r\n\r\nMy one issue is that some enemy mechanics swing a little too far in one direction. A few fights feel too easy and others feel annoying in a way that does not add much strategy. It is not enough to ruin the game, but it does stand out when most of the design feels tight.\r\n\r\nOverall, Monster Train 2 is a very addictive game with a ton of variety. If you enjoy making broken combos or trying out new deck ideas, there is a lot to like here. I had a great time with it and I am excited to keep discovering new builds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just out right improves upon the first game. Lots of fun and lots of combinations to keep you entertained.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoyed the first Monster Train, this is just a better version of it with more content. \nMonster Train 2 is one of the best games in the roguelike deckbuilder genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Realistically, this game is my GOTY. \nI was crazy about Monster Train, my absolute favorite deck building roguelike, and they improved upon the first game in every single way with this. I can only DREAM that they would bless me with a third in the distant future. Even when I put it down for a while I always always always come back. I love the themes, I love the art, I love the music, I love the game feel, the mechanics, design ethos. Its the game I have the most fun while losing in my entire library. And when I WIN? The dopamine hit is insane. I immediately want to play again. I am motivated more in this game than any other game I own to try and 100% it. I am nearing 30 out of 180 combos beaten and while its extremely daunting I am just so delighted to put that effort in, which is extremely out of character for me. Can't recommend it enough, and I hope the devs know they knocked this shit out of the park and I love them to death for it. \nMy parting words: As long as it isn't a buggy mess I will buy any and all paid DLC you put out for this game and I beg and plead on my knees for it. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While I feel the first game is a bit better balanced, and some of the boss battles feel like they need too specific a counter build, I cant stop playing just like the first one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun but difficult.\n\nAll depends on synerchy between units, cards and upgrades. Has a lot of replay value.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's rare that a second game in a series of games is better than the first, this one is the exception.\r\n\r\nStunning visuals, incredible music, huge variety of gameplay and replay-ability.\r\n\r\nThe major difference in MT2 from MT1 is the \"Deployable Phase\" allowing you to place your units (and even rooms and weapons with the relevant upgrade) before combat even starts.\r\n\r\nThis means no more \"hoping you draw your monsters or lose\". Planning accordingly is much easier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Monster Train 2 is Monster Train 1, but more more more.  A small story that helps explain things, but more planning then deep story.  Still nice thtere is one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best sequel games of all time.\n[spoiler] This game literally are Monster Train 1 x 2 content [/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Monster Train 1 was an excellent game that i felt was the only other that could come close to the quality of Slay the Spire 1. I was in love with both games. Out of nowhere, Slay the Spire 2 was announced and not too long after, Monster Train 2. Monster Train 2 however finally shows the true potential of this format, a game that goes above and beyond on the content it gives you, the many new fun options like equipment, rooms and all the different pyres to experiment with.\nThis is a game that has a fun first mentality, with you being able to turn any run into an op deck if you use your resources well. \n\nIt was unexpected, but this turned out to be my absolute game of the year.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great deckbuilder with interesting factions and combinations. If you have played the first its has all the original factions and the same number of new factions, lots of fun, lots of game play.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Comparing this to Monster Train 1\r\n>Game is lacking most of the challenge/difficulty options, so it's much easier\r\n>Base system changes make the gameplay much less interesting mechanically\r\n>Enemy abilities prevent all but the most braindead strategy from working and you can't see which enemies you will get, so you always have to play exactly the same way. The game is incredibly easy (I've got a 65 winstreak on the highest difficulty and have won this game on the hardest setting with every clan combination, as you can see in my screenshots), but you're forced to do the same thing every time because e.g. floor silence or sweep enemies completely shut down any alternative ways of playing.\r\n>Horrible forced in indie references in the events\r\n>Events are so overpowered that if you draw one you just win instantly. Getting Dante basically just ends the run in a win.\r\n>Animations are slow even on the highest setting\r\n>Sound is still an issue because of the noise some enemies make when getting hit, especially since multiattack is so inflated compared to MT1\r\n>Terrible redditcore writing in forced story cutscenes where MT1 just had cool MtG style worldbuilding on card flavor\r\n\r\nIn general, it's an inferior product in every respect. There is no circumstance where you should buy this if you don't own MT1. Only if you've 100%'d MT1 and want more even if it is a downgrade should you consider this game.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "I somehow cannot understand the positive reviews. It is more content on the first look but somehow the new enemy mechanics like resurrection etc demand a more specific gameplay style from you. I so often had runs which went smoothly just to be totally crushed by a certain type of enemy.\n\nMonster Train 1 also feels more polished, I think it is the better choice. Besides also having better writing and graphics.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "You can't reset fights by going to the main menu any more. That was my favorite part about the original game. A misplay/mis-input can brick your run. Ruins the experience as a second monitor game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The sequel has the exact same problems as the first game that make it only adequate as a roguleike deckbuilder. It fails to provide meaningful upgrades to the player to help reduce variance like the GOATS of this category do, like Slay the Spire.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just don't feel that it's an improvement over the first game.\nInitially I was super excited for \"more monster train\", but after having played it (and possibly because I played the first one sooo much) this release didn't strike that same excitement I was expecting.\nIt's not bad, but I'd definitely recommend the MT1 first.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's moostly fun but it's a little too player-hostile I think. Winning a run on covenant 10 so far really feels like \"get lucky with the exact right amount of greed and power given to you at the start of the run and also already know exactly what the upcoming bosses will be and if you want to do the superboss you also have to get some overpowered crap from an event as opposed to most of the events which do basically nothing. Lots of the things that are obvious holdovers from the first game are absolutely useless. Something like half the relics are almost useless (scorched steel...) and certain others are better than boss relics... I love how this game looks, I love how it sounds, I even mostly liked the story, but slamming my head against the wall until the wall decides to be suddenly softer this time to get a covenant 10 win is crazy. The scaling about...halfway up, is fine, but at like...8 or so, the game REALLY stops having ANY wiggle room for not conforming to exactly what you should have built. Maybe nerf some things and give the option to revert it in steps throughout the run for a score bonus or as part of a cov11? but as it stands now it's a little too much. Also most bosses that get stronger when they climb floors (most of them) have effects that are so insanely overtuned that if you do not defeat them on the bottom floor you lose with no option to recover. Similar for the 2 new bosses, which are otherwise exemplars of the visual and audio treat that this game otherwise is! Get some balance fixes for both player stuff and enemies, and tweak down the difficulty SLIGHTLY at least post cov-8 or so and this game is a treat. As it stands right now...eeeeeeeh?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's shiny and gives an impression of depth but I don't find many of my decisions very interesting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rather than a love letter this game is a screed compared to the first one. The mechanics are not interesting and all of the  new clans can be boiled down to the same play style with minor differences. The interplay between clans is likewise uninteresting because of this factor. This game plays like an idle game for the first 30-50 minutes of a run to build up into nothing spectacular or interesting. Huge downgrade from the first.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I dunno, i'm just not into this one. It seems exceedingly meh. I've loved other games in the genre, like slay the spire. But I'm always feeling like this game is lacking in some way when I'm playing it. It's like systems come across as if there is more to them then other roguelike deckbuilders commonly have, but at the same time it feel like nothing changes when you take advantage of them.\n\nIn other words, whenever I play this, I always feel like playing other Roguelike Deckbuilders I own. Wasn't worth the $30 I spent on it. Feels like an $8 game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is about 0 reasons to keep playing after you finished a few runs with ease. You will fight the same enemies in the same order and use the same strategy every time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I LIKE NUMBER ONE BETTER IT WAS MORE BALENCE AND FREE WILL\nNUMBER 2\nHAS NO HELL RUSH \nAND THERE A DP CAP IF YOU DO NOT MEET IT \nYOU LOSE AT THE LAST 2 STAGES \nWITCH MAKES TANKS BUILDS \nUSELESS BECUSS MINIS WILL JUST BLOW UP YOUR CRYSTAL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUN GAME! lots of builds and different enemies to fight that make you really think turn by turn...\r\nTHE F*CKING THE \"RESTART BATTLE\" AND \"ABANDON RUN\" BUTTONS SHOULD NOT BE RIGHT NEXT TO EACH OTHER WAISTING A GOD DAMN HOUR ALMOST EEKING OUT A WIN TO F*CKING MIS-CLICK.\r\n\r\nI hope the devs read this and move the buttons. This ruined my day so bad I slept all day and didn't eat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disappointed. Basically same game as original with better graphics but they rearranged some layouts just to rearrange the layouts which is annoying because original was just fine and we were use to it. Cannot save a run which is unforgivable. Bottom of cards are not shown during each battle so you have to mouse over them repeatedly to see them fully which gets very annoying. Fix these issues please.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wonder who was the clever team member who thought this is a PIECE OF $H!T GAME that doesn't allow you to restart the round during the fight with the Pyre, and if you lost - you just lost all your work. Super frustrating!!!! Uninstall after 500 hours and NEVER TOUCH AGAIN THIS PIECE OF...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meta progression feels slow and not overly meaningful. 5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much harder and more complex than monster train 1. If you play deckbuilders a lot and have time to really figure out the game, you might enjoy this; if you're employed, maybe skip this one",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "imagine monster train 1 but less fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Comparing this to Monster Train 1\r\n>Game is lacking most of the challenge/difficulty options, so it's much easier\r\n>Base system changes make the gameplay much less interesting mechanically\r\n>Enemy abilities prevent all but the most braindead strategy from working and you can't see which enemies you will get, so you always have to play exactly the same way. The game is incredibly easy (I've got a 65 winstreak on the highest difficulty and have won this game on the hardest setting with every clan combination, as you can see in my screenshots), but you're forced to do the same thing every time because e.g. floor silence or sweep enemies completely shut down any alternative ways of playing.\r\n>Horrible forced in indie references in the events\r\n>Events are so overpowered that if you draw one you just win instantly. Getting Dante basically just ends the run in a win.\r\n>Animations are slow even on the highest setting\r\n>Sound is still an issue because of the noise some enemies make when getting hit, especially since multiattack is so inflated compared to MT1\r\n>Terrible redditcore writing in forced story cutscenes where MT1 just had cool MtG style worldbuilding on card flavor\r\n\r\nIn general, it's an inferior product in every respect. There is no circumstance where you should buy this if you don't own MT1. Only if you've 100%'d MT1 and want more even if it is a downgrade should you consider this game.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Just... doesn't click like the prequel did.\n\nIt's the same core game mechanics, just with new types of cards (room/equips) and new sets of cards and enemies. But somehow it feels less engaging than Monster Train 1. There's a boatload more of interactions and effects (or so it feels at least) that make clear and concise planning difficult. Also, it ups the overall power level, together with aforementioned new card types adding new layers of synergy... which very quickly leads to a boom or bust gameplay where either you get those 3-5 cards that create a great synergy that fullclears bosses on the first floor without taking damage, or you don't and you just die to attrition as every boss makes their way into your pyre floor. I've not yet ever felt like there was a situation in between those extremes: that would be, a tight fight where careful planning and execution of your hand just barely nets you a victory. It's always either an auto win or an auto loss, solely dependent on whether you get (and then pick) the right cards and upgrades.\n\nFurthermore, the clan theming just feels... not as consistent as the previous ones. In Monster Train 1, you had the fiery zerk demons, the magefish, the green defense plant deck, the suicidally fanatic candles, etc... in Monster Train 2 you have... a wild mix of blue angels with a semi-conditional two-stat affecting buff spiel and a metric ton of movement spells that don't really synergize well, a wild mix of dragons that throw about greed and fire (I'll say, this is the only clan that actually felt consistent), a moon faction that mixes a supposed focus on spellcasting with random assassins and an overarching mechanic of making sure to draft that one card that will allow you to freely obsolete their entire 'moon phase' mechanic, fungi/uy that spam debuffs and a weird stack-unit spawn that is weirdly implemented as it is brokenly powerful and a frankenstein faction that goes all in on RNGing your way to victory withotu having a clear theme or kit beyond that.\nIt just doesn't feel right.\n\nAnd then there's the balance. No offense, but if you present a sufficiently complex deckbuilder like this, and your first run takes you straight to the final boss, something is off. And it gets worse when you then have some factions that will absolutely trivialize the game from fight 1 to 8, whilst others will be utterly dependent on RNGing the right drafts at start to even make it past fight 2. This becomes particularly visible when you pick up a newly unlocked faction for a first run on your highest covenant level (aka difficulty), trivially beat it, but then go back to one of the previous factions and repeatedly struggle through runs trying to do the same.\n\nOh, and you also get a light set of occasional story dialogue blurps that are forgettably generic dialogue to throw exposition at you, because apparently card-based roguelikes rely on their story to motivate players? \n\n\nOverall score: 4/10\nIt's not all bad, but I just don't see a reason to play this over any other contender in an arguably oversaturated genre, including it's predecessor.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I somehow cannot understand the positive reviews. It is more content on the first look but somehow the new enemy mechanics like resurrection etc demand a more specific gameplay style from you. I so often had runs which went smoothly just to be totally crushed by a certain type of enemy.\n\nMonster Train 1 also feels more polished, I think it is the better choice. Besides also having better writing and graphics.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "You can't reset fights by going to the main menu any more. That was my favorite part about the original game. A misplay/mis-input can brick your run. Ruins the experience as a second monitor game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The sequel has the exact same problems as the first game that make it only adequate as a roguleike deckbuilder. It fails to provide meaningful upgrades to the player to help reduce variance like the GOATS of this category do, like Slay the Spire.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just don't feel that it's an improvement over the first game.\nInitially I was super excited for \"more monster train\", but after having played it (and possibly because I played the first one sooo much) this release didn't strike that same excitement I was expecting.\nIt's not bad, but I'd definitely recommend the MT1 first.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's moostly fun but it's a little too player-hostile I think. Winning a run on covenant 10 so far really feels like \"get lucky with the exact right amount of greed and power given to you at the start of the run and also already know exactly what the upcoming bosses will be and if you want to do the superboss you also have to get some overpowered crap from an event as opposed to most of the events which do basically nothing. Lots of the things that are obvious holdovers from the first game are absolutely useless. Something like half the relics are almost useless (scorched steel...) and certain others are better than boss relics... I love how this game looks, I love how it sounds, I even mostly liked the story, but slamming my head against the wall until the wall decides to be suddenly softer this time to get a covenant 10 win is crazy. The scaling about...halfway up, is fine, but at like...8 or so, the game REALLY stops having ANY wiggle room for not conforming to exactly what you should have built. Maybe nerf some things and give the option to revert it in steps throughout the run for a score bonus or as part of a cov11? but as it stands now it's a little too much. Also most bosses that get stronger when they climb floors (most of them) have effects that are so insanely overtuned that if you do not defeat them on the bottom floor you lose with no option to recover. Similar for the 2 new bosses, which are otherwise exemplars of the visual and audio treat that this game otherwise is! Get some balance fixes for both player stuff and enemies, and tweak down the difficulty SLIGHTLY at least post cov-8 or so and this game is a treat. As it stands right now...eeeeeeeh?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's shiny and gives an impression of depth but I don't find many of my decisions very interesting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rather than a love letter this game is a screed compared to the first one. The mechanics are not interesting and all of the  new clans can be boiled down to the same play style with minor differences. The interplay between clans is likewise uninteresting because of this factor. This game plays like an idle game for the first 30-50 minutes of a run to build up into nothing spectacular or interesting. Huge downgrade from the first.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I dunno, i'm just not into this one. It seems exceedingly meh. I've loved other games in the genre, like slay the spire. But I'm always feeling like this game is lacking in some way when I'm playing it. It's like systems come across as if there is more to them then other roguelike deckbuilders commonly have, but at the same time it feel like nothing changes when you take advantage of them.\n\nIn other words, whenever I play this, I always feel like playing other Roguelike Deckbuilders I own. Wasn't worth the $30 I spent on it. Feels like an $8 game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is about 0 reasons to keep playing after you finished a few runs with ease. You will fight the same enemies in the same order and use the same strategy every time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I LIKE NUMBER ONE BETTER IT WAS MORE BALENCE AND FREE WILL\nNUMBER 2\nHAS NO HELL RUSH \nAND THERE A DP CAP IF YOU DO NOT MEET IT \nYOU LOSE AT THE LAST 2 STAGES \nWITCH MAKES TANKS BUILDS \nUSELESS BECUSS MINIS WILL JUST BLOW UP YOUR CRYSTAL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUN GAME! lots of builds and different enemies to fight that make you really think turn by turn...\r\nTHE F*CKING THE \"RESTART BATTLE\" AND \"ABANDON RUN\" BUTTONS SHOULD NOT BE RIGHT NEXT TO EACH OTHER WAISTING A GOD DAMN HOUR ALMOST EEKING OUT A WIN TO F*CKING MIS-CLICK.\r\n\r\nI hope the devs read this and move the buttons. This ruined my day so bad I slept all day and didn't eat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disappointed. Basically same game as original with better graphics but they rearranged some layouts just to rearrange the layouts which is annoying because original was just fine and we were use to it. Cannot save a run which is unforgivable. Bottom of cards are not shown during each battle so you have to mouse over them repeatedly to see them fully which gets very annoying. Fix these issues please.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wonder who was the clever team member who thought this is a PIECE OF $H!T GAME that doesn't allow you to restart the round during the fight with the Pyre, and if you lost - you just lost all your work. Super frustrating!!!! Uninstall after 500 hours and NEVER TOUCH AGAIN THIS PIECE OF...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meta progression feels slow and not overly meaningful. 5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much harder and more complex than monster train 1. If you play deckbuilders a lot and have time to really figure out the game, you might enjoy this; if you're employed, maybe skip this one",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "imagine monster train 1 but less fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Comparing this to Monster Train 1\r\n>Game is lacking most of the challenge/difficulty options, so it's much easier\r\n>Base system changes make the gameplay much less interesting mechanically\r\n>Enemy abilities prevent all but the most braindead strategy from working and you can't see which enemies you will get, so you always have to play exactly the same way. The game is incredibly easy (I've got a 65 winstreak on the highest difficulty and have won this game on the hardest setting with every clan combination, as you can see in my screenshots), but you're forced to do the same thing every time because e.g. floor silence or sweep enemies completely shut down any alternative ways of playing.\r\n>Horrible forced in indie references in the events\r\n>Events are so overpowered that if you draw one you just win instantly. Getting Dante basically just ends the run in a win.\r\n>Animations are slow even on the highest setting\r\n>Sound is still an issue because of the noise some enemies make when getting hit, especially since multiattack is so inflated compared to MT1\r\n>Terrible redditcore writing in forced story cutscenes where MT1 just had cool MtG style worldbuilding on card flavor\r\n\r\nIn general, it's an inferior product in every respect. There is no circumstance where you should buy this if you don't own MT1. Only if you've 100%'d MT1 and want more even if it is a downgrade should you consider this game.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Just... doesn't click like the prequel did.\n\nIt's the same core game mechanics, just with new types of cards (room/equips) and new sets of cards and enemies. But somehow it feels less engaging than Monster Train 1. There's a boatload more of interactions and effects (or so it feels at least) that make clear and concise planning difficult. Also, it ups the overall power level, together with aforementioned new card types adding new layers of synergy... which very quickly leads to a boom or bust gameplay where either you get those 3-5 cards that create a great synergy that fullclears bosses on the first floor without taking damage, or you don't and you just die to attrition as every boss makes their way into your pyre floor. I've not yet ever felt like there was a situation in between those extremes: that would be, a tight fight where careful planning and execution of your hand just barely nets you a victory. It's always either an auto win or an auto loss, solely dependent on whether you get (and then pick) the right cards and upgrades.\n\nFurthermore, the clan theming just feels... not as consistent as the previous ones. In Monster Train 1, you had the fiery zerk demons, the magefish, the green defense plant deck, the suicidally fanatic candles, etc... in Monster Train 2 you have... a wild mix of blue angels with a semi-conditional two-stat affecting buff spiel and a metric ton of movement spells that don't really synergize well, a wild mix of dragons that throw about greed and fire (I'll say, this is the only clan that actually felt consistent), a moon faction that mixes a supposed focus on spellcasting with random assassins and an overarching mechanic of making sure to draft that one card that will allow you to freely obsolete their entire 'moon phase' mechanic, fungi/uy that spam debuffs and a weird stack-unit spawn that is weirdly implemented as it is brokenly powerful and a frankenstein faction that goes all in on RNGing your way to victory withotu having a clear theme or kit beyond that.\nIt just doesn't feel right.\n\nAnd then there's the balance. No offense, but if you present a sufficiently complex deckbuilder like this, and your first run takes you straight to the final boss, something is off. And it gets worse when you then have some factions that will absolutely trivialize the game from fight 1 to 8, whilst others will be utterly dependent on RNGing the right drafts at start to even make it past fight 2. This becomes particularly visible when you pick up a newly unlocked faction for a first run on your highest covenant level (aka difficulty), trivially beat it, but then go back to one of the previous factions and repeatedly struggle through runs trying to do the same.\n\nOh, and you also get a light set of occasional story dialogue blurps that are forgettably generic dialogue to throw exposition at you, because apparently card-based roguelikes rely on their story to motivate players? \n\n\nOverall score: 4/10\nIt's not all bad, but I just don't see a reason to play this over any other contender in an arguably oversaturated genre, including it's predecessor.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I somehow cannot understand the positive reviews. It is more content on the first look but somehow the new enemy mechanics like resurrection etc demand a more specific gameplay style from you. I so often had runs which went smoothly just to be totally crushed by a certain type of enemy.\n\nMonster Train 1 also feels more polished, I think it is the better choice. Besides also having better writing and graphics.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "You can't reset fights by going to the main menu any more. That was my favorite part about the original game. A misplay/mis-input can brick your run. Ruins the experience as a second monitor game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The sequel has the exact same problems as the first game that make it only adequate as a roguleike deckbuilder. It fails to provide meaningful upgrades to the player to help reduce variance like the GOATS of this category do, like Slay the Spire.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just don't feel that it's an improvement over the first game.\nInitially I was super excited for \"more monster train\", but after having played it (and possibly because I played the first one sooo much) this release didn't strike that same excitement I was expecting.\nIt's not bad, but I'd definitely recommend the MT1 first.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's moostly fun but it's a little too player-hostile I think. Winning a run on covenant 10 so far really feels like \"get lucky with the exact right amount of greed and power given to you at the start of the run and also already know exactly what the upcoming bosses will be and if you want to do the superboss you also have to get some overpowered crap from an event as opposed to most of the events which do basically nothing. Lots of the things that are obvious holdovers from the first game are absolutely useless. Something like half the relics are almost useless (scorched steel...) and certain others are better than boss relics... I love how this game looks, I love how it sounds, I even mostly liked the story, but slamming my head against the wall until the wall decides to be suddenly softer this time to get a covenant 10 win is crazy. The scaling about...halfway up, is fine, but at like...8 or so, the game REALLY stops having ANY wiggle room for not conforming to exactly what you should have built. Maybe nerf some things and give the option to revert it in steps throughout the run for a score bonus or as part of a cov11? but as it stands now it's a little too much. Also most bosses that get stronger when they climb floors (most of them) have effects that are so insanely overtuned that if you do not defeat them on the bottom floor you lose with no option to recover. Similar for the 2 new bosses, which are otherwise exemplars of the visual and audio treat that this game otherwise is! Get some balance fixes for both player stuff and enemies, and tweak down the difficulty SLIGHTLY at least post cov-8 or so and this game is a treat. As it stands right now...eeeeeeeh?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's shiny and gives an impression of depth but I don't find many of my decisions very interesting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rather than a love letter this game is a screed compared to the first one. The mechanics are not interesting and all of the  new clans can be boiled down to the same play style with minor differences. The interplay between clans is likewise uninteresting because of this factor. This game plays like an idle game for the first 30-50 minutes of a run to build up into nothing spectacular or interesting. Huge downgrade from the first.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I dunno, i'm just not into this one. It seems exceedingly meh. I've loved other games in the genre, like slay the spire. But I'm always feeling like this game is lacking in some way when I'm playing it. It's like systems come across as if there is more to them then other roguelike deckbuilders commonly have, but at the same time it feel like nothing changes when you take advantage of them.\n\nIn other words, whenever I play this, I always feel like playing other Roguelike Deckbuilders I own. Wasn't worth the $30 I spent on it. Feels like an $8 game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is about 0 reasons to keep playing after you finished a few runs with ease. You will fight the same enemies in the same order and use the same strategy every time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I LIKE NUMBER ONE BETTER IT WAS MORE BALENCE AND FREE WILL\nNUMBER 2\nHAS NO HELL RUSH \nAND THERE A DP CAP IF YOU DO NOT MEET IT \nYOU LOSE AT THE LAST 2 STAGES \nWITCH MAKES TANKS BUILDS \nUSELESS BECUSS MINIS WILL JUST BLOW UP YOUR CRYSTAL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUN GAME! lots of builds and different enemies to fight that make you really think turn by turn...\r\nTHE F*CKING THE \"RESTART BATTLE\" AND \"ABANDON RUN\" BUTTONS SHOULD NOT BE RIGHT NEXT TO EACH OTHER WAISTING A GOD DAMN HOUR ALMOST EEKING OUT A WIN TO F*CKING MIS-CLICK.\r\n\r\nI hope the devs read this and move the buttons. This ruined my day so bad I slept all day and didn't eat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disappointed. Basically same game as original with better graphics but they rearranged some layouts just to rearrange the layouts which is annoying because original was just fine and we were use to it. Cannot save a run which is unforgivable. Bottom of cards are not shown during each battle so you have to mouse over them repeatedly to see them fully which gets very annoying. Fix these issues please.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wonder who was the clever team member who thought this is a PIECE OF $H!T GAME that doesn't allow you to restart the round during the fight with the Pyre, and if you lost - you just lost all your work. Super frustrating!!!! Uninstall after 500 hours and NEVER TOUCH AGAIN THIS PIECE OF...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meta progression feels slow and not overly meaningful. 5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much harder and more complex than monster train 1. If you play deckbuilders a lot and have time to really figure out the game, you might enjoy this; if you're employed, maybe skip this one",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "imagine monster train 1 but less fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Comparing this to Monster Train 1\r\n>Game is lacking most of the challenge/difficulty options, so it's much easier\r\n>Base system changes make the gameplay much less interesting mechanically\r\n>Enemy abilities prevent all but the most braindead strategy from working and you can't see which enemies you will get, so you always have to play exactly the same way. The game is incredibly easy (I've got a 65 winstreak on the highest difficulty and have won this game on the hardest setting with every clan combination, as you can see in my screenshots), but you're forced to do the same thing every time because e.g. floor silence or sweep enemies completely shut down any alternative ways of playing.\r\n>Horrible forced in indie references in the events\r\n>Events are so overpowered that if you draw one you just win instantly. Getting Dante basically just ends the run in a win.\r\n>Animations are slow even on the highest setting\r\n>Sound is still an issue because of the noise some enemies make when getting hit, especially since multiattack is so inflated compared to MT1\r\n>Terrible redditcore writing in forced story cutscenes where MT1 just had cool MtG style worldbuilding on card flavor\r\n\r\nIn general, it's an inferior product in every respect. There is no circumstance where you should buy this if you don't own MT1. Only if you've 100%'d MT1 and want more even if it is a downgrade should you consider this game.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Just... doesn't click like the prequel did.\n\nIt's the same core game mechanics, just with new types of cards (room/equips) and new sets of cards and enemies. But somehow it feels less engaging than Monster Train 1. There's a boatload more of interactions and effects (or so it feels at least) that make clear and concise planning difficult. Also, it ups the overall power level, together with aforementioned new card types adding new layers of synergy... which very quickly leads to a boom or bust gameplay where either you get those 3-5 cards that create a great synergy that fullclears bosses on the first floor without taking damage, or you don't and you just die to attrition as every boss makes their way into your pyre floor. I've not yet ever felt like there was a situation in between those extremes: that would be, a tight fight where careful planning and execution of your hand just barely nets you a victory. It's always either an auto win or an auto loss, solely dependent on whether you get (and then pick) the right cards and upgrades.\n\nFurthermore, the clan theming just feels... not as consistent as the previous ones. In Monster Train 1, you had the fiery zerk demons, the magefish, the green defense plant deck, the suicidally fanatic candles, etc... in Monster Train 2 you have... a wild mix of blue angels with a semi-conditional two-stat affecting buff spiel and a metric ton of movement spells that don't really synergize well, a wild mix of dragons that throw about greed and fire (I'll say, this is the only clan that actually felt consistent), a moon faction that mixes a supposed focus on spellcasting with random assassins and an overarching mechanic of making sure to draft that one card that will allow you to freely obsolete their entire 'moon phase' mechanic, fungi/uy that spam debuffs and a weird stack-unit spawn that is weirdly implemented as it is brokenly powerful and a frankenstein faction that goes all in on RNGing your way to victory withotu having a clear theme or kit beyond that.\nIt just doesn't feel right.\n\nAnd then there's the balance. No offense, but if you present a sufficiently complex deckbuilder like this, and your first run takes you straight to the final boss, something is off. And it gets worse when you then have some factions that will absolutely trivialize the game from fight 1 to 8, whilst others will be utterly dependent on RNGing the right drafts at start to even make it past fight 2. This becomes particularly visible when you pick up a newly unlocked faction for a first run on your highest covenant level (aka difficulty), trivially beat it, but then go back to one of the previous factions and repeatedly struggle through runs trying to do the same.\n\nOh, and you also get a light set of occasional story dialogue blurps that are forgettably generic dialogue to throw exposition at you, because apparently card-based roguelikes rely on their story to motivate players? \n\n\nOverall score: 4/10\nIt's not all bad, but I just don't see a reason to play this over any other contender in an arguably oversaturated genre, including it's predecessor.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I somehow cannot understand the positive reviews. It is more content on the first look but somehow the new enemy mechanics like resurrection etc demand a more specific gameplay style from you. I so often had runs which went smoothly just to be totally crushed by a certain type of enemy.\n\nMonster Train 1 also feels more polished, I think it is the better choice. Besides also having better writing and graphics.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "You can't reset fights by going to the main menu any more. That was my favorite part about the original game. A misplay/mis-input can brick your run. Ruins the experience as a second monitor game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The sequel has the exact same problems as the first game that make it only adequate as a roguleike deckbuilder. It fails to provide meaningful upgrades to the player to help reduce variance like the GOATS of this category do, like Slay the Spire.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just don't feel that it's an improvement over the first game.\nInitially I was super excited for \"more monster train\", but after having played it (and possibly because I played the first one sooo much) this release didn't strike that same excitement I was expecting.\nIt's not bad, but I'd definitely recommend the MT1 first.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's moostly fun but it's a little too player-hostile I think. Winning a run on covenant 10 so far really feels like \"get lucky with the exact right amount of greed and power given to you at the start of the run and also already know exactly what the upcoming bosses will be and if you want to do the superboss you also have to get some overpowered crap from an event as opposed to most of the events which do basically nothing. Lots of the things that are obvious holdovers from the first game are absolutely useless. Something like half the relics are almost useless (scorched steel...) and certain others are better than boss relics... I love how this game looks, I love how it sounds, I even mostly liked the story, but slamming my head against the wall until the wall decides to be suddenly softer this time to get a covenant 10 win is crazy. The scaling about...halfway up, is fine, but at like...8 or so, the game REALLY stops having ANY wiggle room for not conforming to exactly what you should have built. Maybe nerf some things and give the option to revert it in steps throughout the run for a score bonus or as part of a cov11? but as it stands now it's a little too much. Also most bosses that get stronger when they climb floors (most of them) have effects that are so insanely overtuned that if you do not defeat them on the bottom floor you lose with no option to recover. Similar for the 2 new bosses, which are otherwise exemplars of the visual and audio treat that this game otherwise is! Get some balance fixes for both player stuff and enemies, and tweak down the difficulty SLIGHTLY at least post cov-8 or so and this game is a treat. As it stands right now...eeeeeeeh?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's shiny and gives an impression of depth but I don't find many of my decisions very interesting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rather than a love letter this game is a screed compared to the first one. The mechanics are not interesting and all of the  new clans can be boiled down to the same play style with minor differences. The interplay between clans is likewise uninteresting because of this factor. This game plays like an idle game for the first 30-50 minutes of a run to build up into nothing spectacular or interesting. Huge downgrade from the first.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I dunno, i'm just not into this one. It seems exceedingly meh. I've loved other games in the genre, like slay the spire. But I'm always feeling like this game is lacking in some way when I'm playing it. It's like systems come across as if there is more to them then other roguelike deckbuilders commonly have, but at the same time it feel like nothing changes when you take advantage of them.\n\nIn other words, whenever I play this, I always feel like playing other Roguelike Deckbuilders I own. Wasn't worth the $30 I spent on it. Feels like an $8 game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is about 0 reasons to keep playing after you finished a few runs with ease. You will fight the same enemies in the same order and use the same strategy every time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I LIKE NUMBER ONE BETTER IT WAS MORE BALENCE AND FREE WILL\nNUMBER 2\nHAS NO HELL RUSH \nAND THERE A DP CAP IF YOU DO NOT MEET IT \nYOU LOSE AT THE LAST 2 STAGES \nWITCH MAKES TANKS BUILDS \nUSELESS BECUSS MINIS WILL JUST BLOW UP YOUR CRYSTAL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUN GAME! lots of builds and different enemies to fight that make you really think turn by turn...\r\nTHE F*CKING THE \"RESTART BATTLE\" AND \"ABANDON RUN\" BUTTONS SHOULD NOT BE RIGHT NEXT TO EACH OTHER WAISTING A GOD DAMN HOUR ALMOST EEKING OUT A WIN TO F*CKING MIS-CLICK.\r\n\r\nI hope the devs read this and move the buttons. This ruined my day so bad I slept all day and didn't eat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disappointed. Basically same game as original with better graphics but they rearranged some layouts just to rearrange the layouts which is annoying because original was just fine and we were use to it. Cannot save a run which is unforgivable. Bottom of cards are not shown during each battle so you have to mouse over them repeatedly to see them fully which gets very annoying. Fix these issues please.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wonder who was the clever team member who thought this is a PIECE OF $H!T GAME that doesn't allow you to restart the round during the fight with the Pyre, and if you lost - you just lost all your work. Super frustrating!!!! Uninstall after 500 hours and NEVER TOUCH AGAIN THIS PIECE OF...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meta progression feels slow and not overly meaningful. 5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much harder and more complex than monster train 1. If you play deckbuilders a lot and have time to really figure out the game, you might enjoy this; if you're employed, maybe skip this one",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "imagine monster train 1 but less fun",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}