{
  "positive": [
    {
      "review": "Resource management, strategy, timing, careful preparation, clash and RNG.\r\nThis game is held together by magic and chaos.  10/10",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "The King is Watching is a clever strategy-puzzle hybrid with charming art and satisfying bite-sized gameplay loops, offering a fun variety of options each run.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Easy to learn but tough to master management game. Lots of fun and replayability. Could use more maps though - 2 are not enough",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A mouse and keyboard game that is extremely addicting but difficult too for myself. A fan of roguelikes but unable figure out the meta or if I'm just constantly getting screwed with RNG. Either way I keep unlocking things and SLOWLY progressing. There are tons of options I haven't even tried so this should occupy some free time for a while yet.\n\nI don't know what to compare this game to though... a tiny city builder space management puzzle with tower defense? It seems unique and weird enough but GRINDY ass hell. There is a lot to unlock at least so that should keep it interesting for a while.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My favorite game of this year. SO UNIQUE. I love the afk/chill aspect to it but at the same time there is a lot of strategy. The diff buildings and kings lead to so many unique strategies and play styles I see myself having 200+h after more maps are out tbh. Tried the demo as well and can see how much work the devs have put in.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really brilliant gameplay design, so simple but so impressive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very unique and investing mechanics with lots of thinking",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game caught my eye, it is very unique and interesting, complicated and difficult at the beginning, but perfectly designed",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you don't speed up the levels, each one can take about an hour to get through. And though there's a LOT of kings, a lot of levels, and a ton of different achievements you can get - I do enjoy the game a lot. Once you get in and see everything that you can upgrade and the options for replayability it can seem mildly overwhelming. Don't give up! Stick with it, have patience, and go at your own pace. \r\n\r\nBest of luck out there - the king is always watching!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i love this game,deep and immersive rts roguelike,one of a kind,you need to play this,you will not regret it,woth every penny,i'm in 40 + hours and still want to play more.10 stars for developers!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun, lot of potential, can be a little chaotic even without everything unlocked theres a lot of rng that can come together to kill your run, but I had a lot of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a very fresh take on base building. You will build up a base but only have part of it active depending on which buildings are under your \"gaze\" area. This introduces a fun element of layout to base building that isn't the traditional placement synergy.\r\nThe combat mechanics are auto-battlers, your only control is which unit types you produce and how you upgrade them, which gives you different ways to play runs.\r\nMy only real problem is that many of the unit types are near useless as the difficulty goes up, but that's a feature of chasing the hardest modes I guess",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the most addictive games I have ever played and I have only discovered about 10% of what I can do. I would highly recommend. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played a over 12 hours of The King is Watching so far. I enjoy the game mechanics, music, and progression. I plan to keep playing over the holiday break.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely a fun game to spend your spare time to play a round or two, beaten both maps up to threat level 7, does get a little bit repetitive after a while though. Hope to see more units and levels in future updates :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the game for quite awhile and after unlocking the majority of talents and kings I kind of fell off. Still a great game for a lengthy amount of time. Hopefully the new volcano map makes me want to come back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "definitely my Pick for the coming Steam Awards, fun Gameplay, good feels and most importantly you can feel the Love put into this :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun relaxing strategy game would highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really engaging game. Simple mechanics but you can go really deep with optimizing your builds. The roguelite aspect with a city builder is a great concept!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What do I call this game?\nAn RTS? Tower Defense? City Building? Management?\nDoesn't really matter because it's fun!\nThe RNG of what troops and buildings you get to protect your precious walls from enemy destruction keeps this game replayable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has limitless potential, it is a great game that I will enjoy further, it is a very unique Tower Defense/City Management/Army Manager Hybrid game I've ever touched. It is a grindy game but I think the grind is going to be fun. The meta progression is also super neat IMO. Thanks for the read :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game with awesome meta progression and unigue playeble characters. Good challenge and reward for it. Hope game get more updates in future or second part.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Takes a bit to get the understanding of the games mechanics down but once you start grasping a play style its incredibly fun. an amazing blend of tower defense and resource management",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The King is Watching is an innovative new roguelike with an addictive gameplay loop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting combination of economy, puzzle, auto battler, and roguelite elements that I think will keep me entertained for many playthroughs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game wraps up several of my favorite mechanics into one challenging experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There was a demo available as of writing but I had to go into my Store recommendations to find it. If you play the demo first, the full game will give you a bunch of early rewards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the  demo so much I'm glad the game was finally released. -I  love the gameplay, the challenge, and the little interactions and humor.  Immediately approachable gameplay but with lots of combinations and depth to keep you going for a long time.  Strategic fun, with lots of 'one more game' energy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game with lots of lvls and challenges to kill time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am very bad at this game even after almost 70 hours of playtime. But its so much fun and feels really good to play. The unique mix of roguelike/resource management/grid-based strategy just really tickles the brain such that I'm having fun even when I'm constantly losing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its refreshing and creative such building game with a touch of toguelike. The late stages such as lv 9 and 10 is very challenging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is catching, good game for Steamdeck! New gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The core mechanic is brilliant: your buildings only work when you look at them. Your \"gaze\" is a literal beam of light on the grid. If you aren't looking at the farm, no food is produced. If you aren't looking at the barracks, no soldiers are trained.\n\nWhy it's addictive:\nConstant Vigilance: You have to constantly sweep your vision across your kingdom to keep the economy flowing. It’s a high-pressure test of your attention management.\n\nThe \"One More Run\" Factor: It’s a roguelite. You will die, upgrade your castle/stats, and jump right back in to try a new strategy.\n\nVisuals: Clean, charming pixel art that remains readable even when the screen is full of enemies.\n\nCons: No save & quit feature during a run (yet). You need to commit 30-45 mins per session.\n\nVerdict:\nIf you enjoy optimizing workflows and panicked resource management, this is a must-buy. Simple to understand, hard to master, and impossible to put down.\n\nScore: 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool management game! what makes it special is the \"royal gaze\" mechanic. because only the base tiles inside your royal gaze function, your base is like a puzzle that you constantly have to reconfigure and swap around to fit your ever-changing needs. in that way, it's by no means an idle game, but rather demands your constant attention if you want to survive! love the art style too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very unique game with a simple premise: Watch your people to make them work. Difficult to master and near endless replay-ability. Build a lil kingdom, manage a few resources, and use your mortally-limited eyesight wisely. The art style is also very charming. No genuine complaints from me, I'm just bad at video games. Definitely a recommended purchase.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Nice and chill yet a addictive little game thats have made my time fly away far to many times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the most innovative \"Tower Defence\" style games I've played.\r\n\r\nIt achieves that, by combining the following elements:\r\n1. The \"King's Gaze\" — which also explains the title's \"The King is WATCHING\" part — which allows building inside your base to become activated\r\n2. Individual kings with their abilities and passive effects, and most importantly, with their individual gaze\r\n3. Various spells that affect your base, your units, or the enemies\r\n4. A plethora of units with their pros and cons, active and passive abilities, allowing for various combinations\r\n5. Advisors, who essentially offer additional bonuses, who add another layer of complexity\r\n6. Upgrades and unlocks for new buildings, units, spell damage, etc\r\n\r\nAll these serve one purpose: to ensure that your small kingdom is safeguarded against wave after wave of monstrous enemies. And I'm not even counting the many modifications tied to the map, which modifies the enemies spawned, as well as the bosses, coupled with the difficulty levels.\r\n\r\nFor its price, the game is worth it. Although there are only 2 levels available (a 3rd on the making), and around 6 kings to choose from, if you're into \"Tower Defence\", you will love it. The developers have created something unique. And uniqueness should be awarded.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am not usually a roguelike fan, but The King is Watching is an interesting blend of games that come together to create the most fun Indie I played in 2025. A very smooth progression system once you get the hang of the base loop that isn't too punishing for failed runs. I also enjoy the art style.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but def needs more content (maps, variety, etc.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like the how differently this game can go each time you play it. At the higher difficulty levels you do tend to get driven towards particular strategies, but I think that's the only real weakness to the game. Everything else is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would not pick it by myself, but there was a free demo... and I was hooked.\nVery interesting gameplay, a lot of variations, right mix of randomness and skill.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, even tho i have been only playing for a couple of hours, the visuals and gameplay are both really nice and interestinhg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and good balanc for casual play and hardcore optimazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A hidden gem worth watching. If you enjoy clever strategy wrapped in a charming pixel-art style, The King is Watching is a fantastic pick. The game takes a simple premise, building and defending your kingdom under the watchful eye of the king, and turns it into an addictive loop of decision-making and resource management. Great replayability, no two runs feel the same. I’ve already sunk hours into experimenting with different strategies, and I’m still discovering new ways to play.\n\nOverall, The King is Watching is easy to learn but hard to master, and that’s what makes it so rewarding. If you’re into indie strategy games with charm and depth, this one deserves a spot in your library.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addicting, unique and fun to play no build is meta anything can work brilliant game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR: The King Is Watching is witty, elegant, strategic, addictive and somehow endlessly fresh. \n\nI don’t write reviews. I don’t even finish games. Yet here I am, not only having 100% completed The King Is Watching, but immediately launching run after run like a medieval lab rat who refuses to leave the maze.\nWhat makes it so good?\nWell, it’s delightfully deceptive. It looks simple — a few resource tracks, a charming medieval vibe, and a king who stares at you like he knows you’re about to mess something up. But under the hood? It’s a low-barrier-to-entry, sky-high-skill-ceiling machine. Anyone can start a run in seconds… but mastering it feels like earning a PhD in Kingdom Mismanagement.\nThe magic is in the balance.\nThere’s just enough randomness to keep you on your toes, but enough predictability that it never feels unfair. The scenarios are humorous without being silly and the whole game has that perfect “I can definitely do better next time” energy that eats entire evenings.\nAnd the artefacts?\nGenuinely brilliant.\nSome of them are absolute pants — the kind of relics that make you stare at the screen and mutter, “Well… that’s the run ruined.” But that’s exactly why the good ones feel so good. When you find an artefact that transforms your whole run, you feel it — suddenly you're adapting your entire strategy, leaning into new synergies, and pretending this was your plan all along.\nUnlike most roguelites, the early game never becomes boring.\nI don’t know how they’ve done it, but even after tens of hours, the first few minutes of a run are still interesting. No autopilot. No slog. No “here we go again” start. Each run feels like a fresh little puzzle you want to poke at.\nCompared to other roguelites like Nuclear Throne or Void War, this game sits in a beautiful sweet spot:\neasier to pick up,\nharder to master,\nshorter runs when you want them,\nbrutal long grinds when you don’t realise lunch became dinner.\n\nAnd then there’s the crown jewels:\nThe challenges and that cursed, stubborn, infuriating Deforestation challenge.\nI swear this achievement is personally mocking me. I’ve spent hours chasing it, convinced the stars would align. When I finally got it? I celebrated like I’d won a Nobel Prize… and then immediately started another run because apparently I enjoy suffering.\n\nLong live the King.\nAnd long live my inability to stop playing this perfect little game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I need to post a review, so why not do it for a game i love. I still find myself coming back for a run here and there and i end up sitting down and losing an hour before i realize it. Please do yourself a favor and pick this one up, and then proceed to enjoy it even more later",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An interesting take on a sort of base-building / auto-battler / tower defense roguelite.  It has the right amount of challenge to it, a solid progression system, and a variety of different starting powers to choose from to keep it fresh.  A good deal at its base price of $15, and a great deal at its sale price of $10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. There are a few balancing issues in the game and it can be a little repetitive. \n\nBut the game is still being updated and each king comes with its own gaze and spells.\n\nIt used to be frustrating before there was a run save feature, but thankfully that was updated so now I can just play and quit without needing to commit time to finishing a run.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game starts easy but becomes pretty hard later on. Sadly there is a pretty clear meta.Still fun though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice rogue-lite tower defense game with some unique mechanics. Not really genre-breaking and probably overtly complex on higher difficulty levels, yet very good value for its price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very nice and relaxing game with a unique mecanic making the gameplay feel fresh for any 2d game enjoyers that want a change of pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very creative combination of genres and a great game for a small studio already!\nHyped for future updates^^!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a great game cant wait for more updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Un juego de estrategia y construcción de reinos con un toque único: el rey está siempre vigilando!\nDeberás gestionar tus recursos y planificar bien tus movimientos para mantener tu reino en movimiento y a tus enemigos a raya. Con gráficos pixelados y jugabilidad adictiva, THE KING IS WATCHING es un desafío divertido que te mantendrá entretenido durante horas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A strange and brilliant idea that is well executed. It has that \"one more wave\" thing about it. It's charming and demanding. I like it a lot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing settlement management mechanics and replayability!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Clever mix between \"deck\" (castle) building, resource management and auto-battler mechanics.\nThe early game can be tough while you’re learning the ropes and it seems like a few upgrades are essential before things really get going.\nThere are plenty of viable strategies, though some units and builds do feel a bit weaker than others.\nOverall, this game has strong replay value, nice artwork, is chill and offers a genuinely enjoyable experience.\n\nDefinitely well worth the price !\n\nI'm looking forward to the next update.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall: great game and great value\n\nThis one has been a lot of fun. It's a strategy roguelike with some unique concepts and a ton of strategy, puzzle and resource management challenges all together. There are many effective strategies especially as you unlock more leaders and council members. \n\nMy only gripe would be that it was more challenging to do the first few levels to start unlocking things than it was to continue to progress after that. There is a learning curve due to the uniqueness of the game.\n\nBut overall it's fun and I was happy to have some challenge. More content would be nice but you're already getting a ton for 15.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its pretty interesting and addicting game, they managed to combine the king building and roguelite and make it fun. My only complain its the threat levels after 5 forward feel kind more bullshit difficult than a fun challenge",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best rogue-lites I've played in years. It's unique as heck being a City-builder/tower defense game, but you shouldn't go into it expecting it to be just one on them. Static defences are not the main point, nor are they interesting if you ask me, Units make TDs fun. And in this game you get to mash them together. The first few runs, you won't win. Not even on the easiest unless you already looked up a guide. It's a resource-management game like other city-builders, but then when you figure out what to harvest to produce units and how much, you'll get better, you can get more challenging waves for bigger rewards, you unlock more upgrades that are not just the cookie-cutter +1% damage or resource gathering speed most Roguelite games have as the Meta progression, here the Meta upgrades just kickstart fast into the 'midgame' basically and give you more options to play with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. Gives me the nostalgia of playing adobe flash games, while being higher quality and very original. Worth adding to your collection 100%",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and more strategy intense the longer played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I picked this up expecting a chill rogue-like, and honestly? It’s surprisingly really fun. Instead of the usual button-mashing, this one leans more into strategy — and the core mechanic is genius. Your kingdom literally doesn’t function unless the king’s eyes are on it, and that idea shapes everything you do. It’s weird, clever, and way more addictive than I anticipated.\n\nYou start with simple, almost bare-bones builds — just enough to maybe scrape your way to the first boss. But the moment you fall (and you will), the game opens up. Suddenly there’s a whole upgrade tree for the king’s “eyes”: more troops, more build options, more variety. The early RNG is limited because of that progression path, but it feels intentional — like the game is teaching you its rules before letting you break them.\n\nFor the price, the replayability is honestly impressive. There’s just enough randomness to make every run feel different, but not so much that you’re relying on luck. It’s refreshing to see a smaller developer put out something this polished, strategic, and charming.\n\nHopefully future updates bring even more variety — expanded upgrade trees, additional counsel members, new kings, and definitely more locations and bosses. The foundation is strong enough that DLC or content patches could make this game explode in the best way.\n\nIf you want a calmer rogue-like with smart mechanics and satisfying growth, this one is absolutely worth supporting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So I just finished this game 100% and wanted to share some thoughts in the case any dev ever reads this, if you are looking at this and asking yourself if you should give it a try then the answer is definitly YES, it is a fantastic game and you should definitly try the demo (it still shows up when I search for it but it doesnt send me to its page but the main game site? hopefully it gets fixed).\n\nDont take this in a negative way, it just comes much easier to me to point out lacking points/things that could be improved rather than naming the positive points (which the biggest part of the game is) and the fact that I thought the game was good enough for me to 100% it should speak for itself:\n\n1. Like most roguelikes, this game also features different \"ascension levels\" which increases the difficulty of the game each time and you unlock the next upon beating the last one. There are a total of 10 different ones, with 3 being the \"neutral\" one where neither the player nor the enemy gets any buffs. Now there are 2 of the 10 that feel really bad. namely the 6th and the 10th. The  6th one is boring because the enemy just gets 40% more hp with no cool twist on the game mechanics or other stuff like the other levels before. But the worst is definitly the 10th. Not only is the added difficuly of the final level just the enemy getting more hp and more dmg, but it just REMOVES the added diffculty of the 9th lvl, being the player unable to move building once placed. It just kinda feels bad to reach the final difficulty and then you see what it actually does (also would be nice if difficulty would carry over between the different maps so you dont have to grind through the lower levels just to try the highest difficulty if you already reached that on the other map)\n\n2. Regarding boss design, it really feels bad that basically all t1/t2 bosses have massiv aoe attacks (especially on the graveyard map) this means on higher difficulty many of the melee or even range units become useless since they would just get onetapped by the boss. So the player focuses heavily on single tanky units which kinda ruins build differsity and makes many runs feels sameish.\n\n3. It would be really nice to have a buildable undead unit for veteran/elite tier. Playing alucard on lower difficulty feels ok and you can simply amass and upgrade your undead with his abilites and reach critical mass, but on higher difficulties they die very easily. To reach t4 undead you need to use his second ability 3 times on the same units but they just die so easily since the lower tier ones are all melee. Having a recruitable higher undead unit on which you then could use your ability would make upgrading them much easiert (sure on graveyard you can buy middle tier undead in the graveyard shop but even then it doesnt feel good and it just feels bad to have one king be so heavily restriced into one map).\n\n4. For multiple kings, the last vision vision uprade (Spellus and Wise, for Saladin even the TWO last) are way too expensive and there is literally no reason to ever buy them instead of building \"monomunt of the kings's gaze\" to increase vision radius.\n\n5. Like for any kind of roguelikes, I really wish you could choose certain things (lets say for this game 3 buildings, 3 spells and 3 relics) to not show up during a run. There are always certain things I never use, even in the 50h hours of playing this game and it feels always bad if this shows up (especially bad for legendary relics, which you only get very few per run and which you cannot reroll. and then you have to choose between 2 that buffs spells,,,when you dont even use spells most of the times).\n\n6. Clay really feels like a useless resource. besides the 2. vision upgrade which is mandatory for each king, it is only really used to build 2 units. Its theoretical main use is to repair your city walls but the thing is, if you even get dmg to your city walls (besides early game) you are already dead in 90% of the cases so reparing it afterwards would never matter really. The only king that really uses it is Spellus since he needs way more of it for his vision upgrades and patricius (one of the units that needs the resource) is a really good tank for this king.\n\n7. While the ingame wiki is really well made and you even can access it during a run, I reaaaly wish it would also list all spells/artifacts/non-building-recruitable-unit like enemy units or the undead alucard can summon.\n\n8. This one is more like a wish from me: add a legendary smithy like building that can craft building upgrades/artifacts so you can really craft everthing ingame and dont need that shop for anything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Didn't realise I could move buildings until I unlocked a modifier that removes the ability to move buildings.\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lovely game, amazing mix of genres, flows so well its addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The King IS watching. Watching me waste away playing hours of this game. Very fun and a little addicting at times. I'm still on the first stage but I keep finding new buildings and new strategies to use. Play at your own risk.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Early game is great. You can get a solid 20-30 hours enjoyable play time. Beyond that the balance gets screwy. Threat scaling beyond 4-5 is more annoying than cool challenge. It feels you have to play endless mode to actually enjoy any of the advanced tiers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoying it so far.\r\n\r\nThe gaze mechanic is very interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great, good replayability between runs, a very small amount of luck is needed to get the right buildings, but with good tactics it can be managed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun management & strategy game with an enjoyable, not-too-long play loop between campaigns, with progression I've found rewarding and not frustrating. It's unlikely you'll play more than 1-2 games without unlocking something new or improving upon something you previously had, and it's nice to look back and see how far you've come. I've invested 26 hours so far and I've only just scratched the surface.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely enjoyable game with a nice variety of methods to play the game, although some bosses are much harder and unfair compared to others(especially Sir Mortifax) so a tweak would be nice. I love how the developers added their touch of humor to the random events, feels really fresh and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic Game with Great Graphics and a Cool Gimmick that actually feels fun to interact with. Be warned that the first few runs will be brutal, I lost the first 4-5 before seeing all the bosses, but once you get the experience of the first few games and unlock somethings through the Meta-progression you'll be able to find build you enjoy; letting you progress into higher and higher difficulties to keep the game fresh.\n\nGreat Game, Great Developers, Great Potential.\n\n10/10 Couldn't recommend a game at this price point more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 20 hours, even though I don't feel like making a review, I feel like I have to give this the roguelike, auto sim itch that is becoming so popular. Good sprites, interesting mechanics that feel opportunity fulfilling, simple gameplay. But, optimization may be too open to interpretation. Obviously, meta and builds will inevitably make their way to some forum or another, but solving the riddle on my own feels much more satisfying. This game makes it feel like chasing the dragon, always nearby but forever out of reach.  Do I feel proud about my effort or dedication? No, I don't. Is the game entertaining enough to offer another 20 hours of \"fun.\" Yes, of that I have no doubt.\r\n\r\nI didn't feel as guilty as I did optimizing builds in balatro. That just felt like gambling. But its no where near as satisfying as slay the spire or monster train (2). Probably because of how RNG is implemented. There are so many different unit types, upgrades, and production buildings that there might be too many options to navigate the easily 30+ minute matches. Often getting units completely unrelated to what you've built around producing with few, very few, opportunities to reorganize relatively expensive building infrastructure systems. Such as oil production, grapes, wheat to flours, and meat. They are deep-ish, but inconsistent because of limitations of rerolls and, ironically, the need to build infrastructure specifically around the 'shop' currency. ( in game, not at all real money )\r\n\r\nEnemies, all look great and there are as many as their are available units. After 20 hours, I couldn't tell you the different between one and another aside from ranged or melee. Big, melee. Staff, range. The bosses are there too, and sometimes they are difficult. Not much else there. Big auto army goes into other big auto army. The only rule really seems to be get a frontline, get a backline, and hope you get a couple upgrades for those units. ( Felt like about 33% drops for useful units )\r\n\r\nAlso, the different kings have different upgrade 'sight ranges' this is pretty interesting as builds can vary greatly. Unfortunately, certain kings start out not-so-great and on the harder difficulties the cost for wasting time clearing areas just becomes quite imbalanced.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What would happen if Balatro and Stronghold had a child? You can probably see how stupendously great their baby would be, in the eyes of the King on the cover. That's also me, staring at this glorious pixel art game. Dirty and retro inspired for battle, extravagant and surreal outside of it.\n\nI really love how the game treats me, how it increases difficulty levels, prompting me, to be more inventive, if not with a challenge, then by throwing an artefact my way. It feels, at times, as a board game, where you progress through a single board, yet every game is slightly richer, due to achievements and awards. Threat Level 3, is where you swap the board, meaning you unlocked all of it, except its difficulties, so the game only starts. \nAt this point, I'm still yet to achieve that, but as a 15 EUR worth game it already paid off.\n\nSpecial mention prize: the music, that prompts your eyes to gaze, but like do it for real, dive into a tunnel with wells and farms, sweaty rhythm pulsing through your veins with impatience. Music morphs into combat and reading states, even if somewhat roughly, but otherwise attentively to you, the player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of the better games of its type, resource managing TETRIS with lots of depth with upgrades.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful, funny eldritch strategy game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great at the beggining as you are progressing and unlocking new runs. However at some point there is no more fun on unblocking new characters as the runs are the same.\nIn any case it is very addictive and I recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very very good. Addictive, iterative, very high skill ceiling. Super fun!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I normally don't like the pixled games design approach and consider it to be a lazy one. But this game would be my only exception. The mechanics are really enjoyable and well made",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Insanely good! Please, keep on going devs!\r\nMake DLCs and all the rest!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A creative twist on the genre, and just good old fashioned fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When a funny thematic decision works it really works.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A bit tough to tough at the beginning because UI is not very clear and theres not much tutorial but very addicting when you get the hang of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very nice mix of strategy, defense and resource management. Combined with a charming artstyle and progression system, it is a hard yes from me :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is right up the alley of anyone who enjoyed Loop Hero or Slay the Spire.\r\n\r\nI am very excited to see how this may be expanded in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As comfy and slow or as min max'd and desperately close to winning as you want it to be. \n\nExcellent pixel art and soundtrack as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im playing tetris and a RTS at the same time its all idle while managing my economy that I must watch",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most fun and innovative strategy games I've played in a long time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gaze mechanic and tile placement are somewhat superficial to me. Yes, they add to the challenge and require some thought, but I think the real crux of this game is risk management. The most important choices are multiple-choice, from a few randomly-selected options. \n\nWhen you pick what enemies you'll face, you don't know what troops and resources you'll have by the time they arrive. You can significantly influence the difficulty, but if you go too easy you won't get enough rewards to prepare you for future waves.\n\nYou need troops to survive, but when picking troop building blueprints you often don't know if/when you'll get the resources needed to build the building or train the troops. The game doesn't cut you much slack - if you gamble on a blueprint that needs a less common resource and don't get it in time, your run could be doomed.  \n\nHowever, there is a limited currency for rerolls, and meta-game progression makes things a lot easier. \n\nOn lower threat levels I'd say it's a great casual game. After that, the difficulty ramps up sharply and it starts to feel frustrating to lose late in a run. Still, I'm overall enjoying my time with it.\n\nEven if I quit now I'd have gotten my money's worth, but I think it'll be worth grinding a bit to see what happens when I unlock more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AMAZING, SIMPLE TO LEARN, HARD TO MASTER!!!\nIT IS ROGUELIKE WITH \"TD\"-like mechanics and more close to \"city management\"\nI LIKE IT - TRY IT NOW",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You are the King and you are watching LITERAL HOURS disappear without you noticing!\r\nGreat Game can recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having Fun! I am huge fan of anything vaguely like MegaManBattleNetwork. I hope this genre grows.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good kind of agony, very addicting. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful take on the roguelite base-builder/tower defense genre (mashup?). The only thing really close to this that I can think of is Super Fantasy Kingdom (which is also very new) and Nordhold. Like the two aforementioned games, you use different currencies to build new buildings and draft units to defend against progressively stronger waves of enemies. The beauty of TKiW is that not every plot of your base works all the time. As the name implies The King is Watching...a handful of squares/plots. This means that the other plots are NOT working for you while you aren't \"watching\" them. You can freely rotate and move your gaze AND push-pause whenever you like, which you will be doing a ton. You can also speed up time which comes in handy towards the end of most runs when you are just churning out units and resources. The micromanaging aspect of watching tiles to get them to work, coupled with the massive amount of unlockable buildings and units makes this game extremely fun. Usually micormanaging is a used as a negative connotation, but I think with TKiW it's a great thing. With most city saver games (I just coined that term tyvm), micromanaging IS the \"thing\" you do and what makes it fun!\n\n\nAnyways, I'd say TKiW is one of the most unique games i've played and I can't recommend it enough! The art and cute little story really make the game shine too. Did I mention the unlockables? There's SOOOO many and the rate of unlocking things is JUST right imo. Also, I finally unlocked the graveyard map after about....I'd say 20 hours of playtime maybe. I haven't played it yet but I cannot wait to try it out because I know it probably adds a whole new exciting, unique element to the game that will make it even more fun and interesting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A base-building rogue-like game that is quite fun with unique game play!\r\n\r\nHIGHLY RECOMMENDED TO WATCH THE NEW TRAILER. Original one that plays is NOT clear at all.\r\n\r\nGame loop is fun. Core game play is pretty solid.\r\nLearning curve is STEEP. Game doesn't give you a lot to start out with, and you have to play multiple times before you can unlock the basics enough to start winning.\r\n\r\nLet me repeat that last line: EARLY GAME IS HARD ON PURPOSE. \r\nYou likely won't win the first few times until you figure out how to prioritize buildings correctly.\r\n\r\nTIPS:\r\n- Review the encyclopedia for which troop buildings are better than others.\r\n- Army size is more important than army quality early on.\r\n- Don't be afraid to demolish buildings (especially weak troops) if you need space for something better.\r\n- UPGRADE YOUR GAZE EARLY. Preferably before the first boss.\r\n- Iron bars and Flour are worth 3x gold value. Sell them early if you get them through events for quick cash for upgrades.\r\n- MOST IMPORTANT! If your barracks aren't generating troops but there's room, make sure you have the \"put extra troops in storage\" button clicked (the blue/orange one). I tend to put it on the combination blue/orange and just leave it all game. Don't know why that isn't on by default.\r\n\r\nTL;DR:\r\nGame's good. Steep learning curve. Very fun. Relaxing and casual base building rogue-like.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really enjoyed this game. I'm a big fan of good tower defenses and The King is Watching is definitely one of them. The thing with the gaze adds challenge the genre needs, which is a constant supervision of your defence. In most cases of defence making games, it's building and upgrading your structures, but here, it's also a mechanic for literal looking at your production. \n\nThe simple, yet satisfying economy, that lets you develop your settlement and, with time, employ more sophisticated means for repelling your foes, works very well and I respect professionals who are able to deliver such made mechanics. I belive that making a system of production and investement that is not too easy and not impossible to maintain and grow, needs some serious math and lots of test runs, which deserves an applause. \n\nDon't know about roguelike genre though. In my opinion, it suppose to be more random and there is very little randomness in this one (but, of course, the progressing between runs is a roguelite feature)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly interesting take on base building and defense.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very unique and interesting game.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I guess it's fine for a $10 game but it seems unfinished, or like there is an aspect of the game missing, I don't know what but it needs something else. More lore would be cool. \r\n\r\nEach run is easy and chill until week 315 where the difficulty spikes dramatically which almost always results in the castle being destroyed, a big shift from taking zero damage until that point. It's very repetitive, chill and easy until week 315, then it ends no matter what build I try. I've made it to week 315 every run, but I've only made it past that point twice in 18 hours. most of the town upgrades seem meaningless, the helpful/important ones are deep in the unlock tree and expensive, so you really have to grind to get them. There are a few standout unlocks, I think the rest should be buffed to match the powerful ones instead of nerfing the few cool ones.\r\n\r\nthe overall vibe and art style of the game is really cool, which I think is why I played it for this long but I'm over it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I dont understand why the negative Tile isnt included in the threat level, entirely useless to have it starting from the first run\n\nThe game doesnt make good ways with explaining why ressources matter. I died on the second Boss now with so much in my backpocket and missing Wood with zero ways of getting more sawmills besides gambling on the blueprint box. I did not see a way to use my grapes, to make wine or to use up any of my excess Gold besides an expensive troop that cost 70 to make each time.\n\nThe Boosts to Troop types did not help either. I had ONE good Boost the entire run and the rest didnt hit any of mine. Neither flying nor Riding nor Champions or Grunts that deal damage in my party and yet I only see those\n\n\nThat difficulty spike at the second Boss (Wave 315) is insane. Zero clue how I should beat that thing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable due to crashing mid-run. Boss balance is out of whack in the graveyard level",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The King's vision, which is sort of the \"x-factor\" of this game, is not enjoyable. The \"vision\" aspect of the game doesn't add any value or depth and is incredibly annoying and limiting. \r\n\r\nThis game would be worlds more enjoyable without the king's vision you have to constantly adjust.\r\n\r\nIt makes the entire game not fun and not rewarding. I can't stress enough how much that ruins this game and any enjoyment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The progression is just random. The outcome is just bullshit. The mechanics look nice but the balance is just a mes. Don't waste your time",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm afraid that one person, if unlucky, won't be able to play any game these days. The designers simply can't understand statistics and keeps stacking up random shit. \n\nStart a difficulty 10 game, double research lab searching goose knight, takes 14 tries to get one (it is 3 pick out of 15 every time, so roughly 20% chance to get the one you want, and missing 13 times in a row is 5% chance. ), ok now to get wood, drop a woodcutter spell and you know what? 5 tree-ants comes and wiped me. Seriously, 20% chance to get a tree-ant per tree, so getting 5 from 5 trees is 0.3% chance. \n\nLike seriously, just stack up the shit okey? Make more random stuff plz, i'm so much enjoying it ffs!\n\nOkey you might think i'm just being angry for no reason, let me give you another one example -- this also explains why i'm so cheap and doing double research lab blueprint filtering tactic.\n1. The graveyard boss has a mechanic that blocks 16 tiles of your map, you can't use them for anything, \nNow you have 9 tiles. \n2. The boss has a second mechanic, that requires a building to be operating, otherwise it will berserk, so that's another -1 tiles. Additionally, this building costs food, so technically you need another farm to support it(under the reduced productivity of high difficulty), so actually it's -2 tiles. \nNow you have 7 tiles. \n3. Unless you are a cheap-ass like me doing blueprint filtering tactic, you'd normally need market place, farm, water and one additional resource building. That's -4 tiles. \nNow you have 3 tiles. \n4. Additionally that map has outdoor resources, so ideally this feature is asking 1 tile from you. While you can ignore the feature, but i don't think designer is not telling us to ignore the MAJOR UNIQUE feature of the map right? So again -1 tile.\nNow you have 2 tiles. \nOkey, let's assum you don't do cheap-ass tactics, let's see what you get from 2 tiles. \nFrom 4 farmers (the worst case), to 2 assassins(the best case). \nNow go and fight through the first chapter, all the waves plus 1 boss, with your 4 lucky farmers or 2 assassins. Yeah you, who ever that's responsible for this design, go fight that chapter with 4 farmers and show us how it is done. \n\nSimilarly, instead of doing diminishing returns on difficulty, it does exponential scaling. U get +30% enemy damage on lvl4 or 5, and then you get ANOTHER +60% on top at lv10. Like seriously, do you have even the fundamental understanding of numeric design? \n(I really hate now how clueless designers are these days like they never looked at numbers before. )\n\nYeah, the only way to play this game is to exploit it in the most unbalanced way, because once again we got designer that doesn't test-play his difficulty settings. \nYeah, go ahead, get early goose knight and ignore 80% of the games feature, training it, get bonus and wreck the game. Go hydra rush, or berserker assassin, or really, any of the tactics that exploits the balance of the game. \nOr, play the game fairly and engage with features, and then lose the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feels like you just throw shit at the wall to see what works. RNG dictates all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I feel kind of mixed about this one, because I very much did enjoy what I played of this game, but there's just... not a lot of game here.\n\nIt feels like an extra game mode in a game without a main mode. I got to the end of the second map, beating it on level 3, excited to see what the third map would hold, only to discover there IS no third map.\n\nFor some people, I'm sure that's fine; the joy comes from changing up your playstyle & increasing the difficulty of maps you've already beaten. For me, & I'm sure others, the joy of these sorts of games comes from progression towards a goal, but The King is Watching doesn't provide you with a goal, except \"unlock more things\" which isn't fantastically compelling for me, when I'd already beaten both maps up to level 5 or so in about 12 hours, & didn't really enjoy it much after about 5 - I kept playing to see if something would grab me again.\n\nIt's a real shame, because the concept here is solid & the basic gameplay loop is very fun - it's just that you can see everything the game has to offer in about 3 hours, aside from a few relatively meaningless unlocks in the various tech trees. Even the different kings don't really feel that different to play with, aside from the shape of their gaze, but all that does is make you map out your buildings slightly differently.\n\ntl;dr if you like optimisation & playing through exactly the same stuff for hours on end, just trying to change your build slightly each time, this is the game for you. If you're looking for any sort of story or actual gameplay progression - give this one a miss.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "I want to like this game, and I do for a lot of reasons, but I would not recommend it.  The big problems are a lack of balance to make thing interesting, and a lack of variety in the early-game (I consider myself still early in the meta progression at about 11 hours).\r\n\r\nWhen you start this game, you are locked in to only one set of all the variables that look like they will eventually become available.  You can only fight in the village.  You can only pick from one king (different abilities and buffs).  You can only have one advisor (a buff slot).  You find, after the tutorial playthrough, that all of this stuff is unlockable.  The problem is, the runs take a long time, and you don't get enough coins to unlock anything really, even after as many hours as I've put in.  I'm still fighting the same combinations of six bosses, two at each stage.  I'm still fighting the same enemies which don't have much to distinguish themselves.  I'm still using the same units because more interesting units take more complex resources, which take production chains, which you'd think would be interesting to create but it's pretty random which resources you can generate.\r\n\r\nAnd the gameplay loop itself ends up being incredibly repetitive because the fights are not balanced.  You can, to an extent, choose whether you want to make the next round of fights impossibly difficult or easy as cake, but you can only guess whether you have gone too far.  If you have, your run is over, and you will have unlocked virtually nothing and want to turn the game off.  If you haven't, you get to keep doing that until you get to the level's boss, at which time you will almost certainly lose, have enough coins to unlock virtually nothing, and want to turn the game off.\r\n\r\nRoguelites and roguelikes are cool, permadeath is cool, meta progression is cool, and this game blends a lot of interesting concepts.  The music is good, the aesthetic is good (even if some of the character portraits just look like boogers), and I enjoyed the time I spent playing it until I realized I wasn't going to end up liking it.  Maybe I'll be wrong though and will keep playing it despite not really enjoying it.  Who knows.  Who cares.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "This game was so close to being really, really good. But they fumbled the ball at the 1 yard line. The game is designed such that it's impossible to win without grinding. To the degree it's just stupid. Every single game early on is just having an overwhelming winning battle each time. I usually pick all the hardest options without even thinking. I've maxed my unit cap and are completely full on resources and spells. Then the boss just stomps me. Do I need to 'git good'? Well if so, then 95% of the game is just a waste of time because all the battles before the boss where I need to 'git good' are just a waste of time. Only the boss battle matters. Or the game is badly balanced. If you can win 5 battles in a row without losing a single unit, you shouldn't lose easily to the boss. Otherwise just remove the previous battles. \r\n\r\nIt's very clear you're meant to buy the upgrades by playing 100 hours of the game. No need to 'git good' when  you can just waste your time paying to win with the in game currency. The game designer created a Michelin meal and then just poured 5 lbs of salt on it right before serving it to you. I don't recommend playing this and I don't intend to play more. I would refund if I didn't have to waste so much time grinding before finding this out.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Good game for the little bit I played. Unfortunately cannot even play anymore due to the fact I get a win32 error and it is the only game that has this issue :)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I guess it's fine for a $10 game but it seems unfinished, or like there is an aspect of the game missing, I don't know what but it needs something else. More lore would be cool. \r\n\r\nEach run is easy and chill until week 315 where the difficulty spikes dramatically which almost always results in the castle being destroyed, a big shift from taking zero damage until that point. It's very repetitive, chill and easy until week 315, then it ends no matter what build I try. I've made it to week 315 every run, but I've only made it past that point twice in 18 hours. most of the town upgrades seem meaningless, the helpful/important ones are deep in the unlock tree and expensive, so you really have to grind to get them. There are a few standout unlocks, I think the rest should be buffed to match the powerful ones instead of nerfing the few cool ones.\r\n\r\nthe overall vibe and art style of the game is really cool, which I think is why I played it for this long but I'm over it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It's fun, but QUICKLY becomes tedious because it lacks a strong sense of progression between the waves / rounds.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is kind a bad, if you upgrade so you can build more troops you are sabotaging yourself hard, you cannot remove them from the skill tree once picked, and the RNG will doom 80% of all your games afterwards, you need to be insanely lucky, like if you don't get so you can melt iron bars your cannot build 50% of all the good buildings, and there is only one building that can craft it...\r\nHonestly instead of buying this game you should buy a lottery ticket, that's the same amount luck you need to play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think this game is way too expensive for the small amount of content in it.\n\nOther than that its a fun game. My only issue is that there is only two maps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable due to crashing mid-run. Boss balance is out of whack in the graveyard level",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I dont understand why the negative Tile isnt included in the threat level, entirely useless to have it starting from the first run\n\nThe game doesnt make good ways with explaining why ressources matter. I died on the second Boss now with so much in my backpocket and missing Wood with zero ways of getting more sawmills besides gambling on the blueprint box. I did not see a way to use my grapes, to make wine or to use up any of my excess Gold besides an expensive troop that cost 70 to make each time.\n\nThe Boosts to Troop types did not help either. I had ONE good Boost the entire run and the rest didnt hit any of mine. Neither flying nor Riding nor Champions or Grunts that deal damage in my party and yet I only see those\n\n\nThat difficulty spike at the second Boss (Wave 315) is insane. Zero clue how I should beat that thing\n\nGenuinely why is EVERYTHING locked behind playing thousands of runs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The King's vision, which is sort of the \"x-factor\" of this game, is not enjoyable. The \"vision\" aspect of the game doesn't add any value or depth and is incredibly annoying and limiting. \r\n\r\nThis game would be worlds more enjoyable without the king's vision you have to constantly adjust.\r\n\r\nIt makes the entire game not fun and not rewarding. I can't stress enough how much that ruins this game and any enjoyment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The progression is just random. The outcome is just bullshit. The mechanics look nice but the balance is just a mes. Don't waste your time",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm afraid that one person, if unlucky, won't be able to play any game these days. The designers simply can't understand statistics and keeps stacking up random shit. \n\nStart a difficulty 10 game, double research lab searching goose knight, takes 14 tries to get one (it is 3 pick out of 15 every time, so roughly 20% chance to get the one you want, and missing 13 times in a row is 5% chance. ), ok now to get wood, drop a woodcutter spell and you know what? 5 tree-ants comes and wiped me. Seriously, 20% chance to get a tree-ant per tree, so getting 5 from 5 trees is 0.3% chance. \n\nLike seriously, just stack up the shit okey? Make more random stuff plz, i'm so much enjoying it ffs!\n\nOkey you might think i'm just being angry for no reason, let me give you another one example -- this also explains why i'm so cheap and doing double research lab blueprint filtering tactic.\n1. The graveyard boss has a mechanic that blocks 16 tiles of your map, you can't use them for anything, \nNow you have 9 tiles. \n2. The boss has a second mechanic, that requires a building to be operating, otherwise it will berserk, so that's another -1 tiles. Additionally, this building costs food, so technically you need another farm to support it(under the reduced productivity of high difficulty), so actually it's -2 tiles. \nNow you have 7 tiles. \n3. Unless you are a cheap-ass like me doing blueprint filtering tactic, you'd normally need market place, farm, water and one additional resource building. That's -4 tiles. \nNow you have 3 tiles. \n4. Additionally that map has outdoor resources, so ideally this feature is asking 1 tile from you. While you can ignore the feature, but i don't think designer is not telling us to ignore the MAJOR UNIQUE feature of the map right? So again -1 tile.\nNow you have 2 tiles. \nOkey, let's assum you don't do cheap-ass tactics, let's see what you get from 2 tiles. \nFrom 4 farmers (the worst case), to 2 assassins(the best case). \nNow go and fight through the first chapter, all the waves plus 1 boss, with your 4 lucky farmers or 2 assassins. Yeah you, who ever that's responsible for this design, go fight that chapter with 4 farmers and show us how it is done. \n\nSimilarly, instead of doing diminishing returns on difficulty, it does exponential scaling. U get +30% enemy damage on lvl4 or 5, and then you get ANOTHER +60% on top at lv10. Like seriously, do you have even the fundamental understanding of numeric design? \n(I really hate now how clueless designers are these days like they never looked at numbers before. )\n\nYeah, the only way to play this game is to exploit it in the most unbalanced way, because once again we got designer that doesn't test-play his difficulty settings. \nYeah, go ahead, get early goose knight and ignore 80% of the games feature, training it, get bonus and wreck the game. Go hydra rush, or berserker assassin, or really, any of the tactics that exploits the balance of the game. \nOr, play the game fairly and engage with features, and then lose the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feels like you just throw shit at the wall to see what works. RNG dictates all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I feel kind of mixed about this one, because I very much did enjoy what I played of this game, but there's just... not a lot of game here.\n\nIt feels like an extra game mode in a game without a main mode. I got to the end of the second map, beating it on level 3, excited to see what the third map would hold, only to discover there IS no third map.\n\nFor some people, I'm sure that's fine; the joy comes from changing up your playstyle & increasing the difficulty of maps you've already beaten. For me, & I'm sure others, the joy of these sorts of games comes from progression towards a goal, but The King is Watching doesn't provide you with a goal, except \"unlock more things\" which isn't fantastically compelling for me, when I'd already beaten both maps up to level 5 or so in about 12 hours, & didn't really enjoy it much after about 5 - I kept playing to see if something would grab me again.\n\nIt's a real shame, because the concept here is solid & the basic gameplay loop is very fun - it's just that you can see everything the game has to offer in about 3 hours, aside from a few relatively meaningless unlocks in the various tech trees. Even the different kings don't really feel that different to play with, aside from the shape of their gaze, but all that does is make you map out your buildings slightly differently.\n\ntl;dr if you like optimisation & playing through exactly the same stuff for hours on end, just trying to change your build slightly each time, this is the game for you. If you're looking for any sort of story or actual gameplay progression - give this one a miss.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "I want to like this game, and I do for a lot of reasons, but I would not recommend it.  The big problems are a lack of balance to make thing interesting, and a lack of variety in the early-game (I consider myself still early in the meta progression at about 11 hours).\r\n\r\nWhen you start this game, you are locked in to only one set of all the variables that look like they will eventually become available.  You can only fight in the village.  You can only pick from one king (different abilities and buffs).  You can only have one advisor (a buff slot).  You find, after the tutorial playthrough, that all of this stuff is unlockable.  The problem is, the runs take a long time, and you don't get enough coins to unlock anything really, even after as many hours as I've put in.  I'm still fighting the same combinations of six bosses, two at each stage.  I'm still fighting the same enemies which don't have much to distinguish themselves.  I'm still using the same units because more interesting units take more complex resources, which take production chains, which you'd think would be interesting to create but it's pretty random which resources you can generate.\r\n\r\nAnd the gameplay loop itself ends up being incredibly repetitive because the fights are not balanced.  You can, to an extent, choose whether you want to make the next round of fights impossibly difficult or easy as cake, but you can only guess whether you have gone too far.  If you have, your run is over, and you will have unlocked virtually nothing and want to turn the game off.  If you haven't, you get to keep doing that until you get to the level's boss, at which time you will almost certainly lose, have enough coins to unlock virtually nothing, and want to turn the game off.\r\n\r\nRoguelites and roguelikes are cool, permadeath is cool, meta progression is cool, and this game blends a lot of interesting concepts.  The music is good, the aesthetic is good (even if some of the character portraits just look like boogers), and I enjoyed the time I spent playing it until I realized I wasn't going to end up liking it.  Maybe I'll be wrong though and will keep playing it despite not really enjoying it.  Who knows.  Who cares.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "This game was so close to being really, really good. But they fumbled the ball at the 1 yard line. The game is designed such that it's impossible to win without grinding. To the degree it's just stupid. Every single game early on is just having an overwhelming winning battle each time. I usually pick all the hardest options without even thinking. I've maxed my unit cap and are completely full on resources and spells. Then the boss just stomps me. Do I need to 'git good'? Well if so, then 95% of the game is just a waste of time because all the battles before the boss where I need to 'git good' are just a waste of time. Only the boss battle matters. Or the game is badly balanced. If you can win 5 battles in a row without losing a single unit, you shouldn't lose easily to the boss. Otherwise just remove the previous battles. \r\n\r\nIt's very clear you're meant to buy the upgrades by playing 100 hours of the game. No need to 'git good' when  you can just waste your time paying to win with the in game currency. The game designer created a Michelin meal and then just poured 5 lbs of salt on it right before serving it to you. I don't recommend playing this and I don't intend to play more. I would refund if I didn't have to waste so much time grinding before finding this out.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Good game for the little bit I played. Unfortunately cannot even play anymore due to the fact I get a win32 error and it is the only game that has this issue :)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I guess it's fine for a $10 game but it seems unfinished, or like there is an aspect of the game missing, I don't know what but it needs something else. More lore would be cool. \r\n\r\nEach run is easy and chill until week 315 where the difficulty spikes dramatically which almost always results in the castle being destroyed, a big shift from taking zero damage until that point. It's very repetitive, chill and easy until week 315, then it ends no matter what build I try. I've made it to week 315 every run, but I've only made it past that point twice in 18 hours. most of the town upgrades seem meaningless, the helpful/important ones are deep in the unlock tree and expensive, so you really have to grind to get them. There are a few standout unlocks, I think the rest should be buffed to match the powerful ones instead of nerfing the few cool ones.\r\n\r\nthe overall vibe and art style of the game is really cool, which I think is why I played it for this long but I'm over it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It's fun, but QUICKLY becomes tedious because it lacks a strong sense of progression between the waves / rounds.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is kind a bad, if you upgrade so you can build more troops you are sabotaging yourself hard, you cannot remove them from the skill tree once picked, and the RNG will doom 80% of all your games afterwards, you need to be insanely lucky, like if you don't get so you can melt iron bars your cannot build 50% of all the good buildings, and there is only one building that can craft it...\r\nHonestly instead of buying this game you should buy a lottery ticket, that's the same amount luck you need to play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think this game is way too expensive for the small amount of content in it.\n\nOther than that its a fun game. My only issue is that there is only two maps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable due to crashing mid-run. Boss balance is out of whack in the graveyard level",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I dont understand why the negative Tile isnt included in the threat level, entirely useless to have it starting from the first run\n\nThe game doesnt make good ways with explaining why ressources matter. I died on the second Boss now with so much in my backpocket and missing Wood with zero ways of getting more sawmills besides gambling on the blueprint box. I did not see a way to use my grapes, to make wine or to use up any of my excess Gold besides an expensive troop that cost 70 to make each time.\n\nThe Boosts to Troop types did not help either. I had ONE good Boost the entire run and the rest didnt hit any of mine. Neither flying nor Riding nor Champions or Grunts that deal damage in my party and yet I only see those\n\n\nThat difficulty spike at the second Boss (Wave 315) is insane. Zero clue how I should beat that thing\n\nGenuinely why is EVERYTHING locked behind playing thousands of runs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The King's vision, which is sort of the \"x-factor\" of this game, is not enjoyable. The \"vision\" aspect of the game doesn't add any value or depth and is incredibly annoying and limiting. \r\n\r\nThis game would be worlds more enjoyable without the king's vision you have to constantly adjust.\r\n\r\nIt makes the entire game not fun and not rewarding. I can't stress enough how much that ruins this game and any enjoyment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The progression is just random. The outcome is just bullshit. The mechanics look nice but the balance is just a mes. Don't waste your time",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm afraid that one person, if unlucky, won't be able to play any game these days. The designers simply can't understand statistics and keeps stacking up random shit. \n\nStart a difficulty 10 game, double research lab searching goose knight, takes 14 tries to get one (it is 3 pick out of 15 every time, so roughly 20% chance to get the one you want, and missing 13 times in a row is 5% chance. ), ok now to get wood, drop a woodcutter spell and you know what? 5 tree-ants comes and wiped me. Seriously, 20% chance to get a tree-ant per tree, so getting 5 from 5 trees is 0.3% chance. \n\nLike seriously, just stack up the shit okey? Make more random stuff plz, i'm so much enjoying it ffs!\n\nOkey you might think i'm just being angry for no reason, let me give you another one example -- this also explains why i'm so cheap and doing double research lab blueprint filtering tactic.\n1. The graveyard boss has a mechanic that blocks 16 tiles of your map, you can't use them for anything, \nNow you have 9 tiles. \n2. The boss has a second mechanic, that requires a building to be operating, otherwise it will berserk, so that's another -1 tiles. Additionally, this building costs food, so technically you need another farm to support it(under the reduced productivity of high difficulty), so actually it's -2 tiles. \nNow you have 7 tiles. \n3. Unless you are a cheap-ass like me doing blueprint filtering tactic, you'd normally need market place, farm, water and one additional resource building. That's -4 tiles. \nNow you have 3 tiles. \n4. Additionally that map has outdoor resources, so ideally this feature is asking 1 tile from you. While you can ignore the feature, but i don't think designer is not telling us to ignore the MAJOR UNIQUE feature of the map right? So again -1 tile.\nNow you have 2 tiles. \nOkey, let's assum you don't do cheap-ass tactics, let's see what you get from 2 tiles. \nFrom 4 farmers (the worst case), to 2 assassins(the best case). \nNow go and fight through the first chapter, all the waves plus 1 boss, with your 4 lucky farmers or 2 assassins. Yeah you, who ever that's responsible for this design, go fight that chapter with 4 farmers and show us how it is done. \n\nSimilarly, instead of doing diminishing returns on difficulty, it does exponential scaling. U get +30% enemy damage on lvl4 or 5, and then you get ANOTHER +60% on top at lv10. Like seriously, do you have even the fundamental understanding of numeric design? \n(I really hate now how clueless designers are these days like they never looked at numbers before. )\n\nYeah, the only way to play this game is to exploit it in the most unbalanced way, because once again we got designer that doesn't test-play his difficulty settings. \nYeah, go ahead, get early goose knight and ignore 80% of the games feature, training it, get bonus and wreck the game. Go hydra rush, or berserker assassin, or really, any of the tactics that exploits the balance of the game. \nOr, play the game fairly and engage with features, and then lose the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feels like you just throw shit at the wall to see what works. RNG dictates all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I feel kind of mixed about this one, because I very much did enjoy what I played of this game, but there's just... not a lot of game here.\n\nIt feels like an extra game mode in a game without a main mode. I got to the end of the second map, beating it on level 3, excited to see what the third map would hold, only to discover there IS no third map.\n\nFor some people, I'm sure that's fine; the joy comes from changing up your playstyle & increasing the difficulty of maps you've already beaten. For me, & I'm sure others, the joy of these sorts of games comes from progression towards a goal, but The King is Watching doesn't provide you with a goal, except \"unlock more things\" which isn't fantastically compelling for me, when I'd already beaten both maps up to level 5 or so in about 12 hours, & didn't really enjoy it much after about 5 - I kept playing to see if something would grab me again.\n\nIt's a real shame, because the concept here is solid & the basic gameplay loop is very fun - it's just that you can see everything the game has to offer in about 3 hours, aside from a few relatively meaningless unlocks in the various tech trees. Even the different kings don't really feel that different to play with, aside from the shape of their gaze, but all that does is make you map out your buildings slightly differently.\n\ntl;dr if you like optimisation & playing through exactly the same stuff for hours on end, just trying to change your build slightly each time, this is the game for you. If you're looking for any sort of story or actual gameplay progression - give this one a miss.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "I want to like this game, and I do for a lot of reasons, but I would not recommend it.  The big problems are a lack of balance to make thing interesting, and a lack of variety in the early-game (I consider myself still early in the meta progression at about 11 hours).\r\n\r\nWhen you start this game, you are locked in to only one set of all the variables that look like they will eventually become available.  You can only fight in the village.  You can only pick from one king (different abilities and buffs).  You can only have one advisor (a buff slot).  You find, after the tutorial playthrough, that all of this stuff is unlockable.  The problem is, the runs take a long time, and you don't get enough coins to unlock anything really, even after as many hours as I've put in.  I'm still fighting the same combinations of six bosses, two at each stage.  I'm still fighting the same enemies which don't have much to distinguish themselves.  I'm still using the same units because more interesting units take more complex resources, which take production chains, which you'd think would be interesting to create but it's pretty random which resources you can generate.\r\n\r\nAnd the gameplay loop itself ends up being incredibly repetitive because the fights are not balanced.  You can, to an extent, choose whether you want to make the next round of fights impossibly difficult or easy as cake, but you can only guess whether you have gone too far.  If you have, your run is over, and you will have unlocked virtually nothing and want to turn the game off.  If you haven't, you get to keep doing that until you get to the level's boss, at which time you will almost certainly lose, have enough coins to unlock virtually nothing, and want to turn the game off.\r\n\r\nRoguelites and roguelikes are cool, permadeath is cool, meta progression is cool, and this game blends a lot of interesting concepts.  The music is good, the aesthetic is good (even if some of the character portraits just look like boogers), and I enjoyed the time I spent playing it until I realized I wasn't going to end up liking it.  Maybe I'll be wrong though and will keep playing it despite not really enjoying it.  Who knows.  Who cares.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "This game was so close to being really, really good. But they fumbled the ball at the 1 yard line. The game is designed such that it's impossible to win without grinding. To the degree it's just stupid. Every single game early on is just having an overwhelming winning battle each time. I usually pick all the hardest options without even thinking. I've maxed my unit cap and are completely full on resources and spells. Then the boss just stomps me. Do I need to 'git good'? Well if so, then 95% of the game is just a waste of time because all the battles before the boss where I need to 'git good' are just a waste of time. Only the boss battle matters. Or the game is badly balanced. If you can win 5 battles in a row without losing a single unit, you shouldn't lose easily to the boss. Otherwise just remove the previous battles. \r\n\r\nIt's very clear you're meant to buy the upgrades by playing 100 hours of the game. No need to 'git good' when  you can just waste your time paying to win with the in game currency. The game designer created a Michelin meal and then just poured 5 lbs of salt on it right before serving it to you. I don't recommend playing this and I don't intend to play more. I would refund if I didn't have to waste so much time grinding before finding this out.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Good game for the little bit I played. Unfortunately cannot even play anymore due to the fact I get a win32 error and it is the only game that has this issue :)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I guess it's fine for a $10 game but it seems unfinished, or like there is an aspect of the game missing, I don't know what but it needs something else. More lore would be cool. \r\n\r\nEach run is easy and chill until week 315 where the difficulty spikes dramatically which almost always results in the castle being destroyed, a big shift from taking zero damage until that point. It's very repetitive, chill and easy until week 315, then it ends no matter what build I try. I've made it to week 315 every run, but I've only made it past that point twice in 18 hours. most of the town upgrades seem meaningless, the helpful/important ones are deep in the unlock tree and expensive, so you really have to grind to get them. There are a few standout unlocks, I think the rest should be buffed to match the powerful ones instead of nerfing the few cool ones.\r\n\r\nthe overall vibe and art style of the game is really cool, which I think is why I played it for this long but I'm over it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It's fun, but QUICKLY becomes tedious because it lacks a strong sense of progression between the waves / rounds.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is kind a bad, if you upgrade so you can build more troops you are sabotaging yourself hard, you cannot remove them from the skill tree once picked, and the RNG will doom 80% of all your games afterwards, you need to be insanely lucky, like if you don't get so you can melt iron bars your cannot build 50% of all the good buildings, and there is only one building that can craft it...\r\nHonestly instead of buying this game you should buy a lottery ticket, that's the same amount luck you need to play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think this game is way too expensive for the small amount of content in it.\n\nOther than that its a fun game. My only issue is that there is only two maps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable due to crashing mid-run. Boss balance is out of whack in the graveyard level",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I dont understand why the negative Tile isnt included in the threat level, entirely useless to have it starting from the first run\n\nThe game doesnt make good ways with explaining why ressources matter. I died on the second Boss now with so much in my backpocket and missing Wood with zero ways of getting more sawmills besides gambling on the blueprint box. I did not see a way to use my grapes, to make wine or to use up any of my excess Gold besides an expensive troop that cost 70 to make each time.\n\nThe Boosts to Troop types did not help either. I had ONE good Boost the entire run and the rest didnt hit any of mine. Neither flying nor Riding nor Champions or Grunts that deal damage in my party and yet I only see those\n\n\nThat difficulty spike at the second Boss (Wave 315) is insane. Zero clue how I should beat that thing\n\nGenuinely why is EVERYTHING locked behind playing thousands of runs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The King's vision, which is sort of the \"x-factor\" of this game, is not enjoyable. The \"vision\" aspect of the game doesn't add any value or depth and is incredibly annoying and limiting. \r\n\r\nThis game would be worlds more enjoyable without the king's vision you have to constantly adjust.\r\n\r\nIt makes the entire game not fun and not rewarding. I can't stress enough how much that ruins this game and any enjoyment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The progression is just random. The outcome is just bullshit. The mechanics look nice but the balance is just a mes. Don't waste your time",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm afraid that one person, if unlucky, won't be able to play any game these days. The designers simply can't understand statistics and keeps stacking up random shit. \n\nStart a difficulty 10 game, double research lab searching goose knight, takes 14 tries to get one (it is 3 pick out of 15 every time, so roughly 20% chance to get the one you want, and missing 13 times in a row is 5% chance. ), ok now to get wood, drop a woodcutter spell and you know what? 5 tree-ants comes and wiped me. Seriously, 20% chance to get a tree-ant per tree, so getting 5 from 5 trees is 0.3% chance. \n\nLike seriously, just stack up the shit okey? Make more random stuff plz, i'm so much enjoying it ffs!\n\nOkey you might think i'm just being angry for no reason, let me give you another one example -- this also explains why i'm so cheap and doing double research lab blueprint filtering tactic.\n1. The graveyard boss has a mechanic that blocks 16 tiles of your map, you can't use them for anything, \nNow you have 9 tiles. \n2. The boss has a second mechanic, that requires a building to be operating, otherwise it will berserk, so that's another -1 tiles. Additionally, this building costs food, so technically you need another farm to support it(under the reduced productivity of high difficulty), so actually it's -2 tiles. \nNow you have 7 tiles. \n3. Unless you are a cheap-ass like me doing blueprint filtering tactic, you'd normally need market place, farm, water and one additional resource building. That's -4 tiles. \nNow you have 3 tiles. \n4. Additionally that map has outdoor resources, so ideally this feature is asking 1 tile from you. While you can ignore the feature, but i don't think designer is not telling us to ignore the MAJOR UNIQUE feature of the map right? So again -1 tile.\nNow you have 2 tiles. \nOkey, let's assum you don't do cheap-ass tactics, let's see what you get from 2 tiles. \nFrom 4 farmers (the worst case), to 2 assassins(the best case). \nNow go and fight through the first chapter, all the waves plus 1 boss, with your 4 lucky farmers or 2 assassins. Yeah you, who ever that's responsible for this design, go fight that chapter with 4 farmers and show us how it is done. \n\nSimilarly, instead of doing diminishing returns on difficulty, it does exponential scaling. U get +30% enemy damage on lvl4 or 5, and then you get ANOTHER +60% on top at lv10. Like seriously, do you have even the fundamental understanding of numeric design? \n(I really hate now how clueless designers are these days like they never looked at numbers before. )\n\nYeah, the only way to play this game is to exploit it in the most unbalanced way, because once again we got designer that doesn't test-play his difficulty settings. \nYeah, go ahead, get early goose knight and ignore 80% of the games feature, training it, get bonus and wreck the game. Go hydra rush, or berserker assassin, or really, any of the tactics that exploits the balance of the game. \nOr, play the game fairly and engage with features, and then lose the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feels like you just throw shit at the wall to see what works. RNG dictates all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I feel kind of mixed about this one, because I very much did enjoy what I played of this game, but there's just... not a lot of game here.\n\nIt feels like an extra game mode in a game without a main mode. I got to the end of the second map, beating it on level 3, excited to see what the third map would hold, only to discover there IS no third map.\n\nFor some people, I'm sure that's fine; the joy comes from changing up your playstyle & increasing the difficulty of maps you've already beaten. For me, & I'm sure others, the joy of these sorts of games comes from progression towards a goal, but The King is Watching doesn't provide you with a goal, except \"unlock more things\" which isn't fantastically compelling for me, when I'd already beaten both maps up to level 5 or so in about 12 hours, & didn't really enjoy it much after about 5 - I kept playing to see if something would grab me again.\n\nIt's a real shame, because the concept here is solid & the basic gameplay loop is very fun - it's just that you can see everything the game has to offer in about 3 hours, aside from a few relatively meaningless unlocks in the various tech trees. Even the different kings don't really feel that different to play with, aside from the shape of their gaze, but all that does is make you map out your buildings slightly differently.\n\ntl;dr if you like optimisation & playing through exactly the same stuff for hours on end, just trying to change your build slightly each time, this is the game for you. If you're looking for any sort of story or actual gameplay progression - give this one a miss.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "I want to like this game, and I do for a lot of reasons, but I would not recommend it.  The big problems are a lack of balance to make thing interesting, and a lack of variety in the early-game (I consider myself still early in the meta progression at about 11 hours).\r\n\r\nWhen you start this game, you are locked in to only one set of all the variables that look like they will eventually become available.  You can only fight in the village.  You can only pick from one king (different abilities and buffs).  You can only have one advisor (a buff slot).  You find, after the tutorial playthrough, that all of this stuff is unlockable.  The problem is, the runs take a long time, and you don't get enough coins to unlock anything really, even after as many hours as I've put in.  I'm still fighting the same combinations of six bosses, two at each stage.  I'm still fighting the same enemies which don't have much to distinguish themselves.  I'm still using the same units because more interesting units take more complex resources, which take production chains, which you'd think would be interesting to create but it's pretty random which resources you can generate.\r\n\r\nAnd the gameplay loop itself ends up being incredibly repetitive because the fights are not balanced.  You can, to an extent, choose whether you want to make the next round of fights impossibly difficult or easy as cake, but you can only guess whether you have gone too far.  If you have, your run is over, and you will have unlocked virtually nothing and want to turn the game off.  If you haven't, you get to keep doing that until you get to the level's boss, at which time you will almost certainly lose, have enough coins to unlock virtually nothing, and want to turn the game off.\r\n\r\nRoguelites and roguelikes are cool, permadeath is cool, meta progression is cool, and this game blends a lot of interesting concepts.  The music is good, the aesthetic is good (even if some of the character portraits just look like boogers), and I enjoyed the time I spent playing it until I realized I wasn't going to end up liking it.  Maybe I'll be wrong though and will keep playing it despite not really enjoying it.  Who knows.  Who cares.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "This game was so close to being really, really good. But they fumbled the ball at the 1 yard line. The game is designed such that it's impossible to win without grinding. To the degree it's just stupid. Every single game early on is just having an overwhelming winning battle each time. I usually pick all the hardest options without even thinking. I've maxed my unit cap and are completely full on resources and spells. Then the boss just stomps me. Do I need to 'git good'? Well if so, then 95% of the game is just a waste of time because all the battles before the boss where I need to 'git good' are just a waste of time. Only the boss battle matters. Or the game is badly balanced. If you can win 5 battles in a row without losing a single unit, you shouldn't lose easily to the boss. Otherwise just remove the previous battles. \r\n\r\nIt's very clear you're meant to buy the upgrades by playing 100 hours of the game. No need to 'git good' when  you can just waste your time paying to win with the in game currency. The game designer created a Michelin meal and then just poured 5 lbs of salt on it right before serving it to you. I don't recommend playing this and I don't intend to play more. I would refund if I didn't have to waste so much time grinding before finding this out.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Good game for the little bit I played. Unfortunately cannot even play anymore due to the fact I get a win32 error and it is the only game that has this issue :)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I guess it's fine for a $10 game but it seems unfinished, or like there is an aspect of the game missing, I don't know what but it needs something else. More lore would be cool. \r\n\r\nEach run is easy and chill until week 315 where the difficulty spikes dramatically which almost always results in the castle being destroyed, a big shift from taking zero damage until that point. It's very repetitive, chill and easy until week 315, then it ends no matter what build I try. I've made it to week 315 every run, but I've only made it past that point twice in 18 hours. most of the town upgrades seem meaningless, the helpful/important ones are deep in the unlock tree and expensive, so you really have to grind to get them. There are a few standout unlocks, I think the rest should be buffed to match the powerful ones instead of nerfing the few cool ones.\r\n\r\nthe overall vibe and art style of the game is really cool, which I think is why I played it for this long but I'm over it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It's fun, but QUICKLY becomes tedious because it lacks a strong sense of progression between the waves / rounds.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is kind a bad, if you upgrade so you can build more troops you are sabotaging yourself hard, you cannot remove them from the skill tree once picked, and the RNG will doom 80% of all your games afterwards, you need to be insanely lucky, like if you don't get so you can melt iron bars your cannot build 50% of all the good buildings, and there is only one building that can craft it...\r\nHonestly instead of buying this game you should buy a lottery ticket, that's the same amount luck you need to play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think this game is way too expensive for the small amount of content in it.\n\nOther than that its a fun game. My only issue is that there is only two maps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable due to crashing mid-run. Boss balance is out of whack in the graveyard level",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I dont understand why the negative Tile isnt included in the threat level, entirely useless to have it starting from the first run\n\nThe game doesnt make good ways with explaining why ressources matter. I died on the second Boss now with so much in my backpocket and missing Wood with zero ways of getting more sawmills besides gambling on the blueprint box. I did not see a way to use my grapes, to make wine or to use up any of my excess Gold besides an expensive troop that cost 70 to make each time.\n\nThe Boosts to Troop types did not help either. I had ONE good Boost the entire run and the rest didnt hit any of mine. Neither flying nor Riding nor Champions or Grunts that deal damage in my party and yet I only see those\n\n\nThat difficulty spike at the second Boss (Wave 315) is insane. Zero clue how I should beat that thing\n\nGenuinely why is EVERYTHING locked behind playing thousands of runs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The King's vision, which is sort of the \"x-factor\" of this game, is not enjoyable. The \"vision\" aspect of the game doesn't add any value or depth and is incredibly annoying and limiting. \r\n\r\nThis game would be worlds more enjoyable without the king's vision you have to constantly adjust.\r\n\r\nIt makes the entire game not fun and not rewarding. I can't stress enough how much that ruins this game and any enjoyment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The progression is just random. The outcome is just bullshit. The mechanics look nice but the balance is just a mes. Don't waste your time",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm afraid that one person, if unlucky, won't be able to play any game these days. The designers simply can't understand statistics and keeps stacking up random shit. \n\nStart a difficulty 10 game, double research lab searching goose knight, takes 14 tries to get one (it is 3 pick out of 15 every time, so roughly 20% chance to get the one you want, and missing 13 times in a row is 5% chance. ), ok now to get wood, drop a woodcutter spell and you know what? 5 tree-ants comes and wiped me. Seriously, 20% chance to get a tree-ant per tree, so getting 5 from 5 trees is 0.3% chance. \n\nLike seriously, just stack up the shit okey? Make more random stuff plz, i'm so much enjoying it ffs!\n\nOkey you might think i'm just being angry for no reason, let me give you another one example -- this also explains why i'm so cheap and doing double research lab blueprint filtering tactic.\n1. The graveyard boss has a mechanic that blocks 16 tiles of your map, you can't use them for anything, \nNow you have 9 tiles. \n2. The boss has a second mechanic, that requires a building to be operating, otherwise it will berserk, so that's another -1 tiles. Additionally, this building costs food, so technically you need another farm to support it(under the reduced productivity of high difficulty), so actually it's -2 tiles. \nNow you have 7 tiles. \n3. Unless you are a cheap-ass like me doing blueprint filtering tactic, you'd normally need market place, farm, water and one additional resource building. That's -4 tiles. \nNow you have 3 tiles. \n4. Additionally that map has outdoor resources, so ideally this feature is asking 1 tile from you. While you can ignore the feature, but i don't think designer is not telling us to ignore the MAJOR UNIQUE feature of the map right? So again -1 tile.\nNow you have 2 tiles. \nOkey, let's assum you don't do cheap-ass tactics, let's see what you get from 2 tiles. \nFrom 4 farmers (the worst case), to 2 assassins(the best case). \nNow go and fight through the first chapter, all the waves plus 1 boss, with your 4 lucky farmers or 2 assassins. Yeah you, who ever that's responsible for this design, go fight that chapter with 4 farmers and show us how it is done. \n\nSimilarly, instead of doing diminishing returns on difficulty, it does exponential scaling. U get +30% enemy damage on lvl4 or 5, and then you get ANOTHER +60% on top at lv10. Like seriously, do you have even the fundamental understanding of numeric design? \n(I really hate now how clueless designers are these days like they never looked at numbers before. )\n\nYeah, the only way to play this game is to exploit it in the most unbalanced way, because once again we got designer that doesn't test-play his difficulty settings. \nYeah, go ahead, get early goose knight and ignore 80% of the games feature, training it, get bonus and wreck the game. Go hydra rush, or berserker assassin, or really, any of the tactics that exploits the balance of the game. \nOr, play the game fairly and engage with features, and then lose the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feels like you just throw shit at the wall to see what works. RNG dictates all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I feel kind of mixed about this one, because I very much did enjoy what I played of this game, but there's just... not a lot of game here.\n\nIt feels like an extra game mode in a game without a main mode. I got to the end of the second map, beating it on level 3, excited to see what the third map would hold, only to discover there IS no third map.\n\nFor some people, I'm sure that's fine; the joy comes from changing up your playstyle & increasing the difficulty of maps you've already beaten. For me, & I'm sure others, the joy of these sorts of games comes from progression towards a goal, but The King is Watching doesn't provide you with a goal, except \"unlock more things\" which isn't fantastically compelling for me, when I'd already beaten both maps up to level 5 or so in about 12 hours, & didn't really enjoy it much after about 5 - I kept playing to see if something would grab me again.\n\nIt's a real shame, because the concept here is solid & the basic gameplay loop is very fun - it's just that you can see everything the game has to offer in about 3 hours, aside from a few relatively meaningless unlocks in the various tech trees. Even the different kings don't really feel that different to play with, aside from the shape of their gaze, but all that does is make you map out your buildings slightly differently.\n\ntl;dr if you like optimisation & playing through exactly the same stuff for hours on end, just trying to change your build slightly each time, this is the game for you. If you're looking for any sort of story or actual gameplay progression - give this one a miss.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "I want to like this game, and I do for a lot of reasons, but I would not recommend it.  The big problems are a lack of balance to make thing interesting, and a lack of variety in the early-game (I consider myself still early in the meta progression at about 11 hours).\r\n\r\nWhen you start this game, you are locked in to only one set of all the variables that look like they will eventually become available.  You can only fight in the village.  You can only pick from one king (different abilities and buffs).  You can only have one advisor (a buff slot).  You find, after the tutorial playthrough, that all of this stuff is unlockable.  The problem is, the runs take a long time, and you don't get enough coins to unlock anything really, even after as many hours as I've put in.  I'm still fighting the same combinations of six bosses, two at each stage.  I'm still fighting the same enemies which don't have much to distinguish themselves.  I'm still using the same units because more interesting units take more complex resources, which take production chains, which you'd think would be interesting to create but it's pretty random which resources you can generate.\r\n\r\nAnd the gameplay loop itself ends up being incredibly repetitive because the fights are not balanced.  You can, to an extent, choose whether you want to make the next round of fights impossibly difficult or easy as cake, but you can only guess whether you have gone too far.  If you have, your run is over, and you will have unlocked virtually nothing and want to turn the game off.  If you haven't, you get to keep doing that until you get to the level's boss, at which time you will almost certainly lose, have enough coins to unlock virtually nothing, and want to turn the game off.\r\n\r\nRoguelites and roguelikes are cool, permadeath is cool, meta progression is cool, and this game blends a lot of interesting concepts.  The music is good, the aesthetic is good (even if some of the character portraits just look like boogers), and I enjoyed the time I spent playing it until I realized I wasn't going to end up liking it.  Maybe I'll be wrong though and will keep playing it despite not really enjoying it.  Who knows.  Who cares.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "This game was so close to being really, really good. But they fumbled the ball at the 1 yard line. The game is designed such that it's impossible to win without grinding. To the degree it's just stupid. Every single game early on is just having an overwhelming winning battle each time. I usually pick all the hardest options without even thinking. I've maxed my unit cap and are completely full on resources and spells. Then the boss just stomps me. Do I need to 'git good'? Well if so, then 95% of the game is just a waste of time because all the battles before the boss where I need to 'git good' are just a waste of time. Only the boss battle matters. Or the game is badly balanced. If you can win 5 battles in a row without losing a single unit, you shouldn't lose easily to the boss. Otherwise just remove the previous battles. \r\n\r\nIt's very clear you're meant to buy the upgrades by playing 100 hours of the game. No need to 'git good' when  you can just waste your time paying to win with the in game currency. The game designer created a Michelin meal and then just poured 5 lbs of salt on it right before serving it to you. I don't recommend playing this and I don't intend to play more. I would refund if I didn't have to waste so much time grinding before finding this out.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Good game for the little bit I played. Unfortunately cannot even play anymore due to the fact I get a win32 error and it is the only game that has this issue :)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I guess it's fine for a $10 game but it seems unfinished, or like there is an aspect of the game missing, I don't know what but it needs something else. More lore would be cool. \r\n\r\nEach run is easy and chill until week 315 where the difficulty spikes dramatically which almost always results in the castle being destroyed, a big shift from taking zero damage until that point. It's very repetitive, chill and easy until week 315, then it ends no matter what build I try. I've made it to week 315 every run, but I've only made it past that point twice in 18 hours. most of the town upgrades seem meaningless, the helpful/important ones are deep in the unlock tree and expensive, so you really have to grind to get them. There are a few standout unlocks, I think the rest should be buffed to match the powerful ones instead of nerfing the few cool ones.\r\n\r\nthe overall vibe and art style of the game is really cool, which I think is why I played it for this long but I'm over it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It's fun, but QUICKLY becomes tedious because it lacks a strong sense of progression between the waves / rounds.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is kind a bad, if you upgrade so you can build more troops you are sabotaging yourself hard, you cannot remove them from the skill tree once picked, and the RNG will doom 80% of all your games afterwards, you need to be insanely lucky, like if you don't get so you can melt iron bars your cannot build 50% of all the good buildings, and there is only one building that can craft it...\r\nHonestly instead of buying this game you should buy a lottery ticket, that's the same amount luck you need to play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think this game is way too expensive for the small amount of content in it.\n\nOther than that its a fun game. My only issue is that there is only two maps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable due to crashing mid-run. Boss balance is out of whack in the graveyard level",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I dont understand why the negative Tile isnt included in the threat level, entirely useless to have it starting from the first run\n\nThe game doesnt make good ways with explaining why ressources matter. I died on the second Boss now with so much in my backpocket and missing Wood with zero ways of getting more sawmills besides gambling on the blueprint box. I did not see a way to use my grapes, to make wine or to use up any of my excess Gold besides an expensive troop that cost 70 to make each time.\n\nThe Boosts to Troop types did not help either. I had ONE good Boost the entire run and the rest didnt hit any of mine. Neither flying nor Riding nor Champions or Grunts that deal damage in my party and yet I only see those\n\n\nThat difficulty spike at the second Boss (Wave 315) is insane. Zero clue how I should beat that thing\n\nGenuinely why is EVERYTHING locked behind playing thousands of runs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The King's vision, which is sort of the \"x-factor\" of this game, is not enjoyable. The \"vision\" aspect of the game doesn't add any value or depth and is incredibly annoying and limiting. \r\n\r\nThis game would be worlds more enjoyable without the king's vision you have to constantly adjust.\r\n\r\nIt makes the entire game not fun and not rewarding. I can't stress enough how much that ruins this game and any enjoyment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The progression is just random. The outcome is just bullshit. The mechanics look nice but the balance is just a mes. Don't waste your time",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm afraid that one person, if unlucky, won't be able to play any game these days. The designers simply can't understand statistics and keeps stacking up random shit. \n\nStart a difficulty 10 game, double research lab searching goose knight, takes 14 tries to get one (it is 3 pick out of 15 every time, so roughly 20% chance to get the one you want, and missing 13 times in a row is 5% chance. ), ok now to get wood, drop a woodcutter spell and you know what? 5 tree-ants comes and wiped me. Seriously, 20% chance to get a tree-ant per tree, so getting 5 from 5 trees is 0.3% chance. \n\nLike seriously, just stack up the shit okey? Make more random stuff plz, i'm so much enjoying it ffs!\n\nOkey you might think i'm just being angry for no reason, let me give you another one example -- this also explains why i'm so cheap and doing double research lab blueprint filtering tactic.\n1. The graveyard boss has a mechanic that blocks 16 tiles of your map, you can't use them for anything, \nNow you have 9 tiles. \n2. The boss has a second mechanic, that requires a building to be operating, otherwise it will berserk, so that's another -1 tiles. Additionally, this building costs food, so technically you need another farm to support it(under the reduced productivity of high difficulty), so actually it's -2 tiles. \nNow you have 7 tiles. \n3. Unless you are a cheap-ass like me doing blueprint filtering tactic, you'd normally need market place, farm, water and one additional resource building. That's -4 tiles. \nNow you have 3 tiles. \n4. Additionally that map has outdoor resources, so ideally this feature is asking 1 tile from you. While you can ignore the feature, but i don't think designer is not telling us to ignore the MAJOR UNIQUE feature of the map right? So again -1 tile.\nNow you have 2 tiles. \nOkey, let's assum you don't do cheap-ass tactics, let's see what you get from 2 tiles. \nFrom 4 farmers (the worst case), to 2 assassins(the best case). \nNow go and fight through the first chapter, all the waves plus 1 boss, with your 4 lucky farmers or 2 assassins. Yeah you, who ever that's responsible for this design, go fight that chapter with 4 farmers and show us how it is done. \n\nSimilarly, instead of doing diminishing returns on difficulty, it does exponential scaling. U get +30% enemy damage on lvl4 or 5, and then you get ANOTHER +60% on top at lv10. Like seriously, do you have even the fundamental understanding of numeric design? \n(I really hate now how clueless designers are these days like they never looked at numbers before. )\n\nYeah, the only way to play this game is to exploit it in the most unbalanced way, because once again we got designer that doesn't test-play his difficulty settings. \nYeah, go ahead, get early goose knight and ignore 80% of the games feature, training it, get bonus and wreck the game. Go hydra rush, or berserker assassin, or really, any of the tactics that exploits the balance of the game. \nOr, play the game fairly and engage with features, and then lose the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feels like you just throw shit at the wall to see what works. RNG dictates all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I feel kind of mixed about this one, because I very much did enjoy what I played of this game, but there's just... not a lot of game here.\n\nIt feels like an extra game mode in a game without a main mode. I got to the end of the second map, beating it on level 3, excited to see what the third map would hold, only to discover there IS no third map.\n\nFor some people, I'm sure that's fine; the joy comes from changing up your playstyle & increasing the difficulty of maps you've already beaten. For me, & I'm sure others, the joy of these sorts of games comes from progression towards a goal, but The King is Watching doesn't provide you with a goal, except \"unlock more things\" which isn't fantastically compelling for me, when I'd already beaten both maps up to level 5 or so in about 12 hours, & didn't really enjoy it much after about 5 - I kept playing to see if something would grab me again.\n\nIt's a real shame, because the concept here is solid & the basic gameplay loop is very fun - it's just that you can see everything the game has to offer in about 3 hours, aside from a few relatively meaningless unlocks in the various tech trees. Even the different kings don't really feel that different to play with, aside from the shape of their gaze, but all that does is make you map out your buildings slightly differently.\n\ntl;dr if you like optimisation & playing through exactly the same stuff for hours on end, just trying to change your build slightly each time, this is the game for you. If you're looking for any sort of story or actual gameplay progression - give this one a miss.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "I want to like this game, and I do for a lot of reasons, but I would not recommend it.  The big problems are a lack of balance to make thing interesting, and a lack of variety in the early-game (I consider myself still early in the meta progression at about 11 hours).\r\n\r\nWhen you start this game, you are locked in to only one set of all the variables that look like they will eventually become available.  You can only fight in the village.  You can only pick from one king (different abilities and buffs).  You can only have one advisor (a buff slot).  You find, after the tutorial playthrough, that all of this stuff is unlockable.  The problem is, the runs take a long time, and you don't get enough coins to unlock anything really, even after as many hours as I've put in.  I'm still fighting the same combinations of six bosses, two at each stage.  I'm still fighting the same enemies which don't have much to distinguish themselves.  I'm still using the same units because more interesting units take more complex resources, which take production chains, which you'd think would be interesting to create but it's pretty random which resources you can generate.\r\n\r\nAnd the gameplay loop itself ends up being incredibly repetitive because the fights are not balanced.  You can, to an extent, choose whether you want to make the next round of fights impossibly difficult or easy as cake, but you can only guess whether you have gone too far.  If you have, your run is over, and you will have unlocked virtually nothing and want to turn the game off.  If you haven't, you get to keep doing that until you get to the level's boss, at which time you will almost certainly lose, have enough coins to unlock virtually nothing, and want to turn the game off.\r\n\r\nRoguelites and roguelikes are cool, permadeath is cool, meta progression is cool, and this game blends a lot of interesting concepts.  The music is good, the aesthetic is good (even if some of the character portraits just look like boogers), and I enjoyed the time I spent playing it until I realized I wasn't going to end up liking it.  Maybe I'll be wrong though and will keep playing it despite not really enjoying it.  Who knows.  Who cares.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "This game was so close to being really, really good. But they fumbled the ball at the 1 yard line. The game is designed such that it's impossible to win without grinding. To the degree it's just stupid. Every single game early on is just having an overwhelming winning battle each time. I usually pick all the hardest options without even thinking. I've maxed my unit cap and are completely full on resources and spells. Then the boss just stomps me. Do I need to 'git good'? Well if so, then 95% of the game is just a waste of time because all the battles before the boss where I need to 'git good' are just a waste of time. Only the boss battle matters. Or the game is badly balanced. If you can win 5 battles in a row without losing a single unit, you shouldn't lose easily to the boss. Otherwise just remove the previous battles. \r\n\r\nIt's very clear you're meant to buy the upgrades by playing 100 hours of the game. No need to 'git good' when  you can just waste your time paying to win with the in game currency. The game designer created a Michelin meal and then just poured 5 lbs of salt on it right before serving it to you. I don't recommend playing this and I don't intend to play more. I would refund if I didn't have to waste so much time grinding before finding this out.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Good game for the little bit I played. Unfortunately cannot even play anymore due to the fact I get a win32 error and it is the only game that has this issue :)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I guess it's fine for a $10 game but it seems unfinished, or like there is an aspect of the game missing, I don't know what but it needs something else. More lore would be cool. \r\n\r\nEach run is easy and chill until week 315 where the difficulty spikes dramatically which almost always results in the castle being destroyed, a big shift from taking zero damage until that point. It's very repetitive, chill and easy until week 315, then it ends no matter what build I try. I've made it to week 315 every run, but I've only made it past that point twice in 18 hours. most of the town upgrades seem meaningless, the helpful/important ones are deep in the unlock tree and expensive, so you really have to grind to get them. There are a few standout unlocks, I think the rest should be buffed to match the powerful ones instead of nerfing the few cool ones.\r\n\r\nthe overall vibe and art style of the game is really cool, which I think is why I played it for this long but I'm over it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It's fun, but QUICKLY becomes tedious because it lacks a strong sense of progression between the waves / rounds.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is kind a bad, if you upgrade so you can build more troops you are sabotaging yourself hard, you cannot remove them from the skill tree once picked, and the RNG will doom 80% of all your games afterwards, you need to be insanely lucky, like if you don't get so you can melt iron bars your cannot build 50% of all the good buildings, and there is only one building that can craft it...\r\nHonestly instead of buying this game you should buy a lottery ticket, that's the same amount luck you need to play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think this game is way too expensive for the small amount of content in it.\n\nOther than that its a fun game. My only issue is that there is only two maps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable due to crashing mid-run. Boss balance is out of whack in the graveyard level",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I dont understand why the negative Tile isnt included in the threat level, entirely useless to have it starting from the first run\n\nThe game doesnt make good ways with explaining why ressources matter. I died on the second Boss now with so much in my backpocket and missing Wood with zero ways of getting more sawmills besides gambling on the blueprint box. I did not see a way to use my grapes, to make wine or to use up any of my excess Gold besides an expensive troop that cost 70 to make each time.\n\nThe Boosts to Troop types did not help either. I had ONE good Boost the entire run and the rest didnt hit any of mine. Neither flying nor Riding nor Champions or Grunts that deal damage in my party and yet I only see those\n\n\nThat difficulty spike at the second Boss (Wave 315) is insane. Zero clue how I should beat that thing\n\nGenuinely why is EVERYTHING locked behind playing thousands of runs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The King's vision, which is sort of the \"x-factor\" of this game, is not enjoyable. The \"vision\" aspect of the game doesn't add any value or depth and is incredibly annoying and limiting. \r\n\r\nThis game would be worlds more enjoyable without the king's vision you have to constantly adjust.\r\n\r\nIt makes the entire game not fun and not rewarding. I can't stress enough how much that ruins this game and any enjoyment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The progression is just random. The outcome is just bullshit. The mechanics look nice but the balance is just a mes. Don't waste your time",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm afraid that one person, if unlucky, won't be able to play any game these days. The designers simply can't understand statistics and keeps stacking up random shit. \n\nStart a difficulty 10 game, double research lab searching goose knight, takes 14 tries to get one (it is 3 pick out of 15 every time, so roughly 20% chance to get the one you want, and missing 13 times in a row is 5% chance. ), ok now to get wood, drop a woodcutter spell and you know what? 5 tree-ants comes and wiped me. Seriously, 20% chance to get a tree-ant per tree, so getting 5 from 5 trees is 0.3% chance. \n\nLike seriously, just stack up the shit okey? Make more random stuff plz, i'm so much enjoying it ffs!\n\nOkey you might think i'm just being angry for no reason, let me give you another one example -- this also explains why i'm so cheap and doing double research lab blueprint filtering tactic.\n1. The graveyard boss has a mechanic that blocks 16 tiles of your map, you can't use them for anything, \nNow you have 9 tiles. \n2. The boss has a second mechanic, that requires a building to be operating, otherwise it will berserk, so that's another -1 tiles. Additionally, this building costs food, so technically you need another farm to support it(under the reduced productivity of high difficulty), so actually it's -2 tiles. \nNow you have 7 tiles. \n3. Unless you are a cheap-ass like me doing blueprint filtering tactic, you'd normally need market place, farm, water and one additional resource building. That's -4 tiles. \nNow you have 3 tiles. \n4. Additionally that map has outdoor resources, so ideally this feature is asking 1 tile from you. While you can ignore the feature, but i don't think designer is not telling us to ignore the MAJOR UNIQUE feature of the map right? So again -1 tile.\nNow you have 2 tiles. \nOkey, let's assum you don't do cheap-ass tactics, let's see what you get from 2 tiles. \nFrom 4 farmers (the worst case), to 2 assassins(the best case). \nNow go and fight through the first chapter, all the waves plus 1 boss, with your 4 lucky farmers or 2 assassins. Yeah you, who ever that's responsible for this design, go fight that chapter with 4 farmers and show us how it is done. \n\nSimilarly, instead of doing diminishing returns on difficulty, it does exponential scaling. U get +30% enemy damage on lvl4 or 5, and then you get ANOTHER +60% on top at lv10. Like seriously, do you have even the fundamental understanding of numeric design? \n(I really hate now how clueless designers are these days like they never looked at numbers before. )\n\nYeah, the only way to play this game is to exploit it in the most unbalanced way, because once again we got designer that doesn't test-play his difficulty settings. \nYeah, go ahead, get early goose knight and ignore 80% of the games feature, training it, get bonus and wreck the game. Go hydra rush, or berserker assassin, or really, any of the tactics that exploits the balance of the game. \nOr, play the game fairly and engage with features, and then lose the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feels like you just throw shit at the wall to see what works. RNG dictates all.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}