{
  "positive": [
    {
      "review": "> play game for months\r\n> finally 100%\r\n> leave game\r\n> come back 6 months later\r\n> am 50% complete\r\nwould recommend",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Pretty good idler. \nA lot of different complex systems that work with each other.\nAnd enough content to keep entertained for few months minimum\nNow that i completed every achievement i can leave a positive review and finally uninst. . .\n\nwdym devs just released another big update?",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "the best idle game i have played so far. \nit takes a while to get going, but once you find your flow, there is no turning back. \nthere is so much variety in this idle game and so much different stuff to do. that the developer still adds features and updates the game is just the cherry on top.\nyou should definitely give it a try :D",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's alright in the current state, but I will update it, as soon as it gets more updates",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Chill game that takes a little bit to start, but once the numbers go BRRRRR, it gets fun.  Plus, you can link the account to mobile & play it on the go",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Truly great incremental game with lots of layers and fun\r\nHoly refinement buff btw, I love you devs",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love this game so much I started playing , I've lost my Girlfriend , I have lost several competitions and my grades are falling to an absurd level. best game ever 100/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Revolution idle is a very fun game. There are circles you can watch spin and upgrade to spin faster. You can even time warp, time warp offline, and you can leave the game in the options menu and save and quit.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "circles fun and addicting",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "DEvs are nice and the discord has a nice friendly and helpful ambience. Highly recommended, warning : it's too addictive! but it's not pay to win. I still supported the devs with a few purchases (small quality of life improvements that are absolutely not necessary).",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Incredible incremental game. No forced Ads, Cohesive art style and many reset layers. \n\nProbably the best i've played of these types of games, however after a certain point of the game you really have to rely on out of game guides like from the discord to progress efficiently. You can still get most done on your own, but with certain layers it really can hinder your progress if you do x,y,z incorrectly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun idle/incremental. need little automations, requires thought here and there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you've played a lot of incremental games, you'd realize this game is very similar to Antimatter Dimensions- the \"big daddy\" of incrementals, so to speak. But the proof is in the pudding, here. I've played this game for a while now, and after sinking as much time as I have- I think it's worth it. If you have played a lot of incremental games, I'd definitely recommend this one to you. Even if you haven't, it's a worthy introduction to the genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☑ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☑ Check if you can run paint\n☐ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☑ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this for an hour and got the weirdest, worst headache I've ever had. I recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's one of the better idle games, and has a surprising amount of depth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like to have a game in the background that is like cookie clicker would recommend this game it is chill and will just be in the background doing it's own thing :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome, for a free idler. Great game to have running on the side while you're doing other stuff. Each phase of the game is varied enough to continue to be compelling, and the monetization isn't obtrusive at all. Some of the progression is more passive, some is more active, and it's fun working it out for yourself once it gets more complicated in eternity and unity. If you'd rather progress as fast as possible, there are plenty of guides to help with that as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to just sit back and relax, or race your friends to see who will be the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best idle games, has updates for huge additions of content regularly, and no ads, only buyables if you wish to support the creators.  I've put more time in this than i should have and will continue to do so",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is evil.\n\nIdle games, for so long, seemed to think that the trick was to make you do a lot of actions to make you feel like you were Doing Something, when you were doing nothing.\n\nThey thought the trick was to wrap all of the number-go-up in obfuscatory metaphors, to make you feel like Something is Happening, when nothing is really happening.\n\nThis game removes the clicking, and gives you hotkeys, and later automatic buying and macro programming, so you don't really have to do that.  You could even just leave something on top of the A and B keys and walk away for a while if you felt like it.\n\nThis game removes all of the artifice and lays bare the raw, unvarnished numbers, exposing the simple algorithms that govern progression.\n\nBy stripping it all away, this game shows you that just the simple act of making number go up is pretty much enough, as long as they add a few beeps and clicks to the interface and some actually pretty well done music to make you feel like This Is So Cool and You Are So Inspiring.\n\nAnd despite all of that there are so many layers to the game, and you have to ask just how much more there can be when it's actually just numbers, and apparently the answer is that there's a lot.  I haven't even reached my first infinity yet but it's clear there's a lot more here, I just don't know if I want to expose myself to it.\n\nThat's because, thanks to it being so stripped bare, this is the first idle game that's really hooked me.  The others made me think I was seeing through their deception.  This one makes me realise that there doesn't need to be any deception, and there can still be so much to the game.\n\nI think - I THINK - the trick is to add multipliers upon multipliers upon exponents, and then to find subtle ways to increase those multipliers, and those exponents, so that each level is a very subtle, slow increase on the previous level, so it slows down the game in the short term but over the long term it will pay off.\n\nBut to figure out if that's true, I need to play the game, so I guess I'm hooked.\n\nEvil.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple to understand the mechanics of how things improve but late game it can get quite tedious.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "multiple interesting layers and mechanics, countless hours of grind, would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just Eternitied for my first time, and I really like the rest of the game so far, but even with the in-game tutorial for macros, it's still too difficult for me to really get to understand them. If anything, I'd like the game to maybe add presets for things to macro, which preferably wouldn't cost souls, but that's not my shot to call; the developers could also, instead, add more instructions to the tutorial (eg. what blocks to place to automate upgrades, ascensions prestiges, etc.). For now, I'll just stick doing the whole thing all over again until eternity 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Realy nice and relaxing game to calm down after work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's quite good, I got bored as idle games aren't my thing anymore, but I can tell the love that went into this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is good, like actually quite in depth for an idle, and the music is good, and the graphics are nice, and it runs good\n\n\n but the only thing that would actually make me pay for a microtransaction is if one of the skins was a plinko board. Like, just a normal, randomized plinko board. Then every time theres a color, it drops a same color ball. And then, like, if its full, it becomes a waterfall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeap it's more than just watching it spin. Great idle game and still being updated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I feel like I babysit it too much to consider it an idle game, but it's a free game that I've put hundreds of hours into. Decent time waster",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is okay before the Minerals and Refinements. They don't make this game \"Idle\" anymore. But the rest is okay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice idler diffrent content and challanges and a progression that feels fun and satisfying wich makes the time you put in feel worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "May look boring at first but it gets SO MUCH MORE COMPLICATED. Still manageable tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to sit back and play nice break from reality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't know what it is about this game but it sucks you in and keeps you interested even though its the same thing over and over again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's really fun game, I love everything about it. It's also one of my favorite games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the deepest  \"idle\" game there is in terms of things to do and work towards, although most of the progress is from actively playing the game. Would still check it out if you like an idle game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very simple to understand and addicting to get into",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of the best idle games out there at the moment.  Progression feels great and there are 'walls' that you hit every now and then.  Devs are adding new content at an impressive pace, giving you just enough time to finish the current content before the new features/tiers come out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, lots of content for a free game, and updates are still coming out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun little idle game and just the fact that they're always updating it with new fresh idea... always a plus in my book.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very relaxing game and not to much time consumig.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "funny game with funny circles that funnily go spin (funnily) its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very grindy game but pretty fun to just let sit and watch the numbers grow.  As a free to play player, I feel a little constricted but not overly so since codes and free souls allow me some degrees of freedom.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly this game is brutally uninteresting before you unlock infinities . But once you have 1 infinity this idle game content becomes so abstract that what decision you chose, sped up the idle time by the right decision",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the more enjoyable idlers thanks to some fun, chill dynamics. I'm not wild about the existential crises I have contemplating eternity, but it's a solid game. One thing to work on: the English translation, especially when it comes to things like explaining the game's systems. The awkward English is nearly impossible to follow and gives the game an unpolished feel that it doesn't deserve.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a nice peaceful game if you like to restart over and over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is good I recommend. However, shameless copy of a far better game: Antimatter Dimensions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "has some crazy mathematical equations, it is funny and satisfying to play and mess with the numbers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've watched the game play itself for way too many hours. This game helped me go through a lot of difficult days of my life, I'm grateful you exist Revolution Idle !\r\n(and the incremental mechanics are the best ones out there, honestly the best of the genre)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very solid and neatly paced idle game. Could use some earlier QoL unlocks and you will definitely need some guides to solve some challenges, but it's pretty nice overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This a highly addictive game that starts with a simple spinning circle and draws you into a massive multi layer world of ever increasing numbers. Just when you think you have completed it another patch is realeased sucking up many hours of your life. a great game and a challenge to get tot the end.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very chill but slightly time consuming game, 27 hours in and barely have 50 achievements.... not saying that it's a bad thing though ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good idle game to have on in the background that gets really deep the more you get into it. It does occasionally have trouble starting up but this is infrequent. There are moments where you do really need to focus on the game when you are near leveling up, or in times where the game goes really fast, but this is usually infrequent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game. so much content and good content. it is very grindy but i love that about games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty addicting. The game play is somewhat basic though, although that's more of a flaw of the whole idle game genre, not this game specifically.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cash shop is a little bit jewish but luckily it isn't needed to play the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an Idle game with a lot of layers to it and has a large number of achievements to chase. If you like both of those things I highly recommend this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is actually pretty entertaining when you are bored enough, great for an idling game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the better games to sit back, chill and watch it all come to you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after 446 hours im still in the game and still new systems are opening up. the gameis actively updated (just a week ago as im writing this) and is well paced where you arent toooo stuck in 1 spot for too long. idk how the future updates are going to feel but so far so good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd say that this is one of the best idle games i've ever played, just try it yourself.\n\nAt the start it's a bit slow & boring, but when you start building up, it's great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an idle game. My kids love it. Infinity. Eternity. Super nova.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game mechanics and structure is just amazing !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WOW revolution idle is a very fun game it's a super useful product",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very addicting and great to just have running in the background",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very fun but there a certain parts where you get stuck for a while and it stops being fun for a bit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's alright for an idle game, but extremly grindy and long term.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very fun looking game, that takes a long time, so sit back and relax.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "while playing this game, my mind was revolutionized, changed, and have a revolution idle within itself",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Actually quite fun, nice to play when you are worried/scared and just want a time of zen and chill.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good updates, frequent updates, and unique mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't know how I put over 100 hours in the game. It's kinda the feeling that I want the things done ... but it's never done. Just got to the stars and I know that there is much more. So yeah ..\n\nIf you want to play a game where you dont play just watch - here you go xD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has become an obsession!  I pushed and pushed to 100% the game when there were just over 300 achievements.  I step away for a few minutes and when I return there are now over 400!  It is amazing the amount of love and passion for this game from the creators I feel when I am mesmerized by the spinning circles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Guess its ok, game gets updated often with stacking mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good game, but you're in for a grind just by opening it...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game isn't too complicated, really a relaxing game for anyone looking to unwind. It's extensive as well, so the gameplay won't end anytime soon. overall, 8/10 game. The only downside is the visuals, but even then, that's part of the calming vibe of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brill! Fun idle game with some unique progression.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Leave this game running in the background and you will keep on coming back to it. I've been enjoying it for a while now and just watching my number increase, and increase some more is simply fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Favourite exponential game that I've played. Really good features like challenges, eternity, unity and infinity which is really cool especially with the automatons, time flux and macro alongside it making it online and offline!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's not that bad, just a simple clicker but way different.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "please release content faster and slower, I do it all but it takes all my life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A bit different from the norm when it comes to incremental games, as this one changes the core gameplay loop every time you finish a section of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just want to say I haven't been playing for long but I really enjoy it love the background sounds and to me it is extremely relaxing. Don't get me wrong im not saying it is or will be im just stating my own opinion for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun idle game with somehow alot to do\r\ni would recomend if you like number go up games (like me)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i start the game. numbers start going up. i smile. numbers keep going up. i feel dopamine flow through my veins. i infinity. numbers go up quicker. ah yes, this is enjoyable. i eternity. number go up quicker even more. this is fantastic. i unity. my face falls. mechanics keep being added. numbers keep going up. when does it end. i check achievements. i am halfway through the game.\n\nabsolutely amazing 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing idle game that aint so idle, wonderful concept with many different idling ways, will keep you entertained for months",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has been delightful. Some of the systems can be challenging to track. Still, this game has a fantastic community that provides helpful tutorials and explanations. If you are still struggling, the community is more than happy to help you with any questions. Finally, this game is constantly adding new content to keep players chasing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game easy to get into. a small fun activity to keep you engaged while doing bigger tasks and a nice time flux option rewarding you for not playing the game at all times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun incremental game inspired by Antimatter Dimensions.\nThe game switches things up once in a while to keep things fresh and new contend is being added regularly.\nOverall it's well made and polished, I also appreciate syncing between Steam and Android versions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool rendition of an idle game. The time flux mechanic is a standout feature, allowing you to speed up the game and recharges while you're offline. The game gets pretty technical pretty fast, but there are guides on the official discord to help you find your way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Infinite time sink that is really rewarding up until the end. It does seem like the devs make the endgame incredibly hard until they can release an update to extend the game, then that part becomes more streamlined.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like idle games, this is for you. If you like automating, I hope you're patience can carry you through 100+ hours before things really take off. While I do believe progression is perhaps a touch too slow it still brings me back occasionally to creep forward on and on to the end... whenever that may be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Idle game that keeps you returning with offline progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best idle games for non extreme idle game players. Fun and simple, yet deep (if you want to be efficient) idle game that hooks you on!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly addictive game.\nIt’s fun and engaging.\nbut it’s also a massive time killer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game. Easy to sit back and relax while playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite a variety of mechanics as you progress through the game. Plenty of automations available to ease the tedium as you progress. Worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun, keeps your mind busy thinking about upgrades and such. Good idle game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great idle game with plenty of levels to keep it feeling fresh. Amazing selling point is that you can play on your pc, save and exit, then move to your phone. Cross-progression also allows achievement unlocks on steam. This may seem small but it is great QOL feature absent a lot of other games of the incremental genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty chill, with many numbers simple game, I think",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "for an idle game you sure have to do a lot of manual work, when you reach unity the game requires a lot of manual work, switch and you'll be stuck just switching zodiacs builds forever, and the game really fool you with the small bursts of progress, when you think things are going to speed up and you'll go back to idling the game throws another zodiac farming and switching right back at you. \n \nlike i dont even see it being any better or faster if you pay for the \"QoL\" options.\n\n\nif you want to play this, adopt a baby, that is more idle game play than this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Is a bit faster than other free idlers (which are extremely similar in content, e.g. Revolution Idle has so many similarities to Antimatter Dimensions, that it's borderline copying it), and at first you're excited to keep unlocking new bits of \"gameplay\" (I put this in quotes on purpose, because there is an illusion of choice, but the optimal way to play is so obvious that you end up waiting to click the thing once you have enough of the other things), but then each new stage asks you to re-do everything you've done before, which is fine when you can do it in a small fraction of the time it took you before, but it's not OK when it takes away the automation and you need to sit and watch flickering numbers again for the moment where you can hit \"the button\". At that point the realisation hits \"What am I even doing here? Is this fun? Is this even a game?\". \nSome elements aren't described at all in the game, not well in the wiki and you need to check pinned posts in discord or even then, just ask others to understand what things do in the game (e.g. the actual function of the time setting in the automation settings).\n\ntl;dr: Watch number go up, number go up faster and faster, then slow again, but faster again, then slow, then fast. Watch number go brrrr, but don't get epilepsy. Are you winning, son?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "loved the game until minerals, really ruined the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fake Ranking System, notice how the number goes up and up and does not matter what you do  it you stay at about the same place. p.s. explanations also suck",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While it is a fun idle game, the grind quickly becomes boring, and compared to the other idlers i have played, the pacing is a bit slow. While it is free, I would recommend others, as this feels more like a ported flash game than anything more substantial.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i liked the game whole time till unity update, i spent a while grinding unities and i got bored because there is not really any point and making \"perfect\" unity build seems too hard to me. i wish game was more straightforward there, i wish i didnt spend this much time on game that will disappoint me this much, hoping to get back to it but that seems too hard beause it is too boring and too repetitive on that part, i know that theres more content but its too hard to reach",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i was so close to completion and then the game updated and addded a billion achievements and and and",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this is sooo ass game it give malwer and spywear soo just dont download ths fuck ass game just dete it before u get hacked",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've only played about a half dozen incremental games but this is the worst that I've come across. It is very boring, you're essentially just clicking upgrades on the left as they come up...and that is it. There are no choices, strategies, etc, and the progress is very non-linear. For example, you might get from 25 to 35% to infinity over the course of a couple of hours, then going from 35 to 38% might take another couple of hours. You HAVE to presitige because if you don't you get stuck in a stand still. I don't like prestige systems in general, but they should at least be optional or less required. I've had the game up for three days and literally nothing about the \"playstyle\" has changed. Very boring game. Also, the game is using more memory than Chrome which at the time of this writing I have close to 200 tabs spread across five windows of.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very well designed, good progression systems, but intensely boring after awhile, Unnamed space idle remains my favourite long-term idle game by a mile.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to try out an idle game and had seen that a few of my friends had played this one, so decided to give it a try. But the game has been weirdly laggy for me? After the first time I played it, the game has been pretty constantly stuttering, which makes it a lot less enjoyable to watch and to play. I've played many games that should be far more demanding than Revo Idle, there is no excuse for a game like this to stutter every few seconds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Loved it at first, but the lack of clarity on what a promotion does really wrecked my enjoyment when it completely ruined my multipliers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Satisfying free idle game early on, cannot recommend purchasing upgrades as the game gets very slow and stale later on",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't waste your time the game goes nowhere and just loops you back to the start once you start progressing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dont recommend, it is boring.\r\n\r\nI only have 37 hours on this game because i left it running overnight just a few times\r\n\r\n1/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i wasn't ready to start from nothing again just because i reached infinity. automation is NOT worth it. completely killed all drive to play this game and apparently its a shameless ripoff of a different game. achievements give worthless rewards most of the time and their microtransaction system is clearly predatory, though i guess all microtransactions are. whatever. don't waste your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is overall a nice experience. But the game suffers from some serious time sinks that it loves to throw at you a little too much. One moment you're blazing through it. Then you're suddenly met with so little progress for 10s of hours its almost like you're missing something. Which sometimes you are, but more often than not its supposed to be slow so you're more likely to \"fix\" it with €. (Which only delays your suffering as the game always reveals more paid upgrades as you progress. So you'll either have to keep up the grinding or the funding.)\n\nCould seriously use a rebalance with all those time wasters.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for what it has to offer, its decent. but its just a ripoff of another game that I recommend way more than this. also, I'm pretty sure it uses ai \"\"\"\"\"\"\"art\"\"\"\"\"\" in some cases. This is the first, and probably only negative review i will leave on a game on steam.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Promote and prestige is not the same thing, thanks for wasting my time for a useless upgrade instead of 10 000x mult",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it woud be fun if i could publish the long as@ name that i rot not because i cant right it all but if it is to long it wont accept even if there is no apparent limit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seems to be targeted to a very specific demographic that gets unconditional dopamine hits from seeing ANY number go up.\nNever bothers to show you anything remotely interesting or beautiful.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's like nothing to look at it man. It’s just circles. If I’m playing an idler I gotta want to level up and get cool stuff. This shit just gets bigger circles",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am bored already playing this game. It could've been fun. alas",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kinda got boring after a while. Do not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is hell i got to infinity in 100h and i think its lightly too slow",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FPS limited to 60 FPS, terrible experience on 360 Hz.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ts so boring i almost slept while righting this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah, shits gay af bro. i crank my hog to this. 10/10.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poor man's Antimatter Dimensions",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "play scream collector instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "antimatter dimensions but a little worse",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It sucks. End of story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "preety cool but gets boring FAST",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i guess it's alright \nbut not THAT good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is way too long yo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too addicting",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't imagine anyone playing this for more than 5hrs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its shit (i like da game alot :D)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring game loop.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gets boring at infinity",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this game for 5000 hours on phone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Obscure cheating detected",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they banned me for my cheats",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i play it when i want to be bored",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its pretty repetetiv gamplay",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "revolutionary",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kinda boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no please no more",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kinda lame ngl",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fart",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "help me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dih",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yyyyup",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "jh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "w",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you value your time this game is not free.\n\nI feel like the game is relatively well paced with some faster sections requiring more input, and slower sections where you just have to wait, which is perfect for a game like this in my opinion.\nI really enjoyed the fun mechanics, the multi-layered prestige system, the UI, and the QOL features. And before I knew it I had 1,000+ hours in the game and all 240 achievements. I closed the game and was happy and satisfied, and if i had left a review then it most likely would have been positive.\n\nHowever the most recent update (as of September 2025) is the Minerals update. It felt sluggish compared to the rest of the game. The last achievement in particular was just the worst, I got ach. #319 on August 7th and I now just got ach. #320 on September 17. It didn’t help that in a post update patch the devs both reset everyone's Time Flux (stuff that you can upgrade & buy with real money) and nerfed Special minerals into the ground, essentially splitting players into two groups, those who had reached and gotten into Special Minerals enough to get ach. #320 easily, and those who had to grind for over a month…\n\nDuring this grind I decided to look at the Steam reviews for this game, and one caught my attention, saying this game was a reskin of Antimatter Dimensions. Surely it couldn't be that similar I thought, plus I now had more than a month to kill so why the hell not.\n\nAnd initially the games seemed very different. Instead of gaining score with rotating circles that increase your score multipliers, you have Antimatter Dimensions; The first produces antimatter, the 2nd produces the 1st, and the 3rd produces the second, etc. Then you reach your first “Layer of Prestige\" In Revolution Idle (Revo) you prestige to reset your score and circles and gain a production multiplier and exponent. In Antimatter Dimensions (AD) you reset your antimatter and dimensions to gain a multiplier on your dimensions as well as unlocking the next dimension (up to 8). The 2nd Layer of Prestige is also slightly different, both generally making things faster & stronger. \n\nThen in both games once you reach 1.8e308 you reach Infinity (another prestige layer), gaining an Infinity Point, you use these for various upgrades as well as Generators (Revo) and Infinity Dimensions (AD) which produce Generator Power and Infinity power respectively which multiply dimensions/circles in an exponential manner, and also both have the same system where the 2nd generates the first and the 3rd generates the 2nd and so on. Both games also have challenges where certain restrictions are applied. Completion provides a boost with faster completion times giving a bonus to a different upgrade. Eventually in both games you reach 1.8e308 Infinity Points and reach Eternity.\n\nNow I will give credit to Revo, there are plenty of unique features, more so as the game progresses like Stars, Animals, Laboratory and Supernova, but both games also have Eternity Milestones, Dilation, and Dilation Tree (Revo) /  Time Studies (AD) which are all functionally very similar. It seems like the developers of Revo were getting more creative and borrowing less as the game went on, with the last similarity happening at the final prestige layer Unity (Revo) / Reality (AD). Zodiacs (Revo) and Glyphs (AD) are extremely similar to each other which is interesting because up to this point the games were becoming more and more different, and after this point, Revo is completely unique. \n\nUltimately I think Pre Minerals Update Revo is a good game that has a cleaner and more polished aesthetic but that borrows a little too much from AD. To the Revo devs’ credit they do have a disclaimer in the credits that say some mechanics were inspired by AD, and the AD dev doesn't seem to mind. But if I were to rewind time, I would much rather give the money I spent to speed up the Minerals grind to the AD devs, and it does sadden me slightly that Revo has ~10x the player count on Steam. If you like Revolution Idle, you will probably like Antimatter Dimensions too, so give it a try. I mean hey it was good enough for the Revo devs to be “inspired”\n\nBut there is a reason this review is negative, and that's the Minerals update. Just an insane amount of grind compared to the rest of the game, especially ach. #320",
      "voted_up": false,
      "votes_helpful": 59
    },
    {
      "review": "It's... average. Painfully so. It's like if the person behind Cookie Clicker did more when it doesn't need to have more.\n\nIt also has AI art, something that needs to be disclosed yet the creators did not do that.",
      "voted_up": false,
      "votes_helpful": 117
    },
    {
      "review": "The game ends at minerals, if you manage to get that far I'd just drop it there. There is really nothing to look forward too. If you enjoyed the progression up to that point, it's not coming back. Developer followed in the footsteps of Clicker Heroes 2 greatest blunder and made an unavoidable time sink required to progress. I understand this is an idle game, but the progression up to that point was great; choices mattered there wasn't really a time wall because there was always a way to do more. It's not just the minerals either, it gets far worse in the rune section of the game.\n\nYou valued making stretched out content so you could slow down the rate of updates instead of making fun content. I would have been much happier if the game just ended before minerals, I would've waited for something as fun as the other progression layers. Now it's stuck like this, even if you add more content after minerals every player is going to have to deal with it before getting to the next fun part. It will remain a stain on the game.\n\nI have little faith it will ever be balanced in the future to be more fun. You've effectively destroyed your own games future, well done Oni Gaming & Nu Games.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Game switches up as you get further and further, it's fun to begin with and has a satisfying variety of layers that you work to, but further on it delves into a fair portion of micromanaging, strategising upgrades/point assignment, needing different \"builds\" to boost one currency then another and so forth and all sorts of mechanics that oppose the idea of it being \"idle\" in any form, switching game style like that half way through is just 👎",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "Nice game that needs lots of improvements to be \"good\".\n\nCurrently running in a lot of struggle when automating and then timeskipping. Although they warn you it might work just poorly - it works not at all. Sad if they take the time boost away that you build up for a while and wanting to speed up your progress with.\nI guess unless they fix this and quite a few other problems rather play other idle games.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "jittering text elements, so headache inducing\n\nIf you have ever wondered if center aligned text boxes that update at 60 fps is a bad idea (you haven't), this game will demonstrate it for you.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "for an idle game you sure have to do a lot of manual work, when you reach unity the game requires a lot of manual work, switch and you'll be stuck just switching zodiacs builds forever, and the game really fool you with the small bursts of progress, when you think things are going to speed up and you'll go back to idling the game throws another zodiac farming and switching right back at you. \n \nlike i dont even see it being any better or faster if you pay for the \"QoL\" options.\n\n\nif you want to play this, adopt a baby, that is more idle game play than this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Simple Idler game, leave your computer on, do some chores in game casually, progress when you want.\n\nI achieved infinity a few times, losing interest. Will probably just delegate this to some background game like a proper idler and leave the computer running.\n\nEdit 1*:\nHit 400 hour mark, it's here the game is finally hitting the idler stride. Until this point, it seemed very un-incentivizing to invest a lot of time and effort. I'm starting to enjoy, but will leave the review as a negative because it took such an investment before it became somewhat enjoyable. Will keep updating as I progress.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Is a bit faster than other free idlers (which are extremely similar in content, e.g. Revolution Idle has so many similarities to Antimatter Dimensions, that it's borderline copying it), and at first you're excited to keep unlocking new bits of \"gameplay\" (I put this in quotes on purpose, because there is an illusion of choice, but the optimal way to play is so obvious that you end up waiting to click the thing once you have enough of the other things), but then each new stage asks you to re-do everything you've done before, which is fine when you can do it in a small fraction of the time it took you before, but it's not OK when it takes away the automation and you need to sit and watch flickering numbers again for the moment where you can hit \"the button\". At that point the realisation hits \"What am I even doing here? Is this fun? Is this even a game?\". \nSome elements aren't described at all in the game, not well in the wiki and you need to check pinned posts in discord or even then, just ask others to understand what things do in the game (e.g. the actual function of the time setting in the automation settings).\n\ntl;dr: Watch number go up, number go up faster and faster, then slow again, but faster again, then slow, then fast. Watch number go brrrr, but don't get epilepsy. Are you winning, son?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The mineral update ruined an otherwise well paced idle game. Incremental devs seem to be adverse to the idea of players completing their games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "loved the game until minerals, really ruined the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fake Ranking System, notice how the number goes up and up and does not matter what you do  it you stay at about the same place. p.s. explanations also suck",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At first, it isn't really \"IDLE\" game. It has somewhat inferior QOL features and automation, and these are opened quite late.\nNonetheless, this game is not bad to play. UNTIL MINERAL.\nActually first dilation game play is also quite bad, it needs upgrading dilation upgrades EVERY 2-3 MINUTES. But that gets a lot better after first unity, but mineral is not. After you opened mineral and do a polish and refine, you MUST set your spawn mineral level every time you spawn minerals, by manually inputting digits. And merge by dragging mineral, and press refine and polish button every time when you want. But it should be done in EVERY 10 SECONDS, to maximize efficiency to get prestige point. This shouldn't be called Idle game, it is super active, tedious, and not rewarding. I highly recommend you to play antimatter dimensions, or play this until you unlock refine, and quit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was a fun relaxing game for a time but it gets too complicated in the end, first you get the option to have everything automated wich was very satisfying and then all the automation gets removed and i am supposed to set up macros with if statements and stuff to get it automated again. i want to see number go bigger and not watch an hour youtube tutorials to do basic stuff that used to be automated before what the hell",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The last few updates have been really terrible and made me not want to play anymore. Not only was the content questionable but they also, out of the blue, nerfed items you buy with real money. On top of it making the game more of a slog to play overall, you also can't trust any purchase going forward. It could, at any time, just be invalidated.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While it is a fun idle game, the grind quickly becomes boring, and compared to the other idlers i have played, the pacing is a bit slow. While it is free, I would recommend others, as this feels more like a ported flash game than anything more substantial.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i liked the game whole time till unity update, i spent a while grinding unities and i got bored because there is not really any point and making \"perfect\" unity build seems too hard to me. i wish game was more straightforward there, i wish i didnt spend this much time on game that will disappoint me this much, hoping to get back to it but that seems too hard beause it is too boring and too repetitive on that part, i know that theres more content but its too hard to reach",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No context, no lore, just a tedious chore. \r\n\r\nBe wary if you begin this game. It can very well take over a year to complete. You will be spending time looking up guides and explanations as to how mechanics work. I believe the game was translated into English as well.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "you will grovel over the corpse of your free time wasted watching lines go in fucking circles. I absolutely do not recommend this game to anybody with addictive tendencies. Find a better addiction. Heroin might be healthier actually. Do not download this game. If you do not heed my warning, prepare for an insurmountable level of regret and melancholy. It's just circles man, don't waste your time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is yet another example of \"THIS IS NOT AN IDLE GAME\".\r\n\r\nThis game requires LONG PERIODS OF ACTIVE TIME to get anywhere. You will get NOWHERE by idling, except gaining time flux. There is literally zero progression to be made offline or idle. \r\n\r\nThe game itself is fine for being a very active game, except Zodiacs are the worst system in the world\r\n\r\nAnyway, enjoy Revolution Active. Don't play this if you're expecting an idle game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i was so close to completion and then the game updated and addded a billion achievements and and and",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It takes far too long to achieve anything let alone get past the \"introduction\" to the game. It's just another big numbers get bigger game without any of the interesting mechanics to keep you coming back. the only reason I have nearly a thousand hours on this is because I kept falling asleep trying to make any significant progress.\r\nTLDR: Even at the price of free this is an overpriced waste of your time. Pokemon Legends ZA is a more rewarding purchase.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this is sooo ass game it give malwer and spywear soo just dont download ths fuck ass game just dete it before u get hacked",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've only played about a half dozen incremental games but this is the worst that I've come across. It is very boring, you're essentially just clicking upgrades on the left as they come up...and that is it. There are no choices, strategies, etc, and the progress is very non-linear. For example, you might get from 25 to 35% to infinity over the course of a couple of hours, then going from 35 to 38% might take another couple of hours. You HAVE to presitige because if you don't you get stuck in a stand still. I don't like prestige systems in general, but they should at least be optional or less required. I've had the game up for three days and literally nothing about the \"playstyle\" has changed. Very boring game. Also, the game is using more memory than Chrome which at the time of this writing I have close to 200 tabs spread across five windows of.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very well designed, good progression systems, but intensely boring after awhile, Unnamed space idle remains my favourite long-term idle game by a mile.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to try out an idle game and had seen that a few of my friends had played this one, so decided to give it a try. But the game has been weirdly laggy for me? After the first time I played it, the game has been pretty constantly stuttering, which makes it a lot less enjoyable to watch and to play. I've played many games that should be far more demanding than Revo Idle, there is no excuse for a game like this to stutter every few seconds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Loved it at first, but the lack of clarity on what a promotion does really wrecked my enjoyment when it completely ruined my multipliers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Satisfying free idle game early on, cannot recommend purchasing upgrades as the game gets very slow and stale later on",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't waste your time the game goes nowhere and just loops you back to the start once you start progressing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dont recommend, it is boring.\r\n\r\nI only have 37 hours on this game because i left it running overnight just a few times\r\n\r\n1/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i wasn't ready to start from nothing again just because i reached infinity. automation is NOT worth it. completely killed all drive to play this game and apparently its a shameless ripoff of a different game. achievements give worthless rewards most of the time and their microtransaction system is clearly predatory, though i guess all microtransactions are. whatever. don't waste your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is overall a nice experience. But the game suffers from some serious time sinks that it loves to throw at you a little too much. One moment you're blazing through it. Then you're suddenly met with so little progress for 10s of hours its almost like you're missing something. Which sometimes you are, but more often than not its supposed to be slow so you're more likely to \"fix\" it with €. (Which only delays your suffering as the game always reveals more paid upgrades as you progress. So you'll either have to keep up the grinding or the funding.)\n\nCould seriously use a rebalance with all those time wasters.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for what it has to offer, its decent. but its just a ripoff of another game that I recommend way more than this. also, I'm pretty sure it uses ai \"\"\"\"\"\"\"art\"\"\"\"\"\" in some cases. This is the first, and probably only negative review i will leave on a game on steam.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Promote and prestige is not the same thing, thanks for wasting my time for a useless upgrade instead of 10 000x mult",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it woud be fun if i could publish the long as@ name that i rot not because i cant right it all but if it is to long it wont accept even if there is no apparent limit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seems to be targeted to a very specific demographic that gets unconditional dopamine hits from seeing ANY number go up.\nNever bothers to show you anything remotely interesting or beautiful.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's like nothing to look at it man. It’s just circles. If I’m playing an idler I gotta want to level up and get cool stuff. This shit just gets bigger circles",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am bored already playing this game. It could've been fun. alas",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kinda got boring after a while. Do not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is hell i got to infinity in 100h and i think its lightly too slow",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FPS limited to 60 FPS, terrible experience on 360 Hz.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}