{
  "positive": [
    {
      "review": "Absolutely amazing game. I hate it and myself, but I'm still gonna keep playing it",
      "voted_up": true,
      "votes_helpful": 107
    },
    {
      "review": "i wish this game was smaller, this game is the size of GTA and fivem if not more? i cant even  play another game becuz how big this game is, i have been uninstall to play other games ;-; i enjoy the game but pls is there some way to drop down how big of download it is ( i have gta and rivals downloaded rn and they take up most of pc together so thats what made me question why rivals is so big )\n \ni got a pre-built PC, so dont think i can just add it in with out breaking a new ssd card, im no pc wizard i pay people to do it for me. so  i wish they could optimize abit. i didnt think there where so many nerds LOL",
      "voted_up": true,
      "votes_helpful": 52
    },
    {
      "review": "GAMBIT MY BELOVED!\n \nJokes aside, it's an ok game, came back to it after a long hiatus ( the game got boring to me) and yeah, you'll find some fun. The matchmaking isnt good and quite some players are toxic but in this year and age, i didn't expect better.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "I honestly had a good time with Marvel Rivals. The game is fast-paced, fun, and time really flies when you’re playing. The characters feel great and the gameplay is solid overall.\n\nBut the ranked mode… it’s genuinely frustrating. I’ve never had this much trouble with other players in any other game. Some matches feel like you’re the only one doing anything.\n\nAlso, I have to admit: the “Gooner-bait” skins are kinda crazy. They definitely know what they’re doing with those designs.\n\nOverall, the game has a lot of potential and delivers plenty of fun moments, but if you’re easily annoyed by bad teammates in ranked, brace yourself.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "★ ★ ★ ★ ★\n\nI give a 5 out of 5 Stars ★ for Marvel Rivals\n\nAs someone who watched all the Movies of the Marvel Cinematic Universe and after Playing Marvels Rivals, i now love all the Villians and dislike many of the Heroes especially Spider-Man\n\nI started playing from Season 4 only and the recent negative reviews are mostly from Season 1 & 2 players who feel the game has changed much since the Launch. But this is only for 1 mode the big mode that is Competitive Ranked Matches\n\nThe game however is a lot of fun and rewarding. As a free to play, it is pretty generous in farming different tokens to unlock cosmetic items but all Heroes are available for free. It caters to all types of gamers from casual to hardcore pvpers. As a casual gamer you can simply earn rewards with vs AI match in 3 different difficulties easy, medium and hard. There are also PVE events now and then.\n\nIf you want no stress PVP then you can play Quick Match vs other players who are mostly casual pvpers and chances are you will win most of the time. Also people are rarely toxic and very friendly in this.\n\nSo don't let the Negative Reviews scare you away from this game as they all are for Ranked Competitive only\n\nNow let's talk about Competitive ranked matches where things can be fun and pretty nasty\n\n- If you want to play Competitive then you need to be good at atleast 1 role\n- 3 Roles are Tank, Damage Dealer and Healer\n- You should be good with atleast 2 Heroes for 1 Role, important if the hero you play is already chosen\n- Each Hero has a difficulty level which indicates how hard it is to play with the Hero\n- The match making is quite unbalanced especially at lower levels which can be difficult to climb\n- Match making is much better at Gold 1 levels and above and it is even easier to play\n- Silver Levels are now being infested with Smurfs and trolls whose only objective is to de-Rank you\n- Too many casual players who have no idea how to play their Hero but try Competitive anyways\n- Chaotic gameplay with frontlining Damage Dealers who then blame healers for no heals\n- Most don't even know how to play tanks and some healers play Damage dealers instead of healing\n- Austisitc teens yelling over Mike in languages you don't even understand requiring Mute\n- Spartan Smurf Team with Discord who will wipe you right as you step out of the base\n- List is endless. But if you don't take it seriously then you can learn a lot and you will get better\n- You can go from 4 match winning streak to 12 matches losing streak\n- 90% won't know how to handle Spider-Man and he will continue to track & kill like Predator 1 by 1\n- If you play as healer prepared to be continously tracked by enemy team\n- Playing Ranked Competitive as a Solo Random could turn into an emotionally abusive excercise\n- Ultimately this is like BDSM. Its the Pain that makes you Horny for come back and play over and over again\n- you may need Therapy so take it easy\n\nOverall Marvel Rivals is a fun Hero Shooter that has just enough for everyone from Casual Players to Hard Core Sweats \nThe Fun you have depends on your Choice but be prepared to get frustrated and angry, yelling at everyone or you can get good by just learning and play better over time\n\nBecause Marvel Rivals is definitely one of the best PVP experience out there now\n\nCheers! Have Fun!",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "Fun fast paced pvp game. Get to play as your favorite marvel characters!",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "10/10 recommended for Marvel comics and movies fanboys!!! \n\nAfter a long time we get a game where developers are listening to what community wants.\n\nSo many amazing characters to play. It's super fun solo and much more fun with your squad.\n\nHave been playing since it came out. I hope updates and fun keeps going on.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "A competitive and team-based PVP shooter game based on Marvel superheroes.\nWith graphics from Marvel comics that make it look very attractive. The game is presented with a large number of well-known characters from the Marvel universe. Each character has its own unique characteristics, depending on the type of character you choose, the game can offer a shooting experience or even a beat 'em up game.\nIn the voice acting section, it has shown a very good performance, the choice of famous voice actors is an example of this.\nDespite all this, the game is also accompanied by problems, including the Matchmaking system, which in most cases is not practically balanced properly, and in the optimization section, the game still faces serious problems, the initial size of the game was about 50G, but now it has reached 100G!\nBut in the end, it must be said that the game still provides a good experience and during this time it has shown that it can be one of the best in its genre",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "feels like an enemies to lovers and lovers to enemies relationship",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The Average Marvel Rivals Experience:\r\n\r\nLoad into a game\r\nChoose your character\r\nEveryone else chooses DPS\r\nSwap to Support\r\nGame Starts\r\nInstantly lose first point\r\nOne teammate Leaves (everyone else still on DPS)\r\nNew teammate loads in\r\nChooses DPS\r\nLoses Second Point and the game\r\nProceeds to get blamed by your team when you were the only support\r\nLoads into next game\r\nThe entire enemy team is bots\r\nDevs then say EOMM doesn't exist\r\nRepeat",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "[b]I booted up Marvel Rivals hoping to swing into some web-shooting fun or hurl fireballs as my favorite hero, but after a quick round, I had to admit: this one’s just not my cup of tea. The game tries hard to mix flashy superpowers with shooter mechanics, but the mash-up ends up feeling more like a flashy costume party than a clash of Titans.\n\nThe visuals are colorful and punchy, it’s like playing inside a comic book that exploded in neon confetti. Powers fly, environments flicker, and chaos reigns as characters bounce, blast, and zoom across the map. If I were into over-the-top action and flashy combos, I’d get a kick out of it. Some matches even felt fun enough to make me forget my usual taste in steady-paced shooters.\n\nBut here’s the deal: the third-person perspective, the constant frenzy, and the power-combo overload make aiming feel more like “spray and pray, with flair.” For someone who prefers grounded gunplay, tactical decisions, or a good ol’ fashioned headshot, Marvel Rivals feels a bit too much like a fireworks show. I ended up dodging abilities more than aiming at enemies, and that’s a sign I’m not built for this kind of hero chaos.\n\nIn short: Marvel Rivals might be the perfect match for fans of bombastic, chaotic hero shooters, but for me, it’s a bit like wearing a superhero costume to a chess match. Fun to look at, but not really dressed for the game.[/b]",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Honestly, I went in thinking this would just be another hero shooter with a Marvel skin slapped on top, but it’s actually super addictive. The movement feels smooth, the abilities are flashy without being confusing, and the team up mechanics are genuinely cool when you pull them off with random teammates.\r\n\r\nThe game looks great too the maps have personality, and the heroes actually feel different instead of reskinned copies. I’ve mainly been playing Loki and Iron Man, and both feel super satisfying once you get the hang of their kits.\r\n\r\nMatchmaking is fast, performance is solid on my PC, and even when I lose, the game never feels frustrating. It’s one of those “just one more match” games.\r\n\r\nIf you’re into Marvel or team-based shooters, this is definitely worth trying. I didn’t expect to stick around this long, but here I am, completely hooked.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Peak game. I truly enjoy engaging with the Marvel Rivals community fr. You never know who you will get on your team LOL",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "if you love superheroes and fun fast matches , this game is for you , I love playing human torch",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love the new 18v18 mode. It's unfortunate that it's a limited time mode. Maybe permanently one day.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I especially loved the part where my GPU screamed louder than the superheroes. The gameplay is so balanced that I couldn’t tell if I was winning or just lagging creatively. Truly a masterpiece of chaos—10/10, would uninstall again",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game has been out for almost a full year and it keeps getting more fun with each new season/ hero/ event. \n\nIt's insane to release two new characters per season in a hero shooter, but they keep pulling it off -- each new character released has been genuinely fun to play.\n\nLooking forward to another year of updates and new heroes!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A really outstanding third-person fps game. The gameplay features are very similar to Overwatch 2, but it feels slightly more difficult to control. Maybe it's just because I'm not used to third-person perspective, but overall, the game is still quite fun.But no matter what, friends are the ultimate setup for the game; nothing beats fighting side by side with a group of like-minded companions.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "10/10 Hero shooter if you like anything Marvel related. This became my main mp game when it launched and for good reason. All the heroes are awesome and have fun kits, the devs are based and are always adding cool stuff to play with. Currently they’re releasing 2 heroes per season. \n\nLike many others, I came from overwatch and never went back (mainly due to the direction that game ended up in, not the same game I fell in love with back in 2016)\n\nAnyway, this game rules. And if you play it too, then you rule!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "this game can be enjoyed by ANYBODY because of its large roster of unique characters. personally, black panther is my reason, and that in itself is an ultimate gamble\n\nthe dopamine hit you get from becoming a speed demon and landing his combos is unmatched, but at the same time theres a 50/50 chance your combo breaks entirely because the server decides to not register your hit. game does not feel as responsive nor smooth as Counter Strike or Overwatch, but its still relatively new compared to those two and it takes time to optimize.\n\nremove some characters like Loki, C&D, and Namor and this game would be amazing.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "remember kids, a mixed rating here is still better than an overwhelmingly negative rating on Overwatch 2.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's ok. Devs actually do bother making the game better with patches (as of writing)\nDefinitely better to play with friends though as the matchmaking is kinda ass.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Do you miss the original Overwatch when it was about stories and hope and incredible characters and there wasn't a billion layers of role queue?\n\nWelcome home, this is what you've been looking for.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the best Marvel games, I really had never played this genre of games, this was the first one and i love it",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun casual shooter but the matchmaking needs some serious work if they want this game to have a lasting competitive scene.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you love to think about how much fun you will have when you get home from a long day of school or work on a game you love and then get the crap beat out of you in 10 ranked games in a row, this game is perfect for you. The characters are great (save scarlet witch and squirrel girl) and most characters take at least some skill to play and techs to learn.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Yeah... I mean, the ranked matchmaking is buns but the game is extremely fun in general. I got completely engulfed especially when it just came out, but it's still fun to play.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The Average Marvel Rivals Experience:\n\nLoad into a game\nChoose your character\nEveryone else chooses DPS\nSwap to Support\nGame Starts\nInstantly lose first point\nOne teammate Leaves (everyone else still on DPS)\nNew teammate loads in\nChooses DPS\nLoses Second Point and the game\nProceeds to get blamed by your team when you were the only support\nLoads into next game\nThe entire enemy team is bots\nDevs then say EOMM doesn't exist\nRepeat",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great game with a lot of characters and unique play styles, matchmaking is a pain, but nonetheless hella fun",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Cool and fun game, especially with friends!\nI see no gooners here btw, just jealous pedos from pedowatch 2.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Even if you have never cared for hero shooters, I urge you to give this one a try. It's free-to-play, and if you have any love for superhero properties you'll find a character you love among this motley bunch. It is certainly inspired by games that came before, but its fast, frenetic pace and secret strategic weight make it something completely different. Like a sidekick growing into his mentor's mantle, this one is ready to fight crime in the mean streets of Marvel Manhattan.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "in Spiderman when Peter Parker gets a spider bite the size of a golf ball he decides to sleep it off. this is a reference to him living in America",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "helloseason0,goodbyeoverwatch...waitwhathappened....itsseason...6...7....nowait...its4.5......andihaventplayedinsooooolong.....imissyoumarvelrivals.......maybewhentheyaddgambit.. edit: guess what.... they added gambit.... you know how long ive been waiting for this? whoo im bout make a name for myself yeah... my spacebar works too!!!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Over 800 hours in the game and the dopamine has finally faded from playing this game, it was fun while it lasted, great game full of terrible people. The feeling it gave in season one and two are some of the best gaming moments of my life. GG",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Lots of fun to play! Fun solo and even better with friends. Love that they show the difficulty of each character. Events and skins can be worked for without spending a dime, it does take a while but worth it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The biggest issue is here is being restricted from entering a match when you leave early during NON-COMPETITIVE modes. So if you are losing badly, you must endure it even though it is not ranked. Also, Ranked beacuse of matchmaking, smurfs in quick-play, and also shader loading times. I like the designs and gameplay, especially the team ups. Sure, there are some good and some really bad characters to play as but it is fun if you play casually. The only thing you pay here are the costumes but they don't influence the gameplay. Cool for casual play but frustrating if you play ranked.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I would recommend this game! It's been fun playing tank! It a unique overwatch like game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Apart from the weird roster for certain characters, this game was a huge surprise as I was literally under the impression it's gonna be just another hero shooter like OW2 and it is but also different. Performance issues were expected but were fixed as well. Overall. Love the game. ❣️",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've played hours and hours, still loving the content. Enjoying seeing my fave characters in this genre",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Frequent updates and seasonal events keep things fresh — sometimes it feels like Marvel is speed‑running its own Netflix series.\n\nMatchmaking is a circus: one round you’re Doctor Strange, the next you’re just a random civilian in New York.\n\nBalance issues (some heroes way stronger than others).\n\nCheaters and hackers pop up too — I even saw an Adam Warlock go full god‑mode and farming aura, thanks to a new bug that makes him basically invincible.\n\nMid‑range GPUs occasionally struggle, turning big fights into a flipbook straight out of a comics.\n\nBut visuals and effects are top‑notch, and despite the chaos, it’s ridiculously addictive..",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Marvel Rivals is a fast-paced 6v6 hero shooter that feels like a living Marvel comic book. The roster is full of iconic heroes and villains, and each one has abilities that really match their personality – swinging in as Spider-Man or smashing through cover as Hulk is genuinely fun. Teamplay is very important, many powers work best in combination, and the partially destructible maps make fights feel dynamic and unpredictable. The visuals are colourful and stylish, the sound effects feel impactful, and the voice lines add charm to every match. Some heroes can feel unbalanced at times, but with updates this can be improved. Overall, it’s a very entertaining game, especially for Marvel fans who enjoy competitive online shooters.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game so far, controls are easy to understand.\n\nGraphics are a 10/10. Runs at a constant 60 FPS\n\nCustomization is phenomenal. You can customize your character down to the veins\n\nNeeds more story though.\n\nAlso, Devs need to take notes on how Miyazaki designs the gameplay, but for what is given, the game is smooth with little/no difficulty.\n\nFor a Souls Like game, the biggest carry is the graphics and smooth gameplay. Still haven't tried out the VR support yet.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Some balance issues aside, Marvel Rivals is actually a solid game. If you’re into hero shooters, you’ll probably enjoy this one, and honestly it even pulls off some things better than other titles in the genre. The hero variety is great, and they keep adding new characters really frequently. The quality of these new heroes also keeps improving, with their abilities standing out more and feeling extra original or fresh in terms of gameplay.\r\n\r\nGameplay aside, the character designs, overall presentation, and animation quality are about as good as it gets, and the skins are often so cool looking that you actually want to get them, with the quality and designs being so good they are somewhat on par with Street Fighter skins. The best part is you can earn these skins simply by playing. The game adds events and challenges very frequently, and they hand out lots of free credits that you can pick up the cosmetics you want without spending real money and they give out high-quality free skins in general anyway. With all of this combined, it stands out as one of the best F2P games when it comes to monetization, it's quite fair and genuinely generous.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Pros: \n- Large roster of characters that feel mostly distinct from one another.\n- Visually appealing art-style in character designs, cinematics, and environments.\n- Frequent patches (although balance patches tend to show some favoritism ngl), community updates, and events.\n- Non-Competitive mode progression system for Heroes if you don't care about ranked.\n- A lot of Arcade modes available.\n- Feels very easy to get into if you're used to Hero Shooters.\n\nCons:\n- Still very unoptimized after nearly a year since its release.\n- Solo Queue will be a very mixed experience.\n- Frequently matched against entire teams of bots in Quick Match. (Almost like a pity match after you've just lost?)\n- Can frequently crash on most systems during gameplay.\n- Can frequently crash when compiling shaders.\n\nOverall, a fun game when played with the right people, and if it deigns to allow you to play uninterrupted. Marvel Rivals has a lot to offer, but still needs a lot of ironing out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wanna kill myself every time I touch this game\n10/10 would solo tank as magneto again while my luna snow ignores me while I need heals",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have a love/hate relationship with Rivals. It's a great game top to bottom for its category, but it definitely has it's drawbacks. For context, I'm a Venom/Cloak main at this particular moment.\n\nPros:\n- Fantastic Gameplay\n- Characters\n- Skins\n- Quick Matchmaking Algorithm (Usually very short waits)\n- The seasons don't drag on forever, so new content comes often.\n- There are plenty of opportunities for free content.\n- The actual gameplay is really good, and pretty simple once you figure your character out.\n- If character progression is something you care about, you're either going to love or hate this game. I find their system \n  pretty well thought out and fairly straightforward.\n- Good Healers\n\nCons:\n- It's a little gimmicky, like Fortnite.\n- The community, while noticeably improving, is still, overall, pretty toxic.\n- The quick matchmaking can lead to some pretty uneven matches.\n- Competitive mode is hit and miss to the point I pretty much avoid it.\n- Also, Competitive is completely dependent on your teammates. You cannot win on skill alone. I know that's the point, \n  but it doesn't make it any less frustrating.\n- The opportunities for free content are usually pretty laborious. They make you work for those skins.\n- Shaders take FOREVER when you have to load them.\n- They need to take Emma out of the lineup. This game is impossible to play one handed.\n\nI'm a casual gamer, usually preferring strategy and RPG games, so take all this with a grain of salt. But, for a free game, I would recommend Rivals. It can be fun (more so if you have friends to play with), but it is also deeply infuriating, and I generally prefer to relax while gaming. You're probably not gonna do that with Rivals. I have a lot of time in this game, and will continue to play it. I wouldn't say I have a lot of fun, but I do keep coming back to it. So, I guess take that for what it's worth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best marvel game so far, really strategised and team based game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty fun game to play especially with friends. Of course it's got its group of assholes but just block them and report. Devs are doing a really good job with balancing and creating awesome cosmetics",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "me and my friends love the game but i dont like the anniversary skins lol kinda disappointed",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, new characters and fun to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Marvel Rivals is pure fun chaos: unique heroes, smooth team combos, and a vibrant style that keeps every match exciting. Easy to jump into, hard to put down. A surprisingly great experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Marvel rivals is a fun game but also fun to annoy friends",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Being stuck in comp elo is like being stuck in one of those tiny china dolls, theres always a different problem.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game. Its really cool to play a as a marvel character is live action battle. Lore on characters are cool, comic references and collections are cool. It is repetitive but fun for awhile and here and there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, but Overwatch still holds the crown for me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like overwatch, this will be a good follow up. Easier to learn, not as hard to play and more forgiving overall. Like the map destruction and the obstacles that you can make in some places. Would recommend it to anyone.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Marvel Rivals is a refreshing take on the hero shooter formula. It captures that energetic, team-focused chaos we used to love in other games, but adds a polish and momentum that makes it stand out. Every match feels explosive, cinematic, and fast-paced, with just enough chaos to be thrilling without becoming a mess. It’s one of those games where every round tells its own little story, and you walk away with highlight moments whether you win or lose.\n\nOne of the biggest things it gets right is giving players access to everything from the start. You don’t have to grind for weeks just to try a new character. You’re free to experiment with different playstyles, combos, and strategies right away. Skins are where the monetization comes in, and thankfully, they’re handled well — stylish, detailed, and actually fun to unlock or buy. It feels like you're rewarded for playing, not punished for not spending. It’s a breath of fresh air in a genre that’s gotten way too greedy.\n\nNow, it’s not a perfect 10. Balance is still a work in progress, and it shows. Some characters definitely feel overtuned, and when one or two picks start dominating every match, the fun can take a hit. But the developers seem to know this — constant patch notes, buffs, and nerfs are a regular thing. It’s the kind of game you know is being watched and tweaked constantly. While that means no balance is ever permanent, it also means the game evolves, and that keeps things interesting.\n\nThe best part? The devs aren't holding back on content. We're getting new skins, events, and even new heroes nearly every month. Some cosmetics are just cosmetic, but others feel like love letters to fans — alternate looks, seasonal designs, and even crossover-style vibes that keep things fresh. It feels alive, like something that's meant to grow with the player base, not just sit still. You log in and there’s always something new to check out — whether it’s a visual update, a gameplay patch, or a new mode in rotation.\n\nThe core gameplay is fun. Teamfights feel dynamic, movement is smooth, and there's just enough tactical depth to reward coordination without making solo players feel useless. Whether you like fast engagements or support-style roles, the game gives you room to play your way. There’s a real sense of momentum in each round, and pulling off a win with a good team feels genuinely satisfying. Maps are detailed, destructible in spots, and designed to keep the action flowing.\n\nBut if there’s one thing that ruins it, it’s the players. The toxic ones, at least. Whether it’s someone trash-talking in voice chat or deliberately throwing the match because things didn’t go their way, bad behavior can drag down an otherwise great experience. No matter how well the game plays, the vibe can shift fast when teamwork falls apart. Marvel Rivals has the mechanics and design to be something truly long-lasting — but like every online game, its biggest challenge isn’t just balance or content. It’s us.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game i love playing with my frens and getting carried in top 500 gams uwu",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One day its smooth, next day im getting clapped by a bunch of tanks",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A Game That Delivers Excitement and Engagement\n\nI’ve never played much of  hero shooter games , but when I first tried Marvel rivals I couldn’t stop playing I wasn’t expecting it to hook me the way it did but here I am, completely immersed.\n\nFrom the very first match, the game’s attention to detail stood out. Whether it’s the smooth loading screens or the epic soundtracks that accompany them, everything in this game feels polished. I remember the first time I heard the loading musicit gave me chills  It’s rare for a game to create such a memorable first impression but rivals definitely does\n\nThe characters in the game are constantly being updated Every month, there’s something new \n a new hero or fresh content and that keeps the gameplay feeling aliveThe developers are clearly dedicated to giving us a dynamic experience and it’s exciting to see how the game continues to evolve\n\nOne of the things I really appreciate is how Marvel rivals treats its player base. The skin prices are reasonable, and there are plenty of free rewards to keep you coming back It’s honestly one of the most generous games out there when it comes to player rewards I’ve never felt like I was being pressured into spending money which is such a relief compared to other games\n\nThe constant updates balance tweaks, and the way the developers listen to the community make this game feel alive. They’re always working to improve and fine-tune the experience, and it’s clear they value the players input\n\nUltimately Marvel rivals has become a big part of my routine It’s not just a game I play for fun it’s something I look forward to. It’s been a pleasant surprise, and it’s exactly the kind of game I didn’t know I needed \n\nBtw w voice actors",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good game funny and have good maps",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is incredible until Jeff eats your entire team and self suicides with them",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super hot skins games pretty good but if they dont nerf scarlett wtich i will be very sad",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Will always love the graphics in this game! Still one of my favorites.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a fun game to sit and play i love that you play with a bunch of people who play diffrently than your self",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ummm if the matchmaking wasn't so bad I'd play it a lot more, but yeah that's universal across these games",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "(for the steam award points) its fun, has decent events, fair battlepass's, and overall has stayed fresh for a year. It's not like overwatch where I feel like i've seen it all after a few matches. Lots of hero and map drops that hit a good pace. Teamups shake it up and change the game. The devs also don't seem afraid to try things when it comes to abilities/passives/buffs/nerfs that keep it worth while to keep up with multiple champs. even if they arn't \"meta\" or the most \"broken\".",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game can very fun and can be very not fun. the community is very split. you can have some really good and nice players and then you can get some of the most spoiled rotten 12 year olds (who really are probably closer to 30 then 20.) playing the game and freaking out when they don't get the  hero they want and will throw the game even after someone swapped off for them post temper tantrum just to prove their emotional maturity. this game game would be so much better if that wouldn't and if eomm wasn't apart of this game. still fun when you have a stack or at least a duo to play with",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The things i like about this game is it starts instantly no wait and i have no problem with network. And choose any character you like but for me it's ok, ok game not that much fun for me still try to understand how attacks work like it's kind a difficult to kill enemies. i dont no which character is best for my style. Hope i will able to play as good as others but yes it's must try game definitely check out this game maybe you find this enjoyable and you have friend then definitely go for it's free and very good graphics also.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Smurfing is a major issue and punishments are severe enough for throwers.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has been out for a year and I still love it. I still enjoy to play it and I got to know a bunch of nice people because of it. I never played Overwatch/(2) or anything similar to this type of game so I cannot compare it.\nI love it because it is Marvel themed and offers a lot of different game modes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay is very good, lots of cool characters. Sadly Matchmaking feels weird sometimes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i like the artstyle of the game. and i am big fan of marvel studios. This game is more interested to me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really  do enjoy the game. There are days  I tend  to truly hate  it , but 1000  hours in and played the game since season 0 and I still cannot get enough. I truly do recommend you give it a try. After a certain point the community does truly tend to get to you, but if you pushed past the ego driven  players it truly is a good game. Im someone that constantly plays on high ping due to the area I live in and this game is also very fogiving for those. I highly recommend.  The devs do take what the played want into consideration  and they truly do listen  and they want to make it a better space. The implementations are  really getting better and better with time. The PVE mode added not to long ago is totally something you can lose track  of time in. The social hub they added to  where people  can have fun being silly and just communicate  was also just a  plus .",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Greetings, Rivals!\n\nWe're thrilled to announce the upcoming patch drops on November 27th, 2025, at 09 : 00 : 00 (UTC)! This update will be deployed seamlessly, with no server downtime required! Simply log in after the update and jump right back into the action.\n\nHere's what's coming in this patch:\n\n \n\nMarvel Rivals Anniversary Celebration - Rivals' Day 2025\nTime flies when you're saving the entangled universe! Marvel Rivals is turning ONE, and we're ready to celebrate with you. From epic victories to those \"Well, you can't expect to win 'em all.\" moments, it's been an unforgettable year alongside all of you, our Rivals.\nAs we mark this milestone, we want to thank you for every heroic memory and promise even more legendary battles ahead. We hope Marvel Rivals will continue to be your companion in the days to come, as we create even more thrilling stories and forge new friendships. Our story is just beginning!\n\nPhase 1 of the festivities kicks off on November 27th at 09:00 (UTC). Don't miss out!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely amazing game. I hate it and myself, but I'm still gonna keep playing it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Definitely not reviewing this masterpiece game full of gooners with regular patches, updates and events for a steam community Badge ;)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty Good game for casual players but require high-end pcs to play the game smoothly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun game. If you played and liked overwatch, this is pretty much the same feeling but in thirdperson",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "REVIEWS BY FRIENDS\nSquigga\nSquigga\n15 games\n1 review\nThis review is counted in the overall review score because this user purchased the game directly on Steam or got a free license of a free game\nRecommended by Your Friend\n297.4 hrs on record (3.4 hrs at review time)\nPOSTED: DECEMBER 6, 2024\nW game\n \nWas this review helpful?\n Yes\n \n No\n \n Funny\n \n Award",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "NAM NAM NAM NAM NAM NAM NAM NAM NAM NAM NAM NAM NAM NAM NAM NAM  skins NAM NAM NAM NAM NAM NAM NAM NAM  gameplay NAM NAM NAM NAM NAM NAM NAM NAM jeff",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game keeps me connected to people I love. It plays great and is always pushing to be better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pros\nFast paced games \nCharacters are well designed and fun to play\nQuick Queue times \nGreat game with friends \n\nCons\nsome going 39/9/1 and only getting SVP and some one 28/8/23 gets MVP \nDoesn't matter if you do good MVP system is rigged\n\nRank take so long to find a game, but when you find a game you have teamates that don't help you \nDisconnected teammates\nInstant lock DPS players",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Another 500 hours to GuangGuang. No matter how angry I get they always got me coming back. Unless they remove Spider-Man from the game entirely I will never say anything bad about the game <3. Can't say the same about the people playing...Some of y'all are pathetic and need to learn this is just a game. Your ELO and rank will not be your legacy and God will not let you into Heaven just because you got a Penta. Grow up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "How to enjoy Marvel rivals:\nPress play\nGo into comp\nBan the usual meta OP characters or watch someone ban a character that probably made them salty before\nSomeone gets salty they didn't get their insta-lock and tries to ban them *cough* lord spiderman *cough*\nDoesn't work, they begin to throw the match\nTeam mates begin to argue with each other getting more toxic over time\nsomeone initiates surrender\nMatch loss\nRinse and repeat\n\nBesides that, if your a huge marvel fan, this is for you and will make you come back for more pain each time.\nThanks netease for this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game randomly came out of nowhere and filled the hole Overwatch 2 left within me.Same formula but improved and polished with way more passion and dedication then anticipated,with constant updates and responsive developers who know ther community well.The only issue i have is the Matchmaking being very polarizing,either you win with no sweat,or you lose in less then 5 minutes.Even with that,when the game work,it really works.Also ofc,Glory to China for letting us see boobas in the big year of 2025.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is fun overall, just not a fan of the Resource Rumble mode. A role queue would also be really nice.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Marvel Rivals is a fun team shooter, and it’s way better when you play with friends since the teamwork makes the matches feel more chaotic and funny. The coolest part is seeing famous Marvel heroes fighting each other, like Spider-Man vs. Iron Man, which you don’t usually get in the movies. It’s not super serious, just a chill game to mess around in and enjoy the superhero mashups.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cool game, similar to OW and such but for Marvel fans",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really love Marvel Rivals. The gameplay is fast, fun, and chaotic in the best way, and the heroes all feel great to play. The abilities, team combos, and overall style make every match exciting. If you enjoy hero shooters or you’re a Marvel fan, this is definitely worth jumping into.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoy the game — it’s been a lot of fun overall. But lately, I’ve started to feel like the matches are unbalanced. Sometimes I queue into a game where my teammates feel like pros, and I barely need to carry anything. Other times, it’s like they just downloaded the game yesterday, and I’m the only one actually trying.\r\n\r\nI want matches where the challenge feels fair. I want to feel like I contributed, but also that my teammates contributed — not games where there’s a huge skill gap. I want that sweet spot where a win feels rewarding and hard-earned, and a loss actually hurts because it was a real contest.\r\n\r\nIn short: I want more balanced games, where results feel meaningful — not just one-sided.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best hero shooters currently available. Pleasant visual style, interesting mechanics of map destruction and rebuilding, variety of game modes. The developers are always organizing events. Donate is only needed for cosmetics, and you can get donate currency for free thanks to events. There are many different heroes, and the heroes are beautiful, without any \"woke monsters\". Quite respectful attitude to the Marvel Universe, many characters are taken from the original comics and sometimes even made better. \n[b]The only thing I ask the developers is to improve the player matchmaking system[/b]. Then the game will be unrivaled. Congratulations on the First Anniversary!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not the usual guy for this type of game, was sceptical about it, especially being in the Marvel universe. I was wrong the game bangs. Much more fun with friends tho.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Favorite part of the game is when my punisher stands in place taking all the enemy teams dmg like the good boy he is and then sucking himself off with 1 finals, 6k dmg and 24% accuracy.\n\n10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Most rewarding, satisfying, competitive, polished, inspired, and consumer friendly live service game I have played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is complete dogwater, the community is toxic, and I feel miserable playing it sometimes. 10/10 Recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Marvel rivals is super fun only downside is the community and how toxic the people can be in this game. Its better if you play this with friends but other than that its amazing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Like Overwatch 2 but with characters actually well written, an unfolding story, fun gameplay and a company that delivers when promises something.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Overwatch - 151302[/b]\n\n[b]Marvel Rivals - 37533[/b]\n\nIt has a lot of work to do if it wants to catch up but with the amount of waifus and big round bubble butts in this game I'm sure it's going to stand the test of time and become a true Rival to Overwatch one day!\n\nand the gameplay is alright too I guess",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hop on\nYou are the only support in a team with 5 other DPS\nGet fried\nGet told L heals and you're the reason you lost\nYour Spiderman is 2/13 and DareDevil must be blind with that 3/11\nContinue this for a 15 game losing streak in ranked until you realise you'll be hardstuck silver forever\nRepeat every day\nThis game is just peak",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "i'm returning player from the first 2 seasons. I remember the comms were all friendly and helpful back then. Today i wanted to play again after couple of months (i got bored). One match in and get i berated instantly for mistakes from a well-performing player and despite me trying my best, then one other player even suggest me to delete the game and to stop playing. \nThis level of comms does not change in the next two match in succession. This happen to me while im at the literal lowest rank as a returnee. How was i suppose to have fun ? Mute all player ???\n\nSure disabling chat is an option, but that takes more in this game that is designed to be cooperative and communicative. \n\nIs it possible that the the people left playing that at the bottom are the sweatiest ones with bad behaviour ?. The game seriously need to implement behaviours score or comms rating. I couldn't imagine what kind of behaviours i would have to face with above this bottom rank (Bronze III). \n\ni think most player that stayed since release may not realize how toxic they are--and yes i know since i have played Dota. \n\nThis barely 2 hours matchmaking have left a sour taste--only a self hating and miserable player would continue to play. \nI'd understand the moba toxicity (mostly banter and justifiable) as the part of the experience, the game is designed to cognitive and emotionally draining. \n\nBut this game toxicity seem so out of place. I just want to have fun man !\n\nEDIT (15/11): \n- Wow-Okay !! I didn't expect my review to get these many replies (meany and goody). Those still in doubt whether to play or not, maybe should dive in yourselves. I'm sure marvel rivals still give you some level of entertainment. Especially when you hoped in a good team with roughly on par skill level (well not me at that time). \n- I suppose the way to maximize the game experience is try to play with your friends as a stack, so at least you can flame and be toxic together against other stack. Just don't gang up bully on lone player, that is not nice! (hence this review creation).",
      "voted_up": false,
      "votes_helpful": 426
    },
    {
      "review": "I've put a good chunk of time and money into this game. With this being said, as time has gone the game has decreased in quality and has left behind that uniqueness it had against other hero shooters at the time. Characters feel poorly balanced compared to launch (to be expected in some degree, BUT NOT THIS MUCH), CLEAR use of EOMM yet the developers deny it alongside a toxic and disgusting community that makes me not want to play the game, nor be apart of it's fanbase. Also don't get me started on ranked, it's a pure hell hole that no matter what rank you are you're going to be met with leavers, instalock dps' and people so up on their high horse that they'll try to gaslight you into thinking you're a problem due to their lack of communication skills with the team. I've spent countless hours with my friends playing this game and it honestly has lost it's charm since Season 0, which comes with coarse of a games life cycle but the game has been on a constant nose dive since season 3. Sorry Guang Guang but I must part for my own sanity. FIX YOUR BLOODY GAME!",
      "voted_up": false,
      "votes_helpful": 128
    },
    {
      "review": "Peaked GM 1 first few seasons and burnt out before even wanting to push to Celestial and then took a couple breaks in between then and now so my opinion isn't an uninformed one.\n\nOverall the game is a lot of fun but that fun is overshadowed by the incredibly poor matchmaking. The more you play the more you realize how engineered your wins and losses are. Anyone saying there isn't some sort of EOMM/SBMM is either lying to you, doesn't understand the system well enough to speak intelligently about it, or they are playing some sort of semantic mental gymnastics. Also remember the devs aren't legally obligated to tell you the truth so their word doesn't really mean anything on this topic either. MOST games (7 out of 10) don't feel like even match ups and over time that wears you out and makes the game more frustrating than fun. As long as you understand going in that it's not actually fair fights then go for it. If you want a truly competitive game that will test your actual skill against like players then you'll ultimately be disappointed.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "600 hours of hell: how the game turned into a piece of shit with EOMM bullying\n\n+The only game that has no agenda or other bullshit\n-I'll say it right away — it burned me out, it's just fucking hell. I didn't play games like this before, but after 600 hours, I realized — it's a piece of shit. I'll start by saying that the game is appealing because at the beginning you kill everyone and everything. This applies to both regular and ranked games (as it turns out, you're playing against bots). Starting with Silver 2, everything that moves starts to rape you. Complete assholes play for you, and you rarely come across normal people. The enemy team always has a bastard playing Spider-Man, Wolverine, or Black Panther who single-handedly destroys your team without pause. You'll be lucky if  (support) doesn't rape you too.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "Chinese team game with american superhero style skin = Profits",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": ">force players to play 10 placement matches in ranked mode - teams of a maximum of three\n>the purpose of placement matches is to better distribute ranks\n>play 10 matches\n>still have trouble finding matches, even though you have selected different regions of the world\n>if finds a match - it's against former diamonds/grandmasters\n\nthis game is a disaster, if it comes to matchmaking",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Like many competitive games, Marvel Rivals is fun—right up until you start taking it seriously. The community experience quickly falls apart, largely because the open-queue system is fundamentally flawed. It allows team compositions that simply don’t work, and the player-ranking system becomes unreliable when you’re expected to perform equally across all roles, among other issues. Most players clearly prefer DPS, so you end up rolling the dice on team balance before the match even starts.\n\nOpen queue does have its upsides: it felt fresh at first, it adds variety, and queue times are shorter. But these benefits come at a cost. In an ideal world, this system could be great. In reality—when you factor in immature, self-important players, or people who don’t have the time to play all roles and would prefer to specialize—the experience falls apart.\n\nIt also feels like the developers tried to compensate by giving each role a few overly simplified but overly reliable heroes. I’m not a fan of this direction. It lowers the skill floor for accessibility, which is fine on paper, but the advantages only really shine when you have a team willing to adapt. And based on my experience, that’s not something you can consistently rely on. It should be the game’s job to minimize the number of “bad matches,” not the community’s—and right now, the game is failing at that.\n\nThe frustrating part is that Marvel Rivals launched with a lot of genuinely smart improvements to the hero-shooter formula and a surprisingly large amount of content. But at this point, I think the devs need to slow down and focus on fixing the underlying systems instead of constantly adding new heroes, new maps, and balance changes. It’s getting harder to keep up with, meanwhile the core issues remain untouched. Quickplay being a pretty horrible game mode to learn new heroes in it's current state is one that contributes to that.\n\nAnd then there’s the optimization. The game looks great—especially for a competitive title—but it should run better on new, modern hardware without having to drop everything to low in conjunction with upscaling to get a competitively playable experience. I don’t mind upscaling on its own (it helps a lot for minimal cost), but this game is really pushing the limits of poor optimization. It still needs work in that department.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "It's basically third person Overwatch reskinned game with Marvel logo slapped on top. No need to say alot about it as both share same things about em. Horny frustrations over characters' models and toxic/hostile players if not played by their meta competitive ideologies.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Requirements are astronomous and Optimization are crappy\nYou also need DX12_1 to play it which alot of Older GPU's don't have...\nThe game it's good and all, has it's flaws of course but being forced to play it in the GeForce Now cuz the optimization it's bad? naaah this gotta be a joke, it's not GTA VI kind of Graphics, more closer to Valorant.\nIf my PC can run CS2, Fortnite (which who could imagine it's also based on the Unreal 5) it should be able to handle this, but after 2 years (this has been around since the BETA) and they haven't fixed already? or they don't know how to do it or just don't care, either way, decent game but I won't recommend because if you got broke friends u can't play with them and playing any competitive game w/ randoms it's a pain",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "First of all, this is a horrible game. I’d like to say I have a love–hate relationship with it, but frankly, it’s just hate. To this day, I cannot come up with a single compelling reason to play it. I genuinely tried to think of anything positive and came up with nothing. The game is not fun, and it does not feel satisfying in any way.\n\nOne of its biggest issues is the extreme inconsistency between matches. Losing makes you feel miserable, not only because of crazily unbalanced matchmaking but also because the game is poorly optimised. It’s also painfully obvious that the developers prioritise quantity over quality. Their constant stream of updates feels directionless and sloppy. I would much rather play a game with a solid, stable foundation than one that fundamentally changes every few months. If they stopped updating this game, I’m convinced the entire player base would disappear, unlike older classics such as Team Fortress 2. The lack of cohesive gameplay design is obvious even in basic elements like movement abilities being bound to different keys for absolutely no reason, which is by no means user-friendly. \n\nThat said, I have to give the developers some credit: they have somehow created the perfect formula for an intensely addictive game. Most of that comes from the inevitable 50/50 win–loss ratio the game tries to shove down your throat. The issue is that wins often feel meaningless because they are too easy, while losses can feel devastating. You feel powerless while being stuck with bot-like teammates facing veteran opponents. The only real positives I can acknowledge are the art style and a handful of unique abilities. And of course, they have absolutely mastered the art of monetisation. They know sex sells, so nearly every skin is designed as a thirst trap, men and women alike. It’s effective but incredibly scummy. \n\nYou might then ask: “If you hate it so much, why do you have so many hours in it?”, and the answer is simple: it’s the most common game my friends and I can play together. Although playing together is far from quality time, most of it is spent complaining and raging. Maybe 5% of matches, we actually have a pleasant conversation alongside the chaos. And honestly, I’d much rather play Overwatch, simply because it's more my cup of tea and is a more polished game by all means. Marvel Rivals feels like a worse, broken version of Overwatch, and I even think some people only started playing it out of spite toward Overwatch 2. As someone who is only a below-average Marvel fan, even I can say this is a poorly made title wrapped in a Marvel skin. Strip away the Marvel branding, and nobody would be playing this garbage.\n\nAs a final note, Galacta’s annoying voice is the cherry on top of this already unbearable heap of trash. At the end of the day, when I’m unsure what to play, Marvel Rivals serves as a reminder and a perfect motivator to play absolutely anything else.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game I wont lie had a decent start but this game's problem is more of a list than overwatch which says a lot. \r\nthis game's community are vile, downright poisonous to everything that comes into contact with them. Everyone is rude or has an ego or in some way will verbally make you feel like you are nothing, its unhealthy \r\n\r\nas for the heroes they are interesting in concept but there is a major power problem. supports for example every single one (I dont care what anyone says) they all in some way stop everyone else from playing the game in some capacity or fully diminish another set of heroes.  again can tbelieve I am the one to say this but in spite of every issue overwatch has there is some form of harmony not saying everyone is balanced but no ONE hero makes the game stop for both sides.\r\n\r\ncomp is as trash as the rest of the game ( there is no climbing from the bottom rank solo you will have only bad games. they will sprinkle in wins to make you want to stay and falsely believe you can climb) \r\n\r\na combination of a uninviting community abusing a broken game it can best call it a distasteful bland hero shooter slop that does not welcome casual players to the ring \r\n\r\ndo not play this, truly if you value enjoying yourself play literally anything else.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "crappy game ,crappy matchmaking, would rather play overwatch",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It really blows my mind how this game has so many active players. It is easily one of the worst hero shooters ever created, zero thought is put into the balance or hero design. The matchmaking is a joke, the player base sucks, what keeps people coming back? I played for the first time since season 2 and it blew me away how clunky this game feels compared to everything else on the market. Not to mention nothing has changed, the meta is still exactly the same with a insane amount of healing making everyone feel like a giant bullet sponge, there is zero satisfaction in shooting someone 90 times just for them to still be at full health. Not to mention the sensitivity on the chat bans now is absolute insanity, just disable chat at that point.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This Game used to be good until the matchmaking went downhill. Literally you can be in a 3-4 losing streak and your teammates will just be bots or you'd just be facing bots communities. Toxic half of them. Don't know what the heck to do even though the game's been out almost a year. If they fix the matchmaking the game will be 10 times better. So this is why I'm going to have to give it a negative review.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game used to be around 20 - 40 gb but now? Almost 100, for what? A new fucking character?\r\n\r\nAss game 0/10 wouldn't play again",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "neverchanging healer meta, shitty matchmaking and bot lobbies ruined this game and all the potential that it has",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "They murdered what would have been an insanely good game with the most clearly manipulated matchmaking I've ever seen. Your individual performance is irrelevant. You can consistently fill every roll and have the highest stats in the match for that roll and still lose as much as you win. The more you play the more it becomes clear that the games outcome has been predetermined and your decisions and mechanical skill only actually affect the matches that actually are balanced, which is 20% of them at most. \n\nThis especially makes ranked solo queue unplayable, which is likely what you'll be playing at this point as all of my friends have dropped the game for these reasons and now I'm the last one left to drop it.  I'm sure this applies to many others as well.\n\nRather than addressing any of this, they are deflecting that they \"don't use eomm\" rather than just fixing the issues people are having. They are more interested in posting a vain clarification video to defend their poor matchmaking design, from one specific claim about eomm specifically, rather than actually updating the game so that people stop having these criticisms. \n\nIf you play the game enough, you will have experienced many occasions where you go to your history and see the enemy team be consistently several ranks higher or lower than your entire team, or, arguably even worse, where one teams peak rank is several ranks above or below the enemy, or even better, both of those at once. Had a game yesterday where my entire team peaked gm2 and the enemy team all peaked celestial 2 at minimum. Either the matchmaking is incredibly incompetent, or it's rigged. Those are the only explanations for this common phenomenon.\n\nThe devs can cope and deflect that people are saying the issue is solely eomm and they don't use eomm therefore there's no issue, they can cope that its because match search times are why this happens even though if you intentionally cancel the matchmaking search after 20 seconds to force quick matchmaking it demonstrably doesn't improve matchmaking at all. They care more about their image than their game. Their refusal to add the option for longer searches for better match quality makes this cope seem suspicious at best and clearly a lie at worst. They will add every possible thing before fixing the matchmaking despite the overwhelming tidal wave of criticism. I promise you the game will get a minecraft style mining mode or idle farming game mode before they actually try and make matches balanced.\n\nI would be livid if I were one of the people designing the actual game itself, which is really really good, it has to have the best character design work I've ever seen mechanically, only to see my work be rendered completely unplayable by a matchmaker that will consistently give you miserable matches, whether you are stomping or are getting stomped. It is impossible for the game to feel dynamic and impactful when you are either paired with impossibly incompetent teammates or fighting impossibly incompetent enemies. Its basically an idle game at this point. You either go on auto pilot against morons who constantly stagger and make mistakes or you see that it's your team staggering and constantly making mistakes so you just play as defensive as possible so you can at least lose a little less because it's obvious you won't win. I would love to know what percentage of ranked matches have a surrender attempt. I bet you it's at least 80%, if not 90%. All of the games good design is irrelevant when this is what the matchmaker is doing. \n\nPeople complain about throwers but honestly the more I've played I blame them less and less, they are the symptom not the problem, this game has so many throwers because the matches are so unbalanced, it trains you to see patterns so you know you are going to lose matches before they're even halfway done, so why even try at that point. It really does make more sense to surrender like half your games, instead of wasting 10+ minutes with teammates that just feed and stagger and waste ults and never counter pick.\n\nAnd in a couple days they're making it so below celestial, you can 6 stack. so the already unplayable solo queue is now even worse. You will, no doubt, be trying to fight a 6 man discord call while your teammates are eating glue, or, you will have the five stack on your team and the enemy will be eating glue. It's hilarious. Check your win rate, if you have a positive win rate, odds are you'll be fighting them, and vice versa. The game is an actual joke.\n\nI'm sure this can all be deflected via the \"skill issue\" cope, as the game says I'm top .7%. Maybe when I reach top .1% these criticisms will be valid. Whatever.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "От игры ощущение что каждый матч как день сурка. Одно и тоже, одни и те же составы команд, одни и те же ситуации. Разрабы тоже странные и берут персонажей, которые в оригинальных комиксах убивают людей взрывающимися картам и превращают их зачем-то в хилеров. И 90% скинов в игре это заовердизайное недоразумение, с слишком большим количеством ненужных деталей.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "devs have no real vision for their own game, seemingly focused on appeasement of the playerbase over actually making a competent hero shooter.\n\nthey have absolutely 0 confidence in their own design ideology",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "im still a beginner player on competitive gold 1 rank and they put me against EX celestial 2 and grandmasters 3 from last season... wtf",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game has absolutely no reason to take up as much storage as it does. And it still has its abhorrently bad matchmaking.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Whoever designed the matchmaking algorithm is an actual psychopath. There is no fun to be had here and no joy. You will never have a 6v6 because someone will quit every game without fail. Someone will throw every game without fail. And you will either have the most meaningless victory possible or a defeat entirely out of your control. This piece of software is custom designed to make you hate everyone around you.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game is fun but only for a moment. Community is toxic, people refuse to be a team player, baby ragers, and depending on your champ pool you're either mostly forced to play tank or support. If you're versatile, sometimes it feels useless even when you do swap to help your teammates.\n\nThe game also has a system, I'm not joking, that decides if you win or lose your next game. The algorithm PURPOSEFULLY forces you to play these games with bad players etc. Why? To make you play more. You'll have a feeling where you think the next game will go better or maybe you played wrong and want to try again.\n\nNope. The game is just bad. It used to be good, fun, but now its filled with toxicity and a terrible system.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Balancing in this game is becoming a serious problem. The developers are not nerfing the characters that are overly oppressive despite constant complaints from the community. Instead they are buffing characters who were balanced like magneto and magic creating an even more oppressive meta. I did love this game but the developers are running it into the ground with each patch.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "As someone who has both played this game with intent to climb rank, and as casual fun with friends: Welcome to the worst matchmaking system you will ever experience. The closest games you will play will be the ones in which neither team can make any progress. Otherwise, every game is a complete stomp, one way or the other. Carrying doesn't work. People do not want strategy. There will be 10x more energy devoted to figuring out who threw than there is spent actually aiming shots.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game was great from launch until the toxic Overwatch players found out about it and swapped over.\n\nNow it has the same toxic community problems Overwatch used to have",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game makes me tweak to the limits, I can't anymore with the matchmaking. I with full rage in my heart despise this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game's matchmaking system is so strange with the constant influx of games in which you get rolled by your opponents or in which you completely roll your opponents that playing competitive in it could be compared to gambling at a casino.\r\n\r\nI genuinely enjoy the gameplay of Marvel Rivals, but I can't justify playing quick play forever, once you've farmed the ongoing event, and your battle pass, the competitive mode is the only thing left to justify playing the game, and quite frankly the experience is much more frustrating than any other competitive games I have played.\r\n\r\nOne of the massive glaring issues I encounter a lot is that with all of the season rank resets that happened, most grandmasters and celestials of previous seasons who play every now and then and not every day of the week can now be found in Gold and Plat, which makes the experience in these divisions pretty nightmarish for players who aren't of this skill level, and which makes it much harder for the players who peaked at GM or Higher to get out of these divisions.\r\n\r\nBack in the first few seasons, the divisions made a lot more sense since no one had been reset, I rember climbing all the way through grandmaster at the speed of light and starting to lose a few games at Diamond. That's how it should really be, and I feel bad for all of the players who genuinely belong in Gold or Plat and who keep getting railed by all of the GMs/Celestials/Eternity players who are climbing their way back up at the speed of a turtle because at this point they are fighting users of their Elo on a division that shouldn't be theirs.\r\n\r\nAll in all, I hope they fix it, and I want to believe that they will. There are many accusations thrown at NetEase about EOMM or rigged matchmaking and I can't deny that the game genuinely feels that way sometimes, but I suspect that the main cause of this is that the game not only tries to keep your win rate towards 50% but also because some users get consistantly paired with players much better than them, which makes everyone lose more games.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "worst game i've ever had the displeasure of playing (besides ow2)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the matchmaking in this game is actually dogshit, i would rather get cancer than play this game again. they would deadass let you win 1 then put some guy that throws on your game and its a never ending cycle of people selling you, if this game has \"SBMM\" then i am a millionaire.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "horrible match making, i get the most brain dead teammates i swear they're ai and bots i dont recc this game, go play OW2, Valorant.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Never really liked the game to begin with, but I still played it regardless. It was fun at first  new game, new feeling, all that stuff. But soon enough, you start to realize a whole lot of problems.\n\nNo role queue basically means five people insta-lock DPS 99% of the time, already setting you up for a loss before the match even starts. Imagine someone going 1–11 and still refusing to switch off DPS.\n\nFor a hero shooter, there are way too many characters that don’t use any form of projectiles  just fists or melee weapons , and they’re usually more annoying than fun to deal with. The game isn’t balanced, and honestly, it probably never will be at this rate.\n\nSupport is a rough role. I don’t enjoy most of them, and they’re just not fun to play, to be honest.\n\nThe tank role can be nice, but when your entire team is made up of DPS players, you already know you’re cooked.\n\nAnd don’t even get me started on the community and matchmaking , it’s horrible. Almost everyone is toxic, and the majority are stuck in bronze and silver lobbies. You can barely have a peaceful competitive match without trolls or someone swearing.\n\nTo everyone still playing because they genuinely enjoy the game or love Marvel as a whole , good luck. As for me, I value my mental health and my free time way too much.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "EOMM at its peak\n\nThe game is fun, the retention mechanics and matchmaking is not. It ruins what would have been a great game otherwise.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If they put as much effort into hero balancing as they do with making gooner skins, the game would be in a really good spot, but here we are.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i hate this game for zombie mod, i want free currency, but nightmare 4 in solo is just mess\nalso whole zombie mob is slop, it s bad PvE,it s bad roguelike, it just boring rerunnig same shitty arena again and again, untill u get lucky",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is like a horrible crack addiction... don't do it. this game needs top fix their ranked/ matchmaking system.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's really cool how they purposely give f2p bad matches and whales really good matches.\nI never really got into it, fortunately, but the recent banner reminded me to leave a review.\nNetease is a terrible company and deserves nothing they've achieved.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "All the challenged ones got transferred here, from overwatch so we are returning to overwatch, keep the challenged ones locked here under control while we are enjoying the overwatch please, thank you.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "To load the game, you have to open the launcher, then the launch menu, press launch, wait for the game to load, watch unskippable logos, click through the cutscene of the season, then you can join a match; however, after that match you have to watch unskippable cinematics and MVP intros, and if you leave too early you get flagged as a deserter, but once the cinematic starts you can't leave. Every menu has some flashy graphics transition that I haven't found a setting to disable, it lags my laptop. \nAnd ofcourse they mess up right where OverBlizz did and added an anti-heal, but also gave the same character a cleanse ability. \nIf you play this game, do not spend money on it. They already have mickey mouse moolah and aren't using it to improve user experience\nAnd stop doing that thing blizzard does where it'll say there's something new under a tab and won't go away no matter what. Blizz does it over the item shop and now its in my customization settings. scummy tactic to try and get people to stay in the game and click on stuff",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Don't ever play this game. If you're unsure about it and want to give it a try, don't. If your friends are playing and you wanna join and have fun, don't. If you like Marvel and you want to play as your favorite heroes, don't. Under no circumstances play this game. This game is a worse choice than league of legends. Community is shit. There is no actual balance. Healers are the main decider of what will happen in the next patch and they still cry about their team. They have the kit to kill every diver in the game but when they can't kill one, that hero gets nerfed immediatly. I still played the game and tried to have fun because daredevil is my favorite character but the last game I played the game server didn't let me get into the match and I was banned because of it. I was also demoted to plat. So that was the end of the experience for me. To devs in China who made this game. You're a disgrace to Marvel. You're a disgrace to competetive gaming. You should delete this game and quit trying to make games. I hope you never work in this industry again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The gameplay is fun but gets repetitive after a while. Some people ragequit and some ragebait, most players are rude. I mean, its fun to play at first but its more an RNG and not a skill-based game. Don't get it. Honestly I would rather pay 20 dollars on COD then play this for the rest of my life. Half of these kids haven't showered in 3-5 days. \n\nI would recommend it, but its painful to play after a while.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont even bother with this unoptimized mess of a cashgrab, complete garbage waste of an ip.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "what is this playerbase its like they summoned all the worst players from every game in history to congregate in one video game",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It feels like the devs are making the game worse with every new season.\n\nPatch notes for season 5 are horrible.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If the performance ran better on perfectly capable computers (especially running with WINE),  it would be a really fun game. The artstyle is amazing, and I get the hype, but it just isn't as fun for people with low-midrange builds, for no good reason.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is pretty fun, but everything gets ruined by NetEase\n\n- The game uses Engagement Optimized Matchmaking, which basically means that the players get matched in such a way that makes them spend the most time in the game, not by skill level. Eq: if you a match you're going to keep on winning and if you lose you're going to keep losing",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I know too many people who have fraudulently been issued bans \"for being idle\" before they could even get a chance to play, even once. New players should be ALLOWED to figure out how the game works. I have no friends to play with bc nobody's being allowed to figure the game out. they get banned, trying, before they even learn anything. ALL of them!!!!!! the devs and the company can go take a long walk.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I could have written a very long review about the game and it's issues, but I think I'll just cut it down to bullet points:\n\n- Has grown in size by 60gbs in the last year and doesn't show signs of stopping\n- Balance is atrocious. The devs attempt to cater to both the competitive and casual community and end up doing neither\n- There is no role queue, and an abundance of DPS, which makes the majority of quick play games unplayable, forcing casuals into the toxic environment that is ranked\n- The ranked system is largely based on how long you play, not how good you are.\n- The community is extremely toxic. No other way around it.\n- Match making is terrible. 50% of games you barley lift a finger to win, and the other, there is nothing you can do to win, your fate is sealed. It feels like you don't have much impact on the match compared to other competitive games\n- The game gets quick updates which has largely kept it alive, but due to constant hero additions, team up adjustments, and radical balance changes, it's hard to find a character that remains consistently good.\n- Most tanks are bullet sponges, and supports as heal bots. DPS really is the only role that feels like you can play in multiple different ways\n\nI hope they make some decent changes to the game and I return, but it doesn't seem like they will.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "game is good but thew games are bad ppl are toxic and dont have brin the competitv is shit like you play with ppl that dont bleng in that rank like gold the need to go to bronze",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Cool characters, performance is pretty awful considering how it looks.\nArtstyle is mid, abilities and \"weapons\" and abilities are copied exactly from Overwatch 1:1, no shame at all.\nEverything that isn't stolen looks nice, just oersonally not good enough to actually hook me, people mostly play this to play something like overwatch without playing overwatch",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Easily the most atrocious community and match making system I have ever seen in any competitive game. I thought the complaints Overwatch 2 die hard fans were making were baseless, but no. Holy fuck bro. Do not play this game if you value competitive game play. The ranks seem to mean nothing due the amount of loosing streaks you get into - All due to their shitty attempt at \"engagement based matchmaking\" which renders your progress in comp all for naught. I really wanted to like this game, especially because I like how some of the characters play. I will never play this game again unless they correct their matchmaking. Do better NetEase. Listen to your damn community.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "IF YOU THINK YOU'RE GOOD AT THIS GAME, YOU'RE PROBABLY WRONG.\r\n\r\nThis is probably the only game where you can consistently have a negative Win/Loss record and still climb. Ranks feel almost the same from Bronze to GM. The matchmaking is horrific. Call it EOMM or horrible design, either way it makes for an absolute miserable experience of stomp or be stomped.\r\n\r\nThis game is extremely toxic. More than COD, League, OW, etc.\r\n\r\nThe map design is mediocre and the destructible environments are more annoying than strategic.\r\n\r\nThe balance is pretty bad, and there aren't enough ban slots to cover the ridiculous amount of (DPS) heroes. This game is inferior to OW in almost every way except player count, and Netease knows that the best way to keep player count up is releasing new heroes twice a season. People play the most popular game, not the best game.\r\n\r\nThere isn't any role queue so everyone insta-locks DPS. Nobody wants to play support in the current dive meta. It's supposed to be a hero SHOOTER, but less than half of the characters actually shoot anything. If you have terrible tracking, then you'll love this game because most of the heroes either punch or shoot one shot at a time.\r\n\r\nDid I mention the matchmaking IS AWFUL? IT'S AWFUL. Do yourself a favor and don't buy a single skin in this game and succumb to the sunk cost fallacy, your life will be pain.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game has all the ingredients for an amazing game with a long life. \r\n\r\nHowever there is reason this game has lost most of its player count and that is the matchmaking. In ranked or quick play the matchmaking is a complete joke, it ruins the game completely. All games are a one-sided slaughter which sucks the joy out of any match.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Super fun game in theory and the devs are working their ass off and are pushing out updates non stop. Sadly this games community is so unbelievably toxic it is barely possible to play a round with at least one player in your team calling everyone slurs or just screaming at the top of their lungs. This game requires communication which is absolutely impossible with a player base like this. Even if you dont really care about offensive comments its still just annoying to hear so much negativity and childishness. As with most online games this one lives and dies with its community. Sadly it appears to be a losing battle.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "kinda tiring that this game makes me patch 70+ gb of files almost every update because they don't know how to package the files properly",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really don't write reviews on games. But as I day 1 player I lost love for the game, the games aren't fun, one trick players in rank that get upset and throw the game when you ask nicely if they can switch to someone else. the game lost many players so horrible decisions of nerfing characters that didn't need nerfing or buffing characters that didn't need buffs like working opposite of the what the community asked. As we move on with time my rank matches felt useless as solo queue, I went from bronze all the way to Celestial 3 and every game felted not fun, until someone pointed out the EOMM system where it puts you on a huge win then a bigger lost streak where you derank. I was mad when I was GM1 and played a derank to GM3 to Diamond 1 and kept bouncing from back and forth. In the end of this play casual or respectfully play Overwatch, I found Overwatch more fun and stable matchmaking its an opinion but I don't think Ill be playing this game anymore.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "EDIT: after reading more reviews it turns out I'm not half as insane as I thought - this game uses a system called EOMM, Engagement-optimized matchmaking, which is designed to put you into matches not based on players' skill relative to one another, but based on what is most likely to keep you playing. there is absolutely no integrity to the game itself, even in Quickplay, so hell no don't play this garbage. I'm fully confident that I was being put into full Bot lobbies in the competitive queue, just so the game could feed me a win or a loss based on where I was at with my ranking and my previously played games. I went 8-2 during my placements, all of which felt like real games with real people, I was learning my role and my preferred heroes and getting better, but the moment my placements ended that's when the quality of matches was night and day. EVERY game was either being steamrolled, or steamrolling. Netease claims (read: is blatantly lying when they say) they're not using EOMM, but if you've played ANY and I mean ANY competitive/ranked game in the past for longer than a week, you'll feel the difference in Marvel Rivals. Seriously until this bullshit system which should never have even made it out of the brainstorming phase is completely removed, there is no point in playing this \"game\" (which is a shame because honestly I want everyone that's working on the art/animation/cosmetics team to be fucking millionaires, they are really doing such amazing work)\n\npros: decently fun, easy enough to pick up and learn, banging music, cool art/skins, the monetization is pretty decent if not constantly shoved down your fucking throat (if you buy a battle pass you keep it forever which I think is pretty alright)\n\ncons: the matchmaking is complete dogshit and this game has a huge smurfing problem, so basically don't bother without a group of 3-5 people to play with\n\nthere are some really, really insane design choices in here. you can only get spit off a cliff by jeff so many times before you start to wonder when the game is supposed to get fun\n\ni think the community is largely children? and as awful as you're imagining it, it's worse. the hostility and fragile egos in marvel rivals is the stuff of legend, and literally no one is having a good time lol\n\nthe marvel dialogue is a little marvel dialoguey at times but there are some good lines in there\n\nalso this is absolutely sensory overload pvp simulator: the battlepass, there is entirely way too much shit. that's it that's the review, too much shit.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game was fun early on. Now all that's left are sweats and smurfs.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It is a decent game and it can be enjoyable, however this is all overshadowed by terrible matchmaking design. Combined with too many rank resets, frequent character/team-up changes, and people creating multiple accounts, each season competitive players are paired with casual players creating a huge imbalance in skill and game experience. Most times you aren't leaving the game because you had fun, you're leaving the game because it was exhausting dealing with smurfs and other players terrible mental.\r\n\r\nBots in quickplay (QP) add to this matchmaking design flaw as it forces casual players into ranked to avoid being put into bot lobbies. This creates problems around ranked expectations and the general experience of the game. It is recommended players be given a choice to opt out of bot matches in QP or be provided with a space that is PVP Unranked",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "THIS GAME D0ES N0T VALUE Y0UR TIME\n\nplz fix the match making, there is no need for ai matches in quick play?!?!?!? like there is a whole playlist for that. \nI hate joining on going matches last sec, just for the next match to be an ai match or if i lose too many matches. idk care how many matches i lose. i just wanna play against real players",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Long story short... I used to be an Overwatch competitive veteran, so naturally I tried my hand at Marvel Rivals competitive scene. I would rather wipe my arse with sandpaper, drag my balls over broken glass, or subject myself to a fourteen hour nyan cat song on repeat than try to explain the sickening frustration of competitive. Matchmaking is a joke. When I started in the bronze I was faced against a few gold players for some reason, as I slowly made my way through the ranks I noticed more often that I would get queued against players who weren't even supposed to compete in my bracket. I gave up when I reached Platinum one.\n\nQuickplay is very hit or miss, sometimes you get queued with fun people who don't care how the game goes and sometimes you get queued with people more toxic than competitive players. Characters are well designed. Skills feel good when used. PvE gamemodes are fun. But sadly your hero rank doesn't increase while doing those. Love the game, hate the playerbase toxicity.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The downfall of this game has been insane work. Why FORCE us to play with incompetent people yet give us the option to leave a match only to punish and BAN us for it? I remember being to excited to play this game and now it gives me a headache to see the loading screen. Have spent so much money on this game and now i regret it so bad.  Both the community and the devs of this game are absolute TRASH and would not recommend to any logical human who is employed. Don't even bother wasting any time nor money here it's much deserved somewhere else.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "shit game cant even play as characters i want because everyone insta locks dps and new characters. besides that fanbase is garbage",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This games anti cheat or moderation team is horrible. My friend got banned after the enemy team said his aim was too good for a mag player, the next day? BAM banned for no reason. He sent emails, went to the discord to ask why cuz hes genuinely innocent. They said abnormal stats or sum bs. Actual joke",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Two things are ruining this game - the matchmaking and the community. \r\n\r\nAlmost every game is either you stomping the enemy team into oblivion or your team getting absolutely railed to where you can't walk out of spawn. They prioritize queue times over anything else so you almost never have actual competitive matches where either team genuinely has a chance of winning, even in comp matches. There also is no role queue like Overwatch, so you might get matched with 5 duelist mains while you are a tank main with no healer mains, which forces two of your teammates to flex into a role they may not play well at the same level of their main role. Additionally, you really feel punished for doing well. Have a couple good comp matches and contribute to the team but your next game is your rank up match? Congratulations, you get matched with either braindead teammates, throwers, or both so you can't rank up and you are forced to play longer if you want to ladder climb. \r\n\r\nWhich leads me to the second thing ruining the game, the community. Throwers are absolutely not punished enough. Even in Grandmaster rank and above you will have someone decide to throw before the match even starts just because the other team banned their main. Some will throw after you lose the first team fight, even if the match is winnable. You might have two tanks, three duelists, and one strategist on your team and the duelist that is not contributing and going negative will refuse to swap to heal so your team can win. The game absolutely knows which role(s) each player mains and could easily match you with two strategist mains, two duelist mains, and/or two tank mains, but that would increase queue times and is frowned upon by the developers.\r\n\r\nI play this game less and less because it feels like the game does not value my time. It is a shame because the game is very fun to play, but why would I sink more and more time into this when there are other games with better matchmaking and just as fun gameplay loops?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The competitive mode is so bad here. I really love this game and I play mostly quick matches and enjoy it. I used to get Gold 3 just for the skins and was happy, but this season it's pure torture. I've never seen such unfairness. The rosters are so unbalanced. Or I have people quitting the game twice in a row and you're trying to play 5v6 when you have no chance of getting Gold 3. I just hate playing competitively and just collect skins and want to get them. But there's a high chance that this season I won't get them for the first time because I just don't have the energy or nerves to play this! It's such a shame that the game I love brings me so many negative emotions, and judging by the amount of people online, I'm not the only one. I really hope they fix this next season and don't just create a bunch of skins to pump money out of me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Some of the best team-based game-play with some of the worst matchmaking you will ever see. In high ranks (top 10% of playerbase) you will see DPS go 0-6 and 0-7 whilst the enemy team dominates. You will get healers on your team that will double the enemy healing output. It's unbelievably bad matchmaking. The queue times were too generous at the start, sitting on less than 10 seconds. Now 8 months in you are looking at 5 minute queue times for god awful matches.\r\n\r\nI do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I do not recommend this game because of HORRIBLE MATCHMAKING. This game will make you experience long losing streaks to keep you engaged. There is an engagement matchmaking system that they use to determine the players you will play against and who your teammates are. This creates very imbalance matches and you can see this in the match history of all the players you're queued up with on who's side is having losing or winning streaks. \r\n\r\nThe system decides whose turn it is to win or lose.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Legit just a Marvel version of overwatch, same crappy matchmaking, same horrible people. Only play it cos my friends do, if they didn't then i wouldn't play",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "EOMM, placebo placement matches, terrible \"rewards\", \"players\" who refuse to cooperate or communicate, and garbage map design ruin any fun you think you might have while playing this game. Way to ruin great IP.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "boring overwatch wanna-be game with massive amount of gooner skins, nothing special",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hello to whoever is reading this.\n\nIn short, the idea of the game is good overall, but the execution is honestly the worst I’ve seen in years. The gameplay feels wonky, and I often get killed by completely random-looking shots. I understand it’s a third-person game, so certain angles will favor one side more, but that doesn’t mean the hit register shouldn’t work. Hitboxes feel inconsistent and all over the place.\n\nThe worst part for me is the death cam. If you’re not going to fix it, then just remove it. You can’t learn anything from it because it shows the wrong information. The enemy could be aiming at your head, but the death cam will show them grazing your toes. It’s misleading and makes it impossible to understand how you actually died.\n\nMatchmaking is also just bad. In Quickplay, new players join and get stomped, older players want to relax and not sweat, and then you have sweats who jump in and treat every match like it’s a tournament. The mode ends up being a mix where nobody is getting what they actually want—new players get crushed, casuals get stressed, and sweats get bored because the lobby is inconsistent.\n\nMaybe I’m nostalgic, but it really feels like only the top 1%—sweats, pros, streamers—are being listened to. Casual players make up the majority of the player base, yet their opinions get ignored. Most feedback from top players is based on what benefits their gameplay experience. Then they get destroyed by even better players, and suddenly they’re on a fresh account ten minutes later, pretending they’re “learning the character.”",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Marvel Rivals sounded like the kind of game Marvel fans have been waiting years for—a fast-paced hero shooter packed with iconic abilities, teamwork mechanics, and flashy visuals. Unfortunately, once the excitement fades, the reality sets in: this game feels like a sloppy, uninspired mash-up that never quite figures out what it wants to be, and it shows in almost every match.\r\n\r\nThe first major issue is balance—or more accurately, the complete lack of it. Some heroes are so absurdly overtuned that they dominate every single match, while others feel like they were slapped together at the last minute. The result is a meta where you see the same characters repeated constantly because picking anyone else is basically throwing. It turns every match into a repetitive loop rather than an exciting strategic experience.\r\n\r\nThe maps are another huge problem. They look pretty at first glance, but once you actually play them, you realize how poorly designed they really are. Sightlines are awkward, chokepoints feel forced, and spawns are wildly inconsistent. Half the match is spent running back from respawn because the layout favors spawn-camping way more than it should. It’s supposed to be a team-based shooter, not a marathon.\r\n\r\nThen there’s the netcode, which feels like it was duct-taped together overnight. Lag spikes and rubber-banding are so common that you begin to question whether it’s your internet or the game itself. Hit registration is inconsistent to the point of comedy—you can land a perfectly lined-up ability only for it to phase right through an enemy who then deletes you instantly.\r\n\r\nThe progression system is another mess. Everything is locked behind either absurd grinding or predatory monetization. Skins cost way too much, hero unlocks feel artificially dragged out, and it’s painfully obvious that the game is designed to push players toward spending money instead of rewarding skill or time invested.\r\n\r\nAnd despite being a Marvel game, the writing is shockingly bland. Voice lines get recycled constantly, characters barely interact in meaningful ways, and the overall presentation lacks the charm and personality you’d expect from such iconic heroes.\r\n\r\nIn the end, Marvel Rivals feels like a game built around hype rather than quality. It has potential, but right now it’s buried under balancing issues, technical problems, and uninspired design. Unless major improvements are made, it’s hard to recommend this to anyone but the most dedicated Marvel fans.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "soulless microtransacton filled hero slop, just as mid as overwatch.\n\nsurface level gameplay and balancing along with one of the worst matchmaking systems of all time makes this game so stale and repetitive \n\nThe LTMs are cool and have brought me back until you play them and realize its all rushed garbage with terrible optimization and mechanics that are so poorly designed that it makes you wonder if people get payed to pretend to like this game.\n\n\n4/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game copied Overwatch and added a Marvel tag to it. Worst optimisation. Tries to lure perverts with those skins. Environment designs are very poor. Like did you guys only focus on creating a destructible staircase with zero design knowledge?\r\n\r\nRequest-  Please focus on the game than releasing some skins that are only appealing to perverts",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game will give you clinical depression but atleast i am depressed with invis' beautiful physique on my screen",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I simple cannot recommend this game because of the fact that Overwatch, might I even say Overwatch 2, BLOWS this game out of the water. If you don't agree argue with a wall. Derick Turnbow OUT!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "EZ game. you can reach Grandmaster within a week without breaking a sweat. most players playing marvel rivals are toxic players who act like they have some ego to boost. I also have more than 10+ Lord status, still no challenge at all tsk tsk 🥱😪💤",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Said they were giving away 2500 of their customization currency and then released a portion of it behind a LIMITED time new currency that will erase itself next month and a convoluted friend event that instead of encouraging you to play with your friends forces your friends to find friends because they can't complete the event because you yourself lock them out of it. \n\nThis is on top of a battlepass they have not improved since the release of the game that does not return your value that you spent to acquire it. Fortnite, one of the first games with a battlepass, gave you back the amount of premium currency you spent to obtain it. Overwatch gives you enough premium currency in their weeklies, that you can easily get back the currency you spent after completing the battlepass.\n\nSkins are also shown as discounted to be at around $20 USD, when they were never the higher price to begin with, which all show the ACTUAL price of the skin as usually being in the $30 - $40 USD range.\n\nThis game is not free to play friendly, if you are coming into this game hoping to feel validated and rewarded by a developer who is happy to have you playing their game, please find something else to play. These developers only care about the people foolish enough to open their wallets at every purchase they want and will only give you pity rewards they hope you will just lap up without thinking about it.\n\nI have NEVER seen a game's anniversary so unbelievably targeted at trying to squeeze more money out of it's player base through FOMO and an MLM scheme instead of celebrating the game that has lasted a year with the release of more and more busted characters, increasing Support sided balance choices, and mini battlepasses that only exist to make even more money off the foolish and keep additional content from people who don't want to spend.\n\nI cannot and will not recommend this game. Instead, I encourage you to try Overwatch, I dislike that game but not for it's gameplay but for the lies and the death of Overwatch 1. For a new player I'm sure the game is fine and much much more worth your money as you'll get your value returned to you. If you're interested in this game because of the Marvel IP and superheroes, please just go buy a Sony Spiderman game or one of the Marvel Ultimate Alliance games as they are far more worth your money.\n\nThank you for coming to my TED talk.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Been loving this game until today. Units are the game's microtransaction currency. And there has always been avenues to earn it for free. But today with their whole Marvel Rivals Anniversary they introduced a new form of units known as Units (Limited-Time) which as you can guess are units that you can earn for free but will disappear from your account if not spent within a certain time frame, in this case 21 days. This is a dangerous precedent to set for the game. If people don't make a big enough fuss about this the days of this game having a fair mtx system where the devs make money but players can work hard to avoid spending money will be over. They will ensure that these free periods happen sparse enough that you will never be able to afford any skins without spending some real cash, and this will turn into a game as greedy as overwatch 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is garbage, none of it is balanced, the playerbase is man-children. Very horrible.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is just an experiment to see how much a person can be ragebaited\r\nthe game was very good at start but then guang guang came out with his patches the patches are absolute filth they either make a character broken or they nerf him to the ground\r\nnew broken characters every month but the same old ban slots\r\nyou got friends? have fun trying to play cuz you can only play with upto two friends in compi(which was fixed this season)\r\nand that fuckasss shark istg there is always someone in my comp team who loves to throw my games with that fuckass shark",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "was good a couple of season ago, now its going downhill, get overwatch or team fortress 2 instead",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "good game but its based on the players personality...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"This game is so addictive that it will suck countless hours of your useless life\". So get some help instead of playing this ASS game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After playing Marvel Rivals since day one and putting over 600 hours into it—500 of those in ranked—I think I’ve finally reached my breaking point. I’m genuinely done with ranked, and honestly, the game as a whole is becoming more frustrating than fun.\nRanked is an absolute disaster right now. People don’t care about winning—they throw, troll, give up instantly, and spend half the match blaming EOMM or anything except themselves. These problems have always been around, sure, but Season 5 has taken everything to a new low. It’s easily the worst ranked season so far. I usually sit between Diamond 2 and GM3, and across every tier it’s the same experience: chaos, excuses, and zero teamwork.\nWhat makes this even more ridiculous is that quick match is somehow more competitive than ranked. People play QM like it’s the NBA Finals—sweating every fight, trying their hardest, doing everything possible to win. But in ranked—the mode that should matter—they suddenly stop caring, throw, or refuse to play the objective. It’s beyond frustrating.\nAnd let’s be honest: the community doesn’t help. The game is filled with toxicity—players flaming, blaming, quitting, and acting like everyone else is the problem. It wears you down fast, especially when you’re trying to play seriously.\nThe sad part is that the only consistently good things about Marvel Rivals are the skins and the characters. The designs are incredible, the roster is fun, and visually the game absolutely nails the Marvel vibe. But great cosmetics can’t save a ranked system that feels broken or a community that feels toxic to deal with.\nMarvel Rivals has so much potential, but right now? I’m burned out. Ranked is a mess, matchmaking feels hopeless, the community is toxic, and the overall player experience keeps getting worse. Unless something major changes, I’m stepping away for good.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is basically made for weebs with superpowers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is actually so good but its so bad unless you have beefy specs. i have a nvidia rtx 4050 gpu, 16gb of ram, 477 gb of storage, and an pamd ryzen 5 7235HS cpu. but still the game literally runs WORSE then a nintendo and struggles to get 30 fps, especially when it updates. i used to get 50-60 and even then thats not even that good",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Only good thing about this game is the pve zombies mode and it's an LTM, rest of the game is abysmal dogѕhit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After playing for 600 hours this game really have a rigged matchmaking. I hate to say it but Im pretty sure OW2 has a better matchmaking than this game. It's more than frustrating at this point, the game just place you on a sweaty showerless lobbies, or a team that its so terrible. Or even worse a game filled with bots making your victories pathetic. To the point that some random players intentionally throwing ruining the comp game(Literally not healing on purpose or just walking around the map .Even worse a teammate jeff ult on your teammates doing banzai. It is not fun anymore the matchmaking it's not about skill its about the matchmaking luck. I might considered uninstalling soon its more than draining at this point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game feels absolutely miserable to play if youre not a support player. cant have a stable framerate on all low settings with a 4070. devs care more about adding fanservice skins than having an actual good matchmaking and balanced characters. the game was fun season 0 but even then it wasnt perfect, the flaws just outweigh the good at its current state",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game and very fun to play. My only issue is that for me, it is incredibly unoptimized and lags a ton. I cannot have any other apps running, including a youtube video or spotify, while playing this game. I have tried about every fix I found online to no avail. marvel rivals is the only game like this that I have owned, so I am very perplexed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The balancing in this game is terrible.\nIf you're going to make a copy of Overwatch, there was no need to keep the bad parts.\nI'm impressed by how you manage to make it worse every season, it's almost an achievement.\nAnd the matchmaking is as excellent as the balancing! One game you'll face irons, the next a full stack of Celestials, well done!\nInstead of releasing two busted characters every season, maybe thinking about how to make the game more balanced and fun would be a good idea.\n\nAnd in 2025, the game doesn't even save your graphic parameter for some reason....",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It is not a bad game it is just different. Balancing is crazy and has so much toxicity because of course it does. Play it because you like it. Overwatch is an option if you're not a fan I find it way more rewarding to make plays.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After playing this game for 5 seasons I just feel like there is nothing really left in it. \nI strangely feel like I have been playing a mobile game all this time and it is time to put it down.\nFor new players, it will be quite a novelty to see all the characters that may or may not be their favorite comic book counterparts but the game itself is quite repetitive and after all this time, it hasn't changed at all.\n\nThe Macrotrasactions and number of currencies to get one thing or another is annoying, and all designed for you to spend money on cosmetics that are barely worth the ridiculous price.\nAdd to this that after all this time, we have to endure playing with and against bots if outside the Competitive mode. \n\nGood thing it is free to play. Give it a shot, but I won't recommend it, it is really not worth your time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game keeps crashing and i get punished for it and have to wait 24 hours to play. it isnt even my fault",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overwatch isn't any better. Enjoyable in theory, until you actually play the game. Absolutely would not recommend to any living soul. Terrible matchmaking, nonsensical and inconsistent gameplay mechanics, team-ups being some of the best game mechanics in theory but awful in practice, biases for certain characters over others when it comes to balance changes, and playing the game on the opposite team of half the roster just being a genuinely un-fun experience. Underwhelming and disapointing. thank you Guang Guang",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h2]English[/h2]\nI've never such a f*ed up, bullshit, half-arsed matchmaking system in my whole life.\nNeither did I ever feel like I'm playing with bots against proper players so often either.\nNor have I ever wanted to punch my monitor so hard. Ever.\n\nAnd I'm not even talking about Ranked MM, it's the same sh*t in public / quick matches too !\nThat being said.\n\nMarvel Zombies mode is fun, it's clearly not something they thought as a permanent game mode and that shows.\nBlade is the only meta / viable pick, zombies sometimes get stuck, but overall it's fun nonetheless.\n\n[h2]French:[/h2]\nLe système de matchmaking de ce jeu est très clairement codé avec le cul ou pensé par des enfants de jumeaux en puissance.\nJe n'ai encore jamais autant eu envie de fracasser les grands morts de quelque développeur / distributeur / développeur que ce soit, et pourtant j'ai mené des projets info dans de grosses boîtes à l'international.\n\nLe mode PvE (zombie) est fun, vraiment, mais pensé comme un mode temporaire donc strictement aucune implication de la part des devs, des bugs subsistent depuis sa sortie (Namor, zombies stuck dans un coin, zombies invincibles de façon random, Boss qui oneshot alors qu'on a 12k+ HP, etc)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So, for full transparency the vast majority of my time is on console but its the same game there as it is here, so i felt like writing up a review. This game is fun, some of the most fun PVP ive experienced in a long time, HOWEVER... it is also the most toxic, overdramatic communities I have ever seen. It puts Mw2 comms to shame at times. Using voice comms in ranked feels like youre stepping into a minefield. That combined with the absolutely awful matchmaking that prioritizes engagement and player retention over skill comparison fuses together to make an experience that you want to have fun with but really struggle to do. \n\nThere are bots in quickplay which is advertised as PVP only. These bots are only given to you on a loss which is obviously to keep you playing, keep your morale up, which contradicts the develeopers comments that the matchmaking is not based on engagement. Ranked does not function off of skill comparison and will consistently reward players with negative winrates, numerous losses, and thus boost them to higher ranks where they do not belong and create a system where higher skill players are held back by the aforementioned low-skill players. Devs would rather release 32 skins an hour than fix these issues. \n\nSmurfs, throwers and toxic members do not receive lenghty bans as that would damage player retention and less players means less money, something Netease has written up numerous internal documents for that explicitly state that enagement is their top priority above all else, correlating the claims of EOMM (engagement based matchmaking) and contradicting their recent claims that the matchmaking does not feature these things. \n\nAll in all, I cant recommend it. Youll be manipulated by Netease to give money for skins, to fuel their terrible matchmaking and support their lack of enforcement over the abysmal toxic community",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The process to start the game:\nClick start in steam, it then launches the marvel rivals launcher. Then click launch on the marvel rivals launcher, marvel rivals launcher closes, marvel rivals launches. THIS IS SO GOOD!!!!!!!!!!\n\nAlso, a massive negative! You have a 150 friend max!",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}