{
  "positive": [
    {
      "review": "When will you release the online game mode for Age of History 3? I bought the game thinking it would be online. I've been older for 11 months now. You're still uploading videos for Age of History 2. Please release the online mode as soon as possible. I would be happy.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Really fun and enjoyable. It’s simple, smooth, and entertaining, with great gameplay and good vibes all around. Addictive and satisfying, I keep coming back for more. Overall, a solid game that’s fun, relaxing, and has just the right amount of challenge.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Very strategic game, fun and time killing. definitely worth every buc",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Not perfect, but good to spend some time. I think this game doesn't have too much things, too much settings to do. but still, good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a great game, but its still missing a lot of content from the previous game. \r\n\r\nOne VERY important thing though: pls add multiplayer it would be so peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing with the expanded mod and is very mod friendly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would say its the best war/grand strategy game I have ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good simple strategy game, just paint the map and enjoy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game because of its detailed, strategic elements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A decent alternative to Paradox games.\nPros:\n- Low Priced\n- Fairly in-depth for what it is\n- Great level of customisation\n- Can play many different scenarios and start dates\n\nCons:\n- AI generated artwork\n- AI nations feel broken sometimes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was a nice and simple game, very easy to play. It give you a feeling that you control the history. The game still need more update on diplomacy and economy but overall it worth the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game so far is good but it is pretty complicated. This can be fun because there is so many features and content but if you don't know how to play is not fun. The game also doesn't even have a tutorial and I can still barely figure out how to play after several Youtube tutorials. If you can figure out how to play, this game is worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love AOH2 and thought that this game was going to be AOH2 polished and improved, it wasn't, and tbh it isn't even a good stand alone game, you risk losing every campaign in the first year by your neighbor aligning with a great power and steamrolling you, and every second makes me think that i should just be playing AOH2 or HOI4 or VIC2&3, if you want a good mappy buy any of the ones I mentioned, hopefully AOH2 remastered is better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "age of history 3 tries to be a big strategy game and it really has some cool ideas and huge potential but it’s slow confusing and honestly still kinda ass but still i enjoyed it and im waiting for the multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. The game play and mechanics have been greatly improved on from the second. I do prefer the demographic mechanics in the 2nd, as they were more realistic (it showed ethnic populations such as 90% German and 10% Polish BEFORE taking any land, which is accurate to real life) but it still is good. The only negatives are...\r\n1. The absence of a multiplayer (All the AOH games lacked this)\r\n2. A lot of AI art (which can be forgiven as it was made by a single dev) and\r\n3. The tech tree and mission tree as they're very underwhelming\r\n\r\nOverall, this game is great and very detailed. You can theorectically go from year ~500 to the future if you want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "easy to learn, hard to master.  eggcelent game by far, in terms of wanting to smash my skull open with hammers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It really really needs more war score for large nations like Russia/Ussr also needs a demand system so say its 1938 and i just want danzig there should be something like for Union Non agression etc and if its over 50% you'll get the land also lack of formable nations its really dry building cost neeeeeeeeeeeds to be cheaper because half the time i wont build anything as its not worth it should be able to pick my own flag from fictional to real also you shouldnt have vassles fight each other and they should always be happy it neeeeeeeeeeeeeds a release nation feature and again i should be able to vassle it change its flag government from Fiction to historic ones like lets say i defeat ussr i want to be able to change it from commie to nation socialism and then make the flag like the one from TNO remove nukes stupid ahh thing do all that then it would be a solid 100/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is very fun if you like waiting, and when you are done waiting, then you get to destroy everyone with your advanced military.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In some time there may be a lot of competition for paradox, but not much yet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and casual, if not a bit annoying with some systems. Overall a safe haven for those too confused by HOI4 but not braindead enough for Risk",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Now I've played for 34 hours, I am happy. Caused WW3, won, created a communist British Empire, took over Iberia, now I'm happy. I highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Seljuks Massacred my Entire Anatolian Population with Nukes, but I still won, like 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game can be hard at time but a win is always a good felling at the end of the day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I may cheat every time i play but that does'nt change the fact i was willing to spend 140 hrs on ts game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10 minutes of loading just to get destroyed by neighbouring countries 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you want the world to kneel at your feet, this is the game you should try. LoL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is mid you'll probably get bored of the game after a month",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Game is really fun for people like me who are to dumb for hoi4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best strategy games i've ever played. Just perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Epik, feels like the 2nd game but better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best simple strategy game there is.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its hard not to love this game. When it's done, Łukasz.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game pretty simple",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Захватил весь мир за нищебродское царство и дилдославию",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Little learning curve but once you get going you'll be hooked for hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have the game but it says I need to re-buy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good with mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good but get ripetitive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Цікаво, але мені AoC2 більше до душі.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Much better than second part",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than last game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great and Fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the ai is way better then  aoh2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "too good to be real",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yo its good trust me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best world game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very very cool game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "iyi oyun ama cok golgede kalmis bir oyun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "trzeba uwazac na miny w bosni",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very tuff game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Age of history <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play it its fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "eu5 für nen 10er",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "epic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vey nic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Evil Scotland",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ts is fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so kewl",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dospermione",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its Alright",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Güzel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Норм",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Topchik",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PERFECT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ye",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "uwed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "пщщв",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "`",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "w",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Who is this game for?\nFor fans of Grand Strategy and map-painting who prefer a simplified, accessible scale over the complexity of titles like Crusader Kings or Hearts of Iron. This is for players who don't mind a steep learning curve with little guidance, and those who cherish the sheer joy of global conquest.\n\nTHE GOOD (Pros):\nImmense Scope & Timeframe: You can jump in from the Age of Civilization right up to a futuristic setting. The sheer volume of scenarios and civilizations is unmatched at this price point.\n\nThe New Battle System: The shift to a more RTS (Real-Time Strategy) combat model, rather than simple turn-based movement, adds a much-needed layer of tactical depth to front-line engagements.\n\nDetailed Map and Provinces: With over 13,000 provinces (on the largest map), the level of detail is a massive step up from AoH2, allowing for hyper-granular control over your borders.\n\nCustomization Power: The robust editor lets you create any scenario, map, or history you can imagine. This feature guarantees endless replayability, driven entirely by the community.\n\nTHE BAD (Cons):\nSteep, Unfriendly Learning Curve: The game throws you into the deep end without a proper tutorial. Many vital mechanics are left unexplained, leaving new players frustrated early on.\n\nMissing Diplomacy Features: Several key diplomatic options from AoH2, such as proper trading, ultimatums, and supporting rebellions, are either gone or significantly stripped down, making international relations feel shallow.\n\nStill a Bit Janky: Despite the updates, the game can be prone to bugs, occasional crashes, and clunky UI elements, especially when managing huge empires of 500+ provinces.\n\n\"HoI4 for Noobs\" Vibe (Too Simple): While accessible, it lacks the deep internal mechanics (like culture, detailed politics, and internal management) that keep Paradox games engaging for thousands of hours.\n\nFinal Verdict\nAge of History III is a triumphant, yet flawed, continuation of the series. It's an undeniable upgrade in scale and visual quality, providing a massive, engaging sandbox for you to paint the globe your color. It offers the satisfying \"map-painting\" fix without requiring a three-hour tutorial video.\n\nHowever, the lack of robust diplomacy and the steep learning barrier stop it from achieving true 'Grand Strategy' greatness. If you are a veteran of the series, buy it—you'll love the improvements. If you are new to the genre, be ready for a grind, but you will find a deeply rewarding and time-sinking experience.",
      "voted_up": true,
      "votes_helpful": 44
    },
    {
      "review": "This game is simpler than HOI IV, but it still brings an excitement to players.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "really good but combat system is only good for medieval, its buns on modern day",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "When will you release the online game mode for Age of History 3? I bought the game thinking it would be online. I've been older for 11 months now. You're still uploading videos for Age of History 2. Please release the online mode as soon as possible. I would be happy.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "its... not the best but it's a whole lot cheaper than other grand strategy games. so still recommended for those brokies out there (like me)",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Game has poor Ai portraits but if you can overlook that, its got an amazing modding community and is fun without being too complex\r\n\r\nvery fun once learned but it drops you in without much help. solid 8/10 with good replay-ability",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Honestly, the UI is reasonably simple when you get a hang of it but the game itself still has another complexity and possibility to keep me entertained over the course of incredibly long campaigns. It's very versatile, spanning pretty much any time period whilst still being different in each time period which is what I think sets it apart along with its UI and custom maps/nations (if you want to make your own scenarios), that and the fact it was made by ONE person?\r\n\r\nCan't wait for multiplayer, good job. c:",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Pretty good and addicting, had me up until 2am cuz I lost track of time lol",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really fun and enjoyable. It’s simple, smooth, and entertaining, with great gameplay and good vibes all around. Addictive and satisfying, I keep coming back for more. Overall, a solid game that’s fun, relaxing, and has just the right amount of challenge.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Very fun and Interesting but if your looking for Realisim its not here",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Very strategic game, fun and time killing. definitely worth every buc",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After spending 17 hours playing the game I can recommend it to others looking for this type of strategy game.  The learning curve is not too steep, and it is much less complex than Crusader Kings 2 or 3.  I bought it during the Steam Autumn Sale, and it is totally worth the price.  I plan on spending many more hours mastering the game and conquering the world.  I also really like all the different start dates and scenarios.  The replayability factors are endless.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A good simple strategy game, just paint the map and enjoy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Recommended\r\n\r\nDon’t be put off by the rough AI-generated portraits — beneath that surface is a deep yet approachable grand strategy experience. The game strikes a nice balance between accessibility and depth, feeling much lighter than something like Crusader Kings II or III but still offering plenty of meaningful decisions.\r\n\r\nIt doesn’t hold your hand much at the start, so expect a bit of trial and error early on, but once you learn the systems, it becomes incredibly rewarding. The modding community is also fantastic, constantly adding new scenarios, mechanics, and visual improvements that keep the experience fresh.\r\n\r\nBetween the multiple start dates, countless possible outcomes, and mod support, this game has excellent replayability. Picked it up on sale and absolutely don’t regret it — it’s a game you can easily sink dozens of hours into mastering and expanding your empire.\r\n\r\nOverall: a solid 8/10 for anyone who enjoys strategy games without getting buried under menus and micromanagement.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[Bug][RTL] persian text reversed / broken UI in persian mode\nHello,\nI found a problem when changing the game language to Persian. The text in the menus becomes reversed and unreadable. The letters are separated and the direction is left-to-right instead of right-to-left.\nSteps to reproduce:\n1. Launch the game\n2. Go to Settings → Language\n3. Select “Persian”\n4. Open any menu\n5. Text will appear reversed\nExample: The word “تنظیمات” becomes “ت ا م ی ظ ن ت”.\nSystem info:\nWindows 10 (64-bit), latest updates Steam version of the game No mods installed This issue happens every time the Persian language is enabled.\nPlease fix RTL rendering or disable reversed text layout.\nThank you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game. I enjoy it more than AoH II, which was still a good one.\r\nI don't understand those negative reviews complaining about AI usage. This game is made by a small developer, not by a company.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The game has potential, but as it is right now I must give a bad review. When you get to mid-end game it becomes unbearable. All you do is click and click. You can only mass-upgrade provinces with middle mouse button, but you need hundreds if not thousands of upgrades by one run. The game has NO province management. If you want to upgrade them so that at least they have 9 runs you need to click manually. If you have 10 provinces I guess it's ok, but when you have hundreds of them, that's where the fun ends. You also don't have proper features for attacking. For example you select multiple armies and you want them to occupy provinces...well that's not going to go. Only one army will do that, so for the rest you need to, again, click and click. I'm really tired of that. \r\n\r\nI wouldn't recommend this game until serious quality of life is being implemented and soon.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Pretty much all of the art, sprites, and backgrounds are all AI slop, please don't buy this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Editing is extremely counter intutive in addition to a very boring game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why tf would you change the turns mechanic and just be another wargame??? and yea the game is using AI",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "30 years in, barely able to push past 5 gold PER MONTH, a single city state decides they dont like me and starts a war unprovoked, comes in with an army size of 30!! a single state able to support an army size of 30 while i cannot even get past 15 without tanking my economy which i built up since the start of the game. needless to say, they destroyed and took over 3 provinces. waste of time .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just wait for Age of History 2 definitive edition, honestly. Same thing to the second game. Most of the features added here aren't really worth a separate game. Moreover, while novel, the real time mechanic, as well as tech tree, is not very well implemented. The former has some strange occurrences, as it doesn't change to accommodate the times (i.e. the movement of units isn't changed as time advances, meaning the armies late-game take hilariously longer than they should to move places). The latter can be advanced, as is often advanced, by the player and the AI, beyond reason. This wasn't an issue in the earlier game, primarily, if I'm being honest, because tech was an abstracted value in the previous game with little relevance. But here, it's front and center. Getting WW1 infantry in the early 19th century isn't terribly uncommon. While I appreciate the experimentation, the Definitive edition is probably gonna just be the only purchase you make. It will include the good (there are some added diplomatic stuff here, notably the summit feature), and maintain the original quality of the main game, Age of History 2. Hoping some things like the HRE reform system comes to AoH2 DE, as it I think AoH2 is a better base for this type of game.\n\nTL;DR, just wait for Age of History 2: Definitive Edition, it will include the second game, and probably the good of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the second game was better than this \nbring back the ultimatum feature lukasz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If AI slop was a game it would be this. It has no human touch to it. Making it quite unsettling to play. Its an obvious cash grab after the developer abandoned it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Esse jogo desgraçado vai acabar com sua vida social, em 2 dias eu já tinha 20\nHoras de jogo, se quiserem continuar suas vidas normais não comprem pelo amor de Deus",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very unrefined and just isn't fun. Most of the art looks like AI generated bs and the UI gets difficult to learn and understand. I would not suggest to anyone and make a precaution to be ready to delete viruses and crypto miners' sh*t.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this because multiplayer was promised. I am very disappointed to see he removed the soon coming DLC with it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Your opponents are always trying to attack you no matter what, and you have the same numbers in the battle but they always beat you even if you have bigger number of forces.\r\nCrap",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfinished lackluster EU4 clone with strange, confusing mechanics & gameplay (especially to first-timers). Loved AoH2, but I would not recommend this one. It also runs bad on low-end systems, which AoH2 did not suffer from at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To be honest if you want to lose like 500 divisions to 100 then go ahead and play this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even the most talented modder can't fix this mess of a game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EU5.1 after playing I thougt they copied your game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "AI-generated Art.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "👎",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game severely lacks any depth. Everything is AI generated, which looks incredibly goofy and soulless. Gameplay sucks big time. I got bombers in 1554 year playing as Netherlands because my progression was really fast. Don't recommend buying",
      "voted_up": false,
      "votes_helpful": 170
    },
    {
      "review": "The game has potential, but as it is right now I must give a bad review. When you get to mid-end game it becomes unbearable. All you do is click and click. You can only mass-upgrade provinces with middle mouse button, but you need hundreds if not thousands of upgrades by one run. The game has NO province management. If you want to upgrade them so that at least they have 9 runs you need to click manually. If you have 10 provinces I guess it's ok, but when you have hundreds of them, that's where the fun ends. You also don't have proper features for attacking. For example you select multiple armies and you want them to occupy provinces...well that's not going to go. Only one army will do that, so for the rest you need to, again, click and click. I'm really tired of that. \r\n\r\nI wouldn't recommend this game until serious quality of life is being implemented and soon.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "I instantly hated the AI pictures. It just looked SO out of place and weird. I don’t understand why you would use some bad ai app to make these pictures. But other than that, the game is nice. But it just really ruins it for me with the ai stuff",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "It's basicaly the second game, but has more useless mechanics, wierder progression, and AI. You still:\n- Spam development until a war\n- Take out 20 loans to buy a milion troops (that are overleveled because you spammed development)\n- Win the war\n- Sell every troop\n- pay the loans off with money you got from winning the war and selling troops\n- repeat\nLoop gets boring after about 60 hours. If you want to play age of history just buy the second game. It's the same minus annoying and unnecesary development mechanics and the fucking AI generated \"art\". If you like AOH3 over AOH2 for it's complexity, just buy Europa universalis or Hoi4.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "honestly so disappointed, Age of history 2 was amazing, this game is simply a failure in all aspects",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "You should be ready to buy a new mouse when playing this game. They should add a feature that builds everything",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I love AOH2 and thought that this game was going to be AOH2 polished and improved, it wasn't, and tbh it isn't even a good stand alone game, you risk losing every campaign in the first year by your neighbor aligning with a great power and steamrolling you, and every second makes me think that i should just be playing AOH2 or HOI4 or VIC2&3, if you want a good mappy buy any of the ones I mentioned, hopefully AOH2 remastered is better",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Pretty much all of the art, sprites, and backgrounds are all AI slop, please don't buy this.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Buggy mess of a game. New features would be nice if it wasn't a fragile mess. Furthermore they somehow making custom scenarios's 10x harder than its predecessor. You want a simple grand strat game? go play the second one. Sure it doesn't have cycling out leaders and generals but it at least has stability while this hasn't been updated since August. It's almost \"Mid\" I guess.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The save system in the game is broken. I can save the game, but I cannot load my saves. My save files don't appear when I try to load them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game looks great but no navy units. Armies just jump across the sea. UM OK",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game doesn't even launch. no crash popups, no logs, nothing. just no launch.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Alot of people will complain about the AI but idc, it looks fine. The game is okay but if you plan on modding your own stuff like I did then maybe dont get. Every file has to be made by hand, code typed perfectly, and its complicated compared to the last game. Making leaders and flags takes half an hour, more if you're trying to read through the FAQ text documents added alongside the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Editing is extremely counter intutive in addition to a very boring game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its a cheap knockoff EU4, made with AI slop.\n\nNo thank you. I regret buying this garbage.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I dont understand the reviews. the game is terrible, I played it for 5minutes, because there is everything AI generated, I dont believe the comments  and good reviews are not AI also generated. they should not call it age of history with so many fiction, and they can ask 2€ max for this \"game\". You cannot compare it with victoria, EU or HoI. I really dont give bad reviews, but this game is unplayable, and really not worth any money at the moment, really would love to get refund if possible.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The vast majority (>90%) of the buildings either do NOT function or do not function correctly.   I am unclear on why no one has commented on any of this since its release.\nThe way to win is to just build up armies and conquer.., don't build anything.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not the greatest strategy game in the world, but it is fun and time consuming (mostly a good thing). The only downside is that is really expensive compared to games much higher quality such as EU, Victory, CK, and HOI. Not bad, it is a cool little indie game in a paradox-dominated genre.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is unstable, you can only have one alliance, non aggression pact, defensive pact at a time and military balancing is... weird where smaller nations such as Andorra can somehow have a military just as large as the majority of Spain.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why tf would you change the turns mechanic and just be another wargame??? and yea the game is using AI",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "30 years in, barely able to push past 5 gold PER MONTH, a single city state decides they dont like me and starts a war unprovoked, comes in with an army size of 30!! a single state able to support an army size of 30 while i cannot even get past 15 without tanking my economy which i built up since the start of the game. needless to say, they destroyed and took over 3 provinces. waste of time .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just wait for Age of History 2 definitive edition, honestly. Same thing to the second game. Most of the features added here aren't really worth a separate game. Moreover, while novel, the real time mechanic, as well as tech tree, is not very well implemented. The former has some strange occurrences, as it doesn't change to accommodate the times (i.e. the movement of units isn't changed as time advances, meaning the armies late-game take hilariously longer than they should to move places). The latter can be advanced, as is often advanced, by the player and the AI, beyond reason. This wasn't an issue in the earlier game, primarily, if I'm being honest, because tech was an abstracted value in the previous game with little relevance. But here, it's front and center. Getting WW1 infantry in the early 19th century isn't terribly uncommon. While I appreciate the experimentation, the Definitive edition is probably gonna just be the only purchase you make. It will include the good (there are some added diplomatic stuff here, notably the summit feature), and maintain the original quality of the main game, Age of History 2. Hoping some things like the HRE reform system comes to AoH2 DE, as it I think AoH2 is a better base for this type of game.\n\nTL;DR, just wait for Age of History 2: Definitive Edition, it will include the second game, and probably the good of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the second game was better than this \nbring back the ultimatum feature lukasz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If AI slop was a game it would be this. It has no human touch to it. Making it quite unsettling to play. Its an obvious cash grab after the developer abandoned it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Esse jogo desgraçado vai acabar com sua vida social, em 2 dias eu já tinha 20\nHoras de jogo, se quiserem continuar suas vidas normais não comprem pelo amor de Deus",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A huge and interesting upgrade to AOH2, with loads of increased depth, but unfortunately completely ruined, made worthless and unplayable by a single moronic design decision: The game moves forward in ticks (identical to Paradox grand strategies), but there is no auto-pause, no pop-up window, not anything that will sufficiently inform you when you or your allies are attacked. The only clue you get is a small, automatically disappearing text notification hidden in a constant barrage of other, mostly ignorable notifications. The result is that you can't plan what to do, or follow what happens on the map, while time ticks on, because you have to keep your eyes on the notification stream just in case one of them happens to be the war declaration, that will ruin everything if you happen to miss it. It really ruins every damn thing that is good about this game, as stupid as it is, and as much as I would've loved this game otherwise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Monotonous and AI is easily predictable. Once you have mastered the basic economics engine, its basically a walk in the park. I literally fell asleep playing it, left it on by mistake and now can't get a refund :D",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Every fucking siege battle i do i loose even tho my military is way better in numbers and technology. Worst rts game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's just bad. The early game sucks it's slow and lacks depth. Your early game is largely defined by if your going to ganked or not before you can steamroll the AI. Every nation is basically as strong as the other so there isn't really many challenging starts. \n\nThere is no mid game though. There isn't really a period in which you are at rough parity with the AI. Instead the unpredictable early game practically instantly transitions to a ganking endgame in which no body can begin to challenge you. Seriously you outscale the AI so quickly that they provide no challenge. Speaking of the AI they are extremely passive they spend basically the entire time at peace with occasional wars that make no significant change.\n\nThe game is stuck in a rut. It's desired gameplay is boring and unfun. The game is also extremely unflexible so you can't find any other fun alternative playstyles. This won't be fixed as the dev has a habit of abandoning games shortly after launch which he's obviously done because he's gone back to Age of History II.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i tried to play but there is no tutorial and i couldn't understand how to war and all the other things, they should make a tutorial",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Very unrefined and just isn't fun. Most of the art looks like AI generated bs and the UI gets difficult to learn and understand. I would not suggest to anyone and make a precaution to be ready to delete viruses and crypto miners' sh*t.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is clearly a scam with the reviews as the AI is balanced in such a way that theyll shoot your line infantry with planes in year 1009, as u can imagine this leads to one AI faction literally conquering the world and u wont be able to do anything about it, ive played a few times and as different nations and always run into the same issue, many of the games other features dont work right or are just down useless such as vassilizing and currency buildings as u can easily cap on money u can make but the prices on buying dosent stop going up locking u out of features for your nation",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i admit this game is more meticulous than AOH II and the game itself is a gorgeous idea, but there are merely two issues: 1, the diplomacy system,i wont elaborate further here 2, this game‘s world scenarios vanished or failed of downloading on my PC, which significantly affected the gaming experiences. Thus, I decided to not recommend it YET.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "only reason i still have this is cause the 2 week period for refunds ran out. fuck this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "idk i just never really liked this game, although it is quite fun i got bored pretty quick. Also the ai should get some updates.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought this because multiplayer was promised. I am very disappointed to see he removed the soon coming DLC with it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty decent. Easy, raw, unhistorical. Not the worst but definitely won't \"beat paradox\" as the creator Łukasz Jakowski wanted and said.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I despise the AI pictures it feels like a cheap cash grab. Like just another AI slop game, it lacks the same good vibe in the second one.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Your opponents are always trying to attack you no matter what, and you have the same numbers in the battle but they always beat you even if you have bigger number of forces.\r\nCrap",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfinished lackluster EU4 clone with strange, confusing mechanics & gameplay (especially to first-timers). Loved AoH2, but I would not recommend this one. It also runs bad on low-end systems, which AoH2 did not suffer from at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "К чему новая механика войны через догонялки дивизий противника? Прям вижу как в современном мире люди воюют не фронтом, а через это дерьмо.\n\nIt was a horrible idea to change system of war. It looks very strange when war is happening in style 12-13 century at modern time. Nobody fights like this. Waiting for Definitive Edition AOH 2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What an utter garbage game.\nI'm sure you can play it, if you already know how to play it.\nbut to learn it, is to suffer.  Not worth paying money to suffer through this tragic garbage game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game for $10 and now I do not even know how to play it. There are so many options and there is not even a proper tutorial. I recommend the Age of History 2 more than this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the hype was real but the product failed to be amazing. Genuine worst money spent ever, grrrr",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To be honest if you want to lose like 500 divisions to 100 then go ahead and play this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even the most talented modder can't fix this mess of a game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EU5.1 after playing I thougt they copied your game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nah cuz why does thi game need 18 gigs of ram?????????????",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "AI-generated Art.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "👎",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game severely lacks any depth. Everything is AI generated, which looks incredibly goofy and soulless. Gameplay sucks big time. I got bombers in 1554 year playing as Netherlands because my progression was really fast. Don't recommend buying",
      "voted_up": false,
      "votes_helpful": 170
    },
    {
      "review": "The game has potential, but as it is right now I must give a bad review. When you get to mid-end game it becomes unbearable. All you do is click and click. You can only mass-upgrade provinces with middle mouse button, but you need hundreds if not thousands of upgrades by one run. The game has NO province management. If you want to upgrade them so that at least they have 9 runs you need to click manually. If you have 10 provinces I guess it's ok, but when you have hundreds of them, that's where the fun ends. You also don't have proper features for attacking. For example you select multiple armies and you want them to occupy provinces...well that's not going to go. Only one army will do that, so for the rest you need to, again, click and click. I'm really tired of that. \r\n\r\nI wouldn't recommend this game until serious quality of life is being implemented and soon.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "I instantly hated the AI pictures. It just looked SO out of place and weird. I don’t understand why you would use some bad ai app to make these pictures. But other than that, the game is nice. But it just really ruins it for me with the ai stuff",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "It's basicaly the second game, but has more useless mechanics, wierder progression, and AI. You still:\n- Spam development until a war\n- Take out 20 loans to buy a milion troops (that are overleveled because you spammed development)\n- Win the war\n- Sell every troop\n- pay the loans off with money you got from winning the war and selling troops\n- repeat\nLoop gets boring after about 60 hours. If you want to play age of history just buy the second game. It's the same minus annoying and unnecesary development mechanics and the fucking AI generated \"art\". If you like AOH3 over AOH2 for it's complexity, just buy Europa universalis or Hoi4.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "honestly so disappointed, Age of history 2 was amazing, this game is simply a failure in all aspects",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "You should be ready to buy a new mouse when playing this game. They should add a feature that builds everything",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I love AOH2 and thought that this game was going to be AOH2 polished and improved, it wasn't, and tbh it isn't even a good stand alone game, you risk losing every campaign in the first year by your neighbor aligning with a great power and steamrolling you, and every second makes me think that i should just be playing AOH2 or HOI4 or VIC2&3, if you want a good mappy buy any of the ones I mentioned, hopefully AOH2 remastered is better",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Pretty much all of the art, sprites, and backgrounds are all AI slop, please don't buy this.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Buggy mess of a game. New features would be nice if it wasn't a fragile mess. Furthermore they somehow making custom scenarios's 10x harder than its predecessor. You want a simple grand strat game? go play the second one. Sure it doesn't have cycling out leaders and generals but it at least has stability while this hasn't been updated since August. It's almost \"Mid\" I guess.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The save system in the game is broken. I can save the game, but I cannot load my saves. My save files don't appear when I try to load them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game looks great but no navy units. Armies just jump across the sea. UM OK",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game doesn't even launch. no crash popups, no logs, nothing. just no launch.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Alot of people will complain about the AI but idc, it looks fine. The game is okay but if you plan on modding your own stuff like I did then maybe dont get. Every file has to be made by hand, code typed perfectly, and its complicated compared to the last game. Making leaders and flags takes half an hour, more if you're trying to read through the FAQ text documents added alongside the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Editing is extremely counter intutive in addition to a very boring game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its a cheap knockoff EU4, made with AI slop.\n\nNo thank you. I regret buying this garbage.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I dont understand the reviews. the game is terrible, I played it for 5minutes, because there is everything AI generated, I dont believe the comments  and good reviews are not AI also generated. they should not call it age of history with so many fiction, and they can ask 2€ max for this \"game\". You cannot compare it with victoria, EU or HoI. I really dont give bad reviews, but this game is unplayable, and really not worth any money at the moment, really would love to get refund if possible.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The vast majority (>90%) of the buildings either do NOT function or do not function correctly.   I am unclear on why no one has commented on any of this since its release.\nThe way to win is to just build up armies and conquer.., don't build anything.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not the greatest strategy game in the world, but it is fun and time consuming (mostly a good thing). The only downside is that is really expensive compared to games much higher quality such as EU, Victory, CK, and HOI. Not bad, it is a cool little indie game in a paradox-dominated genre.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is unstable, you can only have one alliance, non aggression pact, defensive pact at a time and military balancing is... weird where smaller nations such as Andorra can somehow have a military just as large as the majority of Spain.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why tf would you change the turns mechanic and just be another wargame??? and yea the game is using AI",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "30 years in, barely able to push past 5 gold PER MONTH, a single city state decides they dont like me and starts a war unprovoked, comes in with an army size of 30!! a single state able to support an army size of 30 while i cannot even get past 15 without tanking my economy which i built up since the start of the game. needless to say, they destroyed and took over 3 provinces. waste of time .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just wait for Age of History 2 definitive edition, honestly. Same thing to the second game. Most of the features added here aren't really worth a separate game. Moreover, while novel, the real time mechanic, as well as tech tree, is not very well implemented. The former has some strange occurrences, as it doesn't change to accommodate the times (i.e. the movement of units isn't changed as time advances, meaning the armies late-game take hilariously longer than they should to move places). The latter can be advanced, as is often advanced, by the player and the AI, beyond reason. This wasn't an issue in the earlier game, primarily, if I'm being honest, because tech was an abstracted value in the previous game with little relevance. But here, it's front and center. Getting WW1 infantry in the early 19th century isn't terribly uncommon. While I appreciate the experimentation, the Definitive edition is probably gonna just be the only purchase you make. It will include the good (there are some added diplomatic stuff here, notably the summit feature), and maintain the original quality of the main game, Age of History 2. Hoping some things like the HRE reform system comes to AoH2 DE, as it I think AoH2 is a better base for this type of game.\n\nTL;DR, just wait for Age of History 2: Definitive Edition, it will include the second game, and probably the good of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the second game was better than this \nbring back the ultimatum feature lukasz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If AI slop was a game it would be this. It has no human touch to it. Making it quite unsettling to play. Its an obvious cash grab after the developer abandoned it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Esse jogo desgraçado vai acabar com sua vida social, em 2 dias eu já tinha 20\nHoras de jogo, se quiserem continuar suas vidas normais não comprem pelo amor de Deus",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A huge and interesting upgrade to AOH2, with loads of increased depth, but unfortunately completely ruined, made worthless and unplayable by a single moronic design decision: The game moves forward in ticks (identical to Paradox grand strategies), but there is no auto-pause, no pop-up window, not anything that will sufficiently inform you when you or your allies are attacked. The only clue you get is a small, automatically disappearing text notification hidden in a constant barrage of other, mostly ignorable notifications. The result is that you can't plan what to do, or follow what happens on the map, while time ticks on, because you have to keep your eyes on the notification stream just in case one of them happens to be the war declaration, that will ruin everything if you happen to miss it. It really ruins every damn thing that is good about this game, as stupid as it is, and as much as I would've loved this game otherwise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Monotonous and AI is easily predictable. Once you have mastered the basic economics engine, its basically a walk in the park. I literally fell asleep playing it, left it on by mistake and now can't get a refund :D",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Every fucking siege battle i do i loose even tho my military is way better in numbers and technology. Worst rts game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's just bad. The early game sucks it's slow and lacks depth. Your early game is largely defined by if your going to ganked or not before you can steamroll the AI. Every nation is basically as strong as the other so there isn't really many challenging starts. \n\nThere is no mid game though. There isn't really a period in which you are at rough parity with the AI. Instead the unpredictable early game practically instantly transitions to a ganking endgame in which no body can begin to challenge you. Seriously you outscale the AI so quickly that they provide no challenge. Speaking of the AI they are extremely passive they spend basically the entire time at peace with occasional wars that make no significant change.\n\nThe game is stuck in a rut. It's desired gameplay is boring and unfun. The game is also extremely unflexible so you can't find any other fun alternative playstyles. This won't be fixed as the dev has a habit of abandoning games shortly after launch which he's obviously done because he's gone back to Age of History II.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i tried to play but there is no tutorial and i couldn't understand how to war and all the other things, they should make a tutorial",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Very unrefined and just isn't fun. Most of the art looks like AI generated bs and the UI gets difficult to learn and understand. I would not suggest to anyone and make a precaution to be ready to delete viruses and crypto miners' sh*t.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}