{
  "positive": [
    {
      "review": "longtime battlefield fan. game slaps. ea is most definitely going to ruin it somehow, but for now i just see it as the last fun battlefield. like saying goodbye to an old friend :)",
      "voted_up": true,
      "votes_helpful": 886
    },
    {
      "review": "It’s been a long time since an online game kept me playing this much. With how underwhelming online FPS games have been lately, getting something that even comes close to the Battlefield 1 era feels refreshing.",
      "voted_up": true,
      "votes_helpful": 156
    },
    {
      "review": "Bf 6 wants to be the return of big, chaotic warfare, but somehow....it forgot to make the maps big. Most of them feel cramped, like someone tried to squeeze Battlefield into a Call of Duty box. You'll start to miss the huge old maps from 3/4 at some point. There’s not much room to breathe, flank or pull off those classic “only in Battlefield” moments. It’s more like “only in a hallway.” \nBalance doesn’t help either. Some maps clearly favor one team, especially in certain modes like Breakthrough etc. You spawn, run ten meters and boom ... you’re back on the respawn screen wondering who designed this freakin hill. When one side gets the high ground or better cover, the match is basically over before it starts.\n\nAnd then there are the tanks. My poor beloved tanks. They used to rule on the field; now they feel like fancy metal coffins on wheels (if you don't have the luxury of like 4 engis repairing the hell out of you :D). They need more armor, more punch... something to make them scary again. Right now, you peek out for half a second and some pesky guy with a rocket launcher turns you into modern art. That said, I love this game~ over 200 hours so far and I keep coming back. The gunplay is crisp, the sound design is top-notch and the visuals are stunning. When the chaos hits just right, it’s pure Battlefield magic. \n\nTLDR: \nBattlefield 6 is fun when it works, frustrating when it doesn’t and way too small for its own name. Give us bigger maps, tougher tanks, a bit more gun balancing + a little more chaos. That’s the Battlefield we signed up for. Ignore the drama coming 24/7 with news about BF, theres always some mad dude....for whatever reason :D",
      "voted_up": true,
      "votes_helpful": 267
    },
    {
      "review": "It's a great game it looks and feels right. \nThere are a lot of things i need to rant about and needs improvement. \nFor example, Battle Points, the premium currency. I have some in BF2042. Why isn't it in BF6? \nAlso, just add a browser for official servers. I know matchmaking is fast, but there are a lot of bad things about it. For example, when you end the match, you just vanish. You can't stay on it with the same people, and the small-scale game modes are painful to find matches for because it needs a low player count. But when you start a match of 8 people, 4v4, you wait for 10 minutes to find players. What the hell? There are a lot of things that are still wrong with this game, but overall it's good..",
      "voted_up": true,
      "votes_helpful": 76
    },
    {
      "review": "It's a good game. It's a good shooter, it has great graphics, and the destruction is well done.",
      "voted_up": true,
      "votes_helpful": 41
    },
    {
      "review": "Camper in building.\r\nBuilding go boom from rocket.\r\nNo more camp and get new entrance.\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Call of Duty den sonra ilaç gibi geldi. Beğenmeyenler Nicki Minaj lı oyuna geri dönebilir.\n\nafter call of duty this game is like a healing remedy. Whoever doesn t like it can go back to the Nici Minaj game",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "[table][th] Review by [url=https://store.steampowered.com/curator/34633003-Gaming-Masterpieces/lists/] Gaming Masterpieces [/url]  - The greatest games of all time on Steam.\n[/th][/table]\n\nIs this game a masterpiece? No, but it is better than Call of Duty 7.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "[b]As a long-time sucker for explosions, tanks, and warzones, a true Battlefield fan at heart, I queued up Battlefield 6 with stars in my eyes and dreams of cinematic mayhem. And to its credit: when it fires on all cylinders, it absolutely delivers those “only in Battlefield” moments. Tanks roaring across the map, helicopters screaming overhead, bullets whipping by, there’s a raw cinematic thrill here that still gets my pulse racing. I’ve found myself ducking for cover and yelling “incoming!” at least three times in a good match, and that’s exactly the chaos I signed up for.\n\nThe gunplay and vehicle mechanics mostly land hard, too. There’s something satisfying about laying down covering fire while your teammates flank from the side, or launching into a tank, gunning down enemies, and then rolling out just as your ride explodes gloriously. The maps mix close-quarters firefights with long-distance tank warfare in a way that keeps matches feeling fresh, whether you’re cracking open buildings or sniping from a distant ridge. I’ve had some rounds where my squad and I felt unstoppable together, a sweet reminder why I love this series.\n\nBut, and yes, there’s a but that feels heavier than a C4 crate, Battlefield 6 sometimes trips over its own ambitions. Matches can devolve from grand scenarios into chaotic nerf-gun duels where it feels less like a war and more like a chaotic paintball frenzy. Balancing issues sneak in: sometimes weapons or vehicles feel overpowered, sometimes they feel like you’re launching wet noodles at enemy armor. And my poor PC sometimes acts like it’s dodging bullets, dropping frames harder than a rookie soldier drops grenades. Not ideal when the game wants you to feel like you’re in the middle of a blockbuster siege.\n\nStill, I keep coming back, because when it works, it works in epic fashion. Battlefield 6 has enough depth, enough chaotic charm, and enough “oops that tank just blew up and so did half the map” moments to remind me why I love this franchise. If you’ve got the hardware, a squad, and an appetite for warzones that go boom, this one’s worth donning your helmet for. Just maybe don’t expect perfection, think of it like a war movie that’s missing a few VFX shots.[/b]",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "While I still hate how damn expensive these games are, if you're an FPS gamer and you're tired of COD, it's a solid experience. Fun game, looks great, and has satisfying sounds. Just get ready for lots of microtransaction temptations. The fact they want you to fork over $70 and then immediately point you to buying the battlepass AND other stuff, it's just wrong. A $70 game should COME with the S1 battlepass and other stuff. Tired of the greed.\n\nI know a lot of people are having issues with receiving unlocks and whatnot from the battlepass/DLC, but I don't have it yet so can't speak on that.\n\nI'm not a fan of the navigation around the menus. It's a big soup sandwich and easy to get lost in the dullness. The store is a mess and is pretty like COD. Battlefield is such a large studio and they can't come up with an efficient and good looking UI in 2025. Yikes.\n\nI wrote a bunch of negative things but the game is still good, especially with friends.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "One of the funniest, craziest, and most addictive multiplayer shooters I’ve ever played.\nThis is how BF2042 should have looked back then. Really enjoyed it.\n\nGunplay, maps (not all of them, but still), cannons, fast-paced gameplay, and destruction — all great!\nBut I have to admit, they could’ve done better with the map design, and of course, with how much chaos you can actually unleash by destroying everything around.\n\nThe only downside for me is the game pass - something I can’t really appreciate, but I’ve accepted it. Can’t wait for updates and new maps, cause I’ve already achieved almost everything I wanted here. Oh, and the campaign - I didn’t really wait for it, but here it feels like it’s just there to tick a box. They could’ve done a lot more with it.\n\nLove seeing my beloved franchise rise from the ashes again.\nGood jobю",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Battlefield has been a wonderful series, well at least the start and now the end. The explosiveness of the games has always attracted players and the sheer number of options to enter combat makes it all the sweeter. In short, Battlefield 6 feels like its return brought back what players expected, more of what they are familiar with but a little less of the new. \r\n\r\nBattlefield 6's (BF6) [b]gameplay[/b] is quite solid. All the [b]controls[/b] feel responsive and that the player has free ability to move and overcome obstacles. The choice of weapons and weapon attachments provides the players with a decent number of options to enter the battlefield (though the level up and unlock system may upset some Gamers who want to use a specific loadout - I think it's fine but the new update with the battle pass sort of seemed to skew the exp gained a little). Players are equipped with a primary weapon, secondary, throwable, and a few deployable options as well (which includes launchers and other potential special abilities that come with the class). As usual there are four different classes: assault, engineer, recon, and support. Vehicle [b]controls[/b] can range from simple to difficult depending on what you're driving. The helicopters and airplanes will take some practice if left on their standard [b]controls[/b], but their controls can be switched to a more friendlier piloting systems for those that just want to fly in the sky. The amount of modifications for the vehicle load out was also another solid feature to the game, even though it may not be completely new. Firing a gun feels impactful and the player can certainly feel it with well-timed rumbles to the controller. \r\n\r\nThe [b]graphics and visuals[/b] are quite stunning, and amazingly unlike Call of Duty, the shaders don't take 300 minutes to load up. There is a lot of chaos, a lot moving elements in the environment to symbol that chaos, and the fact the player can change the visuals by interacting with them (or more like, crashing or blowing up through them) is quite amazing. This has been one of the biggest differences between the Battlefield series and other games where everything remains static. The map doesn't change its layout (unfortunately like the BF4 map with the high rise), but cover and buildings get blown which causes players to reflect on their approach. The [b]sounds and music[/b] were absolutely well done as well. Playing off of speakers still let's the player hear quite a bit (running / footsteps, fly over of a jet, rumbling of a tank near a building), but playing with headphones let's the player hear a heck of a lot more with solid stereo effects. Both parts of these domains were done well and truly feels like a solid effort was put forth to immerse the player further into the game.\r\n\r\nOverall, would highly recommend. The price is quite steep from what I'm used to, so waiting for a sale is of course recommended, but if this is your cup of tea and you love sinking hours into a war game - certainly go for it. Adding a [b]campaign[/b] and lots of multiplayer type games will certainly keep players busy in what they want to play. I do miss the small changes some maps had like Battlefield 4 (high rise map where the high rise could be brought down) as I found that quite innovative, but BF6 does have a decent and some solid set of maps. There is a lot can be broken, but I feel more could've been destroyed in BF4. \r\n\r\n\r\n[h1]RATING: 8.5/10[/h1]\r\n\r\n\r\n[table]\r\n[tr]\r\n[td]Gameplay[/td]\r\n[td]B[/td]\r\n[/tr]\r\n[tr]\r\n[td]Story / Campaign[/td]\r\n[td]B[/td]\r\n[/tr]\r\n[tr]\r\n[td]Visuals / User Interface[/td]\r\n[td]A[/td]\r\n[/tr]\r\n[tr]\r\n[td]Sounds / Music[/td]\r\n[td]A[/td]\r\n[/tr]\r\n[tr]\r\n[td]Replay-ability[/td]\r\n[td]B[/td]\r\n[/tr]\r\n[tr]\r\n[td]Overall [/td]\r\n[td]B[/td]\r\n[/tr]\r\n[/table]",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Battlefield 6 finally dropped in 2025 and, honestly, it feels like the series woke up, had a coffee, and remembered how to make an actual Battlefield game. The launch isn’t a disaster, the servers aren’t falling over, and the whole thing just plays smooth. The classic chaos is back, but this time it’s controlled chaos. Tanks are rumbling around like they own the place, jets are screaming overhead nonstop, and infantry finally feels like more than moving target practice.\r\n\r\nThe maps actually make sense too. No more running across a three-kilometer open field just to get sniped by some guy who lives in the bushes. Gunplay slaps hard, with weapons that feel punchy, clean, and fun to use. Squads matter again, and reviving teammates doesn’t feel like you’re performing surgery on a staircase.\r\n\r\nAnd while all this is happening, Call of Duty is out there selling furry skin bundles to an audience still doing homework. Battlefield just showed up, kept it real, and reminded everyone what big, messy, explosive war games are supposed to be.\r\n\r\nBottom line: Battlefield 6 is the multiplayer king of 2025. It’s the comeback fans waited way too long for, and it absolutely delivers.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Amazing game to play, fun gun mechanics and real war vibes. Really recommend for a fun warlike FPS, it also includes a great campaign mode, fun multiplayer maps, different creative modes, and a free Battle Royale and Gauntlet mode for players to try.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Very nice and op game, very nice graphics and story, hours of much fun and kills, rush kills and various missions to do, multiplayer mode so dope and amazing too, warzone really insane mode very very dope",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Battlefield 6 feels like a game untouched by UX designers: the menus are overloaded and full of duplicate items. Its solo campaign is poorly written and way too simple.\nHowever, the rest of the game is solid enough to keep you playing for dozens or even hundreds of hours.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "[b]I jumped into Battlefield 6 with that “boots-on-the-ground” itch, hoping for sprawling battlefields, chaotic vehicles, and that epic “only in Battlefield” feel. And to its credit, when everything lines up, the game delivers. Explosions roar, helicopters soar, tanks rumble, and sometimes you genuinely feel like you’re in the middle of cinematic war. There’s a thrill to jumping into a hot drop, diving behind cover as gunfire lights up the sky, and watching the battlefield change on the fly.\n\nThe gunplay and vehicle mechanics are sharp, and the maps strike a good balance between close-quarters chaos and open-field tank battles. I’ve had matches where my squad and I pulled off coordinated attacks, felt unstoppable, and I couldn’t help but laugh at how gloriously unhinged it all became, like “oops, did the tank just explode right behind me? Awesome!” Some moments even made me forget the rest of real life, for better or worse.\n\nBut, and yes, there’s a but, Battlefield 6 occasionally feels like a half-cocked party guest. Performance can be hit or miss depending on your rig, with stutters and frame drops sneaking in during intense firefights (my poor GPU still shakes in fear). The game also suffers from inconsistent balancing: some weapons and loadouts feel overpowered, while others barely dent the enemy, leaving you spinning your wheels more often than not. And don’t get me started on the occasional spawn trap that feels less “war” and more “I woke up in a horror movie.”\n\nStill, for someone who loves chaos, teamwork, and the idea of “everything goes boom,” Battlefield 6 hits enough high notes to keep me coming back. It’s not perfect, it crashes the party now and then, but when it works, it works in turbo mode. If you’ve got the hardware and a tolerance for occasional drama, gear up and let the mayhem begin.[/b]",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Just remember (cod players)\n\nA high K/D looks good on the scoreboard\n\nA captured flag looks good on the victory screen",
      "voted_up": true,
      "votes_helpful": 450
    },
    {
      "review": "i would recommend this game for new bf players. I don't know why but i don't have the fun like i used to with BF3. maybe im getting old.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Battlefield 6 is a great game at its core with solid gunplay and classic Battlefield chaos. However, bugs, sound issues, and a clunky UI hold it back. Still, fundamentally, it’s a strong entry worth playing.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "good game but challenges and progress should have been different from core game ( bf6 multiplayer ). Can grind but it is unfair as multiplayer progression is faster.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Battlefield 6 is an iconic and outstanding Battlefield experience, from every step in the campaign to every battle in multiplayer. The game stands tall with the return of the class system, intense vehicular and infantry combat, and a thrilling story. Battlefield 6 is the complete package that fans have been waiting for, and the vision for the future of Battlefield is on beautiful display.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Devs should add a portable chair gadget for the Recon class, so all those players who camp at the edges of the map in Conquest can at least sit comfortably while doing so.\r\n\r\n10/10 nonetheless",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "As you get older, you might think you've lost interest in video games,\nbut occasionally a great game like battlefield 6 comes out and you realize the problem is the industry's, not you.\n\nthank you Vince Zampella",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I’m not judging this game based only on my 6.7 hours on Steam. I’ve played 50+ hours on my EA account, mostly in multiplayer, so this review comes from actually spending time learning the maps, the weapons, and the flow of the game.\n\nAnd honestly? Battlefield 6 is absolutely worth playing.\n\nThe game captures that classic Battlefield energy better than anything we’ve had in years — massive battles, insane explosions, vehicles everywhere, squads pushing objectives together, and those unpredictable “only in Battlefield” moments that no other FPS can replicate. Gunplay is crisp, movement feels modern, and the sound design makes every firefight feel intense and cinematic.\n\nWhat impressed me most is how every match feels different. One round you’re repairing a tank under heavy fire, next round you’re parachuting into a rooftop battle, and suddenly you’re part of a full-scale push with artillery raining down. It’s chaotic, dramatic, and honestly just fun.\n\nIs it perfect? No game is. But the devs keep polishing it, and right now it’s in a great state — stable, exciting, and full of variety.\n\nIf you love large-scale FPS battles, teamwork, vehicles, destruction, or just pure adrenaline, you should absolutely consider playing Battlefield 6.\nIt’s easily one of the most entertaining multiplayer shooters available today.\n\nVerdict: 8.5/10 — A must-play for anyone craving epic, cinematic battles.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A right step in the right direction. They definitely listened to feedback from the disastrous launch of bf 2042 and brought back classes, destruction(sadly not the same level as older titles), and made the game more grounded.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Capitalist hellscape in overdrive but fun shooty-shooty game if you can look past that.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "My experience with the Battlefield series started with Battlefield 3. I spent most of my time in the multiplayer of Battlefield 4 and 1, and I really loved the competitive atmosphere and the stories of this series. After buying Battlefield 2042, I was honestly very disappointed and went back to the older titles for a long time.\r\nFor Battlefield 6, I was very cautious and waited for feedback, but I have to say, seeing Battlefield return to its original identity was truly satisfying. The story mode is decent and the multiplayer is as exciting as ever. If you had a disappointing experience with Call of Duty this year and are looking for a real shooter, this game is a great choice.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Once another Battlefield game, nothing to exaggerate.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Best Battlefield I have ever played, has great campaign, multiplayer maps, and free-to-play Battle Royale/Gauntlet!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Truly a blast of a game, great comeback in the series :)\nlet's just hope they'll keep it grounded",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Maps are fine, but small. Vehicles are thrown onto them with no thought (Manhattan Bridge has an attack chopper for some reason)\n\nGunplay is great, bloom mechanic needs some work.\n\nServer desync stinks, but they are working on it.\n\nThere's words that come to mind when I think about the UI in this game. And all of those words would land me on a list somewhere. Please fix it.\n\nVehicle play is really bad. Worst iteration of vehicles we've had in a Battlefield game thus far. Needs a rework BADLY.\n\nPortal has lots of potential. Featuring community projects more often would really help the mode out.\n\nOtherwise: 8/10. Lots of fun, but of course has issues. Maybe wait for it to go on sale if you're not sure about it.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Battlefield 6; showed that paying attention to players and not making the game illogical leads to the game's improvement.  \nthe Exact opposite of what Activision did, as by ignoring players, they released one of the worst Call of Duty versions.  \n\nPersonally, I'm a Battlefield fan, and watching this game's progress after years gives me hope.  \n\nI hope EA abandons their annoying policies like this.  \n\nMAKE AGAIN BATTLEFIELD GREAT [MABG] /",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's one of the best BFs in modern history, and easily the most fun basic combat ever. I am biased tho :)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Finally, got something from Battlefield to get rid of COD trash gameplay. Full classic vibe back in BF3/4 era, but much better on BF6. Stunning visual, gamemodes & the maps. \n\nLoved this game so much on Open Beta, now enjoying the Free Weekend, waiting for big discount to grab it 😛",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "As it goes for all games, alone you will probably suck ass.\r\nBut with friends? this game goes hard!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Love the game!\n\nOnly wish they made the battle royal (REDSEC) separated from the game, so I don’t have to do weeklies and other challenges for BR.\nGame need a search button, I never can find the settings I want to change.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It comes closer to capturing the BF3 experience, but it still doesn’t quite reach that level. The gunplay is excellent, though the weapon balance feels uneven and many guns handle too similarly. The biggest drawback is the maps, only a few are actually good, and none of them are particularly large. The netcode can also be inconsistent, with occasional moments where you get killed even after taking cover. Despite its flaws, it is a very solid FPS that I can still recommend.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Impressive layers (infantry, land vehicles, and skies), great gunplay, destructible environments, but some balance issues and sniper-infested maps.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The game is perfect mix of old Battlefield 3 & 4 with a modern FPS . The pure chaos of the battlefield is awesome ,the sound of war and destruction are top tier. The only downside for me is the maps, I’m hoping for bigger ones in the coming seasons.\r\n\r\nOverall, Battlefield is truly back!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This is my first time playing a Battlefield game, and I’m honestly blown away. The scale of the battles, the graphics, and the amount of detail are incredible. I’ve never played anything that captures the feeling of a massive warzone quite like this.\n\nAt first it felt a bit overwhelming, but once I got used to the controls and teamwork aspect, it became insanely fun. Every match feels different — you can be flying a jet one minute and storming a building the next. The chaos somehow feels organized, and that’s what makes it so addictive.\n\nEven as a new player, I never felt completely lost. The game rewards learning and working with your squad, and when things click, it’s just pure excitement.\n\nIf you’re new to the series like me and wondering if it’s worth jumping in — absolutely yes.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I like this game but it is currently lacking a cohesive identity.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is actually good especially now that it has close quarters modes with smaller maps obliterating its rival. The only thing I don't like is EA and their *** experience. I hope this franchise stays in the right direction especially now that it has gained back a lot of traction and is in the hands of a tyrant like EA.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Battlefield 6 offers one of the most immersive war experiences in the gaming world. Massive maps, realistic sound design, and dynamic destruction make every match unique. Teamwork is at the core of the game, and the fun multiplies when playing with friends. It is a must play game for anyone who enjoys large scale battles.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☑ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑  7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Played a lot of Battlefield 5, BF6 is mostly an improvement, but BF5 audio is better, in BF5 your individual skill/strategy makes a bigger impact on if your team wins conquest or not, I also prefer BF5 maps more, but other than that BF6 is actually an upgrade, but it only feels like an upgrade once your guns are leveled up.   Overall it's fun, and a game that we all needed.   I personally like guns with very high mobility to match my play-style.\r\nNote: Normal Audio is broken, so headphone people buy \"Dolby for Atmos\" turn it on, and set it to 3D headphones for this game, it still isn't perfect with this setting but it helps a lot.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "[h1][b]\"We have Delta Force at home\"[/b][/h1]\n(the problem is that DF is FREE TO PLAY)\n\nBF6 is basically a dlc to BF42 with worse maps, cancer animations, sh1t gun sounds and no wingsuits. Its still fun to play but its faaaaaar from glory days of BF1/5 in terms of... basically everything. UI is still janky, I need to skip two ads to get to the menu which also shows a big-ass ad in front of me.\n\nThe only thing they improved from the previous game is that now we have more debris on maps and destruction (altho its sh1t due to it being scripted in some instances and mostly reliable on HP and not dmg-thresholds like it was in Bad Company... from 2008!!!)\n\n5/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Battlefield 6’s multiplayer action is expertly crafted, wrapped in a wonderful layer of destructibility that both looks great and materially affects the flow of combat. The gunplay is excellent, with weapons that are accurate enough to reward skilled shooting, but have just enough sway to promote a bit of careful thought while you take aim. I wish the early progression didn’t delay the fun of loadout building quite as much, and a few of the maps would benefit from some rebalancing, but most of the options play really well overall. Besides, those are minor gripes with what is otherwise a great time. Like a precision shot from my trusty M2010 sniper rifle, this one’s a hit.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Best of best\r\noutstanding visual\r\nwondeful\r\nand super fun\r\nF cod black ops series",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is the first Battlefield that I've enjoyed in a long time. I just wish the battle royale had a solo only queue.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Just ignore the negative reviews! I've pre-ordered the 'Phantom edition' back in August 2025 on my birthday and enjoying this game since the day it released.\n\nPros -\n1) The game's full fun and BF community is lovely & welcoming!\n2) Servers are good! Much better than APEX's trash servers!\n3) Tons of content and lots of modes, guns & vehicles to try!\n4) And the game's already on sale! \n\nCons -\n1) infamous scope glitch that everybody is talking about\n2) when vehicle crosses or hits bumps or obstacle, the camera goes totally crazy!\n3) in REDSEC a lot of buildings are just empty, no guns, no ammo. And in a BR that means you're already dead!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "How to Use a Defibrillator (AED)\n\n⚠️ Important Safety Note ⚠️\n\n- This guide is for general public-use AEDs.\n- Always follow the AED voice prompts.\n- Call emergency services immediately if possible.\n\n1. Check the Scene & the Person\n\n- Ensure the area is safe.\n- Tap and shout: \"Are you okay?\"\n- If unresponsive, call emergency services.\n- Check for breathing. If not breathing or only gasping, begin CPR and get an AED.\n\n2. Turn On the AED\n\n- Open the lid or press the power button.\n- Follow the AED's voice instructions.\n\n3. Expose the Chest\n\n- Remove clothing from the chest.\n- Dry the chest if wet.\n- Remove medication patches.\n- Shave pad areas only if necessary.\n\n4. Attach the Pads\n\n- Follow pad diagrams.\n- Pad 1: upper right chest.\n- Pad 2: lower left chest, below armpit.\n- Press pads firmly.\n\n5. Let the AED Analyze\n\n- Do not touch the person.\n- Ensure no one else touches them.\n\n6. Deliver the Shock (If Instructed)\n\n- If AED says \"Shock advised\":\n- Say \"Clear!\"\n- Ensure no contact with the person.\n- Press the shock button.\n- If \"No shock advised,\" resume CPR.\n\n7. Continue CPR\n\n- Continue CPR as guided by the AED.\n- 30 compressions, 2 breaths if trained (otherwise compressions only).\n\n8. Do Not Remove the AED\n\n- Leave pads on.\n- Continue CPR until help arrives or the AED instructs otherwise.\n\nQuick Summary\n\n1. Turn on AED.\n2. Stick pads on chest.\n3. Follow voice instructions.\n4. Ensure no contact during analysis/shock.\n5. Continue CPR as directed.\n\nIf nothing works just die and respawn",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great game. Been playing multiplayer with a buddy and love playing support and reviving people like crazy because I can't compete very well in MP shooters anyway lmao. Campaign is pretty forgettable, but the great balance of fun gameplay and realism is back.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Gauntlet is awesome, the Gun mechanics are right there and the battles are dirty and nice! lots of stuff going on around there! \r\n\r\nI still suck at flying copters",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "In my opinion, Battlefield 6 is the best shooter game of the year and is head and shoulders above Call of Duty. I personally prefer Battlefield, but the game still has room to grow since it’s only the first season. However, its future is expected to give everyone hope.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Limp Bizkit - Break Stuff: The Game. The first game in 5 years. The real game of the year, not any of that Silksong slop. Wish I could afford this one and play the sh1t out of it while my 10-year old Xeon dies at 100%.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It’s been about a month since Battlefield 6 came out, and as someone who played almost every Battlefield since BF3, I wanted to share some thoughts. After the mess that was BF2042, I honestly couldn’t wait to see if this one would finally bring back the series. After 31 days of playing I can confidently say that Battlefiled is back!\n\nI’m loving almost everything about this game: the gunplay feels good, the vehicles are fun (harder to use than in previous BF’s but I like it), the graphics and sound design are top-tier, and the destruction is absolutely beautiful. The variety of game modes keeps it interesting too. It just feels like a proper Battlefield again, with that chaotic, all-out-war vibe that we’ve all been missing.\n\nOf course, game’s not perfect. Some maps like Empire State and Manhattan are poorly designed and wierd. They feel kind of messy and not as fun to play on. I’d love to see the devs bring back more classic maps from older titles. That would be awesome.\n\nThe campaign was mid. Not terrible, but not great either and the ending was pretty weak. I kinda hoped for You know who’s appearence. \n\nOn the bright side, the skins (including the Battle Pass ones) aren’t bad at all. 95% of them actually fit the military theme pretty well. I was really worried before they added them but EA changed the most controversial ones so they don’t look like CoD, which I appreciate.\n\nOverall, BF6 is the comeback we’ve been waiting for. It’s not flawless, Devs have still a lot of work to do, there are some bugs to fix and more content to add — but man, it feels good to say it: Battlefield is finally back!\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3601613145",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "[b]The only thing which higher in CoD7 is the number in its title.[/b]\n\nThis is not the best Battlefield in series but the one which we deserve.\n\nMore massive maps and less grind would improve BF6 experience a lot.\nThis game is still worth your time whether you're a trigger happy shooter or backline support.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Melhor BF ate o presente momento, alguns glitches e hit registration ainda com problemas mas recomendo para todos, muito destruição e muita diversão.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Not to brag or anything, but the devs actually care for this game. Better than Slop Ops 7",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "First good Battlefield since Battlefield 1. A lot better with friends but comes with some issues such as AA spam and the fact tanks can camp in their HQ without penalty. Other than that, it's alright.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely loving Battlefield 6. The maps, the gunplay, the explosions everything feels next level.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Being in tank is fun. Destroying other tanks is fun. Repairing tank is fun. I like tank.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "While Multiplayer is great, as far as no cheaters, REDSEC is a crap-show.  Three blatant cheaters in a row yesterday... not even trying to hide it.  Also, the hitreg and Netcode issues need to be fixed FAST, because getting killed after running behind cover is really annoying.  And the TTK does not match the TTD.  Getting insta vaped before you can even respond is frustrating as Hell, and putting 4 or 5 snipes into someone and not getting a kill is infuriating.\r\n\r\nAlso, the RPGs that just go right through people/vehicles, the grenades that don't explode, and the inconsistency of enemy movement sounds needs fixing. \r\n\r\nBut for all that, yeah.. it's a lot of fun.  If all these fixes can be made, this will be a great game... not just a good one.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Классный шутер, который мы заслужили и давно ждали. Я поиграл в разные режими – батл рояль, мультиплеер и даже синг. Все три – неплохие. БР, конечно, без особых инноваций, но зато в брутальной, реалистичной манере без диких скинов и всего лишнего, с приятной стрельбой и адекватным т2к. Мультиплеер тоже классный, хотя и не дотягивает до уровня Б1 по размаху, эпичности и музыке. Ну а сингл – типичный скучноватый тир, каким всегда были синглы в КоД и Батле помимо самых лучших представителей серий. В целом, более адекватного милитари шутера на данный момент вокруг не вижу. 7.5/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "BF6 is a pretty good game even with its flaws. It will be interesting to see how it evolves and develops over time. For now I would recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun game with the boys. This game feels good to play win or lose. \nGuns feel good, movement isn't full on ADHD, vehicles feel balanced, lots of counters to many playstyles, funny player names, etc. \nI do wish the maps were bigger though. Every time I pop off and get a few kills, the whole fucking enemy team runs around a corner to firing squad me.\nTime to kill feels a [i] little [/i] too quick sometimes, I get chipped or shot 100 to 1 in  like 2 seconds cause some nerd happened to be spraying a corner. \n\nOverall would still recommend though.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Finally an interesting game since OG cod modern warfare and BF4. \nCampaign is ok, could’ve been a bit longer though. \nMultiplayer is good, intense and down to earth. Nothing like what other devs offer. \nNeed to adjust the attachments unlocking mechanism because the objectifs are not very interesting. \nAlso tweak snipers giving a hit marker when you shoot someone 20m away from you. And tanks shooting you from 250m with the machine gun. \n\nAbove all, if you liked playing BF4 and COD modern warfare then you’ll like this.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "great battlefield game that reddit whine over because its not exactly bf4",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Gameply is good but not even close to bf3 or bf4.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I joined for the graphics. I stayed because I kept dying before seeing them",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I really missed Battlefield, it's great to have it back! I'm loving this game.\nThe audio is amazing as always, this is something that I've always missed in other shooters. The weapon balance is really good, almost every weapon is valid in some situation. The attachments let you customize your weapons to fit your playstyle even better. The gadgets are cool. The skins and camos are pretty cool too. The gameplay is awesome, every class and vehicle has its part on the game (aerial combat could get some changes tho). I haven't ran into any serious bugs, aside from some challenges not working. The start menu is kinda awful, the soldier customization menus aren't great either. I don't like paying for battlepasses on a full priced game, and the items in the store are super overpriced, but I guess it's all just cosmetics. Overall I really do recommend this to everyone.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Battlefield 6 is the best large-scale combat PvP game I’ve played yet. The gunplay stands out immediately — every weapon feels grounded and realistic, with recoil patterns that add immersion without becoming frustrating. Character movement is smooth, polished, and responsive, making both infantry and vehicle gameplay feel extremely satisfying.\n\nThe story mode is surprisingly strong and absolutely worth finishing before jumping into multiplayer. It adds weight to the world, helps you understand the factions, and makes the overall experience feel more complete.\n\nMap design is one of the game’s biggest strengths. They’re the perfect size — not too big and empty, not too cramped — and offer a great mix of open combat, urban fights, and vehicle-friendly lanes.\n\nSpeaking of vehicles, tanks are incredibly fun to use and feel powerful without being overpowered. Helicopters and jets have a steeper learning curve, but once you get the hang of them, tearing through enemies from the sky is extremely rewarding. The vehicle repairing system is well balanced and keeps engagements fair without slowing down the pace of combat.\n\nMultiplayer can feel chaotic at first, but in the best way possible. As you play more, the flow starts to make sense and the chaos turns into strategy. Playing with friends is where the game really shines — whether you’re rolling in a tank squad or flying an attack helicopter together, it creates those unforgettable Battlefield moments.\n\nVisually, the game looks incredible on max settings. Explosions, lighting, and animations all come together to deliver a cinematic experience. However, I did run into a few matches in Conquest where almost the entire lobby was filled with bots, with only a handful of real players. If that’s a bug, I hope the developers address it soon.\n\nOverall, Battlefield 6 is a must-play for fans of large-scale PvP shooters. Anyone who enjoyed previous Battlefield titles — or players coming from games like PUBG — will feel right at home. I fully recommend it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The state of the game on release is great for nowadays \"standards\".\nMaps are shit tho. COD-like cqc grinder. Just tweak old BF3/4 maps and let people enjoy it",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Battlefield 6 offers solid gunplay, good performance, and accessible team-based gameplay. Maps are smaller than expected and can feel repetitive, but matches stay fast-paced and engaging. Vehicles are fun, though sometimes too impactful. Despite some balance issues, it’s a polished and enjoyable FPS for casual players.\n\nPros: Good gunplay, stable performance, fun vehicles, easy to pick up.\nCons: Small maps, limited variety, occasional imbalance.\n\nFinal Score: 8/10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Needs better maps, otherwise the best BF game in years",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I like the part where you play as military guy (or girl) and kill people on other team to win. Battle Royale mode is boring. Gauntlet mode is fun and good. Campaign mode make me fall asleep. I give 11 points to Griffingdor and look forward to play many more hours. Dice please add more maps to Casual Breakthrough so I can pretend I am good at the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing optimization, runs so much better than 2042",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Conquest maps are way too tiny and not fun to play but otherwise the game feels pretty damn good. I would also note that RedSec is the best gamemode i have played since yesterday.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Being in tank is fun. Destroying other tanks is fun. Repairing tank is fun. I like tank.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Love explosions, love carnage, love soldiers screaming and bodies flying. No stupid over the top skins. Easy to jump in after hard day at work and become John Battlefield.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Finally, Battlefield is back to its best. Bit rough around the edges with some odd bugs and a few things that need balancing, but overall it's a proper great Battlefield experience!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Seemed to get better once black ops 7 dropped, all the cod refugees have gone back to their steaming pile of a game. As far as BF6 goes, its good however the maps are a serious weakness. Hoping they add more big maps that BF is known for.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is a cool shooter, the gunplay is pretty good.\nNot so sure about the auto spotting, recoil, but yanno cant have it all.\n\nIf it doesn't happen in six seconds, its boring apparently. \n\nWhy is it called Battlefield though? \nZero trace of Battlefield found.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "might not be the best bf game ever (still a good game tho) but better than cod ai slop.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☑ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It’s a good game.\nLast night, after several matches, I finally managed to get 4 kills.\nIf I keep going like this until Christmas, I think I might actually be able to get a win.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is, by far, the best Battlefield game.\n\nThey've done so many awesome things - for me it feels like they've learnt from everything they've previously done, learnt from current market desires, the older players and the younger players, the things that made battlefield great with their very first game and things that made Battlefield great on the more recent games, and made this extremely well polished, well done version.\n\nWhen you have a franchise like this in gaming, it's hard to come up with something new every time that will bring the punters back - for me, this game is taking the research, experience, and diversity of the brand and bringing them together to make an awesome game. Instead of going for that - \"hey let's do something wild no one has ever done that will draw people in\", just to sell tickets.\n\nI stopped playing multiplayer shooters - thought I was getting too old to keep up. But with this, there's so many ways I can contribute in a match, skills that I can hone, and modes to play, that there's always some reason to play and absolutely enjoy doing it.\n\nIt's my current go-to, and I don't expect that to change any time soon. Battlefield has never been that for me, and I wasn't going to take the plunge on this because when you get this far on a series it tends get worse not better. But, I'm so glad I did take the plunge.\n\nThis Battlefield is the culmination of years of experience, research, hard work, and all previous battlefield games, \n\nHats off to the chair, the directors, the producers, the product owners, the managers, the supervisors, the developers, the artists, the musicians, the sound engineers, the voice actors, this truly is the best Battlefield game of all time.\n\nSome people like one or two particular entries in a series, and it's hard to please those people sometimes due to expectations - but I like to see progression, research, experience, and bringing everything together to make something better rather than re-churning or gimmicks, or entirely new directions.\n\nYou balanced it all, and it's balanced well.\n\nAlongside that - I've had no gaming breaking bugs, no inability to access servers or play the game, and no quarms about the Battle Pass and the additional available paid content. If I want, I'll get it, and happy to pay for it because you've earned it. If I don't want it, I feel no pressure to buy, it's not in my face all the time. It's just there if I'm interested.\n\nCongratulations on this great achievement; it's extremely difficult in the current climate for long running names to do what you've done here.\n\nThank you for persevering, for doing the jobs you love, even when it seems hard, even if it's just to pay the bills, but thank you all for doing it so that we can enjoy it for many hours to come.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Battlefield 6 manages to do something special it brings back the feeling many players have been missing since Battlefield 4. From the moment the match starts, there’s that familiar rush—the thunder of distant explosions, the roar of jets overhead, and the chaos of squads clashing over key objectives. It feels like classic Battlefield, but still has some issues which hopefully will be addressed and DICE are listening to the community (will edit this once they are solved and fixed)\n\nThe game strikes a great balance between modern gameplay improvements and the series’ roots. The weapons feel powerful, and the customization lets you build a loadout that fits your exact playstyle. The maps are mixed at the moment but the larger ones are thoughtfully designed, offering tons of memorable moments—building collapses, wild vehicle chases, and those unpredictable encounters that only Battlefield can deliver.\n\nThe destruction system feels straight out of the Battlefield 4 era but amped up with today’s technology. Buildings crumble realistically, cover disappears under heavy fire, and every battle feels dynamic and alive.\n\nWhat truly stands out is the atmosphere. Battlefield 6 captures the spirit and grit of the older games without feeling like a copy. It’s nostalgic, but not outdated—familiar, yet fresh.\n\nIf Battlefield 4 was your favorite, Battlefield 6 feels like a true successor. It’s a return to form for the franchise and easily one of the most exciting Battlefield experiences in years.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This fuck ass game does not work. The UI doesnt work. The bullets dont go straight. The guns dont shoot. The people dont die. The game doesnt load. It crashes a shit ton. It looks like 12 pixels are having a gangbang with each other. The bushes have fucking geometric anomaly hit boxes of 2x4ft. The fucking pebbles launch you to mars and when you come back down you get sucked through a quantum vortex of the enemies bullets. You die behind walls from the quantum magnet impringted into your fucking brain. \r\n\r\n10/10 Would buy.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "entertaining\npicks up where bf1 left off\ndestroying things is mostly what I have done so far. couple of kills and a vehicle kill of course.\ni don't have energy to play a lot as i would in the past\nlag is a issue with server hardware being so good how is there still network issues?? idk software only can be so good is my understanding even best internet ea has..not sure how it even possible 45 years after computers and no improvement on the basic thing you need the game to do...but yeah play for an hour whatever",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Ive been loyal to cod for 15+ years, Im tired of it.... This is just so much better, No ghay fairys, no rainbows, just pure chaos.  mans game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Dice has taken a big step back towards what made the older BF titles great.  They finally listened to the community and gave us a lot of what we'd been asking for.  \r\nIs it perfect?\r\nNo.\r\nIt was however, the smoothest launch of a BF title since BF4.  The last few have been horrid to say the least.  \r\nThey took out much of the CoD copy/paste crud that we all disliked.  \r\nRedsec is okay, but honestly, I typically stick to the hardcore servers in Battlefield portal.  Which are incredible and the way BF is supposed to be played, IMO.  \r\nTl:DR, best BF title in several iterations and I'd certainly reccommend it if you are a fan of the older titles.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Well, with 162h under the bag, I can fairly say that I haven't had this much fun in a while. The amount of hours I'm on this game is probably unhealthy, but it really brings me back to my childhood days when I was so hyped going to sleep waiting to play the game the next day. This is what BF6 is for me. Now some won't agree with me, because of all the \"bugs\" (which aren't gamebreaking) and the store and battlepass (which you can ignore and doesn't affect you in anyway shape or form). But if you look past all that and just see BF6 for what it is, you will like it. Especially with good friends. The devs are actively listening to the community and are trying to fix the problems as fast as they can (trust me, I know, I'm a programmer too). For now, the game is beautiful, responsive, fairly optimized and just a lot of fun to play! Sure the challenges were grindy (they lowered the challenges requirements, maybe a bit too much), but it's still something you can do by just playing!\r\n\r\nJust enjoy the ride and let's see where it takes us!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Having played both versions of Battlefield 6, the free REDEC edition and the full paid game, I can say that the full version is worth buying if you want the complete multiplayer experience.\r\n\r\nThe REDEC edition, while a nice free option, feels very different from the full game. Like many free-to-play titles, it has its issues: cheaters are more common, player levels are all over the place, and there’s no threshold system to protect real beginners. Still, it can be fun to play casually with friends in a four-person squad.\r\n\r\nThe full paid version includes all the classic Battlefield-style modes that make the series stand out — large battles, better balance, and that familiar sense of chaos and teamwork. It also benefits from stronger anti-cheat measures and a more polished overall experience.\r\n\r\nIn short, REDEC is fine as a free taste of the game, but if you really want what makes Battlefield 6 great, the full version is absolutely worth it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game’s got a ton of stuff that can either make you fall in love with it or think it’s straight-up trash — but honestly, it always ends up making my day.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I was sniped by a man named ***snipers. I asked him to explain this hypocrisy. So he said. \"He who snipes snipers, runs the risk of becoming a sniper himself. if you gaze into the scope, the scope gazes back\". Did not expect this level of philosophy in a video game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Battlefield 6 one of the best war experiences in the gaming world. Perfect graphics and realistic sound design, great gameplay and multiplayer experience.⭐🔝💯",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "love this game so much i fell like they finally got back to the origin of battlefield with this game. highly recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best Battlefield in a loooong time. The graphics, the gameplay, the weapons all are amazing! \n\nHOWEVER:\n\nIt really needs bigger and wider maps. Also the balancing on a lot of stuff still needs fixing asap. \n\nSMGs rule everything and that's not how it's supposed to be. Suppression with LMGs doesn't exist at all. Flying sucks cause you get instantly marked and shot down without a warning at all sometimes. Flares won't work either in a lot of cases. I don't even try anymore at the moment.\n\nI will give it a thumbs up because it is the best BF we got after BF1 and it kinda is back to the roots but it needs a lot of things fixed for it to really be 100% the BF we all once loved.",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "I was willing to put up with so much because the game itself is fun, and the devs seem to be actually fixing the stuff that is broken and trying to make things better. This is ridiculous though. I can't recommend buying this. If you could get in for free, it would be worth playing. But it really feels like I paid $70 for a free to play game.\n\nIt's not Battlefield 4. Cool, didn't think it would be. It would be naive to think that we could just have a new game that is like older games, but at least it's fun for what it is. Small, janky maps, odd class decisions. At least the guns feel good.\n\nLaunch at $70, sure whatever, money isn't what it used to be.  \n\nPremium $100 version. I thought it was just cosmetic, but actually, the thing that looks like just cosmetic skins, the \"weapon packages\" come with a suite of attachments already on them, which is meaningful before anyone's had time to grind out the levels on those weapons to legitimately unlock them. They also function as attachment loadouts. This is probably why they nerfed grinding bots for weapon attachments and won't let us do it in single player.\n\nMore \"cosmetic\" purchases in the shop. Looks like standard games industry slop, but it's just cosmetic, right? There's the aforementioned \"weapon packages,\" as well as character skins. What's wrong with character skins? Well, you can equip them on any class, so your enemy can't easily tell at a glance what class you are. Normally, if someone is a recon, you can tell by the ghillie shoulders. Not if they have one of these paid skins on.\n\nBattle pass. I get it, every \"games as a service\" model AAA game has this now. It's just cosme- wait, no it's not. There's weapons in here. What the heck? Well, at least you can just unlock them after a while just playing normally. Okay, whatever. I'll deal with it.\n\nToday, they released an update with a new map, a new gun, and new cosmetics (of course, but whatever.) Awesome. Love to see some new variety. Let's use the new gun. Oh it's locked, how do I unlock it?\n\n...\n\nA limited time \"Bonus\" battle pass path that only lasts for 3 weeks. They locked the new weapon in a temporary battle pass, so you have to play consistently over the next 3 weeks (or pay $16.50) in order to unlock it.\n\nI don't want to overstate it. Life goes on, right? I probably won't even be playing this game in a couple months. However, man, it feels bad. It feels cheap. This is the kind of thing I expect from a free to play game. It really does feel like I paid $70 for a f2p game.\n\nSo, as much as I enjoyed playing this game, and as much as I will continue to play it, I really can't recommend it to a prospective buyer.",
      "voted_up": false,
      "votes_helpful": 575
    },
    {
      "review": "In its current form its clear the devs have zero direction and are trying to cater to everyone and thus losing their true target audience, TTD is too fast, map design is garbage(spawn into sniper line of sights or even an RPG), the maps are too linear instead of sandbox like in previous games. A Battle Royale was not needed or wanted. Matchmaking with no server browser(no portal doesn't count) or persistent servers ruins the community, This is just Battlefield redesigned for CoD refugees as the main audience. I fucking love battlefield with a passion and this is like watching your best friend get hooked on drugs to fit in with the popular people.",
      "voted_up": false,
      "votes_helpful": 302
    },
    {
      "review": ">Buy game for 70$\n>Get popup for $25 battlepass\n>Close popup, get popup for $30 phantom upgrade\n\nThis happens daily, and god forbid you write a \"slur\" to your own premade party in PARTY chat. Tsk-tsk Nonono, that's a 7 day suspension for \"hateful conduct\" meanwhile the people exploiting the recon drone to get on roofs for WEEKS get off completely scot-free. \n\nEA Ligma Balls.",
      "voted_up": false,
      "votes_helpful": 154
    },
    {
      "review": "Game isn't Battlefield. It does not play like a Battlefield. It does not feel nor resemble one. It carries the audio, it carries part of the UI. But movement, gun play, balance, mechanics are all modern adaptions to what made the former titles great. It is not a rebirth, nor a revival. It is a synthetic imitation designed by recently hired developers. \n\nBattleField 6 is what happens when you ask todays developers, to create a game that resembles older titles, but with modern spins to it. It cannot capture what made the former titles great because it is attempting to grasp at the new players. Not the core audiance of the former titles. And with new devs, it carries their ideas and motives. As well as the backers and financers. \n\n\nI look at BattleField 1 on my libary and know with out doubt if I want to get on I can have fun. I know if I click play and hop on I will have some good matches the way I want to play. But here? The game, as all have stated. Even since beta. This game trys too hard to be Call of Duty, it is an appeal to the modern gamer, to the modern Streamers and content creators. \n\nI look to Battlefield 6, and I don't have that feeling. I don't have that \"I know I will have fun\" feeling. I look to Battlefield 6, and go \"I wanna play because I paid money for it. Not because I want to have fun.\" And that doesn't spark joy, but spite and resentment. I know I boot BF1 jump in a lobby for a late night game. And will get off having some fun atleast as a machine gunner.  Battlefield 6? Spawn-die-spawn-die. Have a good game but you still leave tired, and stressed out. \n\nFast mobility, quick gun play. The maps are small because large maps do not cator to streamers. Small maps to keep you engaged enough to die, spawn, die, spawn. Maps are not destructive, but pre-slective destruction. Alot of maps then suffer due to this and they become Lane maps like MMO. Where you funnel people into 3-4 lanes. And add a good team with vehicles and it becomes 1 sided many times. \n\nLMG's are useless because there is no suppression. Snipers are uncounterable nor a problem. A good sniper can counter sniper and kill infantry on their way to kill said sniper. A sniper has no counter play unless you are a better sniper, or you involve a vehicle or drive up to them with a truck. But you can't do that all the time, and most maps have over lapping situations. You can't fly a heli as half the enemy team will be engineers waiting for anything to shoot a rocket at, you can't go tank because you'll be lit up with RPG's.\n\nYou can't rush or flank to the sniper because they have a drone spotting you, let alone they can spot you and you have to wave though the whole enemy team. Gun fights devolve into who shoots faster, who shoots fast and has better spray control. Thus, LMG's lose out to SMG\"s even at long range as the LMG loses accuracy past 2 shots fired. \n\nThey removed suppression and mixed Support and Medic to support Battle Royal mode, much of the balances are designed for Battle Royal, it is almost as if. This game was created with Battle Royal first, and the core game secondary. The next \"huge map\" is a massive golf corse that screams \"I'm a warzone map\". \n\nThis isn't Battlefield, it's an imitation of Battlefield in an attempt to appeal to Streamers, Content creators, and Call of Duty fans. This game will lose player number as time passes and won't be that great. Is it a flop? No, because EA marketing succeeded past their expections onto, that EA took off their mask. \n\nPeople will bark at you if you criticize the game. But it is they who are the reason games have become so shit, with out criticizing shitty devs. Devs know people will defend them for shitty work.",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "[h3]Battlefield 6 – A Disappointing Decline After a Promising Start[/h3]\n\nI genuinely enjoyed the BETA. It felt fresh, chaotic in a good way, and full of potential. But now, as the full game unfolds, Battlefield 6 is slowly sliding downhill, and the issues are becoming too big to ignore.\n\n[h3]A Campaign That Feels Like a Tutorial[/h3]\n\nThe campaign is simply bad. There’s no weight, no excitement, and no Battlefield identity.\nIt plays like an extended tutorial designed to funnel you into multiplayer, not a real single-player experience worth buying the game for.\n\n[h3]New Game Modes Bring Nothing Meaningful[/h3]\n\nModes like Sabotage sound interesting on paper, but in reality they add nothing valuable.\nMost of these new modes take place on tiny slices of maps where 16v16 players run around in kamikaze-style chaos, spamming RPGs at objectives that give less XP than actual combat.\nIt’s messy, shallow, and completely disconnected from the classic Battlefield experience.\n\n[h3]Challenges Are Not “Challenges”[/h3]\n\nThe challenge system is one of the most frustrating parts of the game.\n\nChallenges don’t push players to try cool strategies or master their class, they simply force you into game modes you don’t want to play, like Battle Royale or Sabotage, just to check boxes and fill bars.\n\nWhy should a long-time Battlefield player who enjoys Conquest, Breakthrough, or Rush be required to grind a free Battle Royale mode to unlock gear?\nSpending hours in a mode you don’t enjoy isn’t rewarding, it just creates burnout and resentment.\n\n[h3]Spawn Issues and Small-Map Chaos[/h3]\n\nMany new modes take place on tiny map cuts, creating constant spawn traps and unavoidable deaths. It’s a run-die-repeat loop that feels more like an arcade shooter than a large-scale tactical FPS.\n\n[h3]Infantry Gameplay Has Lost the Battlefield Identity[/h3]\n\nI prefer infantry gameplay, teamwork, class synergy, tactical pacing.\nBattlefield 6 instead leans into constant, frantic run-and-gun action.\n\nPlaying Medic or Engineer feels unrewarding.\nI end up picking Assault just to survive the chaos.\n\n\n[h3]The Game Is Drifting Toward Call of Duty[/h3]\n\nI never wanted to compare Battlefield to Call of Duty.\nIn fact, I always hated when people said “BF is becoming CoD.”\nBut after today’s session… I’m starting to see it.\n\nThis constant run-and-gun chaos, the tiny arenas, the instant deaths from five directions the moment I spawn, it all feels less and less like Battlefield and more like Call of Duty with every update.\nAnd that’s worrying.\n\nFor the first time in over a decade of playing this franchise, I actually found myself swearing at the screen and getting angry.\nThat’s not healthy, and it’s not the Battlefield experience I’ve known.\nDying to a heli is normal, that’s Battlefield.\nBut getting deleted instantly on spawn, unable even to see the enemy, feels awful and cheap.\n\n[h3]Conclusion[/h3]\n\nBattlefield 6 had potential, and the BETA looked promising. But the current direction feels completely disconnected from what made Battlefield special.\n\nForced challenges, shallow game modes, spawn frustration, and a shift toward fast arcade-style gameplay all erode the Battlefield identity.\n\nRight now, it feels like the developers are chasing Call of Duty instead of doubling down on what their own fanbase wants.\n\nIf the game doesn’t course-correct soon, it risks losing the very community that kept the franchise alive for decades.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "If you would like to make a trash F2P game that is aggressively monetized, go for it, but please don't put it into the game i paid you $70 for. Now every time i open the game i paid $70 for already, I get to see all your stupid ads for your battlepass for the game mode i don't even play and see you trying to squeeze more money out of me. Fuck you EA, Fuck you DICE, I was having fun with the game and now my experience is soured every time I open your game.",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "Was cool for 2 weeks. Now its boring and after the updated it becomes a fu**ing cod/fortnite skin clone. What a shame to flood a 70.- game with ads. Was the last BF for me",
      "voted_up": false,
      "votes_helpful": 182
    },
    {
      "review": "This is a message to the Dev Team of BF6:\n\nPlease do yourself a favor, rename this slop to Call of Duty : Modern Warfare 4 and get the fuck out of the EA Headquarters, Every update becomes more and more of a money hungry streamer bait, You claimed to have learnt your lesson after Battlefield 2042 and yet here we are again.\n\nRegards, I'm going back to Battlefield 3, bye.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "The first 50 hours are great. Once you get past the first 50 hours, the game takes a deep nosedive. \nThe maps are horribly designed. Unbalanced spawns, incredibly small map sizes, unbalanced weapons across the board. \n\nA majority of weapons in this game are absolute trash, and the game doesnt even have enough weapons. LMG's are by far the best all around performing weapons in terms of damage, recoil and control. SMG's outperform both carbines and assault rifles at range. The balancing makes zero sense because somehow the .308 mg has better recoil control then a 5.56 AR. Then comes weapon bloom(dispersion) which across the board makes no sense. Dispersion can be measured in inches at 100m, not feet at 30m. Due to the small map size which are essentially cod sized, vehicles are both horribly overpowered due to repair stacking by 4 engineers and underpowered by the amount of drop on ifv and tank shots. \n\nMedics and support are now the same class which means unlimited ammo and unlimited heals from boxes that dont work half the time. Defib revives are overpowered as hell. Did you just drop 4 guys on the point, well too bad because a medic spammed revive on 2 of them which means they can instantly shoot you. Back to the maps, the redone Operation firestorm  is terrible. They overcompensated for 2042 by making the maps incredibly small. Air vehicles in this game, control horribly, they are incredibly hard to fly compared to bf4, bf3. This is not a battlefield game, This is call of duty modern warfare.\n\nThe UI for the game is just plain bad and now that they added the battlepass you have to go past 2 ads just to play your $70 game. Id refund this game if i could.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Would you please fix your fucking game. What is this crap update that broke everything. Roll it back idiots.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "My review > 200 hours and > level 100 and having played every single BF game there is, from BF1 until BF6 (my favourite is BC2 and the last BF vibe is BF4).\n\nSummary:\nThis ain’t battlefield, but call of battle. Too low ttk, too small maps, crap netcode, challenges are not challenges, bot farming to reach max level weapon, all challenges and fast leveling up in a day, unfair advantage for controllers never seen before in history without the option to turn off matchmaking against those “legit” cheaters, no private servers like past bf to moderate and set filters, never saw such cheater infested and overhyped game, monetization at every opportunity and the best part, people who make reports against cheaters and chat abusers get warned (me, via email from ea) or outright perma banned.\nYou will get more of this slop with ever increasing price for less and less, because, BF6 sold well and that’s all that matters to a business, so this trend will continue until the studio dies off. Just because previous BF titles sucked in comparison to BF4 and before and BF6 is better than that, does not mean it’s a good game or “comeback”, but you cannot reason with the unwashed masses who think black-white, when there are infinite shades of gray in between. \n\nI would only recommend the game on major discount after a few years, after majority of cheaters are either banned or moved on to cheat on the next “popular” fps AND core issues are addressed, in order not to feel frustrated and get the most out of your time and money.\n\nCore issues:\n1) Too low ttk, far lower than your ping (read: m4a1 100 hipfire build with 900 rof instakills). Attracts cod mob and the adhd and lsd addicted (vs the more relaxing past BF experience where you don’t insta die).\n2) Too small maps (again, for the cod mob) and only BR has that nice map, available for everyone for free, where cheaters own the final zones (see killcam tracking). BF always used to have (very) large maps to play on, not anymore.\n3) Crap netcode, where lagger with a ping of 1000ms can still kill you long after you’re in full cover. This means lagswitch cheaters come (if not already here) one day, which are the hardest to detect and ban.\nEasy solution: Drop packets > n ms.\n4) Challenges should be “challenges”, they’re even nerfed and could all be completed in one day with private bot server where ai carries no guns, lame.\n5) Controller has aim assist, much less recoil and drag => “legit” aimbot => rot and killing competitive games. If you’re an average joe with 1kd, no worries. Plug in a controller just hold firebutton with quick flick down and boom: laser beam everyone and not lose another 1v1 with m4a1 ever again against any K&M user, inc. “pros” and up it to 5kd. We got factual data to back this up from other games for decades, with far less aim assist and without much less recoil than BF6, where top 100 players not even 10% are K&M and in 1v1, every single K&M loses vs controller, because of aim assist aka aimbot. I noticed more and more controller icon in games past few weeks, majority of games are now vs controller. The skilless need unfair advantage over others (the definition of cheating) to make them feel better. No sane human being can rationalize this to have any part in any competitive game. Now you understand why losers use cheats and hacks, they finally can harass others with “skill issue”.\nEasy solution: Option to NOT matchmake with any controller user.\n6) Too many cheaters, especially noticeable in BR with the killcam, tracking players behind walls even from far away, instakills with just 20dmg pistol from over 100m, wallhacks when you see team of 3 passing you and 4th coming to jump 90-180* instakill you. You can find many cheats for free on google and yt. If even 10% cheats (the number is most likely much higher), then that means on avg there are already 10 cheaters in BR. Very easy to spot too, one game on account, stupid names and anime avatars.\nEasy solution: Make filters in game to matchmake with other accounts that are > n years old, have > n games and private servers.\n8) There are a lot of reports of people being banned for reporting cheaters and chat abusers, the irony. I got “lucky” for being warned for reporting a cheater, reason: harassment, quote: “ffing cheater”. Others get permabanned without their appeal even being read. There are a lot of reddit threads with screenshots as proof.\n\nOther cons:\n1) Too much monetization in your face. The lifecycle and monetary model of BF6 (aka cob) will most likely follow cod. There is always a sucker buying it.\nRemember BC2? You pay 1x for finished almost perfect base game and had only one dlc (Vietnam), a complete new experience with huge expansion for the same price as a ffing skinpack today, with private server where you can perma ban cheaters, destructible environments, beautiful snow and very large desert maps, where you could shoot mcom with tank or the building to collapse to destroy it. Epic times and they could do it decades ago, even on PS3, without ads everywhere and with far less budget.\n2) Overhyped by paid influencers, I personally hate this rot and seriously cannot understand any human listening to those sellouts, who lie, cheat and manipulate their own audience for selfgain. Probably the same Karens (and the trash npc consuming yt/twitch audience) who claim there are no cheaters, never saw them or you having skill issues. Matter of fact, they’re either (and you should never listen to those clowns in the first place):\na) Complete noobs (few hours gameplay),\nb) Lack brain cells to distinguish a cat from a dog and/or\nc) They are cheaters (because only people who respond aggressively in a generic statement, feel personally attacked, because you directly speak and therefore expose them)\n3) Game is average, especially single player, but you buy this for the online experience. Well, having a bad time finding this better than even BF 2042 which was for more enjoyable to me than the better looking, but worse game that BF6 is, with instadeads and controller aimbots. Also, far more cod Karens who do not play objective, nor revive, just solo camp and snipe, terrible experience 9/10 games. If you want something qua environment like BF6 that is actually BF and not cod, the last is BF4.\n\nPros:\n- Graphics\n- Audio\n- Movements\n\nI miss the good old days of Battlefield and I cannot be alone in thinking and feeling this way. I do not enjoy adhd speed infested instadead small map brain rot games where controllers get unfair advantage because of stupid gamedesign, but proper relaxing teamplay focused gameplay, with large maps where tactical decisions matter.\n\nI had a suspicion bf (cob) would go the way of cod, with those twitch skin drops before release. Those streamers are paid off for few sheckles to do the marketing for them. Rest of unsponsored yt ad creators roam of the top living in mom’s basement, but who seriously going to waste their time consuming trash, signs of the times boys. Value for money is rare these days. Remember how good the old days where, especially around 2000, peak online experiences without cheaters and lamers, because internet was still exclusive. Nowadays, like Chinese would say, you must cheat in order not to get cheated. No ethics, no morals, no honor. All slop and brainrot. Give everyone access to internet and you get this: demoncracy. We're a dying minority of neanderthal. As you can see, majority are to blame for this, but Karens keep pre-ordering and buying crap after crap. Financial management sees number go up, so they want trash, they happily provide.\n\nIndeed, BF is already dead a long time ago and this is just the final nail in the coffin for all true BF fans. So it will be endless milking until the studio dies out, just how society in general will collapse, nothing special, just history in the making of the insane running the asylum as usual.\n\nF",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "This is not Battlefield. It feels like a free to play game that tried to emulate CoD. The devs straight up lied about \"a return to form\"\r\nSo disappointed, wish I didn't buy into all the false advertising,",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "At the time of writing this review, I give a thumbs down for the following reasons. First, the fact that we have to pay $70 for the base game to then get slapped with a $25 battle pass on top of it (is worse for people that pay $100 for the phantom edition, which to be honest don't get much for a few extra bucks. Not to mention the tank skin you get with it is actually pay to lose since there's a spot on the turret that gets you 2 shot by projectiles or RPG's). The Ranger Pack released today for Veterans day is another embarrassment, since you have to pay $12 and it all goes to the company. As a veteran myself, I find it disgusting for anyone trying to profit themselves during recognition/holy days rather than help or donate the proceeds towards an entity related to said events. Instead, they will \"donate\" whatever they feel like it, which we all know will probably be like a 20% or less of whatever they make from selling this overpriced pack. \n\nThe base game already comes with a large amount of content missing, like actual large maps, weapons and vehicle customization. Some of the gadgets in the vehicles do not actually work either, to the point there's only 1 or 2 actual choices to employ if you want to be somewhat useful on the field. Another issue is the fact you can't customize the gunner seat to your needs, since who ever gets in the vehicle first dictates what the gunner gets to use in their preset. So if they do not bother to modify their gunner preset on their own menu, then you get stuck with default tier equipment that usually under performs (unless is the .50 from the tank).\n\nNext we have weapon attachment issues. There's a lot of attachments that take time to unlock and you would think they would make your gun better, but in reality they make them worse. Depending of what you attach to your weapon, you end up making it less accurate and bounce all over the place. Add accuracy bugs and good luck trying to hit anything pass 10 meters in front of you. Then we have under performing class gadgets. A lot of them are not even worth their grind to be honest. For example, the shoulder mounted launchers like the Javelin and the Stinger. They both are getting outperformed by the RPG, due to the fact Javs gets less launchers and deals less damage and not to mention any vehicle with smoke breaks the lock on. The Stinger is useless overall. Any time you lock into any air target, you either have 2 seconds of line of sight depending on the map or the missile gets instantly avoided as soon it leaves the launcher because flares are way too over tuned. It takes another 10 to 15 seconds to lock in using another stinger after the target popped flares, by then they either flew out of range or their flares are back up. If by the grace of god you do get a hit, you need to pray to get lucky enough to lock on and hit another one since the damage is way less than an RPG. Both launchers benefit from painted designation, but it doesn't really do anything for their performance. Yeah the Stinger can hit ground vehicles, but it deals way less damage than any other launcher in the game. It doesn't help them keep lock on after target popped flares, which is literally what lasing designation does in order for the missile to land where it needs to. The IFV lock on TOW used to behave like this, then it got nerfed due to complaints of all the players that abuse air superiority unpunished. Now the only way to reliably shoot down air targets, is they are either bad at flying or low enough to get hit by an unguided projectile. \n\nThen we have mines and the tiers you unlock are worse at their job. The slams deal damage equal to a stinger used for ground pounding. The sound mine tends to miss a lot for a mine described as a lock on target mine, not to mention it takes 3 of them to actually kill a target in full health (unless is a quad bike or buggy, and is very inconsistent against the latter). Then you have the ability to crawl over mines in vehicles, which is super dumb because no mine is going to let a vehicle simply run over it just because it was going at 5 mph. The claymore's are also very inconsistent, they either blew up before you get anywhere near them or they let you pass by like you were the owner. \n\nAfter putting a few hours into the game, I keep noticing bugs and exploits that people keep abusing in order to get an edge in a system that was supposed to be polished and balanced after all the testing and promises made. Yes the game can be fun and enjoyable, but some things can't be ignored. The campaign is also super buggy at times, you who played it know what I'm talking about. Sound ques during matches can be as bad as Tarkov sometimes to the point enemies run up to you and execute you by the time you hear them. Also, said execution animation itself is buggy as hell most of the time. Sometimes you have to spam the button to get it going and most of the time you end up just hitting the dude rather than killing them out right. I seen people get hit head on by an RPG, just to walk it off because it only dealt 70 damage. There's a lot of weapons that do not have proper damage of over distance. Others have a major accuracy spread, even if they have literally no recoil. Overall, there's a lot to do and hopefully it won't get ignored in order to push micro transactions agendas. The game is kind of good, but it can be better because as it stands it doesn't hold a candle to previous titles (We all know what BF titles I'm referring to). I will keep an eye open and adjust my review based on the work done in the upcoming patches. That is if EA doesn't make the game flop like they always manage to do. \n\nHappy Veterans Day my fellow service men.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "This game is not Battlefield, it is Call of Duty.\n\nEngagement zones are typically below 20m, back-shooting is extremely common even on Breakthrough, maps are small and frantic, balance is atrocious. Lives are typically measured below 10 seconds. Most maps feature spawn zones that enemies can shoot into. The UI is cluttered and confusing; spotting doesn't really work anymore and it leaves permanent marks on the minimap and UI that covers more useful markers. Design is bad, so that I am often shot by enemies I didn't realize were enemies until I was gone. Vice versa happens too.\n\nIt's a Call of Duty arena shooter. It's okay at that. Decent for playing with buddies. It's certainly slick and responsive. But is it a good Battlefield? No. Not by a 90m-long-long shot.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "PC players don't have the option to turn off crossplay forcing them to play with open mic console players that have excessive aim assist and recoil aids. \r\n\r\nMaps are too small. Much smaller than BF 3, 4, V and 1",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "if you need a battlefield to play and got no other choice, this will do.\n\nbut the game generally speaking is a downgrade from previous installments. maps are tiny, vehicles are bad, balance is wacky, and the \"promise of return to bf4 roots\" actually meant \"we'll add battle royale and a battlepass 2 weeks in instead of fixing the game\". \n\nFixing cross-map no-warning lockon oneshots could wait over a month, but adding a battlepass and some dogshit battle royale nobody asked for couldnt.\n\njets have no customisation. \nhelicopter gunner has no customisation. \ntransport heli has no customisation. \nground vehicle countermeasures (smoke) dont render half the time.\nyou can sit in spawn next to C-RAM and crossmap other vehicles with impunity due to poor map design.\nsome maps with full vehicle lineup (helicopters, jets, tanks) are shorter spawn-to-spawn than lockon ranges on homing launchers.\nTOW is the most busted and historically easy to use weapon right now. a toddler can hit TOWs on aircraft with good consistency.\nstate of the rpg is a joke (lightning fast speed leading to 400-500m crossmaps on vehicles with not much effort)\n\n\nif you're good, you'll succeed in spite of this. but it isn't worth the money at this point.\nwait it out for a couple of months, buy on sale, and see if it improves like previous battlefield games",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "the game is fun no doubt. why they went the direction they did after the beta is what confuses me. the beta was perfect. then people complained and this is what weve got. takes forever to unlock attachments for weapons. weapon bloom is bad. and hit detection is bad. and after each update the game gets worse. no persistent servers. you are forced to go to portal.  \noverall. a decent battlefield. \n5/10",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Get it when it's on sale, or you’ll end up feeling ripped off. I’m so sick of playing on the same seven tiny maps. This game needs more and bigger maps. God BF1 is still better in almost every way, that is just sad.\nThe only fun thing about bf6 must be the gunplay, the rest is a half delivered package. If only they used the resources spent on creating RedSec, which nobody asked for, to develop better maps and add features like a server browser or at least persistent servers.\nAlso, can we get rid of the bots DICE? please?",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The anticheat prevents you from using any DNS or any VPN on your system -- even if you bypass keepalive, javelin, ea, and battlefield -- it monitors all of your internet traffic and disconnects if it notices any inconsistencies. \n\nI am okay letting programs past my security, but not removing all of my security for just one program, especially a game at that.\n\nThat's beyond gross overreach, which is a shame because the game worked absolutely flawlessly during the beta, has settings and customizability out the hooha, and it's an all around leagues better playing experience and far better optimized piece of software than COD could ever imagine itself being.\n\nI'm probably a microscopic sliver of the total audience this game has, so saying \"way to shoot yourself in the foot, EA\" doesn't carry a lot of weight here, but this kind of orwellian trash ethos is what's kept me from the Sims 4 as well :(\n\nNot even worth Free.99 at that point :/",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "While I have initially had fun playing this game, the recent updates along with the complete disconnect DICE has shown towards the community, I cannot justify telling people that its okay to spend 120AUD on this game. While it's better then the absolute abysmal 2042 and BF5, it is still a far cry from what we should expect from a AAA studio.\n\nWith the amount of skins and cosmetic packs they are churning out to milk the game while its popular to the complete game breaking bugs for vehicle players, it shows me that DICE genuinely do not care about their players STILL even after the BFV drama.\n\nThe maps are a joke as well. I miss the days of open fields or city skylines, not this urban crawl shit where there is always a guy with a shotgun waiting down an alleyway, and guess what, the only way to get to the points is through chokepoints. Also dont even think about using vehicles on these maps, there are 2 roads you are forced to use to get out of base my by golly gosh you can bet they are both mined to hell because DICE in their infinite wisdom gave every. single. fucking. engi. AV Mines, Congratulations, you played yourself.\n\nThe campaign is buggy as hell and almost the worst snooze fest I have ever played, but I guess its better then the COD Skibidi toilet boss. A sentence I never thought I'd type out.\n\nThey still for some reason have a fixation on making battle royale relevant again and are trying to force us into the game mode by making all the challenges for the battlepass REDSEC related. I'd honestly rather stick my dick in a blender then play another shitty take on the battle royale game modes.\n\nI just want to play Battlefield, is that really so hard to ask for?",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "this game gets worse after ever update. sad when the beta is better then the full game",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "EA waited for 2 weeks after release (the maximum time after purchase that Steam allows refunds) to add a battle royale mode, a real-money in-game store, 3 in-game currencies (battlefield coins, battlepass tokens, battlepass bonus tokens), a full-price limited-time battlepass, a full-price limited-time battlepass tree, a hundred ridiculous outfits that ruin both visibility and immersion.\r\nMultiple adverts every time you open the game that block you from playing until you refuse to buy the battlepass and seasonpass again.\r\nPerformance degrades every update, menu experience is bad to abysmal, map sizes range from small to extremely small, no end in sight.\r\nBase game is fun",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "For people like me that have been playing the Battlefield series since 2008, this is NOTHING like the games pre-2016. I would love to go into more depth but it simply turns in me into a rage. I have always been a more relaxed and slightly competitive gamer but this game truly is chaotic. This game reminds me of MW2019 but with a battlefield touch. There is NO squad power, the guns are attachment dependent, and the gameplay does not feel crisp. This is a huge cash grab and feels nothing like old Battlefields. I HATE that I spent $70 on this and want a refund.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "BF is devolving into COD very vast. I thought it would be the contrary tbh since how stale and uninspired COD has become. \nMaps are too narrow, movement feels off, weapons are ass and shooting enemies feels spongy af too.\nAnd the roof camping is so lame too.\nGrindy Battlepass and ugly ass skins as well ofc.\nTrue official hardcore servers when?..",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The game has an okay base — it’s Battlefield — but the design feels weak.\n\nThe maps are boring and the balance is pretty bad. On some maps you get shot down right after taking off. And the amount of vehicles on each map feels random: too many on some maps, almost none on others.\n\nGround vehicles aren’t fun. The Bradley has only two useful seats, tanks feel empty, and older Battlefield games had much better vehicle gameplay.\n\nWeapon leveling and skins are a huge grind. It takes forever and doesn’t feel worth it.\n\nThe interface looks almost copied from Call of Duty. Even if that style was popular in CoD, it doesn’t mean Battlefield should just take it. The game loses individuality because of it.\n\nThe new Redsec mode (their Battle Royale) also feels weird. Releasing a Battle Royale in 2025 feels like the trend is long gone. And the gameplay looks so much like Call of Duty that sometimes you don’t even know what game you’re in. It feels like they put a lot of effort into Redsec instead of fixing balance, making better maps, or improving vehicle systems.\n\nAnother problem is the weapons themselves. It feels like none of them really stand out. Most guns feel almost the same, just with slightly different stats. There’s no weapon that makes you think, “Yeah, I really want to play with this.”\nIf you think back to Battlefield 1, the guns had crazy personality — fast-firing LMGs with huge recoil, bolt-action rifles, all kinds of different playstyles. Sure, the setting was different, but the gameplay was way more interesting and varied.\nIn this Battlefield, the shotguns are actually fun, and running around with them is cool… but that’s basically it.\n\nThere are some good points.\nThe attack helicopter is fun to use.\nThe first-person free look is great.\nAnd the transport helicopter guns are finally strong, so gunners can actually get kills.\n\nBut overall, nothing really stands out. It’s just a basic shooter. The new revive animation is okay, but doesn’t change much. The core is fine, but the design is weak.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Do I recommend? No. Its a Call of Duty game wearing the skin of Battlefield.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "This game has made it hard for me to make a good review.\n\nOn the one hand the gameplay itself is excellent, backed up with some pretty good weapons and gadgets, with some exceptions. The vehicle combat and gamemodes are alright but the maps are very small, even the largest maps pale in comparison to earlier titles. All of these things, including the network issues will be fixed in time i'm sure.\n\nBut...\n\nWhat is completely inexcusable is the blatant, Call of Duty style, predatory marketing and in-game store. The vast majority of the cosmetics are completely at odds with the games basic aesthetic and setting. The constant popup adverts when you start the game are obnoxious. The prices for item packs are laughably high.\n\nAnd again that is not all...\n\nNow with the latest content update (2025-12-02) they have added a brand integration with Redbull. I personally don't want to see a constant advert for something in the game that is purely there for marketing. Also it's not 2007 with adverts like Mountain Dew and Halo anymore, we should not stand for this.\n\nTake this review however you want, but I hope it's enough for you to make a somewhat informed judgement before purchasing the game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "A good FPS game. \r\nA bad battlefield game. \r\nThe vehicles are just decorations. \r\nThe gadgets are for the most part, worthless. \r\nThe maps simply is not built for a combined arms experience. \r\nThe gunplay is good though.\r\nI recommend buying it on sale.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The battle royal is fully ridden with bugs in absolutely every aspect. There is hardly a single feature that works as intended all the time. It has been out for two weeks, and the only patch posted since then hasn't adressed any of them. This goes for everything such as looting (items stuck in the box), lootboxes appearing super late after drop, certain items not lootable by you (works for teammates). Parachute autodeploying at unwanted times on the way down, disengaging from jump master makes you drop like a sack of potatoes straight down, falling way behind the team. Sometimes there is no other team at the endgame, so even though you win you end up in 2nd place. The team takedown to show other squad members often bugs so you can't do it (if the down player is laying on a little pebble it won't work, if he moves away, it sometimes disengages the animation). The ping system prefers marking a grenade 300 meters away, rather than ping the spot you are trying to, or sometimes refuses to ping at all. The anti vehicle drops that come towards endgame to help you deal with the pesky tank rats sometimes spawn without anything worth while to deal with tanks.. much good mines and HE grenades will help you in a small circle without any cover. I could og on.. oh right, i will.. I forgot to mention the god-awful hit registration that bugs half the time so your hits seem to register, but you don't get the damage you should",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "On paper Battlefield 6 looks and sounds the part. The gunplay is satisfying, weapons have weight, recoil feels purposeful, and the core shooting mechanics deliver the visceral hits that makes a shooter fun. Graphically it’s impressive at times, and there are moments in a match where the chaos can be genuinely thrilling. But i'm still left trying to scratch that itch that Battlefield 3,4 and 1 gave me. \n\nThis game wants to be Call of Duty plain and simple. From the awful UI that's ripped right out of COD with those awful Hulu/Netflix boxes. You can't open the game anymore without the battle pass and battle royale being plastered all over the screen. Everything feels so corporate, this game has no soul or identity. the game’s battle royale mode is one of the most shameless copy and paste jobs I’ve seen. Also the colour palette of the game sucks It feels lifeless. This franchise was built on huge, emergent battlefields where tanks, aircraft, boats (no boats in this game), infantry and objectives all interacted to create memorable, unpredictable fights. BF6 trims that down. Maps are smaller, choke-pointed and hand-crafted for twitch skirmishes rather than sprawling fights. The game doesn't feel epic, it doesn't give me that sense of scale or being a small part in a big battle. The progression sucks with the grindy challenges and weapon levelling. Also the campaign is so awful i don't even want to talk about it it might legitimately be the worst campaign i have ever played it's that bad. It was so throwaway and the developers know themselves, it was slapped together so quick you can tell. \n\nOverall this game is just missing that 'it' factor for me. If you go on youtube and search for Battlefield 1 operations and click on any video and watch the start of it this game doesn't even remotely come close to capturing the level of immersion and atmosphere that game was able to deliver. That is what i wanted from this game and that is why i can't recommend it.\n5/10 (Average)",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Clowns-developers who ask for $70 for a project, with as many problems as leveling, poor visibility of opponents, bugs with sound, and weapon balance and etc. Why use an AR at all now, if there is a submachine gun that can shoot you easily from 100-150 meters and shoot at close range? Crashes in the RedSec still don't fixed.\n\"Buy our game now for the price of the finished game, and maybe we'll finish it later. In the meantime, you can buy something else in our in-game store or purchase a battle pass\" (c) Modern AAA Gamedev.\n I'm so sick of it",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "I think the we are seeing this game with rose-tinted glasses after the disaster that 2042 was. If we compare this to say bf3 or bf4 I would argue this is a mediocre battefield.\n\nIt's been a month and many things are still broken (challenges, perks), so many crucial things are missing (naval warfare, little birds, etc..), and some decisions are questionable (unrestricted weapon classes, map sizes, restrictive vehicle out of bounds, faster gameplay).\n\nOf course it's not all bad. Breakthrough is a great addition and I like the urban maps but it feels like the large majority of positive things I can confidently say about this title are not new in the franchise. It does a decent job at capturing the essence of older titles but doesn't do much to push the formula forwards and, in my personal opinion, it takes some steps backwards.\n\nThe updates seem to point in a wrong direction and don't give me hope. I hope my suspicions don't come true but we are in the age of slop. I hate to give it a bad review but for $100 CAD after taxes I don't think is a fair deal.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "If you're new to the Battlefield series, you might actually enjoy this game.\r\n\r\nBut after spending quite a few hours with it, I have to admit: I'm disappointed. Battlefield 6 isn’t outright bad at first glance. The core idea is still there—Conquest with infantry and vehicles. But it becomes obvious very quickly that this game is built on the ruins of a once-great franchise. The frame is familiar, but everything it tries to innovate ends up being worse than what came before.\r\n\r\nDestruction, for example, is half-baked. You never understand why one part of a building collapses and another identical part is magically indestructible. Compared to the older Battlefield titles, the environmental destruction here is honestly laughable.\r\n\r\nMaps and sound design used to be defining strengths of Battlefield. Not this time. They feel generic, empty, and lacking identity.\r\n\r\nAnd the character skins? They look like they were designed by a 12-year-old who has a vague idea of what the military might look like. Even the paid skins are mostly ugly or outright childish—except maybe the Army Ranger one, but paying real money for digital cosmetics is already dumb enough. And the whole customization system makes no sense in a Battlefield game. Why am I supposed to feel like part of a unit when everyone is running around in whatever bright-colored nonsense they feel like? Night vision goggles at high noon. Snow camo in the desert. Go ahead—nothing matters.\r\n\r\nBattlefield always gave me the feeling of being a small cog in a massive war machine—an anonymous soldier doing something heroic because the moment demanded it. Now? The entire battlefield speaks the same English voice lines. No distinct factions, no sense of identity. No Chinese soldiers yelling behind a wall. No Turkish troops battling across the trenches. No Germans calling out aircraft overhead. Just bland, recycled comms.\r\n\r\nAnd don’t even get me started on the UI. The menu looks like Windows 8.1 had a stroke. It's one of the worst, least intuitive interfaces I’ve ever used in a game.\r\n\r\nAt the end of the day, I can only explain the design direction like this: the people who made Battlefield what it was are long gone. What we’re seeing now is a franchise running on life support, creatively empty, kept alive because the name still sells.\r\n\r\nThe game isn’t terrible—but it's nowhere close to greatness either. It’s something to kill a few hours with friends. And to be honest, you can also just sit and watch grass grow with friends and still have fun. Because the fun in this game rarely comes from the game itself.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "What an absolute joke of a game.\n\nThey initially bait players with nostalgia, boosted by paid streamers, only to reveal their true intentions just a few weeks later in the form of this uninspired mess filled with the never-ending microtransactions. All of this wrapped in a €70 price tag, for the base game...\n\nNot to mention the map sizes, which feel more like something out of Call of Duty. They conveniently reserved bigger maps for the free battle-royale mode instead of the main game.\n\nThey love to brag that \"destruction is something Battlefield does unlike anyone else\". Yet here we are, in 2025, and they still can’t deliver genuine dynamic destruction. It’s very clear that the people who once made DICE (now Battlefield Studios) special are long gone, because what we’re left with is a shallow imitation of what Battlefield used to be.\n\nAnd if all of that wasn’t enough, the desync issues that are still present in the game to this day are the cherry on top. A proof that even the basics still aren’t properly handled.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Buy the game, buy the battle pass, spend dozens of hours on incredibly stupid missions to unlock the weapon you want, only to continue dying instantly from OP shotguns when you've already run behind a wall. Another Battlefield, another disgusting game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "[h1] Mayhem and destruction, to an extent [/h1]\n\nFirst of, I have played many previous installments in the franchise and this is definitely an improvement over the past one that I shall not name from disgust and lack of content delivered. I cannot say the game in it's current state is worth the full price of the now industry standard, $/€70. \nLet's start with what the game gets subjectively right:\n[h3] 1. Gunplay / gameplay [/h3]\nGameplay is overly satisfying, I would personally prefer a faster time-to-kill as some guns feel very weak in comparison to others, even in the \"watered down\" hardcore mode they added they are barely usable but that's more of a balancing issue rather than the gameplay itself.\n[h3] 2. Single player campaign [/h3]\nCampaign is included again, short but alright, adds some cliche story nobody really cares about and serves as somewhat of a tutorial for guns and class gadgets.\n[h3] 3. Vehicles [/h3]\n Vehicle engagement is fun and not overpowered, both air and ground vehicles feel fun to use in the maps\n[h3] 4. No cheaters [/h3]\nKernel level anti-cheat seems to be effective, don't think I encountered any cheaters (unlike in previous games)\n\n[b] HOWEVER... [/b]\n\n[h2] On to the things I dislike about it: [/h2]\n\n[h3] 1. BUGS GALORE [/h3]\nAmount of bugs this game had at launch and many that are still unresolved and present. \nYes, some are just laughable but some are genuinely stupid and ruining the experience. Worse yet, the bug report in-game doesn't seem to work as intended.\n[h3] 2. BATTLE ROYALE (RedSec) [/h3]\nThey really keep trying to make an entry in this genre which is already past it's peak and this doesn't add anything innovative. \nTaking features from other games in the genre and mashing it up together, doesn't feel fresh. Only addition is tanks/helicopters but that was already seen in BFV (nobody played that BR to remember probably) as was the instant kill zone. The map feels bland, with only a few locations standing out. There is a LOT of bugs in this mode, such as dropping through the floor in some buildings, getting stuck in various locations, loot not spawning at start of match but after a delay, sound not working properly for redeployment/vehicle stations, etc. \nThe game mode Gauntlet is alright and focuses on squad teamwork to advance.\n[h3] 3. Class identity = GONE [/h3]\nThey add some \"signature\" weapons which slightly improve handling of weapons for specific classes, but you can use all weapons as all classes. This leads to medics not reviving but sniping, recon/snipers with AR's (because C4 is for some reason exclusive to recon???) and they switched the spawn beacon to assault, whatever. \nSignature weapon for medic/support is LMG and SMG for engineer, which was reversed. \nAssault is AR (d'oh) but the problem is there are much better carbine options than AR options and they don't benefit from this bonus.\nYou can run out of ammo if you don't play medic/support, there are no ammo drops from slain enemies or at objectives. (?)\n[h3] 4. Monetization on top of a full price game [/h3]\nI, for one, can accept the optional battle/season pass. \nI cannot accept the weapon and operator skins in store for premium currency, PRO upgrade, starter packs and other bull they tack on top of the game price. \n[h3] 5. Censorship [/h3]\nTHIS GAME IS SOFT IN UNIMAGINABLE WAYS \nI won't go over the list, but give you an example what is censored which made my friends and me laugh:\nDelete the game \n\n[b] GG [/b]",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "A great bait and switch by EA. Announced as a return to the origins, we got a Call of Duty with tanks.\n\nAs an old BF player (games like Bad Company 2 or Battlefield 3 old. Not Battlefield 1942 or Battlefield 2 old) I can say that the core Battlefield is here. In fact, the first 2 weeks the feeling of Battlefield was here. There were some odd feelings: all this sliding, maps are smaller and more action packed (reminds me a lot of Metro in BF3), weapons that aren't class-restricted so everyone is running with SMG, and a few other things. BUT, it's still a Battlefield game. It's still fun.\n\nThen, Season 1 and the Battle Royale dropped, and the whole game changed...\nHey, you paid 70€ for the game? Then buy the 10€ Season Pass that you can only progress with challenges because we made sure that the exp needed to level up got exponentially bigger each level. \nWhat? You have a life? Then buy the Battlefield Pro for 25€ so you can skip 25 tiers. Or skip tiers with our in-game currency that you can get from our FOMO riddled shop.\n\nOh, and the challenges? They are either Battle Royale challenges (a mode that I unistalled because I have 0 interest in it) or \"Win 10 matches of Deathmatch/Squad Deathmatch\" or similar. \nI'm sorry? I bought Battlefield to play the classics: Rush and Conquest. I never saw these Breaktrought or Escalation game modes before but I must say, I like them. So, these are the 4 modes I want to play. Not Squad Deathmatch, or Strikepoint, or what's its name. You get 4 skips a week, the challenges are still random each skip, and you can still get challenges for modes that you don't want to play.\n\nThen there's the netcode: it's bad. Why SMG are the best choice of weapons? Because of the Rate of Fire. The netcode is so bad that it doesn't register all the shots, so a weapon that shoots a lot of bullets its the best way to make sure that you kill the other players.\n\nWhat can I say... I hate modern gaming. Now I remembered why I stopped playing AAA multiplayer games. They aren't worth the price anymore. You pay 70€ and then, even if it's only cosmetics, you need to pay again, and even more than the original price. \n\nOn the plus side, it's still way better than what Call of Duty is doing right now.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I never write reviews about games but I am really disappointed that EA has forced the Battle Royale upon its players. I wish EA would have made the BR a separate game or not made it at all. I had high hopes since I thought the beta was so fun and apparently EA will ban you if the find your username inappropriate or offensive, no warning. Kinda lame IMO. I expected better out of a $70 game. I do find the standard gamemodes fun but the battle royale infection ruins the experience. I refuse to play the BR and complete any challenges that are forced into the game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Idk what they did in the last update but the game is currently unplayable. The lag is so excessive for no reason that I can't even shoot anything. This isn't a problem with my internet as everything else works fine.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Critical bugs and exploits go unfixed for weeks while Dice turns the game into CoD",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I really like the game but I can't play it right now and I've tried everything I could find on the internet. I'm not the only one with the problem and it seems to be on EA'S side so I'll be leaving a bad review until it get resolved",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "amazing at release and couldn't wait for the next future updates then hits us with a shitty battlepass and BR and I can't choose a region to play on, forced to play with bots because ME servers are fcking hollow.\r\nserver browser is awful. no official battlefield servers anymore. just full with bots and XP farming servers. so disappointing",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "They said BF6 will follow the roots of BF3 and BF4. Well that was a f*cking a lie. They're not even focusing on the core game modes of battlefield which is Conquest, Breakthrough, and Rush. They promoting all these other game modes and their pile of sh*t battle royale that is now dying because it's a literal copy of warzone. Honestly I generally don't care about those game modes but the fact that they're forcing us to play them through challenge progression is pissing me the f*ck off. The maps are small ass sh*t, and couple of them are enjoyable and the rest either mid or straight dogsh*t. These are just to name a few, there's more issues in the game such as bugs, balance, and etc. Don't get me wrong I certainly did enjoy the game. However once you played long enough, you start to experience all these bullsh*t things on the game.\n\nHonestly it's also my fault. I got fooled once and I blame DICE and EA. I got fooled twice and that's definitely on me. I got fooled thrice now and maybe I'm just ret*rted.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "$110 to have have the battlepass and other micro-transactions shoved in face as you boot the game like a free to play game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Unplayable piece of garbage that takes up just about 6000 GB of space.\r\n\r\nThey saw how well BO7 was doing and thought: \"Ain't no way we're letting them outsh*t us. No one is allowed to f**k over players harder than EA.\" \r\n\r\nBroken polygons that takes just about 3 working days to load after joining a game. By the way, everybody and their mother wants their game on SSD. If you're like me and have the game on a HDD, start the game, go take a piss, have supper, go to bed, go on a six month vacation, and when you're back, your game should almost be done loading.\r\n\r\nFun has been removed in the most recent patch. We were fighting another team in REDSEC, 4v4, just duking it out, respawning one after another, when the game decided to pull the plug on all of us. Our screens turned into a GTA 5's character transition as all of us were looking from the sky, unable to move, no pop-ups, no disconnects, nothing, until we were killed. How dare we have fun, absolutely unforgiveable. Utter bullsh*t. \r\n\r\nLet it be known that EA is always trying to help players out. They went out of their way to rebind everybody's key bind in their latest update. Very smart move. If you weren't playing on default key binds? Get f**ked. Can't have anyone coming up with key binds they're comfortable with, or, God forbid, give them a little bit of advantage.\r\n\r\nThe fun doesn't stop there - EA always goes above and beyond. Some graphical upgrades now turns the entire game looking like Minecraft in 2010. If you're playing REDSEC and loves early game combat with pistols, get f**ked. You could be emptying the clip into a wall without knowing. But hey, at least for the first few minutes while the walls are loading in, it's free wall hacks. But who cares about that? On top of that, a buddy of mine was given the chance to immerse in the world of the visually impaired - his screen went completely black indoors, and completely white outdoors. All he could see was our name tags. He literally needed one of us to be his guide. Let it be known that EA is always looking to bring new experience to their players. How many games can let you experience what it's like to be blind? Exactly.\r\n\r\nAt this current state, I would wholeheartedly recommend this game to all international agencies as a tool for interrogation. Two games in REDSEC and I guaran-f**king-tee you not a single soul on God's green earth can continue without begging the torture to stop. \r\n\r\nBefore any of you 12-year-olds go \"skill issue\", you're 12. I paid full price for this f**king game, I expect a functional f**king game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "YOu know, I've tried really hard to love this game and I can't imagine anyone else to be excited to play this game (pre launch) as I was. I was there for Bad Company all the way until now. \n\nThat said, I cannot recommend this game to anyone. The amount of people (goons) that have cracked the game with aimbots, wall hacks, Cronus systems and other options has made this game essentially unplayable.  Ea and the Dice team KNOWS how to fix the anti cheat to work perfectly but they CAN'T fix it because the numbers of players would fall to the point where bots are the bulk of every lobby.  If you type out in chat that you know that someone is cheating, then the rest of the cheaters of the lobby INSTANTLY job in chat to prove how much they ARE NOT cheating by stating how beast the cheater is. It's such an odd community now. People so eager to rat themselves out for cheating while trying to protect cheaters? Reporting does jack shit and once they actually do a ban wave it'll be MONTHSSSSS after all the hundreds of thousands of reports have went untouched. \n\nThis part is a bit nitpicky but it's how it is.... As an actual VETERAN who served wars for my country, I play this game as a form of escapism and a \"relive\" a moment in time, so why can't I be a field medic as a white man. Why are the snipers black guys and no option to change that? I get that black people and girl boss' can be snipers but statically THEY ARE NOT. I didn't make the stats but they just aren't.  I get including everyone. That's fine but to say you can't pretend to be yourself in an arcady mil sim is baffling. I'm sure I'm not the only one. \n\nThe game has become about what team has the most cheaters with the best cheats. IF you are on the opposite team to where the trash matching making has placed all the cheaters then you'll easily spend the day joining a match, getting wall botted back to back until you leave match, and then placed into ANOTHER match where you are against the shear number of cheaters again. Rinse and repeat until you realize your $80 Dollars is for nothing and you delete this garbage anyways. \n\nDO NOT BUY THIS GAME. IT'S NOT WORTH THE AMOUNT OF ANGER YOU WILL EXPERIENCE ONCE YOU ARE GOOD ENOUGH TO BE PLACED IN THESE LOBBIES. You've been warned.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "First negative review I've ever left on a game. Battlefield players have been begging for a good game since Battlefield 1. \nIt's so bad this time round, that less than a month after the release of this game, not only has the multiplayer already been neglected with lack of fixes and promised updates, but the dev's just sh*t all over every player that paid £70 by pandering to a player base that doesn't even like Battlefield, and they aren't even making them pay for it. \nAnd after claiming to keep the game traditional...we already have a battle pass and Halloween skins. Chasing the Warzone and Fortnite money like all of them do. \nThe core multiplayer has already been forgotten. Players that paid for the game aren't even a consideration, and all they want to do is get streamers and Youtubers to play REDSEC. Nice bait and switch guys...utterly shameless.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Small maps, broken sounds of enemy footsteps, weird balance of weapons and plenty more issues which frustrate me to no end. Despite all of them, i want to play more. But i definitely cannot recommend it as is it now for that price.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I pressed “Do not recommend”, for now. The game has a lot of potential: great gunplay, solid visuals, and a promising core overall. Some maps are unfinished though, especially in lighting, shadows, and detail - like certain New York interiors or the Eastwood map.\r\n\r\nBut the big issue is how heavily the game pushes non‑Battlefield gameplay. There are only three maps that feel suitable for classic Battlefield all‑out warfare, and even those are just decent, not great. The rest feel like they belong in a totally different CoD-game close‑quarters chaos. Eastwood, for example, has a ridiculously low ceiling (about 100 meters), letting tanks destroy helicopters right at spawn. That map in particular feels lazy and poorly designed, even if it does include destructible buildings. Half the time you just fail to jump over a bush or fence that were made too high.\r\n\r\nThen there are the challenges. You pay 70 bucks for the game, then extra for a battle pass (up to 25 dollars for the pro version), and the only way to unlock much of the content is through weekly challenges. Most of those push you to play modes that have nothing to do with what Battlefield is supposed to be, like the free‑to‑play battle royale or small‑scale deathmatches. Sure, you get four (oh how generous) challenge rerolls, but it’s not enough. Half of them still require you to play the stuff no one bought Battlefield for. If players wanted to play BR or CoD‑style matches, they’d go play those games. Battlefield doesn’t need to push them to the playerbase..\r\n\r\nAll that said, the game could be (and I hope it will be) fantastic if the developers focus on what made Battlefield special - large‑scale maps, jets, helis, team gameplay, and real escalation / conquest‑style battles. If they remove these forced CoD and BR narratives and start designing proper Battlefield maps again, this could easily become a 10/10 experience. But if they keep chasing that “cod-streamer” trend, it might drive away most of the loyal player base, turning what could’ve been a big W into a big L.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "First of all, you cannot sell players a battle pass after charging them $70. You can’t expect Battlefield players to be deceived by shiny skins. The seasonal map system also doesn’t appeal to me, because what I like about Battlefield is having fewer but larger maps. I played so much Caspian Border in BF3 because it was a really good design. I’m not seeing myself getting excited over seasonally released content. Vehicle balancing is incredibly bad. One tank shot and an RPG missile do the same damage. Air vehicles have almost no customization and die in one hit. Many maps are poorly designed and too small for air vehicles to be enjoyable. Why does support have both medical and ammo supplies? Why is there no player count selection? Why do I have to play with the maximum number of players DICE chooses? The only positive this game has is the gunplay, shooting feels satisfying. The new squad revive system is also really cool.\nI’ll continue playing the game because unfortunately there is no alternative on the current market. I’m giving a negative review because EA and DICE shouldn’t feel proud of this game. I know they are capable of much more, yet they continue to push predatory, anti customer tactics instead of providing a fun shooter experience.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Vibes of Battlefield are ruined after the first update. They got you comfortable on release then decided to add the microtransactions in your face to accompany their battle royal mode. It feels corporate and like its following a formula. The campaign is fine, kind of cringe. The maps are the worst part of the game. They are VERY small and don't feel like Battlefield at all. It's a shame because the gameplay itself is very good and the game is beautiful looking. I feel foolish for buying it so early. I miss Battlefield 1 and 4.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I really want to like Battlefield 6, but I just don't as it is right now. I really enjoyed the beta and was excited to play the full release, but it feels like the beta was a totally different game.\n\nGame has been optimized pretty well. Gunplay feels good, but overall there is a bit too much chaos and i would like to see bigger maps.\n\nIt's a decent game, but not worth the full price in my opinion. Ofc it could be worse, but at this point for me this game is unplayable. It was fun while it lasted. Wish i could get a refund.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "NOVEMBER 11 2025...... thank god DICE has added more pay walls instead of fixing their damn game, this is turning out to be a total waste of 70$. Fix you're game and quit adding stupid skins no one cares about. I've had the challenges for the PSR completed for over 2 weeks now and guess what, no patch to fix it, no heads up from the devs on when this will be fixed. But don't worry they will keep adding more stupid skins and battle passes that you need to pay for. this is beyond stupid, Good job DICE you're exactly like COD",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Random recent patch now crashes my game with \"DirectX function\" error any time I start matchmaking. Re-installing drivers, re-installing the game, rolling back driver installs, and even re-seating the PCIE cross-through cable  did nothing to remedy this. It's just a pretty mediocre UI simulator now. 1/5",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "esto no es battlefield si no call of duty .esperaba mas y no lo mismo de otros juegos.esto no deberia costar$70 si no mucho meno",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "More Call of Duty Than Battlefield\n\nAfter spending a good amount of time with Battlefield 6, it’s hard not to feel like the series has drifted far away from what made it special. Instead of the large-scale, tactical sandbox that defined Battlefield for years, BF6 feels more like Call of Duty than Battlefield, and not in a good way.\n\nOne of the biggest issues is the map design. The maps are far too small, which completely disrupts the sense of scale and frontlines that used to shape every match. Instead of pushing a coordinated offensive or defending a clear line, you’re constantly being shot from every possible angle. There is no front line whatsoever, just chaos. Dying feels less like the result of strategy and more like random chance, because enemies can appear from literally anywhere.\n\nRespawn timing also contributes to the problem. Respawns are so fast that fewer players even bother to wait for a revive. This kills the classic Battlefield teamplay loop, where medics had a meaningful role and sticking with your squad mattered.\n\nMap verticality is another major frustration. On many maps, it’s possible for players to get onto rooftops you’re not supposed to reach without a helicopter or exploits. Once campers get up there, you can’t get them down. They can even hold objectives from these inaccessible spots, which breaks both balance and immersion. And then there are the structural oddities—entire floors with no stairs or elevators, and “real fake doors” everywhere. It makes the maps feel rushed and inconsistent.\n\nAnd leaving aside the gameplay problems, the monetization leaves a bad taste. Charging €70 for the base game, only to ask for another €10 or €20 for a Battle Pass two weeks later, feels flat out disrespectful. For a full price title, that level of aggressive monetization is just unacceptable.\n\nOverall, Battlefield 6 feels like it has lost its identity. It’s neither the large-scale, strategic Battlefield experience longtime fans love nor a polished close-quarters shooter. Instead, it’s stuck somewhere in the middle, smaller, faster, messier, and ultimately less satisfying.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Between frustrating moments of \"how the hell didn't he die?\" and \"where did my bullets go\" you have an unbalanced mess of a Battlefield game where SMGs are the new ARs and everyone runs Recon or Support.\r\n\r\nThere's a fun game in there somewhere, but the amount of shit you have to shovel to find it isn't worth the time, money, or effort right now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is full of bugs, and they only fix them once a week (I feel sorry for everyone who had to deal with people climbing onto the bridge with a drone for a whole two weeks), rolling the game back to beta stats and adding even more donate and bugs. \r\n\r\nAt the time of writing this review, the game has 200k players on Steam, but if you try to play Escalation or Breakthrough, you’ll have to wait for the lobby to fill up, or you’ll end up playing with bots mixed with real players. It’s pretty strange for an online game with 200k players only in Steam.\r\n\r\nRight now it’s impossible to play as a medic: the defibrillator constantly bugs out and you can’t revive a teammate, or when you die you bug out yourself and no one can revive you, and you can’t respawn either, but they always see your marker on ground.\r\n\r\nRedsec part. The most disgusting part of the game. I often have to reroll my weekly quests just to get rid of this nonsense, and if I’m out of rerolls, I’m forced to queue for yet another battle royale or elimination mode (Gauntlet).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A sizable chunk of the playerbase has been totally locked out the game since launch due an infamous DXGI bug that causes the game to crash roughly 2-15 minutes into every match on certain systems. There's a massive thread about it on EA's forums (the biggest one on the whole site in fact) and yet they STILL haven't fixed it or even acknowledged it in the patch notes over a month later. Nice to know that me and thousands of others spent $70+ for nothing. 👍",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Maybe it's a skill issue, but if you are new to shooter games and/or want a more slow-paced Battlefield experience, look somewhere else. The game has not even been out for a month and the skill gap is already so enormous that in most matches I get mowed down constantly. I can't even get 2 shots into someone before they turn on me and clip me in an instant.\r\n\r\nThis is the reason I stopped playing FPS games overall, because at my skill level, it becomes almost impossible to enjoy the game and overall 8 out of 10 matches I struggle to compete. There is no skill-based matchmaking if my skill bracket means I am cannon fodder rather than actually playing decently, or I'm just losing touch with games like this.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I had high hopes for this game but ... There it is +-1 month out - Battlepass, Starter pack, Advanced pack, Battlefield Pro, Battlefield Coins ... I mean ... Let's go back to the BF3/4 age ....\n\nTbh, im not mad, im disappointed. \n(I also own a PS5 version if any smarthead is thinking I played it for 9hrs)",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "TLDR: It doesnt respect your money nor your time. The gameplay is fine but not worth the money. Theres a bunch of bugs and poorly translated things in the game.\n\nSo let me get this straight. battlefield 6 costs 70 euros or a phantom edition for 100 euros, has a battlepass each season for 25 euros, has a premium currency and a store where most things cost 5 to 30 euros. Lets look at this bundle that has 3 items for 5 euros with a shitty copper dog tag with a palm tree on it that you wont ever see unless when an enemy takes you down with an animation?  Pretty much all the bundles are missing most of their items. It just shows '/'. But hey you get a 10% discount if you have EA Play....\n\nThe gameplay is okay, i actually think its pretty good, but nobody works together anymore and the game doesn't incentivize you to do so anymore. The air vehicles are shit due to oversimplified controls, like you cant even strafe helicopters anymore, losing a complete direction of movement makes it very yucky to fly them when the air vehicles used to be my favorite. Going into land vehicles only works until the 1-5 players you killed get pissed off and switch to engineer to blow you up with their rockets. Enemies spawn seemingly everywhere nowadays in some modes, usually where you came from or the room you cleared. \nThere's already cheaters who kill you before you get your first shot off. \nTheres a ton of items like attachments that have confusing descriptions as if translated by someone who doesnt fully understand english, either that or it was done in batch by AI. The weekly challenges and stuff often have things that dont require what you're doing or they arent properly implemented. Like needing to do fire grenade launcher damage but the fire doesnt count. so you can only get a few points of damage by hitting people directly... but you need thousands. \n\nI've been playing BF since BF 2. Ive never played a BF game that feels this much like COD before. gameplay is fine and better than the last game, but theres still a bunch of issues. Like people flying on drones using hammers. I don't think i'll give them any more money or buy the next game. Im only playing to spend time with friends but i have no more loyalty to this franchise. With that being said i look forward for the upcoming BattleBit update.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Give us big maps. I really hate dying .00005 milliseconds after spawning/ Stop focusing on trash like BR modes & COD skins. Fuckin hell this is battlefield, fix it",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Loved the game, but this last update sucks, and frankly it's been downhill since launch. I am not confident the devs know what they're doing. Don't regret my purchase, but wouldn't recommend the game at this point.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "game is not worth £60 like its just your generic fps go buy an indie game like you'll have more fun and you wont pay nearly as much",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "In short, BF these days is basically  a glorified COD. 0 tactics just run and gun.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Don’t buy this game on PC,  you risk getting banned due to conflicts with other software.\n\nI appealed my BF6 ban, and EA responded with the following:\n\nThanks for contacting us about your account action.\n\nWe got your note and did a full investigation of your account. After reviewing your case, we determined that we took the correct action in accordance with EA policies and procedures.\n\nWhat this means\nWe have confirmed that your account was involved in cheating. Because of this, we will not remove the sanction on your account.\n\nOn a positive note, it’s clear that BF6 is serious about cracking down on cheaters, even anything that resembles or behaves like cheating software can trigger a permanent ban. Unfortunately, that also means innocent players like me are getting caught in the crossfire due to harmless third-party software on their PC.\n\nIn my case, I use a program that lets me play keyboard-and-mouse-only games with a controller, and it may have behaved similarly to tools used for unfair advantages even when not activated. As a result, I lost access to a £90 game I can no longer play with friends.\n\nSo it’s a thumbs down from me for the PC version, but a thumbs up to BF6 for maintaining zero tolerance against real cheaters.\nMy advice: buy it on console if you want to avoid a potential ban like I experienced.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was just here for the revolver only to realize it needs lvl 40 \ni will change my review whenever i reach lvl 40 and get the revolver\nalso , there is lots of cheaters and people just kill themselves so playing Medic is useless , playing Engineer is useless so it only leaves the two other class , Recon and Assault.\nPlaying with Sniper feels like shit because in order to balance snipers they made the bullet take an hour to travel and due to movement nobody really gets hit with it so people will just pick assault rush in with a rifle or camp behind a wall and when they die they smash their head on Give up button",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Can't recommend this game in it's current state. My internet is good, latency is supposedly in the 35ms range, I unload a whole mag into someone's face and they turn around and 1 shot me. Spot an enemy, dodge out of the way, get round the corner and die behind a wall. The blatant cheating has just gotten worse since the latest update as well, seemed to calm down for a while beforehand, kernel level anticheat does nothing to stop it. The maps are bland, with only a few \"good\" ones, and the ones recently released are mostly pretty poorly thought out and become meat grinders.\n\nOh an of course hot dropping a battlepass and cash shop AFTER launch so those who dislike these practices couldn't refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TLDR: This game is good, if you like the look of gameplay then you should play it! It's fun. However, I think that when compared to previous games, it falls short in many places. If you are looking for something more like classic battlefield this isn't all the way there (though it is very close) and I would say to keep that in mind. I have a few issues with the game, that if sorted I will definitely change my review. \n\n(Also, I forgot to add this in the main body of my review and I can't be bothered to add it in now. The campaign is good, it's fun and engaging. It's nothing that will win an award but I doubt anyone would expect that from a battlefield game. It also makes a lot of the multiplayer maps cooler for me, since they are all places you visit in the campaign as special forces, it feels like the match you play is the battle going on around you during the missions, which is awesome)\n\nIf you have seen gameplay of this and it looks good to you. Get it! It's fun to play and it gets the job done.\nIf, like me, you were looking forward to playing this game because of the whole \"It's like classic battlefield\" marketing. I would say hold off. It is [i]so very close[/i] to that. There are just a few issues in the current state of the game that, for me personally, hinder the experience.\n\nFirst off, the complete lack of an official server browser (yes I know the server browser exists for community made portal content) makes playing, at the best of times, simple. You only need to press two buttons and you queue for a match. However, at the worst of times, you can be sat at the start of the match for sometimes upwards of five minutes waiting for people to join, only for the lobby to be flooded by bots and making the first five to ten minutes of a match extremely boring. I have no idea why they removed this, as in previous games (most of my playtime being in BF4/1) you could choose the mode you wanted to play and it would find a lobby for you, but you could also go through the (much better) server browser. This led to matches being full from the start and being able to play multiple matches with the same teammates, which for a team based multiplayer shooter was much better as an experience.\n\nMy second issue is the class system. I like that they have made an attempt to fix some of the issues that were there in the beta, for example giving the assault class a more defined role than just run around and shoot people. My main issue with the classes is the \"consolidation\" of the medic/support role, which on paper is great but leads to both of the roles feeling worse to play overall. I think the idea of making the same bag both heal/resupply teammates is cool, but as someone who primarily plays the \"medic\" role in team based games I feel like the healing system is just subpar when compared to games like BF4/1. For one the medic pouch from previous games is now locked behind 4 assignment steps rather than class levels (which from what I can gather don't exist anymore?) or even just account levels. I will say that the other classes seem okay, though I have only played a little bit of engineer and recon (not assault). Though there is the downside of respawn beacons being removed from recon and moved to assault.\n\nMy final main issue is the weapon level system. There are 50 levels per gun. I understand that compared to something like Battlefield 4 there are many more attachments per weapon (especially considering most attachments in that game were locked behind battlepacks) and I also understand this isn't a yearly COD game where, from what I can remember (haven't got recent experience), you can level up guns in a matter of a few matches. I find that most of the attachments don't make a big enough difference to merit multiple tiers, though I haven't done extensive testing. For example 3 different tiers of vertical foregrip that as far as I can tell from the modding screen don't change the stats of the weapon depending on which you have equipped. The whole needing to get through 50 levels to get the ability to mess around with attachments is extremely slow and boring, I think the highest gun I have managed to get in my ~12h of multiplayer is 31 or 32, mostly because I want to try a different gun (which you then have to spend hours grinding) before I can finish levelling.\n\nAll of this being said I don't think this game is bad, far from it. It is MILES better than 2042, though I'm not sure that is saying much. I just feel like we shouldn't settle for better than the worst game of the franchise, when IMO it doesn't outdo previous instalments that came out 10+ years ago. That being said, this game feels great to play, the gunplay is great, like your character is holding an actual rifle rather than the admittedly airsoft-y feel that battlefield 3/4 had with a lot of guns. It sounds amazing too, the audio is extremely immersive and I really appreciate the tinnitus settings as someone who can struggle with that in some games. Obviously this is the best looking battlefield game, but that isn't just in terms of fidelity, I don't like using the word \"vibe\" when trying to describe something but I hope you will understand what I mean when I say each map has the vibe of an actual battle.\n\nBut hey! Maybe I'm just being picky and I should just be happy that we have a better battlefield game again. I just feel like this game is like 75% of the way to being perfect and I can't help but want the extra 25%. You might disagree with me and you would be right if you do. Anyone's opinion is correct for them but I just wanted to write my feelings on this game for anyone who might be in a similar situation to me. Also I will continue to play this game, I'm not using this review to say it's awful or unplayable, but to be a small voice hoping to push the game the final stretch to being amazing. I love the battlefield franchise, it holds a special place for me in gaming, which probably leads me to be more critical than I otherwise would be, so also keep that in mind.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A good game ruined by battle pass and microtransactions",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Was liking the game until they started blocking new weapons behind essentially paywalls with extra steps. Want the new unlockables? Not just skins, but actual equipment... Either pay up or grind the most excruciating game modes no Battlefield player payed AAA price to experience.\nI can only see this getting worse, nudging and forcing players to cough up more after having already payed for the game. This is not a free to play.. This is EA, and i guess i let my guard down.\n\nDO NOT BUY UNLESS THIS CHANGES.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Is Battlefield 6 a bad game? Far from it, but it isn’t worth the $70 being charged at the time of this review.\n\nThe game has a major matchmaking issue outside the NA and EU regions, with the vast majority of matches filled with bots. It’s not solved by simply being patient and waiting for the server to fill up with players, as DICE itself recommended… because once a match ends, the matchmaking system seems to scatter everyone into different lobbies, and you’re back to bot-packed games again.\n\nAnother big problem is the awful main-menu UI: extremely confusing and poorly organized, with dozens of redundant options. It feels like a failed attempt to copy COD UI. Lastly, most weapon attachments are useless; only a handful are actually worth using. It all seems there just to create the illusion of choice, even when those options aren’t viable.\n\nFix these three problems and I believe the game would be worth the asking price.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "$110 Game Checklist\n\nFullscreen Ad for Battle pass on game launch? Check\n\nTerrible Servers? Check\n\nHitreg issues? Check\n\nMicrotransactions? Check\n\nFull of bugs? Check \n\nAudio issues? Check \n\nWait for the game to go on sale, don't support shitty game practices with a full price purchase. \nI'd say wait for the servers to improve but its EA, they've always had terrible servers and refuse to fix them",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "A shame to vote negatively against this because genuinely it's the first Battlefield I enjoy since Battlefield 1 almost ten years ago now.\r\n\r\nIf your play hours are during low population times such as late at night or early mornings, you'll have empty lobbies filled with bots. No persistent lobbies makes this a constant issue, since when you finally find a lobby that has real players it'll reset on the next one and you have to wait once more with bots for half the game. I've never seen a full European lobby in all this time, granted I've been playing late nights and early mornings but this shouldn't be an issue on a game such as Battlefield...\r\n\r\nMatchmaking is region locked too, so I can't decide to play on US servers with real players and 64 lobbies without a VPN which would greatly increase my ping. Searching games with a friend in the US is also a gamble as it'll sometimes just throw us into empty EU servers either way.\r\n\r\nThe game is barely a month old and for it to be suffering from player issues artificially is really bad. There's enough players to have populated lobbies all the time, it just doesn't let you.\r\n\r\nPerformance is great, the gunplay is fun and the maps are okay (nothing future seasons can't improve), but if they don't fix this quick it'll damage the playerbase even more.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Tiny, poorly designed maps that feel more like MW Ground War than Battlefield.\n\nGunplay is good though so thats nice. \n\nOh and in typical Battlefield release. Netcode and servers are absolute garbage and get have been getting worse by the week.\n\nOh and now I'm getting bot lobbies where there are only a handful of real players.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game looks like it should be great but looks can be deceiving, as someone who loves and owns all the battlefields this game sucks not the graphics or even necessarily the maps but the gameplay the worst of any battlefield no exaggeration you can shoot at someone and watch as nothing happens and they look at you pull the trigger once and your screen instantly goes black. In a shooting game were the shooting mechanics arent just terrible but fundmentally dont work   I hate i bought this game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The gameplay is fun, not gonna lie. If you enjoyed previous BF you might enjoy this one.\nHOWEVER the amount of bugs in this game surely is higher than all the bugs combined in the previous BFs. \n\nYou join a game, sometimes it doesn't even finish loading cuz people crash.\nServers are laggy, you are behind a wall but still get a headshot a second after.\nYou want to change to a class mid game and spawn as a different one. GL!\n\nI don't care about the battlepass so can't say much about that..",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Look i have been playing alot of the Battlefield games since BF Vietnam.  Vietnam was good, BF2 was amazing, bad company amazing, Bad company 2 was good, battle field 4 was when this series peaked, 2042 was a huge let down at launch but turned out okay. \n\nNow battlefield 6.... it doesn't know what it want to be either a COD, battle royal, or a resemblance of an old battlefield game.\n\nthe destruction is great, sound is great, levels are interesting, guns need work, classes need work, level size needs work, game NEEDS work.  Every round turns into who has the most tanks and i just got shot from 100m away with an smg. The battle pass is shoved down your throat at every menu and when you turn the game on. NO one asked for REDSEC we just want battlefield. They just added goofy special weapons into the maps, dumb.\n\nfor the DEVS just make Battle field 4 again with updated graphics and new guns and you can have my money.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "While I definitely enjoy the game enough to put the hours in, there are multiple things wrong with this game. This game is generally a step in the right direction in a few areas, but somehow a step in the wrong direction in others.\n\nThe UI is actually atrocious. HULU menu ahh UI. Why am I scrolling through a movie list to select a game mode. The weapon/gadget/character selection also all sucks. Why are there these giant squares on my screen like I am on a mobile device using touch controls?\n\nThe gameplay generally feels better than 2042 in my opinion, but it still lacks in some areas. The guns have a weird damage falloff that doesn't make any sense in game. Why am I suddenly doing 25 damage instead of 33 because the enemy is now 6 meters away instead of 5? SMGs are more accurate than most ARs at longer ranges (???). Vehicles mostly feel good to use, though the MBT's main shells all feel like the difference is so small, the blast radius on the HE shells is also atrocious. \n\nMaps are a major over-correction from 2042. 2042 had giant open maps at launch with little to no cover and they felt like a blank canvas with objectives randomly placed. Over the years they fixed a lot of the issues and the maps flow at least a little better (a good chunk of them are still butt cheeks). The game certainly felt better. \n\n-NOW with this game, they decided to make the maps INSANELY SMALL compared to 2042 and even previous games. There is no breathing room on nearly every map, even the biggest map is smaller than most of Battlefield 4's maps.\n\n-Not only are these maps small, but you can basically shove some of these maps together to make an actual Battlefield map. \nEmpire State and Manhattan Bridge are basically positioned right next to each other, YET THEY ARE DIFFERENT MAPS. You could have given a use for water vehicles in this scenario and used the bridge as a land connector. \n\n-New Sobek City was labeled as larger map, when you have to only walk 15 seconds to get to the next objective (do we even playtest our own game guys?).\n\n-Siege of Cairo, while a decent map, suffers from being relatively small again. They do not want players on the rooftops (which I think would have been a cool addition, JUST NOT EVERY ROOFTOP). Make the bridge actually playable without exploits, expand the map further down the main road and the bridge, put an objective on the bridge and make the bridge collapsed with some rubble and other ways to get up.\n\n-Liberation Peak is another map that could have been great, had it not been squished together by the devs, making this map larger and giving a bit more cover would have been a good addition, possibly putting an objective or two in the valley and making the objective on the top part of the map more walled to allow for more infantry access rather than vehicles and snipers.\n\n-One of the post launch maps, Blackwell Fields, or whatever its called, could have actually been a great map, HAD THEY NOT SQUISHED IT TOGETHER AGAIN. On Conquest I actually do kind of like the map despite what a lot of people say, but its just so awkwardly small. Given some more hills and other small buildings and expanding the actual map size could have made this a very good map. The new vehicle on this map is also very fun to use and feels deadly. Flying a jet on this map is so funky. The distance from the out of bounds on your spawn side to the enemy freebie objective is roughly 1000 meters. OUT OF BOUNDS TO OPPOSITE OBJECTIVE IS 1000 METERS. WHAT THE FUCK??.\n\nObviously, I am not a developer, but I am free to criticize and give my opinion on what I think would be better for the game. I seriously do enjoy playing this game and prefer it over 2042, but to say this is a great Battlefield would be lying and a slap in the face to nearly anything before this. IT IS ABSOLUTELY A FUN TIME, but needs some serious changes in the near future.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I keep having issues where enemies kill me seemingly instantly. 5 bullets from the same guy at the exact same time.\r\nSeems impossible right?\r\n\r\nFor once I don't think that's caused by other players cheating, but something a bit more complicated.\r\n\r\nI think this is caused by aggresive lag compensation and whenever I land on a server with a very high or inconsistent ping, my game runs a couple hundred ms behind everyone else. This means that I have much less time to react.\r\n\r\nEnemy sees me and unloads half a magazine and because I'm lagging behind, I don't see the him and can't react. Server registers the hits and \"kills\" me before I even know it. It does seem to happen the other way around, to a much lesser extent whenever I hit someone else - server just refuses to register hits sometimes.\r\n\r\nI don't think EA considers this is a bug. They even intentionally hide the ping from you so you can't easily tell when you land on a bad server. This appears to be intended design, I'm losing hope this ever gets fixed.\r\n\r\nShame because the game plays great, when it actually works.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "cheaterfield 6.\n\nif you are in the shooter games nowaday, 70 % of players use cheats.\nutil you guys are willing to fix this, your game is dogwater.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "2x Experience weekend just for Playstation? Get fucked PC and Xbox players apparently. Good ol DICE back to their anti-consumer bullshit.\n\nEdit: Can't wait to see how things go under Saudia Arabia ownership.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Guns locked behind battle pass iwith paid advantages, in a fully priced game. This crap can't be more EA, I wish the devs and producer of this game will never be able to find toilet paper or water whenever they poop, cuz that's how much they stink",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Game plays well, runs well, and there is a lot of fun to be found. In a way, this installment feels like a return to basics after the hero-based and uninspiring foundation of 2042. It is refreshing, even though it’s essentially the classic Battlefield formula again.\n\nThat said, it is noticeable that they not aiming for the traditional Battlefield audience. Instead, the focus seems to be on a younger crowd who prefer fast movement, sliding, and run-and-gun gameplay. This is understandable from a business standpoint, but it does change the overall feel. Also not a bad thing by definition (im just waiting for them to add hardcore mode to the regular playlist) \n\nWhat really bothers me, however, is how quickly the monetization shows its face. The game has a high price point to begin with, and if you pay for the higher tier (100 eurocoins, in my case) to include the battle pass, you would expect to get the full package.\n\nI played about 70 hours before unlocking my first weapon camo. I’m not a godlike player, but I would consider myself above average. And after all that time, what did I get? A bland, generic, frankly ugly camo.\n\nThen I opened the Store. And there they are: flashy weapon skins and character skins, available immediately for real money. I’m relieved they aren’t at full CoD-clown-level yet, but given the direction, I’m not optimistic about where this is headed.\n\nThis kind of monetization behavior is not new in the industry, and it is unfortunately very on-brand for EA. Still, it feels unnecessarily scummy when the base price is already this high, and progression for cosmetic rewards is intentionally slow and unrewarding.\n\nIt leaves a sour taste in an otherwise enjoyable game.\n\nThey squeeze every penny they can. You pay full price for the game, then more for the battle pass, and then the best-looking cosmetics are placed behind an additional paywall. It is not enough for them that you bought the product. They want you to keep paying for the privilege of making it look decent. EA knows exactly what it is doing here, and it is squeezing the player base because it works.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Has potential but there are too many small maps and modes that just aren't Battlefield. Then there's the sloppy netcode and hitbox issues, cheaters, ridiculous challenges (like sabotage ones) and portal mode doesn't function the way it could. EA/Dice just keep getting in their own way. Bring back large maps from previous games, fix the netcode and bugs already.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game had a fantastic beta and a very good launch experience. Some flaws were quickly fixed and others (Broken progression through challenges) at least addressed.\n\nThe first major update has now turned the game into a \"not recommended\" for me. I do not care about Battle Royal games at all. Forcing players into that dog-water mode in order to complete their weekly's is an absurd joke and kills all the motivation I had for the game.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Overall fantastic game, just a few things that are complete rubbish. Make crossplay optional and stop forcing us to play with console players with aim assist. Stop forcing us to play battle royale to earn battlepass points, most people play this game for what battlefield used to be, not whatever that BR garbage is.\n\nEdit: Last update bugged your stats, you lost all kills done in Casual Breakthrough, but the deaths remain, butchering your stats :)",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I'll preface this review by stating that this is a modern Battlefield title, meaning that if you have any expectations going into the game, lower them or get rid of them altogether to avoid disappointing yourself.\n\nIf you aren't going to lower expectations, you need to keep in mind that this is a modern AAA shooter slopfest, meaning you are going to be subjected to microtransaction hell complete with battlepasses and challenges that are 100% designed around FOMO tactics.  These tactics include significant amounts of grind just to earn a single point that seemingly get longer with each unlocked battlepass tier, and unrewarding challenges that either give too little in the way of progress or have excessive requirements that are there to keep players hooked out of pure frustration.\n\nGame balance is also a mess because this game is designed to appeal to everyone.  Expect to be stuck in matches where over half of your team will have negative K/Ds alongside players who will outright refuse to play as a team because the game does nothing to discourage that kind of behavior, alongside how basic kit items such as frag grenades or HE rounds do very little splash damage because the game has to appeal to the CoD only crowd.\n\n\"But you have 150 hours and are still playing it\" as one might ask.  As it turns out, dunking on people who have no idea how to play shooters is still incredibly fun, but for anyone reading this, I can't say if you will find that to be fun for $70.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Good game utterly ruined by the challange mode.\nMajority of challenges locked behind mind numbing retarded game modes that nobody wants to play.\nGood luck being a solo and trying to get them done with randoms.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "[b][h1]REDSEC (BATTLE ROYALE) MODE REVIEW BATTLEFIELD 6[/h1][/b]\nSo, where to start? I guess I'll start with why the review is negative and whether there are ways to turn the many negative reviews into positive ones. Let's begin:\n\n[h3]SHOOTING[/h3]\n\nThe game has a terrible shooting system, and it's full of bugs! ADS Bloom is an outdated mechanic that no longer applies and does not level the playing field between PC and console players. It's incredibly frustrating when you take aim and start shooting at an enemy standing 50 meters away, and only 2-3 bullets out of your entire magazine hit their target. The same situation occurs at a distance of 5-10 meters. The entire magazine of a PW7 or any other SMG is used to inflict 160 damage on the enemy, and if they have a machine gun, they will outgun you, even if they are standing still. NONSENSE!!! Why not resort to adding a stronger visual recoil and making it a hit scan (removing the spread and making the weapon 100% accurate). That's the skill-dependent basis of shooting. With over 15k hours in online shooters, when you enter Battlefield 6, you don't control your shooting with your skill... Sorry, but this seems like a complete failure and incompetence on the part of the developers responsible for balance! The developer promised to fix this in the October 28 patch, but alas, the lines are in the patch notes, but there are no changes in the game!\n\n[h3]BALANCE[/h3]\n\nAlso, regarding balance, I can say that Battle Royale mode has the same flaws. Why the hell are there tanks in the game? It's too much! They literally destroy everything in their path. Okay, let's imagine that tanks are a distinctive feature of Battle Royale from Battlefield and they are not going to remove them. In that case, I suggest balancing their use. Since in 8 out of 10 games in the endgame there is at least one tank on the map, let's go the following way - all tanks start to detonate, similar to the existing sabotage mechanic, as soon as there are 10 squads left on the map! Voila! — the presence of tanks in the game is balanced! \nNext, we have a second chance system, and it's like a stopgap in this game, since nothing better has been come up with yet. Even if you play like a complete idiot, you have a 100% guarantee that you can return to the game. Why??? There is no risk and no tactics involved! The game is already very similar to [spoiler]CoD's WZ[/spoiler], and besides, there is an excellent second chance mechanic there, namely “Gulag.” Make something similar, for example, one of the Gauntlet round modes, only 1 vs. 1 and with shorter mission conditions. In any case, it's better than a free return to the battlefield!\n\n[h3]SOUNDS[/h3]\n\nSounds... Very strange sound behavior, at least in Battle Royale mode. In the main game client, I like the sounds, especially in Night Mode. I can hear literally every step and distinguish its direction. But in Battle Royale mode, I may not hear a tank 10 meters away from me. The ambient noise is too loud, and the sound reflection is very poor. I can hear the enemy about 2 out of 5 times. Also, I often hear only one enemy running behind a wall. I come out to face them, and there's a whole squad there, which guarantees my death. Terrible, absolutely terrible. The developer who worked on the sound map definitely didn't work on it in this mode; everything was done automatically with AI, at least that's how it looks.\n\n[h3]VISIBILITY[/h3]\n\nThis is both a good and bad feature of the game. The game looks gorgeous. Every time I am surprised that an online game with 100 players playing simultaneously can look so good and optimized. But, sometimes I just can't see my opponents. Yes, an identifier in the form of a red square often appears above them, but if the enemy is more than 50 meters away, they are not always marked even on the map, or they blend in very strongly with the background of rocks, sand, and other debris. I can offer my own solution. I really like the setting from [spoiler]CS2[/spoiler] - “High contrast enemies”. When enabled, enemies appear with a barely noticeable halo, which makes it easy to spot enemies that blend in too much with their surroundings. It doesn't make them stand out too much in the overall picture, but against the backdrop of such a busy image as in Battlefield 6, it will allow attentive people to really see the enemy.\n\n[h3]BUGS[/h3]\n\nAs for bugs, I often see enemy recons units hitting their drones to fly into the sky. Or how fast people fly off the ladders of assault, pushing off from them. Oh, and how annoying is the bug where, when shooting after strafe or jump (with sufficient delay), I don't hit the target, but it's as if I'm shooting from the hip. Why are there no hotfixes? We have to wait for a major patch to fix these annoying bugs (P.S. in the October 28 patch, there are only changes in the patch notes, but in the game itself, the bugs are still present and working).\n\n[h3]ARE THERE ANY WAYS TO FIX IT?[/h3]\n\nYes, there are, and plenty of them! \nThe game is very good, but only in its main mode so far. The RedSec mode was rushed out to drown out the hype of competitors, which seems obvious. I believe in Battlefield, that they will be able to retain their audience and gain many new ones, but there is a lot of work to be done! First, fix all the critical bugs and errors, namely ADS Bloom, various exploits, and the most nasty visual bugs, such as self-destructing houses. Next, you need to work on the sound, overall visibility, and balance. THAT'S IT! The game will be as comfortable to play as possible for 90% of players! \nOtherwise, the game is extremely good! The optimization is excellent, the response is very fast, even with frame generation I don't feel any input lag. The animations deserve special applause. The movement is also well done. Not as fast as in [spoiler]CoD[/spoiler] and not too slow. In general, it's perfect!\n\nupd. \nNothing has changed",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Long story short save your money. The game is following in the foot steps of call of duty. A SMG will defeat an LMG from 200M away. All weapons are unbalanced no matter what class or configurations you try. Anti-Aircraft weapons use plastic BB's for ammo. Hit registration is god awful. Aim at the head from 10M you will hit the lower shoulder. I love Battlefield but this is such a nightmare. I have given it all I had to like this game but there is a time when enough is enough. Stop giving these company's money until the produce a functioning game.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I grew up on Bad Company 2, BF3, and BF4, so I’ve been burned by the last few Battlefields. My friends talked me into BF6, and honestly, it’s not bad. It’s basically a “Zoomerfied BF4,” faster, flashier, with less room to breathe, but still fun when you’re in a squad.\r\n\r\nLaunch was surprisingly smooth for a Battlefield title. Servers work, performance is decent, and gameplay feels solid after a few patches. The gunplay is in a good place now, though weapon variety is still thin. Hopefully they add more content over time like BF4 did.\r\n\r\nThe campaign is horrible. It feels like the writers were watching Subway Surfers when they made it, and even in the big set piece moments, they have the player doing something mindless, like the M03 turret section before hitting the beach. There are plenty of immersion-breaking moments even by arcade shooter standards. The worst of it is in the prologue. Throughout that mission, there are a lot of “we get away with this?” moments, but I can train those down because it’s an arcade shooter, not Arma. But by the end of that first mission, during the final stand in the crashed Blackhawk, you watch your squadmates die one by one until you are the last one. Even though you didn’t spend much time with them, you can feel the heartache as each one drops. It builds to you taking a mostly empty 1911 and pushing out of the wreckage to take a few more hostiles with you before joining your fallen squad, only to be saved at the last moment as another Blackhawk sweeps in low, guns blazing, dropping reinforcements. That subversion actually works, because it makes you feel robbed. It gives you that emotional gut punch, the spark of survivor’s guilt that could have led somewhere meaningful… if they did anything with it. Instead, the game immediately skips over it, fast-forwards through the loss, and throws you into a new squad like nothing happened. It refuses to let the player sit with the moment, and that kills any emotional impact the campaign might have had.\r\n\r\nAt $70, I can’t say it’s worth it unless you’ve got friends to play with. But if you miss that old Battlefield chaos, BF6 comes closer than anything has in years. Wait for a sale, grab a squad, and you’ll probably have a good time.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is what you get for 100 dollars.\n\nA broken mess disguised as a shooter. The performance is all over the place — not in graphics, but in networking. You die behind cover constantly because of garbage netcode that feels like it came straight from 2010.\n\nThen there’s the shop — overpriced nonsense everywhere. Skins that look like they belong in a cartoon rather than a military game, and everything costs a fortune. The maps? Tiny. You spend more time spawning and dying than actually playing.\n\nGunplay feels floaty and inconsistent, like every weapon was tuned by a random number generator. And if you actually want the good guns? They’re locked behind ridiculous challenges that require superhuman reflexes or pure luck.\n\nAnd let’s not forget the promises — all the big words from the devs before release that never made it into the game. They simply gave up halfway and left us with this half-baked product.\n\nVerdict: Don’t waste your time or money.\n\nUpdate: 50 more hours - same shit. Lags, cheaters and crazy shit-coded network part.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "As of writing this, 18/11/2025, the update broke the game, Polygons everywhere, pure abyss Venta black textures, bright ass hell flashbangs with shiny surfaces. Truly an update.\n\nCurrently can't reccomend the game in this state.\n\nRoll back the game before it got broke.\n\nWill probably update if they ever fix the issues.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Classic EA.\r\nStarted out great, took them about 30 days to fuck it up.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm not giving this a negative review for game play, its for crashing. \r\nIt hard crashes my system. Sometimes making it hard to boot back in. \r\nI usually have to do a boot/system repair. Sometimes the computer doesn't detect my storage. \r\nThis only happen when playing this game.\r\nI've requested a refund and would probably give the game a try again if EA fixes these issues.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "bullet no register, bullet no damage, me sad :steamsad:\nme pay game, but game not worth it's price :steamsad: x2\nme pay extra game, instant unlocks me did not recieve :steamsad: x3",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game just doesn’t feel good to play. There’s way too much Call of Duty influence in it, and Battlefield has completely lost what made it feel like Battlefield in the first place. The time-to-kill is painfully long on normal. SMGs outclass everything. Weapon balance is terrible. Suppression is a mess and seems to affect everything except LMGs. Portal doesn’t work. There are no dedicated servers or server browsers. And the map and spawn design might honestly be the worst I’ve ever seen in a game.\r\n\r\nOn one map alone, I counted four different routes running parallel to the same left-side street. That’s not even including the center path through the buildings, which has endless flank points, or the right side. There’s no way to set up a defensible line because there are too many intersecting paths, too much clutter, and no real flow.\r\n\r\nOlder Battlefield maps actually understood good macro design:\r\n\r\nDefined lanes with intentional choke points\r\n\r\nA natural flow that encouraged frontlines and tactical repositioning\r\n\r\nOpen sightlines balanced with meaningful cover, not random junk thrown around for “immersion”\r\n\r\nNow it feels like DICE builds maps around constant engagement metrics instead of strategy. The result is simple:\r\n\r\nYou get shot in the back constantly\r\n\r\nSquads can’t anchor or coordinate because every path is a flank\r\n\r\nVehicles feel boxed in by dense urban geometry\r\n\r\nThe chaos feels visual, not tactical, and everything ends up noisy and fatiguing\r\n\r\nBattlefield used to breathe. It had space for movement, rhythm, and map control. BF6 feels suffocating. It’s built for highlight reels, not for actual flow. You used to know when to hold or when to push, and now it just feels like nonstop chaos.\r\n\r\nIf DICE really wants to fix this, it’s not about adding new gadgets or specialists. It’s about going back to readable, tactical map layouts that reward coordination and area control. Bring back intentional design, not just flashy spectacle. Right now, Battlefield feels like a game made for YouTube clips — constant explosions, chaos, and random moments meant to look cool instead of play well. It’s all surface-level hype, and in chasing that, the series has lost the tactical, team-focused core that made it special.\r\n\r\nEven the sound design feels off. There’s no real sense of impact or spatial awareness. I literally had a tank rolling down the street behind me and couldn’t hear it. Grenades don’t feel concussive, and explosions lack weight — it all just blends into background noise.\r\n\r\nSeine Crossing, Grand Bazaar, Strike at Karkand, Firestorm, and my all-time favorite, Metro — those were great maps. BF6 is a mid Battlefield at best, and time will show where it really stands.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Incredibly disappointing cash grab from EA. While it looks pretty, a lot of the game design decisions are very questionable and appeal to the biggest group, taking 0 risks in finding its own identity beyond feeling like a MW2019 clone but in Battlefield with its armory system feeling like a 1:1 carbon copy  and ugly cosmetics.\r\n\r\nNot worth $70, and it'll be a long time before it's even worth $50 with the numerous game balancing patches that will inevitably come and both literally and figuratively small map pool.",
      "voted_up": false,
      "votes_helpful": 12
    }
  ]
}