{
  "positive": [
    {
      "review": "Good titties, one handed gameplay, worth a vote",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Cool strategy game with great AI generated graphics. It's free and you have to be patient to level up without paying money but I think it's fair.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The women look amazing... their is some romancing and pictures and little games you can play with some of the women.  The only down side is that you have to play against other players and i dont really play multiplayer games\r\n\r\nyour truly god gamer",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Gameplay is nothing groundbreaking, but it's fun enough to be a decent little time-waster The bewbs n' stuff makes it funner.  I enjoyed the mechanics and strategy of the fight, and lineups weren't TOO dependent on meta, though there were definitely some fighters you'd have to strategize around more than others. I was totally F2P, and while there were a couple of things I couldn't access without paying (story stuff, skins, some characters that were NOT necessary, etc), none of it was stopping me from playing.  There is definitely MORE THAN PLENTY to buy for those that need to have all the goodies and OP themselves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game oat +rep i goon to this dry... gotta love those amine baddies \n\n¨",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I lost a Steam friend soon after opening this game. Me sad face. 😔😔 I cannot handle the trauma, and the stress now. They meant the world to me. The importance of them was so great, the name was meaningless. It was their kind, and puritanical soul that meant the world to me. Life will never be the same. 😭😭\n\nMy mistake as I should have perpetually maintained my invisibile status as this would never have happened. A mere 12 minutes of gameplay has forfeited me 12 months of friendship in its most basic, and pure form. A friendship that had no need of any sort of interaction.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i used to play this on my phone but then found out it was on steam and downloaded it to play some more. I got further on pc then i did on my phone. It's easy to play, fun, and the scenes are explicit to say the least.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The game is fun and no need for paying unless you want to. Join an Alliance where there are players that are are active and learn the game. DO NOT stay in groups where members are not active.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, never sure what the outcome of the battle will be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The stragtitys are alright but the fact that you can upgrade as you go it awesom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have this game to now only played with not extra to pay.\r\nNow goes it slowly with making progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy the strategy aspect of this game, but have a couple complaints. Upgrading units in the alliance war is ridiculous. I bought a new unit today and upgraded it to level 900.....that means I had to click my mouse 900 times. Finger was a little sore after doing that. Make it so we can push one button for maximum upgrade or choose an amount we want to spend on upgrades. The other complaint is items in the shop are WAAAAAYYYYY tooo EXPENSIVE! I will not pay 100 dollars for a few items when I could just go buy 10 to 20 other games on steam. Lower your prices and people might consider spending a little on the game. I will recommend the game because the strategy is fun, but wouldn't recommend it if you dislike sore fingers from clicking to upgrade units",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game gave me PSGAD and now i cant stop blowing at work",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "fun game to play if you dont take it too seriously",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i cannot purchase anything from the game it got loading and stuck can you help",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so much more than the nudity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HÄMMASTAV, see mäng on elu muudetav",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but it takes a bit of time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game on different account 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love thiis game very much!@",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great gooner game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun to pass time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this Francois jew",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't feel shy playing LG in a public cafe!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, so satisfying",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it wants ur money if u have no patience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for entertainment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gooooood",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games of all time!!!!!11! Can NOT wait for the next update, will be buying some of the newest DLC's as well. Also I'm gay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ttt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "💖",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":>",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "uuuufffffffffffff))))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please reward this comment. I still have 3000 points left to buy those slut avatars and backgrounds. Give me thumbs up, and you will grow 3cm. Reward this and you will grow 30cm.\n.⠄⠄⣿⣿⣿⣿⠘⡿⢛⣿⣿⣿⣿⣿⣧⢻⣿⣿⠃⠸⣿⣿⣿⠄⠄⠄⠄⠄\n⠄⠄⣿⣿⣿⣿⢀⠼⣛⣛⣭⢭⣟⣛⣛⣛⠿⠿⢆⡠⢿⣿⣿⠄⠄⠄⠄⠄\n⠄⠄⠸⣿⣿⢣⢶⣟⣿⣖⣿⣷⣻⣮⡿⣽⣿⣻⣖⣶⣤⣭⡉⠄⠄⠄⠄⠄\n⠄⠄⠄⢹⠣⣛⣣⣭⣭⣭⣁⡛⠻⢽⣿⣿⣿⣿⢻⣿⣿⣿⣽⡧⡄⠄⠄⠄\n⠄⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣶⣌⡛⢿⣽⢘⣿⣷⣿⡻⠏⣛⣀⠄⠄\n⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠙⡅⣿⠚⣡⣴⣿⣿⣿⡆⠄\n⠄⠄⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠄⣱⣾⣿⣿⣿⣿⣿⣿⠄\n⠄⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⣿⠄\n⠄⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠣⣿⣿⣿⣿⣿⣿⣿⣿⣿⠄\n⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠑⣿⣮⣝⣛⠿⠿⣿⣿⣿⣿⠄\n⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠄",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "There comes a time in every man's life when he needs to take a look at himself in the mirror and wonder how exactly he reached such a place.\nYou have to truly ponder what decisions you have made along the way that brought you to the place of your final reckoning.\n\nIt is still unclear, even to me, why I played Lust Goddess.\nThere isn't anything wrong with it, with those nudity scenes throughout it's perfectly stellar. But when you look at it as a choice, you realize just how flawed you and the rest of humanity is.\n\nWhat drove me to play such a game? What part of my soul felt so empty that I thought a virtual girl could fill it?\nWhen I look into the boundless depths of my own loneliness I see a pool of reflection. My face isn't there, there is no face. There are only tears in that pool, tears of shame and loss and confusion.\n\nIf it were up to me again I know I would play it in a heartbeat, I know I would load it up and skip through the countless window prompts so I can have a single morsel of pornographic images which are readily available online.\nYet, despite the abundance of naked virtual women waiting in the digital sphere, I still chose to play this game and devote hours of my life to it. That time will never return to me, it is lost just like my soul and just like the time I fear I may never find it again.\n\nThere is something broken within me, something that desires sensation beyond my reach, something that whimpers every single night with the knowledge that there is no true Princess, it is a merely an illusion.\nIn my pursuit to find meaning in this long life, I sought the colorful lights and sounds of a world that only exists in a pop up window on my computer.\n\nI am unsure what the moral of this review is, I am unsure about my place within the universe, all I know is that no amount of virtual girls can cure the vast rot that has overtaken me.",
      "voted_up": true,
      "votes_helpful": 253
    },
    {
      "review": "this game doesn’t just make me horny it rewired my entire nervous system i booted up thinking “haha funny anime waifus” and now i’m sitting here bricked up at 3am whispering “step on me goddess” into my headset like a deranged priest\r\n\r\ngameplay yeah whatever click button watch numbers go up i couldn’t even tell you what the story is because every time a character starts talking i’m too distracted by thighs bigger than my future the devs really said “plot” and gave us two of them right in front of our faces\r\n\r\nsummoning new characters feels like horny russian roulette either i get a new waifu and immediately need to change pants or i get dupes and start bargaining with god like “please just one goth mommy” and then spend another 20 bucks\r\n\r\npros\r\n\r\nevery login is just edging disguised as gaming\r\n\r\nwaifus so hot they make post-nut clarity feel like a near-death experience\r\n\r\nfinally a gacha where i’m okay being financially ruined\r\n\r\ncons\r\n\r\nplaying this in public will get you on a list\r\n\r\nwallet emptier than my balls\r\n\r\nshame hits harder than any boss fight\r\n\r\n11/10 lust goddess has me feral i don’t play it i let it use me",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "I play for the graphics. Yeah graphics are nice. Gameplay is ehh",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "this game is total bullshit, I was hoping I could fuck Hitler but it didn't happen",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Good titties, one handed gameplay, worth a vote",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Ok - so - I FTP this and, in order to enjoy it, I have my expectations turned WAAAYYYY down.\n\nThere's no way I can beat the whales.  The 'wars' can be a joke.  I can't always get the characters that I want and it takes FOREVER to upgrade.\nYou know what?  I ... don't ... care!\nArt is ok (except for some of the girls ... I did mention 'WHALES' before)\nChallenges are challenging and it really is just a game you really need to set your expectations honestly to.\nI'm comfortable giving this a positive reveiw.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cool strategy game with great AI generated graphics. It's free and you have to be patient to level up without paying money but I think it's fair.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The moment I first booted up lust goddess , I knew I was in for something special, but I had no idea it would become a part of me. This isn't just a game; it's an emotional journey that has left a permanent mark on my heart. I find myself thinking about it all day, touching myself gooning to main character \n\nFrom its breathtaking visuals to its deeply moving soundtrack, every element of this game is crafted to evoke a profound emotional response. The characters feel so real, their stories so personal, that you become completely invested in their fates. I’ve laughed with them, cried with them, and felt their triumphs and losses as if they were my own. There are specific scenes that, even weeks later, can bring a tear to my eye just from a fleeting thought.\n\nPlaying lust goddes isn’t just about completing quests or beating bosses. It's about experiencing a narrative that challenges you, makes you reflect on your own life, and reminds you of the power of storytelling. This game is an absolute masterpiece, and I cannot recommend it enough to anyone who wants to feel something truly unforgettable. It's a review I find myself writing all day, just in my head, because it's impossible to get this game out of my heart.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I lost a Steam friend soon after opening this game. Me sad face. 😔😔 I cannot handle the trauma, and the stress now. They meant the world to me. The importance of them was so great, the name was meaningless. It was their kind, and puritanical soul that meant the world to me. Life will never be the same. 😭😭\n\nMy mistake as I should have perpetually maintained my invisibile status as this would never have happened. A mere 12 minutes of gameplay has forfeited me 12 months of friendship in its most basic, and pure form. A friendship that had no need of any sort of interaction.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The women look amazing... their is some romancing and pictures and little games you can play with some of the women.  The only down side is that you have to play against other players and i dont really play multiplayer games\r\n\r\nyour truly god gamer",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "i used to play this on my phone but then found out it was on steam and downloaded it to play some more. I got further on pc then i did on my phone. It's easy to play, fun, and the scenes are explicit to say the least.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The game is fun and no need for paying unless you want to. Join an Alliance where there are players that are are active and learn the game. DO NOT stay in groups where members are not active.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the graphics are ok , dont really care for the buy buy buy game play ....you dont get much save that but a pretty picture for what equates to about 2 hours of paid work for at a blue collar job",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game especially for an NSFW! Im addicted.\nI am a fan of the game, but I found out that steam is a secondary platform. It is available on the Nutaku website where they offer Free Daily Gold = Gems (in-game currency), so you will save a ton playing there with those discounts and freebeis. I wish that I played there first instead.\n\n\nBelieve it or not, It is an actual game with a good community online. The Alliance and in-game events gives this a fun communal dynamic that keeps you coming back with daily, hourly and monthly goals on a timer. You can build your squad and trying out different ability combos. It can be a bit of a money pit, but with diligence and patience you can rank up quickly! I reccommend using Nutaku's official site instead of steam if you wanna buy anything.\n\nThe scenes and art are exactly as pictured, no skimping on showing all the good bits for those into that, there's lots of cute girls. You have to play with your girlfriend every day to get bonuses and level them up, Pretty cool.\n\n\n\nUse this code in the profile window to redeem some gifts to help you get started: JFQLXJ. And here is the link for the game: https://www.nutaku.net/games/lust-goddess/play/",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I honestly stopped playing for the smut and more for the battle, it is addicting but there are times where you either have to wait a while or pay money. I don't like the money part since it's over priced. The fighting is fun though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yal need to bring back the art where the girl is wearing underwear, or lingerie, instead of just minor differences in their clothing. LOL. i bet the guy that did that AI art left because yal paid him too little, or he asked for a raise and didn't get one, so he left. I'm tired of the art where there is basically no difference in what they are wearing after leveling them up.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "fun game, never sure what the outcome of the battle will be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The stragtitys are alright but the fact that you can upgrade as you go it awesom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "игра вкусная реально затягивает я теьща калитку --** респкт 100% W заавозик чиназес швепс iба чотко",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Первые уровни изи, даже можно играть 1 рукой, но потом чет капец как сложно и по этому не могу открыть нового персонажа чтобы играть 1 рукой дальше, сделайте по легче и по больше карточек персов) | The first levels are easy, you can even play with 1 hand, but then it’s just so damn difficult and that’s why I can’t open a new character to play with 1 hand further, make it easier and have more character cards) |",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game was a 10/10 game, guy hot, need hitler, want more",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Gameplay is nothing groundbreaking, but it's fun enough to be a decent little time-waster The bewbs n' stuff makes it funner.  I enjoyed the mechanics and strategy of the fight, and lineups weren't TOO dependent on meta, though there were definitely some fighters you'd have to strategize around more than others. I was totally F2P, and while there were a couple of things I couldn't access without paying (story stuff, skins, some characters that were NOT necessary, etc), none of it was stopping me from playing.  There is definitely MORE THAN PLENTY to buy for those that need to have all the goodies and OP themselves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game oat +rep i goon to this dry... gotta love those amine baddies \n\n¨",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have this game to now only played with not extra to pay.\r\nNow goes it slowly with making progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy the strategy aspect of this game, but have a couple complaints. Upgrading units in the alliance war is ridiculous. I bought a new unit today and upgraded it to level 900.....that means I had to click my mouse 900 times. Finger was a little sore after doing that. Make it so we can push one button for maximum upgrade or choose an amount we want to spend on upgrades. The other complaint is items in the shop are WAAAAAYYYYY tooo EXPENSIVE! I will not pay 100 dollars for a few items when I could just go buy 10 to 20 other games on steam. Lower your prices and people might consider spending a little on the game. I will recommend the game because the strategy is fun, but wouldn't recommend it if you dislike sore fingers from clicking to upgrade units",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good turn-based game... 7/10\r\n\r\nPros:\r\n-The scenes\r\nCons:\r\n-Obviously, you have to open crates that you can pay for to advance more quickly.\r\n-The game becomes very slow after about 50 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game lowkey peak recomend playing it if you have your mum watching lowkey ngl",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay so the game is overall pretty decent - playable for an hour a day and if you like a grindy, daily quest kinda game that has big busty women with killer booties - then this fits. \r\n\r\nPros - The model quality is quite nice and is pleasurable to look at. The content is regularly updated and balanced. New mercenaries and all that are released frequently and there are plenty of quests to do. Alliance system is basic but still enjoyable. There is somewhat of a story-telling system which is still basic but it adds a tender element to the game.\r\n\r\ncons - This game is a pay-to-win game. You cannot actually finish a quest without paying for it (content based and expendable items). You will come to a point in which you literally cannot progress in the levelling system unless you spend money or are just a fkn wizard. EVERYTHING is over-priced so much that even the cheapest items of $5 USD is just a waste of funds. The rewards system is so rigged that it will definitely infuriate you, so you must accept that part (i received the same lowest tier prize 6 times in a row for instance). If you want nice sex scenes then don't bother with these ones, they are very poor in quality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a verry fun game and I like it alot because you war but the soldiers are sexy and my only dislike is that the game is very pay to play and if you dont pay it is verry difficult and you must save lots of recorces to actualy progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I gave this game a thumbs up because it's free, otherwise I wouldn't recommend it. If you like cis female parts and constant menu spam trying to sell you overpriced micro-transactions then you'll enjoy this game. The art isn't bad, the dialog is poor and unimaginative, the actual game you play isn't very interesting, and in one hour of play I only got two scenes. Personally I was looking more at the male than the females sooooo I don't think I will be playing this too much. Females are beautiful, don't get me wrong, I think I just rather be in their position, which this game doesn't really cater to. Hate on me if you like, I just really like a nice D over a squid beak any day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun but very grindy after a few levels",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for passing time as long as your over the age of 18",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "your average pay to win turnbased tabeletop style game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game gave me PSGAD and now i cant stop blowing at work",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "fun game to play if you dont take it too seriously",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a nice turn based games with risqué content!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i cannot purchase anything from the game it got loading and stuck can you help",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hhmmm...okay, seem a little fair for a f2p player 😬",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so much more than the nudity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but it takes a bit of time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game on different account 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love thiis game very much!@",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best experience ever..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great gooner game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun to pass time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this Francois jew",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't feel shy playing LG in a public cafe!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, so satisfying",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it wants ur money if u have no patience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for entertainment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Stay far away from this game Its built for you to spend LOADS of money. The mechanics are amazing and its super fun (I have about 8000 games logged on the web version). Yes despite making a millions every year they havnt figured out how to move my profile to Steam. Im all about paying for in game things to support devs (especially when its free) and ive spent some money here and there for sure, but eventually youll get to a point (around league 12) where you cant progress anymore because for some reason they make characters that take 90% of your health in the first/second round away making it impossible to progress or have a fun time outsmarting your opponent. I dont mind losing to characters that are leveled up more or being outsmarted by someone, but now I cant even enjoy the game because Im dead before I can spawn a character lol. FIX NATASHA! I can deal with some of the other OP characters but why should I have 50 health left before I spawn a character? Do the devs even play this game?",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "A greedy pay to win game with no kind of balance, they don't know how nerf or upgrade charcters neither balance new caracters nor balance PvP battles, you can battle with people on a very higher rank than you, a very lower rank than you (or even can battle with a bot) because you have a certain winnig/losing row, only to frustrate you...",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Garbage customer support. Will delete your alliance after a 2 weeks of non-play, regardless of progress or spending, and will do nothing to compensate your efforts. Asking support for help, they simply spam things like \"Thanks for understanding, its automatic.\" Don't waste your money.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "this is the worst game possible , u only play against AI , and only after your money , dont recomand",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "不推荐，全都是AI生成的，而且压根就没任何所谓的福利，满屏全都是让你花钱、花钱、花钱，我有这钱还不如随便买一部作品都比这个优秀，无论是为了涩涩还是为了游玩，这个都只能算差的了，因此这游戏好奇玩玩可以，但千万别在里面花钱，不然有的是后悔。",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Bad game, first of all pay to win, second of all bans you for no reason even after spending roughly 400 EUR.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not make the same mistake as i did, unless you are rich and dont care about spending money...\nIf you are FTP kinda dude, this game is not for you.\nWaste of time/life and money.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Pay to Win, with outrageously priced \"supporter\" DLC.\nThe game also exists on iOS and Android under the name Lyssa Goddess of Rage (or Love as it goes by nowadays)\n\nThe core design is based on the tale of Sisyphus (aka you push a boulder uphill with zero chance of you winning), and the game is deliberately build on the principle of one step forward, two steps back (unless you pay).\n\nThe art is mostly AI generated (which is what drew me in, in the first place), and some are really good (e.g. Harper and Lucretia), but in the end, the game is too frustrating to continue for me.\n\nDo not bother, save your sanity.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not free to play friendly, the game will plateau you at league 16 if you do not pay into it. Not to mention the incessant pop-ups to pay into the game and the ability to casually drop $1500 in 3-6 clicks. The AI art is also extremely obvious to the point it makes me question is there is an actual artist or if they just pulled generative art and ran with it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you are here for the girls then there is not much of it that you can see without the grind. The combat is uninteresting as well, just put auto on and the game plays it self. There is not really a point to the game because wtf am I suppose to do in this? I can't jerk it and the game is too simple to be anything, I was just mindlessly clicking on where the notice shows up and it got old fast",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "1_boy\n1_girl\nahe_gao\nbig_breasts\nc∪mming \nfemale_penetrated\nfit_female \nfit_male \nhorny \nhorny_female\nmale_penetrating \n…\n…\n…\nwide_hips\n\n[b]ai_generated[/b]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible game. The only reason this game got so many attention is the fact that all other games are WOKE these days and this one has normal characters design. You need to play 27/7 and spend so much money to keep up with game. Honestly its terrible.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lust Goddess has CHANGED my life, it gave me the confidence that women are into me. i went to a medical store the other day as the alpha chad i am to get painkillers and the cashier asked me\n\"is there anything you need?\"-SLUT straight slut. She is devoting herself to me during work hours, she is desperately wanting me for her number and HUGE weiner, because i have a huge sausage and have a lot of sex. i went to a aisle and grabbed kids tylenol by accident and went to the cashier\nshe said \"why do u need kid's tylenol?\"-SLUT! she totally corrected me to get my number and get a gangbang with my AWESOME willie, i wanted to humor her to boost her confidence so i started at her for a solid HOUR. i can tell she was into me, she was attractive so i reach into my pocket and start massaging my fat fat 8 incher (6'3 btw). its bc she lowkey looked like Kitty in lust goddess. tears started welling in her eyes\nshe says \"please dont hurt me\" but she was definetly imagining us having HARDCORE SEX!! \nafter that, i pull out my long schlong and bust ALL OVER her face.\nnow i have court on monday... she just playing hard to get.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i came in my pants just loading the game up 10 out of 10 be back tomorrow but 1 out of 10 need new pants",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good , but i don't recommend it to anyone to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much gambling; no significant balancing; the porn is cheap quality despite them charging up to $500 for a \"boost\". This is a cash grab money sink if ever there was one. I spent $500 on this game and it's not good. Just to compare; that same amount on MTG arena will get you 4 to 5 standard deck. Every load screen is an ad to buy more fake porn, a convoluted currency less transparent than even hearthstone with even less meaning because nothing is fairly balanced; they even let you play testing as they go and use THE PLAYERS as play testers just to satisfy the bare minimum. DON\"T play this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What a horrible mobile PayToPlay (not even win...).\nZero fun, this game was created ONLY to suck money out of your bank account.\nAVOID!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A very stupid parody of the game. Everything creates the appearance of a game, but in reality, you're not playing. You can only win with leveling up or a danat. Losing takes -20 points, but if you deliberately fail, you don't lose any points. Total stupidity.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "All other cheating I couldn't care less about, you just have to accept that hacking is essential if you want to be competitive in modern multiplayer games. But the stalling is just too much. The match clock must be moved to the server, otherwise the game will not be played by anyone soon enough.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Oh, free to play?  Should you try it out?  Absolutely ******* not.  Unbalanced gacha game which never fails to remind you there are people who can dump a literal $50k on the game and therefore win.  Obvious glaring flaws in the battle mechanics.  But hey, at least it has porn lure people in",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sexy game and all but goddamn the combat is absolute shit. Loss after loss just makes it not worth it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pro: gamemechanics are fun , story is hilariously over the top , sexy girls\r\ncon:\r\n\r\n1) toxic monitization , you need to buy packs to be able to finish most events\r\n2) pay to win , if you don't pay for higher mercs, it is is every hard to obtain higher tiers and you get wiped by those that bought them\r\n3) aimed to be addictive\r\n\r\nconclusion:\r\nI keep playing for the gamemechanics and it is addictive but I remain stuck at lvl 18 because I do not want to pay 400€ (and more , yes) for higher tier packs\r\nDO NOT play to win this game or go bankrupt irl\r\n\r\nI get it, free to play needs money , so I bought a low tier pack for extra win-crates (to basic amount is way to low , another example of toxic monitization). But do not expect to play this game on the cheap if you want to win. It is NOT free to play\r\n4)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Shittiest grab money game I ever played (and believe me, I played some). I tried the free version, but you are simply not allowed to win. I bought a golden merc for 5 bucks, I was able to win some matches, but this will not keep too much. When you are winning too many games in a row, the next match will have an opponent much tougher than you will ever be, except if you are buying more from the store.\r\nNice models, but... that's it. Uninstall and never come back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The admins of this game are unfair and ban players without reason. I played honestly and spent my own money, yet they banned me and responded disrespectfully. Be warned — your account could be next!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "To unlock videos is limited and now they are unbalanced it's not fun anymore. I spend so much money to keep up in which I'm out ranked.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT SPEND MONEY!!!!\nYeah, the characters are pretty atractive (if your kink is AI generated characters) and they give motivation to level them to show more skin but, as in all F2P gacha games, the higher you rise through the ranks, the harder and greedier the game gets. \nTrying to play without spending gems will be worse since all the events have objectives were you either have to spend them to advance or use them to roll the gacha machine (and forget about getting new commanders since they will require a crazy amount of gems to get them without spending real cash). \nAt least you can set the matches on auto. You will still have the same chances of winning since even the best team you can have will not be enough to beat an unfair system that matches you with players with high leveled units or broken strategies",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game bugged out and never loaded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just shitty balance. Unplayable.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "use too much to get stronger..waste",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too grindy,  nothing to achieve.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "games broke cant play it any more",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is not good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pure garbage pay to win game. Not worth it at all",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its to inbalanced",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "really bad balance",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont even try. dev can contact me if he want",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cash Grab. Stay away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pay to win, full of whales",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bugs all the time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pay 2 Win, not my bag",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having spent 754 hours in game and nearly as much money. I cannot recommend this game, or the predatory, greedy company that owns it. Yes, the girls look great, and the card game is fun at times. I also enjoyed the collection aspect of the game, but the bottom line is you need to be rich to continue playing and advancing. You will find yourself needing just a few more gems all the time, or some other in game currency and there are many. All of which require you to spend irl money. This game gives you almost nothing for free even if you've already spent hundreds. \n\nNot only that, but they constantly release new mercs and commanders that are initially over powered. This makes you want to buy them to keep up with the meta, but after a few weeks they will release new ones that often directly counter the previous ones, forcing you to constantly spend and retool your squad. They also nerf the previous commanders, mercs, and androids often, just to make your life that much harder. To top it all off you are always playing against the AI and it goes between completely dumb and easy to beat, to completely unbeatable depending on the win loss ratio, aka the win/loss streak. It's probably the worst game I've ever played in terms of milking money from it's players, yet somehow I did enjoy it for much longer than I should have. You've been warned!",
      "voted_up": false,
      "votes_helpful": 94
    },
    {
      "review": "Stay far away from this game Its built for you to spend LOADS of money. The mechanics are amazing and its super fun (I have about 8000 games logged on the web version). Yes despite making a millions every year they havnt figured out how to move my profile to Steam. Im all about paying for in game things to support devs (especially when its free) and ive spent some money here and there for sure, but eventually youll get to a point (around league 12) where you cant progress anymore because for some reason they make characters that take 90% of your health in the first/second round away making it impossible to progress or have a fun time outsmarting your opponent. I dont mind losing to characters that are leveled up more or being outsmarted by someone, but now I cant even enjoy the game because Im dead before I can spawn a character lol. FIX NATASHA! I can deal with some of the other OP characters but why should I have 50 health left before I spawn a character? Do the devs even play this game?",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "This isn't a game, it's a findom simulator.  It starts off as a simple but fun turn based strategy game, but when you hit rank 21 it transforms into a fee to play nightmare.  I would go into vivid detail as to why this is such a miserable game to play, but a lot of the other reviewers have already done me the courtesy.  Don't even give this game the benefit of your time and/or money like I did and just ignore it.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Honestly, the content you're looking for isnt work the frustration of a game designed to farm money out of you, blatantly imbalance the game to limit your league progression, and have frustrating mechanics. One event will allow you to earn points towards all goals on a tree, another will force you to take one action at a time. Oh you opened a chest before that red circle turned white? too bad, better luck next time moron. \r\n\r\nThere are commanders with health and mercs who's levels do not belong to the league. One instance I was facing someone with nearly a 1000 health in league 12???? with the maxed out relationship outfits on his mercs and whos starting attack could almost one shot me. \r\n\r\nThey over inflate the price of purchases and unless you're willing to go out of pocket over and over again moving through the leagues is not worth it. overall.... there is better content (the kind we both know you are looking for) at far less the price.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I would only recommend this game if you plan to spend $500+ per month. Constant addition of characters makes balance impossible and you simply cannot win matches without spending a ton of money to keep up with the onslaught of new game breaking mechanics introduced with these characters.\n\nAlmost every event is a premium event, you have virtually no chance to play and progress for free at any reasonable rate. You will lose a lot. Even if you spend a ton of money, as soon as you don't buy the new characters, you'll start losing immediately.\n\nGame mechanics are broken and pay to win is your only option.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "A greedy pay to win game with no kind of balance, they don't know how nerf or upgrade charcters neither balance new caracters nor balance PvP battles, you can battle with people on a very higher rank than you, a very lower rank than you (or even can battle with a bot) because you have a certain winnig/losing row, only to frustrate you...",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "this game is absolute proof that the developer wants your money and nothing else. when you read the reviews that the game \"cheats\"? believe it! in a 5 round fight i have seen it stack the opponent deck so bad that it deployed the same OP hero 3 times. unless you are willing to either pay thousands or spend an insane amount of time then you wont get far. the visuals are great but if you want more than just a couple? pay up! you do not get much before you hit the pay wall hard! or spend months for very little reward. hidden skills that only the opponent gets? unlimited! hidden skills you get? ZERO! have 500hp on your commander? they pair you with an opponent that has 1000+ i could list so much more but you get the idea, its playable but the time/cash expense is outlandish for almost nothing in return.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Don't waste your time on this game like I did. Literally the only way to advance is spending money. And lots of money at that. Unless you are a millionaire, don't bother",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Bullshit game, all based around spending a lot of money to enjoy. Don't get me  wrong, if you spend a lot of money, awesome. Might as well watch free porn.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Starts as a porno, turns into a shooter game????? This game is a sin...... LMAO Keep your hand off it boys and girls, have a cold shower!",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The game is actually pretty well made and would be really fun save they lean VERY heavily into you spending a lot of money over and over in order to really get anywhere. Would rather just pay for the game up front and play and level up as normal. You take one step forward and two steps back every time you win/lose in this game.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Garbage customer support. Will delete your alliance after a 2 weeks of non-play, regardless of progress or spending, and will do nothing to compensate your efforts. Asking support for help, they simply spam things like \"Thanks for understanding, its automatic.\" Don't waste your money.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "its 100% spenders game and not 5 bucks, like 100s and thousands of dollars especially during events. 3 months grinding and here's what i see: fight pairings intentionally put you against spenders to make it difficult to tier up. rate of purple and orange chests is ridiculously low.  events are difficult and they throw in 2-3 requirement game currency spending to try to sucker you into spending real cash. relationships have gotten consistently worse and they try to sell packages for $500 USD to upgrade relationships to see the adult content which you can literally open a browser and see 100xs more and 10xs better. After 3 months of grinding. 3, maybe a 4 out of 10. good luck gamers.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I want to like this game but there are just so many things working against it. \n\nLet's just get the first one out of the way because you already know. Ai. They are using it and its obvious, Whatever, even if someone is hand drawing the girls Ai is doing the rest. It's what gives girls that plastic and dollish look. I respect that they are trying to be really careful and generate images without flaws. Hell, I want to say most normies won't even catch them. To me it looks off, looks like something trying its best to guess what a human looks and moves like. -2 Grades \n\nSecond, it's a gacha game, this in and of itself is not a bad thing, but the get money from users' tactics at play here are predatory. Let me explain, 17 minutes into the game I was done with the dialogue and non-existent story to which the game already goes. \"So, do you want to spend 100$ to pull for some legendary girls?\" and at this point I'm thinking, Was that it? That's my lot now I can go spend crazy. All I did was pull some girls into squares and now you're asking me for money? Gacha games are supposed to be FLOODED with mechanics that give you a REASON to want to spend money. The only mechanic here is pulling girl into square and spend money to pull more girls into squares. -1 Grade \n\nWhere this game shines and really the only place it shines is that unlike almost every other gacha game in existence. It isn't just trying to blue ball you with its mechanics. Problem is, it isn't the first gacha game to do this, you can find the other if you look hard enough. No pun intended.  It's just probably among the first to use Ai & Gacha together which is net negative imo. +0 Grade\n\nGrade: D- \n\n(polish it, add more content, make it a little less greedy) Please go and take a look at games like, DOA Venus Vacation, Girl Wars, Girls Frontline 2, Isekai Slow Life, you know, PROPER Gacha games, take some notes, implement some of the mechanics, Girls wars has a mechanic that literally lets you pull pieces of the girls clothes off. Stockings, gloves, socks, etc. I would LOVE to see that here. Girls Frontline is an actual game, It's Xcom with girl collecting, it's AMAZING. I want to love this game, but the game itself feels like it does not want me to.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "this is the worst game possible , u only play against AI , and only after your money , dont recomand",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "purchased in game currency & it didnt come to my account 2 hard to contact support ,progrress slow p2wads on spam expensive battle pass .",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bad game, first of all pay to win, second of all bans you for no reason even after spending roughly 400 EUR.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you are here for the girls then there is not much of it that you can see without the grind. The combat is uninteresting as well, just put auto on and the game plays it self. There is not really a point to the game because wtf am I suppose to do in this? I can't jerk it and the game is too simple to be anything, I was just mindlessly clicking on where the notice shows up and it got old fast",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've been playing this game for over a year, I can't believe I wasted 400 euros on this game, I can't get past league 11, even though I have characters that are much better than my opponent and are stronger than him. This game is a money sucker, no matter what characters you have and how strong they are the game cheats, gives more hits, puts shields without having them, etc. I don't recommend this game, it's a waste of time and money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not make the same mistake as i did, unless you are rich and dont care about spending money...\nIf you are FTP kinda dude, this game is not for you.\nWaste of time/life and money.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This tutorial is the most annoying thing I have experienced in months. Forget the NSFW bits for a second. Forget the cash grab. Others have touched on that.\n\nYou have this annoying tutorial that slowly unlocks parts of the game. You get this infuriating hands/fingers that point at stuff and spam you with text explaining them. It refuses to let you just explore and learn. Absolute 0/10 the WORST tutorial in any game I can currently remember. Whoever designed this assumed an IQ of 85 was a solid B. The game would IMMEDIATELY improve if you started on the default screen with zero tutorial.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "不推荐，全都是AI生成的，而且压根就没任何所谓的福利，满屏全都是让你花钱、花钱、花钱，我有这钱还不如随便买一部作品都比这个优秀，无论是为了涩涩还是为了游玩，这个都只能算差的了，因此这游戏好奇玩玩可以，但千万别在里面花钱，不然有的是后悔。",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Pay to Win, with outrageously priced \"supporter\" DLC.\nThe game also exists on iOS and Android under the name Lyssa Goddess of Rage (or Love as it goes by nowadays)\n\nThe core design is based on the tale of Sisyphus (aka you push a boulder uphill with zero chance of you winning), and the game is deliberately build on the principle of one step forward, two steps back (unless you pay).\n\nThe art is mostly AI generated (which is what drew me in, in the first place), and some are really good (e.g. Harper and Lucretia), but in the end, the game is too frustrating to continue for me.\n\nDo not bother, save your sanity.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is trash, played for .4 hours still no pussy. These devs takin all my money and my dick is still dry. No lotion. I requested a refund and still no luck they robbed me off 4,000$ DO not play this game, its bad for business",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not free to play friendly, the game will plateau you at league 16 if you do not pay into it. Not to mention the incessant pop-ups to pay into the game and the ability to casually drop $1500 in 3-6 clicks. The AI art is also extremely obvious to the point it makes me question is there is an actual artist or if they just pulled generative art and ran with it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pay to win game. And even when you spend the $ you can't level up..  Great concept but bad system",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pure pay to win game... fun at the start but the constant push for buying stuff eventually got me to stop playing.\r\nOn a positive note, continuously new content is being released to trigger buying (unfortunately)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too many whales so it is literally pay to win, if you don't have the cash and have just started just uninstall. Not worth the waist of claiming to be adult.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you enjoy playing against pay-to-win weebs and AI with overpowered units to force you to put money in the game, this is the one. If not, avoid like the plague. The game is rigged and created so you will pay to play, stay away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "To my friends if they ever caught me:\nI swear on everyone's souls I didnt play this game because of GOONING!! It has been a while that i mass downloaded +100 games just to test, give it a try and then give a review AND THATS ALL I SWEAR I AM DELETING THIS GAME RN AND I AINT PLAYING IT AGAIN (I HAVE PROOF TOO THAT I AM TESTING GAMES)\n\nnow lets talk about the game:\nThe gameplay reminds me of mobile game ads so i would say i dont recommend people to play this game if u got a powerful PC, there are better games you can play but it is still your decision. the characters look AI made but i would say some of them are cool and I didnt even get the chance to see everyone so like i would say 3 out of 10 characters were pretty. lastly I would give the main reason why I dont recommend this game. the skins or characters or whatever u can buy is NOT WORTH IT AT ALL! they are very expensive and I can be sure any guy who is in heat would def pay for it. this game looks like their main goal is to make horny men buy their skins and stuff. I mean I know the game itself is adult game but it really gave the vibes of wanting money from horny people,\n\nwith due respect, I dont recommend it if youre gonna spend money on this, if you wanna see something explicit then google is free!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is not enough straight forward action. It just wastes your time on points and stupid HOMM fight bs.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "1_boy\n1_girl\nahe_gao\nbig_breasts\nc∪mming \nfemale_penetrated\nfit_female \nfit_male \nhorny \nhorny_female\nmale_penetrating \n…\n…\n…\nwide_hips\n\n[b]ai_generated[/b]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pass.\nIf you've been around enough to know, it's a nukige. That's not going to fly for a lot of folks, myself included. Also, I'm almost certain this is AI art, and that's not working for me either.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible game. The only reason this game got so many attention is the fact that all other games are WOKE these days and this one has normal characters design. You need to play 27/7 and spend so much money to keep up with game. Honestly its terrible.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lust Goddess has CHANGED my life, it gave me the confidence that women are into me. i went to a medical store the other day as the alpha chad i am to get painkillers and the cashier asked me\n\"is there anything you need?\"-SLUT straight slut. She is devoting herself to me during work hours, she is desperately wanting me for her number and HUGE weiner, because i have a huge sausage and have a lot of sex. i went to a aisle and grabbed kids tylenol by accident and went to the cashier\nshe said \"why do u need kid's tylenol?\"-SLUT! she totally corrected me to get my number and get a gangbang with my AWESOME willie, i wanted to humor her to boost her confidence so i started at her for a solid HOUR. i can tell she was into me, she was attractive so i reach into my pocket and start massaging my fat fat 8 incher (6'3 btw). its bc she lowkey looked like Kitty in lust goddess. tears started welling in her eyes\nshe says \"please dont hurt me\" but she was definetly imagining us having HARDCORE SEX!! \nafter that, i pull out my long schlong and bust ALL OVER her face.\nnow i have court on monday... she just playing hard to get.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst game I ever has the misfortune of wasting my time on .pure trash.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i came in my pants just loading the game up 10 out of 10 be back tomorrow but 1 out of 10 need new pants",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good , but i don't recommend it to anyone to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Typical Cyprus-based pay-to-win gambling scam designed around a vicious FOMO-psychology! You won't get anywhere in this game without spending huge amounts of money. Nothing to see here. Move along.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gameplay itself is fun but the underlying concept is so aggressively P2W that it puts even the Vatican's sale of indulgences to shame! Zero balance, and the devs' only focus is on how to extract the maximum amount of money from whales. Stay away from this!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "dont bother it used to at least be ammusing to play but now you just get the hunter commander and put anything in deck dosnt matter and you win 0 effort involved press auto button beat decks way better than yours just with the  hunter commanders passive dont even need to use other skills",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is super unbalanced. AI plays other accounts, and sets itself up to win every time. It can even use power ups, and boosts in first round that are third round boosts. Do not play this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Too much gambling; no significant balancing; the porn is cheap quality despite them charging up to $500 for a \"boost\". This is a cash grab money sink if ever there was one. I spent $500 on this game and it's not good. Just to compare; that same amount on MTG arena will get you 4 to 5 standard deck. Every load screen is an ad to buy more fake porn, a convoluted currency less transparent than even hearthstone with even less meaning because nothing is fairly balanced; they even let you play testing as they go and use THE PLAYERS as play testers just to satisfy the bare minimum. DON\"T play this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What a horrible mobile PayToPlay (not even win...).\nZero fun, this game was created ONLY to suck money out of your bank account.\nAVOID!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A very stupid parody of the game. Everything creates the appearance of a game, but in reality, you're not playing. You can only win with leveling up or a danat. Losing takes -20 points, but if you deliberately fail, you don't lose any points. Total stupidity.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "All other cheating I couldn't care less about, you just have to accept that hacking is essential if you want to be competitive in modern multiplayer games. But the stalling is just too much. The match clock must be moved to the server, otherwise the game will not be played by anyone soon enough.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Oh, free to play?  Should you try it out?  Absolutely not.  Unbalanced gacha game which never fails to remind you there are people who can dump a literal $50k on the game and therefore win.  Obvious glaring flaws in the battle mechanics.  But hey, at least it has porn to lure people in",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sexy game and all but goddamn the combat is absolute shit. Loss after loss just makes it not worth it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT SPEND MONEY!!!!\nYeah, the characters are pretty atractive (if your kink is AI generated characters) and they give motivation to level them to show more skin but, as in all F2P gacha games, the higher you rise through the ranks, the harder and greedier the game gets. \nTrying to play without spending gems will be worse since all the events have objectives were you either have to spend them to advance or use them to roll the gacha machine (and forget about getting new commanders since they will require a crazy amount of gems to get them without spending real cash). \nAt least you can set the matches on auto. You will still have the same chances of winning since even the best team you can have will not be enough to beat an unfair system that matches you with players with high leveled units or broken strategies\nEDIT: And now we are getting a more unstable game that crashes constantly before or after a match starts with no feedback or even acknowledge from the devs...Now I can't even play it as an idle game since I cannot even fill the crate slots to wait for them to unlock...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pro: gamemechanics are fun , story is hilariously over the top , sexy girls\r\ncon:\r\n\r\n1) toxic monitization , you need to buy packs to be able to finish most events\r\n2) pay to win , if you don't pay for higher mercs, it is is every hard to obtain higher tiers and you get wiped by those that bought them\r\n3) aimed to be addictive\r\n\r\nconclusion:\r\nI keep playing for the gamemechanics and it is addictive but I remain stuck at lvl 18 because I do not want to pay 400€ (and more , yes) for higher tier packs\r\nDO NOT play to win this game or go bankrupt irl\r\n\r\nI get it, free to play needs money , so I bought a low tier pack for extra win-crates (to basic amount is way to low , another example of toxic monitization). But do not expect to play this game on the cheap if you want to win. It is NOT free to play\r\n4)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Shittiest grab money game I ever played (and believe me, I played some). I tried the free version, but you are simply not allowed to win. I bought a golden merc for 5 bucks, I was able to win some matches, but this will not keep too much. When you are winning too many games in a row, the next match will have an opponent much tougher than you will ever be, except if you are buying more from the store.\r\nNice models, but... that's it. Uninstall and never come back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The admins of this game are unfair and ban players without reason. I played honestly and spent my own money, yet they banned me and responded disrespectfully. Be warned — your account could be next!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The visuals are nice. The single mode game play could be fun, but it's very unbalanced, which makes it frustrating to play. The auto mode takes way to long and the AI makes very silly mistakes. It has way to much bundles for ridiculous amounts of cash. The alliance feature is simply boring. \nAnother example of a gamble game to lure addicts into opening their bank account.\n\nEdit: I just uninstalled the game. I simply can't manage to progress from lvl 14. The game is just to unbalanced. To much overpowered opponents because of the PayToWin factor. \n\nThey should create games with a monthly membership and focus on gameplay instead of focussing on gambling chance and addiction.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you want to waste money and/or time on a marketplace designed to resemble a game with some adult content that is no better than what the internet offers for free anyway, then this marketplace is for you!! Openly and blatantly pay-to-win, but the system is so BS and simple that buying a Commander (the single greatest influence on wins that you can purchase) will still only get you wins against the basic ones about 20% of the time. 80% of matches are decided by who goes first. That's right!! Even after you spend up to $59.99 on winning you'll still lose 80% of matches to the coin flip. I understand that if you grind hard and long enough (and spend LOTS of money) you can get to the top of the Leaderboard where the power overcomes that influence and shifts it from 80:20 to about 70:30 maybe even 60:40.\r\n\r\nOn top that they still haven't stabilized the basic meta and changed how some of the support even calculates about a week ago and thereby overhauled the meta rendering one of their most recent releases totally obsolete. So, even if you do get the new girl and level her up to keep up with the meta that can all flip on you and blatantly waste your time and money. I'd say give it a couple years to stabilize, but by then it'll be dead and the devs will be pushing the next marketplace.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this has no soul. i love eroge and kusoge because of soul. this is not a real game tbh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You get stuck at this game in a certain level if you don't purchase extra's. The concept of the game is okay, but it is only playable to some extend without spending extra $$$$!\r\nPity you cannot know this upfront when you buy the game, its a rip off.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is a competitive strategy game, but more often than not, you will only face bots. \r\nAnd when you play, you have to work for the sex scenes, somewhat of a drag.\r\nWe need sex scenes after every 1v1.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You will progress in the game when the game thinks you should and better keep paying all the way up, if you want to. Broken mechanics, rigged matches and absolute lack of support from developers, other than how to make payments easier. Better pay and get some other game as a whole. The price for progression is ludicrous even if free to play. I did make a mistake of making a one off purchase to see if it was worth it, so I would know.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}