{
  "positive": [
    {
      "review": "This game gives me the same \"just one more turn\" itch that Civ V used to, except it's not even discrete turns so often I end up wondering how several hours have gone by.",
      "voted_up": true,
      "votes_helpful": 50
    },
    {
      "review": "lol I finally did my first full run of 1) being the top player at end game 2) actually utilising 90% of the mechanics properly in my play through. 3) killing awakened and dormant FE.\n\nFor what its worth - I have like 2 of the DLC - I play vanilla. It is still addictive. Actually, i think if you're new to the game buying all the DLC would be so overwhelming. The idea is to pick and chose DLC over time - I don't even have DLC Titan + class ships and I've got 1000+ hours. \n\nsaying that, game will lag at end year - but come on, that's the meme. Love it, live it. Scrap the robot. Crack the egg.",
      "voted_up": true,
      "votes_helpful": 40
    },
    {
      "review": "The game is really great,\n+ Biggest Sci-Fi RTS i've played (yes even Sins of a Solar empire pales against this giant)\n+ Best support i've seen (ongoing patches, more dlcs, redesigning of game-mechanics)\n+ great mod support, and hundred of mods available\n- engine is quite old (2016 produced) \n- limited multithreading support\n- big/huge maps are huge slowdowns\n- frustrating bugs/behaviours (e.g circling in a fight against enemy fleet and not firing a shot) that are still in the game after 5+ years\n\nRecommendation:\nIf you like SciFi RTS, you should not miss this game\nif you like big sprawling empires, you should definitely buy this game\nIf you like deep research trees, you will like this game\nIf you like modding your game till you're playing a different one, this is it.\nIf you like simple yet deep game mechanics, beware, there is no end to this abyss :D",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "UGH! This game is annoyingly good and addictive. I expected to find it way too complicated (which it is) and hate it (which I don't). There's enough auto-do-the-thing that you don't have to micro manage too much, but sometimes I still want to. I started playing goodie-goodies and will likely play warmongers or something next. There's enough there to make this a game I sink far too many hours into.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I have been saying for years that this is one of my favorite games of all time. Great storytelling, music (Gosh! The music), visual effects, and gameplay. You can't ask for more... but that's in terms of the game. \n\nHowever, it has a big problem: the company behind it, Paradox. Yes, they make great games, but they also charge you a huge amount of money for it, and they also make those games by releasing an unfinished product and then adding tons and tons of content throughout the years. There's no escape. It's probably the game where I have spent the most money on DLC in my entire life, and the reason why I try to avoid games that do the same. It's also the reason why I vowed to myself never to play any other Paradox game in my life.\n\nYes, I understand that the DLC strategy is the reason why they can keep adding new content, but they are just too expensive, and sometimes are not worth the cost. Time and time again, they have added stupid DLCs with only a few images for species, and that's about it. \n\nI recommend the game because I feel like I would be contradicting myself by not doing so while calling it one of my favorite games at the same time, but I would never recommend playing a Paradox game, especially if you are tight on money. By the time I write this, I have fallen behind for 2 years of content, and I would need to spend a lot of money to buy what I'm missing. Play at your own risk.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I’ve got 1,200+ hours in Stellaris, most of it modded, and it absolutely deserves that time. It’s not just a 4X game, it’s a galaxy-scale story generator where every run feels like a different sci-fi series with new ethics, empires, and crises. The modding scene is huge, turning the game into a customizable sandbox with overhauls, new events, ship sets, QoL tools, and deeper mechanics. Late-game performance and micro can be rough, but the sheer replayability, emergent storytelling, and flexibility (especially with mods) make Stellaris one of the few strategy games you can happily sink thousands of hours into.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "i have bought this game from day one and they keep improving it with every iteration. In fact thinking back it barely resembles the game it started out as. just gets deeper and deeper.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Playing as Technocratic Xenophobes\r\nBoxed in by the strongest empire in the galaxy.\r\nBuild Up military and make a planet cracker.\r\nBlow up their capitol and destroy the galactic Economy\r\nSlaves in my empire want rights\r\nAgree, and give our Robot Comrades full citizenship so they can oppress the slaves \r\n10/'10 would commit galactic genocide again",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game has it's pros and cons like any other, but it is a solid game with a solid premise. You have so many options to make an empire of almost any type you could think of.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is one of the best games of its kind and I love it. My only complaint is hardly valid, as I wish they would make a stellaris 2 and stop ubdating this game, since every time they do countless mods vanish forever as their creators stopped playing five years ago. Still awesome, would recomend.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Only game where mass preventive genocide is recommended to reduce late-game lag, marvelous! 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am proud to say that I have not committed any human rights violations in this game.\n\nMy atrocities were not committed against humans.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Totally worth getting into and worth grabbing some DLC. Of exceptional value is the work put into revamping the balance and how the game plays over the years. You can put it down for a wear or more, come back when you grab some older DLC on sale, and then find that you're playing an almost different game because of mechanics updates.\r\n\r\nSome could dislike this, but I love it. The changes are good, and the game evolves well over time. \r\n\r\nNot all DLC are created equal though, so I would look into the details before you dive into any particular one. \r\n\r\nAlso, I'm not a fan of the yearly pass option, but your milage on that may vary if spending money on stuff you can't even \"keep\" is your jam.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Almost 2000 hours, every time is different. Replayability is insane. As ling as they keep making Content ill be back.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Needless to say, this is the best 4X strategy game out there. Honestly, I've never played it competitively and never wanted to, but every hour of my 600-hour roleplaying experience as a space civilization was fantastic.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stellaris is a game where you start exploring space warry of everything that lurks in the endless dark and ends in cracking planets and draining stars of their plasma to power a navy to rule the entire galaxy. 10/10 would form the galactic empire again",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Get trash-talked by a watermelon flesh-eating genocidal empire → gather gather fleet → enslave them → form a Trade League → sell them to my own members as exotic food\n\n10/10, Paradox morality simulator\n\nThen I start the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game with lots of replayability but very high dlc cost.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A worthy successor of the Spirit of Master of Orion 2 just on a much grander Scale. \r\nReally nice and customizable gameplay, awesome 4X Title.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The best and worst things about Stellaris are the frequent updates. It almost feels like a new game at least once a year. The core game elements of exploration, tech development, economic growth, and conquest are all solid. Still waiting for a more developed/satisfying ground combat system, but the space combat and ship customization is great. After three thousand hours plus into the game, it's become my primary relaxation game, the music is great too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I genuinely love this game it scratches a particular itch and continue to return to it after all these years",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you have to pay $180 (current price) in order to be able to experience every feature of a game, then you're getting ripped off. Especially when the game was released 9 years ago.\n\nI can't say I don't recommend the game, but I don't recommend paying $180 for the full experience. It's worth about 1/3 that price.\n\nTurning everything into a DLC instead of incorporating it into the base game is, as others have stated, predatory. And it might be forgivable if the DLCs weren't crap compared to the stuff the modding community makes. The real reason Paradox releases everything separately for the game is to make the modding community work as hard as possible to keep everything compatible. Because the more frequently good mods get abandoned, the easier it is for Paradox to swoop in and incorporate them into DLC without complaint. In the case of Star Trek: Infinite, Paradox even took the Star Trek total conversion modders offline by releasing the total conversion as another game entirely.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "my heart breaks seeing the hate for 4.0 its a shame the bad reviews the game doesnt deserve are pointed to the devs. If you anyone sees this review know stellaris is a great game if not just a little bit buggy right now.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "1500 hours in and I feel like I am just getting out of the tutorial.  This game seems to have the codebase of Google where everything gets rewritten every two years. Can't say that it is a bad thing on its face, as the game is significantly better than it was back when I first started playing over eight years ago.  There were some hiccups along the way, but I am a fan of where this game is today, and how much it has improved.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "do you like seeing galaxies burn and or being the one burning galaxies if so this game plus the nemesis and apocalypse DLC's are for you",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There are tons of games that deal with far-future space stuff, but this is the one that sells the setting the best.  The Stellaris universe is just so fascinating.  The team did a really great job at creating not only an alluring setting, but also made a fun game to go along with it.\n\nThough, ever since EU5 released I'd rather just be playing that instead.  That's not to say that there aren't tons of people for whom this game would be perfect, I just see EU5 as a more ambitious refinement of the mechanics and gameplay of Stellaris (and a number of other Paradox games, of course).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is really a game that can hours go by and you wonder where the time went.  I am by no means good at these types of games but between the different difficulty settings nad ability to pause I can muddle my way through.  I do play on a 4k 65 inch tv and the ui scaling is atrocious.  If you are on 4K or a large screen you will need the UI mod with the ui text mod and I find 2.1 scaling works well in that I can still access all the screens albeit some of the scroll bars dont work well for setting up a new race.\r\n\r\nThe game itself gives you a lot of options on how you want to approach your campaigns.  Be warned there is a lot fo dlcs and some of them you definitely want and if you really like the game probably all of them (minus cosmic storms)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've always like the IDEA of stellaris, but could never get into it. \n4,0+ changes may be controveral for the long term player base, but I final could understand the economy enough to not get stomped before midgame.\nNow I play harder difficalties, and started trying mods too.\n\nBut if there is one feature thats under rated its TTS, being able to have something read the story to you while work has made the game more engaging. (It would be nice if MS Natural voices were usable.)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After playing this game for a couple of hours, I can easily say it’s one of my favourite 4X titles out there. I’ve only actually beaten the game a couple of times (maybe even only once, for the achievement). There’s no definitive story—only what you choose to do. Whether you want to become a genocidal machine hellbent on eradicating all life in the galaxy, or pursue equality for all and befriend everyone (some not entirely by their own choice), you can do it. Sometimes you may die, sometimes you may become slaves to another empire, but every run can be enjoyable in its own unique way.\n\nSome of the DLC adds high‑quality content to the game, allowing for even more customisation and endless replayability. Others offer a bit less (pick them up on sale if you can).\n\nThe game also has a huge variety of mods constantly in development, adding everything from new planet types to new megastructures, all the way to total conversions that turn the base game into something entirely different.\n\nOverall, I would highly recommend purchasing this game, especially if you love 4X strategy games. I would consider it a staple of what a good strategy game can be. That said, late‑game saves can become very laggy for several reasons. It used to be caused by the number of pops across the galaxy; now it’s largely due to the sheer number of ships across all empires. However, the developers are constantly working to improve performance and make the game run as smoothly as possible.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My personal greatest 4X game, i'm such a noob at these games, but hell do i enjoy big numbers and conquering the universe.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stellaris is easily one of the most unique and refreshing strategy games I’ve ever played. There really aren’t many games out there that follow this exact theme—deep space exploration mixed with diplomacy, empire management, and a constantly evolving galaxy that truly feels alive. Every playthrough turns into its own story, and that’s something extremely rare in modern gaming.\n\nI’ve had nothing but fun with this game since I started. Even after dozens of hours, I’m still learning new mechanics, new events, and new ways to build my empire. Stellaris rewards curiosity, experimentation, and long-term planning in a way that never feels repetitive or stale. There’s always another anomaly, another species, another crisis, or another decision that changes everything you thought you knew.\n\nIf you’re looking for a strategy game that stands out, feels truly dynamic, and gives you endless replayability, Stellaris is absolutely worth every minute. Highly recommend. \n\nExtremely unique and hard to find anything like it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a great game with depth and no two rounds feel the same.\r\nIf you have autism (the effective kind), you'll enjoy it very much.^^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is so addictive ... if you like to dive into details and enjoy learning \"how things work\", then this migt be for you. I guess you could play this casually, but that is not how I experience it. I get drawn in and end up spending about as much time paused (trying to figure out how something works - because things are connected, and a choise has ripple effects...) as playing. Maybe an exaggeration, but :) it is nerdy in a good way, I think ... \r\n\r\nIf you are looking for fast paced, adrenalin rushed space action: this is NOT it\r\n\r\nIf you are looking for emersive gameplay and do not mind \"losing\" hours of your life to understand a game: then get this title (it gets even better with DLC)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game will ruin your life! It has cost me countless hours of sleep at night and innumerable hours of productivity during the day.  It takes a little bit of time time really get into and fully understand it.  At 300 hours of play I am almost to a point where I think I know what is going on. But man, those 300 hours have been a blast.  Highly recommend for those who are into 4x games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an amazingly deep space civilization role-play simulator. Despite persistent efforts by the devs to keep the game buggy and saddled with extraneous DLC, I find myself always coming back to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game with a great deal of depth and detail.  Lots of replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "holy shit this game is memed for just being a ton of dots but ITS SO FUN IDK WHY ITS JUST SO FUN I SPENT 30 HOURS IN LIKE 2 DAYS OMG I NEED HELP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic 4X. Steep learning curve but once you get the hang of it it's fantastic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a piece of art. Best paradox soundtrack, great (but sometimes repetitive) gameplay. Only downside is the DLC's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game it’s great for any fan of science fiction and strategy. You build your own empire and conquer the stars,  or you can be peaceful government with strong alliances and trading partners. It also allows you to create your own customize nation: political structure, race personality type, race appearance, etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After all this time, it's still so laggy, it forces me \"clean\" the laggy parts myself. \n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Consistent updates and replay value. Play for 300-500 years and restart when you made a mistake, the cycle continues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for both multi and single player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest games I've ever played, any amount of money spent on it is worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Whats the point defending a galaxy when you can just kill it, purge those inferior organics and go full chrome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing Game, just love it so much , it has so much Replayability and so much to role play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Me when I want to be a galactic hegemon :\n\nAlso get the Nemesis DLC if you want an immersive experience of sabotage and espionage, the base game only locks you to intelligence level accumulation and gather intel missions on envoys. Gathering assets and other spy missions are locked at the base game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy the game. It's a lot of fun, been playing it since it dropped! Or there about.\r\n\r\nGameplay takes a bit to get a handle on, but it's been massively streamlined compared to early version. I do miss the probes, though. Or maybe that was a mod? \r\n\r\nOh, yes. The Mods. So many mods! Don't like one thing, just slap some new mods down to change it. Some decent ones out there. I rather like the Star Wars and 40k mods. \r\n\r\nBut, if there is one thing I'd say is bad about the game? The DLCs. They need a significant price drop. Like, 90% or more for what they provide.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game bit can be a bit buggy at the launch of new DLCs but has great replay-ability with a random galaxy and customizable empires",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the great 4x games, not every update is amazing but the longstanding support certainly is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A stellar 4X real-time (with pausing and speed options available) game packed with a ton of complexities and long term replayability. There is a lot of creatiove freedom, as you can craft your very own species, government types, ethics, etc. Play in many different ways, whether it be enslaving/cleansing the galaxy, heralding an era of community peace, ignoring everyone around you, etc. etc, as there is technically no end game goal besides seeing the rise of your civilization and surviving everything over the years.\n\nIF A PLAYER OWNS DLC AND THEY HOST A MULTIPLAYER GAME, EVERYONE ELSE GETS ACCESS TO SAID DLC IN THAT MATCH. This is one of the greatest things about playing Stellaris with friends, we've been able to enjoy playing together with new/bigger experiences, and not have to buy several copies of the same DLC. Just takes one friend to leech off of, but that's not a problem right?\n\nThe game is constantly updated and the developers do a great job communicating frequently, listening to feedback, and creating more content constantly. They even in the past updated previous DLC that didn't need to be updated, turning them from cosmetic only packs to something that actually adds to gameplay now. The downside is that they create a ton of new DLC to charge for several times a year, so if you're a completionist it will become rapidly expensive over time, though at least it beats paying the same price for cosmetics in other games. \n\nThe DLC technically are not required. You can get hundreds of hours out of the base game, thanks to how replayable the game is. HOWEVER, they do add a lot to the game and they all start piling onto each other to create bigger and better experiences, making you feel like they're required once you've put some time in. Completely new narratives and playstyles open up with various DLC, ex. if you want more interesting mechanics where your robot species can attain independence instead of being a hive mind, you need to pay for it. Want organic ships and a heavier biological focus? Gotta pay for the DLC. Want the equivalent of the death star, or want to play in a way that allows you to become the new Emperor Palpatine? DLC needed too.\n\nThat said, if you're a huge fan of the 4x style and the creative freedom / Role-play opportunities presented in Stellaris, you can get sucked in for hundreds of hours and not mind paying for the DLC to keep the crazy experiences going. Again, just be mindful the costs will add up, but considering how good these developers are compared to other companies, it doesn't feel as bad supporting them compared to paying the same price for cosmetic microtransactions in other games.\n\nThe game is not perfect, they do run into ocassional bugs and issues, with the most glaring one at the time of writing frequent multiplayer desyncs that made the game pretty much unplayable in multiplayer settings. Plus, even if you're not happy with their frequent updates, DLC spam, and more, Stellaris has a huge modding community. So if you ever get bored, there's so many different mods to enhance your experience, including complete conversion mods that turn the game into something else entirely (like a Star Wars mod that changes the entire game where every tech, ship, species, etc. is molded to the SW universe, complete with its own narrative and other stuff). The game naturally has a really nice mod launcher, so taking in mods and instructing friends on what to do is very, very simple.\n\nOverall, Stellaris has a lot more positives going for it, with the only real downside being the astronomical costs if you want to keep upgrading your experience and the multiplayer desyncs, though this is not an issue if you prefer playing single player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very deep and rewarding gameplay, best enjoyed in long evenings without kids",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A unique 4X experience with richness across all pillars. You diplomat your way in cool dynamics between factions. You upgrade your tech tree and space fleet in a variety of ways. You explore and take control of your share of the galaxy. And you research the millenias-old secrets spread across the vast universe.\r\nI like it.\r\nI don't need any DLCs to like it - it is good as it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve always loved science-fiction novels, and this game perfectly fulfills my imagination of space exploration. Most of the time, I’m not focused on expanding my empire or defeating enemies—I’m reading the event texts, visualizing the scenes in my mind, and enjoying the game as if I were reading a novel.\n\nThank you to the developers for creating such an outstanding game, and thanks as well to all the amazing mod creators in the community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is probably the greatest game in its genre by lightyears. It not worth a fifth its total price with all these DLC's. Get your shit together and stop milking people for png portraits. I'm mentally ill so I bought everything, but I'm disgusted with myself and it was with GREAT SHAME. You are actively taking advantage of my illness. I openly endorse buying the base game and finding alternatives to aqcuiring the DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game, and the possibilities are endless with modded games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "傻逼蠢驴能不能从创意工坊找点大佬做的加进游戏里面，别捣鼓你那破平衡性了，你玩的明白吗？还有传统和飞升槽能不能多给几个，以前也就算了毕竟确实没多少，现在越来越多、越来越杂，还抱着你那两只手都不到的数量干啥呢？你那成就是不是也得改一改，新版本有些老成就都不太能完成了。还有达成成就的事件也是，干脆直接和先驱者一样必出现在玩家附近得了，你那脑蛞蝓和时之虫是人类想出来的啊？碰得到吗你？",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game, improves with each update, and so many of the empires can feel so unique in their gameplay. Biggest thing is, don't give up if you're backed into a corner and if you feel on top of the galaxy, keep on playing cus the threats often find a way of shaking things up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stellaris is a good game. \n\nParadox, please come out with another good ship dlc.\n\nur dlcs are mostly mid early dlcs are goated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has evolved dramatically over the past nine years. Core systems like population management and planetary development have been reworked multiple times, and numerous DLCs have steadily expanded the game mechanics. Although the current version only faintly resembles the original release, I still enjoy it immensely. Not every change has been an improvement, but overall the game is in a much better place today. The developers’ willingness to overhaul even fundamental systems makes me excited to see what bold ideas future DLC might introduce.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly this is one of the best games I have ever played. If you like complex strategic games and big space fights this is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is facinating how much time I can keep sinking into this game, no idea how to explain why it is so hypnotising",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spent 100 hours gooning to the starting human lady. 8 hours of gameplay. Not bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stellaris such a fun game love it will always love it, love how you can get lost into it, love the music, love the univers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] Very engaging 4X game [/h1]\n\nI've enjoyed the futuristic aesthetic of the game. While I am a relatively new player, I have heard how much the recent expansions (particularly Machine Age and Biogenesis) have improved the game, and I am inclined to agree with how much they have expanded on older mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, but with some major caveats:\n- The DLC's are quite expensive. **However,** if you plan to play multiplayer, only the host needs to own a DLC for everyone to use. And remember, you don't need to get everything.\n- Without mods, this game has low replayability. **However,** with the right mods, I would say it has the best endgame of any grand strategy to date. My go-to mods are Gigastructural Engineering, ACOT, and UI overhaul dynamic. I would recommend avoiding gameplay mods (gigastructural and ACOT) for your first few playthroughs.\n- Multiplayer desync. It can get annoying, but unlike some other paradox titles, there's the convenient option to just resync everyone without needing to close and reopen your game.\n- Updates can cause instability. **However,** you can lock your game to any version you want using the steam beta system (Game->Properties->Betas and then choose the game version you wanna stay on). I recommend doing this if you're doing a modded playthrough. In the event paradox releases an update that causes bugs in vanilla, this is all you need to do to just revert and keep playing while you wait for them to release fixes.\n\nThere's a lot of criticizm for this game at the time of writing this review, and I think a lot of it is valid. However, I don't think it's serious enough that you should avoid the game because of it. Just start with the base game first, and then buy DLC's slowly, do your research to figure out which ones are worth it to you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, I bought it to play with friends but never got into it myself because of a steep entry curve, after you master some basic concepts you're off to the races and the game does a good job with hand-holding until you do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still a great game to pickup when on sale, made better by modding community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love this game, even with all of it's flaws I still apreciate the effort the devs put into it, for me paradox games are always such a fun time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vast game with deep learning curve. Amazing to learn and play. Hard to master.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, a game with any replay value is special. This game is top tier for this: immersion, creativity and so many surprises despite thousands of hours in game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best 4X Real-Time strategy games, the modding community makes this an infinitely replayable experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stellaris is a game I've played for awhile now. Truly it is the only game of its kind and that makes it extremely enjoyable. Sadly it falls into the same trap as many other Paradox Games. Important content that would equate to over half the game is locked behind DLC. Sure you can play the base-game and enjoy yourself, but many features that feel like they should be within the base game will cost you hundreds of dollars in DLC if not on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's a lot of fun and replay value to this game. It's not the most in-depth strategy game but you can take such a wide range of approaches to building and running your empire.\n\nStill finding new ways to win or lose, and in ironman mode you really feel those decisions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Call me crazy but I have over 2,200hrs playing. Love the game obviously. Infinite replay ability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The latest updates to stellaris have been really nice, I love the new building and district system for planets, though I am still upset about the removal of wormhole drive FTL.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even years later I still love this game well worth the price and guaranteed to give you hours of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun space 4X game. The learning curve is very steep and nigh impossible without watching video tutorials, but it is definately worth it. The systems are very in depth, and you can make your own space fantasy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun addictive game, reccomended, its like hoi4 but in a galaxy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the few games I've played that got me instantly hooked. The amount of DLCs is an issue but if you can get pass that it's probably some of the most fun I've had from a game in a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most Paradox Paradox Game DLC wise, better DLC situation then for example Eu4 or Ck2 was.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderline crack, addicting to a T its one of my best strat games of the genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!  Would recommend new players to play the base game first to understand and learn the base mechanics of the game before playing with any of the DLC's, as every DLC will had new mechanics.  Some add a few but most add a lot, but regardless they make the game much more fun and allow you to play hundreds of games consecutively without getting tired or bored of repetition like most RTS games do.  If you do eventually get bored of the game, the modding community has made thousands if not tens of thousands of different mods to fill that boredom or void of something missing.  all in all its a wonderful game that is still getting updates from the devs, and you should definitely buy this game with your friends so you can eradicate there xeno creatures from time itself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my first game review. I have been playing Stellaris for some time now. I have invested probably way too many hours. But the game is addictive and to this day there are still events and scenarios that play out that I have never seen before. Here is what I think of the game. \n\nThe game keeps bringing me back, Pros;\n1. It is by far the biggest strategy or RTS I’ve played and I keep playing.\n2. There is always a DLC or patch that tries for the most part to make the game better.\n3. Massive Mod community – although I tend to like playing in “Iron man” mode for the achieves.\n4. Beginning of the game / exploring / fighting other empires and expanding is the best.\n5. The RP and random situations of each game keeps pulling me back.\n6. The end and mid game crisis are great. Break up the regular game play and force you to deal with the galaxy at large. There is always something happening.\n7. Developers are very active in the community. Bugs tend to get fixed and they constantly are ensuring the game is balanced. \n8. There are so many different play styles, each with unique features that give you a different experience when playing. \n\nThe in-between (neither Pro or Con, maybe);\n1. The game is massive with a lot of DLC. Great right! But because of the number of DLC getting them all in one go costs way to much.\n2. If you want to try all the DLC there is a subscription option that gives you everything. But I hate subscription models and prefer to own my games. However, if you are new and want to try the game with all the DLC then there is at least an option.  \n\nLove the game but there are some Cons;\n1. The big maps are cool, but when you get to mid/late game there is a slowdown and alot to manage (there are automation features but I’m here to manage a space empire)\n2. Sometime you will come across a bug “in iron man” so no save scumming is available, and that bug will break your game. Sadly having to restart. (this does not happen often but should be mentioned)\n3. The learning curve is massive. You will not know what you are doing to start. I myself had to watch a lot of videos to figure out a lot of the systems in the game.\n4. Game play mechanics change. Patch 4.0 reworked the game and changed a lot of the base mechanics, to the point where it almost feels like a Stellaris 2 Game. (means you have to re-learn again)\n5. Because of all the DLC the game is suffering from a little bit of content bloat. There is a lot happening and a multitude of DLC mechanics to understand. (more videos to watch).\n\nThoughts;\nIf you enjoy games like Civ or other RTS games, you should get this game!\nIf you like to take over the world/galaxy and have other empires serving under you. This game is for you\nIf you enjoy research trees that give you lasers, This game is for you\nIf you wish you could be the end game boss/crisis, guess what. You can and will destroy the galaxy\nif you want to form a galactic republic and work with other empires. You can.\nIf you want to change your republic into the first galactic empire with you as the leader. You can.\nIf you enjoy playing games with mods. (like a whole Star Trek Mod) This game is for you\n\nOver all this game has been fun to play over the years. It can be frustrating at times but honestly, I have had so much fun. I will continue to have fun in the future!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Arguably the best and only game that'll let you see sci-fi in all it's glory through a 4X grand strategy genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "We love the galactic community during the crisis. Many hours poured into this game and many more to come.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest strategy games on steam. The amount of different playstyles are amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grand strategy and space is a great combo. Overall the game is great but most of the content being DLCs is pretty annoying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the best, if not THE best game I have ever played and the onle one where I didn't regret a single € spent on DLCs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I regularly forget the downsides of edicts and then wonder why my economy is collapsing after I scale up. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely my new favorite strategy game. I still suck at it, but it has so much content and so many things to learn that it has become my obsession for quite some time now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a Paradox game so you'll have to sacrifice a limb if you want EVERY expansion but the game is eminently playable is it's base version and I played 150 hours on Game Pass before I bought my copy here and played 125 hours more. I will likely end up getting at  least some of the expansions but they aren't necessary. \n\nHighly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "By far my favorite game of all time! It keeps growing and changing in only the best ways.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☐ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have dipped in and out of this game for several years. afraid of both the complexity and and the massive time dedication to just a single game.\r\nI started the Star Trek: New Horizons mod recently to have some grounding and reference with a know factor in play. I have also used an LLM to greatly increase my orientation not as a step by step, but addendum for checkpoints to my playing and what's happening and how to correct.\r\nIt really has become a digital equivalent to a rubik's cube to solve rather than a game. just, the turns on the metaphorical cube are 1/10th real time XD.\r\nAs a new player this is something will hold my attention for a week probably because I cannot sustain it. Another metaphor comparison: The Lord of the Rings novel series. which I did read, but with heavy concentrated effort.\r\nI can see the appeal, I just wish the Star Trek Infinite game wasn't crushed by the community. I would have enjoyed something a bit scaled down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game I love to load up on a second machine and have all the AI play against each other while I just watch the galaxy burn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For those of you who enjoy the RTS genre this game may be for you if you are interested in something a little more in depth. Sure the battle's aren't Total War. But the diplomacy and the stories you'll create are beautiful. If you love anything Sci-Fi, know this game has something to offer you. One of my favorite parts is being able to leech off friends in MP in terms of their DLC and whatnot. If the host owns all DLC you can use all of their DLC in that match. I do think for newcomers that playing vanilla is a huge suggestion. The game has a massive learning curve and heavy emphasis on Micro Management but once you learn it, there's plenty of fun to be had.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. Find it more fun if you have friends you can play against. The modders make the game fill new to. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Outstanding game to play solo or with friends. Great to replay through. Endless paths through the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GAME IS interesting and fun, would  recommend for people with ambitous desires or star wars fan or just people looking to destory a specie. 10/10 would play for hours and days, i destoryed an entire galaxy and spread the human race all across the galatic world yes",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It makes me so incredibly sad to tick the thumbs down for this game. \n\nFor a long, long time, Stellaris was my favourite 4x of all time. The initial release was shaky but had good bones, bones which were reinforced and built upon with some fantastic updates and DLC over the years. The aesthetic was wonderful, the musical score was wonderful, the sheer detail that has been added to allow customisation of your civilisation is incredible, and the variety of events and crises you could encounter meant no two games ever played the same.\n\nBut we've long since passed the point where the game should have been called done, and any further changes left for a sequel. We're now into the 3rd round of \"patches\" which effectively remake core systems of the game from the ground up in order to make it work with the new DLC they keep adding.\n\nI can't say this is my favourite 4x anymore becuase it isn't even the same game that I bought in 2016 anymore. Nor is it the same game I sunk hundreds of hours into during the sweet spot during late patch 2.0 and early patch 3.0. Now we're well into 4.0 and the game is increasingly bloated, broken, and unrecognisable.\n\nSo many of these massive, sweeping changes to the core game should have been saved for Stellaris 2, but instead it seems that either good intentions have paved the way to hell, or Paradox simply did their thing and pushed for more DLC and more monetisation, as they always do, and turned the game into a live service mess which it was never designed to be.",
      "voted_up": false,
      "votes_helpful": 95
    },
    {
      "review": "The DLC model is extremely predatory, as usual with Paradox games. Often they only add minor things, thus why most DLC reviews are either mixed or negative, the 'better' ones are just too expensive for what they  provide. At this point, there are just so many DLCs that the basegame feels bland and incomplete.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "In short - AVOID !!!!\n\nThis used to be a fantastic game but recent updates have rendered the game so bug-ridden that it is in effect unplayable.\n\nUnfortunately Paradox appear either incapable or disinterested in doing anything about these problems.\n\nFor over two years this was great fun and entirely stable.  Now its just a waste of time.  Save your money.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "TLDR; This is a DLC milking farm, while core problems like end game performance remain a big problem.\n\nParadox seems more focused to pop out new shiny (and expensive) DLC than to fix existing problems and integration of previously added systems(by DLC or Free-patch). Not to mention the balance issues that rise from new systems/units/technologies.\nI honestly think they could succeed fixing most problems if they just focused on those, instead of pushing DLCs.\nThe performance issues in endgame however i think are due to layer over layers of systems added over the years on to a foundation that was not so great to beginn with. So i guess they can not change much in terms of performance without a major rewrite, which would either break depending systems or cost even more dev hours to adapt those systems. Because of that i am sure they will not do that and thus end game performance will remain $hit.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i love stellaris, but at this point the company has degenerated too much, the price tags for the empty DLC's is actually insane and what do they give for those overpriced dlc? nothing they never fix the bugs they never improve the game they somehow allways manage to make it worse and worse. \n420 euros for the entire game actually insane, i bought a lot of them overtime, but for a new player?\nfor example astral planes dlc for 20 euros: you get...??? some copy pasted stories from some reddit?? \nits crazy!\nEVERY update and dlc breaks the game, it takes them a whole year to fix the annoying bugs they introduce because they have to print more dlcs instead of fixing the damn game, its so infuriating we pay them so much money so they can just shit on us these low effort dlcs with nothing new or fixing anything, there are bugs in this game that have been there for years. Every year they promise they will fix performance, and every year they make it worse and worse, its incredible how little effort/time/money they actually spend to try and fix the games problems.\n\ni do like the game,and i dont dislike everythign they are doing to try and improve the game, but its too little, its reached a point where they have so much debt, that they will hve to spend the next 2 years simply fixing all the bugs that have accumulated, fixing the horrendus UI, the terrible micromanagement issues, broken features, unplayable late game lag, impossibly stupid AI, astonishing ammount of bloat content that gives no actual gameplay just extra micro u have to spend, its just soo much they left untouched, or invested minimal effort to address.\n\n420 euros? nah bro more like 40 maybe.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "İ hate paradox for pushing us to buying dlcs instead if adding some of them into the main game...",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Stellaris is probably one of my all-time favorite games, but the 4.0 update has really wrecked the game in many aspects. Not that it was perfect before, but it's really at an all-time low.\n\n- Performance - which was 4.0's main promise - is significantly worse than before.\n- UI is in the gutter: some of the new screens are plain bad, others are bugged.\n- Game is very unstable, prone to crashes, or desyncs in multiplayer, while in my experience it was very stable before.\n- The game is missing many QoL features, UX is very bloated. \n- The AI just plain stops working after enough time passes and entirely relies on cheats for any semblance of competence. This creates an unmissable imbalance between the AI being inexplicably strong early game, and inept late game. You need to carefully engineer your game settings between Difficulty, Scaling Difficulty, Difficulty Adjusted AI Modifiers, and the predicted strenght of your own build to have a decent game.\n- There is major power creep, little balance to speak of, and old content is never brought up to the standard of the latest updates (when are Necrophages getting fixed?)\n\nThese are all well known issues, widely talked about in the community, but Paradox continues to favor releasing new paid content over fixing the game, as they have already ***RELEASED 3 DLCS SINCE 4.0***, leaving a large amount of major issues unaddressed.\n \nThis one might be personal preference but the main practical change of 4.0, the new districts/buildings system, is really not doing it for me. Especially, stacking special building and their modifiers on a planet or two is *fun*. But now with all the buildings you are required to have on any given planets, and with the reduced total slots numbers, you rarely get the ever have more than one or two unique buil\n\nNot 4.0 related but the portraits they've been adding for a couple years now are for the most part rubbish. The only good batch was the Mammals one that came with BioGenesis. I would not mind if there was a way to disable portraits but there isn't, so you have to deal with the galaxy being filled with low quality meat puppets.\n\nLastly, I think a lot of people might not relate to all the issues I have, especially people with fewer hours spent on the game. People will still love the game and play it, as will I, because it is great. But to me it is really saddening that even though the game is supported with patches and paid content, Paradox is somehow not making it objectively better over time. What are we paying money for?",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Game is fantastic if it wasn't for the late game lag. Scamadox will forever rely on modders who actually have love for the game. I sincerely hope these guys go bankrupt or a new management steers them towards a MINIMALLY DECENT company.\n\nFuck these guys.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Predatory DLC model\n\nIt should not cost this much to play a game\n\nParadox can go fuck itself",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's to expensive now for new players. The starter pack can only be considered a trap for those unaware of the ways of paradox.\r\n\r\nIt's a fantastic game, but I can't get anyone to play it because the complete game costs 250$ during a sale. MMOs aren't this bad.\r\n\r\n\"You don't need all the DLC!\" you say in an incredibly annoying voice. \"Shut up, idiot\" is the only reasonable response I can give.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Why should I even bother with DLCs of the game, when you can't play the biggest map the game provides without significant slowdowns of the game - e.g. it can't handle it's own stuff going on on the map in late game. But instead of fixing this issue, putting out new stuff, over a time of 9 years.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I used to love this game and played hundreds of hours in multiplayer with friends. I bough all the DLC while I was actively playing, and thoroughly enjoyed their content and the depth they added to the game. In the last couple of years their quality dropped continually, prices DOUBLED and each came with more and more gamebreaking issues. I tried to get back into the game recently, only to be greeted by over 140€ of new DLC all with horrible review score, a completely broken multiplayer experience that desyncs constantly, even without any mods, and overhauled systems that are now worse than they were before. \n\nIf I could I would get a refund, and I will be extremely cautious buying anything developed or published by paradox ever again, because theyre doing this with every single game they touch. Just look at what they did to Across the Obelisk, a nice little indie deckbuilder roguelite, a 20€ game with 80€ of DLC. The most recent DLC adding about 1/4 the content of the main game... for 20€, the price of the main game.\n\nParadox is the new EA, just stay as far away as you can because their whole business plan is \"sunken cost fallacy\" now.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Game is fun, cool and rich with so many possibilities that with them alone I would recommend the game. \n\nParadox has a stupidly greedy DLC culture, through which they include cool features through major updates but gatekeep the really interesting stuff behind expensive dlc's. Having to spend 400€ for that is outrageous and ultimately the reason I don't really play this game anymore.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Had crazy amount of fun back when there was little amount of DLC's and way less game breaking bugs.\n\nNow they're so focused on DLC's it made this game utter sh*t instead of fixing the bugs that came with the previous DLC.\n\nNot even mentioning the predatory, exploitative behavior Paradox has. All the DLC's is a 10x price mark up from the base game price.. Wish i didn't invest the amount i did. Damn shame.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I have just over 2750 hours in Stellaris, but those were spent in a game that no longer exists. It used to be a fascinating sci-fi RTS with unique gameplay, but it's slowly been homogenised to be more like the other Paradox strategy games. Year after year, DLC by DLC, this game has been warped and changed for the worse.\n\nNow, it's a buggy mess, every new update breaks vital mods, and they've mixed AI-slop into the art and writing.\n\nAll that was good about it is gone. Do not spend the hundreds of euros/dollars you'd need to get the endless list of DLC. Do not invest your time learning gameplay mechanics, because they're going to be changed in the next patch.\n\nDo not buy, do not support this type of development.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Love the game. Always happy to do another crazy wacky run. The only issue is paradox seems to routinely forget about working on optimizing the game. 4.0 still has plenty of bugs. Yet new DLC is released and worsens performance again and again.\n\nLove the game, but would I recommend it to someone new? Not in this state. Not unless they have no doubt they want exactly what Stellaris has to offer and nothing else can satisfy them.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wish Paradox would stop making overpriced DLCs and work on making a new game with these ideas included.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the addition of new feature for the sole pupose of selling more dlc made the core gamplay trash",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "one of my favorites, but multiplayer doesn't work AT ALL (as of version 4.2), it is basically a single player game. And single player experience is full of bugs (something game crashing bugs that make you lose your save).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I haven't played this game in 3 years because they keep adding DLC that breaks mods that made the game good. I don't know if there's 1 piece of DLC where I actually thought it was worth the price. The game I used to enjoy isn't even available anymore because this game keeps changing. The worst part of a live service injected into a singleplayer game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Optimize your game! Improve perfomance! Do it already, it's literally impossible to play. What's sense of new dlc's, mechanics and other \"very important\" stuff if the game is unplayable? Well, the game itself seems good but you just can't play it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stellaris is a great game. However, I can not recommend it as it is too expensive. Right now there is a sale for most DLC and it is still $260 for all the DLC. Stellaris is a very fun and unique game, however it is marketed as a scam and I beg people to not incentivize this behavior by not buying this game or any more DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would love for people to play this game, but the issue is that they destroyed the multiplayer and it has not been fixed for like a year.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is extremely slow to start up and crashes about 4/5 times when I try. When I got into the game it seemed fun, but was very slow so I had to lower the graphics settings which makes it so I have to restart the game and crash a few more times before it starts successfully again. I have a brand new gaming pc with a RTX 5060, which is well above even the maximum recommended specs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is fantastic but Paradox themselves are something of an irritant with the predatory dlc practices and their latest \"22% discount bundle\" for season 9. Lying and cheating with a technicality is not good business ethics, but ya know, ethics and morals be damned with any corpo who needs to run up their shillings for the shill-hoarders (share holders).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Save your money, the early days of Stellaris were the best and you missed the boat. Now it's just a money grabbing eexercise like most of the rest of Paradox's games have become.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game won't launch through steam, which is easily fixable by going into the directory and launching the game directly... which works, except now the game runs like ass when it used to run just fine.  Which honestly kinda sucks I enjoy playing this game when it isn't actively fighting me playing it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is not for this game in particular but for this company in general. They decided to \"relaunch\" a game (surviving mars). Basically making your first purchase worthless. You would have to buy the game AGAIN to play it. This is an absolute outrage!\n\nWhen I email them to try to understand whats going on, I receive a response back that was not only defensive but flat out rude. Since this company wants to make players pay a second time for a game they are now boycotted for many years. This could have been easily avoided by them making surviving mars 2 instead of a \"relaunch\". But they want that money grab so bad. Whoever is running this company should be fired.\n\nI own over a dozen Paradox games and this has angered me to the point I wont even play them anymore. Nor will I buy anything from them in the near future. I am so sure I have asked my account be deleted from their system. Paradox needs to give this community an apology. Until that happens I will not play their games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very fun space age 4x grand strategy game however its slowly being killed by the amount of dlc. Not every update needs $25+ dlc to come with it, the game is fun and explores a lot of fun concepts but its not 40 dollar game, more like 120",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great strategy game, but it has been getting worse and worse since Paradox started to squeeze money out of us by shoving DLCs down our throats and locking some of the game's core mechanics behind them instead of fixing the huge number of bugs they created",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"We employ generative AI technologies during the creation of some assets. Typically this involves the ideation of content and visual reference material. These elements represent a minor component of the overall development.\"\n\n\"Typically\" ...\n\nDon't know if it's worth paying for overpriced DLC or Species Portraits that are potentially generated by AI. Especially when they aren't fixing the heap of problems that previous content has caused, while pumping out new DLC's that create more issues. I think they are clearly being transparent about their priorities (money) and do not deserve player trust.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Others have already described what's wrong with the game in detail in their reviews, but to recap, the game is a buggy mess, the update to make it possible to make the game run faster ended up making the game slower, and Paradox continues to push out the new content, with development effort going mostly there instead of fixing older things. The last three of my playthroughs hit bugs that were reported years ago, and there's no hope of them being fixed any time soon. The last straw was broken planetary automation in 4.0, without it it's basically impossible to manage a big empire and, for me personally, to play the game. Will it ever be fixed? In a few years maybe. A shame.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Loading Screen death screens. Can't get the game to load, stalls and I have to force restart my PC. Only game iv encounterd in almost 10 years thats done this. Super Wild",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My game is broken and i cant open it the updates keep breaking the game and now i cant even play!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TL:DR - Low replayability, it's not a 4x, it's a bad rp game, lategame is tedious, bad tutorial.\r\n\r\nPlease note that most of my hours on this game are leaving it on while I am sleeping or at work, I probably have a few dozen real hours.\r\n\r\nI'm generally a fan of Paradox games, and there are times where I have enjoyed playing this game, but ultimately I can't recommend it. It's definitely not a HORRIBLE game by any measure, but ultimately I don't think it's worth a large amount of your time or money.\r\n\r\nThe main flaws of this game is as follows:\r\n\r\n1. Lack of Replayability - There simply isn't a lot of meaningful variety across different playthroughs. Take the maps for instance. In a game like Civilization 5 you might play on a Pangea map one playthrough, then a small continents playthrough next time, then an archipelago playthrough the match after that. And even if you played the same civ with the same playstyle, the maps would significantly change the feeling of the game. Here, there is some variety in the map, but there is only so much you can do with outer space, so maps never feel signifacntly different in interesting ways.\r\n\r\nThe second part that really hurts replayability is that in typical Paradox fashion it is just a blobbing game. To bring up Civilization 5 again, in that game there isn't only conquest victory. There are also things like a peaceful science victory, or a diplomatic victory. The way you win in this game is by getting a large score, which you do by blobbing. Science and diplomacy can help, but at its core this is still a blobbing game, and each playthrough will largely feel similar due to that.\r\n\r\nThe third part that hurts replayability is the lack of meaningfully different traits. You can make your own custom country where you can say, give them militarism for some extra military bonuses, but it is just a small modifier, and a playthrough where you go spiritualism for a unity bonus doesn't feel that different than going materialism for a robot upkeep bonus. There are SOME traits that spice things up a bit, like fanatic purifier is better at war but can't do diplomacy, or a hivemind doesn't need consumer goods, but these sorts of traits are usually all about REMOVING something from you that you can usually do, so it isn't that interesting or different. There are still some things you can do to spice up your faction when creating them in Stellaris, but at the end of the day I would say you only get maybe 7 good distinct playthroughs or so from that, which is not enough.\r\n\r\n\r\n2. You buy this game thinking it is a 4x game, but really it is a bad roleplaying game - What I mean by that is if there is no replayability, then what is the appeal of the game? A lot of people who like this game like it for the roleplay aspect. Like I can try and make the Covenant from Halo, or I can try and make the humans from Star Trek. But I think this appeal falls flat because the game doesn't give you a lot to roleplay with, you have to make up your context yourself. There are origins which help a bit, but ultimately if I am roleplaying as the covenant from Halo I give myself maybe the spiritual and militarist traits and that is that, just some small passive buffs. The game is not giving you a lot to work with. \r\n\r\nCompare that to Europa Universalis 4. In that game you play as real historical countries, so you can have those existing cultures to give you an expansive context for your roleplaying. For instance if you are playing as America you have all of American culture to help you imagine how the country you are playing is like, instead of just a few traits you can select from a list. And on top of that you have historical or ahistorical goals to enhance your roleplaying. I get much more immersed conquering the Western Hemisphere as the Inca as compared to conquering some space-faring hivemind as the replicators from Stargate. In the latter you blob just to blob, because that is what Stellaris is about.\r\n\r\n3. Lategame is tedious. This is a game where you have to micromanage and it won't be a problem early game, but once you become significantly large and have many planets you will have too much to manage and the entire experience is insufferable. \r\n\r\nThere are some good points as well to the game. It is easy to learn for a Paradox game, although not from the tutorial. The tutorial is trash, you need to look up on forums to learn how to play. The discovery and writing is good. (Although you will quickly run into the same events over and over.) The combat is not as tedious as some other 4x games. You can just doomstack. Bombarding planets from orbit is very pretty and quite the power trip.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "gutted nanites while leaving virtuality untouched - releasing dlcs to pretend to add variety in playstyles, and then nerfing said playstyles so that only one of them stays relevant.\n\nie: machine age dlc, dont get it unless you want to play virtuality. yes it says it adds a bunch of stuff such as other ascensions, but in reality it actually just is virtuality.\n\ngg paradox",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "have not played this for real in years. i differently feel i got something from my $ and the game was good the first few years after release. was new and fresh.. liked it a lot as you can quess from my hours.. but have barely played it the last years.. just turned into a shitshow.. DUDES!! 10 years already.. just make a stellaris 2.. STOP THAT DLC FARMING!!! was a great game.. but keep on piling shit on gold and you end up where this game currently are. the game has essentially not changed. just a lot of expensive useless fluff..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I want to love stellaris so bad, but its just not capable of scratching the itch that the concept gives me. Creating your own alien (or Human) empire is the most fun the game becomes. It all goes downhill from once you start playing the actual game. Planetary Management is a solved problem, and it's the most interesting thing you will be doing in the whole game. Warfare is limited because of the hyperlane system the game uses, turning the game into either sitting on a couple of chokepoints or deathstacking your fleets to obliterate everything. The remainder of the game is clicking through events I've seen 1000 times (in the same campaign). Diplomacy is a non starter as the AI is completely braindead and even more so with the 4.0 patch, as you can outscale the AI almost trivially. The devs keep adding ways to bypass systems of the game, with planet automation and planets surrendering to fleets, avoiding having to land armies, makes the game feel even more empty as you're just sitting doing busywork because nothing interesting happens in the game without the player doing it. Only exception is occasionally a big bad crisis will spawn with a bunch of good fleets, but it doesn't accomplish much because you have had 100s of years to scale so it just becomes a game of whack a mole as you smash fleets. Don't play stellaris. It's really only fun if you pretend you're playing something else.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This use to be my go to and relax game but now its just not fun. My laptop locks up on the load screen at 5 % and i have to hard reset it which is causing a lot of strain on my system. Ever since they dropped 4.0 it has been nothing but problem just a sad stat for such a great game. Dont waste your money the dev have lost their heart for the game it is now all about the money and how fast they can push the next DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game literally will not run on my computer inexplicably, even though its run it successfully many times. The helpdesk employees are stumped and directed me to the bug report forums where the devs are now ignoring me. I love this game but I’m extremely upset with this whole situation and I literally can’t play the game anymore. It crashes every single time it loads to 100% and no amount of clean reinstalling has changed anything. I cannot in good conscience recommend this game when the people who are able to help me aren’t when I’ve spent easily $200+ on this game over the years",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Never giving you people my money again for this game, overtuned was fine as is but then you arbitrarily decided to add negative pop growth to it making an entire incredible part of the game unusable. You ruined robots with synthetic dawn by needless taking away a trait point for them and now this. Utterly unacceptable to break what does not need fixing for the sake of your misguided \"balancing\" fetish.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is kinda ass. Even with all the development effort put into it, it's a mess if you play with all DLCs installed. Some DLCs like the \"Astral planes\" and \"Cosmic storms\" just break the game, really unbalanced features that make your strategies obsolete. And Paradox is just milking the cash cow. It just sucks imho",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Stellaris, at its core, is a solid game, but it is weighed down by an absolute mountain of DLC.\n\nOnly buy this if you're prepared to buy DLC packs easily costing several times more than the base game to get the full experience, and knowing full well more are going to be released going forward.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not worth buying unless your machine is top spec. Could be one if not the greatest game of all time if the performance wasnt so bad. Paradox's only concern is milking the dlc slop drinkers instead of creating stellaris 2. Wait for stellaris 2",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game but do not buy it Paradox is a greedy company that will DLC you to death.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The devs us an aggressively predatory DLC model that attempts to nickel and dime you for every little line of code they add to the game. EVERY mod/addon I have tried for this game from random modders has been way higher quality than any of the officially released DLC. STAY VERY FAR AWAY from anything Paradox if you value your money. If you make the mistake of buying one of their games, I suggest you try adding any mods/addons you can find before wasting your money on official DLC. If this evil approach to monetization changes, I will change this review but do not get your hopes up. If you value your health, spend money on a game that doesn't cost OVER $200 for all of the content.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "What started off as a unique space game turned into a cash cow, charging exuberant fees for small works of changes. Somebody is probably an ex-Bethesda employee. I shall not give into this madness.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've played a couple hundred hours and have had good fun, but now seeing that Paradox is using GenAI developing it, I can't in good conscience keep playing or recommend it.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game, on sale for 50+% off will still cost you over 250 dollars to experience in full  due to the predatory way they handle dlc. Over half their dlc is Mid or Negative to boot. Its sad because the base game was one of my favorite space strats when it came out. But I'm tired of gaming being more about bleeding your wallet dry than the community these days. So I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great game until they got lazy and started using AI, now utter trash.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The automation of planets is really poor meaning that in the late game when you have many planets it's ridiculous trying to micromanage them all. And I had a single planet revolt for some reason which caused a massive deficit in food and bankrupted my entire empire. Just one event on a single planet out of dozens because I couldn't micromanage them all and that bankrupted me and ended my game when everything else was going well. \n\nThe game, despite being a 4X game, deliberately limits your ability to expand and exterminate others. the empire size limit discourages expansion and the 'claim' system means that even when you conquer systems in a war, they'll just return to the original owner after the war unless you've made a claim to it, which costs influence and makes it really hard to annex systems. \n\nI don't know why this game does everything in its power to stop you from having any fun with it. It's like the developers were worried that they were making something that might actually be fun and so deliberately sabotaged their own game to make sure it'd be nice and tedious.\n\nIn the endgame, the AI can manage multiple fleets simultaneously with ease, but a human can't, so you're just trying to play wack-a-mole against multiple enemy fleets while awkwardly juggling your own. \n\nAnd there are 'wormholes' just for extra frustration and tedium. Enemy fleets can just magically appear in your territory through through the 'wormholes'. So your borders are secure but it doesn't matter. The wack-a-mole commences inside your own territory anyway. \n\nAnd there are so many f-ing 'events'. Why are there so many events? I'm just trying to play a game and it keeps automatically pausing and giving me some phukass dialogue box with some lame story that has nothing to do with what I'm doing.I don't care about these lame events. Just stop interrupting the game. \n\nIt's honestly like this game was designed to be as frustrating and tedious as possible.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Well, I really really tried to like this game. I have started several different saves all of which I had to abandon. Now  dont get me wrong, stellaris has some really fun moments like finding the remnants of ancient civilizations, randomly stumbling on new technologies that boost the strength of your ships or helping lost peoples that you can give a home and that might become a powerful ally. But none of that means a thing when you are getting steamrolled by the Ai civs or your resources are drying up and you cant figure out how to fix them. \n\nStellaris feels like a game meant for experienced players of the game that will keep buying the ungodly amount of DLC they keep pumping out for the game rather then new players. \n\nMy biggest frustrations with the game: First off, resources. There are a few base resources your empire need to keep running. Energy credits, which is power for your empire. Minerals, which is mainly used to build things on your planets. Alloys, which is used to build ships, mining stations, claim new territory and more. Food, which is... well food and consumer goods which is pretty much resources for the people of your empire. Now you can gain resources on your planets by building specialty buildings for your people to work at, which seems pretty straightforward. You need food? Build a farming facility. Need more alloys? Build a metallurgy. Right? Wrong. See you also have to worry about population because you need workers to fill the jobs. Dont have a high enough population and the jobs wont be filled, which makes sense. So you may think \"Alright, i`ll just build the buildings I need and let them fill up with workers as they become available. Right? .... Wrong. Here`s one of the most frustrating things i have regularly encountered. If you have a bunch of buildings build wanting workers the population will keep yeeting themselves between the open jobs without settling on one that needs to be filled. Now, you wont notice this early game because you usually have enough pops to fill all the jobs. But come midgame when you inevitably get a resource deficit thats when all hell breaks loose. See, say you have built a large fleet of ships. It requires quite a lot of energy credits to maintain those ships, so you end up in a deficit. Now the workers see you need more people producing energy so they get pulled away from other jobs say, consumer goods production, to go get you out of that deficit. But as soon as they get to the energy credits jobs and you start getting a decent amount, guess what, youre now running out of consumer goods. So, they throw themselves back to that. And thus begins the resource spiral of death that once starts theres no stopping it. You have to maintain the perfect amount of jobs for your population and at no point does the game warn you that you have too many jobs and not enough workers. In fact its very hard to figure out where your workers even are and what theyre doing. Oh yeah and there are districts for planets too which also require workers and give you resources. Which can only make the death loop worse of you dont understand how to use them. \n\nsecond, planet automation. So there is an option to fully automate your planets so they will build the districts and buildings you need and distribute your pops where they need to be automatically. Which sounds awesome and like it would fully fix my first issue. Nope. See from what I could gather planets will only build new buildings\\districts if your are in a big deficit for something. And even then it just seems to refuse to build things at times. Whats worse is that if you make a planet dedicated to something other then one of the main resources, say like a planet dedicated to research, it just wont build anything for it. Plain and simple. Trying to automate all my planets is the most pathetic my civilization has ever been. If you automate youre going at a snails pace. If you dont, your resources are gonna go derp. And to strike a balance of the 2 requires babying your planets to the point the game becomes a chore. Just being able to see or getting warned that you have too many jobs for your population would be amazing. \n\nThird, Ai civ balancing. Yeah doesnt matter if you try to be a full pacifist or full warlord, there will be several Ai empires in your world that will be angry, want to take you over and will completely steamroll you. Unless you play a full pacifist boot licker civ you WILL get steamrolled eventually. And even if you try and go full military mode while you struggle to maintain your two 9K power level fleets over half of the civs around you are able to pump out a dozen 15-20k power level fleets with seemingly no impact on their resources. It`s not fun trying to defend your lands while a full fleet just rolls through you and all you can do is watch your own dinky fleets get massacred. \n\nFourth, war weariness. I hate this mechanic so much. So, say that the big rude dudes start rolling through your lands. But you have fleets *just* strong enough to fight back. While you lose territory and some planets you are able to slowly fight them back. You pump out as many ships as you can and go hold your lines. You lose dozens of ships, but you start to push them back. But thats when you notice a little % indicator with your civs icon over it start to tick up from 1% at the bottom of your screen. See with every system, planet, and ship you lose in a war you gain war weariness. And if it reaches 100%, you will be FORCED to make peace with whoever youre fighting, You dont get a choice. So even if you start fighting back and winning, you will still be forced to make peace if you can get your planets and systems back before it gets to 100% (Yeah its a bit after 100% but not long enough to make much of a difference in my opinion.) Oh yeah and theres no way to lower your war weariness in a war. Once its at 100%, thats it. And even if youre the aggressor and are winning a war yourself you can still lose to war weariness. Its a frustrating and poorly thought out mechanic in my opinion. \n\nI could go on, but I think I made my point so far. I went into this game hoping for a fun galactic adventure. Instead I got bombarded by menus, steamrolled by Ai civs and had my civ doodying itself in every playthrough. Now I know some experienced players are probably reading this and thinking of everything that i`m doing wrong and how to optimally play the game. But that the thing, I`m a newbie player. I dont know how to play the game properly and am trying to learn and gain a love for the game. But it feels like the game is fighting me at every turn and beating me down just when I have something figured out. I`ve had some fun moments with Stellaris, but thats completely drowned out by the constant frustrations ive had with the game. \n\nIf youre an experienced player that knows how the game works and Is diving into each new DLC and loves the game, that`s awesome! Genuinely you should love it. But if youre a new player looking to pick the game up, I could never recommend it to you. There are too many frustrations and confusing aspects of the game in my opinion. I for one dont plan on picking the game up ever again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is my all-time most played game on Steam, but the use of AI to generate content is unacceptable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So after booting up the game with the new Infernals Species pack added my ENTIRE OS crashed. soooo... what's going on fellas? have to say - not a good look",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game was good when it first released, then they released a patch, which made it better, on consoles, unfortunately, the game's most recent rework has however left the game the equivalent of a Civilization 6 subscription, it's probably due to all the DLC they keep releasing, a rework to fit in newer content, however, I very much doubt many people are following the game that intensely so I expect there will be a new game soon, I will stick to getting paid to play games on the android market thanks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this game for a bit 6 years ago and wanted to give it another go now. I started up the base game without any DLC just to get a feeling for the game again. I activated the tutorial but honestly I grew frustrated with Stellaris very quickly.\n\nI'd describe my experience somewhat like:\nImagine being into the seat of the cockpit of a modern plane where you have tons of buttons around you. Everything is blinking and sending you information and the handbook you get just describes about 4 or 5 of them while you just fiddle around with the rest having no idea what any of it actually does but then you're supposed to taxi the plane and fly it to a destination. This is what Stellaris feels like. There's tons of menus, numbers and functionalities. But a lot of it just lacks context about how you're supposed to use it.\n\nThe actual ships are barely visible. I basically just build a couple of science and construction ships and set them to \"automate\" while I get random messages where I have no idea what any of it means. \"press to get 10 unity\" - okay what is unity? I have no idea. The tutorial says \"Press F1 to access the help\" but F1 doesn't do anything. So I just watch some science and construction ships automatically fly around do some stuff while I just wonder how I can get more of that one resource to build a colony ship. At the same time I'm probably supposed to do something else about some alien threat but I don't even understand where or what exactly it is. On the maps nothing is really visible.\n\nAnyway there also is a research tree which is actually three semi random research trees of different types. I'm supposed to select entries there but again everything lacks context. Stellaris feels like a game that expects you to know what you're doing while not really wanting to give you information on any of the stuff in it means. With how it looks and plays I cannot muster enough motivation to look up guide videos and will not hand over additional money to rent the available DLCs. If Paradox thinks this kind of business model works for them - fine. I will not pay 300-400€ for DLCs and I will not hand over 10€ a month to get temporary access to that DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's no reason for Paradox to get this greedy with such a loyal community base. Just release good DLC for what they're worth... Last good Stellaris DLC was Federations in 2020...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After the last patch, the game refuses to start. I haven't gotten a response from the technical assistance.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe I don't get the 4.x update and need to read/watch some tutorials, but I find it much harder to manage my economy than it was in 3.x. Before, I could more easily assign jobs. For example, building an industrial district and moving over specialists would get them to work on it. Managing pops and buildings is much more complicated and I don't get it. The one thing I do like is not having to protect trade routes, but now you also have to manage trade as a resource as if there weren't enough resources to juggle already.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Would be nice to play all the DLC I've purchased for this game but can't get beyond the steam start button",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to love this game, but the amount of crashes make it difficult to enjoy. Panning a map shouldn't break the game, but it does. Zooming out? Game crash. Bathroom break? Game crash. Hold your breath? Game crash. Good luck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game insists on reinventing itself every year or so. If Paradox put half as much effort into their new releases as they do into re-making Stellaris and making more DLC that they sell at the price of a full game, maybe Imperator Rome wouldn't have been such a flop.\n\nWhen there's a subscription option just for one game's DLC, maybe that's a sign you've gone too far.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "scummy patches fucking up with desyncs and bad performance, esp the desync on multiplayer, making it pretty much unplayable, amazing game thumbs up when optimisation and the fuking desync gets better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish I could recommend this game. In my research, there's nothing that quite scratches the itch of playing as a space empire like Stellaris. I might have even come back to it since I wrote this review and enjoyed my time with it, its simply that good on a base level. But the DLC practices are so unbelieveably predatory that they make Space Engineers look like the gold standard. You MUST understand that buying the base game here is only half of the experience. My memory may prove to be my enemy here, because I haven't played since I was last up-to-date with the DLCs (up to Galactic Paragons, if I remember correctly, so my experience might be a touch outdated), but I remember the dozens of hours I sunk into base Stellaris, and while I had a decent bit of fun, it was SO obvious that I was missing DLC. Menus would have a ton of negative space that was obviously filled with expansion content (Federation formation and vassalization menus in particular come to mind). The most egregious instance of this was late into a game where one of the Fallen Empires had awakened and managed to construct a Colossus (an Apocalypse-exclusive feature for players). I was startled and made a post on r/Stellaris about it, to which I received a \"thems the brakes\" type response. I believe I made this discovery in the era after Nemesis came out, so I thought \"Ok, I'll just dump the money on it incrementally. I love this game, might as well pay a bit for the full deal.\" \n\nI proceeded to do so, chipping away at the DLCs until I caught up with all of them. This was shortly after they announced the Custodian Initiative, which is something I LOVED. I still maintain that every game with a long-term lifespan should have a dedicated team to looking at old features to make sure they aren't getting creeped out of usefulness. Paradox really had a master stroke with that decision. I won't engage in hearsay, as its unbecoming of me to do so, but I HAVE heard that the Custodians have been...slacking off, so to speak. Their recent contributions haven't been as effective at their jobs as of late (allegedly).\n\nFast forward to a few months ago, I get the itch to play the game again. It was after a holiday (or my birthday) and I had some gift cards to spend. I went and shoved all of the new DLCs into a cart to see what I was looking at to get back into the game. It was $80. I IMMEDIATELY did a metaphorical heel turn and said \"F*** this, I could be giving this money to a smaller studio who actually needs it\" and purchased a couple games I had been eyeballing for some time. I loved those two games, but I eventually came to yearn for a Stellaris playthrough again. I couldn't bring myself to get up-to-date on the DLCs. Some combination of FOMO and a moral compass prevented me from doing so. I told myself I wouldn't buy Cosmic Storms, which had scathing reviews claiming that the DLC only made the game worse, but I got worried that I would be missing out. After all, I HAD enjoyed Nemesis, and that wasn't very highly praised at the time, so what's to say I was being premature in my judgement?\n\nWhere I'm going with this, this admittedly strange and somewhat subjective anecdote, is the FEELING getting evoked. I WANT to play the game, but I took a break from it for so long that the DLCs piled up. I KNOW how bad it is to play the game with only some of the DLCs, so I declare that I won't play the game without the complete DLC set. I go to buy the rest of the DLCs, see the price (upwards of $100 at this point), realize the amount of money I've sunk into the game/decide that Paradox doesn't deserve this money (it's a coin toss), and forget about it. I've been cycling through this since the beginning of the last paragraph. It's quite a damn shame that it has to be like this. This game is an easy recommend, in another universe, another time, but not this one. I cannot in good conscience recommend a game that is effectively a $40 demo containing a continuously-dwindling portion of the full game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont like this. without dlc its just way to bland and unfun, they should add more things to the base game instead of another dlc, do better paradox.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the base game has become a lovely little plate lacking designed to spoonfeed you dlc through buying or a subscription and who could possibly forget that for years paradox has neglected to fix common bugs or issues as long as the next big dlc comes out... i dont even remember the last time they added something really useful that wasnt just paid dlc being added to the game with a empty skeleton for vanilla leading to the game being broken for however long immediately after almost over and over\ndont get down about it though because once again quarter earnings according to paradox were great but thats fine theyll just keep looking at the short term quarters instead of the long term legacy and when the next game comes out after being worked on as little as possible some of us will remember the cash grab that was shoved out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Paradox:\n1. ruined VTM\n2. has to start releasing finished games\n3. has to stop draining people's money with no-content dlcs.\n\nAs for VTM, just sell the franchise to someone competent, none of that \"on a licence from us\" crap. Cannot believe I am saying this but literally worse than EA.\n\nOtherwise, would be a decent game if all the dlcs content was in base game for the price that its sold at.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its been 6 months since the 4.0 launch. AI still bad, performance still bad, multiplayer still desyncs, and i cannot stress this enough, the AI is terrible. oh and several broken strats still plague PvP i guess. no more DLC purchases until you fix it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can remember right around the time I bought this game, it happend they stole the idea from a mod and released it as an DLC, the synthetic dawn. And the mod was so much better, a little bit cheese/cheaty, but much much better. They took away the free space travel that you could choose as a perk, which I did. \n\nThen at a later point they changed how the planets worked. I found it really cool all the diversity in the bioms etc., but they took it away for some stupid destrict system. All in all, it looks to me like there was never really a concept at all and it shows in other things as well, like the dismall drive to fix already existing bugs, despite releasing DLC after DLC. \n\nBy the way, Paradox killed another beloved series for me, Age of Wonders. So good bye and no buy, cos this DLC grind is just to much...F...U...Paradox...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried to play this game with my friends and when I went to boot it up it loaded to 5% then froze my computer. I was finally able to figure it out by reading the update post but first impressions matter and this was not a good first impression.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes every 5 minutes, but i can't help myself and keep re-loading\\resuming cause i want to crush the galaxy in frustration. Not entirely sure, but think I've got another 100 frustrating hours in still love the aesthetics and mechanics but ... \"ran for 2 game days ESC, save, un-pause ... crash, rinse and repeat over 25 times in just over the last 3 hours...\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, can't really enjoy it right now though because the devs pushed an update they claimed would help performance and instead it made the game 2-3X slower. Mid game now lags as hard as late game used to before the big \"performance\" patch. Unbeleivably unprofessional, how do you not catch that your \"performance enhancing\" patch is making the performance worse? \n\nThe devs are at least currently working on remedies to the situation, but it's been months now with marginal gains. And those have been months where it's just not worth it to play the game I paid money for and was able to enjoy before the 4.0 patch. Easy thumbs down.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i loved this game. And in the beginning kept checking for dlc because i just wanted more..... But... Then came expansion passes and they started grinding out DLC, which would have been fine. If they didnt cost more than most indie games take for their own. I mean Obscure costs 50bucks. \n\"hmmmm pay 60bucks for two-three dlcs or 50bucks for obscure and have cash over for a snack?\"\nThats not really a hard choice\n\nSoooo, fun if you like stellaris, or you like these kind of games. Just know your wallet is in for a ride. And at the moment of writing this. If you want it all, and pay for it. its like 400+ bucks.\n\nWhich stings when alot of these expansions feel more or less like what other companies put in game patches.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This Game can be so much fun. Unfortunately Paradox decided with 4.0 to kill both Multiplayer and Singel Player. If i play with People every 5 Minutes someone Desyncs and if i play Solo i start to crash when playing far enough into the Endgame. Both Issues i did not experience ever in over 300h before 4.0 Update. I realy hope they get their shit together because i really like this Game but atm this is just a very very bad Joke.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't understand how a game can crash as much as this game does.  I Played it along time ago and never had any issues.  But I cant even finish a game anymore.  The constant crashing without using mods or anything is just beyond frustrating.  The loading back in an trying to remember what I was doing before the crash.  The lagging on the larger maps is just another slow painful way to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I do not recommend this game despite having played it for 180h during my subscription. It is obviously playable but I could enjoy any ok 4X game (and most Paradox games) but there are much better 4X games to waste so many hours on.\r\n\r\nThis game promises the complexity for 4D chess but it soon turns out it is just ten parallel games of checkers. Some parts are nice, some parts are boring, and most feel irrelevant if you do not play on high difficulties. The early game is ok, the midgame contains a lot of separate interesting ideas that prevent it from becoming too monotonous, and the late game consists of quite monotonous periods of time which are interrupted by random events that can even be fun to solve. Or level your entire prospering empire within the next few minutes.\r\n\r\nSubscribing to this game with every DLC for three months may not be a huge mistake if you like 4X games. But I would go for buying and playing a different game. Maybe Paradox produces Stellaris 2 at some point using these ideas while finding a way to combine them into one complex game. That might be worthwhile.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good luck booting up the game even, 9/10 times (on windows at least) it's going to freeze your system, and on top of that the DLCs are a joke, if you don't have someone to play with that has all the DLCs and want to play single player only be prepared to open your wallet and let them extort you.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Maybe I had the wrong expectations.\r\n\r\nI like Crusader Kings because it allows me to roleplay my own story in each playthrough. I find this easy in CK because the events and various systems will naturally push the story in certain directions, which in turn influences my short/long term goals. The juxtaposition between my own wild story and the historical backdrop is often funny on its own.\r\n\r\nIn Stellaris it seems it's up to me to create the story myself as I go along. The events don't really change the way I view the galaxy or the species within it. I'm expected to set my own goals, and those goals aren't going to shift/change in unexpected ways because it's all up to me. This goes against many reviews I've read that say the best part of Stellaris is the unique story of each playthrough.\r\n \r\nWith CK I put in the work to learn the large number of systems and complicated interfaces, and it paid off because the game understands its greatest strength is the RP and the gameplay facilitates that. Stellaris feels more like Civilization in space, where you simply grow your territory, research tech, and eventually conquer everyone else. In that sense it's not bad, but it's not what I want from a big Paradox strategy game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, it's honestly an amazing concept and worth the base game price. That said, the DLC add features to the game that could be fun, but to be honest, a lot of these features should be in the base game. It's not worth it if you're looking for a fully featured playthrough if you watched others play it. You'll spend so much money on the DLC. They should either make the base game itself free, or bring down the price of DLC and incorporate some features that are clearly better in the base game instead. Money hungry company but good game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like playing this game, but that time could have been spent doing something much more productive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No diversity in builds. Each patch there is on or two OP builds and you either play one of them or get annihilated by them as soon as peacetimer ends. Everyone who says it is a grand strategy game is lying - it is just some roleplay game with strategy elements.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "There is a better chance of Stellaris 2 release then optimiztion update for this one",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "sorry just too much to learn for someone with limited time to play, its too deep, I lost on easy a few times, I had maximum fleet strength of around 30k, and someone with 445k just swarms in around 100 years in, happens every time, I cant do this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Menuslop. 80 percent of the game is locked behind DLCs. Just everything about this game was miserable to me I dont get the hype",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good concept for a game, has a ton of content, but it is currently a bit broken - really bad late game performance (I have a decent PC but the frame rate gets uncomfortably low and it starts to lag if there are a lot of ships in the galaxy.) Until they figure out how to fix that, I can't recommend it in good conscience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant say if the game is bad, BECAUSE I CANT PLAY IT, i bought it about a year or 2 ago and it openned and ran fine, i just didnt want to learn it and refunded it, and now, i bought it again, FOR 70 DOLLARS!, and it can barely open, and it cant i havent even been able to play the actual game. DO NOT BUY!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was once one of my favorite games, but modern edits to the UI and controls have made it virtually unplayable. If/when I can revert right click to dragging the map around, and middle click to changing the camera angle it'll jump up to a solid 4/5 (arguably 4.5/5), but until then it's basically a 2/5 and not worth the time or effort to get into.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do not give Paradox money, they are parasitic.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just an overall disappointment. All of the paradox crap without a cherry on top. The combat is extremely bad, the diplomacy is bad, the AI is extremely predictable and thus bad, the content level is bad even by paradox standards.and I feel absolutely no desire to purchase dlc in the hope of maybe making it less bad.Unless you've just got a thing for space strategy there just isn't anything to be had here and even if you are the 4x or sin's games do significantly more for significantly less.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "after the infernals update, I cannot even launch the game as my whole computer hangs. I uninstalled/reinstalled, deleted all files manually, validated files. updated drivers and more, no change... really wish they would take a break from adding content to fix the spaghetti they have...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "New patch crash the game at 5% adding new problems for paradox launcher. Please fix.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a good game and they make you play with your eyes CLOSED.\r\n\r\nEven with all this DLC money they are not able to fix the UI and controls.\r\n- Just moving a unit is painful, selecting it is painful, selecting where to go and what to do is painful.\r\n- One billion things happening and they show you a bunch of little stories and expect you to read it all.\r\n- Building structures is painful for the eyes trying to read the minuscule letters.\r\n- Understanding what is idle and whats not its just a small list that you have to SCROLL and then you do not know what to do with it because nothing shows the available things there is to do. You have to manually click every star in the galaxy to find out.\r\n\r\nYou never really have fun with this game, you are just trying to go to the next step, 3 hours in this game and not once I had a moment I thought I was making any progress or any cool stuff happened. There are better games and this is not worth the time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Won't launch even with the suggested community fixes. Frooze my whole system though the first time. They have been aware of the problem for quite some time now",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played too much of this game. It was to hang out with friends. I tried it solo and I enjoyed the events the most, but the game itself is not for me.\n\nPlay meta or lose, bad game. Buy 300$ of dlc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great concept, Shit execution. even on the easiest difficulty the game punishes you at every turn. winning an early war dont worry they will hire raiders with 10k+ fleets to stomp your early game 3-6k fleets. then take half your systems with their own 6k fleet, then the game will force you to surrender as soon as you rebuild your fleet to counter this.  not one bit of this game isnt for hardcore virgin lifeless losers. what is the point of difficulty if all it does is slightly effect resources..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "+ Good graphics/menus. \n- Stellaris logistics are completely underdeveloped. Ships fly eternally and wherever they want, ignoring basic sci-fi laws.  No civilian ships. No fuel ships. At least Distant Worlds 2 has fuel and range limits.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Didn't have the required amount of autism necessary to enjoy the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dear Paradox Publishing. F off. You keep forcing the studio to release DLC after DLC when the base game is currently BROKEN. I can't, in good conscience, leave a positive review here. I normally don't even write reviews, but I am so thoroughly disgusted by the blatant GREED on display here.\n\nMultiplayer has massive problems with de-sync. Economies stall. AI is terrible. The lag is horrendous on anything other than Small or Medium maps with more than 10 AI factions in the mid-late game. GET IT TOGETHER. STOP RELEASING CONTENT AND FIX THE BASE GAME.\n\nF your quarterly earnings reports for a few cycles and allow the studio to FIX THE GAME. Did you guys even do any QA for Infernals? The damn DLC prevents the game from even LOADING for a ton of players.\n\nI will not be buying ANY further DLC until Paradox prioritizes letting the devs fix the base product instead of pushing out more paid corpo-slop. I don't care if you use AI for assets if they are good. But they aren't good. All the new portrait assets in Infernals are unoriginal and many are just tweaked Lithoid portraits. LAZY! Half the civics don't work, adding to the already numerous base game broken civis you never fixed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The tutorial is somehow tells you what every thing does but fails to tell you how to do anything. Too complicated for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just like Victoria 3, Stellaris will more often than occasionally hard-lock the entire system requiring a manual restart of the system upon game load (on windows 11). Again, just like Victoria 3, this issue has been around for at the very least since mid-2024, has had very little acknowledgement from Paradox, and has zero fixes.\n\nI'm sure just like my Victoria 3 review some Paradox employee will respond saying something like \"well actually this isn't a problem because here's a fix that doesn't actually fix the problem\", but i figured i'd still put it out there.\n\nIt's not as bad as Victoria 3s crashing. *sometimes* the game will boot normally, but about 50-60% of the time, it's hitting 5% on load and then locking up the whole system. I've tried every fix on their forums none have worked.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}