{
  "positive": [
    {
      "review": "Really fun game to play with your close friends! If playing with randoms, might not be as fun (the humor lies in the banter with ya homies as you shoot em)",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Great fun, super creative, beautiful execution. Already excited to dive back in.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "A nice and simple russian roulette game with an interesting twist. It's a fun and short experience - also great with friends. Attempting to get all the achievements might end you up in a mental institute. Definitely check it out. I also recommend Mike Klubnika's other games from itch.io as well.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Part of the Indie Fears Bundle.\n\nBeat it in about 40 minutes. There's online multiplayer but this really isn't much more than Rock Paper Scissors with a nice (a really nice) coat of paint. I really like this new era of PS1 horror.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "⭐️⭐️⭐️\n\n[h3]Super straight forward and fun to play[/h3]\n\nLoved playing the game when it first released. \nHaven't really gone back to it much, but nonetheless the game concept is still really good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Solid game for the price. Even better if you have friends to play with.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly thought I wouldn’t enjoy this from the vids/streams I saw, but it’s great.\nThough getting some achievements was kinda frustrating, since the item RNG can really screw you over, and the dealer sometimes just BMs you and starts taking like four items in a row (and u cannot speed up those animations.).\n\nBut overrall the game is super fun and the art style fits perfectly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After spending 30+ hrs with Andy & Leyley, shooting myself into throat, hoping that blank shot would be chambered is something perfect. S Tier game, would recommend further to anyone! 11/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "GEMBLING GOES BRRRRRRRR. Lost too many times, but highly recommended\r\n\r\nBonus point: We can drink beer and smoke cigs in this game too. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I swear that this game has a 50/50 chance of either doubling the number of brain cells you have, or cutting them in half. LETS GO GAMBLING!!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A chaotic twist on Russian roulette, but with a shotgun and a ton of dark humor. The new multiplayer update makes it even more unpredictable and hilarious, especially with friends. Between the bluffing, item use, and tense moments, every round feels different. Simple, cheap, and surprisingly addictive. Definitely a must-try indie party game.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Absolutely Genius !!!! 20/20\n\nNice OST, simple mechanic but very addictive !\n\nOnline gaming is hella funny, most Rage quitting xD\n\nPlay smart or die, as simple as that =)\n\nps: If the host leave the game, you return to the lobby :/ that's my only negative point...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Safe to say, my friends minds are blown from this game after we started playing multiplayer",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing and iconic experience, but lacks depth past a few runs and multiplayer system is weak.\n\nIs fun as a couch game to have on the tv while getting high and losing concentration :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stress-test your friendships with this one simple game!\n\nJokes aside, Buckshot roulette is a very well designed multiplayer game with a great aesthetic. I definitely would recommend it, especially since it's only a few dollars.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's good for a few playthroughs, but that's about it. Worth it if tied to a bundle, but not worth a solitary purchase (even if discounted).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, would love it to be more immersive especially when you turn the [REDACTED] towards yourself, but I guess it's a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a 10hours-player, I strongly suggest that the game can have more modes and contents such as different guns or gun skins, which can be purchased with money after you won, to make the game not gonna be boring so soon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great horror/high stakes game. Makes you feel like a legend when you hit on a 50/50",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buy it. It's dirt cheap. It's very fun. It has an endless mode and multiplayer to boot. Just do it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEER!!! This game makes alcoholism sound like a net win for the world. pop a cold one and there is one less risk. LoL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buckshot Roulette stands out with its gritty aesthetic and tense, straightforward loop. It’s simple on the surface, but the small bits of background lore give it a sharper edge. Every round demands attention, and that constant awareness makes the experience surprisingly gripping. A lean, atmospheric game that delivers exactly what it promises.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not much game content but not too expensive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, super fun with friends and by yourself. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Небольшая игра, вдохновленная Inscryption. Визуальный стиль и безумная криповая атмосфера затягивают с главного меню, а весь контент игры можно увидеть за час с небольшим\r\nТеперь коллаб данного разработчика с Дэниэлом Муллинсом стал очередной моей влажной мечтой\r\nКак короткий, но интересный игровой опыт точно стоит своих денег",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game on Roblox and bought it on Steam, its a fun game so i'd recommend it for sure for who's looking into reviews",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gambling fun with the Dealer. Took me a couple months to get all of the Steam Achievements but it was worth the grind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ja mam naprawde duże szczęście w tej grze XD \r\nznaczy gra jest naprawde dobra polecam\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. The uncertainty of the gameplay loop is very engaging. The multiplayer mode is also very fun and works very well. I like how there is no chat or anything, just playing against players. The visual and sound design also add to the game's atmosphere.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got this for the multiplayer, which is hilarious with the right group of friends.  Single player is fun too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the vibes. That's pretty much all this game's made of, but that's not a bad thing. It has fun and simple gameplay that gets your brain going, and they added multiplayer so I can shoot my lovely friends. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a simple yet deceivingly hard numbers game\r\nbanging, yet somber soundtrack\r\namazing harnessing of the PSX style\r\nalways keeps me coming back\r\n9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice, fun, and cheap game. The only complaint I have is that the 2 health rounds can be very unfair to play in, which makes getting some achievements annoying, but other then that this game is just a good time. I have yet to play the multiplayer, but I imagine it is a great time with friends. Definitely worth the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far as short fun games are concerned, this is the best for me. If I ain't in the mood for a more competitive or difficult game, this is my go to. Games are short, luck + some skill based, and full of vibes. This is not a highly complex, play for 5 hours a day game, this is a short 15 minute poker game after work kinda game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun game to mess around with friends. Isn't a game I'd play for hours and hours though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like gambling games where you have to use your brain this is the game for you, my only problem with this game is sometimes you can't do anything about taking damage or dying, But if you are careful and stay calm you should be able to win most the time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "- DIFFICULTY -\r\n\r\n🔲 My 90 year old grandma could play it\r\n☑️ Easy\r\n🔲 Normal\r\n🔲 Hard\r\n🔲 \"Dark Souls\"\r\n\r\n- GRAPHICS -\r\n\r\n🔲 \"MS Paint\"\r\n🔲 Bad\r\n🔲 Meh\r\n☑️ Graphics don't matter in this game\r\n🔲 Good\r\n🔲 Beautiful\r\n🔲 Masterpiece\r\n\r\n- MUSIC -\r\n\r\n🔲 Bad\r\n🔲 Not special\r\n🔲 Good\r\n☑️ Beautiful\r\n\r\n- STORY -\r\n\r\n🔲 This game has no story\r\n☑️ Like playing \"Temple Runners\" for the story\r\n🔲 It's there for the people who want it\r\n🔲 Well written\r\n🔲 Epic story\r\n\r\n- PRICE -\r\n\r\n🔲 Underpriced\r\n🔲 Perfect price\r\n☑️ Could be cheaper\r\n🔲 Overpriced\r\n🔲 Complete waste of money\r\n\r\n- REQUIREMENTS -\r\n\r\n☑️ You can run it on a microwave\r\n🔲 Average\r\n🔲 High end\r\n🔲 \"NASA\" computer\r\n\r\n- LENGTH -\r\n\r\n☑️ Very short (0 - 3 hours)\r\n🔲 Short (3 - 15 hours)\r\n🔲 Average (15 - 50 hours)\r\n🔲 Long (50 - 90 hours)\r\n🔲 Extremely long (90 - 110 hours)\r\n🔲 No ending\r\n\r\n- FUN -\r\n\r\n🔲 I'd rather watch paint dry\r\n🔲 Hard to enjoy\r\n☑️ Repetitive\r\n🔲 Actually pretty amusing\r\n🔲 Ride of your life\r\n\r\n- REPLAYABILITY -\r\n\r\n🔲 It's a one - time experience\r\n☑️ Only for achievements\r\n🔲 If you wait a few months / years\r\n🔲 Definitely\r\n🔲 Infinitely replayable\r\n\r\n- WORTH BUYING -\r\n\r\n🔲 No\r\n☑️ Wait for sale\r\n🔲 Yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely an interesting game, both in game play but as in the potential story. I like how it makes you question why your here and why you agreed to play. Is this hell...? and it's the only option left is to keep playing till the end...? I don't know but left me wondering about stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun to play with friends but the flash, when you get shot, hurts my eyes so I have to close my eyes when  my friends have the gun cuz it's a 50/50 chance with those tools, haha.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like using this game to improve my memory skills and understanding of chance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very simple yet engaging game. The atmosphere and the art direction are great, personally I didn't expect the music to also be good but it really is. Especially great when playing with a group of friends, very fun and can give you a lot of funny moments",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy when i shoot myself and the bullet doesn't shoot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was so good for me, it is really cool and keeps you on your toes. W game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean it's good but I'd rather play backshot roulette personally.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it takes a lot of brain to do this, but its cooool. (I didint get to experience the multiplayer mode cause...well...ill let you think why.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was pleasantly surprised by this. It's a short form card game essentially, but it has immaculate vibes throughout. I was on the edge of my seat the whole first playthrough.\nTry to go in blind for the best experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "On weekends when I have nothing better to do I play double or nothing mode and take a shot of vodka every time i use the beer can in the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The way the music and the game pairs together, makes this game way more immersive and intense than most AAA stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I especially bought this because the protagonist can chug beers like it's nothing and I totally relate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is really fun, If i was able to skip animations in single player it would make me want to play this a whole lot more and for longer each session.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing this game really opened my mind. \r\n..\r\nIt's a real brain blast. \r\n... \r\nYeah I'm coming up with blanks for the rest of these jokes. \r\n.... \r\nI'd rather play this game irl than do standup comedy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my throat still burns from throwing up alcohol and i feel hung over, my steam hours is padded by ~4 hours\n\nwas fun though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Getting shot in the face has never been more fun.\n\nSeriously, though, this game is a bit addictive. I blinked and three hours of my life passed me by.\n\nProceed with caution.\n\nEdit: I've been playing this stupid game nonstop. Send help.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a bad game to play, enjoy with friends and just hope u manage to win with either good items or good luck. \n\nEither way its just fun for like the first 3 rounds and yeah you're all good for the day XD\n\nfor its price I think it is worth it \n\n7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a really good game. Even better if you have friends to play with but you can do just fine without them as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun way to pass the time. Great art style, fun gameplay, can't go wrong",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun, and the multiplayer function is very competitive. What I don't like is that you can't strategize by memorizing the order, because it doesn't exist in multiplayer. But playing with other people isn't my priority in this game, so i couldn't care more about that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good for what it is, a short, sweet and simple experience, the multiplayers fun to play with a couple of friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just drugged myself and now I am in a life or death Russian Roulete game. Average tuesday for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "İts pretty fun and entertaining, especially with friends. Definetly the best take on the russian roullete game.\n\n8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THis game is fun ive always wanted to drink the koolaid for money and this game makes that fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buckshot Roulette turns a simple gamble into a tense, fast-paced mind game. Its shotgun mechanic raises the stakes and keeps every decision suspenseful. Players balance luck with strategic item use to influence the outcome. The dark, club-like atmosphere adds constant pressure. Quick rounds make it highly playable without feeling repetitive. Chance plays a major role, but smart choices still matter. Overall, it’s a small game with sharp design and lasting impact.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game, however the last achievement full house is too difficult",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game does what is promised in the title, can't complain. Your enjoyment will depend on your ability to count and memorize shells and of course pure luck/RNG. I suspect the bastard dealer cheats in Double or Nothing mode but whatever. Also, I wish the dialogue can be manually skipped and you could just directly go to the dealer after exiting the bathroom.\n= 7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a really fun game with interesting mechanics, a fun style, and is just a fun game to play. Also the achievements are really fun to unlock.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game. It's pretty fun!\nI do think that adding a classic Russian Roulette gamemode would be a pretty neat addition though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "went to play with friends\nat the end of the game i returned with no friends :(\n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game great gameplay very hard and multiplayer is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i shot myself on the first round, i drank beer and smoked cigarrets 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gambling and winning is fun\r\ngambling and losing is not fun\r\n\r\nsince I always win the game is fun, if I ever lost I would simply not play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "É um jogo bastante divertido e interessante, mas a campanha é bem curta.  O multiplayer é ótimo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For just some pocket change you can buy one of the best indie games on steam, honestly i can't think of a single flaw this game has. I don't throw this word around often but i would call this a perfect game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great little game. The items are interesting, the animations are tight. There isn't much content but what is there is for sure worth a few bucks. There are some minor usability issues like not beign able to review how many rounds there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Something about this game speaks to me and i can't put my finger on it. Maybe it's the banger rave music.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sort of fun but extremely short and not very difficult. Try and get it in a bundle with a much better game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"My wife said it was either HER or the casino!!\"\r\n\r\nNeither were real, I was just tweaking off the fent before running into this room with a small table and a gun on it...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game  banger where you can take xans/percs ,drink beer and smoke cigs  for free, even it  lets you abuse adrenaline and  you do all this while gambling  casinos  should make this in  irl fr feeling like young  cobain while playing  this game 10/10 its only  3 euros like man those ciggies and beer cost 3x more than this masterpiece i hope i will beat that british dealer and will have 100% on this banger  thats it  folks stop watching porn be man do some drugs and gamble like real man if shit goes down theres always 12gauge waiting for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is definitely a vibes game, extremely short and simple. There’s a bit of strategy involved in how you use the items given, but I was able to beat it in one run (which took about 30 minutes). I suppose you could do the “double or nothing” run, but it didn’t seem there was much incentive unless you just wanted more. All that said, the atmosphere is immaculate, and there’s really nothing to fault the gameplay. What it does, it does well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Did you know there's a short movie related to this game on YT? \n\nLook it up, it's worth it same as the game itself :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing Russian roulette with a creepy guy in a mask who somehow out-gambled GOD for money is a crazy concept that delivered in full. Not only is it very cheap, but it is addictive to see how high you can get with your cash prize before getting shot in the face after taking questionable meds with a few energy drinks on the side. There is also multiplayer which really ups the feeling of trying to play mindgames with people before screwing someone over. It is a very fun game and worth it if you just want to play a game where you have an excuse to shoot someone without playing an FPS.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible concept. Russian roulette meets horror with perfect tension and style — short but unforgettable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazingly replayable with an awesome aesthetic and a mysterious yet grim tone to match. Very good at being immersive with its sound design, and the gameplay makes it feel like if you know what you're doing you can negate the game of chance or play it to be absolutely in your favor. The items shake the game up almost every time they pop up, and playing around what the Dealer has is such a fun experience. It's not too difficult to catch on and play for a good while, even if you happen to have memory issues! A great time all around.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great small experience with an ARG packed on top of it. It even has a multiplayer gamemode, and it's cheap, so it's a perfect game to buy with the gang. My only critique is it is fairly shallow and sometimes you can just die without having the chance to do anything about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for its cheap price, i dont see a point in replaying more than 5 times if your an incel with no friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is absolutely Hilarious when you play with 2-3 friends and for all of 3.89CAD it is an absolute blast (Pun Intended)\n8.9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and intense and less bored but Multiplayer need to update like no shooting at the same person per round that will be fair but anyway good game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "yes very good game alot of suicidal by shotgun aimed at myself",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mad fun with friends. aesthetic of the game is cool, the gameplay is interesting, and they keep it simple. worth the $3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think its a game concept that's fun and works for its very short runtime, but is way more hype to watch streamers play or play with others rather than gamble against the computer. You have strategies you can employ, but there is almost always a mathematically optimal choice, and oftentimes one that is pretty easy to see. Without the motivation to go for something gutsy for reasons of showing off or playing to camera, some of the punch of the gambling aspect is lost. Aesthetics fuckin' rip tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really great! I played this game for over 6 hours and the achievements are very easy to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very-easy going game, perfect for beginners Point-and-click.\r\n\r\nI'm am new to P.C. games and this is quickly becoming a top favorite.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the coolest games i ever played in terms of art style and subtle story telling. The game makes you want to know more about whats happening, who is this guy, why is this happening etc. I wish there was more to it. Maybe in the future, who knows!\n\nIts fun to play against your friends in multiplayer.\nOn singleplayer it feels easier because of the <<extra turn>> you get each time.\n\nFor its price its totally recommended even if its short game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gambling but without blowing the kids college funds. Perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing russian roulette with shotgun? This game has very different theme. Smoking cigarettes gives you a health. Drinking beer reloads your gun. You can handcuff your oppenent and it blocks him for next round. I dont know if this game is online but if it is, it would be fun by playing this game with your friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a very dark game and is not for everyone, it's also a great way to pass the time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played it for all of six minutes and the dealer shot me so hard on my last life that it force quit the game. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has one goal in mind and it does that goal extremely well. Focusing on a Russian roulette with extra steps and items. Makes for a lot more strategy plus the vibe it has going on. The computer in the bathroom to check overall progress is a neat idea.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great little time wasting game to play with your friends can give you a good laugh>",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun to play both solo and multiplayer! Highly recommend playing :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I gambled and won the first time, then played CloverPit and died with my winnings on a slot machine",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "https://youtu.be/8aMG2rlRZL4\n\nWhatever hidden secrets may be part of this experience are buried too deep to make up for the RNG based unlock method for whatever may be there.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kinda pointless if you play solo, it's clearly intended as a multiplayer only game. I don't have friend so no reason to play.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It looks pretty, I'll give it that. The atmosphere is cool, music is good. It's entertaining for about 15 minutes and quickly goes downhill from there.\n\nDespite looking literally like a 1995 game with a 256 color palette, the performance is relatively abysmal, worst optimized Godot game I have ever seen. \"Partial controller support\" means that your controller might not work as advertised or, in my case, double any input, making it useless.\n\nThere's no content, just making coin toss decisions ad nauseam. I cannot believe 6 gorillion people bought this \"game\" and even compared it to a masterpiece like Inscryption. This has to be in the top 5 overhyped titles of the XXI century. I sincerely believe that to enjoy this game you must either be a fentanyl zombie, a cocomelon lobotomy survivor or a simian whose neurons activate with any dice roll, regardless of context. At this point you should just give in to your programming and simply go gamble in an online casino. At least then you might win something. \n\nHow am I supposed to derive satisfaction from a game that, in order to be won, needs literally only luck and nothing else? \n\nFans of this piece of dogshít will defend it by sharing tips about making regular breaks when angry or fatigued... That the \"game\" has \"roulette\" in the name after all! And that the fun is derived from manipulating the odds in your favor. Except that the only way to do that are items, most of which are useful in very specific situations or barely useful at all, depending on - you guessed it - luck. They are also assigned randomly. Enjoy the heights of strategic pondering and amusement when you try to decide who to shoot with a 50/50 chance of live round or dud OR perhaps making a 50/50 coin toss to decide whether pills will regenerate 2 health points or take away your last one. Try to predict what your 3 HP opponent with healing, scrying and damage items will do. \n\nAnd if you still want to \"play\" this then you better have good short term memory AND be prepared to give it your full and undivided attention. The initial shells loaded into the shotgun each round appear only once for about 1.5 seconds. If you had the sheer audacity to look away from the screen for an inopportune moment, you might as well restart the whole run, as you won't be able to gauge the probabilities at all. And there's about 90% chance that your enemy will have perfect memory and will follow predefined optimal decision branches. This is, in actuality, the crux of the game and it's only source of anything you could call \"difficulty\". That, and weird probability results to your disadvantage that seemed to have sparked achievement ideas. Have \"fun\" I guess.\n\nBut the above shell count thing is just a single smelly piece of undigested corn sticking out of the fecal iceberg of this game's abysmal design and lack of anything resembling QoL. Animations are long, unnecessary and irritating. There's no way to skip them or make them faster. You WILL \"enjoy\" them to the fullest EVERY TIME. It seems benign at the beginning, but a game like this should run instantly. This is the only way to facilitate players getting into the \"zone\" of repeating the gameplay loop until they shít themselves on stream. Instead, you spend about 3% of the game time actually thinking or clicking and 97% of the time just watching the same 5 animations which aren't even that entertaining in the first place. The whole interface is garbage. You can't even back out of using the shotgun or an item if you misclick, which is something that seems absolutely basic, expected, low bar and immediately detectable in any serious testing. But \"nooo, this is le edgy game, no hand holding!!! You clicked the shotgun, so either choose the target or reset.\"\n\nFor some bizarre reason the online mode is for 4 players only, so I have no idea how that changes anything about the game, as no 9ne seems to play it online anymore.\n\nThis could have been a mildly entertaining VR experience, given some polish, QoL improvements and INSTANT game world feedback, but apparently this is too much to ask. \n\nI'm absolutely disgusted with this title and disappointed in gaymerz. I'm glad I got this in a bundle, as the ~$2.50 is way too much. Don't even @ me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "1/10 not a fan\nplay time past 15 minutes is afk card farming\ninto the hidden game abyss with you",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Replay value is low, there is basically no variety between gameplay sequences and while the base game is super simple this is a down for me. I could see how this would simply be replayable with interest but right now it feels lazy design that relays only on the visuals.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, but Steam Deck support is horrible. Constantly selects the wrong items and button and stick mappings don't work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buckshot Roulette is a gritty and dark depiction of a 1-on-1 showdown against a body-less nightmare in Russian Roulette. The twist? You play with a shotgun. The premise is creative, mayhaps even enticing, but the execution? Meh.\n\nThe game opens in a bathroom, graffiti'd and ominous. You're sat against a toothy demon of sorts and told to play his game. 30 minutes later, win or lose, credits roll, and you're out. What is this place? Who is this guy? Why am I here? Answer none of these questions and more in Buckshot Roulette!\n\nThe gameplay is simple, but satisfying to master. A number of rounds are loaded into the shotgun per round and you're shown how many are lives versus blanks. You must mentally keep track of this number while using items granted each round to eject the round, check the casing, and other effects. By the end of my duel with the Dealer, I felt I had achieved some sort of mastery, but unfortunately, this also spelled the end of the game, and that skill went to waste.\n\nI think this game could've benefited a lot from a little exposition maybe, a few more challengers perhaps, another couple of items and combos to use... I'm told that's basically Inscryption, but this isn't Inscryption. It's Buckshot Roulette, and while it's cool on a conceptual level, it feels unfinished and closer to a stylish demo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Review as a single player game:\nAt it's core, this is a puzzle game.  It is a puzzle game with a very grim aesthetic, but it's still just a puzzle game.\n\nIt's a very slight experience.  Which for just $3 is fine.  There is only one opponent in single player, and it is well coded to play mostly optimally.\n\nAnd that's the main problem with the single player experience.  The items and mechanics are completely imbalanced to the randomization.  It is completely possible for the randomizer to give you a situation where even with perfect play it is impossible to win.  When you need to win roughly 15 straight games (for the million point achievements), that creates some VERY frustrating experiences.\n\nThis review is a victim of Steam's binary Yes/No review system.  It's an entertaining experience, but horribly broken.  Which is a shame, because with a little more work (better balancing on the items, a couple more opponents, a little more clarity on the scoring) this could have been a premium game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't save any progress, not gonna go through all 3 levels again just because I wanted to turn down the super loud music.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, this game is neither fun nor well designed.\n\nFirst off, this is pure luck (beside the stats that you can calculate). OK, to be fair, they added several objects to tamper the luck aspect of the game, but still. While in other roguelikes, the rng is not the sole aspect of the game, in Buckshot Roulette, there is nothing else to play with.\n\nIn the making, this game is also a chore: there is no way to pass all these lengthy animations (several seconds), which makes the game extremely slow pace, and thus artificially increasing the game play time, which I really hate.\n\nHonestly, you will have more fun with a dice or two.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "had fun for 2 - 3 runs but then it started getting repetitive, 100%ing is mid, just boring, it needs more settings and ai upgrade, for the price its a solid 6/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring and all luck no skill, I'm a big fan of gambling games but this is just so luck reliant it's also so boring I just can't have any fun. 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Online is dead, Playing against a bot that remembers everything is just lame. \n\nStick to other games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is horribly optimized so if you have a low level me device just shoot your self in the face instead of buying this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate to give a negative review to a game I got in a bundle for practically nothing, but I'm honestly very confused as to how this game is rated overwhelmingly positive. \n\nThe art style is okay, but that's the best thing about it, from what I've seen.\n\nAbout 45 minutes in, and I feel like I've seen most of what this title has to offer. I haven't played all the way through the \"Double or Nothing\" mode, so possibly there's a lot I'm missing ... but from all appearances, I doubt it.\n\nThe core game loop is very simple, heavily RNG-based (not necessarily a bad thing), though there is some strategy available with usable items. In the time I've played, however, it feels pretty shallow.\n\nI don't hate it, but it's pretty lackluster so far. Might give it another try and update this review if my opinion changes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I did not make it through the first round of 3 games, including a second try at the second stage. You died. Retry? Absolutely not.\nWaiting for everything to play out on a 50/50 chance action, I found myself bored and tabbing away and doing some work.\n\nI can see in the screenshots it gets more complicated later, but I would rather saw my own arms off than endure sitting through all those long animations again\n\nedit: I went back. I do not particularly enjoy games of chance, but you know what I should be fair - maybe this is just a 'not for me'. I'll check that there is not in fact a hurry the f$&% up mode in the settings. No? OK, maybe you can press a button or something, I can't remember for sure if I did that. After clicking start and waiting (pressing every key and button in the meantime) 3 seconds just for it to fade to black - before the game will even start - alt+f4 and I'm back here updating this text. I *hate* this game, and it's lack of respect for player's time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, it's a really boring game and rather shallow. I would have said it's a waste of money - but it's ridiculously cheap to even say so.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get it, i got it for the hype it gets repetive after like 20 minutes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I had to restart my system as the game refused to close!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dull. It's solid for 30 minutes... then it's just dull.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cant give buckshots in multiplayer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "that little bugger stole my cigs in double or nothing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "imagine russian roulette with dumb rules that make the game easy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun for the first 10 minutes max",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it wont let me load it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's ok 7/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dead game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant sex mask guy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Luck based, no skill",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "really boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCK ASS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This Game Is Dead af :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Забагованный кал говна",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "utter dogshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hayır.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "overrated",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "💔",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "uhm no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "experiencing an issue where no matter what, even if i uninstall and reinstall the game, the screen is black and i cannot play.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Cant even play the game, it just black screens and no matter what i try it doesnt fix it.\nI have tried probably the 3 most common fixes that ive found through reddit/steam/youtube.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Fun for 1 player. but even in a worldwide server search i still could only find 2 other people playing. You need 4 for a multiplayer game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is very fun, but it has unfortunately not recieved updates since 2024 and since the Vulkan driver updates, the game just doesn't load properly. You can use a workaround, but it doesn't seem to work for everyone and it's obviously not the way the game was intended to be rendered on screen. This seems to be more of an issue with the game engine than with the game itself, but still, I do not recommend buying this game until it is fixed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game has a bug that just prevents you from playing the game as your screen is Permanently black. Cannot recommend the game until this is fixed, which seems unlikely.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Was about to refund this...\n\nGame would boot to the menu and let me select a game mode but when loading into a game I would get only audio with black screen.\n\nFound fix on reddit:\n\n1. Right-click Buckshot Roulette in your Steam Library\n2. Select 'Properties...'\n3. Paste under 'Launch Options' the following (without quotes):  \"--rendering-driver opengl3\"\n4. Close the window and try launching the game.\n\nOpenGL3 Makes the game look like over-saturated crap but at least I can play it...  Not like this game is much on the visuals anyways and I only spent $1.25 on it so I'll keep it but wanted to post this fix in case anyone else has this issue.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "bought for itch.io, and had to re-purchase when it dropped on Steam. Scam considering they dropped itch.io development too, whereas others like the developers of WorldBox gave out steam keys to itch.io backers when they moved platforms. Lame greedy behaviour",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Currently seems broken. Some other people seem to be having the same issue. I've tried out some of the instructions for making it work but it doesn't seem to work. Unsure why. The graphics just won't load so I have no idea whats happening in the game, or what to do to play. It's just a black screen with nothing there. If I find out it's something i'm doing, I'll change the review. I don't think it is though.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "https://youtu.be/8aMG2rlRZL4\n\nWhatever hidden secrets may be part of this experience are buried too deep to make up for the RNG based unlock method for whatever may be there.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its an amazing game, however unfortunately as of late anytime I boot it up it gives me a flashing screen with textures from the game in the main menu. I did not mind too much, until I booted into the real game and it was nothing but a black flashing screen. According to some forums this is an issue caused by an update to the game that can be fixed by creating a new execution file, but regardless of if its fixable, it should not be an issue in the first place. Until this is fixed, I cannot recommend this game, despite how amazing it is, in this broken state.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "4 player mode works like a charm, someone's game freezes after 10 minutes\n\nShit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is fun but lacks a fast forward button, get bored from watching the slow animations",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Worst possible format to play multiplayer... not recommended",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is fun\r\n\r\nit crashes every 30 minutes. i have a literal NASA super computer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun party game with friends for 1/2 nights.\nArtistic Direction is pretty cool.\nBase game is fun, however most of the fun is in the core concept.\n\nThe 3 hardest achievements (currently all at 1%) are genuinely awful. It's grindy, mostly luck-based (even with great planning) and frustrating.\nAlso the game is surprisingly unstable.\n\ntldr : Worth the price and pretty fun for 3 hours. After that, do not bother.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kinda pointless if you play solo, it's clearly intended as a multiplayer only game. I don't have friend so no reason to play.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It looks pretty, I'll give it that. The atmosphere is cool, music is good. It's entertaining for about 15 minutes and quickly goes downhill from there.\n\nDespite looking literally like a 1995 game with a 256 color palette, the performance is relatively abysmal, worst optimized Godot game I have ever seen. \"Partial controller support\" means that your controller might not work as advertised or, in my case, double any input, making it useless.\n\nThere's no content, just making coin toss decisions ad nauseam. I cannot believe 6 gorillion people bought this \"game\" and even compared it to a masterpiece like Inscryption. This has to be in the top 5 overhyped titles of the XXI century. I sincerely believe that to enjoy this game you must either be a fentanyl zombie, a cocomelon lobotomy survivor or a simian whose neurons activate with any dice roll, regardless of context. At this point you should just give in to your programming and simply go gamble in an online casino. At least then you might win something. \n\nHow am I supposed to derive satisfaction from a game that, in order to be won, needs literally only luck and nothing else? \n\nFans of this piece of dogshít will defend it by sharing tips about making regular breaks when angry or fatigued... That the \"game\" has \"roulette\" in the name after all! And that the fun is derived from manipulating the odds in your favor. Except that the only way to do that are items, most of which are useful in very specific situations or barely useful at all, depending on - you guessed it - luck. They are also assigned randomly. Enjoy the heights of strategic pondering and amusement when you try to decide who to shoot with a 50/50 chance of live round or dud OR perhaps making a 50/50 coin toss to decide whether pills will regenerate 2 health points or take away your last one. Try to predict what your 3 HP opponent with healing, scrying and damage items will do. \n\nAnd if you still want to \"play\" this then you better have good short term memory AND be prepared to give it your full and undivided attention. The initial shells loaded into the shotgun each round appear only once for about 1.5 seconds. If you had the sheer audacity to look away from the screen for an inopportune moment, you might as well restart the whole run, as you won't be able to gauge the probabilities at all. And there's about 90% chance that your enemy will have perfect memory and will follow predefined optimal decision branches. This is, in actuality, the crux of the game and it's only source of anything you could call \"difficulty\". That, and weird probability results to your disadvantage that seemed to have sparked achievement ideas. Have \"fun\" I guess.\n\nBut the above shell count thing is just a single smelly piece of undigested corn sticking out of the fecal iceberg of this game's abysmal design and lack of anything resembling QoL. Animations are long, unnecessary and irritating. There's no way to skip them or make them faster. You WILL \"enjoy\" them to the fullest EVERY TIME. It seems benign at the beginning, but a game like this should run instantly. This is the only way to facilitate players getting into the \"zone\" of repeating the gameplay loop until they shít themselves on stream. Instead, you spend about 3% of the game time actually thinking or clicking and 97% of the time just watching the same 5 animations which aren't even that entertaining in the first place. The whole interface is garbage. You can't even back out of using the shotgun or an item if you misclick, which is something that seems absolutely basic, expected, low bar and immediately detectable in any serious testing. But \"nooo, this is le edgy game, no hand holding!!! You clicked the shotgun, so either choose the target or reset.\"\n\nFor some bizarre reason the online mode is for 4 players only, so I have no idea how that changes anything about the game, as no 9ne seems to play it online anymore.\n\nThis could have been a mildly entertaining VR experience, given some polish, QoL improvements and INSTANT game world feedback, but apparently this is too much to ask. \n\nI'm absolutely disgusted with this title and disappointed in gaymerz. I'm glad I got this in a bundle, as the ~$2.50 is way too much. Don't even @ me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feels really limited, a feel like a few updates could have made it better but for the price its... ehh?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "1/10 not a fan\nplay time past 15 minutes is afk card farming\ninto the hidden game abyss with you",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Don't buy this game for the multiplayer, it's really not interesting and lacks rules customization. Can't judge the solo mode thought",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Isnt worth it of ur on ROG Xbox ally, it glitches extremly and it feels like ur playing as an blind Schizophrenic",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Replay value is low, there is basically no variety between gameplay sequences and while the base game is super simple this is a down for me. I could see how this would simply be replayable with interest but right now it feels lazy design that relays only on the visuals.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, but Steam Deck support is horrible. Constantly selects the wrong items and button and stick mappings don't work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buckshot Roulette is a gritty and dark depiction of a 1-on-1 showdown against a body-less nightmare in Russian Roulette. The twist? You play with a shotgun. The premise is creative, mayhaps even enticing, but the execution? Meh.\n\nThe game opens in a bathroom, graffiti'd and ominous. You're sat against a toothy demon of sorts and told to play his game. 30 minutes later, win or lose, credits roll, and you're out. What is this place? Who is this guy? Why am I here? Answer none of these questions and more in Buckshot Roulette!\n\nThe gameplay is simple, but satisfying to master. A number of rounds are loaded into the shotgun per round and you're shown how many are lives versus blanks. You must mentally keep track of this number while using items granted each round to eject the round, check the casing, and other effects. By the end of my duel with the Dealer, I felt I had achieved some sort of mastery, but unfortunately, this also spelled the end of the game, and that skill went to waste.\n\nI think this game could've benefited a lot from a little exposition maybe, a few more challengers perhaps, another couple of items and combos to use... I'm told that's basically Inscryption, but this isn't Inscryption. It's Buckshot Roulette, and while it's cool on a conceptual level, it feels unfinished and closer to a stylish demo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Review as a single player game:\nAt it's core, this is a puzzle game.  It is a puzzle game with a very grim aesthetic, but it's still just a puzzle game.\n\nIt's a very slight experience.  Which for just $3 is fine.  There is only one opponent in single player, and it is well coded to play mostly optimally.\n\nAnd that's the main problem with the single player experience.  The items and mechanics are completely imbalanced to the randomization.  It is completely possible for the randomizer to give you a situation where even with perfect play it is impossible to win.  When you need to win roughly 15 straight games (for the million point achievements), that creates some VERY frustrating experiences.\n\nThis review is a victim of Steam's binary Yes/No review system.  It's an entertaining experience, but horribly broken.  Which is a shame, because with a little more work (better balancing on the items, a couple more opponents, a little more clarity on the scoring) this could have been a premium game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't save any progress, not gonna go through all 3 levels again just because I wanted to turn down the super loud music.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, this game is neither fun nor well designed.\n\nFirst off, this is pure luck (beside the stats that you can calculate). OK, to be fair, they added several objects to tamper the luck aspect of the game, but still. While in other roguelikes, the rng is not the sole aspect of the game, in Buckshot Roulette, there is nothing else to play with.\n\nIn the making, this game is also a chore: there is no way to pass all these lengthy animations (several seconds), which makes the game extremely slow pace, and thus artificially increasing the game play time, which I really hate.\n\nHonestly, you will have more fun with a dice or two.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "had fun for 2 - 3 runs but then it started getting repetitive, 100%ing is mid, just boring, it needs more settings and ai upgrade, for the price its a solid 6/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring and all luck no skill, I'm a big fan of gambling games but this is just so luck reliant it's also so boring I just can't have any fun. 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Online is dead, Playing against a bot that remembers everything is just lame. \n\nStick to other games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is horribly optimized so if you have a low level me device just shoot your self in the face instead of buying this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate to give a negative review to a game I got in a bundle for practically nothing, but I'm honestly very confused as to how this game is rated overwhelmingly positive. \n\nThe art style is okay, but that's the best thing about it, from what I've seen.\n\nAbout 45 minutes in, and I feel like I've seen most of what this title has to offer. I haven't played all the way through the \"Double or Nothing\" mode, so possibly there's a lot I'm missing ... but from all appearances, I doubt it.\n\nThe core game loop is very simple, heavily RNG-based (not necessarily a bad thing), though there is some strategy available with usable items. In the time I've played, however, it feels pretty shallow.\n\nI don't hate it, but it's pretty lackluster so far. Might give it another try and update this review if my opinion changes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I did not make it through the first round of 3 games, including a second try at the second stage. You died. Retry? Absolutely not.\nWaiting for everything to play out on a 50/50 chance action, I found myself bored and tabbing away and doing some work.\n\nI can see in the screenshots it gets more complicated later, but I would rather saw my own arms off than endure sitting through all those long animations again\n\nedit: I went back. I do not particularly enjoy games of chance, but you know what I should be fair - maybe this is just a 'not for me'. I'll check that there is not in fact a hurry the f$&% up mode in the settings. No? OK, maybe you can press a button or something, I can't remember for sure if I did that. After clicking start and waiting (pressing every key and button in the meantime) 3 seconds just for it to fade to black - before the game will even start - alt+f4 and I'm back here updating this text. I *hate* this game, and it's lack of respect for player's time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, it's a really boring game and rather shallow. I would have said it's a waste of money - but it's ridiculously cheap to even say so.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get it, i got it for the hype it gets repetive after like 20 minutes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I had to restart my system as the game refused to close!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dull. It's solid for 30 minutes... then it's just dull.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cant give buckshots in multiplayer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "that little bugger stole my cigs in double or nothing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "imagine russian roulette with dumb rules that make the game easy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun for the first 10 minutes max",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it wont let me load it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's ok 7/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dead game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant sex mask guy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Luck based, no skill",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "really boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCK ASS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This Game Is Dead af :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Забагованный кал говна",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "utter dogshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hayır.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "overrated",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "💔",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "uhm no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "experiencing an issue where no matter what, even if i uninstall and reinstall the game, the screen is black and i cannot play.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Cant even play the game, it just black screens and no matter what i try it doesnt fix it.\nI have tried probably the 3 most common fixes that ive found through reddit/steam/youtube.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Fun for 1 player. but even in a worldwide server search i still could only find 2 other people playing. You need 4 for a multiplayer game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is very fun, but it has unfortunately not recieved updates since 2024 and since the Vulkan driver updates, the game just doesn't load properly. You can use a workaround, but it doesn't seem to work for everyone and it's obviously not the way the game was intended to be rendered on screen. This seems to be more of an issue with the game engine than with the game itself, but still, I do not recommend buying this game until it is fixed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game has a bug that just prevents you from playing the game as your screen is Permanently black. Cannot recommend the game until this is fixed, which seems unlikely.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}