{
  "positive": [
    {
      "review": "I have to admit this game is way better than it has any business being. It is absolutely beautiful. It's very immersive and fun!\n\nI didn't hear about this game. I just saw it on Steam and got curious. I'm glad I got curious because when I saw it was released recently and watched reviews - I bought it! \nI don't understand why they didn't advertise it more.\n\nAbsolutely great game! I suggest getting the complete edition and just enjoying it as you go.\n\nThe only thing I would wish for is that I could play with like up to four people instead of only two.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Having completed the game, including all DLCs, to [b] 100% [/b], here's my review:\n\n[h3] Pros: [/h3]\n- Top-notch graphics (nature, weather, etc.)\n- Large, open world with countless activities\n- Long playtime\n\n[h3] Cons: [/h3]\n- Some bugs\n- Mediocre story\n\n[h2] Conclusion: [/h2]\nWith the new pricing model, it's worth it. Otherwise, I would only have recommended it on sale.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "ITS SPECTACULAR just wish it was a little bit more free, sometimes side quests can be extremely time consuming and i kinda wish we had romance options or text options in general",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Pandora is the most beautiful game setting I've ever seen\n\nScore: 90/100",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Absolute amazing game, would highly recommend to anyone who loves the Avatar movies! The story line is amazing and the Ikrans and Direhorses are the most beautiful creatures ever.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Playing the game on 3440 x 1440 with lg ultragear curved monitor .Amd 9800x 3d , Rtx  5070 ti. Pandora is something else .I have never seen better visuals combined with natural atmospherics and this level of realistic lighting. The game can be demanding to run but once you hit a certain threshold the magic happens. Mostly High settings , Dlss quality with 20 lvls on detail and raytracing the game becomes a spectacle. Vsyng turned on to stabilize frame rate it can be up and down a lot.\n\nGunplay is good especially combined with very good jungle traversal.\n\nI am really in awe of the world created  \n\nThe game is a 10 for me so far.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great graphics pretty easy on your GPU, fun gameplay",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Genuinely if you enjoy Farcry-style gameplay and you love the world of Avatar then this is the game for you. I was hesitant when I first started playing, but after giving it a fair chance, this is the exact kind of game I wanted for the Avatar universe. Definitely worth the time.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Amazing, fun and beautiful but also one of the best open world games I've played in a long long time. Was on edge about getting this game as it originally wouldn't let me play cause it couldn't find my SSD but i sorted it out and was easy to fix. happy i made the decision to buy it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the game! Huge and stunning world. Story, character development, combat, exploration, and interactions with the environment are all amazing, though some missions feel a bit repetitive. I wanted more - ended up buying all the DLC. If price is an issue, it is worth waiting for discounts. Love that the game is still being updated, with another DLC coming soon. Overall, a great single-player game, and a must-play for fans of the univers, 9/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is worth it for the graphics alone; especially if you get it on sale. \r\nthe movement and combat are really fun so far, and i haven't run into many bugs\r\ndefinitely worth copping",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game exceeded my expectations immensely. The story line is amazing and flows well, and the combat progresses perfectly. For some parts in the main story it takes awhile to increase your combat level before taking down particular RDA factories (especially the big ones) but other than that, this game is 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "6/10. Very average game. Nothing really unique. The most annoying thing in this game was the \"Resistance\" characters. Stupid AF characters, weird personalities, they always getting into trouble and need saving. Especially annoying was that pink hair, woke lesbo Priya. A lot of boring quests even in the main story. Enemy AI characters not very smart. And I already forgot the name of the main vilain. It's one of those vilains, who is evil just for the sake of being the bad guy. \r\n\r\nWhat I did like - the world is very large, nice environments, a lot of details.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I've played this campaign twice already, and now on a third. I would recommend this game for the stunning visuals alone, but the combat on Ground AND in Air makes it a blast too. You can make the difficulty casual, or almost unbeatable on \"Veteran\" which I've yet to beat lol, maybe one day.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is amazing! An open world adventure that just takes you places that are just so cool. The animals, the floral. Breathtaking! You can just see how much time and love was put into this game by the devs. The only concerns I have for this game is how you cant skip difficult missions, or interact with everything like animals, natives, people, etc. It can be somewhat glitchy at certain times. But other than that its a really great game! The missions can be tricky but are actually really fun to do once you complete them. Wish there were more ikran accessories and style choices for your character, but other than those little things 9/10!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its nearly imposible to be bored is possible to get pissed off af",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game turned out to be so much more than i anticipated!! Well worth the purchase! And the third person update is just around the corner!! What a time to be alive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "awesome game ,only 6 hours in and thats mostly me  just exploring pandora ,very nice looking game ,you will lose yourself in the game its brilliant highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good game the story is a bit conufsing but there is a story. But overall I think its a good game to play and I think that the co op is pretty good as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really impressed ! a buddy told me it was good a while back, this game has no reason to be this good coming from ubisoft, but its good, visually stuning, great mechanics, great story, really brings the Na'vi world to life. give it a chance, we need more titles like this rather than the same old AC or COD. now if we could get a open world Prince of Persia I might stop talking smack about Ubisoft",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a gorgeous world and the story is not bad so far.  They have done the Avatar name justice, its pretty spot on.\n\nSo much walking at the start, very little combat which is just not that fun.  But the game does open up after a long few hours of walking around, when the missions the get harder and we take flight.\n\nThe UI is really really rough, spending so much time figuring out how to get around, the Map has no legend on it so if you take a break good luck remembering whats what on that.\n\nIts a bit weird in some places but getting good fps, and getting used to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you arent a hard core fan of Avatar then it isnt the game for you, the story is great in a lot of parts but could use some work in others, a lot of the flaws of the game I feel are more personal than actually NEEDING them to be in the game.\r\nI personally would have loved more customization in terms of our character for one, would love specifically more hair styles and the ability to see the dots better. I also wished that the other Sarentu matches our characters skin + patterns instead of looking like everyone else.\r\nI would have also loved more choices in the game with different outcomes, I feel like a lot of choices are made for us instead of us getting the chance to choose, personally I want to be able to get the choice to either lie, tell the truth, be blunt, beat around the bush, ect\r\nI wish there were moments between us and the other Sarentu, like we are supposed to be a close knit of friends yet we barely get to see them experience Navi culture, even a small cut scene of watching them hunt, or weave, flying an ikran/riding a direhorse, ect would have added a lot to the game\r\nNow this is defnietly more of a personal preference but I wish romance was in the game, there are plenty of characters in each clan + sarentu that we should have the OPTION to romance. Obviously if you dont want to romance anybody you dont have too but I wish there was at minimum a way to spend more time with some of the other navi. \r\n\r\nMore personal preferences then anything but thought id share my own thoughts :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and good graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love it. I love avatar and this game is so well developed that it feels like im actually in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is immaculate. The coop could use some work but it is still one of the greater aspects of the game. The plot twists and the controls are amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game's pretty good, your weapons are great, moving and fighting feels fantastic. It's just unfortunate that I don't think the game world does enough to take advantage of it. The experience is pretty light on gameplay, with the bulk of gameplay being traversal that's pretty easy and low stakes. I think it works for the kind of experience they're going for, but my personal preference would have been something that's a bit more dense and challenging. I wish monsters and the RDA were a more persistent threat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so far its been really great! The only problem is I've had to replay quests over again if i keep the storyline on another device.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, love the mechanics and culture.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. The game has amazing graphics and the world is very fun to explore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it id now very good. i would only recommend it for hard core fans of the franchise tho or it might just seem weird",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "- goes into laer ore proccessor alpha\r\n- Reaches the first level \r\n- CAT turns off my pc.\r\n- rages\r\n\r\nwould reccomend 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game's graphics is really good and so is the combat however the customisation was a little bit disappointing and the ikran flying animations are really boring which is a big let down so i recommend this game only when it's on sale and not it's full price\nI'd appreciate this game a lot more if the ikrans had an update and became an actual fun experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, couldn't stop playing. Great visuals and immersive. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, a great window into the world of Pandora.\nThe views, the visuals, and the experiences alone make this game worth it. To walk through the bio-luminiscent fields of Pandora, to have your own Ikran and soar through the skies, it's incredible.\nThis is one of those games where I've spent a very healthy amount of time using the photo mode, simply because of how gorgeous the world is.\nThe gameplay loop is decent. The story is actually pretty nice. I liked how they set it up, and how it eventually unfolds.\nI absolutely love the side-quest loop of destroying RDA facilities and watch nature reclaim them.\nThe gathering mechanism is ok, I would say. Crafting is also just about OK.\nLevelling system could do with some changes. Sometimes weapon stats and rating don't match at all.\nI wish this were more RPG like. There are no meaningful choices, you can't talk to NPCs outside of their quests, no personal bond quests. There is no romancing mechanism, but that I'm fine with. Not every game has to have one.\nAlso there's no third-person view as of now, but it is set to be a feature with the ashes and fire DLC.\nI also played both DLCs. Again, gripping stories, and lovely visuals.\nOverall a good 8/10 game for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game (Played on PS when launched) a bit of a grind to keep equipment up to date and a steep learning curve but overall a beautiful and entertaining experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my boyfriend made me get this to play with him\n\nI dont know whats happening but its like fallout with blue people\n\ni enjoy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing visuals, great customisation, you really feel apart of Pandora. Beautiful game but gameplay is a little bit repetitive, would reccommend overall though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive always been a huge fan of avatar and i love the game you can really feel the emotion and pressure to save pandora",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm incredibly annoyed at the fact I bought this game when just the base game was like... $60. Its a good game, but to find out it dropped to half the price? I'm annoyed. I do recommend it, though. I play it on both play station and PC (So basically spent $120 on this game-) and it works great on both.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it a lot. It's a really good transition from film to game, and as someone who's a fan of the Na'vi lore/language, this game gets it right. \n\nIt's also fun! Combat is engaging, the story and characters are well crafted, and Eywa'eveng itself is stunning to behold; this game is a visual and auditory masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic graphics and gameplay. The use of the Avatar setting for an RPG was just perfect. I love the Ikran flaying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely love this game, its like living in my childhood fantasy after seeing avatar",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun to play as a fandom comfort game, like when waiting between movie releases. graphics are phenomenal, and the sound is immersive. There's the option to turn on or off quest markers, giving you the option to explore and actually have to pay attention to surroundings, much like you'd have to if it were in real life, or to enable quest markers if you're super unobservant and goal-oriented like me, lol. the marker also isn't present 24/7, and only activates when you toggle the Na'vi senses mode, so as to not be as distracting. while the minor villages within the same region look extremely similar, if not identical, they vary across regions. the aranahae clan's hometree looks nothing like the plains people or cloud forest people. the na'vi all treat you less like a lifeless npc and more like just another person crossing their path. the comments they make will also vary, depending on if you're wearing rda clothing or traditional na'vi clothing. the fighting mechanic is fun. the more \"na'vi-like\" your kill is, the higher the material quality. after every kill, you thank the animal for its gifts. you have a realistic (ish) inventory capacity. the rda also is an at-large enemy, and you can empty their factories either with stealth or guns (or bows) ablazing. every weapon has a different playstyle, and you can choose between both rda and na'vi styled weapons. you also get an ikran!!! flying that thing is so fun and freeing, and it's fun to take the rda scorpions out of the sky as well. at night, pandora lights up with its biolumenescent fauna and flora. 1000/10 definitely would recommend!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent graphics, easy to learn controls. Only thing I wish would've been added would be base building but that's a personal preference. Decent game, I play it with my daughter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best looking game I have ever played!  (be aware: it can use close to 16 gb ram, and around 14gb vram for 1440p maxed)  I would recommend a 16 gb video card and 24 gb ram for best results at 1440p.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah if youre obsessed with pandora or aliens or anything of the like i'd bang this game its 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely beautiful, gorgeous graphics, the ray tracing, particle effects and foliage are like being in the movies, 3 hours into the game and really enjoying the story and locations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed this game, particularly the feeling of agility in moving through the environment. One effective storytelling aspect was the use of a perky human accent for the voice of your character to continually highlight your separation from the shared indigenous culture – it often, effectively, made me feel out-of-place. Some moss-filled caves looked so cozy that I longed for some rest function to so I could lay down in them and have a nap.\n\nThe game rendered very smoothly without significant loading times, which it should on a 7800X3D + 4090 + SSD, 4K display system, but not all games do. The only issues were in the Sky Breaker DLC, where there was much texture flashing and a couple finicky quests I could not be bothered to complete due to poor game guidance. The Secrets of the Spires quest felt as good as the main game.\n\nSeveral game-play mechanics felt like feature-list items for management and did not have any or much impact on the game: \n• Clan reputation, as a currency, went up quickly and was rarely tradable for items better than found in chests throughout the world.\n    • Therefore vendors were mostly not relevant.\n    • Don’t bother finding ingredients for the clan cache.\n• Food buffs seemed to make little-to-no difference, just craft from whatever you find.\n• Weapon crafting often yielded a lower DPS weapon than those I randomly found.\n    • Therefore, gathering materials was a minor activity.\n    • The only time this seemed useful was in Secrets of the Spires.\n    • There lacked any clear use for discarded weapons, you could put them into the clan basket, but there was no benefit versus just dropping them in the field. Some Na’vi, somewhere, must have use for these high-level bows I don’t have room for.\n• Recipes and buff icons are clearly defined. If it were your culture, you would intuitively know what each buff icon meant… maybe that was the point?\n• Due to above points, there seems to be little benefit to seeking out rare crafting items.\n• Notes or audio logs are not necessary in the story line.\n• Landmark finding doesn’t seem integral to progression… I’m not certain if all the Bellsprigs I poked did anything.\n\nQuestions:\n• Where do all the Na’vi sleep, there seem to be no nests or apartments in the trees?\n• Why can’t I call my Ikran from slightly inside the cover of a structure and have them waiting at the exit?\n• What was with my character’s grunts and exhalations while flying? I know Na’vi are mentally bonded with their Ikran, but they seemed unexpected or like a reaction to being attacked. If you are sympathetically reacting to your Ikran’s effort, through your bond, then it should be both ways and able to prepare the Ikran for the effort.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE LOVE LOVE this game SO MUCH!! Avatar has been a childhood movie of mine and now that i have the game i genuinely couldnt be happier! I def recommend it to any avatar fans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If u like the movies, youd prob love the game, but anyways 10/10 very beautiful, love it sfm <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely  beautiful game with amazing graphics.. story could be better tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am obsessed with this game. It is amazing and my pc isnt even good enough to handle the full graphics meaning it could be so much better!! In saying that my game has not crashed. I got the game when it was on sale and it was definitely worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely beautiful game that has you exploring a world that I know I have wanted to travel ever since the first Avatar movie came out! I love the characters and story-lines. I think the game mechanics are neat with Na'vi vision and keeping harmony within Pandora. Taking out the RDA is always a plus! I love the character customization. A few people rag on it being first person, which I understand so luckily they are adding that in a future update! I have had such a blast in the month I've had this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h3]TL;DR[/h3]\nIf you enjoy the Avatar films, you are going to really enjoy this. If not, it won't land. It is a magnificent looking game and will push all but the top gfx cards.\n\n[h3]Tech:[/h3]\n\nI'm running it on:\n\nOS: CachyOS\nKERNEL: 6.17.5-2-cachyos\nCPU: 12th Gen Intel Core i9-12900KF\nGPU: NVIDIA GeForce RTX 4070\nGPU DRIVER: NVIDIA 580.95.05\nRAM: 32 GB\n\nLaunch Options:\nPROTON_FORCE_DXVK=1 DXVK_HDR=1 DXVK_FRAME_GENERATION=1 GAME_MODE=1 PROTON_ENABLE_NVAPI=1 game-performance %command%\n\nwithout really much issue I get circa 80-90fps and it never dips under 60fps at 1440p. HDR doesn't work correctly when on Linux, but other than that you are going to get windows levels of performance using the cachyOS proton version. You might need to tweak it a little for your own hardware.\n\n[h3]Gameplay:[/h3]\n\nOK so yes there are similarities between AFoP and Farcry. But it kind of picks on the good stuff and leaves out the crud. Early game you are stuck moving around to new areas and places via your feet, but much quicker than you might think, you will be flying. The game is very flight focused (as it should be) - you also get to ride dire-horses so horse fans, you are covered. Most of the gameplay is a story focused ride. The story isn't bad, but its not Shakespeare either. It's passable and fits well within the narrative set by the films.\n\nMy only complaint is the 'you' voices, despite being a Na'Vi your character only speaks in a solid US American accent without any nod to the normal Na'Vi accent which is largely meant to be Native American style. Now this isn't a game-play killer, but the actual accents are really not great.. the male accent sounds like a little boy, the female accent like teenage girl and the 'neutral' accent sounds distorted. It's a tiny thing really, but because of it, I would regularly feel pulled out of the game. I'm very happy to hear that the new expansion features the character So'Lek as the protagonist, he has that Native American sounding accent.\n\nThe side stories are really not very good however, sometimes you are going out to murder RDA people, sometimes you are giving marital advice to ex-RDA people - which gets very irritating fast - but there is (thankfully) a way to skip past those dialogues.\n\n[h3]Graphics:[/h3]\n\nStill monumentally good, I know of no other game that is currently doing the rounds that comes close to the fidelity and beautiful vistas you get to experience. Pandora is treated like its own character and as such the world feels ultra-real.\n\n[h3]Sounds:[/h3]\n\nBoth score and sound-fx are pulled from the movies, its spot on. There is even a number of nods in music to Aliens. Only some of the voice cast is poor but I already mentioned that above!\n\n[h3]Control:[/h3]\n\nAFoP offers one of THE best flight controls. I play the game using a PlayStation Dual-sense controller, and everything feels smooth and completely natural. The haptics and adaptive triggers are working in this title, the haptics are sensational - the adaptive triggers (as always) are too weak for my big hands so I barely notice them. There is the option to use motion sensors as well but I never got on with those. I might try them one-day :-)\n\n[h3]Overall:[/h3]\n\nI'm a big fan of the Avatar Universe and have passed that love on to my kids. The game is pure fan service but under the bonnet you have the essence of a Farcry title. It's a great addition to the whole franchise, but a little more effort on making the voice cast sound more authentic and less childlike would have made a huge difference. For me, the title is fantastic fun, and I have owned and played through the whole game on PS5 and Xbox and also PC. So I really have to highly recommend it.\n\n[h3]Score:[/h3]\n\n[b]9/10 - an imperfect title, but only just - if you love avatar - get this asap![/b]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Visually appealing... you will get lost in its environment,, flying the Ikran is so fun... i just loved it <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is a lot of hate on this game, and I can understand why someone expecting a revolutionary, transformative game would be disappointed playing this. This is nothing new, nothing that hasn't been done before, and honestly nothing that hasn't been done better elsewhere. But that doesn't stop it from being an enjoyable game if you like primitive survival open-world gameplay. \r\n\r\nThings about the game I like:\r\n* The map and environment building is very good, on par with other Ubisoft games. I honestly love just flying around and enjoying the caves, waterfalls, lakes, rivers, plains, forests, etc. There is so much animal and plant life everywhere and Pandora feels really alive\r\n* The movement mechanics are also very intuitive and satisfying, I actually like them more than any other Ubisoft game I have played\r\n* I enjoy many of the other mechanics such as crafting, taming creatures, riding your ikran, and fighting both on land and in the air. \r\n* The animal designs are really good and maintain that alien-like Pandora style\r\n* There is a photo mode with tons of editing options that help you take awesome pictures of whatever you want\r\n* Your character and ikran are very customizable, which is really great and the armor feels authentic to the Na'vi styles\r\n\r\nThings that could be improved:\r\n* The story is average, from a writing perspective. I think it actually gets better the more you immerse yourself and play through all the DLCs (which add to the main story a great deal) but base game is lacking in character building for some characters. I do think some characters are well-built, such as So'lek, Alma, and Teylan - they all have good depth. \r\n* Many characters really need more content/quests to feel complete, such as Anqa, Priya, and Alexander. Overall, most of the human characters feel lack luster and you have to headcannon most of their traits as they are written fairly shallow. I feel like this could be fixed with a DLC that really highlights the human characters and possibly explains their backstories in the RDA, which would add much needed depth.\r\n* There is not much replayability, but I don't think that is really the goal for this type of game - it takes dozens of hours to get through the game and the DLCs\r\n* There are many different types of weapons, but some feel fairly useless, like the spear-thrower or the shortbow. You can just use a longbow for 90% of the gameplay and not have any problems\r\n* The voice acting for the main character (your character) is... kinda mid? I would appreciate a couple male, female, and nonbinary options instead of just once for each. Or at least try to make the main character sound like a Na'vi and not fully human, as it breaks immersion quite a bit.\r\n\r\nOverall:\r\nI like this game, and I have never gotten bored playing it. I can see it has flaws, but I can look past them and most are fixable with more content added to the game. I think its worth the money (especially on sale).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game play: It's essentially Far Cry: Avatar.\r\nGraphics and immersion: top tier, it's underrated for how good it looks. Story is like the movie, generic colonisation, but it does a good job world building Pandora, the various Na'vi clans and has dope traversal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are an Avatar fan, this is such a treat. I do wish RDA were playable, but I understand why they didn't do it. I think its better this way since this game is really in-depth. You'd have to essentially make two separate games in some ways.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the graphics and game play it's similar to high on life, skyrim and hogwarts legacy in actual game play but is still that unique story line that ties in James Cameron's Avatar",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you love avatar and always wanted to experience being in the forest of Pandora as a Na'vi yourself this is the right game. its beautiful and so realistic. The story is amazing and really well built its like playing another avatar movie.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far this game has been very interesting with a fantastic story line to it. It has a large open world design with lots of side missions, so there is plenty to do outside of the main story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game. I just wish the battles with the RDA weren't so difficult. I have the incoming damage from RDA set to low and the damage I do (outgoing) set to high, but it doesn't seem to be helping any. Though I'm still new to the game so maybe that's part of it. I'd definitely recommend watching any walkthrough videos of any mission or side quest if you are stuck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much, the environements, npcs and the whole experience is really immersive, would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Pandora! The best thing I found while playing this game was how beautiful the animals and environments looked. Very nostalgic. <3 I haven't played in multiplayer mode. But I think I'll play with my younger brother if I get the chance. Highly recommended this game except some bugs issue. 10/9",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect for any fan of the Avatar movies! Stellar graphics, quit ethe diverse range of customisation and the openness of this world is MASSIVE! I'm still yet to discover every remaining nook and cranny of the game's map! I enjoy the combat mechanics although I've found the Ikran 'arial takedown' ability a bit finicky, but thats besides the point. Highly recomend this for anyone a fan of story-led games such as RDR, TLOU or Genishin Impact :]\r\n\r\n9.5/10 from me!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played too much here's what happen (I stand up but I break my legs because I ate junk causing me to have zero calcium in my body. I crawl to the kitchen to eat an orange buy I scream !!!AAAAAAHHH!!! as my bones break more, I don't make it to the orange and I die.    : )",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's is super fun, and the visuals are insane.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, felt like you were on pandora. The people NPCs lacked life though, IMO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's beautiful, still progressing through the story slowly but it already has a new expension coming out and i haven't been to the other 2 yet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plays like \"Horizons\" meets \"The hunter: Call of the wild\", two of my favorite games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely gorgeous, parkour a mountain or fly anywhere over awesome geography, vegetation and wildlife.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Being a Na'Vi and being connected to nature and playing at a slow, mindful pace is EVERYTHING!!!!! Ever since watching the first movie I wanted to experience this world, and it does not dissapoint! I'm off to get my Ikran, yahoo!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the open world feel. Even without the season pass, there's still a lot you can explore and discover in the main story line areas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have 300 hours on Avatar, I own every character cosmetic and every ikran cosmetic, I'm physically addicted...",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game is so much fun!! The graphics are awesome.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gorgeous graphics, the whole open world Pandora environment is just breathtaking all the different kinds of plants and species. The soundtrack, cutscenes and story are top-tier too, very immersive and cinematic. I wasn't feeling the combat at first but it gradually grew on me when I finished the whole story. Highly recommended if you are a fan of Sci-fi or Avatar movie series. \r\n\r\nAlso the DLCs [spoiler] feature a few references of Jake Sully and a quick cameo from Colonel Quaritch [/spoiler] which was really cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Review by [url=https://store.steampowered.com/curator/33369540-Abrix/]Abrix\n Gaming[/url] – 4K quality gameplay reviews and recommendations.[/b]\n\n[b]Avatar: Frontiers of Pandora – A Breathtaking Journey into the Wilds of Pandora[/b]\n\n[i]Avatar: Frontiers of Pandora[/i] is a stunning open-world adventure that fully immerses you in the vibrant, bioluminescent beauty of James Cameron’s universe. From the moment you step onto Pandora’s rich and living landscape, the sense of wonder never fades.\n\nThe world is massive and alive. Floating mountains, glowing forests, dense jungles, and sweeping plains all blend together to create one of the most visually impressive open worlds in gaming. Exploring feels incredible—soaring through the skies on your banshee, sneaking through lush undergrowth, or traversing alien terrain with fluid movement.\n\nCombat is dynamic and engaging, blending stealth, ranged combat, Na’vi gear, and powerful abilities that make every encounter feel immersive and tactical. Missions are varied and consistently fun, keeping you connected to the Na’vi culture and the struggle to protect Pandora from the RDA.\n\nThe bond with the world is one of the game’s biggest strengths. Flora reacts to your presence, wildlife moves naturally around you, and the ecosystem feels alive in a way few games achieve. Whether you’re peacefully exploring or battling for survival, your actions feel meaningful.\n\nVisually, the game is a masterpiece. The lighting, detail, and bioluminescent effects—especially at night—are breathtaking. The soundtrack supports the world perfectly, enhancing both quiet exploration and intense action with beautiful, atmospheric themes.\n\n[i]Avatar: Frontiers of Pandora[/i] is a must-play for fans of open-world adventures, visually stunning environments, and stories about nature, connection, and resistance. A gorgeous, emotional, and unforgettable journey.\n\nYou can check my gameplay video [b][url=https://www.youtube.com/playlist?list=PLxvWbrDkSJsBQQ3Ez0CiOHisdL8DW8WQA]here[/url][/b]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely incredible game with stunning visuals!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ABSOLUTE PEAK GAME (for the first bit it's walking simulator though)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing grahics and so far a great story!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally finished the main story of the game yesterday so it's time to leave a review.  First and foremost, this was made by Ubisoft so a lot of redundant, unnecessary side missions and exploration stuff to keep you playing. I try to be a completionist with games but I've come to accept that I'll truly never 100% any game made by ubisoft. \n\nGraphics are beautiful. However, this game is demanding on the PC. I did a black floor fix and it really made the graphics more beautiful. This game has crashed so much for me for no reason. Sometime it'll stutter before hand, sometimes it won't. It's very frustrating too and it will happen no matter what you're doing. This game is not worth paying full price for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good game the story is a bit conufsing but there is a story. But overall I think its a good game to play and I think that the co op is pretty good as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really impressed ! a buddy told me it was good a while back, this game has no reason to be this good coming from ubisoft, but its good, visually stuning, great mechanics, great story, really brings the Na'vi world to life. give it a chance, we need more titles like this rather than the same old AC or COD. now if we could get a open world Prince of Persia I might stop talking smack about Ubisoft",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10. I don't even care if it IS a far cry gamed re-skinned with an Avatar theme, this game is fun, the story and lore are rich, the visuals and graphics are stunning, I love this game. I would recommend this to any one who enjoys the feel of an open world game that rewards exploration. The only improvement I could honestly ask for is that I wish the guns had an ADS option as opposed to the traditional style \"zoom-in\" they use.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall game play is enjoyable and the ability to explore the Avatar universe in the same time line as the cinematic universe is a nice touch. That being said the game is somewhat buggy with some of the games mechanics being randomly disabled (found myself in the middle of a fight unable to craft any ammunition), characters you are meant to speak to in a quest don't acknowledge your presence, assets fail to spawn, and quest progress queues fail to happen. Now, none of these are constant things but they do happen but are usually resolved by exiting to the main menu and starting the game again. The game has a large number of mechanics which can be viewed as a good or a bad thing. The is weapon, ammo, and armor crafting which is somewhat standard, but there is also food crafting which isn't necessarily bad but when you need to enter the subwheel of the weapon wheel to access the  food items it becomes a finger dexterity issue.  But if you can get past those things I think you'll have a good time overall from gunning down RDA baddies to soaring through the air on your bonded Ikran Avatar: Frontiers of Pandora may be worth you're while. **at this time I have not completed the game, will update when that happens in a non spoilery way**",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game play is smooth and looks absolutely phenomenal, I love the the whole world is so immersive and alive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun exploration and love the characters and music. i run mods to make the game a little more fun for me, but i think many people will enjoy it. if you're willing to spend hours upon hours playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm running an RTX-5090 and the graphics are stunning.  It's a beautiful game.  The gameplay is fun.  Another thing i love is that it let me control the difficulty level.  i hate being stuck in a game, i'd much rather play a lower difficulty level and enjoy myself.   Good game, buy it for the graphics if nothing else, but it's fun too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're an Avatar fan like me, you're going to love this game, no question about it. It offers an unparalleled level of immersion, far beyond what one would expect from a Ubisoft IP. The world of Pandora has been realized in such incrdible detail, brought to life with truly next gen visuals and sound design; it perfectly echoes the time when the first movie hit theaters and wowed everyone with its sheer fidelity.\n\nNever have I been this consistently awestruck by a game world. It is (almost) completely open, allowing for exploration both on foot through the underbrush, as well as from the air via Ikran, delivering impossibly dense and diverse foliage in close quarters, and breathtaking vistas from above. The dynamic weather cycles breathe life into the jungles with beautiful lighting and convincing wetness effects during rain that even goes as far as tracking accumulating water on the ground. One of the highlights of this weather cycle is the wind: everything on screen moves in the breeze, every leaf swings, every tree bends, the grasses sway in waves across the horizon and even the water reacts with ripples moving to the wind's direction... it is the most dense and dynamic natural environment I have ever seen in a video game.\n\nEven outside of the visual design, the game is deliberately trying to keep the immersion up, delivering an uncommonly unique menu and UI design that, for once, does not follow the credo of 'minimalist modern' but strives to create something that fits with the world and lore of Avatar. The game is, after all, canon, and so takes care to stay within the limits of what one could reasonably expect from the franchise. \nI can't be remiss to mention the sound design as well. Massive used some seldom-seen tech in here to create a sort of ray-traced soundscape that accurately traces every sound to its source, as well as giving them realistic distance falloff and echo creation. It's mindblowing when you realize that you can follow every little squeak and chirp in the bushes and find an actual animal making the sound at the other end. This makes it possible to actually track prey in the jungle using sound cues, and capitalize on events like thunderstorms to mask your own emissions for stealth purposes. It feels like an actual evolution for sound design that hasn't happened in a long time.\n\nAs for the gameplay, 'Farcry' is a pretty apt description. Yeah you will be clearing outposts all over the map using either bow or gunplay, with emphasis on stealth, and yes it can get very same-y if you wanna do all of them. But the game quite cleverly ties these outposts into the environment quality system, having them wither and destroy large areas of the game world around them, which can only be restored by destroying the outpost. It makes you WANT to clear these camps, if not just to see the world regain its luster, then to clean the corrupted resources scattered about and unlock the health boosters that will spawn in the ruins. \nSince you play as Na'vi in this game, your abilities both in and out of combat are far beyond what your usual protagonist can do. You move extremely fast, jump incredibly high and are generally very agile, which makes for quite enjoyable gameplay as you navigate the world and dance around enemies in combat. It also provides an interesting perspective shift; as you are double the height of a normal human, every interaction with human npcs, their habitats or technology will feel somewhat alien. Having to crouch through doorways, kneel down to speak to people and effortlessly leap over their barricades really sells the illusion of being Na'vi.\n\nOf course not everything is perfect, not even close; and if I was motivated to bash this game, I could probably find a ton of flaws. I am, for example, pretty disappointed by the dialogue scenes. they are not well animated at all, especially the Na'vi characters all exhibit this semi-surprised stare and show little to no emotion outside of the few pre-recorded scenes. There's not much movement either, pretty much just the classic Bethesda-esque focus zoom. You talk to a lot of people in this game, it would've gone a long way to make these characters a bit more dynamic and emotive. And the Na'vi are not that different from humans in terms of facial anatomy, there's no reason to make them look this plain. The movies also showed us that they emote very similarly, so that's no excuse either. I will leave it at that, because for me, the positives far outweigh the negatives, and dwelling on nitpicks does this game no justice.\n\nIn conclusion, Avatar: Frontiers of Pandora is pretty much a 10/10 for any Avatar fan, for others I'd say it sits at around an 8/10. If you absolutely HATE this franchise, which seems to be quite the trend these days, then you likely won't find anything worthwhile here, unless you're really into Farcry gameplay. This is the quintessential Avatar experience in video game form, as such it lives and dies with your ability to resonate with its themes and aesthetic. But if you can manage that, it will be an unforgettable experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its Far Cry, but you are large and blue.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Potentially more review to come, but I want to rank it now on my early impressions.\n\nFar Cry on Pandora! This is what I wished Far Cry 6 would have been for me. I preordered that one, only played a number of hours, regretted it and never returned to it. I didn't even consider this one when it came out, but I'm definitely glad I picked it up now. It might be formulaic, but it is so far what I was hoping for. It also gives some Far Cry Primal vibes (a personal favorite of mine), but has guns and technology, too.  \n\nDisregard this review if I don't get a lot more hours in it, but I am currently having a blast. I love the world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is super nice and also will be nice when is gonna be 3dperson",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "beatiful game waiting for 3rd person",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "mordi ass costas demais...\r\nO UBISOIFT, 2025 UBISOFT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was really fun but it was a bit challenging",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "you are a good game ;) hope you make more games good luck XD <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun and cool",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game makes my 5090 cry.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game while waiting for far cry 7",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the customisation and story of this game",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "games fine, but when did ubisoft forget what fun was? trying to play the game with my wife and shes the world owner and i cant get skill points in her world? am i really suppose to return to my own game world just to skill up? it seems counter productive to even having a multiplayer option :/ 8/10 games fun with a friend or such but ubisoft makes shit choices",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "think Im done with Ubisoft, much like nintendo their greed is killing every product they make, the game is actually good which is a first in quite a while, but their money hungry practices harm players abilities to enjoy things fully",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "I love this game.\nThe world, the atmosphere, the movement, the Na’vi culture \nit’s one of the most beautiful and engaging open-world experiences I’ve played. \nI genuinely want to keep loving it, and I still believe it has so much potential!\nBut Ubisoft has to fix what they broke!\nCo-op has been heavily degraded since launch! Guest players can’t progress, can’t gather important resources, and can barely take part in the core systems anymore. It used to feel amazing to explore Pandora together, now it feels restricted and incomplete.\nAnd with the new “From the Ashes” DLC removing co-op entirely and forcing a preset MALE protagonist instead of letting me continue my own created Na’vi? it feels like the heart of the game is being ignored. Player choice and identity were the foundation of Avatar: Frontiers of Pandora.\n\nAnd I’m clearly not alone.\nMany players are reporting the same problems:\n\n1. Guest players can’t collect key progression items or resources anymore.\n(Steam discussions: players saying co-op progression is “effectively disabled”)\n\n2. Progress made in co-op often doesn’t transfer back into your own world.\n(Reddit threads full of people losing quest/outpost progress)\n\nA lot of players bought the game for co-op and now feel it’s broken and restricted.\n\nAnd the DLC forcing a completely different character has upset a large part of the community, especially those who care about their own Na’vi and shared story.\n\nI want to keep playing this game.\nI want to keep supporting it.\nBut these decisions hurt the experience for a lot of us who genuinely love it.\n\nPlease fix co-op.\nPlease respect the characters we created.\nPandora deserves better and so does the playerbase!",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Just finished the main game, have not done all the side quests nor the DLCs. Here's my thoughts:\n\nGood:\n- The world and the visuals. The environment and creatures of Pandora look great (which is what I enjoyed the most in the movies). The sound design and music are also good\n- Character customization. Not the best I've seen, but you can unlock a lot of options for your Na'vi and ikran without using the in-game store\n- Gameplay. Nothing amazing, but it works and sniping RDA and making things explode was always a good time\n\nBad:\n- Characters. I wasn't expecting much from an Avatar game in terms of depth of the characters, but everyone feels very tropey. Occasionally felt like the game didn't know what tone it was going for (campy and one-liner-filled or more serious)\n- Stability. Game crashed a couple of times, making me lose progress. There were also sometimes meshes missing and containers/gatherings I couldn't interact with\n- The side missions of destroying RDA sites. You've done 3 of them, you've seen it all\n- Indoor level design. Way too many times I got stuck because it was so unclear what I needed to do/where to go to progress\n\nChanges I'd like to see:\n- Skip Options. If I want to skip a minigame (hacking, memory painting), it means I'd like to skip it, not sit here pressing E every 5 seconds or watching a loading bar\n- Inventory. Just make the character inventory bigger, it feels so frustrating to need to go drop off materials. Also would more room for food",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’m genuinely shocked by how uneven this game turned out — and even more shocked that such a massive franchise was handed to Ubisoft again. While the films’ marketing keeps growing the excitement for the Avatar universe, this game does the opposite and actively pushes you away from it.\n\nI gave this game two chances.\n\nFirst time — at launch in 2023.\nI pre-ordered the full edition on Xbox, and the experience was ruined by horrible optimization: stutters, inconsistent performance, loading issues — a complete waste of money.\n\nSecond time — two years later.\nI no longer had the Xbox, but I kept seeing positive comments claiming the game was fixed, improved, and “much better optimized now.” Don’t fall for it — it’s simply not true. I bought the full edition again and stepped on the same rake.\n\nTo be fair, the opening hours are decent. The story is simple but serviceable for a casual player. It’s a typical action structure — go here, fetch this, shoot that. The visuals are beautiful, the environments look rich, and the early gameplay is enjoyable.\n\nBut the moment the game throws you into the open world, everything falls apart.\n\nThe deeper you go, the worse it gets:\n\n– bugs in animations, interactions, and world geometry\n– poorly designed terrain that makes movement feel heavy and clunky\n– Na’vi in the films move with agility and freedom; here the controls feel stiff and unnatural\n– repetitive Ubisoft-style open-world tasks\n– optimization issues that get worse the more content you reach\n\nAround the 10-hour mark, the game became a chore. More bugs, worse performance, and no payoff. I deleted it and lost my money for the second time.\n\nFor me, this is the final straw. No more Ubisoft or EA purchases. These companies rely on IP monopolies and big licenses while delivering weaker products every year. The sooner players stop supporting this approach, the sooner we’ll start getting games that actually respect their audience.\n\nConclusion:\nBeautiful on the surface, full of potential, but poorly executed. The films expand the universe and build excitement, while this game only pushes you away from it. Not recommended.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Terrible game, poorly developed. Its immersive, its beautiful, it has an interesting storyline but heres where they went wrong....I felt like I was constantly going back and forth between the same locations, because of this, I felt a lot of my time was just being wasted. Sure, theres beauty amongst the travel, but not enough beauty or action to make it enjoyable. The setting gets repetitive.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i played about an hour of this game i do enjoy ubisofts farcry series but this isnt farcry and i was hoping to dive into a game about pandora that isnt just rinse and repeat, honestly if it was more diverse id like it more, and dont get me wrong i think the game is beautiful and they did a good job on how it looks but it boils down to really poor cutscenes  and another dupe of farcry imo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why change something that wasn't broken in the first place actually enjoyed co op play now its just dead boring and have to go back on your own and play single player. defeats the object of co op play. also half of the items are so bugged like tarsu saplings some say they are not complete but you visit them and then they dont work at all. ruined the game with the update",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Ppl paying for gold and ultimate edition and still don't have the latest update included - this is so scummy and greedy from ubisoft , no wonder they are hated and no wonder ubi games are pirated. This is really disappointing from an avatar fan. I am never buying an ubi game again.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Cannot recommend the game in this state. \nI have a high end gaming laptop (rtx5070ti, 32gb ram, etc) but the game constantly freezes after 10~15 mins of gameplay, forcing me to force reboot my laptop. The memory leak also causes the entire game to break textures and sound. It is just not playable.\nObviously I updated the windows 11, graphics card, etc.\nOther heavy games like the last of us part 2, Doom the dark ages, indiana jones ran beautifully at high settings.\nPlease fix this damn memory leak, dev!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very heavy resource hog game and also 10 cutscenes at the start is very boring :c",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "An ok game once you find how to navigate it.  Great graphics and game play.  Solving puzzles are fairly easy. But, I do not recommend it. I seems to be a game filled with alot of meaningless roaming from place to place and gets boring quickly.   Some of the missions have crazy routes to traverse to try to complete.  It uses a lot of vram if you have it , but looks great at any resolution all the way down to low settings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash directions... i wanted the combat side and got aimlessly walking around try to find where my next quest was. Not fun not worth the money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game runs like absolute crap.  Why u didnt incorporate dlss frame gen is beyond me.  Refund",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of the worst games I've played to date. I've run into countless well known glitches whether in the main story (The Missing Hunter) mission or side quests (Unsung Hunter) that the devs still havent cared enough to fix. Its like the devs have never played a game before. The missions are far too long, they require a lot of walking around and searching. Too time consuming. \nThe pouches are far too small... 35?? Really, you gain supplies too fast and there's nothing to use them on or make so your bags are always full or youre wasting good supplies. Can't level up supplies. You can only get different supplies so if you find a weapon with a \"MOD\" you like youre SOL when that weapons rank becomes too low to use. \nCo-op is trash. Its not real multi-player because you cant collect anything and level up if you're in someone else's world.\nAll honesty this is exactly the low quality trash game i expect Ubisoft to release. Whoever is running there production team needs to he fired. These last couple games are trash",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i tried really hard to enjoy this game, i adore both of the movies so muh and the world of pandora, unfortunatly this game runs like garbabge. it takes multiple minutes for anything to load (makes me feel like im loading up gta5 again). within 5 minutes of game play i got stuck because a vent cover wouldnt break so i had to close and re open the game, then when i got into my first combat every time i punch the character would glitch around. i spent more time in loading screens than actually playing super disaponted.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Truthfully, Its a horrible game spent the whole time on loading screens and when i first get to control my character it gliched me into the bed complete trash 0/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not worth it choppy and glitchy af",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not including the \"From the Ashes\" expansion in the gold edition or season pass is an incredibly greedy move; I'm never buying that.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Quick summary: If this was any other theme than Avatar, I would have refunded. \n\nPositives:\n- Set in the avatar world \n- Graphis look nice \n- Added animal harvesting for tools and food \n- Large map \n\nNegatives: \n- Sloppy and repetitive dialogue from NPC's (noticed in the 1st mission) \n- Cringe story line (I believe that we will win aaahhh story) \n- On the meeting of Priya I closed my eyes in defeat (deffo a furry) \n- No diversity in NPC clothing, every office male has the same clothes as main villain \n- Good/bad characters; \n   - For some reason all the \"bad\" characters are white \n   - All the \"good\" characters are non-white or gay (literally) \n- Main avatar characters stumble over their words like subhuman discord mods with 0 social skills, UwU merchants \n- Pushing a hard \"colonisation\" narrative \n- Cannot pick to play as human, unlike the 2008 version did \n- Entangling real life political views into my fictional avatar game \n- Cannot scan for identification the woodsprites. This was an option in Avatar The game 2008\n\nThis was all noticed within the first 3 mission. Get out of my game, you sausage.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Ubisoft has completly wrecked the launching of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game itself, actually pretty good. HOWEVER, game crash after game crash after game crash. I couldn't take it anymore and deleted it. I wish i could get my refund. I dont even know what causes it, some people say the AMD driver but like who knows. utterly painful",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm a massive single player open world game fan. So far, this one really isn't doing it for me. Don't waste your money and time unless you are the biggest Avatar fan ever.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shi wont even load its talking bout some \"Reinstall your driver\" i did reinstall my driver but shi did not work",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ubi connect ruins the experience",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's only a bad copy Far Cry with blue monkeys.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'll stick with playing this on PS5. The PC port is wonky and keeps disconnecting my headphones.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "they have ruined the coop not worth  your time or money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ubisoft bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it was not working and bugging",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "fuck you ubisoft",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Пидарасы, сохранение 3 раз пропадает, с последнего сохранения Минус 4 часа геймплэя, фарма",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "👅",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games fine, but when did ubisoft forget what fun was? trying to play the game with my wife and shes the world owner and i cant get skill points in her world? am i really suppose to return to my own game world just to skill up? it seems counter productive to even having a multiplayer option :/ 8/10 games fun with a friend or such but ubisoft makes shit choices",
      "voted_up": false,
      "votes_helpful": 97
    },
    {
      "review": "To be transparent, I did ask for a refund for myself and my partner's copy of this game, but was denied because we played it for more than 2 hours.   With a game like this, where quest locations do not spawn and you have to keep relogging AND you have to get through the initial story steps before you can play co-op, only to find that it does not work so -  all those things take more than 2 HOURS to find out.   And so, here I am to say that we were extremely disappointed after all the great reviews only  to find that such basic bugs like quest locations not spawning were still a problem, and getting error message over and over when trying to play co-op.  Between these two bugs, it was unplayable for the purpose it was purchased.",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "I love this game.\nThe world, the atmosphere, the movement, the Na’vi culture \nit’s one of the most beautiful and engaging open-world experiences I’ve played. \nI genuinely want to keep loving it, and I still believe it has so much potential!\nBut Ubisoft has to fix what they broke!\nCo-op has been heavily degraded since launch! Guest players can’t progress, can’t gather important resources, and can barely take part in the core systems anymore. It used to feel amazing to explore Pandora together, now it feels restricted and incomplete.\nAnd with the new “From the Ashes” DLC removing co-op entirely and forcing a preset MALE protagonist instead of letting me continue my own created Na’vi? it feels like the heart of the game is being ignored. Player choice and identity were the foundation of Avatar: Frontiers of Pandora.\n\nAnd I’m clearly not alone.\nMany players are reporting the same problems:\n\n1. Guest players can’t collect key progression items or resources anymore.\n(Steam discussions: players saying co-op progression is “effectively disabled”)\n\n2. Progress made in co-op often doesn’t transfer back into your own world.\n(Reddit threads full of people losing quest/outpost progress)\n\nA lot of players bought the game for co-op and now feel it’s broken and restricted.\n\nAnd the DLC forcing a completely different character has upset a large part of the community, especially those who care about their own Na’vi and shared story.\n\nI want to keep playing this game.\nI want to keep supporting it.\nBut these decisions hurt the experience for a lot of us who genuinely love it.\n\nPlease fix co-op.\nPlease respect the characters we created.\nPandora deserves better and so does the playerbase!",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "think Im done with Ubisoft, much like nintendo their greed is killing every product they make, the game is actually good which is a first in quite a while, but their money hungry practices harm players abilities to enjoy things fully",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Let's see how close this game sticks to the much beloved Ubisoft formula:\n\n✅ Bloated map with relatively little to discover except the next (enemy) outpost or some crafting mats or character improvements\n✅ Mostly unlikeable, shallow and forgettable characters\n✅ Mainstory and dialogues that have been written by someone who doesn't give a fuck\n✅ Unnecessary crafting/gathering system \n✅ Feels repetitive after 2 hours already \n✅ Very limited enemy type variety with very subpar ai scripts\n✅ But, beautiful graphics and good music/sound\n\n--> The last Ubisoft games I genuinely enjoyed were Farcry 3 and AC: Origins and I should have stopped playing their mush a long time ago. Avatars: Frontiers od Pandora is just another disappointment and not worth even 15 bucks.",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "What a stupid thing to do, you buy a gold edition for the price of two games, after a while the third DLC is added as an expansion and you have to buy it separately, even though the full edition that includes the third DLC is now cheaper than the gold edition that I bought. It's a completely pig-like act and a slap in the face! I can only give the game a 1/10 rating after this.\n\nЧто за тупость, покупаешь голд издание по цене двух игр, через время третье длс добавляют как расширение и заставляют докупать отдельно, при том, что сейчас полное издание, которое включает третье длс стоит дешевле, чем голд, которое я покупал. Абсолютно свинский поступок и плевок в лицо! 1/10 максимально во что могу оценить игру после этого.",
      "voted_up": false,
      "votes_helpful": 122
    },
    {
      "review": "I'm sooo disgusted by your ingame shop. Thats all I have left to say here. Also the Idiot that was responsable for the Ikran Names should be fired. Havent seen such uncreative shit in a long time now. Even a Name Generator would have done a better Job.\n\nThe world itself is really pretty tho.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Been playing for a lil bit and I WAS loving it and it WAS running great but now, its constantly just diminishing performance with my frames dropping immensely and a number of crashes which are rendering the game unplayable. It is beyond frustrating as I enjoy the game and it was something to play with my woman however that seems untenable now. Unbelievably disappointing.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Not Worth It!\r\n\r\nI really wanted to like Avatar: Frontiers of Pandora, but it’s just not a good game. The world looks amazing, but that's about it. The gameplay is repetitive, the quests are boring, and the story is weak. Combat feels basic, and the controls are clunky. I ran into some bugs too, which just made it worse. It’s like they focused all their energy on the visuals and forgot about everything else. Save your money.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "Graphics nice, but that's it. Game didn't register where I was, what I had done. Even on the low graphics barely shows you what you need to see. Kinda nice To know there is an enemy when I get hurt. Thought it was some plant I was standing on. Since the game didn't want to continue I quit. Not much to do if the game doesn't let you",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Just finished the main game, have not done all the side quests nor the DLCs. Here's my thoughts:\n\nGood:\n- The world and the visuals. The environment and creatures of Pandora look great (which is what I enjoyed the most in the movies). The sound design and music are also good\n- Character customization. Not the best I've seen, but you can unlock a lot of options for your Na'vi and ikran without using the in-game store\n- Gameplay. Nothing amazing, but it works and sniping RDA and making things explode was always a good time\n\nBad:\n- Characters. I wasn't expecting much from an Avatar game in terms of depth of the characters, but everyone feels very tropey. Occasionally felt like the game didn't know what tone it was going for (campy and one-liner-filled or more serious)\n- Stability. Game crashed a couple of times, making me lose progress. There were also sometimes meshes missing and containers/gatherings I couldn't interact with\n- The side missions of destroying RDA sites. You've done 3 of them, you've seen it all\n- Indoor level design. Way too many times I got stuck because it was so unclear what I needed to do/where to go to progress\n\nChanges I'd like to see:\n- Skip Options. If I want to skip a minigame (hacking, memory painting), it means I'd like to skip it, not sit here pressing E every 5 seconds or watching a loading bar\n- Inventory. Just make the character inventory bigger, it feels so frustrating to need to go drop off materials. Also would more room for food",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I am a huge fan of this game, i think the potential it has is grand. my pc has the specs it needs for this game though sadly the game has been pretty much unplayable for me. i really want to give this game a shot, but its hard when the game cant keep up with itself trying to render and load everything. i find myself waiting for my quests to load in and npcs to stop glitching or even show up to its next interaction. i even run everything on the lowest settings and still cant seem to get this game to be playable. i havent been able to get past the first main prologue. im quite upset seeing that this game is so expensive and now getting dlc in the near future when this game needs serious repair.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The characters are absolutely unbearable, i'd rather play as the RDA. I don't think this game is even worth the discount, I see why it goes on sale every 2 weeks.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I’m genuinely shocked by how uneven this game turned out — and even more shocked that such a massive franchise was handed to Ubisoft again. While the films’ marketing keeps growing the excitement for the Avatar universe, this game does the opposite and actively pushes you away from it.\n\nI gave this game two chances.\n\nFirst time — at launch in 2023.\nI pre-ordered the full edition on Xbox, and the experience was ruined by horrible optimization: stutters, inconsistent performance, loading issues — a complete waste of money.\n\nSecond time — two years later.\nI no longer had the Xbox, but I kept seeing positive comments claiming the game was fixed, improved, and “much better optimized now.” Don’t fall for it — it’s simply not true. I bought the full edition again and stepped on the same rake.\n\nTo be fair, the opening hours are decent. The story is simple but serviceable for a casual player. It’s a typical action structure — go here, fetch this, shoot that. The visuals are beautiful, the environments look rich, and the early gameplay is enjoyable.\n\nBut the moment the game throws you into the open world, everything falls apart.\n\nThe deeper you go, the worse it gets:\n\n– bugs in animations, interactions, and world geometry\n– poorly designed terrain that makes movement feel heavy and clunky\n– Na’vi in the films move with agility and freedom; here the controls feel stiff and unnatural\n– repetitive Ubisoft-style open-world tasks\n– optimization issues that get worse the more content you reach\n\nAround the 10-hour mark, the game became a chore. More bugs, worse performance, and no payoff. I deleted it and lost my money for the second time.\n\nFor me, this is the final straw. No more Ubisoft or EA purchases. These companies rely on IP monopolies and big licenses while delivering weaker products every year. The sooner players stop supporting this approach, the sooner we’ll start getting games that actually respect their audience.\n\nConclusion:\nBeautiful on the surface, full of potential, but poorly executed. The films expand the universe and build excitement, while this game only pushes you away from it. Not recommended.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Man this game had so much potential. I bust out of the  compound and Pandora opens up and soon as I started to explore, massive squares of graphics start dropping out all over  the ground. I was so mad. How can a game get released this broken? Thanks Steam for the refund!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Launched it once played an hour and enjoyed it now it crashes every time I open it fix your game Ubisoft",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buy this game if you don't plan to play multiplayer.\r\nSolo play is stable around 120+ FPS, until you do co-op and that drops to 50 FPS, stutters and flickering.\r\nMakes the game completely unplayable in co-op.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you have an updated computer, with the 24H2 Windows 11 update, this game WILL NOT WORK long enough to enjoy playing it. I contacted Ubisoft and got the response to rollback my update as a work around. This windows update has been out for nearly a year, it should be fixed by now. I was really excited to play but now I don't think I ever will get the chance.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cringe dialogue that doesn't feel like something you would hear in the movies ever.\nAll the other TAP Na'Vi have accents, MC sounds American AF. I sound like a random overly enthusiastic white woman.\nIt's just Far Cry: Avatar so you know it's boring overall Ubislop.\nThe World is beautiful to look at and walk around in.\nFeels Un-optimized as hell, can't use FSR3 frame gen with DLSS? I do believe that is doable in other games? I know you can in Ratchet & Clank.\nI recommend only picking it up if you really like the Far Cry formula and or really love the world of Pandora but only on a deep sale which is what I did.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game will not load on PC after clicking icon on desktop page. just stays on some loading screen if not forced to restart PC",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Literally unplayable. I have it installed on an SSD, game keeps telling me its installed on a HDD... game stutters constantly, both music and graphics. Interacting with everything or triggering cut scenes takes a full 5 minutes. Its just not worth the money imo",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Terrible game, poorly developed. Its immersive, its beautiful, it has an interesting storyline but heres where they went wrong....I felt like I was constantly going back and forth between the same locations, because of this, I felt a lot of my time was just being wasted. Sure, theres beauty amongst the travel, but not enough beauty or action to make it enjoyable. The setting gets repetitive.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game runs great for me on high settings. \nExcept in the short time I played it crashed 5 times.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How ubisoft managment thinking: we will take mechanichs from AC. will make them worse and it will be a new product.\r\nSorry. Even with 75% off it's not worth it. Just it's not playable. I didn't like parts of valhalla, but this is absolute piece of shit.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boring and am probably too dumb to understand what the game wants from me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is Far Cry with an Avatar skin.  I should say up front that I'm not really into Avatar and I've found Far Cry to be mediocre for a while.  I only got this because it was at a deep discount so maybe that's affecting my perception, but after finishing the main campaign I wouldn't recommend it.\n\nReally the only positives I found are that it looks really good and the flight system is fun.  \n\nThe negatives are: a forced leveling system that makes enemies bullet sponges if they're 2 levels above you, making it mandatory to do sidequests/material gathering/crafting to continue the main story.  The story itself is forgettable with cartoonishly evil villains (like the movies) and the Na'vi characters are indistinguishable from each other.  I also had the occasional texture bug or crash.\n\nMaybe if you're an Avatar superfan you'll like this a lot more, but if you're not this is probably a pass.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After 24 hours of playing the game, I have a bug with FSR Frame Gen not working that I cannot fix to save my life. Reading online, its an issue they've had for over a year. Genuinely disappointed because I enjoyed my time until now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gameplay is neat, very cool to be on Pandora, but the game crashes on my RX 7900 XTX after 30-45 minutes. Every play session. Haven't been able to get to 60 minutes of continuous gameplay. Since AMD was the partner for the game.... It's hard to recommend when the partner GPU company can't play the game without crashing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun, the graphics are beautiful and the story is decent but the game is plagued with crashes, textures not loading, animations freezing and enemies stopping and teleporting around. I'm glad I grabbed the game on sale because in its current state, this game is not worth full price.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i played about an hour of this game i do enjoy ubisofts farcry series but this isnt farcry and i was hoping to dive into a game about pandora that isnt just rinse and repeat, honestly if it was more diverse id like it more, and dont get me wrong i think the game is beautiful and they did a good job on how it looks but it boils down to really poor cutscenes  and another dupe of farcry imo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Loved the game for the time I could play it, but after around 25 hours the game became unplayable. Stuttering, freezing, random CTD with zero reason or warning. Reinstalled thrice, bought another 32gb of ram just to be sure, closed all other apps. None of it mattered. Can't reliably play for more than ten minutes before it simply refuses to function further.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Beautiful and great game, HORRIFIC bugs and crashes. Running a 5060 and this game is unplayable at the moment because it crashes every time after 3 minutes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game feels so.. empty. The 1st person view with camera bobbing as you move makes me feel nauseous and overall.. I have not played a game that made me feel so \"meh\" before. I understand the mixed reviews. Definitely just for hardcore Avatar fans and even those will be very disappointed. Luckily I got it on 75% sale and too bad my refund request has been denied.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Once I got into Pandora itself, there were chunks of the ground missing textures, leaving large black swathes. Tons of texture pop in (and some textures not even loading, leaving some very jarring interiors), and animals standing around like a target dummy for my arrows. Shot an animal with my arrows while its friends all ran away, and it just stood there, then I got a pop up for a \"clean kill\", and it vanished. I tracked it down a few feet away, and attempted to harvest it, and that just gave me nothing and I was able to get my character into a harvesting animation loop with its corpse if I so chose. Immediately requested my refund after that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Already refunded. Controller support is broken. Most of playtime so far was cutscene. Sprint doesn't work. Story far was underwhelming and custom character creation is pretty basic.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "why change something that wasn't broken in the first place actually enjoyed co op play now its just dead boring and have to go back on your own and play single player. defeats the object of co op play. also half of the items are so bugged like tarsu saplings some say they are not complete but you visit them and then they dont work at all. ruined the game with the update",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Ubisoft has done it again. Multiple game breaking glitches. This current one, I cannot progress past the \"pushing back\" quest. Game breaking glitch where a cut scene wont trigger. I don't know why I keep putting myself through this pain. Ever ubisoft game is the same. Don't buy, 2 years past release and still broken. Emabarrasing...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If it's really cheap/on sale, have a good PC, are willing to customise the graphic options and play with your page file, then it's worth a go.\n\nWould give it medium,  but as the only options are positive or negative, will have to go thumbs down.\n\n+ Gorgeous graphics\n+/- There is a decent game underneath, shame about the bugs\n- Buggy\n- Buggy\n- Buggy\n- Buggy\n- Buggy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ppl paying for gold and ultimate edition and still don't have the latest update included - this is so scummy and greedy from ubisoft , no wonder they are hated and no wonder ubi games are pirated. This is really disappointing from an avatar fan. I am never buying an ubi game again.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Just like the movies - technically fine, spectacular in parts even, but entirely forgettable plot and setting. I've only played a few hours but so far nothing has grabbed me that's made me want to plough on any further, and the dialogue is so poor that I just want to skip every conversation as fast as I can. Just look through the global achievement stats - there's a reason that the drop off dramatically and it's not the difficulty curve.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "DO NOT WASTE YOUR MONEY OR TIME\n\nI wanted to like this game SO bad, but the constant crashes ruined it for me. I have just over 3 hours of \"play\" and I've barely even scratched the surface of it because of the crashes. I searched online for answers and found many people have similar issues. It's not our hardware, its fucking Ubisoft not caring enough to fix the game. After trying several supposed fixes, nothing worked. So I decided to try to get a refund, because I paid OVER $100 FOR THIS. Steam doesn't care and refused the refund. I understand I bought the game back in June and have 3 hours of play, but I don't think that should matter in this case. I will never play this game again, so that means I've essentially thrown over $100 down the toilet. Thanks Steam and Ubisoft! Very cool.\n\nDo not buy this game unless you are 100% sure it will run on your PC. Even then, I would be cautious. The game is gorgeous and I could tell I would have had a lot of fun playing it, if it actually fucking worked! It's nothing but an expensive fucking mess and waste of time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "would love to play more love the movies and everything but unfortuneately the game runs like shit on boths computers Ive tried to play on",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fairly glitchy, the plot is based on characters being extremely inept, the crafting/leveling is really rough (half copy pasted mmo style), the mini-games are fairly constant and repetitive, the ubisoft launcher and menu nonsense detracts from the game, and this single player game has adds to for a cosmetic and pay to win shop as well as the buy-in-game DLCs which make the game feel unfinished.\r\n\r\nIts a shame because the environment is beautiful like almost no other game, and the basic concept of the combat is quite nice, but unless its on sale for 70%+ off I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "An ok game once you find how to navigate it.  Great graphics and game play.  Solving puzzles are fairly easy. But, I do not recommend it. I seems to be a game filled with alot of meaningless roaming from place to place and gets boring quickly.   Some of the missions have crazy routes to traverse to try to complete.  It uses a lot of vram if you have it , but looks great at any resolution all the way down to low settings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is an issue 45% into the story, it's on the \"Hunters Hunted\" Quest. It tells you that you failed to save the wildlife, then you loop. I have verified the game several times now, however it is a fix, but you still fail the mission over and over. There are plenty of solutions for this issue, however I have only tried the one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very heavy resource hog game and also 10 cutscenes at the start is very boring :c",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trash directions... i wanted the combat side and got aimlessly walking around try to find where my next quest was. Not fun not worth the money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game runs like absolute crap.  Why u didnt incorporate dlss frame gen is beyond me.  Refund",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of the worst games I've played to date. I've run into countless well known glitches whether in the main story (The Missing Hunter) mission or side quests (Unsung Hunter) that the devs still havent cared enough to fix. Its like the devs have never played a game before. The missions are far too long, they require a lot of walking around and searching. Too time consuming. \nThe pouches are far too small... 35?? Really, you gain supplies too fast and there's nothing to use them on or make so your bags are always full or youre wasting good supplies. Can't level up supplies. You can only get different supplies so if you find a weapon with a \"MOD\" you like youre SOL when that weapons rank becomes too low to use. \nCo-op is trash. Its not real multi-player because you cant collect anything and level up if you're in someone else's world.\nAll honesty this is exactly the low quality trash game i expect Ubisoft to release. Whoever is running there production team needs to he fired. These last couple games are trash",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i tried really hard to enjoy this game, i adore both of the movies so muh and the world of pandora, unfortunatly this game runs like garbabge. it takes multiple minutes for anything to load (makes me feel like im loading up gta5 again). within 5 minutes of game play i got stuck because a vent cover wouldnt break so i had to close and re open the game, then when i got into my first combat every time i punch the character would glitch around. i spent more time in loading screens than actually playing super disaponted.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Truthfully, Its a horrible game spent the whole time on loading screens and when i first get to control my character it gliched me into the bed complete trash 0/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not worth it choppy and glitchy af",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not including the \"From the Ashes\" expansion in the gold edition or season pass is an incredibly greedy move; I'm never buying that.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Quick summary: If this was any other theme than Avatar, I would have refunded. \n\nPositives:\n- Set in the avatar world \n- Graphis look nice \n- Added animal harvesting for tools and food \n- Large map \n\nNegatives: \n- Sloppy and repetitive dialogue from NPC's (noticed in the 1st mission) \n- Cringe story line (I believe that we will win aaahhh story) \n- On the meeting of Priya I closed my eyes in defeat (deffo a furry) \n- No diversity in NPC clothing, every office male has the same clothes as main villain \n- Good/bad characters; \n   - For some reason all the \"bad\" characters are white \n   - All the \"good\" characters are non-white or gay (literally) \n- Main avatar characters stumble over their words like subhuman discord mods with 0 social skills, UwU merchants \n- Pushing a hard \"colonisation\" narrative \n- Cannot pick to play as human, unlike the 2008 version did \n- Entangling real life political views into my fictional avatar game \n- Cannot scan for identification the woodsprites. This was an option in Avatar The game 2008\n\nThis was all noticed within the first 3 mission. Get out of my game, you sausage.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Ubisoft has completly wrecked the launching of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game itself, actually pretty good. HOWEVER, game crash after game crash after game crash. I couldn't take it anymore and deleted it. I wish i could get my refund. I dont even know what causes it, some people say the AMD driver but like who knows. utterly painful",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm a massive single player open world game fan. So far, this one really isn't doing it for me. Don't waste your money and time unless you are the biggest Avatar fan ever.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shi wont even load its talking bout some \"Reinstall your driver\" i did reinstall my driver but shi did not work",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ubi connect ruins the experience",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's only a bad copy Far Cry with blue monkeys.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'll stick with playing this on PS5. The PC port is wonky and keeps disconnecting my headphones.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "they have ruined the coop not worth  your time or money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ubisoft bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it was not working and bugging",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "fuck you ubisoft",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Пидарасы, сохранение 3 раз пропадает, с последнего сохранения Минус 4 часа геймплэя, фарма",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}