{
  "positive": [
    {
      "review": "if you've never played this game, and you're looking for THE driving sim game, this is it. you don't get better than Beam, especially if you want free roam, replayability, decent graphics, mods, a career mode, the list goes on. \n\nbuy the game, there will be no regrets.",
      "voted_up": true,
      "votes_helpful": 53
    },
    {
      "review": "Only played for a little bit so far, but i'd say it's pretty good",
      "voted_up": true,
      "votes_helpful": 42
    },
    {
      "review": "BeamNG is an absolute must-have for every car lover. If you want realistic driving, off-roading, racing, a soft-body damage system, car customization and tuning, or just want to sit back and relax while driving your favorite car in an open-world map with traffic, BeamNG has it all. The variety of vehicles is incredible, ranging from everyday cars to massive trucks, and if you can’t find something you like in the vanilla game, you will most likely find it as a mod. In conclusion, BeamNG is an amazing game that offers realistic physics, endless fun, and something for every type of player. It’s absolutely worth buying.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "family go to picnic family die cuz drunk truck driver. family go to beach family die cuz of big spinning thing of death 10/10",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "I would highly recommend if you're a car person with a beefy computer.\n\nI've been playing this game for years and have watched this game go from a tech demo to what it is today. The devs really do care about this game and continue to add so many new features and gameplay elements that make driving fun and interesting. Sure, crashing is fun, but the meat is in the missions. You can do all sorts of jobs including, truck deliveries, bus routes, police chases, etc. All these things are soon coming together in the upcoming career mode that will add an economy which will allow you to purchase and maintain your car and really make it yours. The game does support mods, however I personally don't mod the game much as it is still in early access but you can definitely add mods through the in game mod repository.\n\nAs I mentioned in the top line, you do need a somewhat beefy computer to run this. I definitely recommend having a system with 32GB of ram although you should be fine with 16. The devs have been working on performance over the years and the game has shown great progress with the upcoming Vulkan API. With that being said, I would still recommend having this run on a modern PC and not a potato. (Unless you like pain I guess?)\n\nThis concludes my review. I would greatly recommend giving this a shot. The gameplay is great, mods make it even better, and the controls feel good for controller, keyboard and mouse, and of course wheel and pedals. Also, BeamMP multiplayer adds a little extra spice to the game. It's not a part of the game as it is a third party app, but it allows you to play with friends on multiplayer servers. Very fun!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "There are lots of car games in the world, but BeamNG.drive is the best one for its realistic physics simulation and driving experiences.This is my first PC game on steam,I have been watching it fantastic videos since 2019 and now I finally played it on my own. Its original cars and designs with specific features on gameplay made it unique in limitless creations like the real world. The physics engine not only works on crashes, but also on everywhere in the game.I think the most interesting thing is the combination of the big open world map and the new missions.By the time I plays it, the real sense of driving filled me up which is one of the highlights of the game.This game truly worth its price,I am glad to witness its future changes and improvements.Thanks to the developers,You made the best driving game.Looking forward to the next update and surprises coming soon.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Not bad honestly. One of these days I'll actually take the time to run through and play the game the way it's supposed to be played. Currently I just stick to 1 or 2 of the maps and run around causing chaos cause it's fun",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "One of the best games I've played in my life. The physics are just great and the maps and cars too. Updates might take a bit 2-4 Months most of the time, but when they come they deliver. And don't look at these videos you find on Tiktok or anywhere else because Beamng is more than a game where you crash your car. Youcan drive around with Trucks,Cars cars with 3 wheels Trucks with rambars, busses and much more.  and there's mod support with many many many mods. Buy it doesn't matter if it's full price it's worth every pennie.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "it is a Great sandbox racing game with just not limitations. You can do everything from a drivable toilet to driving the fastest car in the world right into an airplane that is currently taking off",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Nothing beats driving into a family of 4 in a truck with boosters and nitro best game ever made",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great sandbox to goof around. The underlying driving physics are surprisingly solid given that they aren't even the main focus of the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is not a driving or racing sim, this is a vehicle simulator.\n\nOne thing that’s amazing about BeamNG is the freedom you have to take parts off your car. It’s a lot of fun grabbing the base-model manual Covet (1.5L engine), ripping out the entire exhaust and flooring it. It’s the kind of fun no other racing or car game gives you, because most of them only want to throw hypercars at you.\n\nI also spend hours off-roading just to admire the suspension working, just pure engineering art.\n\nThe career mode is fun too, just like Euro Truck Simulator,  picking up packages and delivering them,  there's also some time attack and off-road challenges, they say that is not finished yeat but already is pretty nice.\n\nThere are also plenty of mods if you don’t like the base car models, but I recommend going for a vanilla+ experience: engine mods, suspension mods, wheel mods, to customized the base cars the game already offers as you like.\n\nIf you like cars and how they work, definitely buy it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good, nice physics.\noverall just a good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has been along time coming in every way, shape and form. What has been done to this point is nothing short of triple A. The dev's are always working towards the next project and listen to the community. The freedom within the engine of the game is amazing. You can make anything from ultra realistic real world cars or maps or port and create lore friendly or unique vehicles. I remember this game back when we had the original grid map and spending hours testing physics on the suspension! Always a 5 star game and even more deserving of the stars now! Cant wait for what's next From the dev team.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "you can hit a family of 5 with a dog and no one will say anything oh and the game has some good crash physics to i guess",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bought this game some years ago and it keeps getting better everytime i play it, amazing devs doing the best for the game, it is a must have and even a great investement as it gets better every update!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has been such a joyride. The mods, the people, everything about this game is why people like it. I  used to want it so badly, sense other friends of mine had it and it looked really good so i just went with it and got it, but i didnt realise it would be this good, it has everything in a car game you would want. Crash physics, racing, multiplayer, rallying, i mean what else couldnt this game have? Overall, i want to thank the devs for working hard on it, and i hope other acknowledge that too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "tbh i really think its the best car game because you could drive if you just want to or you could just keep crashing into stuff, it doesnt have just 1 playstyle.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Highly would recommend to others, sandbox is fun with huge amounts of mods to add but alone the cars, the physics, the gameplay i would give a soild 10/10 as you wouldn't find any realistic more than BeamNG.drive",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best car games in general a lot of people just see it as crashing simulator but its so much more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the best physics engine car destruction game,  if you want to play with friends download beamMP.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This has been that one game I've been able to play for YEARS. And when I say years, I mean YEARS. Never gotten tired of it, hopefully never will. The devs keep releasing decent updates periodicly given how long it's been out and I support that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "BeamNG.drive is easily my favorite game, and I’ve spent over 1,100 hours in it. Its vehicle physics are the most realistic I’ve ever experienced — both in driving and in crashes. The visuals are stunning and make every moment feel genuinely immersive. I’ve been following the game since 2016, and I have huge respect for the developers — they never abandoned the project and continue releasing high-quality updates that make the game even better. I do wish it had officially licensed real-world cars, but the modding community fills that gap with impressive, detailed vehicles that add even more depth. I fully recommend BeamNG.drive. I still haven’t found a driving simulator that does it better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The ultimate driving sandbox and an example of game development done right.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bestes auto spiel überhaubt. \nDu hast einfach alles, von Rennen auf der Rennstrecke bis zum Offroad fahren im matsch.\nZudem auch noch sehr reallistische physik.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Este juego es muy bueno, las fisicas, los autos, detalles en cada parte del auto\nRealmente vale la pena y tiene un gran futuro por delante",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun vehicle physics based game that also fun for crashing cars in.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "so. Don't think I have to say much about BeamNG. It's probably the game that has been in Early Access the longest ever and it's just a phenomenon. Where big publishers release games completely unfinished and sell you expensive DLC from day one, this thing has been continuously developed, updated and gets constant content additions. What started out as a kind of time waster \"crash cars into things\" simulator has slowly become one of the biggest things. It has missions and modes that I would have wanted to see in games like Expeditions, it has a rally mode that has been praised a lot because of its pretty good off road simulations. The modding community is huge and builds ridiculous things. Both in the sense of it being completely weird aswell as ridiculously good and detailed.\nTl;dr: BeamNG good!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "BeamNG.drive is one of the most distinctive and ambitious vehicle simulators ever developed. Built around an advanced soft-body physics engine, the game focuses on accurately simulating how vehicles behave and react to forces, impacts, and the environment. Unlike traditional racing titles that use simplified damage models, BeamNG attempts to bring a near-real-world level of detail to every crash, bend, and mechanical failure. This design philosophy places it in a category of its own, appealing not only to racing fans but also engineering enthusiasts, content creators, modders, and players who enjoy open-ended experimentation. From the moment you load into a map, the game communicates that it is less about competition and more about the physics-driven story you create behind the wheel.\n\nOne of BeamNG.drive’s greatest strengths is the incredibly detailed soft-body physics simulation, where every vehicle is constructed using a system of interconnected nodes and beams. This allows cars to deform, break, and react to collisions in ways that closely mirror real-world engineering. When you hit a guardrail or fly off a cliff, the resulting damage is not pre-scripted — it’s calculated in real time based on speed, angle, structural integrity, and force distribution. This means no crash ever looks the same twice, giving the game endless replayability. Even low-speed impacts feel different depending on where the car is struck, how heavy it is, and what part of the frame absorbs the energy. Few games offer this level of consistent realism, which is why BeamNG often goes viral for its crash compilation videos and stunt experiments.\n\nIn addition to its impressive physics engine, BeamNG.drive includes a surprisingly robust variety of vehicles, each with unique handling characteristics. You can find everything from compact hatchbacks and luxury sedans to semi-trucks, rock crawlers, drift cars, classic muscle, rally monsters, and even experimental prototypes. The diversity isn’t just cosmetic — each vehicle feels fundamentally different to drive. A heavy pickup truck lumbers around corners with weighty inertia, while a lightweight rally car darts quickly along gravel roads, reacting sharply to every input. There are also numerous engine, transmission, and suspension configurations available, allowing players to tailor vehicles to their preferred driving style. This variety ensures that players constantly discover new experiences even after hundreds of hours of gameplay.\n\nThe game’s environments further enhance the experience. BeamNG.drive includes a collection of large, intricately designed maps that range from sprawling cities to quiet rural towns, mountainous switchback roads, tropical islands, desert canyons, industrial testing facilities, and more. Each map feels unique, with realistic lighting, varied terrain types, and countless places to experiment. Whether you are performing high-speed highway tests, drifting around tight corners, stress-testing suspension on rocky trails, or launching vehicles off cliffs, the environments feel like real-world automotive playgrounds. These maps serve as canvases for creativity, allowing players to construct their own challenges, cinematic scenes, or physics experiments without unnecessary restrictions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is insane i can go like 200 and crash into a ai car and my car will be flat like a pancake the physics is super super realistic i recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good game would recommend to use a wheel if you have one its great sim racing here.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A game that has made cutting up traffic like an asshole, ramming into innocent family of fours because they arent going 120 in a school zone, destroying cars into every pole about, and obviously obviously spotify tunes as you drive straight into a barrier very fun. Driving setup makes game 10 times better like any driving game really feel like you have just killed someone.\n\n11/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, didnt disappoint. i highly recommend also buying Automation - The Car Company Tycoon Game, very fun to make ur own cars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Reasons why you shouldnt get BeamNG\r\n1. Potato computer\r\n2. Skill isue\r\n3. You are a boring person\r\nIf these descriptors do not aply to you, then you need to ask yourself why you dont have beamNG already.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beamng is a very good and a realistic game that's worth buying. Unlike some people think, it's very detailed and based on real car physics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this even if at first sight might be hard to play on low end computers and for a 2015 game it is really one of one, the best crash physics game ever. I recommend having a good PC if you want to run it as expected and if you don't you can use the NVIDIA GeForce now app that uses cloud gaming so for 1 hour you can play even at highest graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun to crash n stuff, exploration is also neat... but what shines for me is the customizabilty of alot of the vehicles. would recommend if ya like driving, sandboxes, simulators (and if you have a good pc my laptop hates me for getting this)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun, i liked the variety of cars the physics and the overall limitless capabilities of what to do in the game. its like a car game where you can do almost infinite stuff, like roblox almost.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is good but you definatly need a good pc, mine isn't and it runs like crap, its like i'm playing on a deadahh potato.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got my CDL license from playing this game as training for the test.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good driveing game since nascar heat 5 in my way and  you can add nascar with mods to its a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a fun car sandbox that has cool maps and cars not to mention mods to. I recommend to play this game, because how fun and realistic it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super good i highly recormend i think its free i thought if you a big car fans or car crashing fan idk this game is perfect fot you i like that they had diffrent opsion for diffren cars i didnt likr there was no licent veivhals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i had more fun in nothing else W game mods are amazing its optimalized prety goodly and the simulation is peak W 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very very good game, I can’t believe it’s not even finished just the fact that there is more to come shows how much of a great game and team beamng is, I would recommend it to anyone even if your not into driving games, the physics are amazing, i play when I can and it’s one of my favorites, playing online with friends is a + and you can download any car you want, amazing game I truly appreciate this game and no regret buying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played for a couple hours and can already feel my dads blood coursing through my veins telling me to crash into a family of five\r\n\r\n10/10 game would play again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thought I was getting on this game for crashing cars and found so much more in it! Ive only touched the surface. I found that the games driving physics and crash physics make me have to focus and not crash or its literally over. I use a logitech wheel as well! feels super good, pretty sim like. the game is fun just to download custom driving maps for, turn spotify on, traffic on and a good sounding car and go for a cruise!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the greatest vehicle game ever\r\nit runs well\r\nlooks great\r\ncars drive well\r\nmaps look great\r\nvehicles have great customization\r\nits all around just a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is pretty awesomesauce, but you need a good computer to run it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The price on this game is way too high and should not be that much especialy monthy but once you get it you'll be obsesed with it just like me. \r\n\r\nT!P: Stop Chasing your Dreams, just live em",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of few games I have fully supported through it's whole development, made by a company that really cares about the playerbase. Perfect mod integration and thrives on user-created content. Could not reccomend more, especially if you want a refreshingly realistic car experience, not just driving realism but the entire vehicle. Can be hard to run nicely with lots of cars or big maps but should be tweakable for any decent-good PC from the last 10 years. A+++ game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "beamng is genuinely the best game ive ever played, other than a few glitches or lag its genuinely the best thing to ever exist",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, lots of content, exciting, good for recreating bank robberies and specific events that happened in 2011!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "easiest game for me to hop on and mind numbingly wreck cars for an hour. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game. great graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing in every little detail - anything u can imagine u can do - launching a bus school bus full of kids 400mph into a tree . perfect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very nice destroying cars, and playing beamng is also nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a hidden gem.\nI like cars, a lot. But never found an ACTUALLY good car game. My only car game was The Crew 2 (had 200hr+ on it), and it was irrealistic, outdated, had only a few cars and i had anything to do.\nBut then i found this game on Youtube.\nIt's cheap for what you get, fully moddable, nice cars, realistic features, maps and physics.\nIf you download certain mods, and have a really good device, you will LOVE the experience.\nTotally recommend, even if you're going to play on low graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, this game is insane. the graphics are stunning, physics are unreal and I can endlessly just drive around constantly... if my pc didn't blow up :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I fell in love ever since I got it! I used to play with toy cars and try and crash them when I was little and now that I'm grown up more, I loved video games and this games quality, smoothness, and crashes are unreal. Also when you change the time of day to sunset, then it's really beautiful!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun and detailed game with realistic physics and a bunch of maps and cars.10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Best soft-body physics vehicle game ever and most likely the best vehicle game in the future.\r\nIn this game you can do a lot of things like racing, rock crawling, rally, and with mods you can be a taxi in the career or a repo trucker. It's just the beginning BeamNG can with time be the best vehicle game ever !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend the game. I would keep in mind updates take a little while to release, but other then that the game is very great. It's also fair to keep in mind that the game does take a pretty strong computer to run well so, if your within the minimum requirements you might be able to run low or medium and get decent performance but if your below it you might run into quite a bit of issues, so i would recommend looking that up online about other peoples experiences. Other then that the game in my opinion is pretty fun. You most certainly need to give it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "beamng. drive is a fun game highly recomned buying it u can preetty much do whatever u want to all the car in the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool driving game, very good physics and funny mods (380 mph on supra mod) and ye. Lots so explore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good u can isntall mods and its very easy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best physics based car game there is.\nGameplay is basic just pick a map, spawn a car and then crash it in the next wall you see with 200Km/h.\nKeyboard, Controler, Wheel all no problem game handles amazing.\nNo matter if you tune a car perfectly or dont even know what you doing at all game is a blast.\nBored of only having pretuned cars or only few tunging choices no problem at all since you can change litteraly everything.\nEngine too weak and slow ? Just change it.\nWheels not enough grip ? Just change them.\nCar too heavy ? Just rip everything off.\nWant your little VW beetle knockoff to have 1000HP and AWD ? just swap all the parts.\nAnd if you get bored just download a few mods and start building new abominations or drive your car down a cliff or take it for a lap on the Nürburgring or download the multiplayer and crash together with your friends.\n\nJust keep in mind its a Early Access so it might not run how you want it to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great car sim. \r\n\r\nGets regular updates from a small but great team\r\n\r\nI, along with many others are fully enveloped in the future of this game, as it has a feature rich and bright one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The car physics are really cool. The mod for the game are nice, there's not really anything to flashy in terms of the car mods. It also can get a little boring when you're not playing with other people, but overall I recommend it to people if they want a Gmod type experience but with cars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun and realistic game but half of the mod didnt work but the game is still really good really fun and realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome physics nice community with alot of Content, the Game gets updatet frequently and it only lacks a few more cars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jogaço bom da disgrama, o repositório de mods que ele tem é muito bom, tem vários mods desde modelos de carros até motores customizados baseados em motores da vida real e 100% modelados. O único ponto negativo pra mim, é que o jogo é bem pesado, mas isso é esperado de um jogo em que o foco dele é simular as físicas de forma satisfatória, no geral 10/10 masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so when i got the game it started to lag and trying its hard to load",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very good and the graphics are amazing. the crash physics are next level and ther eis nothing you can't do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an excellent physics sandbox that is slowly maturing into a driving sim with a TON of community support and community generated content. It's easy enough to just jump in to the current versions and smash up your vehicle for fun, or enter a pursuit mission. I think the multiplayer could use more refining but the amount of excellent work on display here is honestly enough. With enough searching you can find just about whatever car-based experience you're looking for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BeamNG.drive is a fantastic game for several reasons:\r\n\r\n1. **Realistic Physics**: The game features an advanced soft-body physics engine that simulates vehicle dynamics realistically. This means crashes and vehicle behavior feel very authentic, making it a lot of fun to experiment with different scenarios.\r\n\r\n2. **Variety of Vehicles**: BeamNG offers a wide range of vehicles, from everyday cars to unique creations. Players can customize and modify their vehicles, which adds a personal touch to the experience.\r\n\r\n3. **Open World**: The game includes various environments and maps to explore, whether you want to race, perform stunts, or just drive around. This openness allows for tons of creative gameplay options.\r\n\r\n4. **Modding Community**: The game has a thriving modding community that constantly creates new vehicles, maps, and scenarios. This keeps the game fresh and gives players plenty of new content to enjoy.\r\n\r\n5. **Crash Testing**: Many players enjoy the ability to test the limits of vehicles and see what happens during crashes. It's both entertaining and educational, as it provides insight into how vehicles are built and how they respond to impacts.\r\n\r\n6. **Realistic Damage Modeling**: The way vehicles deform and take damage in BeamNG is incredibly detailed, which adds to the immersion and realism.\r\n\r\n7. **Challenge and Creativity**: The game allows players to set their own challenges or participate in community challenges, fostering a sense of accomplishment and creativity.\r\n\r\nOverall, BeamNG.drive combines realism with fun, making it a popular choice for car enthusiasts and gamers alike!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, i've been having a fun time with it, its better with friends tough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing this on Deck in 2023 and then now playing it in 2025 is almost 10 steps forward. Full controller support even in menus, steam deck setting in graphics. Don’t know where career went but that was fun in 2023 and with all the changes could be really fun on deck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game for a self-calculated total of about 1,000 hrs over the last 8 years. As someone who doesn't have a lot of opportunity to play this is a lot of time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very realistic, love this game, best purchase of my life!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing. Lots of people see it as a crash test simulator, but it does so much more. The graphics are great, and the cars are super detailed, with fully modeled and working suspension, driveshaft, and openable doors and hood. It also has extensive tuning options. The tire physics are a bit lacking, but the dev team is working on making it better. I highly recommend this game to anyone who likes cars in any way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, fun to play, but a bit laggy so have a good pc, cant wait for the full release",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Esse jogo é tão bom que estragou todos os outros jogos que da pra dirigir carros, absolutamente the GOAT 🐐",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a gearhead I love this game, I like building out the engines and I enjoy the modding community. The integration with Automation is great and i would love to see some form of integration with Engine Simulator 3D when it comes out. The crash physics are amazing. The only downside is that you have to have a somewhat strong computer to have an enjoyable experience. Still, I 100% recommend BeamNG to anyone who likes cars, engines, racing, or you just want to drive around.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "- Spawned in a bus\r\n- Crashed it into a church\r\n- Ran over some kids\r\n- Wrecked it in a tree\r\n- Got Arrested\r\n- Repeated it again\r\n- Got Sentenced to 85 years in Maximum Prison\r\n100/10 best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best crash simulator out there and the team behind it is working hard to make it one of the best sim drivers as well very good game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not much to say here other than its a must have for people who want a realistic driving simulator with crash physics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sry i'm bouta yap alot...\n\nThis is an amazing sandbox game that has a passionate development team behind it. At the time of this review, the Devs are still delivering continuous updates and have been for a long time. It's honestly up there among some of the most fun driving games I've ever had the pleasure of playing. I'd go as far as to say this one of the most innovative realistic driving/racing games we have right now.  \n\nThere is a unique variety of different vehicles to choose from and a decent amount of different maps to explore. Every vehicle handles differently and the surfaces you drive on affect your cars grip in different ways. While you do have the ability to customize cars to your liking, I personally have not used this feature enough to comment on it extensively. From what I've used so far, I can say that it works fine and that you can change a lot of different parameters of a vehicle (from the color and texture of a car's paint job to altering the vehicles suspension). \n\nThe deformation physics and the mechanics simulation doesn't need much explaining. Without going into to much detail, I found the amount of detail packed into the vehicles to be engaging, satisfying, immersive, and most importantly, fun! It does its job VERY well in that regard. After all, BeamNG.drive is a Soft-Body physics simulator first. If you wanna destroy a vehicle so bad that it barely looks like a car (while having tons of fun doing it), BeamNG is the game for you. If you decide that you'd rather test drive a variety of vehicles and simply appreciate the details of each individual car, this games got you covered too! \n\nSome maps are larger and more detailed than others, but they all have there place in this game. Each of these maps have a number of \"missions\" or \"scenarios\" that you can do. I found most of these to be fun to complete, and just as funny to fail miserably at. Some of them are kinda easy and most of them have a good level of difficulty, but some of the missions might seem disproportionately harder than the others. This might just be a skill issue on my end tho. \n\nSidenote: Something that this game gets right that surprisingly not many games get right is the sense of speed while driving! For a soft-body physics simulator, this game has great camera work.\n\nThis is already a fairly detailed game in terms of the physics and customization, but if you find yourself looking for more, this game has integrated mod support! So even if your not comfortable with going to a external website to mod your game, there are still plenty of ways to customize your experience. I will say that this game tends to use a LOT of your PC resources, so be prepared to lower some graphics settings if you need some extra performance. Oh, and about the graphics, this is not the most graphically impressive game of all time. The game looks nice enough to where it is not a problem. For a 10 year old game, it actually looks great but don't expect hyper realistic textures or anything like that. What I will say is that the LOD pop-in is noticeable. Just like with anything else, you will likely learn to ignore it after a while, but it is there. It doesn't ruin the game by any means, but I would say it affects immersion. I hope that the developers will add an option to mitigate this LOD issue in the future.    \n\nOf course, this game is not perfect. Overall the game has become pretty stable over the years. At times, it can be a bit buggy. BeamNG.drive can become prone to stuttering, freezing, and sometimes crashing during extremely resource intensive in-game events (I'm assuming this is due to the amount of physics calculations being done at times). IMPORTAINT: Just to be VERY clear, this isn't really an issue during normal gameplay. It'll probably affect you if you crash into another car going insanely fast (usually with the help of a car mod) or if there are an extremely huge amount of collisions happening at once (also usually with the help of a mod). Of course, the more vehicles you spawn, the more resource it will take to run the game, so be careful that. Sometimes, the game will just pause itself your game to prevent an outright game crash (which can be funny sometimes). Even if your PC can handle this game just fine, depending on how crazy you get while messing around, you'll probably experience at least some stutter/freezing when pushing this game to its absolute limits. \n\n*Remember, If you do have trouble with crashing or other severe performance related issues and you happen to have mods installed, try disabling your mods to see if that fixes the problem. \n\nA common criticism of Beam currently is about the tires. The tire physics do not seem to be super accurate or detailed and the Devs know this. The good thing about this is that at the time of this review, the Devs announced some time ago that they have extensively tested and researched IRL tire behavior to create a more realistic and dynamic tire model. That is something to look forward to in the future but it is not currently in the game at the time of this review. Something else to note is that there are no built-in temporal upscaling methods in this game (DLSS 2.0+, FSR 2.0+, XESS) and the anti-aliasing options are pretty limited, so expect to see some jagged edges at lower resolutions. There is a built-in resolution scaling slider tho. Just thought I should mention this in case that fact was important to anyone reading this.  \n\nIf I had to think of one thing that disappoints me about this game is that there is currently no built in online multiplayer without utilizing mods. From the official BeamNG website: \"Online multiplayer is a common request, and we are keeping an eye on it, but has never been part of the originally promised features. It is unlikely to happen in the short term\". It's probably not happening anytime soon but I promise the game is still great as is.  \n\nAs far as singleplayer sandbox driving games go, BeamNG.drive is one of the best when it comes to having freedom over your gameplay. I'd say that this game is 100% worth getting (Especially if you have a racing wheel).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a very fun realistic car driving game but u need mods to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, easy to mod and heavly recomend using a sim wheel but still good with only keyboard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This games is good but it’s very cpu intensive and ram but overall good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good, and realistic, good crashing physics, bumping, heaps of Vehicles, 10/10 worth buying it,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game all all around lots of content active devs massive kind community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE game when you want to drive around and have fun (and consider having negative sliding friction with ai traffic, trust me you'll love it)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Released on Steam in 2015, this game just keeps getting better, consistent updates with new content, developers who actually listen to feedback and actively support the modding community, this is a must have in any car lover's library. Definitely deserves the Labor of Love award.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I crashed into a family of 4 while going 200 mph in a supercar on the highway. Then i played this game. it's fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an amazing game! There's nothing bad about it really besides the amount of RAM it takes up if you are on a laptop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best driving games on steam. The physics are amazing. the game is a little janky but totally worth putting up with the mild jank. This game is a true gem.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are many reasons why I enjoy playing this game.\nFirst of all, it is a good stress reliever to watch the cars crash into things.\nSecond, I really like the career mode because it has more realism for the times when I want to do progression.\nThird, this game just has tons you can customize and also things you can break in the game's code.\nFourth, mhm.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for those who want to do pretty much anything vehicle related. Racing, flying, offroading and super realistic mayhem. The sky is the limit for what you can do.  I personally just try different configs of vehicles while listening to an audiobook. I find it very satisfying to see how many cars a fully loaded semi truck going 70mph needs to crash into in order to stop. The recent update for controller usability and overall settings has been a great boon imo.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "there's nothing really wrong with the physics or anything, it's just that the game is broken for me i don't know if it's the same for others but there are textures missing and i didn't even do anything to the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to love this game, but literally every time I try to go under the hood and customise my experience it spits in my face. Editor crashes, broken ui, outdated features and unwrangable ai is asking for more patience than any self-respecting person has.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Constant Control Changes. \nI have over 750 hours into this game and it seems with ever update this game has they add more or rearrange controls on controller. Whenever i try playing the game after not playing for a few month a new update comes out and the first thing they require is to redo all the controls needed. RB as handbrake then, now is a drop down panel for combination functions. down on D pad for reset, no now its to look back on camera. i love this game and built my current PC around this game but nearly every update developers like to change controls that can borderline stop you in your tracks from playing the game. This update has not been the first update that it has happened and sure not the last. I have played this game for multiple years now but will not touch the game until game is out of \"early access\" and controls are final, I am  tired of changing them. This is a realize this game had been a constant work of progress and between models, maps, modes, and overall game usability has came along is amazing i cant get over the constant additions to controls.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "love this game but for the love of god fix the fact that my settings get obliterated every time it updates. ill re download all my mods ill re make all my tunes but MY SETTINGS should never be altered.9/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A game from 2015 with worse performance than a modern triple A is a true achievement\n\nIt's 10 years old and somehow manages to look like it's from 20 years ago\n\nThe UI looks and runs like absolute dogshit too\n\nIt's been in early access longer than EFT by the way",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BeamNG has very little to offer as a \"game\". The main effort put into this project is simply simulating every part of cars and the corresponding physics applied to it. Other things, such as realistic Traffic simulation etc. has so little priority that after so much years the NPC cars still are driving very unrealistically (always the same speed, always follows rules/makes no mistakes, no exceptions). There are many other aspects to why BeamNG is not a game for me, therefore i don't recommend this as a \"Game\". \r\n\r\nBut if you are searching for a pure car crash simulator this is the way to go",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cant play the game if it won't load.. reinstalled, verified files, deleted files and reverified, drivers are current. Literally nothing works on my end to fix this. Really annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Amusing tech demo but the menus are the most janky, laggy and broken thing ever.  \nSetting up keybinds is a time consuming cluster**** and things just seem to stop working out of the blue.\nDon't be fooled by the bullshots, the graphics are a genuine eyesore. Holy jaggies.\nThere are attempts at gameplay elements beyond freeroam but it's impossible to enjoy them because of the terrible UI. \nThe driving physics (different from crashing physics) are acceptable but not sim-like. There is a floatiness to them.\n\nThe devs of this game have ZERO understanding of intuitivity and any player that does will go insane wrestling with this game's lack of.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Creating new tracks is very non-intuitive / difficult / unusable. It seems there is a small set of various tracks available. In general, a disappointment.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "early access for a long time, still crashes. campaign gets barely any work done to it. other than the cool physics of crashing the car, the tire model sucks, handling feels like jello. its disappointing when their other developer can go make nuclear option, have better updates and less glitches. beamNG is a massive let down in the LONG run. its fun for a little, and only worth when its on sale 15$-20$ game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "\"เกมนี้ไม่ได้แย่ แต่ก็ไม่ได้ดีมาก มันไม่ใช่เกมของฉัน ฉันไม่ใช่พวกคลั่งไคล้รถโง่ๆ เกมนี้ทำให้ฉันเสียเงินไป 22.50 ยูโร สำหรับซิมูเลเตอร์ขับรถนี้",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Editor keeps on crashing and freezing, even after support from the Beam Ng-team....asked for refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I had better expectations, It sucks on a Sim, weird drift physics too. No speed sensation, Weird Force Feed Back...\nAll the cameras are weird.\nI want a refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☑ MS-DOS\n\n---{ Gameplay }---\n ☐ Very good\n☐  Good\n☐ It's just gameplay\n☐ Mehh\n☑ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐  Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☑ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☑ Check if you can run paint\n☐ Potato\n☐ Decent\n☐  Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐  Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☑ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☑ shit\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐  9\n☐ 10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the handling/steering sucks on every vehicle and every mod to try and fix it is actually worse.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game was fun until i hooked up my wheel, now it refuses to launch, wish i could refund this garbage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When I go to launch the game, I select a map, but it doesn't run and my mod isn't there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "be serius pls for one time. Why there is no race mode in a ....... racing driving game????? hundrets of cars, locations, colours, engines, whatever imagine, and there IS NO ONE GOD DAMN RACE MODE in there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the absolute, most utterly, ultimately disgusting game I have ever played. 0/10. ACTUALLY, -6/7 BECAUSE WHY NOT?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it wouldbe better if thr multiplayer was in the game it self instead of having to download it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i have a steering wheel and when i steer alot the wheel turns a little and is hard to turn and i search up how to fix and did everything bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to like it, but it won't launch. Screen goes blank every time. 4090 + 9800x3d",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME ALWAYS HAS PROBLEMS LIKE CONTENT FILES LOCKED AND MULTIPLE OTHER NEVER BUY THIS IT ALMOST NEVER WORKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible launching and closing experience",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "UI got ruined with the new updates, and also the controls are now ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "is this not in VR? Anyways for 25 dollars the dev should def keep up with crashes and bugs and update pleaseeeee",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad because it goes into 3 screens, so you can't play the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was convinced by a friend to get this game, i wish i can return it.. Boring af",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to love this game, but literally every time I try to go under the hood and customise my experience it spits in my face. Editor crashes, broken ui, outdated features and unwrangable ai is asking for more patience than any self-respecting person has.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dumb game takes forever to do anythng but only using 5% cpu and 20% gpu but stupid game takes 5 minutes to load in and then trying to go into the options takes another 10 minutes if youre lucky the game wont crash which it did anyway and ended up freezing up my computer. Couldnt even shut it down in task managaer it wouldnt do anything. I had to restart the computer. wtf? and still it was using minimal resources. Stupid\nIt even took 20 minutes to uninstall which only consists of deleting the folder.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "GOBBLESS ALL MY HOSSES, THIS GAYM DUZ NOT HAV GMT 8 HUNERDS. GOBBLESS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The concept is really good, it is really buggy but i do see this game getting better since its early access. as of how it is right now i would say to wait till it gets released as a full game. i wouldn't say to disregard it but keep it in your wishlist for later. The current state of it isn't that great. The cars take a good minute to load in, when starting a new map the map takes a few minutes to load in, the control keys are a bit confusing as well and don't make much sense.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What can I say about a game that's highly recommended by everyone? It's excellent, I won't deny it, but I was looking for a story mode that has a lot of room for improvement, at least for me. It's an excellent game, it's just not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I own the game for some time now. From time to time I return for a few rounds. But the time in-game gets shorter every turn: For the first few hours it is fun. But the concept gets dull, always smashing cars, idly cruising around. The challenges are mostly arcade style or rally. The buses get stuck. And the worst are the controlling elements: press the brake and the vehicle will swiftly go backwards. It is really quirky. Regret the purchase.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "feels like it gets more unstable with every update",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game crashes a lot and now won't start",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just bugged out of nowhere and cant pla ythe game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wrapped my bonnet around a tree and became a tree hugger, not on.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "optimize the game for fucks sake",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i love this game so much, good driving experience :D",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "최악이고 니 크크루삥뽕 애미다 ㅋㅋㅋㅋ",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lowk overpriced for what it is",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit game doesnt work anymore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worldest sh1t game ever",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bro the car tries to fucking drive itself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "maybe one day rally will be realistic in this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "well shitcunt major",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I LIKE THE GAME ITS JUST SO LAGGY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is to demanding",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i feel like an experienced racist",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No sex workers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horiblr game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you have to make the game to play it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too many bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "devs broke my favorite car :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "HARD TO DOWLOAD MODS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "HARD TO UNDERSTAND",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "made me pee in french",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wast of $20",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "picovina",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCK U",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "poop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "HI",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "80085",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "k",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UIBRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI BRING BACK OLD CONTROLER CONTROLS AND UI",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bnn",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "o",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "`",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "New update entirely ruins controls of the game for no reason. Ever since updating the game has been choppy and slow, there’s no way to reverse the controller mapping to the original, as well as no way to opt out.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "IDK what changed over the last two months but this game runs awful and crashes every single time I try to play. every update since I have bought this game has decreased performance.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "there's nothing really wrong with the physics or anything, it's just that the game is broken for me i don't know if it's the same for others but there are textures missing and i didn't even do anything to the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is by far my favorite game of all time but now it doesnt work. everything is dark and I cant fix it. i have updated drivers, deleted all mods and reinstalled the game many times, I even wiped all my beamng.drive files and reinstalled and nothing has worked. i will gladly change my review If someone can help me with my issue.\r\n\r\nI have a MSI Katana 15 with a 4070 and 32 gb of ram and a i7 so i doubt thats the issue",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "0.37 messed up all my controls, UI doesn't work, Changing Controls doesn't work, Controller doesn't work on the game anymore only keyboard, the new Vehicle UI is kinda bad",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "game in general is amazing but everyday i setup things more then i play as the setting are f0cked and my steering wheel setup keeps resetting",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I want to love this game, but literally every time I try to go under the hood and customise my experience it spits in my face. Editor crashes, broken ui, outdated features and unwrangable ai is asking for more patience than any self-respecting person has.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Constant Control Changes. \nI have over 750 hours into this game and it seems with ever update this game has they add more or rearrange controls on controller. Whenever i try playing the game after not playing for a few month a new update comes out and the first thing they require is to redo all the controls needed. RB as handbrake then, now is a drop down panel for combination functions. down on D pad for reset, no now its to look back on camera. i love this game and built my current PC around this game but nearly every update developers like to change controls that can borderline stop you in your tracks from playing the game. This update has not been the first update that it has happened and sure not the last. I have played this game for multiple years now but will not touch the game until game is out of \"early access\" and controls are final, I am  tired of changing them. This is a realize this game had been a constant work of progress and between models, maps, modes, and overall game usability has came along is amazing i cant get over the constant additions to controls.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "love this game but for the love of god fix the fact that my settings get obliterated every time it updates. ill re download all my mods ill re make all my tunes but MY SETTINGS should never be altered.9/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A game from 2015 with worse performance than a modern triple A is a true achievement\n\nIt's 10 years old and somehow manages to look like it's from 20 years ago\n\nThe UI looks and runs like absolute dogshit too\n\nIt's been in early access longer than EFT by the way",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BeamNG has very little to offer as a \"game\". The main effort put into this project is simply simulating every part of cars and the corresponding physics applied to it. Other things, such as realistic Traffic simulation etc. has so little priority that after so much years the NPC cars still are driving very unrealistically (always the same speed, always follows rules/makes no mistakes, no exceptions). There are many other aspects to why BeamNG is not a game for me, therefore i don't recommend this as a \"Game\". \r\n\r\nBut if you are searching for a pure car crash simulator this is the way to go",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cant play the game if it won't load.. reinstalled, verified files, deleted files and reverified, drivers are current. Literally nothing works on my end to fix this. Really annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Amusing tech demo but the menus are the most janky, laggy and broken thing ever.  \nSetting up keybinds is a time consuming cluster**** and things just seem to stop working out of the blue.\nDon't be fooled by the bullshots, the graphics are a genuine eyesore. Holy jaggies.\nThere are attempts at gameplay elements beyond freeroam but it's impossible to enjoy them because of the terrible UI. \nThe driving physics (different from crashing physics) are acceptable but not sim-like. There is a floatiness to them.\n\nThe devs of this game have ZERO understanding of intuitivity and any player that does will go insane wrestling with this game's lack of.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Creating new tracks is very non-intuitive / difficult / unusable. It seems there is a small set of various tracks available. In general, a disappointment.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "early access for a long time, still crashes. campaign gets barely any work done to it. other than the cool physics of crashing the car, the tire model sucks, handling feels like jello. its disappointing when their other developer can go make nuclear option, have better updates and less glitches. beamNG is a massive let down in the LONG run. its fun for a little, and only worth when its on sale 15$-20$ game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "\"เกมนี้ไม่ได้แย่ แต่ก็ไม่ได้ดีมาก มันไม่ใช่เกมของฉัน ฉันไม่ใช่พวกคลั่งไคล้รถโง่ๆ เกมนี้ทำให้ฉันเสียเงินไป 22.50 ยูโร สำหรับซิมูเลเตอร์ขับรถนี้",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Editor keeps on crashing and freezing, even after support from the Beam Ng-team....asked for refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I had better expectations, It sucks on a Sim, weird drift physics too. No speed sensation, Weird Force Feed Back...\nAll the cameras are weird.\nI want a refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☑ MS-DOS\n\n---{ Gameplay }---\n ☐ Very good\n☐  Good\n☐ It's just gameplay\n☐ Mehh\n☑ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐  Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☑ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☑ Check if you can run paint\n☐ Potato\n☐ Decent\n☐  Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐  Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☑ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☑ shit\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐  9\n☐ 10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the handling/steering sucks on every vehicle and every mod to try and fix it is actually worse.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game was fun until i hooked up my wheel, now it refuses to launch, wish i could refund this garbage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When I go to launch the game, I select a map, but it doesn't run and my mod isn't there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "be serius pls for one time. Why there is no race mode in a ....... racing driving game????? hundrets of cars, locations, colours, engines, whatever imagine, and there IS NO ONE GOD DAMN RACE MODE in there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the absolute, most utterly, ultimately disgusting game I have ever played. 0/10. ACTUALLY, -6/7 BECAUSE WHY NOT?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it wouldbe better if thr multiplayer was in the game it self instead of having to download it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i have a steering wheel and when i steer alot the wheel turns a little and is hard to turn and i search up how to fix and did everything bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to like it, but it won't launch. Screen goes blank every time. 4090 + 9800x3d",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME ALWAYS HAS PROBLEMS LIKE CONTENT FILES LOCKED AND MULTIPLE OTHER NEVER BUY THIS IT ALMOST NEVER WORKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible launching and closing experience",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}