{
  "positive": [
    {
      "review": "Invisible\nInvisible\nInvisible\nInvisible\nwalking by the wall\n(Shy one) the shadows will not fall\n(Shy one) is silently ignored\n(Quiet one) discouraged by the noise\n(Quiet one) living without choice\n(Quiet one) is a life without a voice\nWhen you can't even say my name\nHas the memory gone? Are you feeling numb?\nGo on, call my name\nI can't play this game, so I ask again\nWill you say my name?\nHas the memory gone? Are you feeling numb?\nOr have I become invisible?\nthe dreamers wish away\n(Hindsight) it's falling on my face\n(Highlights) the shape of my disgrace\nWhen you don't hear a word I say\nAs the talking goes, it's a one-way flow\nNo fault, no blame\nHas the memory gone? Are you feelin' numb?\nAnd have I become invisible?\nInvisible\nInvisible\nInvisible, invisible\nInvisible, invisible\nInvisible, invisible\nInvisible\nNo one hears a word they say\nHas the memory gone? Are you feelin' numb?\nNot a word they say\nBut a voiceless crowd isn't backin' down\nWhen the air turns red\nWith a loaded hesitation\nCan you say my name?\nHas the memory gone? Are you feelin' numb?\nHave we all become invisible?",
      "voted_up": true,
      "votes_helpful": 76
    },
    {
      "review": "Metal Gear Solid V: The Phantom Pain is a bizarre game to try and talk about because it sits at a particularly awkward crossroads. It is arguably one of the best games of the 2010s, taking the exploding genre of open world games and cracking it open by offering players extreme freedom in the way they tackle tightly-designed missions. This push and pull between developer intention and player choice could have easily been a tension point, but ultimately works because a player’s ability to complete a level is entirely based on their own resourcefulness and creativity. Within a player’s toolkit are nearly infinite ways to complete their mission objective, with the player only being limited by the tools they have on-hand or intrinsic objectives such as high mission rankings or a desired low kill-count. These are all great attributes and are a huge part of why MGSV is hailed today as a masterpiece. \r\n\r\nThe issue with that framing is that MGSV doesn’t exist in a vacuum. Kojima’s Metal Gear is perhaps the single most-revered game series in existence, with each one being hailed as a masterpiece of gameplay, storytelling, and technical achievement. As impressive as MGSV is, it is directly competing with its predecessors, and the comparison is not particularly flattering. As fun, slick, and rewarding as its action is, the game’s storytelling and pacing ultimately disrupt that experience in a way the game never really manages to outrun. \r\n\r\nThe game is ultimately paced to have two distinct arcs, with one being the effective “main” conflict and the second arc laying the groundwork for how MGSV connects to the rest of the Metal Gear franchise. Of these two arcs, the first is by far the most-interesting, containing 32 episodes with the majority of them containing important story content. While most of these missions are excellent, some really fall short of expectations, leading to a few duds in an otherwise excellent list. And, honestly, if you wanted to check out after Mission 31, I don’t think I would blame you. Most of the story of MGSV is, perhaps intentionally, disjointed, hazy, and dreamlike, intentionally setting up conflicts that connect to the rest of the series. These are largely presented in the form of Mother Base cutscenes, forming a clear and present disconnect between the gameplay and story that the game never manages to shake. \r\n\r\nPerhaps the game’s biggest sin is that it’s simply meandering and filled with padding. Out of the 51 missions (prologue included) present in the main game, 24, by my count, are either challenge missions with specific restrictions in-play, or are completely unrelated to the game’s story and are largely disposable. Most of these missions exist after the conclusion of the first arc; another reason the second arc manages to fall so flat. Of the 19 missions present in the second arc, 15 are of this type, leading to an abysmal 4 main story missions past Mission 31. And, of these 4, one is a partner mission and another is a repeat of a previous mission, just with extra story context added in. This is a huge part of why the back half of the game feels so empty and underwhelming: because nothing you do makes a difference. Much of this is also because the game’s actual conclusion, Mission 51, was never properly finished. There’s a lot of documentation out there online about it, and I would encourage you to check it out if you’re left wanting more after Mission 48. Based on unfinished cutscenes and concept art, it probably would have been the game’s best mission, and I doubt it would have left fans disappointed. \r\n\r\nBut even among many of these complaints, I actually have quite a few positive things to say about the game’s story and presentation. I might be alone in thinking this, but I REALLY enjoy MGSV’s codec tapes. The game has a TON of extra context and information contained in tapes players unlock as they progress through missions. Most of these are either designed to further elaborate on cryptic elements of the main game or provide historical context for the larger story, but some of them are also there just as fun side-stories that play out on Mother Base. Of these, my favorite has to be “The Hamburgers of Kazuhira Miller,” which unironically got me to really appreciate fast food burgers. If you can sit through that and not crave a Bic Mac, you are stronger than I am. That said, none of these tapes are necessary for story purposes and you can just as easily ignore them. Perhaps the most-interesting and important tapes are “The Truth” tapes found right at the end of the game. If you’re interested in what happened to the main cast of Snake Eater following MGS Ground Zeroes, they’re worth a listen. \r\n\r\nI also really enjoy how much side content the game has. The game has 157 Side-Ops, most of which are simple side-missions that can be done in the open world. Most of these showcase MGSV at their best, with specific small goals in play that players can attack in any way they want without having to worry about score or rank. There are plenty of duds in this selection, but the vast majority are pretty engaging, with missions like “Eliminate the Armored Vehicle Unit” and “Extract the Highly Skilled Soldier” taking up much of the list. As interesting as side content is in the main world, some of the most-interesting content available takes place on your iDroid. The game has a particularly engaging system of progression, where you work to grow Mother Base and even online content where you can compete to infiltrate each-others bases. I’m not personally that interested in MGSV’s online side, but it can be a huge draw for extending playtime. I know a few people that have put more hours into the game’s online content than the main game, so it’s definitely worth a look.\r\n\r\nI want to maintain that MGSV is still one of the best games of its time and absolutely worth a playthrough. But I also want to point out the game’s failures, as I don’t think it is as easy to recommend as many of its series predecessors. If the lack of a solid conclusion to its story and overall emphasis on freedom sound like potential deal-breakers for you, I’m not sure you should bother. Still, even with all its shortcomings, I think MGSV earns its title as a Metal Gear Solid game. It’s not a perfect entry, but it’s a brilliant action game that manages to brilliantly balance an intricately crafted world with deep and rewarding gameplay.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "great game, story doesn't feel as unfinished as some people make it out to be",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "I could not understand the story, but gameplay is like butter. weapons are excellent and their use is so satisfying. enemy ai is the best i have ever seen. optimization is perfect too, i play it on intel i3 and intel uhd integrated graphics.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I completed the game 100%, and even though the development was clearly cut short, it’s still an incredible experience. Venom Snake’s story is unique and keeps you engaged with everything that happens to him. The gameplay is top-notch, and Chapter 1’s story is amazing. You can feel the missing pieces in Chapter 2, but it’s fine it leaves you with that “I need more” feeling. Even in 2025, this game still holds up and is an absolute must-play.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "[h3]\"Boss, you killed a child? Amazing mission complete! That right there is why you're the best Boss. The one and only!\"[/h3]\n\nMetal Gear Solid V is a game that somehow manages to be both a deeply serious war drama and one of the most absurd sandboxes ever designed, where every stupid thing you do becomes a legend. And that contrast is exactly why it works.\n\nI already knew the franchise, and I actually tried MGSV for the first time about eight years ago. And I dropped it, probably too early. Back then, all I really absorbed were the memes and the confusing revelation that more than one Snake exists.\n\nOnly after finishing Death Stranding recently did I feel the urge to return to MGSV, and I’m glad I did.\n\n[b]Gameplay[/b]\n\nWhat makes MGSV exceptional is its sandbox design - a stealth-sandbox hybrid unlike anything I’d played before. Missions can be approached from countless angles. The game just hands you a toolbox and says: \"Figure it out\". It reminded me of Death Stranding in that sense: the joy of pure autonomy, where every victory feels earned, and every failure becomes your own story.\n\nOne of MGSV’s most brilliant achievements is how its anti-war message is expressed not just in dialogue, but directly through gameplay. Enemies adapt to your actions: kill too many, and they start wearing heavy armor and helmets. It’s a subtle, realistic reinforcement of the game’s unspoken rule: \"don’t kill unless you must.\"\n\nYet the game never forbids combat. In fact, it makes fighting so enjoyable that sometimes it’s hard not to indulge. Especially when it comes to XOF, mercenary executioners with absolutely no humanity. I took enormous satisfaction in hunting them down. I replayed the Skullface mission many times even after I’d stripped the entire base of every resource, probably committing a full-scale mercenary genocide in the process. One-man army delivering justice. And then there’s that infamous ten-minute jeep ride. I didn’t skip it the first three (?) times.\n\n[b]Story and Symbolism[/b]\n\nThe story ended up impressing me the most. I absorbed it with genuine delight. I jumped through every bizarre hoop Kojima set up to unlock secret missions and true endings, and I did it willingly.\n\nEven in its hidden content, Kojima’s symbolism shines through. For example, having to defeat Quiet seven times to bring her back. MGSV’s narrative layers reward obsession, and I was happy to indulge.\n\nBut what struck me the hardest weren’t the twists or secrets - it was the way the game occasionally drops all irony and reminds you that war isn’t spectacle, but pain you can’t dodge. There are moments when all the absurd freedom of MGSV suddenly collapses into one blunt truth: sometimes you have to do what no one else will. There’s no stealth workaround, no trick, no mercy. Just a decision so heavy it shakes even a legend.\n\nI could talk about the story for hours - but in short, it delivered some of the most memorable emotional beats.\n\n[b]Are there any downsides?[/b]\n\nThe game isn’t flawless. Some difficulty spikes - for example, the sudden encounters with the Skulls - felt unfair. The game barely prepares you for them, forcing you to improvise under pressure. Still, these moments rarely overshadow the experience as a whole.\n\n[b]The Vibe[/b]\n\nMGSV has a unique atmosphere - a blend of absurd humor, heavy seriousness, and the exhausted PTSD-soaked aura of a war veteran clinging to whatever humanity he has left.\n\nThe game is serious, but it also knows that serious faces are just masks. And sometimes it mocks that seriousness - intentionally and beautifully.\n\nIt’s a rare combination: emotional weight and mechanical freedom.\nA world where every mistake, every triumph, every random act of stupidity becomes part of Big Boss’s legend - or whoever you choose to be.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "by far the most in-depth stealth game mechanics you’ll ever experience.\nI still can’t think of a stealth game that is better in terms of raw gameplay to MGSV",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I originally played TPP on PS4 about 10 years ago, and this is the first time I’ve ever beaten an open-world game twice. I always thought open-world games lost their replayability because of their repetitive nature, but this playthrough proved something to me: if the gameplay is truly captivating, none of that matters. In terms of depth and variety, I honestly think nothing—except maybe Zelda BOTW/TOTK—comes close to what this game achieves.\n\nGameplay is everything, and this game absolutely nails it. It’s easily in my top 10 of all time purely for its gameplay. Even with the 3-minute helicopter deployments, it still has the best flow in the entire Metal Gear series, in my opinion.\n\nYou’ve all heard the usual complaints about this game:\n\t•\t“Main/Side Ops are repetitive.”\nSure, but when the gameplay is this good, even your 20th armored-unit takedown feels fresh.\n\t•\t“The story doesn’t conclude properly.”\nI actually think it fills in Venom’s arc really well. Yes, the Liquid/Mantis storyline doesn’t fully wrap up, but honestly, the MG series has always had missing pieces in its timeline—even after Kojima went full lore-dump mode in MGS4.\n\t•\t“Konami’s greed stopped Kojima from making his dream game.”\nMaybe, maybe not—but Kojima was already losing passion for Metal Gear, and we’ve all seen how the Sony–Kojima partnership went. Spoiler: Death Stranding is a much more deeply flawed game compared to this masterpiece.\n\nThe music is incredible, the graphics still hold up, it runs beautifully on the Steam Deck, and somehow the online servers are still alive after 10 years.\n\n9.5/10",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Possibly the greatest stealth game ever created.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolute cinema. \r\nFor being ten years old, the visuals and mechanics of the game hold up incredibly well. MGSV was the only Metal Gear Solid game I have played besides the original Metal Gear Solid, and since playing I wanted to experience more of the franchise. I suggest starting with MGSV Ground Zeroes and TPP if you're new to Metal Gear. The visuals, gameplay, and story are all a 10/10. The soundtrack is masterfully done, although it feels like a song closely associated with MGSV was never actually present. One could say it was... invisible.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it is a good game for those who love stealth and action, but the story repeats after a while, if you are lifeless, I am sure you will love this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fantastic stealth action sandbox where you can become truly invisible. When it's over you'll feel numb like your memory has gone. It'll be like you can't even say it's name.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great standalone game that really sucks as a metal gear game, don't expect a good story, expect to just have fun and you will have a great time, I promise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Сначала похищать и пытать людей, чтобы они вступили в твоё чвк доставляет удовольствие, а потом приедается. Слишком много повторяющихся миссий и локаций, хоть и арсенал большой. Система алерта и рапида к середине игры утомляет, потому что зачастую тогда надо либо вычищать локацию, не щадя никого, либо ждать пока кп отдаст приказ расслабиться. Как по мне, лучше было бы убрать рапид и сделать систему тревоги другой. Ещё Снейк видимо от судорог не оправился и кидает гранаты сильно дальше того, куда целился. Геймплейно игра топ, а сюжет в целом норм, но в самой игре его мало. Надо аудиокниги слушать, пока спасаешь очередного бедолагу со статами E, пока рандомный чел у фонаря имеет статы выше самого Снейка. Во второй главе сюжетных миссий мало, но их надо добывать через сайды и аудиокассеты, испытывая фантомные боли от одинаковости.\nА последняя миссия с квайт и танками это миссия с самым антивоенным посылом. После нее невозможно смотреть на бронетехнику без отвращения и страха ваншота. Но даже так игра это реально игра",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very different, compared to the other metal gear games. I still 100%eccomend any action/stealth fans play this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay vise this is the best mgs game, but i dont like it the fact that the game hasnt been finished. Its story is not as good as the other mgs games, but it isnt bad. I reccomend this game for everyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "used to always watch videos on this game when I was younger and being able to play it was a blast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am a big Metal Gear Solid fan and at first I did not enjoy this game. I found it very different from the other MGS installments. But when you look back at previous games, they are all different, and have their own mechanics and playstyle. For me this is the best MGS game to play when I want to sit back and chill. Do I recommend this game? I sure do, am I 10 years too late to leave a review? Nah, \"I just kept you waiting, huh?\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down THE BEST open world \"shooting\" game. You can complete missions however you want, either by sneaking around quietly or going in guns blazing!! The customization options are endless too. One of my favorite games of ALL TIME!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. Really hope they make another with a similar structure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is still peak for achievement hunters \r\ngot it platted on Playstation and now on my way and close to getting all achievement .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Works very well on Linux. Gameplay good to great. Story unique Kojima mix of pretencious, dumb and sometimes interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A natural evolution from the Peace Walker gameplay loop. It's got a pretty good story, yet unfortunately not complete to the full vision, with a stellar gameplay loop that will actually keep you coming back for more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is gud, ain't got the signature 1 to 2 hour cutscenes but very gud nonetheless. For those that feel they will miss out on lore and you're just starting out, spend most of the time listening to cassettes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] 10/10 Masterpiece [/h1]\nThis game plays well - the movement, shooting and stealth mechanics are really fluid.\n[spoiler] I love the 8 minute monologue by Skull Face in the back of the car [/spoiler].",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's honestly more than peak. In fact, I have no words to describe how fond I actually am of this, and \"peak\" isn't doing it justice in the slightest. So even if I know it's not enough, I hope my admiration makes up for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "People will tell you, its unfinished or even a bad game. but don't listen to them because they never played through it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ending was genuine dogshit but literally everything else was peak story/gameplay/graphics/stuff (except PERFECT STEALTH and EXTREME battles. Fuck PERFECT STEALTH and EXTREME battles).\r\n\r\nPlay the other games BEFORE this one - at least Snake Eater, Peace Walker and Ground Zeroes, or you won't get like 96% of the shit going on. It [i]is[/i] the 8th mainline entry after all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the first MGS I played, and althought the story can sometimes be a bit hard to follow if you haven't played the other games, it's still a great game that gives the player a lot of freedom of playstyle and customisation. Otherwise the gameplay is fun and the AIs don't feel too dumb. My only complains are that it takes forever to develop certain equipments and that some achivements get pretty repetitive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The absolute best metal gear experience in the franchise. With intresting story telling and smooth gameplay, this makes it one of the greatest open world stealth games. Even if you haven't played the earlier titles, you don't really need to. This game is a perfect 10/10 and i always have a good time coming back to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Metal Gear Solid V was one of my most anticipated games ever. I loved MGS4 and I was ready for whatever Kojima cooked up next. And honestly, the first act really is a masterpiece. The game looks amazing, Snake moves better than he ever has, and the amount of freedom you get in every mission is wild. There is no single right way to do anything. It feels like the possibilities never run out.\r\n\r\nPerformance on the Steam Deck is unreal. I have almost everything on high and it runs smooth as can be without any tweaks. Can we please go back to the days when games looked great and still ran on almost anything?\r\n\r\nNow the big talking point. Act 2. Act 1 had variety, progression, and big story beats. Act 2 feels like the point where development issues caught up. Missions get recycled and the big story moments are squeezed in between. It’s just a really sharp shift in quality.\r\n\r\nEven with that, I still put over 100 hours into it because I honestly loved it. I just wish we could have seen the complete vision, especially since there are concepts floating around for Act 3. Still, this is absolutely worth playing and it runs great on the Deck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game hate the complicate lore but great detail of whatever i could understand of the lore. absolute cinema Hideo Kojima",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just try to abuse this game's gameplay and you will see how fun it is, because AI is learning and preparing to your style.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "another kojima classic\n\ngames items are way too expensive to research in order to unlock all the fun toys in just one casual playthrough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game, though it can be challenging if you don't know what your doing.\nBut that's a bit of a skill issue.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a bad Metal Gear Game, but a bad Metal Gear Game is still an amazing game. Above all else there is so much creativity in this game. That's about it, see yah.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Invisible\r\nInvisible\r\nInvisible\r\nInvisible\r\nwalking by the wall\r\n(Shy one) the shadows will not fall\r\n(Shy one) is silently ignored\r\n(Quiet one) discouraged by the noise\r\n(Quiet one) living without choice\r\n(Quiet one) is a life without a voice\r\nWhen you can't even say my name\r\nHas the memory gone? Are you feeling numb?\r\nGo on, call my name\r\nI can't play this game, so I ask again\r\nWill you say my name?\r\nHas the memory gone? Are you feeling numb?\r\nOr have I become invisible?\r\nthe dreamers wish away\r\n(Hindsight) it's falling on my face\r\n(Highlights) the shape of my disgrace\r\nWhen you don't hear a word I say\r\nAs the talking goes, it's a one-way flow\r\nNo fault, no blame\r\nHas the memory gone? Are you feelin' numb?\r\nAnd have I become invisible?\r\nInvisible\r\nInvisible\r\nInvisible, invisible\r\nInvisible, invisible\r\nInvisible, invisible\r\nInvisible\r\nNo one hears a word they say\r\nHas the memory gone? Are you feelin' numb?\r\nNot a word they say\r\nBut a voiceless crowd isn't backin' down\r\nWhen the air turns red\r\nWith a loaded hesitation\r\nCan you say my name?\r\nHas the memory gone? Are you feelin' numb?\r\nHave we all become invisible?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game took longer than 45 minutes\n\nThere are also more side missions\n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first metal gear game, and boy what a ride, this is no less than a fuckng cinema- yes the one with martin scorcese rwith hands on the air. The gameplay, The characters, The soundtrack, the missions and dialogues and mainly the PLOT, My man kojima even quoted Neitzche here. I hope it was completed but still it would be one of my TOP 5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly such a good game overall. Great gameplay and still holds up to this day. Kojima was on something while making this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is awesome. I could just spend hours going around the map fultoning people but it also has something that I hate. Waiting real time hours to get upgrades... and it has to be with the game open... why... not going to lie. 2 or 3 hours of my time was with the game opened just waiting for upgrades...\r\n\r\nThe game itself is great and I love it, but at least for me, it clearly gets worse after the first chapter. The game starts to drag itself to the end. I felt that less time passed during the first 40 hours than during the last 17. Also, the game forces you to do side quests to allow you continue with the main story, just because it wants to give you the sensation that time advances??? I don't even know.. Then I cried with Quiet ending and.... the game ended.\r\n\r\nThis may sound like a negative review. Is not. I love this game, I love the gameplay and I love quiet and D-Dog but the game has very obvious flaws.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My PC cant play delta so I settled for this MASTERPIECE, A real jump in tone from the other somewhat comedic mgs games but its great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An Absolute Stealth Masterpiece with Lore That Bites Back\r\n\r\nHours Played: 30\r\nRating: 10/10 (Highly Recommended)\r\n\r\nIf you're looking for the ultimate evolution of the stealth-action genre, look no further than Metal Gear Solid V: The Phantom Pain (MGSV TPP). I’ve sunk countless hours into this game, and it remains one of the most rewarding and purely fun experiences on Steam.\r\n\r\nGameplay: Freedom, Funk, and Fulton\r\n\r\nAt its core, MGSV is an awesome stealth action 3rd person shooter, but the level of player freedom it offers is unmatched. The open-world environment is a sandbox where every mission is a puzzle with infinite solutions. Do you go in during the day with sniper support? Or infiltrate at night using only CQC and silenced weapons? The choice is yours, and the moment-to-moment gameplay—crawling through the dirt, tagging enemies, and pulling off the perfect extraction—is incredibly polished and satisfying. Plus, who doesn't love attaching a balloon to a sleepy goat and sending it up to space? The base-building and recruitment systems are addictive and give a real sense of growth and consequence to your actions.\r\n\r\nStory & Lore: Crazy, Wild, and Essential\r\n\r\nFor series veterans and newcomers alike, the story here is a triumph. The lore is crazy and wild in the best ways. Hideo Kojima takes classic Metal Gear themes of war, identity, and loyalty and cranks them up to 11. The narrative is often complex, sometimes confusing, and always deeply rewarding. It features some of the most memorable characters and jaw-dropping twists you’ll find in gaming. Don't worry if you haven't played the previous games—you'll still enjoy the ride, but if you do some reading, the sheer scale of the Metal Gear universe is intoxicating.\r\n\r\nThe Verdict\r\n\r\nIf you are looking for a game with rock-solid third-person shooting, unparalleled tactical stealth, and a truly unforgettable story, then this is the game to get. It's a technical marvel, a mechanical masterpiece, and a truly essential piece of gaming history.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a very fun game, I would recommend playing through the whole game first before modding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started playing it a couple of months ago always wanted to play it but i was busy with work and other games, definitely recommended it has a good gameplay for welcoming new players, i can see old players probably getting bored at the early missions but it does pick up, Kojima is great at introducing mechanics slowly as you progress the game and also never fully explain you how they work, gets addictive and missions will take few attempts to complete them 100% side ops are nice side mission to get upgrades and troops, history wise even if it feels irrelevant on the overall history of Metal Gear (because it finished on MGS4) still is nice to see things play out and probably my biggest critic is that you have to play \"Peace Maker\" to understand it fully because is a direct sequel (with ground zero included) , I'm actually impress of how bug of a Game is since is a PS3 game but probably is not rare since the Witcher 3 was also a PS game, still it doesn't feels dated actually with some tweaks could be today's Game.\r\n\r\nPD: i haven't finish it yet but since i have 145 hours in and having a good time i making this review, will edit it if needed for better or worst.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved this game...I tried to buy again this time on steam but the ratios are all messed up i hope they fix it so i can play again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "did NOT expect this to be fluoride simulator. best game in the world. u guys dont get it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah, the story isn't great, but the gameplay is still the best Metal Gear has ever had.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game,phenomenal and incredibly fun gameplay,it's easily my 2nd favorite game of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a treasure and the standard for what fun action games should be. one of my few 10/10 games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love starting major game series by jumping straight into the latest chronological game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Booting up this game i didnt expect it to be this… alr i quit reviewing heres the lyrics of invisible\n\nInvisible\nInvisible\nInvisible\nInvisible\nwalking by the wall\n(Shy one) the shadows will not fall\n(Shy one) is silently ignored\n(Quiet one) discouraged by the noise\n(Quiet one) living without choice\n(Quiet one) is a life without a voice\nWhen you can't even say my name\nHas the memory gone? Are you feeling numb?\nGo on, call my name\nI can't play this game, so I ask again\nWill you say my name?\nHas the memory gone? Are you feeling numb?\nOr have I become invisible?\nthe dreamers wish away\n(Hindsight) it's falling on my face\n(Highlights) the shape of my disgrace\nWhen you don't hear a word I say\nAs the talking goes, it's a one-way flow\nNo fault, no blame\nHas the memory gone? Are you feelin' numb?\nAnd have I become invisible?\nInvisible\nInvisible\nInvisible, invisible\nInvisible, invisible\nInvisible, invisible\nInvisible\nNo one hears a word they say\nHas the memory gone? Are you feelin' numb?\nNot a word they say\nBut a voiceless crowd isn't backin' down\nWhen the air turns red\nWith a loaded hesitation\nCan you say my name?\nHas the memory gone? Are you feelin' numb?\nHave we all become invisible?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The stealth is pretty good. \r\nStory is fine, it feels under cooked and not finished. \r\n50 hours of campaign\r\nA lot of extra stuff to do, fun to mess around.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing sandbox gameplay for a great value. I recommend installing infinite heaven and tweaking values to increase difficulty like enemy sight and hearing distance, lowering your health, increasing fov, and going in with nothing, OSP for missions. It was very fun for me. It is unfortunate that the story took a bit of a backseat, lacking the crazy long cutscenes like in 4 and instead opting for letting the player learn more lore from the audio tapes, but thanks to that shift we got fun gameplay that flows really well in an open world. Love the research and base building mechanic, it was my favorite part of peace walker. It is crazy how good the game looks and plays, and how optimized it is, this game was truly ahead of its time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is highkey goated definitely the best MGS game in terms of combat and stealth, and just a really good open world game, the story does get a little iffy in the 2nd act but you gotta focus on the gameplay trust",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loveeeed this game so much. Already played this game for 67 hours and i still didnt complete this game. So many side quest, so many activities you can do so you'll get distracted from main mission. The graphic is still really great even in 2025, and what's most surprising is you even can run this game on intel HD series smoothly. The game give you many ways to complete the mission from stealth no kill to run n gun. Of course game give you highest reward if you  complete the mission using stealth. The story is unique but engaging (thanks Kojima). Overall, if you want to experience to become spy or agent like ethan hunt, this game is for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so metal that when you play it, the rest of the world becomes invisible. The solid mechanics grind my mind's gears and make me feel like a snake slithering through a liquid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game with a good story. The gameplay is very fun especially in the first half as you can be very creative when approaching tasks. Near the end it became annoying to unlock missions, and the last mission was just a repeat of the prolouge, which seemed pointless and boring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty addicted thus far, different experience with way metal gear is usually done with it being more open world and crawling etc. That being said, been taking my time and really enjoying this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one armed gay boy gets sloppy from a cute revolver wielding ocelot he then comes across a wolf which is mistaken as a dog, he kicks it many times... wolf become big, wolf gets the peanut butter treatment. dog and robofag get harrassed by autistic girl who won't stop trying to smash \"lil big boss big\". boss kill autistic wench and saves the world from a floating redhead boy  w/ seczy feet yummy! my white boy wannabe black superstar son turns out to be adopted and breaks my shit.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"THE PHANTOM PEAK\" as many people said, now after completing only 15% of the game and playing for 53 hours ;I totally agree. I like the gameplay, the story, the characters, I LIKE EVERYTHING ABOUT THIS GAME!🔥",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You really need to play the previous games for this one, otherwise I suppose you're only going to understand like 10% of the real story and miss all the call-backs (of which there are a ton). Definitely listen to the audio tapes as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "small batallion of untrained child soldiers vs brain damage war veteran with experimental mecha\nwho wins",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I won't scatter your sorrow to the heartless sea. I will always be with you. Plant your roots in me. I won't see you end as ashes. You're all diamonds. We'll make diamonds from their ashes, take them into battle with us. We are Diamond Dogs.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "game good. fob evil. dog good, woman mid not quiet enough, horse has only one horsepower so meh, mecha dude? did not use him. the weapon to surpass gear metal? is Solid spide. why? one sad note mi hand is gone i cant jork the Solid Snake",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having your own private army that can run riot in Afghanistan is pretty cool. Well, more like a one-man army.\n\nI don't understand why it absolutely had to have an open world. It doesn't really stand out like Metal Gear Solid 1 and 3. I think it's a shame that Snake is so silent. Maybe the player should be able to input their own thoughts? Well, at least someone's pissing themselves again. There are some good ideas, but somehow it feels like Metal Gear had to be made. With current standards. \n\nSure, it's cool to shoot down enemies in the dark with a silencer rifle while \"Take on Me\" plays on cassette, but something's missing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hey, if anyone finds a ball or a sphere of any kind in this game could you please let me know? Thanks in advance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "New to the series, saw a friend ballooning tanks and people into the sky and wanted to do the same. I wasn't prepared for the fire demon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "came back to this after playing MGS Delta. Delta made the right call adding in ultrawide. Mods are available for MGS:PP for ultrawide",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Won't Scatter Your Sorrow To The Heartless Sea. I Will Always Be With You.\nDon't stop playing until you find the casette for Duran Duran's \"invisble\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You could say I've... made another Snake.\nI'm not talking about the children. A mental copy. His phantom, if you like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the greatest ever made, and it's not even finished",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "NO ONE HEARS A WORD...... THEY SAY....... HAS THE MEMORY GONE ARE YOU FEELING NUMB NOT A WORD....... THEY SAY",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "100% achievements, 100% content in-game, 169hs of fun.\r\nEnough said",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Invisible\nInvisible\nInvisible\nInvisible\nwalking by the wall\n(Shy one) the shadows will not fall\n(Shy one) is silently ignored\n(Quiet one) discouraged by the noise\n(Quiet one) living without choice\n(Quiet one) is a life without a voice\nWhen you can't even say my name\nHas the memory gone? Are you feeling numb?\nGo on, call my name\nI can't play this game, so I ask again\nWill you say my name?\nHas the memory gone? Are you feeling numb?\nOr have I become invisible?\nthe dreamers wish away\n(Hindsight) it's falling on my face\n(Highlights) the shape of my disgrace\nWhen you don't hear a word I say\nAs the talking goes, it's a one-way flow\nNo fault, no blame\nHas the memory gone? Are you feelin' numb?\nAnd have I become invisible?\nInvisible\nInvisible\nInvisible, invisible\nInvisible, invisible\nInvisible, invisible\nInvisible\nNo one hears a word they say\nHas the memory gone? Are you feelin' numb?\nNot a word they say\nBut a voiceless crowd isn't backin' down\nWhen the air turns red\nWith a loaded hesitation\nCan you say my name?\nHas the memory gone? Are you feelin' numb?\nHave we all become invisible?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Invisible\nInvisible\nInvisible\nInvisible\nwalking by the wall\n(Shy one) the shadows will not fall\n(Shy one) is silently ignored\n(Quiet one) discouraged by the noise\n(Quiet one) living without choice\n(Quiet one) is a life without a voice\nWhen you can't even say my name\nHas the memory gone? Are you feeling numb?\nGo on, call my name\nI can't play this game, so I ask again\nWill you say my name?\nHas the memory gone? Are you feeling numb?\nOr have I become invisible?\nthe dreamers wish away\n(Hindsight) it's falling on my face\n(Highlights) the shape of my disgrace\nWhen you don't hear a word I say\nAs the talking goes, it's a one-way flow\nNo fault, no blame\nHas the memory gone? Are you feelin' numb?\nAnd have I become invisible?\nInvisible\nInvisible\nInvisible, invisible\nInvisible, invisible\nInvisible, invisible\nInvisible\nNo one hears a word they say\nHas the memory gone? Are you feelin' numb?\nNot a word they say\nBut a voiceless crowd isn't backin' down\nWhen the air turns red\nWith a loaded hesitation\nCan you say my name?\nHas the memory gone? Are you feelin' numb?\nHave we all become invisible?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Invisible\nInvisible\nInvisible\nInvisible\nwalking by the wall\n(Shy one) the shadows will not fall\n(Shy one) is silently ignored\n(Quiet one) discouraged by the noise\n(Quiet one) living without choice\n(Quiet one) is a life without a voice\nWhen you can't even say my name\nHas the memory gone? Are you feeling numb?\nGo on, call my name\nI can't play this game, so I ask again\nWill you say my name?\nHas the memory gone? Are you feeling numb?\nOr have I become invisible?\nthe dreamers wish away\n(Hindsight) it's falling on my face\n(Highlights) the shape of my disgrace\nWhen you don't hear a word I say\nAs the talking goes, it's a one-way flow\nNo fault, no blame\nHas the memory gone? Are you feelin' numb?\nAnd have I become invisible?\nInvisible\nInvisible\nInvisible, invisible\nInvisible, invisible\nInvisible, invisible\nInvisible\nNo one hears a word they say\nHas the memory gone? Are you feelin' numb?\nNot a word they say\nBut a voiceless crowd isn't backin' down\nWhen the air turns red\nWith a loaded hesitation\nCan you say my name?\nHas the memory gone? Are you feelin' numb?\nHave we all become invisible?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my hours/achievements didn't sync properly years ago but trust me when i say i've put well over 150 hours into this bad boy\nKINO, ABSOLUTE CINEMA, FEET AND BOOBA (joost boost)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games of all time. And still looks and feels of age even in 2025.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story is a bit more sparse than previous Metal Gear entries, and cutscenes are very few and far between. it can feel disjointed due to having to rely on listening to the cassette tapes to fill in the blanks. the cassette tapes work out in a way - you can listen to them in the background while doing side ops, which is a good mechanic\r\n\r\nthere are a lot of 'filler' missions in the main story as well, copies of previous missions except with certain restrictions in place to make them harder. there is no new story or anything within these missions, they are placed in the storyline category purely to force you to spend time before continuing the actual story. which is pretty painful if you've already spent a lot of time doing side ops for fun. story is good, but you do have to suffer through some filler here and there before proceeding\r\n\r\nnot my preferred format for mgs but the on-map gameplay very flexible, fluid, and intuitive. overall it's a pretty fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Flawless stealth gameplay.  Extremely unfinished story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is complicated to review. It is like a sandbox, open world kinda game. You have so many variations how you could do a mission. This is nice and works well, but even for 2015 the animations are outdated. No real ragdoll physics, driving feels clunky as hell and the story is confusing. Has three chapters, I finished just Chapter 1 and I already played 62 hours. \r\n\r\nIf you have a lot of time, you will have fun with this game, but if you are searching for a good, well paced story then this game is not for you. I cannot even fully recommend it. \r\n\r\nBeware: Chapter 2 are just the same missions as chapter one, but more complicated.\r\n\r\nSo yeah. I will give a 7 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Invisible\r\nInvisible\r\nInvisible\r\nInvisible\r\n\r\n(Shy one) walking by the wall\r\n(Shy one) the shadows will not fall\r\n(Shy one) is silently ignored\r\n(Quiet one) discouraged by the noise\r\n(Quiet one) living without choice\r\n(Quiet one) is a life without a voice\r\n\r\nWhen you can't even say my name\r\nHas the memory gone? Are you feeling numb?\r\nGo on, call my name\r\nI can't play this game, so I ask again\r\nWill you say my name?\r\nHas the memory gone? Are you feeling numb?\r\nOr have I become invisible?\r\n\r\n(Skylight) the dreamers wish away\r\n(Hindsight) it's falling on my face\r\n(Highlights) the shape of my disgrace\r\n\r\nWhen you don't hear a word I say\r\nAs the talking goes, it's a one-way flow\r\nNo fault, no blame\r\nHas the memory gone? Are you feelin' numb?\r\nAnd have I become invisible?\r\n\r\nInvisible\r\nInvisible\r\nInvisible, invisible\r\nInvisible, invisible\r\nInvisible, invisible\r\nInvisible\r\n\r\nNo one hears a word they say\r\nHas the memory gone? Are you feelin' numb?\r\nNot a word they say\r\nBut a voiceless crowd isn't backin' down\r\nWhen the air turns red\r\nWith a loaded hesitation\r\nCan you say my name?\r\nHas the memory gone? Are you feelin' numb?\r\nHave we all become invisible?\r\n\r\n- I'm big boss and you are too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not gonna sugar coat it. As unfinished as this is, it's still one of the best titles ever made, a decade later. And will be for a few more decades, I'm sure of it. \r\n\r\nCrazy that we had this AND Witcher 3 AND Bloodborne in the same year, when you think about it. Feels like 2015 was the best year in gaming.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "guns go pew pew, quiet go boing boing, but boss no can jump, so sad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah this Metal Gear is pretty solid, huh... Also\r\n\r\nInvisible\r\nInvisible\r\nInvisible\r\nInvisible\r\nwalking by the wall\r\n(Shy one) the shadows will not fall\r\n(Shy one) is silently ignored\r\n(Quiet one) discouraged by the noise\r\n(Quiet one) living without choice\r\n(Quiet one) is a life without a voice\r\nWhen you can't even say my name\r\nHas the memory gone? Are you feeling numb?\r\nGo on, call my name\r\nI can't play this game, so I ask again\r\nWill you say my name?\r\nHas the memory gone? Are you feeling numb?\r\nOr have I become invisible?\r\nthe dreamers wish away\r\n(Hindsight) it's falling on my face\r\n(Highlights) the shape of my disgrace\r\nWhen you don't hear a word I say\r\nAs the talking goes, it's a one-way flow\r\nNo fault, no blame\r\nHas the memory gone? Are you feelin' numb?\r\nAnd have I become invisible?\r\nInvisible\r\nInvisible\r\nInvisible, invisible\r\nInvisible, invisible\r\nInvisible, invisible\r\nInvisible\r\nNo one hears a word they say\r\nHas the memory gone? Are you feelin' numb?\r\nNot a word they say\r\nBut a voiceless crowd isn't backin' down\r\nWhen the air turns red\r\nWith a loaded hesitation\r\nCan you say my name?\r\nHas the memory gone? Are you feelin' numb?\r\nHave we all become invisible?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(Invisible)\r\n(Invisible)\r\n(Invisible)\r\n(Invisible)\r\n\r\n(Shy one) Walking by the wall\r\n(Shy one) The shadows will not fall\r\n(Shy one) Is silently ignored\r\n(Quiet one) Discouraged by the noise\r\n(Quiet one) Living without choice\r\n(Quiet one) Is a life without a voice\r\n\r\nWhen you can't even say my name\r\nHas the memory gone? Are you feeling numb?\r\nGo and call my name\r\nI can't play this game, so I ask again\r\nWill you say my name?\r\nHas the memory gone? Are you feeling numb?\r\nOr have I become invisible?\r\n\r\n(Sky light) That dreamers wish away\r\n(Hindsight) Is falling on my face\r\n(Highlights) The shape of my disgrace\r\n\r\nWhen you don't hear a word I say\r\nAs the talking goes, it's a one-way flow\r\nNo fault, no blame\r\nHas the memory gone? Are you feeling numb?\r\nAnd have I become invisible?\r\n\r\n(Invisible)\r\n(Invisible)\r\n(Invisible)\r\n(Invisible)\r\n(Invisible)\r\n(Invisible)\r\n(Invisible)\r\n(Invisible)\r\n(Invisible)\r\n\r\nAnd no one hears a word they say\r\nHas the memory gone? Are you feeling numb?\r\nNot a word they say\r\nBut a voiceless crowd isn't backing down\r\nWhen the air turns red\r\nWith their loaded hesitation\r\nCan you say my name?\r\nHas the memory gone? Are you feeling numb?\r\nHave we all become invisible? 10/10 I Do It Again And I Became The Man Who Sold The World",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There are no facts, only interpretations",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "CP CP, THIS DELTA 3! WERE TAKING HEAVY DAMAGE REQUESTING REINFORCEMENTS NOW!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best game i have ever played. i dont care even if its incomplete",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is one of the best pieces of media i have ever consumed and it gave me PTSD 10/10 would do again thanks you kojimbo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"I won't scatter your sorrow to the heartless sea. I will always be with you. Plant your roots in me. I won't see you end as ashes. You're all diamonds.\"\nAbsolute CINEMA.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best unfinished heap of garbage I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "had this on xbox when   it came out wanted to play through it again and enjoy the memories of a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "เล่นจบใน PS4 แล้วฉันมาทำอะไรใน PC อีกเนี่ย Just to suffer?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fire gameplay (cardboard box gameplay is peak)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ehh, still feels like something is missing, perhaps a limb, perhaps more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "um dos grandes jogos já feitos, gameplay absurda, história maneira mas vilão um pouco fraco",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game is unfinished, but its still better then most modern games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best fps I've played\nBest stealth game I've played. \nGraphics aged incredibly well. \nTo this day I compare new games to this one.\nUnfortunately Konami did not let Kojima cook so the story got a little cut to say the least.",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "The opening is cool, but a ton of stuff going on in the game just doesn't make sense and is super tedious, a good example would be upgrading a gun or apart of base takes real time to upgrade (ex 1.5 hours), it makes it feel like a mobile game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[b]Metal Gear Solid V: The Phantom Pain[/b] just never clicked for me.  The pacing felt all over the place: some cutscenes dragged on forever, others made it seem like the story was finally gaining momentum, only for the game to swerve into a tangent for several missions.  Any mission involving the supernatural group known as \"The Skulls\" completely took me out of the experience.  They are frustrating rather than tense or exciting, and they feel out of sync with the grounded stealth gameplay the series is known for.\n\nThe deeper I got, the more repetitive it became.  Most of Act 2 is made up of modified rehashes of Act 1 missions, and the side ops all blur together as copy-and-paste scenarios at different outposts.  Even the main missions practically demand multiple playthroughs: your initial run, then replaying to clear side objectives that only unlock after finishing the mission [i](see note below)[/i], and then replaying yet again for an S-rank that usually requires zero kills.  Multiply that by the repeated missions in Act 2 and suddenly you're doing the same tasks up to six times.  And don't even get me started on the opening hospital sequence.  It goes on forever, constantly swapping between cutscene and gameplay so you never know when the skip button will work.  Yes, you may end up sitting through it multiple times too.\n\nI know the game's development was notoriously messy, with Konami and Kojima clashing behind the scenes and parts of the narrative reportedly left unfinished.  That context explains a lot of the unevenness, but it doesn't make it any easier to play through.  There are flashes of brilliance here, and I really appreciate the graphics and core stealth mechanics, but the overall experience just didn't land for me.\n\n[i]Side objective note: Technically, you can complete them on your first run, but some require extracting a target in a completely different outpost off the intended path.  When you go there, there are even voice lines telling you you're going the wrong way.  There is no way to know about these objectives without looking them up.[/i]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is like a pack of malboro - feels good when you first try it but gets less and less enjoyable as the time goes on.\na mixed bag for sure.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "An [okay] game. The worst game in the MGS series, not worth playing unless you are really, really interested into MGS. The story itself provides a lot of context that bridges the MGS timeline. However, it takes so much time just to get those pieces feels awful, and storytelling is not like the other MGS games.\n\nThe reason behind all the flaws in the game is \"Live-Service\" and mixing online with Single-player elements. The MB Coins, aka \"Time-savers\" are especially criminal and a huge red flag for any game. The presence of time-savers means game elements are designed to entice the purchase of the coins, making game elements less interesting, rewarding less to take up more of your time. Personally lost all interest in \"collecting\" and side activities and did not bother with them after I realized that I could just swipe my credit card instead of playing the game.\n\n[h3] Story [/h3]\n\nCompletely disconnected storytelling, drop in from a helicopter, find the target, and extract via helicopter. Over and over, with just a few exceptions. The areas felt similar, and overall, each mission felt more and more repetitive.\nThe story itself felt fragmented and incoherent. Some of the main missions offered little to no story, felt like a chore.\n\nDisconnected storytelling, fragmented story, 'time spent' to 'story delivered' ratio is awful. Nothing like the previous games.\n\n[h3] Replayable Missions [/h3]\n\nThis was especially weird and contributed to the issues with the story and storytelling. Nothing wrong with them being replayable, except each mission had the same loop of drop-in-> infiltrate ->exfiltrate, which caused the lead to the previously mentioned story issues.\n\nOn top of that, each mission had optional objectives that, often, especially early, were impossible to complete within a single run. Additionally, those optional objectives were hidden until you complete the mission. FURTHERMORE, each mission had scoring with fat rewards, which required effectively to focus on the main objective and doing it fast (apparently, cutscenes do not stop the \"mission timer\", leading to a lower score). \n\nThus, if you want to complete all objectives, you have to play the second time since you don't even know them until you complete the mission. The later in the game you replay it, the easier it is to complete them. So, maybe you just focus on the main objectives so you complete that S rank, but without the prior knowledge, it's harder to get the S.\n\nThis scoring and unknown secondary objectives are awful if you just want to play the game and enjoy the story. If you play on your own pace and explore/discover some of the objectives, you are likely to neither complete all nor get the S. Meaning you'd have to replay the mission twice to get S and objectives. The S giving a fhat reward means you should simply ignore and go for the main objective, but this is just awful.\n\n[h3] Base management [/h3]\n\nBase elements are nice, until you realize, hey, why would I spend these 5 minutes collecting 100 \"materials\" if I can swipe my card and get 10000? Hey, why do I bother clearing outposts that take so much time and risk so much to extract a few A or A+ soldiers if I can swipe a card and get 45 of them?\n\nWithout swiping your card, you are likely to fall behind on the development and which will simply make you spend more time to complete the mission instead of making it more challenging.\n\nThe only other downside for the research and progression was that it leaned heavily into offensive rather than stealth, offering little to make stealth easier or something different than using a tranq-pistol.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible with keyboard and mouse, one of the world worst UI I see in game in a long time, dialogues are cringe as fuck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have tried to play this game multiple times. I [b]ALWAYS[/b] end up quitting after about an hour or two. And I always forget why. So I'm posting this to remind myself so I never make the mistake of opening this game again.\r\n\r\nThis game is too fucking stupid for me. [b][i]KOJIMA[/i][/b] is too fucking stupid for me. I tap out at the fucking PROLOGUE. Seriously, how does anyone take this man seriously? How? Flaming whales? Men on fire riding unicorns on fire? A plot so convoluted it might as well be told by a 4 year old boy hopped up on sugar and red cordial that missed his nap time? It's all here.\r\n\r\nThe MGS series has never been fully without insane bullshit, but tripping over the line into what is essentially fucking MAGIC is possibly the lowest the series has sunk to date. Yes, even including [i] MGS: Survive[/i]. Make all the excuses you want, from it being hallucinations from his injuries, or whatever the fuck drivel is deep in the lore, it's fucking stupid and you need to accept that. If you can, that's fine, this game will thrill you at every corner. But I can't do it. I just don't have the mental fortitude to play this game straight like it has a story worth experiencing. Every fetish, every weird fucking thought that went through Kojima's head is here. From piss, to objectification, to god fucking knows what else, [i]MGSV:TPP[/i] is the distillation of everything I hate about the man and his weird little fucking cult of fans. I ain't farming Jesters, I truly do not like this game. You can love it, that's fine, no hate on you, but I just can't.\r\n\r\nThis review is not for anyone but me to remind myself that there is a reason I only have single digit hours in this piece of shit. Don't reinstall it. \r\n\r\n[h2][b]DO NOT REINSTALL THIS FUCKING GAME![/b][/h2]",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you love incomplete games & replaying the same missions, then this is for you!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can understand awkward clunky controls in MGS1 in it's timeline but this? \nThe movement controls is just as nonsense in MGSV no matter what you use, be it keyboard/mouse or a proper ps4/xbox controller.\n\nSeriously, after so many games in the series and still not revamping the movement scheme is just a big glaring issue that these prehistory game publishers really just throwing shit out as long as it's selling is why people should stop blindingly give them anymore money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "story is mid and game is incompleted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "StarFox is better. Eat a fat one, Snake Nibba!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game keeps shutting down.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "keyboard controls don't work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "najsmutniejsze 70 minut mojego zycia",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck you Kojima",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2/2 yea...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, I really tried to like this.  Mechanics are good, FPS with stealth - what's not to like?\r\n\r\nWell, here's the thing.  In order to level up, you need to get high marks on missions.  Except, there's no direction on how to get high marks, except by going on line and looking up how people have gotten high marks.  Which completely breaks the immersion, and now I'm not completing a mission, I'm doing a variety of stuff that isn't part of the mission (not even remotely) so that I can get a high-enough score to get the loot I need to progress.\r\n\r\nIt just doesn't make sense to me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great game but the way they force the online content by locking 60% of your resources to the online servers is aweful",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "Giving this game a thumbs down really hurts.  Metal Gear Solid on PS1 is my favorite game of all time, and I have played through it more than a twenty times.  I also grew up playing Metal Gear on the NES, and despite its flaws, still hold it in the highest regard.  I think Hideo Kojima is an absolute genius, but like many people of his caliber, needs someone to bring him back to earth from time to time.  From what I can see, no one was there for this game.  After MGS1, I was never really able to connect with this franchise.  Despite this, I played through all of them until I hit a wall with MGSV.\n\nThe stories got more weird and the characters failed to live up to my expectations as time went on.  MGS2 pulled the rug out from under Snake fans, and while MGSIII brought the series back to the bad ass hero, I think the die on Metal Gear was already cast.  The last straw for me was seeing my beloved character Snake as a weak old man in MGSIV, but still, I stuck with the franchise because it’s Metal Gear.  How could you not???\n\nPerhaps it was because of the limitations of the PS1 that I found the first 3D game so enthralling.  It had some oddities, but it always felt grounded in a reality that seemed like a slightly warped mirror of the real world.  While I didn’t like a lot of games in the series, I still count myself as a fan and, like all Metal Gear games, I bought MGSV day one.  I got through about 20% before I gave up and it fell into distant memory.  I recently restarted and had every intention to finish, but I just can’t trudge through the game anymore.\n\nAll this said, there is a lot to love here.  What this game gets right is absolute perfection.  There is no denying that Hideo Kojima is a master of storytelling.  Unfortunately, where MGSV lags is an anchor that weighs down the overall experience.\n\nThe Good:\n\t1.  Kiefer Sutherland is a great replacement for David Hayter, who was for me the definitive voice of Snake.  I even appreciated that they went a different route to distance Big Boss from the MGS1 Snake.  He delivers a masterful performance and really shines in every scene.\n\t2.  The storytelling and direction are top notch, though not without hiccups.  When he is down to earth, Kojima knows how to create an amazing narrative.  While it does go out into space from time to time, the good parts outweigh the bad.  If you can cut through the crazy, there are great themes and truly mind altering experiences.  \n\t3.  The stealth and general gameplay mechanics are solid (pun intended).  I had some trouble with previous MGS games, but this one clicks, after some work.  It is not easy to master, but once you do, you can kick some serious butt in any fashion that you choose.  Stealth or commando is totally up to how you choose to play.  This type of freedom was attempted in other games, but always fell short in comparison to the limitless options in MGSV.\n\t4.  The choices for environment, weapons, companions, and overall customization are unmatched. While this can also be a detractor at times, Kojima made such a deep sandbox game, that I have to put this in the win column.  It can be overwhelming, but gives you absolute freedom.  It’s an open world game that lets you explore in a fashion that feels real and organic.  \n\t5.  The music isn’t a huge focus in this game, but when you do get to hear it, you tap your foot. Kojima is a big fan of David Bowie, as am I, and his taste in music is spectacular, IMO.  He even names the troop “Diamond Dogs” after the famous Bowie album.  While I don’t think this is Bowie’s best album, I can see why Kojima loves it, particularly because of the ties George Orwell’s 1984 novel. Kojima is a deep person, and his love for this resonates with me.  Beyond just the Bowie songs, the music kicks all kinds of ass.  The tapes you collect throughout the game are incredible 80s jams that really leave a mark.\n6. This is a Hideo Kojima game!  If you are a fan, you will love it at its core, even if you don’t like some elements.  If you’re not a fan, you can still get a lot from this game.  Nobody spins a yarn quite like Hideo Kojima.  Even if you’re not a story driven person, once you get past the forced narrative, the game will knock your socks off.  There is always something about Metal Gear games that makes you want to go a little further.  As much as I want to trash the departure from what I love, Kojima makes yet another addictive game.\n\nThe ???\n\t1. You will play it and love or hate it regardless of what I say.  Every minute will make you feel something, and this is what makes Kojima an absolute master.\n\n\nThe Bad:\n\t1.  From the start, you are forced into a tutorial that drags on, and that kind of sets the tone for the whole game.  I get that you need to learn the mechanics, but most games give you a short cutscene and some prompts.  MGSV makes you run through 30 minutes while hobbled, with stopping points every few minutes.  This is one man’s opinion, but I think Kojima is too far up his own ass.  On my replay, I found myself angry with the game because it wouldn’t just let me play. You MUST got through the narrative.\n\t2.  While often a plus, the side missions of this game eventually become a hot mess and fall into the trap of (insert open world game here).  You can go anywhere and do anything, but it is usually the same thing over and over.  It took me a while to realize that the side missions were repetitive.  What makes it worse is that the game keeps throwing them at you without you knowing… until you do.  I played a ton of them until I kept seeing the same spots over and over. Eventually I realized that it was the same problem I had with Spider-Man on PS4.  I beat up the same enemies to no end, so the game keeps me occupied.  The worst part is that missions and drops in this game cost money, so you can eventually end up upside-down whilst trying to level up.\n\t3.  Too much choice becomes a massive problem in this game.  Mostly this comes down to base management, but creeps into other areas as well.  I get that the devs wanted to earn your money, but this becomes too much game, IMO.  At times it feels like a mashup of tower defense and 3rd person shooter.  There are moments when the game forces you to engage with mechanics that don’t gel with what some of us want.  If I could ignore this part, I would give it higher marks, but the game always tries to draw you back to base management and keep you connected to a PVP game.  See next point.\n\t4.  Constant connection is not a thing that should be in single player games.  I get it for games that are all multiplayer, but when the core is single player, there is no reason to be connected.  This game actually punishes you for being disconnected by reducing the amount of money you have.  For me, this is one of the biggest sins in this game.\n\t5.  Clunky gameplay haunts MGSV.  I did say in the “good #3” row that the gameplay was solid, but that was in comparison to other MGS games.  MGS games have always been a bit off for me, and while this was definitely improvement, the gameplay fails compared to other games in this category.\n\t6. Kojima is too far up his own ass. I said it more than once here, because I truly mean it.  This man is super talented, and IMO one of the greatest storytellers of all time, but someone needs to knock him off his perch.  Metal Gear Solid was branded on the box as Tactical Espionage Action.  I’m not saying you can’t go deeper, but you created a game where the hero was a cross between Snake Plisken and James Bond.  The character doesn’t have to stay a 2D trope, and can evolve, but moving him to a secondary character or a weak old man does not sit well.  This game fixes much of that over time, but you still suffer in earlier areas due to being a newbie.  Stop making Snake feel like a character that just fell out of the womb.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Every so often, I suddenly get constant disconnects when doing FoB events. Deleting the game and redownloading it, no change. Verifying the files, no change. The only thing that works is I have to completely delete the game and any save files I have and start over completely from scratch.\r\n\r\nI am not running any mods, nor cheats, but the system acts like I'm cheating based on what I've read on forums and just constantly disconnects on FoB's, against other players and in events.\r\n\r\nMeanwhile I am getting infiltrated by others who seem invincible and can take me out within seconds.\r\n\r\nI have hundreds of hours on this game, and the fact I have had to completely start over more than a dozen times for the same reason is ridiculous.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Running into the msvcp110.dll error and all attempts to fix the issue are not working. Sad because I have so many hours in the game and now cannot play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The opening is cool, but a ton of stuff going on in the game just doesn't make sense and is super tedious, a good example would be upgrading a gun or apart of base takes real time to upgrade (ex 1.5 hours), it makes it feel like a mobile game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Overrated don't get unless it's on sale gameplay really drops in second half",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Metal Gear Solid V: The Phantom Pain is not a game, but a set of crutches, fragments, and unfinished ideas glued together just to sell you something.\n\nStorytelling comes through dragged-out episodes, especially in the beginning (I don’t want to watch Snake flying and landing for half an hour every time - it just wastes my time). And those constant “Directed by Hideo Kojima” credits completely kill the atmosphere.\n\nThe plot is delivered in pieces, with no integrity. One whole chapter is just cut out — I didn’t even realize the ending was the ending, ahaha. Storylines are abruptly dropped. The conflict with Eli and Metal Gear just vanishes. Tapes replace cutscenes. Key story details are thrown into audio logs. Zero and Cipher are barely shown, even though the plot was built around their influence — they remain “off-screen.” It feels unfinished. The game ends as if you stopped watching a TV series halfway through the season.\n\nAfter mission 30 the copy-paste begins: the same missions but on “Extreme,” “Subsistence,” or “Total Stealth.” That’s not new content — just artificial padding. Side ops are nearly all the same (rescue a prisoner / capture a base). The huge maps of Afghanistan and Africa are actually empty. Outside of missions there’s nothing to do no interesting activities, random events, or a living world. The game is dependent on online features, and offline players get a stripped-down experience, left grinding repetitive side ops.\n\nStill, the game does have strong points. There’s huge freedom of choice: you can complete a mission in dozens of different ways. The advanced AI adapts - enemies start wearing helmets, setting up spotlights, reinforcing guards. Everything ties into tactics: environment, weather, time of day, gear, companions. The atmosphere of the “80s war” is enhanced with the music of that era (tapes, radio). And you really feel like you’re building an entire army (which made it heartbreaking to have to shoot your own men during the outbreak mission).\n\nIn the end: an engaging start to the game wrapped in a mess of broken story and gameplay.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It has all the visual charm of Metal Gear Solid but is extremely over rated.\n\nIf I had to describe this game I would say:\n\"Over bloated\" \"Time wasting\". \"Lack of focus\". \"Annoying bosses that can literally only be beaten one way, the way the Director wanted\" \"Dreadful multiplayer\" \"A running simulator\" \n\"A never ending ego trip for creator who runs his own credit every single mission\" \"Anti player\" example you start research but it only counts down when game is active, turn it off and it stops doing research and the research takes hours, days. 3/4 of the weapons in game are lethal variety, but game actively punishes you with stupid devil effect for using lethal weapons in missions.\n\"Annoying\" they give you mission to kill constantly fast moving tanks and other objectives around a large map and give you 15 minutes to complete it.\n\nThis game suffers from too much of everything and not enough focus. I have tried multiple times to finish this game and just end up bailing in frustration with dealing with it. You can literally play for hours on end and feel like you achieve nothing.\n\nThis is easily the worst game in the entire series.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[b]Metal Gear Solid V: The Phantom Pain[/b] just never clicked for me.  The pacing felt all over the place: some cutscenes dragged on forever, others made it seem like the story was finally gaining momentum, only for the game to swerve into a tangent for several missions.  Any mission involving the supernatural group known as \"The Skulls\" completely took me out of the experience.  They are frustrating rather than tense or exciting, and they feel out of sync with the grounded stealth gameplay the series is known for.\n\nThe deeper I got, the more repetitive it became.  Most of Act 2 is made up of modified rehashes of Act 1 missions, and the side ops all blur together as copy-and-paste scenarios at different outposts.  Even the main missions practically demand multiple playthroughs: your initial run, then replaying to clear side objectives that only unlock after finishing the mission [i](see note below)[/i], and then replaying yet again for an S-rank that usually requires zero kills.  Multiply that by the repeated missions in Act 2 and suddenly you're doing the same tasks up to six times.  And don't even get me started on the opening hospital sequence.  It goes on forever, constantly swapping between cutscene and gameplay so you never know when the skip button will work.  Yes, you may end up sitting through it multiple times too.\n\nI know the game's development was notoriously messy, with Konami and Kojima clashing behind the scenes and parts of the narrative reportedly left unfinished.  That context explains a lot of the unevenness, but it doesn't make it any easier to play through.  There are flashes of brilliance here, and I really appreciate the graphics and core stealth mechanics, but the overall experience just didn't land for me.\n\n[i]Side objective note: Technically, you can complete them on your first run, but some require extracting a target in a completely different outpost off the intended path.  When you go there, there are even voice lines telling you you're going the wrong way.  There is no way to know about these objectives without looking them up.[/i]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is like a pack of malboro - feels good when you first try it but gets less and less enjoyable as the time goes on.\na mixed bag for sure.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Terrible with keyboard and mouse, one of the world worst UI I see in game in a long time, dialogues are cringe as fuck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you love incomplete games & replaying the same missions, then this is for you!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can understand awkward clunky controls in MGS1 in it's timeline but this? \nThe movement controls is just as nonsense in MGSV no matter what you use, be it keyboard/mouse or a proper ps4/xbox controller.\n\nSeriously, after so many games in the series and still not revamping the movement scheme is just a big glaring issue that these prehistory game publishers really just throwing shit out as long as it's selling is why people should stop blindingly give them anymore money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "story is mid and game is incompleted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "StarFox is better. Eat a fat one, Snake Nibba!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game keeps shutting down.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "keyboard controls don't work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "najsmutniejsze 70 minut mojego zycia",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck you Kojima",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2/2 yea...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, I really tried to like this.  Mechanics are good, FPS with stealth - what's not to like?\r\n\r\nWell, here's the thing.  In order to level up, you need to get high marks on missions.  Except, there's no direction on how to get high marks, except by going on line and looking up how people have gotten high marks.  Which completely breaks the immersion, and now I'm not completing a mission, I'm doing a variety of stuff that isn't part of the mission (not even remotely) so that I can get a high-enough score to get the loot I need to progress.\r\n\r\nIt just doesn't make sense to me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great game but the way they force the online content by locking 60% of your resources to the online servers is aweful",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "Giving this game a thumbs down really hurts.  Metal Gear Solid on PS1 is my favorite game of all time, and I have played through it more than a twenty times.  I also grew up playing Metal Gear on the NES, and despite its flaws, still hold it in the highest regard.  I think Hideo Kojima is an absolute genius, but like many people of his caliber, needs someone to bring him back to earth from time to time.  From what I can see, no one was there for this game.  After MGS1, I was never really able to connect with this franchise.  Despite this, I played through all of them until I hit a wall with MGSV.\n\nThe stories got more weird and the characters failed to live up to my expectations as time went on.  MGS2 pulled the rug out from under Snake fans, and while MGSIII brought the series back to the bad ass hero, I think the die on Metal Gear was already cast.  The last straw for me was seeing my beloved character Snake as a weak old man in MGSIV, but still, I stuck with the franchise because it’s Metal Gear.  How could you not???\n\nPerhaps it was because of the limitations of the PS1 that I found the first 3D game so enthralling.  It had some oddities, but it always felt grounded in a reality that seemed like a slightly warped mirror of the real world.  While I didn’t like a lot of games in the series, I still count myself as a fan and, like all Metal Gear games, I bought MGSV day one.  I got through about 20% before I gave up and it fell into distant memory.  I recently restarted and had every intention to finish, but I just can’t trudge through the game anymore.\n\nAll this said, there is a lot to love here.  What this game gets right is absolute perfection.  There is no denying that Hideo Kojima is a master of storytelling.  Unfortunately, where MGSV lags is an anchor that weighs down the overall experience.\n\nThe Good:\n\t1.  Kiefer Sutherland is a great replacement for David Hayter, who was for me the definitive voice of Snake.  I even appreciated that they went a different route to distance Big Boss from the MGS1 Snake.  He delivers a masterful performance and really shines in every scene.\n\t2.  The storytelling and direction are top notch, though not without hiccups.  When he is down to earth, Kojima knows how to create an amazing narrative.  While it does go out into space from time to time, the good parts outweigh the bad.  If you can cut through the crazy, there are great themes and truly mind altering experiences.  \n\t3.  The stealth and general gameplay mechanics are solid (pun intended).  I had some trouble with previous MGS games, but this one clicks, after some work.  It is not easy to master, but once you do, you can kick some serious butt in any fashion that you choose.  Stealth or commando is totally up to how you choose to play.  This type of freedom was attempted in other games, but always fell short in comparison to the limitless options in MGSV.\n\t4.  The choices for environment, weapons, companions, and overall customization are unmatched. While this can also be a detractor at times, Kojima made such a deep sandbox game, that I have to put this in the win column.  It can be overwhelming, but gives you absolute freedom.  It’s an open world game that lets you explore in a fashion that feels real and organic.  \n\t5.  The music isn’t a huge focus in this game, but when you do get to hear it, you tap your foot. Kojima is a big fan of David Bowie, as am I, and his taste in music is spectacular, IMO.  He even names the troop “Diamond Dogs” after the famous Bowie album.  While I don’t think this is Bowie’s best album, I can see why Kojima loves it, particularly because of the ties George Orwell’s 1984 novel. Kojima is a deep person, and his love for this resonates with me.  Beyond just the Bowie songs, the music kicks all kinds of ass.  The tapes you collect throughout the game are incredible 80s jams that really leave a mark.\n6. This is a Hideo Kojima game!  If you are a fan, you will love it at its core, even if you don’t like some elements.  If you’re not a fan, you can still get a lot from this game.  Nobody spins a yarn quite like Hideo Kojima.  Even if you’re not a story driven person, once you get past the forced narrative, the game will knock your socks off.  There is always something about Metal Gear games that makes you want to go a little further.  As much as I want to trash the departure from what I love, Kojima makes yet another addictive game.\n\nThe ???\n\t1. You will play it and love or hate it regardless of what I say.  Every minute will make you feel something, and this is what makes Kojima an absolute master.\n\n\nThe Bad:\n\t1.  From the start, you are forced into a tutorial that drags on, and that kind of sets the tone for the whole game.  I get that you need to learn the mechanics, but most games give you a short cutscene and some prompts.  MGSV makes you run through 30 minutes while hobbled, with stopping points every few minutes.  This is one man’s opinion, but I think Kojima is too far up his own ass.  On my replay, I found myself angry with the game because it wouldn’t just let me play. You MUST got through the narrative.\n\t2.  While often a plus, the side missions of this game eventually become a hot mess and fall into the trap of (insert open world game here).  You can go anywhere and do anything, but it is usually the same thing over and over.  It took me a while to realize that the side missions were repetitive.  What makes it worse is that the game keeps throwing them at you without you knowing… until you do.  I played a ton of them until I kept seeing the same spots over and over. Eventually I realized that it was the same problem I had with Spider-Man on PS4.  I beat up the same enemies to no end, so the game keeps me occupied.  The worst part is that missions and drops in this game cost money, so you can eventually end up upside-down whilst trying to level up.\n\t3.  Too much choice becomes a massive problem in this game.  Mostly this comes down to base management, but creeps into other areas as well.  I get that the devs wanted to earn your money, but this becomes too much game, IMO.  At times it feels like a mashup of tower defense and 3rd person shooter.  There are moments when the game forces you to engage with mechanics that don’t gel with what some of us want.  If I could ignore this part, I would give it higher marks, but the game always tries to draw you back to base management and keep you connected to a PVP game.  See next point.\n\t4.  Constant connection is not a thing that should be in single player games.  I get it for games that are all multiplayer, but when the core is single player, there is no reason to be connected.  This game actually punishes you for being disconnected by reducing the amount of money you have.  For me, this is one of the biggest sins in this game.\n\t5.  Clunky gameplay haunts MGSV.  I did say in the “good #3” row that the gameplay was solid, but that was in comparison to other MGS games.  MGS games have always been a bit off for me, and while this was definitely improvement, the gameplay fails compared to other games in this category.\n\t6. Kojima is too far up his own ass. I said it more than once here, because I truly mean it.  This man is super talented, and IMO one of the greatest storytellers of all time, but someone needs to knock him off his perch.  Metal Gear Solid was branded on the box as Tactical Espionage Action.  I’m not saying you can’t go deeper, but you created a game where the hero was a cross between Snake Plisken and James Bond.  The character doesn’t have to stay a 2D trope, and can evolve, but moving him to a secondary character or a weak old man does not sit well.  This game fixes much of that over time, but you still suffer in earlier areas due to being a newbie.  Stop making Snake feel like a character that just fell out of the womb.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Every so often, I suddenly get constant disconnects when doing FoB events. Deleting the game and redownloading it, no change. Verifying the files, no change. The only thing that works is I have to completely delete the game and any save files I have and start over completely from scratch.\r\n\r\nI am not running any mods, nor cheats, but the system acts like I'm cheating based on what I've read on forums and just constantly disconnects on FoB's, against other players and in events.\r\n\r\nMeanwhile I am getting infiltrated by others who seem invincible and can take me out within seconds.\r\n\r\nI have hundreds of hours on this game, and the fact I have had to completely start over more than a dozen times for the same reason is ridiculous.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Running into the msvcp110.dll error and all attempts to fix the issue are not working. Sad because I have so many hours in the game and now cannot play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The opening is cool, but a ton of stuff going on in the game just doesn't make sense and is super tedious, a good example would be upgrading a gun or apart of base takes real time to upgrade (ex 1.5 hours), it makes it feel like a mobile game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Overrated don't get unless it's on sale gameplay really drops in second half",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Metal Gear Solid V: The Phantom Pain is not a game, but a set of crutches, fragments, and unfinished ideas glued together just to sell you something.\n\nStorytelling comes through dragged-out episodes, especially in the beginning (I don’t want to watch Snake flying and landing for half an hour every time - it just wastes my time). And those constant “Directed by Hideo Kojima” credits completely kill the atmosphere.\n\nThe plot is delivered in pieces, with no integrity. One whole chapter is just cut out — I didn’t even realize the ending was the ending, ahaha. Storylines are abruptly dropped. The conflict with Eli and Metal Gear just vanishes. Tapes replace cutscenes. Key story details are thrown into audio logs. Zero and Cipher are barely shown, even though the plot was built around their influence — they remain “off-screen.” It feels unfinished. The game ends as if you stopped watching a TV series halfway through the season.\n\nAfter mission 30 the copy-paste begins: the same missions but on “Extreme,” “Subsistence,” or “Total Stealth.” That’s not new content — just artificial padding. Side ops are nearly all the same (rescue a prisoner / capture a base). The huge maps of Afghanistan and Africa are actually empty. Outside of missions there’s nothing to do no interesting activities, random events, or a living world. The game is dependent on online features, and offline players get a stripped-down experience, left grinding repetitive side ops.\n\nStill, the game does have strong points. There’s huge freedom of choice: you can complete a mission in dozens of different ways. The advanced AI adapts - enemies start wearing helmets, setting up spotlights, reinforcing guards. Everything ties into tactics: environment, weather, time of day, gear, companions. The atmosphere of the “80s war” is enhanced with the music of that era (tapes, radio). And you really feel like you’re building an entire army (which made it heartbreaking to have to shoot your own men during the outbreak mission).\n\nIn the end: an engaging start to the game wrapped in a mess of broken story and gameplay.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It has all the visual charm of Metal Gear Solid but is extremely over rated.\n\nIf I had to describe this game I would say:\n\"Over bloated\" \"Time wasting\". \"Lack of focus\". \"Annoying bosses that can literally only be beaten one way, the way the Director wanted\" \"Dreadful multiplayer\" \"A running simulator\" \n\"A never ending ego trip for creator who runs his own credit every single mission\" \"Anti player\" example you start research but it only counts down when game is active, turn it off and it stops doing research and the research takes hours, days. 3/4 of the weapons in game are lethal variety, but game actively punishes you with stupid devil effect for using lethal weapons in missions.\n\"Annoying\" they give you mission to kill constantly fast moving tanks and other objectives around a large map and give you 15 minutes to complete it.\n\nThis game suffers from too much of everything and not enough focus. I have tried multiple times to finish this game and just end up bailing in frustration with dealing with it. You can literally play for hours on end and feel like you achieve nothing.\n\nThis is easily the worst game in the entire series.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[b]Metal Gear Solid V: The Phantom Pain[/b] just never clicked for me.  The pacing felt all over the place: some cutscenes dragged on forever, others made it seem like the story was finally gaining momentum, only for the game to swerve into a tangent for several missions.  Any mission involving the supernatural group known as \"The Skulls\" completely took me out of the experience.  They are frustrating rather than tense or exciting, and they feel out of sync with the grounded stealth gameplay the series is known for.\n\nThe deeper I got, the more repetitive it became.  Most of Act 2 is made up of modified rehashes of Act 1 missions, and the side ops all blur together as copy-and-paste scenarios at different outposts.  Even the main missions practically demand multiple playthroughs: your initial run, then replaying to clear side objectives that only unlock after finishing the mission [i](see note below)[/i], and then replaying yet again for an S-rank that usually requires zero kills.  Multiply that by the repeated missions in Act 2 and suddenly you're doing the same tasks up to six times.  And don't even get me started on the opening hospital sequence.  It goes on forever, constantly swapping between cutscene and gameplay so you never know when the skip button will work.  Yes, you may end up sitting through it multiple times too.\n\nI know the game's development was notoriously messy, with Konami and Kojima clashing behind the scenes and parts of the narrative reportedly left unfinished.  That context explains a lot of the unevenness, but it doesn't make it any easier to play through.  There are flashes of brilliance here, and I really appreciate the graphics and core stealth mechanics, but the overall experience just didn't land for me.\n\n[i]Side objective note: Technically, you can complete them on your first run, but some require extracting a target in a completely different outpost off the intended path.  When you go there, there are even voice lines telling you you're going the wrong way.  There is no way to know about these objectives without looking them up.[/i]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is like a pack of malboro - feels good when you first try it but gets less and less enjoyable as the time goes on.\na mixed bag for sure.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Terrible with keyboard and mouse, one of the world worst UI I see in game in a long time, dialogues are cringe as fuck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you love incomplete games & replaying the same missions, then this is for you!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can understand awkward clunky controls in MGS1 in it's timeline but this? \nThe movement controls is just as nonsense in MGSV no matter what you use, be it keyboard/mouse or a proper ps4/xbox controller.\n\nSeriously, after so many games in the series and still not revamping the movement scheme is just a big glaring issue that these prehistory game publishers really just throwing shit out as long as it's selling is why people should stop blindingly give them anymore money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "story is mid and game is incompleted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "StarFox is better. Eat a fat one, Snake Nibba!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game keeps shutting down.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "keyboard controls don't work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "najsmutniejsze 70 minut mojego zycia",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck you Kojima",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2/2 yea...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, I really tried to like this.  Mechanics are good, FPS with stealth - what's not to like?\r\n\r\nWell, here's the thing.  In order to level up, you need to get high marks on missions.  Except, there's no direction on how to get high marks, except by going on line and looking up how people have gotten high marks.  Which completely breaks the immersion, and now I'm not completing a mission, I'm doing a variety of stuff that isn't part of the mission (not even remotely) so that I can get a high-enough score to get the loot I need to progress.\r\n\r\nIt just doesn't make sense to me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great game but the way they force the online content by locking 60% of your resources to the online servers is aweful",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "Giving this game a thumbs down really hurts.  Metal Gear Solid on PS1 is my favorite game of all time, and I have played through it more than a twenty times.  I also grew up playing Metal Gear on the NES, and despite its flaws, still hold it in the highest regard.  I think Hideo Kojima is an absolute genius, but like many people of his caliber, needs someone to bring him back to earth from time to time.  From what I can see, no one was there for this game.  After MGS1, I was never really able to connect with this franchise.  Despite this, I played through all of them until I hit a wall with MGSV.\n\nThe stories got more weird and the characters failed to live up to my expectations as time went on.  MGS2 pulled the rug out from under Snake fans, and while MGSIII brought the series back to the bad ass hero, I think the die on Metal Gear was already cast.  The last straw for me was seeing my beloved character Snake as a weak old man in MGSIV, but still, I stuck with the franchise because it’s Metal Gear.  How could you not???\n\nPerhaps it was because of the limitations of the PS1 that I found the first 3D game so enthralling.  It had some oddities, but it always felt grounded in a reality that seemed like a slightly warped mirror of the real world.  While I didn’t like a lot of games in the series, I still count myself as a fan and, like all Metal Gear games, I bought MGSV day one.  I got through about 20% before I gave up and it fell into distant memory.  I recently restarted and had every intention to finish, but I just can’t trudge through the game anymore.\n\nAll this said, there is a lot to love here.  What this game gets right is absolute perfection.  There is no denying that Hideo Kojima is a master of storytelling.  Unfortunately, where MGSV lags is an anchor that weighs down the overall experience.\n\nThe Good:\n\t1.  Kiefer Sutherland is a great replacement for David Hayter, who was for me the definitive voice of Snake.  I even appreciated that they went a different route to distance Big Boss from the MGS1 Snake.  He delivers a masterful performance and really shines in every scene.\n\t2.  The storytelling and direction are top notch, though not without hiccups.  When he is down to earth, Kojima knows how to create an amazing narrative.  While it does go out into space from time to time, the good parts outweigh the bad.  If you can cut through the crazy, there are great themes and truly mind altering experiences.  \n\t3.  The stealth and general gameplay mechanics are solid (pun intended).  I had some trouble with previous MGS games, but this one clicks, after some work.  It is not easy to master, but once you do, you can kick some serious butt in any fashion that you choose.  Stealth or commando is totally up to how you choose to play.  This type of freedom was attempted in other games, but always fell short in comparison to the limitless options in MGSV.\n\t4.  The choices for environment, weapons, companions, and overall customization are unmatched. While this can also be a detractor at times, Kojima made such a deep sandbox game, that I have to put this in the win column.  It can be overwhelming, but gives you absolute freedom.  It’s an open world game that lets you explore in a fashion that feels real and organic.  \n\t5.  The music isn’t a huge focus in this game, but when you do get to hear it, you tap your foot. Kojima is a big fan of David Bowie, as am I, and his taste in music is spectacular, IMO.  He even names the troop “Diamond Dogs” after the famous Bowie album.  While I don’t think this is Bowie’s best album, I can see why Kojima loves it, particularly because of the ties George Orwell’s 1984 novel. Kojima is a deep person, and his love for this resonates with me.  Beyond just the Bowie songs, the music kicks all kinds of ass.  The tapes you collect throughout the game are incredible 80s jams that really leave a mark.\n6. This is a Hideo Kojima game!  If you are a fan, you will love it at its core, even if you don’t like some elements.  If you’re not a fan, you can still get a lot from this game.  Nobody spins a yarn quite like Hideo Kojima.  Even if you’re not a story driven person, once you get past the forced narrative, the game will knock your socks off.  There is always something about Metal Gear games that makes you want to go a little further.  As much as I want to trash the departure from what I love, Kojima makes yet another addictive game.\n\nThe ???\n\t1. You will play it and love or hate it regardless of what I say.  Every minute will make you feel something, and this is what makes Kojima an absolute master.\n\n\nThe Bad:\n\t1.  From the start, you are forced into a tutorial that drags on, and that kind of sets the tone for the whole game.  I get that you need to learn the mechanics, but most games give you a short cutscene and some prompts.  MGSV makes you run through 30 minutes while hobbled, with stopping points every few minutes.  This is one man’s opinion, but I think Kojima is too far up his own ass.  On my replay, I found myself angry with the game because it wouldn’t just let me play. You MUST got through the narrative.\n\t2.  While often a plus, the side missions of this game eventually become a hot mess and fall into the trap of (insert open world game here).  You can go anywhere and do anything, but it is usually the same thing over and over.  It took me a while to realize that the side missions were repetitive.  What makes it worse is that the game keeps throwing them at you without you knowing… until you do.  I played a ton of them until I kept seeing the same spots over and over. Eventually I realized that it was the same problem I had with Spider-Man on PS4.  I beat up the same enemies to no end, so the game keeps me occupied.  The worst part is that missions and drops in this game cost money, so you can eventually end up upside-down whilst trying to level up.\n\t3.  Too much choice becomes a massive problem in this game.  Mostly this comes down to base management, but creeps into other areas as well.  I get that the devs wanted to earn your money, but this becomes too much game, IMO.  At times it feels like a mashup of tower defense and 3rd person shooter.  There are moments when the game forces you to engage with mechanics that don’t gel with what some of us want.  If I could ignore this part, I would give it higher marks, but the game always tries to draw you back to base management and keep you connected to a PVP game.  See next point.\n\t4.  Constant connection is not a thing that should be in single player games.  I get it for games that are all multiplayer, but when the core is single player, there is no reason to be connected.  This game actually punishes you for being disconnected by reducing the amount of money you have.  For me, this is one of the biggest sins in this game.\n\t5.  Clunky gameplay haunts MGSV.  I did say in the “good #3” row that the gameplay was solid, but that was in comparison to other MGS games.  MGS games have always been a bit off for me, and while this was definitely improvement, the gameplay fails compared to other games in this category.\n\t6. Kojima is too far up his own ass. I said it more than once here, because I truly mean it.  This man is super talented, and IMO one of the greatest storytellers of all time, but someone needs to knock him off his perch.  Metal Gear Solid was branded on the box as Tactical Espionage Action.  I’m not saying you can’t go deeper, but you created a game where the hero was a cross between Snake Plisken and James Bond.  The character doesn’t have to stay a 2D trope, and can evolve, but moving him to a secondary character or a weak old man does not sit well.  This game fixes much of that over time, but you still suffer in earlier areas due to being a newbie.  Stop making Snake feel like a character that just fell out of the womb.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Every so often, I suddenly get constant disconnects when doing FoB events. Deleting the game and redownloading it, no change. Verifying the files, no change. The only thing that works is I have to completely delete the game and any save files I have and start over completely from scratch.\r\n\r\nI am not running any mods, nor cheats, but the system acts like I'm cheating based on what I've read on forums and just constantly disconnects on FoB's, against other players and in events.\r\n\r\nMeanwhile I am getting infiltrated by others who seem invincible and can take me out within seconds.\r\n\r\nI have hundreds of hours on this game, and the fact I have had to completely start over more than a dozen times for the same reason is ridiculous.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Running into the msvcp110.dll error and all attempts to fix the issue are not working. Sad because I have so many hours in the game and now cannot play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The opening is cool, but a ton of stuff going on in the game just doesn't make sense and is super tedious, a good example would be upgrading a gun or apart of base takes real time to upgrade (ex 1.5 hours), it makes it feel like a mobile game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Overrated don't get unless it's on sale gameplay really drops in second half",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Metal Gear Solid V: The Phantom Pain is not a game, but a set of crutches, fragments, and unfinished ideas glued together just to sell you something.\n\nStorytelling comes through dragged-out episodes, especially in the beginning (I don’t want to watch Snake flying and landing for half an hour every time - it just wastes my time). And those constant “Directed by Hideo Kojima” credits completely kill the atmosphere.\n\nThe plot is delivered in pieces, with no integrity. One whole chapter is just cut out — I didn’t even realize the ending was the ending, ahaha. Storylines are abruptly dropped. The conflict with Eli and Metal Gear just vanishes. Tapes replace cutscenes. Key story details are thrown into audio logs. Zero and Cipher are barely shown, even though the plot was built around their influence — they remain “off-screen.” It feels unfinished. The game ends as if you stopped watching a TV series halfway through the season.\n\nAfter mission 30 the copy-paste begins: the same missions but on “Extreme,” “Subsistence,” or “Total Stealth.” That’s not new content — just artificial padding. Side ops are nearly all the same (rescue a prisoner / capture a base). The huge maps of Afghanistan and Africa are actually empty. Outside of missions there’s nothing to do no interesting activities, random events, or a living world. The game is dependent on online features, and offline players get a stripped-down experience, left grinding repetitive side ops.\n\nStill, the game does have strong points. There’s huge freedom of choice: you can complete a mission in dozens of different ways. The advanced AI adapts - enemies start wearing helmets, setting up spotlights, reinforcing guards. Everything ties into tactics: environment, weather, time of day, gear, companions. The atmosphere of the “80s war” is enhanced with the music of that era (tapes, radio). And you really feel like you’re building an entire army (which made it heartbreaking to have to shoot your own men during the outbreak mission).\n\nIn the end: an engaging start to the game wrapped in a mess of broken story and gameplay.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It has all the visual charm of Metal Gear Solid but is extremely over rated.\n\nIf I had to describe this game I would say:\n\"Over bloated\" \"Time wasting\". \"Lack of focus\". \"Annoying bosses that can literally only be beaten one way, the way the Director wanted\" \"Dreadful multiplayer\" \"A running simulator\" \n\"A never ending ego trip for creator who runs his own credit every single mission\" \"Anti player\" example you start research but it only counts down when game is active, turn it off and it stops doing research and the research takes hours, days. 3/4 of the weapons in game are lethal variety, but game actively punishes you with stupid devil effect for using lethal weapons in missions.\n\"Annoying\" they give you mission to kill constantly fast moving tanks and other objectives around a large map and give you 15 minutes to complete it.\n\nThis game suffers from too much of everything and not enough focus. I have tried multiple times to finish this game and just end up bailing in frustration with dealing with it. You can literally play for hours on end and feel like you achieve nothing.\n\nThis is easily the worst game in the entire series.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[b]Metal Gear Solid V: The Phantom Pain[/b] just never clicked for me.  The pacing felt all over the place: some cutscenes dragged on forever, others made it seem like the story was finally gaining momentum, only for the game to swerve into a tangent for several missions.  Any mission involving the supernatural group known as \"The Skulls\" completely took me out of the experience.  They are frustrating rather than tense or exciting, and they feel out of sync with the grounded stealth gameplay the series is known for.\n\nThe deeper I got, the more repetitive it became.  Most of Act 2 is made up of modified rehashes of Act 1 missions, and the side ops all blur together as copy-and-paste scenarios at different outposts.  Even the main missions practically demand multiple playthroughs: your initial run, then replaying to clear side objectives that only unlock after finishing the mission [i](see note below)[/i], and then replaying yet again for an S-rank that usually requires zero kills.  Multiply that by the repeated missions in Act 2 and suddenly you're doing the same tasks up to six times.  And don't even get me started on the opening hospital sequence.  It goes on forever, constantly swapping between cutscene and gameplay so you never know when the skip button will work.  Yes, you may end up sitting through it multiple times too.\n\nI know the game's development was notoriously messy, with Konami and Kojima clashing behind the scenes and parts of the narrative reportedly left unfinished.  That context explains a lot of the unevenness, but it doesn't make it any easier to play through.  There are flashes of brilliance here, and I really appreciate the graphics and core stealth mechanics, but the overall experience just didn't land for me.\n\n[i]Side objective note: Technically, you can complete them on your first run, but some require extracting a target in a completely different outpost off the intended path.  When you go there, there are even voice lines telling you you're going the wrong way.  There is no way to know about these objectives without looking them up.[/i]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is like a pack of malboro - feels good when you first try it but gets less and less enjoyable as the time goes on.\na mixed bag for sure.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Terrible with keyboard and mouse, one of the world worst UI I see in game in a long time, dialogues are cringe as fuck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you love incomplete games & replaying the same missions, then this is for you!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can understand awkward clunky controls in MGS1 in it's timeline but this? \nThe movement controls is just as nonsense in MGSV no matter what you use, be it keyboard/mouse or a proper ps4/xbox controller.\n\nSeriously, after so many games in the series and still not revamping the movement scheme is just a big glaring issue that these prehistory game publishers really just throwing shit out as long as it's selling is why people should stop blindingly give them anymore money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "story is mid and game is incompleted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "StarFox is better. Eat a fat one, Snake Nibba!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game keeps shutting down.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "keyboard controls don't work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "najsmutniejsze 70 minut mojego zycia",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck you Kojima",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2/2 yea...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, I really tried to like this.  Mechanics are good, FPS with stealth - what's not to like?\r\n\r\nWell, here's the thing.  In order to level up, you need to get high marks on missions.  Except, there's no direction on how to get high marks, except by going on line and looking up how people have gotten high marks.  Which completely breaks the immersion, and now I'm not completing a mission, I'm doing a variety of stuff that isn't part of the mission (not even remotely) so that I can get a high-enough score to get the loot I need to progress.\r\n\r\nIt just doesn't make sense to me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great game but the way they force the online content by locking 60% of your resources to the online servers is aweful",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "Giving this game a thumbs down really hurts.  Metal Gear Solid on PS1 is my favorite game of all time, and I have played through it more than a twenty times.  I also grew up playing Metal Gear on the NES, and despite its flaws, still hold it in the highest regard.  I think Hideo Kojima is an absolute genius, but like many people of his caliber, needs someone to bring him back to earth from time to time.  From what I can see, no one was there for this game.  After MGS1, I was never really able to connect with this franchise.  Despite this, I played through all of them until I hit a wall with MGSV.\n\nThe stories got more weird and the characters failed to live up to my expectations as time went on.  MGS2 pulled the rug out from under Snake fans, and while MGSIII brought the series back to the bad ass hero, I think the die on Metal Gear was already cast.  The last straw for me was seeing my beloved character Snake as a weak old man in MGSIV, but still, I stuck with the franchise because it’s Metal Gear.  How could you not???\n\nPerhaps it was because of the limitations of the PS1 that I found the first 3D game so enthralling.  It had some oddities, but it always felt grounded in a reality that seemed like a slightly warped mirror of the real world.  While I didn’t like a lot of games in the series, I still count myself as a fan and, like all Metal Gear games, I bought MGSV day one.  I got through about 20% before I gave up and it fell into distant memory.  I recently restarted and had every intention to finish, but I just can’t trudge through the game anymore.\n\nAll this said, there is a lot to love here.  What this game gets right is absolute perfection.  There is no denying that Hideo Kojima is a master of storytelling.  Unfortunately, where MGSV lags is an anchor that weighs down the overall experience.\n\nThe Good:\n\t1.  Kiefer Sutherland is a great replacement for David Hayter, who was for me the definitive voice of Snake.  I even appreciated that they went a different route to distance Big Boss from the MGS1 Snake.  He delivers a masterful performance and really shines in every scene.\n\t2.  The storytelling and direction are top notch, though not without hiccups.  When he is down to earth, Kojima knows how to create an amazing narrative.  While it does go out into space from time to time, the good parts outweigh the bad.  If you can cut through the crazy, there are great themes and truly mind altering experiences.  \n\t3.  The stealth and general gameplay mechanics are solid (pun intended).  I had some trouble with previous MGS games, but this one clicks, after some work.  It is not easy to master, but once you do, you can kick some serious butt in any fashion that you choose.  Stealth or commando is totally up to how you choose to play.  This type of freedom was attempted in other games, but always fell short in comparison to the limitless options in MGSV.\n\t4.  The choices for environment, weapons, companions, and overall customization are unmatched. While this can also be a detractor at times, Kojima made such a deep sandbox game, that I have to put this in the win column.  It can be overwhelming, but gives you absolute freedom.  It’s an open world game that lets you explore in a fashion that feels real and organic.  \n\t5.  The music isn’t a huge focus in this game, but when you do get to hear it, you tap your foot. Kojima is a big fan of David Bowie, as am I, and his taste in music is spectacular, IMO.  He even names the troop “Diamond Dogs” after the famous Bowie album.  While I don’t think this is Bowie’s best album, I can see why Kojima loves it, particularly because of the ties George Orwell’s 1984 novel. Kojima is a deep person, and his love for this resonates with me.  Beyond just the Bowie songs, the music kicks all kinds of ass.  The tapes you collect throughout the game are incredible 80s jams that really leave a mark.\n6. This is a Hideo Kojima game!  If you are a fan, you will love it at its core, even if you don’t like some elements.  If you’re not a fan, you can still get a lot from this game.  Nobody spins a yarn quite like Hideo Kojima.  Even if you’re not a story driven person, once you get past the forced narrative, the game will knock your socks off.  There is always something about Metal Gear games that makes you want to go a little further.  As much as I want to trash the departure from what I love, Kojima makes yet another addictive game.\n\nThe ???\n\t1. You will play it and love or hate it regardless of what I say.  Every minute will make you feel something, and this is what makes Kojima an absolute master.\n\n\nThe Bad:\n\t1.  From the start, you are forced into a tutorial that drags on, and that kind of sets the tone for the whole game.  I get that you need to learn the mechanics, but most games give you a short cutscene and some prompts.  MGSV makes you run through 30 minutes while hobbled, with stopping points every few minutes.  This is one man’s opinion, but I think Kojima is too far up his own ass.  On my replay, I found myself angry with the game because it wouldn’t just let me play. You MUST got through the narrative.\n\t2.  While often a plus, the side missions of this game eventually become a hot mess and fall into the trap of (insert open world game here).  You can go anywhere and do anything, but it is usually the same thing over and over.  It took me a while to realize that the side missions were repetitive.  What makes it worse is that the game keeps throwing them at you without you knowing… until you do.  I played a ton of them until I kept seeing the same spots over and over. Eventually I realized that it was the same problem I had with Spider-Man on PS4.  I beat up the same enemies to no end, so the game keeps me occupied.  The worst part is that missions and drops in this game cost money, so you can eventually end up upside-down whilst trying to level up.\n\t3.  Too much choice becomes a massive problem in this game.  Mostly this comes down to base management, but creeps into other areas as well.  I get that the devs wanted to earn your money, but this becomes too much game, IMO.  At times it feels like a mashup of tower defense and 3rd person shooter.  There are moments when the game forces you to engage with mechanics that don’t gel with what some of us want.  If I could ignore this part, I would give it higher marks, but the game always tries to draw you back to base management and keep you connected to a PVP game.  See next point.\n\t4.  Constant connection is not a thing that should be in single player games.  I get it for games that are all multiplayer, but when the core is single player, there is no reason to be connected.  This game actually punishes you for being disconnected by reducing the amount of money you have.  For me, this is one of the biggest sins in this game.\n\t5.  Clunky gameplay haunts MGSV.  I did say in the “good #3” row that the gameplay was solid, but that was in comparison to other MGS games.  MGS games have always been a bit off for me, and while this was definitely improvement, the gameplay fails compared to other games in this category.\n\t6. Kojima is too far up his own ass. I said it more than once here, because I truly mean it.  This man is super talented, and IMO one of the greatest storytellers of all time, but someone needs to knock him off his perch.  Metal Gear Solid was branded on the box as Tactical Espionage Action.  I’m not saying you can’t go deeper, but you created a game where the hero was a cross between Snake Plisken and James Bond.  The character doesn’t have to stay a 2D trope, and can evolve, but moving him to a secondary character or a weak old man does not sit well.  This game fixes much of that over time, but you still suffer in earlier areas due to being a newbie.  Stop making Snake feel like a character that just fell out of the womb.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Every so often, I suddenly get constant disconnects when doing FoB events. Deleting the game and redownloading it, no change. Verifying the files, no change. The only thing that works is I have to completely delete the game and any save files I have and start over completely from scratch.\r\n\r\nI am not running any mods, nor cheats, but the system acts like I'm cheating based on what I've read on forums and just constantly disconnects on FoB's, against other players and in events.\r\n\r\nMeanwhile I am getting infiltrated by others who seem invincible and can take me out within seconds.\r\n\r\nI have hundreds of hours on this game, and the fact I have had to completely start over more than a dozen times for the same reason is ridiculous.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Running into the msvcp110.dll error and all attempts to fix the issue are not working. Sad because I have so many hours in the game and now cannot play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The opening is cool, but a ton of stuff going on in the game just doesn't make sense and is super tedious, a good example would be upgrading a gun or apart of base takes real time to upgrade (ex 1.5 hours), it makes it feel like a mobile game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Overrated don't get unless it's on sale gameplay really drops in second half",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Metal Gear Solid V: The Phantom Pain is not a game, but a set of crutches, fragments, and unfinished ideas glued together just to sell you something.\n\nStorytelling comes through dragged-out episodes, especially in the beginning (I don’t want to watch Snake flying and landing for half an hour every time - it just wastes my time). And those constant “Directed by Hideo Kojima” credits completely kill the atmosphere.\n\nThe plot is delivered in pieces, with no integrity. One whole chapter is just cut out — I didn’t even realize the ending was the ending, ahaha. Storylines are abruptly dropped. The conflict with Eli and Metal Gear just vanishes. Tapes replace cutscenes. Key story details are thrown into audio logs. Zero and Cipher are barely shown, even though the plot was built around their influence — they remain “off-screen.” It feels unfinished. The game ends as if you stopped watching a TV series halfway through the season.\n\nAfter mission 30 the copy-paste begins: the same missions but on “Extreme,” “Subsistence,” or “Total Stealth.” That’s not new content — just artificial padding. Side ops are nearly all the same (rescue a prisoner / capture a base). The huge maps of Afghanistan and Africa are actually empty. Outside of missions there’s nothing to do no interesting activities, random events, or a living world. The game is dependent on online features, and offline players get a stripped-down experience, left grinding repetitive side ops.\n\nStill, the game does have strong points. There’s huge freedom of choice: you can complete a mission in dozens of different ways. The advanced AI adapts - enemies start wearing helmets, setting up spotlights, reinforcing guards. Everything ties into tactics: environment, weather, time of day, gear, companions. The atmosphere of the “80s war” is enhanced with the music of that era (tapes, radio). And you really feel like you’re building an entire army (which made it heartbreaking to have to shoot your own men during the outbreak mission).\n\nIn the end: an engaging start to the game wrapped in a mess of broken story and gameplay.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It has all the visual charm of Metal Gear Solid but is extremely over rated.\n\nIf I had to describe this game I would say:\n\"Over bloated\" \"Time wasting\". \"Lack of focus\". \"Annoying bosses that can literally only be beaten one way, the way the Director wanted\" \"Dreadful multiplayer\" \"A running simulator\" \n\"A never ending ego trip for creator who runs his own credit every single mission\" \"Anti player\" example you start research but it only counts down when game is active, turn it off and it stops doing research and the research takes hours, days. 3/4 of the weapons in game are lethal variety, but game actively punishes you with stupid devil effect for using lethal weapons in missions.\n\"Annoying\" they give you mission to kill constantly fast moving tanks and other objectives around a large map and give you 15 minutes to complete it.\n\nThis game suffers from too much of everything and not enough focus. I have tried multiple times to finish this game and just end up bailing in frustration with dealing with it. You can literally play for hours on end and feel like you achieve nothing.\n\nThis is easily the worst game in the entire series.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[b]Metal Gear Solid V: The Phantom Pain[/b] just never clicked for me.  The pacing felt all over the place: some cutscenes dragged on forever, others made it seem like the story was finally gaining momentum, only for the game to swerve into a tangent for several missions.  Any mission involving the supernatural group known as \"The Skulls\" completely took me out of the experience.  They are frustrating rather than tense or exciting, and they feel out of sync with the grounded stealth gameplay the series is known for.\n\nThe deeper I got, the more repetitive it became.  Most of Act 2 is made up of modified rehashes of Act 1 missions, and the side ops all blur together as copy-and-paste scenarios at different outposts.  Even the main missions practically demand multiple playthroughs: your initial run, then replaying to clear side objectives that only unlock after finishing the mission [i](see note below)[/i], and then replaying yet again for an S-rank that usually requires zero kills.  Multiply that by the repeated missions in Act 2 and suddenly you're doing the same tasks up to six times.  And don't even get me started on the opening hospital sequence.  It goes on forever, constantly swapping between cutscene and gameplay so you never know when the skip button will work.  Yes, you may end up sitting through it multiple times too.\n\nI know the game's development was notoriously messy, with Konami and Kojima clashing behind the scenes and parts of the narrative reportedly left unfinished.  That context explains a lot of the unevenness, but it doesn't make it any easier to play through.  There are flashes of brilliance here, and I really appreciate the graphics and core stealth mechanics, but the overall experience just didn't land for me.\n\n[i]Side objective note: Technically, you can complete them on your first run, but some require extracting a target in a completely different outpost off the intended path.  When you go there, there are even voice lines telling you you're going the wrong way.  There is no way to know about these objectives without looking them up.[/i]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is like a pack of malboro - feels good when you first try it but gets less and less enjoyable as the time goes on.\na mixed bag for sure.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Terrible with keyboard and mouse, one of the world worst UI I see in game in a long time, dialogues are cringe as fuck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you love incomplete games & replaying the same missions, then this is for you!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can understand awkward clunky controls in MGS1 in it's timeline but this? \nThe movement controls is just as nonsense in MGSV no matter what you use, be it keyboard/mouse or a proper ps4/xbox controller.\n\nSeriously, after so many games in the series and still not revamping the movement scheme is just a big glaring issue that these prehistory game publishers really just throwing shit out as long as it's selling is why people should stop blindingly give them anymore money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "story is mid and game is incompleted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "StarFox is better. Eat a fat one, Snake Nibba!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game keeps shutting down.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "keyboard controls don't work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "najsmutniejsze 70 minut mojego zycia",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck you Kojima",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2/2 yea...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, I really tried to like this.  Mechanics are good, FPS with stealth - what's not to like?\r\n\r\nWell, here's the thing.  In order to level up, you need to get high marks on missions.  Except, there's no direction on how to get high marks, except by going on line and looking up how people have gotten high marks.  Which completely breaks the immersion, and now I'm not completing a mission, I'm doing a variety of stuff that isn't part of the mission (not even remotely) so that I can get a high-enough score to get the loot I need to progress.\r\n\r\nIt just doesn't make sense to me.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}