{
  "positive": [
    {
      "review": "Civilization VI is that beautiful, evil game that convinces you you’re just going to play “one more turn” — and then the sun comes up, your coffee’s cold, and Cleopatra has declared war because you built a wonder too close to her pyramid selfie spot.\n\nYou start with a single settler and a dream, and before long you’re managing an empire so complex you need a spreadsheet, three advisors, and possibly divine intervention. Every turn feels like a brilliant plan — until you realize you’ve spent 200 years building libraries while Montezuma turns your borders into a parking lot.\n\nThe cartoony art style hides a terrifyingly deep strategy game. Districts make city planning feel like Sudoku for psychopaths, diplomacy is still a chaotic mess of broken promises and passive-aggressive denunciations, and natural disasters exist solely to punish your hubris right after you finish the Pyramids.\n\nAnd yet… it’s perfect. The soundtrack swells, your cities glow, and you feel like an omnipotent genius — even if your entire empire is starving because you forgot farms exist.\n\nCivilization VI isn’t just a game — it’s a time thief, a history simulator, and a cautionary tale about overconfidence in urban planning.\n\n9.6/10 nuked capitals. Would still found “Dank Memeism” and conquer the world through tourism again.",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "This game consumes all your free time, and the only thing it asks in return is to fry your CPU, because the AI needs to calculate all the thousands of possible moves it can make, so that it can choose the dumbest one. 10/10",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The Civilization franchise is a good example of a successful iterative process to make each consecutive game better than the last in terms of graphics, mechanics, UI, and the overall gaming experience. Civ 6 is subsequently a fantastic 4x game that carries forth all the best of its predecessors. My main criticism would have to be its cartoonish style graphics though it does have some charm. If you are hesitate about getting Civ 7 like myself and many others, then Civ 6 is still a good alternative even now in 2025 especially as you can get it for next to nothing when it goes on sale. \n\nAlso, just to comment on all the misinformation being spread by the review bombing of 2K, the new TOS does put additional restrictions on such things as modding and exploits but it is not spyware. That is to say, it is no more spyware than any other online game, social media platform, web browser, web-based email service, online shopping site, etc. If the 2K TOS is genuinely a problem, then these people need to cancel their internet service and take a sledgehammer to all of their computers and smart phones. I suspect all the fearmongering is coming from disgruntled modders and people angry that they have been banned for hacking and exploits. Even the so-called quotes of the TOS that I have seen so far in the negative reviews appear to be fake. Nonetheless, if you have any concerns, dont listen to me or anyone else, just review the TOS for yourself to form your own opinion.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I've actually played a lot of this and while I can say it's not a bad game, however, the game will never be as good as Civ5. I can't say no to trying it out but if you're happy with Civ5, I don't think you're missing much if you skipped this.\n\nStill, it's worth checking out, explore the bugs and downgraded systems but, still have a fun time playing a Civ game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Cannot really add anything that hasn't been said already since this game is a lot older now, but it is a very good game. I don't really play the campaign stuff, I mostly played just a random game trying to earn the achievements as my goal and also playing either against or in teams with my wife. Unlike other sheep I didn't preorder CIV 7 and am really glad I didn't, that is a hot mess right now and I don't see it changing because they would need to pretty much reset the games foundations. This civ though, even though it does have some faults, it's enjoyable and feels right and that is what is important.\r\nIf you are someone who hasn't played Civ 6 or Civ 7, then skip 7 and buy this one.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "this game is probably one of the most fun ive had in a strategy game in a while, like i always get hooked into the game whenever i boot it up. This game is a good game for whoever is starting to get into strategy games (like me) so i would give this game a 10/10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is such a nice game, but it takes a lot of time to get into it. If you're new to Civ, make sure to play your first games as \"settler\" on a \"huge\" map. That will teach you some basic mechanics.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The multiplayer - excluding the desync issues and the occasional crashes - is really fun.\nIt gets really generous discounts so definitely grab the Anthology bundle when on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been playing this game for years, I love how challenging and thought provoking it is! Very easy to lose track of time. Fair warning, VERY addictive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my favorite games, but the price is too high after being out for nearly 10 years and the dlc is pricey too. I would definitely advise waiting till the game is on sale but otherwise it is great. Loyalty system sucks in gathering storm though, I can't fathom why they didn't add an option to turn it off. I get that it is realistic but it makes conquering cities 10x more annoying and it can cause you to lose cities to enemies just being nearby to your cities.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is good because its very lore accurate and i can genocide America while playing as the African Earthy thick thighs Baddie Nzinga Mbande. Also its cool that they added Lizzo in the game even though i never knew her real name was Amanitore",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "it's not Civ V, which is a bad thing. \n\nBut it's also not Civ VII, which is a good thing!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h2]Sid Meier’s Civilization VI - A Strategic Review[/h2]\r\n\r\n[h3]Overview[/h3]\r\n\r\nWith over 500 hours in Civilization VI, I can confidently say it remains one of the most enduring and rewarding 4X experiences. As someone who gravitates toward cultural and diplomatic victories, I’ve found Civ VI exceptionally good at rewarding long-term planning. The thrill lies in growing a single city into a global civilization through culture, science, diplomacy, religion, or conquest. Each victory path brings unique challenges, and while I prefer peaceful builds, domination runs can be equally exhilarating. After countless playthroughs, Civ VI still stands out as a deep and engaging strategy game.\r\n\r\n[h3]Core Mechanics and City-Building[/h3]\r\n\r\nCiv VI’s city-building revolves around its district system. Cities physically expand across hexes, requiring players to think about terrain, adjacency, and city specialization. A Theater Square thrives next to wonders; an Industrial Zone gains power near mines. This design forces meaningful decisions and ensures each city feels distinct. The Eureka and Inspiration system further enhances pacing, rewarding exploration and development with partial boosts to technologies and civics. Together, these mechanics create a satisfying loop of expansion, optimization, and strategic pacing through the early and mid-game.\r\n\r\n[h3]Leaders and Civilization Design[/h3]\r\n\r\nThe game’s diverse leaders and civilizations are one of its biggest strengths. Each civ has abilities that push you toward specific strategies, making every run feel unique. Greece leans into culture, Mali into gold, Japan into compact districts—each playstyle is genuinely different. Leader agendas shape diplomacy with personality-driven behavior that gives interactions more flavor. Expansions introduce civs like the Māori or Sweden, offering even more variety. With dozens of leaders available, mastering their strengths becomes a long-term part of Civ VI’s appeal.\r\n\r\n[h3]Diplomacy and World Systems[/h3]\r\n\r\nDiplomacy evolves meaningfully across eras. Early tensions can develop into alliances, pacts, and interdependence. The World Congress (with expansions) creates a global stage where resolutions and emergencies matter. City-states provide powerful suzerainty bonuses, making diplomatic maneuvering essential—especially for Diplomatic Victory. Religion adds another competitive layer, enabling both cooperation and conflict as players spread faith through missionaries, apostles, and theological combat. The race for Great People creates constant global competition, and securing the right figure at the right moment can drastically tilt your strategy.\r\n\r\n[h3]Strategic Depth and Victory Paths[/h3]\r\n\r\nCiv VI offers multiple win conditions, each requiring a tailored strategy. Cultural Victory focuses on tourism, wonders, and great works; Diplomatic Victory revolves around World Congress influence and global leadership. Science Victory pushes you to build a strong research and production economy, while Domination Victory tests your military planning and resource management. Religious Victory offers a unique spiritual conquest route. What makes Civ VI shine is the freedom to pivot mid-game depending on circumstances, creating dynamic, replayable sessions full of strategic adaptation.\r\n\r\n[h3]Expansions and Long-Term Replayability[/h3]\r\n\r\nRise and Fall and Gathering Storm transform the game with mechanics like Loyalty, Golden/Dark Ages, Governors, climate change, natural disasters, and the revamped World Congress. These systems deepen the mid- and late-game, making peaceful and diplomatic play more compelling. Gathering Storm’s environmental effects and diplomatic victory condition especially enrich long-term play. The New Frontier Pass adds new civs and game modes—like Secret Societies, Heroes & Legends, Dramatic Ages, and Monopolies—allowing players to customize their experience and keep the game fresh. With the Anthology version, Civ VI becomes a massive strategic sandbox with remarkable replayability.\r\n\r\n[h3]Conclusion and Recommendation[/h3]\r\n\r\nAfter years of updates, Civilization VI stands as one of the most complete and satisfying strategy games available. Its blend of empire-building, diplomacy, warfare, and cultural development offers depth few games can match. The expansions elevate the experience significantly, making the late-game more meaningful and dynamic. While the AI can still falter and large maps slow down late turns, these issues don't diminish the overall excellence. Civ VI remains a must-play for strategy fans and a game that truly embodies the spirit of “one more turn.”\r\n\r\n[b]Score: 9/10[/b]. Even in 2025, Civilization VI—with all its content—is a crown jewel of the genre.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great game! It is satisfiying and has low PC limitations so you can basicly play this on most computers.\nIt gets a bit lacklester in late-game on easier modes. You do have to have time to do it as it is a grind-then stop kinda game. Overall the Graphics and story is great and I would recomend to anyone who likes games like this.\nJust posibly wait for a sale as it drops even to 3usd at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the many different components to the game. If you don't want it to be repetitive you can switch it up with many different components.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is a banger. I've always liked this type of games but felt a little bit intimidated by Civ. I bought it on sale and never came back. I've spent unholy amount of time playing it and yet there is still so much more to discover and learn. \r\nThe only note I have is end of monthly challenge the moment new Civ came out. I was late to that party (as a mac user) and enjoyed those few I had a l o t. I get that making new challenges might not be in another instalment's best interest, but I would love the opportunity to play old ones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you know the series, and what gameplay to expect, it's so awesome! I also really like history so def a more nerdy game but that's what I want :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game but very time consuming, especialy with multi-player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great strategy game, as every previous civ game. Prepare yourself for long gaming sessions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love eye candy and this game is very well put together graphically.\r\nSo far I have also enjoyed the gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game can be easy or hard and  the challenge of winning every leader in each victory will give many hours of game play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a really fun and engaging long strategy game. i really enjoyed the play through it does take time to get used to but once you understand its super fun and enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Countless hours in there are endless possibilities and configurations to make the game interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is really fun to play with friends online and off, I mostly play by myself and destroy all the cpus",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed *Civilization VI*. The scenarios are well-designed, and the overall gameplay is simple to pick up. It does require a bit of patience, but once you get into the flow, it’s a very satisfying and enjoyable experience. Definitely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game. Makes you feel accomplished but must say, has a steep learning curve to a degree. Though still fun through trial and error!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game overall. The only problem i have with it is that once you get to the late game turns can take a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy the gameplay, and this type of game is something I've been trying to find for a long time. Generally fun experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been a Fan since the very first Civilization Board game. I am sure many Civ. fans feel this way too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A generic tool for mental relaxation between different types of tasks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I played. Love it a lot and I hated how it used to be so expensive before and the new game, way too expensive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super addicting, but fun game for those that like to build and see expansion happen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is in my opinion the best strategy game i have played, the ability to create fun armys, fun versions of alternate historys, its just fun. all the differenet playstyles come together in a very unique and fun way that allows for diverse play and unique outcomes, also all the detail in the wonders and the goofy yet weirdly realistic ai is so fun. The ai in general is really fun even if its pretty simple.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one wonderful game i played civilization 2 and thought why not try Civ 6. It is adictive and you need to think every turn. Enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really addicting. If you're a hardcore strategist or just looking for some fun, this game ticks all the boxes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but you need some level of attention span and great if you like history",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good and simple game.. easy move. The game has a good structure!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game follows similar games in the genre. You begin in ancient times, and progress through the ages to the current time. You have different units, ranged, melee, cavalry, and in later ages bombers and fighter planes. You also have naval units which also progress in technology with the ages. You have different building types, which provide different resources or affects, or train units. \r\nThere are different victory  types, such as a science victory, military, total score, etc. \r\nOverall I find the game pretty addictive, honestly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, just please fix the world builder advanced mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I actually really enjoyed my time on this game. I recommend each and every one of you to buy this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been a fan of this series for 30 years.  It's the only computer game I play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a newbie in this game series, I found the game quite enjoyable, especially since I already had a lot of experience with RTS games like AOE and the Stronghold series. I saw this game as \"just\" a turn-based version of those games, haha, so the transition I experienced wasn't that long.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Expands on the franchise in fun and interesting ways, lots of options (if you have the DLCs) to customize your experience and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for those who like strategic turn based games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DLCs = 1/2 SMC VI\nDLCs contain a great lot of gameplay, without which it's not a comprehensive and complete game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An endlessly replayable game that is surprisingly addicting. Just when you think you've had your fill, it's time to puzzle out how to win with a random civ, or go achievement hunting. Fun with friends or alone, and- for better or worse- an absolute time sink.\n\nONE. MORE. TURN!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't know when they'll improve Civ7, but i am greatly enjoying 5 and 6 with all the DLCs when i get an itch for \"One More Turn\" game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once you start, you can't stop. It's always one more turn.... I knew I would never be rid of this game after my first victory as Rome on Prince, the power, the satisfaction, the payoff... immaculate, unrivaled, it's monumental. I'm just sad that civ 7 sucks tbh. All hail Potato McWhiskey!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I feel I owe this game a review even though it's been some years since I last played. I played over 400 hours of this game while I was in college and loved every minute of it. The massive amount of civilizations to choose from made it extremely easy to replay over and over again. Each age has such fun and unique elements to it. I personally always enjoyed the late game the most as launching nukes from submarines was sickly addictive. I also liked that it allowed you to add mods which made for even more fun play thoughts. I would recommend this game to anyone whom like a longterm game that will take you hours and hours to see through to the end.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games ever made. My only complaint is that the game needs smarter auto-piloting of cities and units. It gets tedious as the game progresses towards the later eras.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's just like building your own house, except it has eventual fights amongst neighbors that may or may not end up with the entire neighborhood getting turned into a nuclear wasteland. \r\n\r\nPretty chill...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "~ DIFFICULTY ~\r\n🔲 My 90 year old grandma could play it\r\n✅ Easy\r\n🔲 Normal\r\n🔲 Hard\r\n🔲 Dark Souls\r\n\r\n~ GRAPHICS ~\r\n🔲 MS Paint\r\n🔲 Bad\r\n🔲 Meh\r\n🔲 Graphics dont matter in this game\r\n🔲 Good\r\n✅ Beautiful\r\n\r\n~ MUSIC ~\r\n🔲 Bad\r\n🔲 Not special\r\n✅ Good\r\n🔲 Eargasm\r\n\r\n~ STORY ~\r\n✅ This game has no story\r\n🔲 Like playing Temple Runners for the story\r\n🔲 It's there for the people who want it\r\n🔲 Well written\r\n🔲 Epic story\r\n\r\n~ PRICE ~\r\n🔲 Free\r\n🔲 Underpriced\r\n🔲 Perfect Price\r\n✅ Could be cheaper\r\n🔲 Overpriced\r\n🔲 Complete waste of money\r\n\r\n~ REQUIREMENTS ~\r\n🔲 You can run it on a microwave\r\n✅ Average\r\n🔲 High end\r\n🔲 NASA computer\r\n\r\n~ LENGTH ~\r\n🔲 Very Short (0 - 3 hours)\r\n🔲 Short (3 - 15 hours)\r\n🔲 Average (15-50 hours)\r\n🔲 Long (50-90 hours)\r\n🔲 Extremely long (90-110 hours)\r\n✅ No ending\r\n\r\n~ FUN ~\r\n🔲 I'd rather watch paint dry\r\n🔲 Hard to enjoy\r\n✅ Repetitive\r\n🔲 Actually pretty amusing\r\n🔲 Ride of your life\r\n\r\n~ REPLAYABILITY~\r\n🔲 It's a one-time experience\r\n🔲 Only for achievements\r\n✅ If you wait a few months/years\r\n🔲 Definitely\r\n🔲 Infinitely replayable\r\n\r\n~ WORTH BUYING ~\r\n🔲 No\r\n✅ Wait for sale\r\n🔲 Yes\r\n\r\n----------------\r\n\r\nSid Meier’s Civilization VI delivers an expansive turn-based strategy experience that invites players to guide a civilisation from its earliest days to the modern era. The game provides considerable depth while maintaining an accessible structure that encourages experimentation. Its pacing allows for thoughtful decision-making, ensuring each choice feels impactful. The result is an engaging strategy title that sustains interest over long sessions.\r\nThe narrative is less a traditional storyline and more a tapestry created through the rise and fall of empires. Each leader introduces unique historical flavour, adding context to diplomatic interactions and cultural development. The progression of eras gives the sense of an evolving world shaped by player-driven events. This flexible narrative approach keeps the experience dynamic and memorable.\r\nGameplay centres around strategic planning, resource management, and careful diplomacy. Each system interlocks effectively, allowing multiple viable paths to victory, from cultural dominance to scientific progress. While the AI can be inconsistent in its decision-making, the variety of mechanics ensures that each playthrough feels distinct. The level of strategic freedom remains one of the game’s strongest features.\r\nThe visual presentation is vibrant, adopting a stylised aesthetic that suits the game’s accessible yet deep nature. Units, environments, and structures are clear and readable, which supports strategic play. Subtle animations and detailed leader designs contribute to the overall charm. The visual clarity ensures that even complex maps remain easy to navigate.\r\nOverall, Sid Meier’s Civilization VI stands as a rich and rewarding strategy experience that balances depth with approachability. Its blend of emergent storytelling, varied gameplay systems, and distinctive visuals makes it a compelling entry in the long-running series. Despite occasional AI shortcomings, the diverse strategic options keep the game engaging throughout. It remains a strong recommendation for those seeking thoughtful, long-form strategy.\r\nSid Meier’s Civilization VI gets a 6/10.\r\n\r\nFor more reviews check my Steam profile\r\nHope you enjoyed my review, god bless you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started playing Civ with Civ II and have played each one since. Civ VI has a lot of quality-of-life upgrades that have made it the best iteration so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing, even I have been playing for 4 years, I till didn't bored.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good strategy game.\nDLCs are great such as \"Gathering Storm\" and \"Rise and Fall\".\nBut barbarians are peace of sh*t.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game, so much replay value. Civ at its best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun and i think friendly to people new to strategy/kingdom building games. I was lucky enough to have a very kind friend gift me the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly engaging and, yes, addictive!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its kinda fire but its been having a lot of trouble being able to run on my new mac but it was kinda slow on my old one and idk if thats because the game was poorly optimize or if its just cus my old computer was getting old as shit. Either way, when I finally start playing the game its really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "scratched my itch for warcraft 3. starting to play other civ games but 6 was fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! I like to build my worlds in the World Editor and then play them. Lots of hours of enjoyment!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game to explore how far humans have come while shaping history in your own right",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The classic strategy game it has been for decades upgraded to the current technology.  A must have!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly engrossing.  Lots of strategies to win and different difficulty levels making for enjoyable game play over many repetitions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lowkey i got obsessed with this game when i was psychotic(like fr manic episode) and a dude i met on discord bought me all the DLC so now i have to play it <3 this game will always have a special place in my heart i do highly recommend this game very fun very educational if you like this game i think reading Art of War would probably make you better lmao",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Massively improved from the release version and now days you can get it super cheap.  I still prefer Civ 4's music and Leonard Nimoy but you can't have everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "prettiest and deepest of all civ games so far (havent got to civ7 yet, need apple chip!) \r\nbeen civin since the original.\r\nno glitches or bugs on 2017 macbook air\r\nsteam still sux though... woulnt let me download teddy pack for free by itself, then changed price of 2 other free dlc's to $20, so got them all for $21...aaaand havent figured out the install yet!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very enjoyable game I think that the real best parts are somewhat unfortunately from the DLCs, however it really expands on how civilatation games should be from civ 5 to civ 6 there is a great leap in a lot of gameplay aspects. It is fun alone but extremely fun multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing Civilaization for years. The series has delivered a great game everytime, keeping me coming back for more when the FPS's are getting overwhelming. This game definitely has flaws, however, they are mitigated by the detail and systems that make the game come together as well as it does.\r\n\r\nI focus more on conquest and domination style gameplay. Starting wars and conquering other nations has a special place in my heart, and Civilization fills the void nicely. There are some drawbacks, such as unrealistic warmongering penalties and lack of AI interaction in war, but it still provies a decent experience.\r\n\r\nCreating your own experiences with gameplay customization and even map building brings more freedom to the game, and i found myself always playing it.\r\n\r\nSome improvments i'd like to see is a more in depth AI experience, with different nations having differing opinions on war, as well as more units, modern war tactics and capabilites, as well as a larger diplomatic input on war, its treaties and potential proxy nations.\r\n\r\nAnother change that I would like to see implemented is how the difficulty affects the gameplay. Instead of flooding other nations with resources per turn. Make the AI target the player and systematically attack and build their nation to counter the players objectives. For example; Having the AI focus on a navy or airforce if the player lacks these weapons, or propagandize to overthrow governments interally if the player is too strong conventionally.\r\n\r\nOverall, i really enjoy these games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a bit complicated but once you understand the basics its really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Civilization lets you play out different scenarios to change history the way you want it to go...maybe.  IT a fun, challenging, and exciting strategy game that can be played on the quick, or take days to work through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really good 4x game. I wish civ 7 was better than this, but, it is what it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game to play with friends, and start wars against each others colonies. Very fun and funny when you sneakily make your friends colonies a different religion without them knowing. Genuinely great game, and fascinating to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, have been playing for literally over half my life, just be warned that you will become increasingly susceptible to rabbit holes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 gameplay, if you for some reason don't have a life for a week straight.\r\nSeriously, how long do these games take? I can't really sit down to enjoy this game without binging for 2 days, but its fun when I have the opportunity. It's almost as rewarding as running down the street butt naked in front of the local police department.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but the desync with multiplayer is bad. Ive played over 1000h and i can really recommend it now that its cheaper :0",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've always loved playing the Queens & Empresses.  Building up my Country.  Turning off most of the other Countries.  Making peace with the other country.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great strategy game for anyone with at least a passing interest in history. While daunting to learn at first, it's complexity becomes much more simple as you play and figure out the different systems - and before you know it, you're 346 turns in and have quickly mastered the basics. You'll tell yourself, \"Just one more turn. Once I've built that granary, conquered that city, researched that tech, then I'll finish for the day\". That end will never come. Would strongly recommend to anyone new or familiar to strategy games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game, not really comparable to 5 because its so different but i love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My very first \"one more turn\". A phenomenal strategy game with tons of options. I have a lot more hours on another platform but I'll definetly give it even more hours here. \n\nI didn't even buy CIV VII because I am still having a lot of fun with this one !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game.  It's every bit as addictive as the Civs before it.  I still think 5 is the best, but this one is a close second.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun strategy game! Scratches my brain just right with all the task management.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was my introduction to Civ and it is my favorite strategy game! I find myself always wanting to start a new game with my friend. The many leaders, random maps, and multiple ways to win give this game TONS of replayability! Definitely worth getting if you're a fan of chill strategy games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very interactive and challenging if you use higher levels of experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "How can you not like this game. You can be Ghaundi and wipe out civilizations with the biggest army the world has ever seen or just nuke people. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a good Entry level game into RTS style Games/Modes in my opinion make it as easy or hard as you need i started with this and now into Anno 1800, Total War Rome etc etc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great strategic game. lots of variety. Can play for days.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basic Civ game. Leaders look a little toony but everything i would expect from a civ game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good stratagy game. But really adicting lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has taught me to live my life one hexagon at a time and surround myself with archers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Civ 6 offers a lot more than Civ 5 although there are things missing that I miss in Civ 6.  This game is not for the lighthearted.  It takes time to understand the massive amount of control you have in the game.  You will have hundreds of happy hours playing all the scenarios.  There is even content now with zombies.  I haven't even gotten there yet.  It has a few bugs on Steam but nothing that will stop you from playing.  Have fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Many l,easders, many mechanics to master.. all amounts to many hours of exploration and creativity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm a casual player and I've played CIV 5 for years - on and off. I wanted something a little different and something with a little more depth and creativity, but not so intricate and time consuming as another TOTAL WAR game. I was hesitant because of the negative reviews, but maybe that's for die-hard gamers. I really like CIV 6.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1488.5 hours on record at the time of this writing. that says it all. it doesn't get much better than this. (oh, and there's Sean Bean.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "- boot up game\r\n- load a singleplayer match as Ottomans\r\n- Delete my starter Settler \r\n- Quit the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game where you can go \"Geneva Convention, more like Geneva suggestion\" as you take over the whole continent while declining 6 to 8 peace offers and try to keep your cities stable so they don't coup yer A$$. also you can nuke some poor souls while you are on your bloodthirsty campaign. I have played this a lot on epic cuz i got it for free and then decided to get this steam as well , takes a while to get into but once you are in will keep you locked in for hours. If you are a fan of or played and liked age of empires give this a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So Many ways to play and if you can find the righ group, Lots and Lots of veggies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a brilliant game and it changes every single time. It's always \"just one more turn\" and four hours later you realize that you still have to get up for work tomorrow, but you'll do \"one more\" just for kicks. I've tried kicking the habit. I can't.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "11 hours, and it was a single game. I got my first ever domination victory :)\r\nGot more hours on PS4\r\nThe game is really fun when you get the hang of it ^-^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favourite 4X games. Love the choice of leaders. Much prefer the game play mechanics over Civ VII.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Fun game, unfortunately published by 2K so it comes bundled with spyware. Actually insane. 2K does this a lot with their older games. They update the ToS to include agreeing to install hyper invasive spyware for old games, and sell the for free, or incredible sales so they can shove it only as many computers as possible. They plainly admit to selling and sharing your date to people in other counties that \"may have lower standards of privacy protection\", monitor what you do outside of the game and whilst it isn't running. This is some of the most invasive spyware you'll find anywhere, its it comes bundles with countless games published by 2K. Its incredibly scummy, and Im shocked its legal for them to do this without offering refunds for people who don't consent to downloading spyware along with the games they previously paid for in full.",
      "voted_up": false,
      "votes_helpful": 376
    },
    {
      "review": "I've been playing the Civilization series for over 12 years, so I used to believe that each generation of Civilization would gradually improve. But I never expected 2K to update its user terms, forcing me to allow programs to steal my personal information while I'm playing. I can't imagine what a game company's purpose would be in setting such terms.\n\nTherefore, I strongly suggest you carefully consider this factor before purchasing and patiently read other people's reviews. If those reviews make you hesitant to buy any 2K game, please trust them.\n\n文明系列游戏我已经玩了超过12年了，因此，我曾经相信文明每一代能够逐渐变得更好。但万万没想到，2K更新了它的用户条款，迫使我允许程序在我游玩的时候偷取我的个人信息。我无法想象一个游戏公司是出于什么目的设置这样的条款。\n\n在此，我强烈建议你在购买前慎重地考虑这个因素，并耐心读读其他人的评价。如果那些评价让你对购买任何2K的游戏产生了顾虑，请一定要相信他们。",
      "voted_up": false,
      "votes_helpful": 206
    },
    {
      "review": "The more you play, the more frustrated you get at the lack of thought behind the various in-game mechanics. It's almost as if at some point, they realized that the game lacks depth and added in a lot of very convoluted ideas that add complexity only on the surface level. AI is terrible, I really wish they finally did anything to not have it rely so heavily on production bonuses at the higher difficulties.\nSeems the game also encourages and rewards going wide, but that's up to a personal preference I guess.\n\nThe UI is terrible. First civilization game where I had to install mods to make things more readable.\n\nCiv5 and Civ4 are just vastly superior to this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sid Meiers Civilization VI is so unbelievably awful that every time I play it I feel my IQ physically dropping. The game doesnt just waste my time it vaporizes it, grinds it into dust, and then laughs while the AI trips over its own shoelaces. Every mechanic feels like it was designed by someone who actively hates fun and wanted to see how far they could push human suffering. The longer a match goes on, the more I question my life choices, my sanity, and whoever thought this flaming disaster of a game was acceptable. By the end im not just angry im convinced Civ 6 exists solely as a punishment for people who have sinned.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ok, the game has stopped turning on and become stacking on the black screen right after the intro cinematic. Tried multiple times - all the same. Tried VPN and omg it worked. Another western  measureheads. You have no idea how tired I am from them. I wish those hypocrites to live a day when they are not privileged and they finally experience in their life the dogmas they follow. Never purchasing anything from 2k again.\nUPD: it appears it might have been an internet provider testing digital gulag and blocking access to certain parts of the internet. But why the F does this predominantly singleplayer game need a connection to some server in order to reach the main menu???",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I wanted to like this game but there's a lot of disappointment. Workers cannot be automated anymore? That's one way to pad the hours people play your game I guess.  Also, whoever came up with these goofy leader animations/art needs to be fired.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "civ 5 > civ 6 > civ 7\n\nwhy units have childish animations and why the workes dissappear after 3 build? lol\n\nIm not even talking about mobile game art",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Multiplayer crashes the game and spits out errors that no one online seems to have been able to fix - refunded",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Imagine Civ 5 but with worse UI and with gameplay systems so needlessly complicated that even Diety AI had to be lobotomized for the average player who isn't playing 500 turns ahead to even stand a chance. \r\n\r\nIt feels like Civ 5 but with three more expansions and a new artstyle slapped on top, but maybe there was a good reason Civ 5 stopped at two expansions. The learning experience is also even worse despite the game being more complicated.\r\n\r\nAfter the patches to the UI and balancing for Civ 7 I unironically prefer it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "DO NOT BUY CIV 6!!!  The best Civilization game so far is Civ 5, hands down.  Civ 6 - while very pretty with a decent user interface - is a degraded version of Civ 5.  The gameplay is a huge disappointment that includes the following myriad of problems:\n1.  District zone management massively overcomplicates city design, placement, and management.\n2.  The diplomacy system is a hot mess with way too many options that make voting and policy making ineffective.\n3.  Land unit movement is severely retarded to only one hex per turn on most terrain types (hills, forest, jungle, desert, marshes, etc.).\n4.  Barbarians start off with military units that are at least one generation of military tech more advanced than your own.\n5.  Bonuses from governors and secret societies are so-so at best.\n6.  Worker units in Civ 6 go away after only 3 uses/projects in the beginning of the game, which is unlike Civ 5 where they can operate indefinitely to enhance resources and build roads anywhere.  Also, roads between cities in Civ 6 can only be built using traders, which is just...what?!?!\n7.  Overall, Civ 6 a huge disappointment compared to Civ 5 and definitely a precursor to the epic failure that is Civ 7.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No way i will buy any game from you now... New Privacy Policy is a scam selling my personal data too all no way i accept this ; Your leading studio is go forever on my ignore list for me ;like Worner Bross and Paradox for this same reason i am not you f pet fy Take 2",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game till Civ7 was launched and they introduced a crash bug in Civ6. UNPLAYABLE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Lost access to all DLC I bought... Been playing this for years then poof, with the excuse of \"not being of legal age\" whilst clearly stated for being above 20 in the 2k account... This invasive need for 2k account thing is just bad at this point... What's the point of buying if you can't even play the game you bought...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love the game and I'm going to continue to play it. But that said, I'm doing a negative review because the game crashes constantly out of no where. It is a chore to play even singleplayer for longer periods of time. Multiplayer is even worse, don't bother with public lobbies. Nobody will make it past turn 30 before you crash. Another awesome game that leads in its genre but is held together by duct tape. About like Ark.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Totally broken on Mac os.  I know we are a small audience but I'll not be buying anything else from these people on any platform.  Its a terrible way to treat your customers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am new to the genre of turn based strategy games and this is in my opinion not very beginner friendly. I'm 18 hours in and I haven't even completed a game yet. I'm not sure if that's indicative of the genre or just an outlyer but it has completely turned me away from this type of game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love the Civ games, but the devs can never seem to get the netcode right. In this gamem there is a wonderful bug that causes your game to crash if you are loading into a multiplayer game. Unplayable for multiplayer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Playing on macOS is just different errors and bugs after every update. Also sick of having a shitty base game coming out and getting fixed later on and having all these paid DLCs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game, but for the last 3 months it has been unplayable on my Mac because it constantly crashes with segfaults. Please fix!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mac build is broken for years and publisher does not care to fix it.\nIf the game was not crashing every 10 minutes it could be interesting experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 140 hours, this game is a let down. I get that the combat is super simulated and diplomacy is supposed to shine, but it just sucks. I came thinking it would be cool, but the diplamacy in question is just a bunch of bickering., ehh you built near my stuff, ehhh you haven't build a harber quick enough, ehh you converted my stuff, ehh your stuff is better, ehh why do build your towns near each other, ehh why do you have a military... what a joke.  JUST PLAY TOTAL WAR!!!! This games is  litterally a city builder with nagging...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game breaking bug involving empty Leader Dialogue screen, makes the game unplayable after a little while.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game will make you spend countless hours in front the screen, it will go on and on, and when it's done, you start again, and it's forever, and I wish to never play it again.\r\n\r\nIt's a good game, though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've only played the even numbered Civ games, but this version brings frustration to a whole new level. Way too complex with too poor explanation of concepts. I'm having to constantly look up how to do things because the tutorials are piss-poor. It's also lacks the ability seemingly to objectively tell metrics in a game. The \"Loyalty\" function of cities is complete bullshit compared to previous games, there seems to be no overcoming it and it is completely unfair. It also sucks how you can't rush current productions. Your only options are to spend a fortune (that you likely don't have) or...well, that's it. It seems to take forever to do anything, especially compared to anything you're competing against. Instead of having fun, I feel like I'm wasting my time like I'm playing an MMO. On smaller notes, the visuals seem worse and harder to tell what's going on in previous games compared to others and the narrator is a complete downgrade from Leonard Nimoy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No Idea what has happened with these last couple civ games. With ONLY the civ 6 dlc and no mods, the game crashes after meeting random leaders. Just out of the blue. Most recent game is on turn 33, A scout meets china, game crashes as soon as the turn ends. Another game, turn 156, meet Bismark. Crashes at the start of the next turn.   Wasn't planning on getting 7, regret 6 at this point, probably wont be getting another.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The devs are not listening many , many bugs. two turns no move bug 1. barbarians spawn n front of your advancing troops. spawn behind you when attacking ai cities. spawn to only attack you while your attacking ai cities seem to be able to do multiple spawns every turn when yor attacking. stopped playing waste of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "still broken. cant place an airfield on flat land in my own land. broke fuckin 4 things for no reason even tho the land met the qualification.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The company became piece of shit. \r\n\r\nFirst of all, for all those years that all the players were telling them what they want in new CIV, developers be like \"nah, we know better\". \r\nAnd now we all have CIV 7 which is piece of shit. \r\n\r\nSecond: Famous from 90th \"Pass the save\" AKA \"Play By Cloud\" game mode which easy as fuck: you just need fetch the save, save it on your server and then pass it to the next player in turn. \r\n\r\nHow the fuck can such big company mess this? Most of the time you can't even create a game were all your friends can join. \r\nIf some joined - not all of them can join since some of the getting errors.\r\nIf somehow all joined - after few turns you getting placed on wrong nation.\r\n\r\nIf you endure all this then after some time one of the players will get an error.\r\n\r\nAnd more then once when trying to join through the join code I'm connected to random games with random setting and random nations. \r\n\r\nFans of CIV LITTERALY in theirs spare time made PYDT App for this functionality and big 2K/Firaxis could not.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fails to launch 50% of the time. Of that, 10% of the time it brings up a little crash report window, with the game starting in the background. Looked it up and turns out this was happening 6 years ago... still not fixed. Don't know if Firaxis is scrubbing discussions, Can't find anything new. But the rest of the internet is full of \"discussions\" on this unfixed issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game craches and keep on crashing..  Unreliable to play with. \n\nmacos mbp pro M2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"No you don't get it, yes the AI s*cks at handling 1 units per tile and the scale is super off and it is very tedious to handle but just imagine the horror of having to defeat TWO units standing on a single tile ugh, I'm so glad the devs got rid of that feature.\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "On Mac there's just a ridiculous amount of issues at this point. The app requires you to go into System Settings to verify it everytime you reinstall, I can't play docked to a monitor because the mouse input just doesn't work, it desyncs constantly even without mods, and on top of that it's started randomly crashing every couple of turns. This would be one thing for an early access game- but for something that's been out for a decade these issues are unacceptable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Here’s an updated, polished version with your plague point added in smoothly:\n\n⸻\n\nAs someone whose only experience has been with Civ V and now Civ VI, I feel this game betrays much of what made Civ V great. Too many core systems were changed, and not necessarily for the better. The settlement and city mechanics especially need another look—each new era feels like a full reset, forcing you to spend gold just to upgrade your existing “towns” into real cities so they can grow again, only to repeat the process in the next era. This also makes the war-mongering and world-domination playstyle feel practically nonexistent.\n\nOn top of that, the plague system feels overwhelmingly punishing. Even when you’re deep into the tech tree and have plague doctors stationed in every city, outbreaks are almost impossible to stop. They end up wasting huge amounts of time within an era and wiping out troops you can’t afford to lose.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really tried to like this game but it just didn't hit like Civ 5. I understand they have to innovate, but the art style felt goofy, the mechanics were confusing, and all around I just never really latched onto it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Im not a fan of this game,turns feel boring and repetitive. Im also not a fan of the agenda of the game, and in general not a fan of games that push their ideology.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is boring, can't cheat, can't play good leaders, and can't find iron to save my life. Your city states are useless while enemy city states do nothing but spawn troops and attack.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's so glitchy! Troops disappear after loading, which loading happens ALL THE TIME!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Straight up doooo dooo wont be buying another sid meier's game in the future...... this game is straight up hard mode even on the easiest setting everything is a step ahead of me and they out militarize me and i cannot take over their cities because they out gun me. waste of time playing this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think this game just isn't for me. I know a lot of people enjoy it, but I don't know, it's just not for me. It works fine on Steam Deck, but I certainly don't recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "as wide as the ocean and as deep as a puddle, with awful UI and bloat, CIV V brutally mogs yet again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's mid. \n\nIf you get it complete for sub $20 you get maybe a couple hours.\n\nBut not hundreds or even thousands, if you do you should've played something else.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly way too many features. Good premise but easy to become overwhelmed by the amount of things you can do. Also, many of my troops do not get flagged for movement on their turn.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The controls in matches with real players are horrible. People waiting until the last second to make all their moves with 0 counter play, units getting deselected constantly when trying to do something because another player does something, ranged units walking towards the enemy while showing a \"ranged attack\" on a location.\r\n\r\nI had a scenario where last 10 seconds of a 2 minute turn someone went in, bombed my city, while I was \"afk\" waiting for the turn to end, then when the turn ended, the next one started and before I could even select my unit, my city was gone. SOMETHING has to be done about this dumb system. You don't want turns to take 2 years by having everyone got at once, but now it's just whoever is best and fastest at clicking wins, with players with lots of experience winning because they know how to abuse the system.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The graphics would maybe excite me if I was a toddler. I tried to give it a chance beside that but I just cant recommend this one",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this shit way too addictive do not buy unless you are the unemployed friend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ridiculous amount of desync issues with multiplayer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Such an awkward step from the other civ games. Decided to properly have a sit down with all of them this weekend, definitely love these games a lot now. I just really don't see where civ vi fits in.\n\nciv V was easily my favorite, it had such an overbearing weighty design from the baritone narrators voice to the grandness of the design around the ui. \n\nVi's style is definitely different, and not in a bad way. I think the direction of leaning more into the aspect of the perspective and goals of the representation having a slightly more cartoony or plastic toy art style is cute! I think if they utilized the exaggeration to the point of history itself being such a wild and outlandish thing and did so through it's representation of everything it's giving you this would have been great. Unfortunately it makes the fog of war, not fog, but dissolving paper. Hex grids feel less like miniature dioramas and more like I'm playing settlers of catan with wooden figures on my table at home. It doesn't feel grand or exaggerated, just that there's more clarity and its simplified and not in a way that serves what I felt was the point of civ. I do appreciate it for the quality of life with finding resources or knowing what's going on, but it feels all round like a step down for running inherently worse somehow.\n\nAs for the actual game, I did praise the clarity and I do like a lot of the quality of life changes. I like how the trade routes do automatic roads so you don't need to create 50 builders standing in a line to make a road that'll appear in like 3-6 turns. Plus it helps new players get more into what was always more daunting for me, the trade aspect. I like some of the new ideas, the environmental disasters is an interesting concept that I think was pushed much further than it needed to be. I think the hero units conceptually is cool, although I feel conflict was all-round brought down which makes it tricky for them being interesting units when they fade after a set amount of turns. It funnily had me imagining an xcom-style fate/grand order game. I think having the modifiers for different types of games with goals like survival in the zombie and environmental apocalypse mode is really cool I also liked the change for cavalry horse units being melee only, while the archery chariots were neat in V they were a lot more niche than they needed to be. \n\nAll that being said there's just too much to dislike. You can't cross borders to trigger minor annoyance, instead it'll hard block your units, not even allowing you to cross a one hex tile as a single through-the-border action. Diplomacy and management had a massive glow-up of options, it's all almost completely unnecessary. It suffers from the paradox problem of giving far too many complicated menus with paragraphs of reading for little pay-off, like yeah if I shuffle my deck of cards called envoys to assign them to one of the 12 city states to get a minor boost that I then need to combo with my roguelike-deck-builder policy cards that'll make my envoys gain a bit more of a bonus I could gain an extra +2 faith! Wooooow. Keeping track of your influence, culture and faith all feels like it's in the background of the other games nearly as a hidden stat you shouldn't pay too much attention too until it fucks you over, here it's in your face but so annoying and awkward you wish you could ignore it. If anything needed simplification or more directness it was this. \nTradings a nightmare too, they scrunched up the trade menu to take up only a quarter of the screen so they could show off the single character model for the leader you're talking too, not enough love was put into the interface there. I accidentally banned any mention of marble in a trade talk too by accident since I was trying to remove it from being on the table. They have two small x's right next to eachother, one of them is to ban it permanently, it's the monsters vs aliens big red button all over again.\n\nOpe that's right, diplomacy with leaders is twice as much work for half the fun and quadruple the annoyance. Say goodbye to occasional talks for only gain, now you'll get insulted constantly! Yay :> hope you aren't too annoyed by a speech window popping up all the goddamn time.\n\nI never mentioned but builders now to make up for not building roads have limited charges, they disappear after constructing around 2 or 3 things. Now you'll have to keep up the build queue to be able to put all those farms and mines down if you want the production time of the stuff you actually need built to not take 35 turns! In reality this reduces the clutter of all the builder units and makes the construction time instant, so it's more of a transfer of how long it takes to build stuff to the city build queue. While it's intended as a QOL change for that reason, it really just makes the game feel slower because it feels like you're constantly stopping the game to keep up the builder creation. It's not helped by how long it takes everything to happen either, it felt less like one more turn to get to a certain point and more like one more turn to see if anything would fucking happen. I kept getting tempted to try to maybe just attack the random countries units just to see how long it would take for a war to actually start progressing or if I should just hope a barbarian camp is somewhere nearby just so my units can stop wandering around. I'm already friends with everyone nearby, I have my envoys and diplomats doing their thing. I'm trade partners with almost everyone and it's not even the middle ages. It just felt like I already won because what's going to change when I reach the 1900's? I'm trading... even more?\nLike I'd have a bank or something it just\nthere's no threat, there's nothing to think about, it's just waiting for  more construction because the barbarians can't manage anything like in 3 or 4, the empires aren't really that ambitious if you leave them enough room and and you can't really make a vye for power because you'll be too busy micromanaging your city districts to keep your city loyal and happy so they don't rebel, it's not like you can buy cities from other nations since you'll be spending them on said construction projects plus even if you did manage to proccur a few thousand gold, they're not going to be willing to trade a city anyways because the ai is just fucked.\n\nI wish this was just either all in on being a genuine fucked up paradox game or half stepped from between what this is and what v is with polish on the ideas that didn't work out like the diplomacy and weather. What's extra fucked up is that vii LOOKS like it could be that but apparently that's only a quarter of what an actual civ game should be. I'll look into modding and all that, the menu music for this game was amazing, that's all I really have to say. :/\n\nedit: tried it a bit more, still just really doesn't feel great. I might give it another shot if I get bored of playing literally all the other civ games, but that'll probably take forever, this game might be better if I was playing with friends instead of against a.i. since thinking about these systems might be a lot more interesting if I was actively in a discord call with my friends while playing against them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The linux version of the game 1.0.12.9 is not the same as the windows version of the game 1.0.12.68.\r\nTherefore making it impossible to play with windows users of the game.\r\nThe game is supposed to be crossplateform.\r\nThis is not the case.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've played Civ for decades by this point. Civilization 6 is such a departure from the formula that I hate it. Disparate systems bloat the game, making it less streamlined than ever. Manage every tile within your borders to make \"districts\" or wonders or improvements (instead of just improvements). Faith and physical combat systems (instead of just physical with religion granting bonuses). An espionage system that features micro-managing individual districts per city (which never worked well, to be honest). Two tech trees in policy and science (instead of science unlocking policies and eras). \"Accumulating\" resources (instead of a straight check on if it is available). A byzantine scoring system that dictates whether you get a dark or golden age (instead of accumulated happiness).\r\n\r\nMaybe all this additional complexity is a plus to you, and I wish you all the fun with this game. It isn't for me, and I want to make sure other Civ vets who see it on sale know what they are getting into. This is not at all similar to the old days of dropping a city on a hex, constructing buildings as they become available, and ensuring your workers are developing your tiles correctly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While it does have some interesting innovations, it's overall a downgrade from Civ V. The district system takes away from some of the core fun of the Civ concept, and changes to Wonders take away one of the more exciting aspects of the franchise.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you can add arabic culture but adding arabic translation is not alloewd",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stopped working on M1 Mac's after poor Civ 7 sales.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2k is now a shit company that deserves to be dismantled. Do not give them a single penny.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I liked Civ 3, Civ 4, and Civ 5. This seems like a step back. I also had a couple crashes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Кусок оверпрайсного k@ла, цена которому 3 гроша",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steam keeps nagging me to review this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why the hell is this game still $60 after 9 years",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible in comparison to the prior 2 entries",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Didin't run my crafted map crashed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "clunky not near the CIV V level",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very bad game so annoying",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work on mac even though it says it does :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Strictly a downgrade over Civ 5.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Requires too much brain power that I don't have.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like it so you can not like it haha loser",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has taken my soul.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The font size is too small",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ever wanted to watch paint dry?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fart i hate the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Civ 5 is just better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn't get it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No teammates allowed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "All my saves were deleted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No Autosave",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wouldn't play this if you paid me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "weak AI",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only femboys",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BORING GAME SAME SHIT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Made Civ boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Slop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun game, unfortunately published by 2K so it comes bundled with spyware. Actually insane. 2K does this a lot with their older games. They update the ToS to include agreeing to install hyper invasive spyware for old games, and sell the for free, or incredible sales so they can shove it only as many computers as possible. They plainly admit to selling and sharing your date to people in other counties that \"may have lower standards of privacy protection\", monitor what you do outside of the game and whilst it isn't running. This is some of the most invasive spyware you'll find anywhere, its it comes bundles with countless games published by 2K. Its incredibly scummy, and Im shocked its legal for them to do this without offering refunds for people who don't consent to downloading spyware along with the games they previously paid for in full.",
      "voted_up": false,
      "votes_helpful": 375
    },
    {
      "review": "I've been playing the Civilization series for over 12 years, so I used to believe that each generation of Civilization would gradually improve. But I never expected 2K to update its user terms, forcing me to allow programs to steal my personal information while I'm playing. I can't imagine what a game company's purpose would be in setting such terms.\n\nTherefore, I strongly suggest you carefully consider this factor before purchasing and patiently read other people's reviews. If those reviews make you hesitant to buy any 2K game, please trust them.\n\n文明系列游戏我已经玩了超过12年了，因此，我曾经相信文明每一代能够逐渐变得更好。但万万没想到，2K更新了它的用户条款，迫使我允许程序在我游玩的时候偷取我的个人信息。我无法想象一个游戏公司是出于什么目的设置这样的条款。\n\n在此，我强烈建议你在购买前慎重地考虑这个因素，并耐心读读其他人的评价。如果那些评价让你对购买任何2K的游戏产生了顾虑，请一定要相信他们。",
      "voted_up": false,
      "votes_helpful": 204
    },
    {
      "review": "New Eula spy software in the game\nTake-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware.\n\nImportant Info in Terms of Service:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration clause and a waiver of class action and jury trial rights for all users residing in the United States and any other territory other than Australia, Switzerland, The United Kingdom, or The Territories of The European Economic Area\n• You can be banned for using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 123
    },
    {
      "review": "The cynic in me wonders if the Civ VII developers are turning this into spyware to get it's overall rating down and maybe spark some misguided interest in Civ VII. Civ VI is a great game, but not sure what the EULA changes entail that people are complaining about. I am playing it again and uninstalled Civ VII. I am just looking for something else as Civ is apparently not following the old mantra and has wondered off course .... it is not what it used to be .. and seemingly no one cares about their loyal game base?",
      "voted_up": false,
      "votes_helpful": 96
    },
    {
      "review": "The more you play, the more frustrated you get at the lack of thought behind the various in-game mechanics. It's almost as if at some point, they realized that the game lacks depth and added in a lot of very convoluted ideas that add complexity only on the surface level. AI is terrible, I really wish they finally did anything to not have it rely so heavily on production bonuses at the higher difficulties.\nSeems the game also encourages and rewards going wide, but that's up to a personal preference I guess.\n\nThe UI is terrible. First civilization game where I had to install mods to make things more readable.\n\nCiv5 and Civ4 are just vastly superior to this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sid Meiers Civilization VI is so unbelievably awful that every time I play it I feel my IQ physically dropping. The game doesnt just waste my time it vaporizes it, grinds it into dust, and then laughs while the AI trips over its own shoelaces. Every mechanic feels like it was designed by someone who actively hates fun and wanted to see how far they could push human suffering. The longer a match goes on, the more I question my life choices, my sanity, and whoever thought this flaming disaster of a game was acceptable. By the end im not just angry im convinced Civ 6 exists solely as a punishment for people who have sinned.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I do like it, its just that there are WAY too many limits to setup, I don't want to play Gathering Storm or Rise or Fall, yet I have to because of leader limits, I want all of the Meso-America, Europe, etc... Yet I can't. The warmonger thing.. Thats a different load of illogical garbage. It pisses me off a lot because its not fun and sandbox like.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game isn't polished all these years later and costs a bundle... what a sad state of things.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Ok, the game has stopped turning on and become stacking on the black screen right after the intro cinematic. Tried multiple times - all the same. Tried VPN and omg it worked. Another western  measureheads. You have no idea how tired I am from them. I wish those hypocrites to live a day when they are not privileged and they finally experience in their life the dogmas they follow. Never purchasing anything from 2k again.\nUPD: it appears it might have been an internet provider testing digital gulag and blocking access to certain parts of the internet. But why the F does this predominantly singleplayer game need a connection to some server in order to reach the main menu???",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Definitely a game with acquired taste. Personally, the game isn't for me, but I can see this being fun for others who have the patience.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I wanted to like this game but there's a lot of disappointment. Workers cannot be automated anymore? That's one way to pad the hours people play your game I guess.  Also, whoever came up with these goofy leader animations/art needs to be fired.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "civ 5 > civ 6 > civ 7\n\nwhy units have childish animations and why the workes dissappear after 3 build? lol\n\nIm not even talking about mobile game art",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Multiplayer crashes the game and spits out errors that no one online seems to have been able to fix - refunded",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really like the old school civilization game play. I'm playing for the nostalgia and have logged a few hours on this game, but It kinda sucks donkey balls.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The first and last time I buy a game on steam and will avoid all and every digital only purchases. I love playing Civilization and playing VI is no different, what I hate is constantly having to disagree to 2k's persistent and annoying demand to agree to their terms of service! I bought this game not to agree to your crap. Bring back physical media, if I want to play online I will seek out that option.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Can't get it to run on MacOs. it just gives me an error saying the file is damaged when I try to play.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Imagine Civ 5 but with worse UI and with gameplay systems so needlessly complicated that even Diety AI had to be lobotomized for the average player who isn't playing 500 turns ahead to even stand a chance. \r\n\r\nIt feels like Civ 5 but with three more expansions and a new artstyle slapped on top, but maybe there was a good reason Civ 5 stopped at two expansions. The learning experience is also even worse despite the game being more complicated.\r\n\r\nAfter the patches to the UI and balancing for Civ 7 I unironically prefer it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "DO NOT BUY CIV 6!!!  The best Civilization game so far is Civ 5, hands down.  Civ 6 - while very pretty with a decent user interface - is a degraded version of Civ 5.  The gameplay is a huge disappointment that includes the following myriad of problems:\n1.  District zone management massively overcomplicates city design, placement, and management.\n2.  The diplomacy system is a hot mess with way too many options that make voting and policy making ineffective.\n3.  Land unit movement is severely retarded to only one hex per turn on most terrain types (hills, forest, jungle, desert, marshes, etc.).\n4.  Barbarians start off with military units that are at least one generation of military tech more advanced than your own.\n5.  Bonuses from governors and secret societies are so-so at best.\n6.  Worker units in Civ 6 go away after only 3 uses/projects in the beginning of the game, which is unlike Civ 5 where they can operate indefinitely to enhance resources and build roads anywhere.  Also, roads between cities in Civ 6 can only be built using traders, which is just...what?!?!\n7.  Overall, Civ 6 a huge disappointment compared to Civ 5 and definitely a precursor to the epic failure that is Civ 7.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}