{
  "positive": [
    {
      "review": "Its a good game but Jeezus!!! The mini games, forced or otherwise are just too much! It interferes with the pacing to be having a deep moment one second then having to play 45 minute of queens blood or some random thing to progress the story. And everyone talks way too much. Why does rando npc have more dialogue than the main party? I've lost interest in this game over and over after long bouts of mini game after mini game. I'm honestly just playing it to complete the story at this point. When it comes to the main story, I'm so happy with the direction its going but my god the padding is a slog. Be patient I guess. The good parts are in there.",
      "voted_up": true,
      "votes_helpful": 36
    },
    {
      "review": "FF7 Rebirth is a great experience. The story itself does deviate from the original, just like what the devteam has already done with the first part of the remake trilogy, which is something you will have to decide for yourself if it bothers you or not. \n\nThe combat itself is imho the highlight of the game. Somehow they managed to make one of the most flexible and interesting combat systems I have seen in recent times. Characters can be built as multiple roles and with multiple playstyles with none of them feeling like they are the \"wrong\" way to play said character. Barret for example, can be built as both a ranged DPS, caster or even healer and it still feels like you are playing as Barret and not just a template for a partymember. The game is also genuinely challenging, with some of the extra content making me genuinely sweat while trying to clear it.\n\nI highly recommend it to anyone that likes ARPGs or is even remotely interested in trying to get into the FF7 universe, because even as someone that doesn't have any nostalgia for the original, I was thoroughly invested the whole way through.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "I liked the original FF7, although it wasn't my favorite. FF6 is my favorite, but the FF7 remake has now become my favorite FF game. highly recommend playing the FF7 trilogy, you will not be disappointed! I'll be doing a 2nd playthrough when the 3rd part releases.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "A worthy successor to Remake Intergrade, yet it has its flaws. The performance, compared to the first game is a major downgrade. The camera movement and background music also have some issues. The camera sometimes starts shaking, and the background music is occasionally so loud that you can’t hear normal conversations. But other than these problems, it’s a really solid game and covers most of the story from the original FF7.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Its a great game and I really enjoyed it thoroughly. There were some stuttering issues I had to troubleshoot, but I'm a patient guy, so I figured it out. In my case, AMD ReBar just isn't supported well by this engine, once I disabled that in my BIOS, smooth sailing. I played the original when I was barely a teenager, so seeing this fresh new take was sweet. I am eager to see how they wrap it all up in the finale. Overall, its a fresh take on a wonderful piece of gaming history. I recommend giving it a try with an open mind.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "75 hours and still going. I played the original FF7 on the Playstation and this game beings it all to life. Just as epic and emotionally driven.  Huge fan service and a lot of love put into each and every place you visit. Some deviations from the original story, but overall an amazing experience.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Final Fantasy VII Rebirth isn't just a sequel; it's a staggering exercise in ambition and scale, taking the foundation built by Remake and expanding it across a breathtaking, semi-open world. This is a game that feels truly maximalist, delivering a vast, emotional experience that succeeds primarily through its unparalleled character depth and incredible presentation, even if its sheer volume of content occasionally trips it up.\n\nThe absolute highlight of Rebirth lies in its main cast. The development team has poured an astonishing amount of detail into Cloud, Tifa, Aerith, Barret, the rest of the party members, as well as many main NPCs. The nuanced expressions, the casual dialogue, and the hundreds of optional character moments flesh out these icons in ways the original PS1 classic could only imply. Their camaraderie and conflict form the emotional bedrock of the entire journey, making every victory, joke, and tragedy resonate profoundly.\n\nThis character work is consistently elevated by the game’s spectacular presentation. Square Enix’s reputation for excellence in this area is on full display, but the cutscenes here deserve special praise. They are cinematic masterpieces, blending breathtaking visual fidelity with masterful direction and voice acting. Whether they are advancing the grand, world-shaking plot or delivering intimate, quiet character beats, these sequences are some of the best in modern gaming, capturing the drama and flair that the Final Fantasy series is known for.\n\nHowever, as with its predecessor, Rebirth continues to diverge from the established canon. The story, while covering the core plot points of the original game's second act, introduces significant differences and narrative complexities, heavily involving the mysterious \"Whispers\" and introducing concepts that challenge the nature of fate and time. For longtime fans of the original FF7, this revisionist approach, which started in Remake, keeps the narrative unpredictable, but some may find the added layers unnecessarily convoluted.\n\nThe largest new element is the sprawling, multi-zone open world. While beautiful and vibrant, the structure of populating these zones with various activities can feel a little too familiar. A significant portion of the optional content—particularly the work for Chadley, such as climbing communication towers and clearing World Intel objectives—follows a repetitive \"Ubisoft Formula\" checklist. While the rewards (powerful Materia, better summons) make these activities compelling, the sheer volume and routine nature of these tasks can become tedious, occasionally slowing the momentum of the main story.\n\nDespite these moments of bloat, Final Fantasy VII Rebirth is a phenomenal achievement. It is a massive, confident, and spectacular continuation of one of gaming's greatest stories. The emotional core is solid, the action combat is superb, and the ambition on display is undeniable. Ultimately, Rebirth is a monumental achievement, delivering a powerful and emotional spectacle that every (J)RPG fan should experience.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Final Fantasy 7 Rebirth is a HUGE game with tons of exploration to do outside of the Remake Part 1 when you are stuck in Midgar only!  The story is truly great, and all of the characters, weapons, skills, summons are all awesome and look perfect!  Alexander, Bahamut, Kujata, Odin, Phoenix, etc!  There are also hundreds of extra mini-games to play, and the entire game is filled with extra content versus the original on PS1.  Part 3 will be the sickest game when it finally comes out, and I truly cannot wait to compare it to the original game once and for all!!!  :)  P.S. Vincent, Galian Beast, Cid, Highwind, Ultimate Weapons, Level 4 Limit Breaks, Omnislash, Gold Chocobo, Northern Cave, Knights of the Round!!!  And the crazy end game bosses like Emerald and Ruby Weapon!!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Achievement Completed 61/61\n\nFF7RB has received strong praise overall, with critics highlighting its expansive world, engaging combat and ambitious storytelling. This game left me with such mixed feelings - both love and frustration.\n\nThe graphics are detailed and beautiful. All heroines look stunning, even the random NPCs on the street are attractive.\n\nSummons, materia, and skill books—these essential items are tightly bound to the open-world checklist system. The Mog's Cabin shop hides some of the best gear, which means players are forced to grind through the checklist whether they like it or not.  \n\nCharacters can permanently learn weapon skills by building proficiency, but many weapons are locked behind mini-games at their highest difficulty levels. \n\nMateria combinations and party setups create endless possibilities for growth, yet SE still refuses to provide a loadout save function. With limited materia and stat books in a first playthrough, anyone wanting to train two or three teams—or even just experiment with multiple builds for one team—must tediously reassign materia and respec skills one by one. Team switching exists, but loadout saving does not.  \n\nOn the other hand, the quality of side quests (marked with green icons) is among the best I've seen in years. Some guide exploration, others deepen character development, and many expand the world's lore. Each quest has its own narrative arc, unique gameplay, and even dedicated background music. Believe it or not, the game features hundreds of tracks in total. By limiting each map to four to six green-icon quests, the developers raised the overall quality—an excellent design choice.  \n\nThe open world itself was split into chunks, and for most of the game I assumed they were just separate maps stitched together with background loading. Only in Chapter 12, when the Tiny Bronco transforms into a ship and sails across the vast ocean, did I realize FF7RB actually has one continuous world map, artificially segmented by design. Unfortunately, by the time players discover this, the game is already nearing its finale.  \n\nStill, there are moments of brilliance. Players can ride different chocobos—mountain birds to climb peaks, flying birds to soar through the skies—command parades in the coastal city of Junon, and witness Lovelace's birth in the dazzling Gold Saucer. These are exactly the kinds of experiences I imagined a remake should deliver.  \n\nYet the repetition of meaningless checklists and mini-games, the lack of optimization polish, and the imbalance between main and side content hold the game back. If SE had trimmed the filler, refined performance, and better balanced narrative with exploration, FF7RE could have come much closer to perfection.  \n\nAs a MUST-play for fans of JRPGs and the FF series, offering a rich, immersive experience that expands the beloved classic. While not flawless, its ambition and artistry make it one of SE's most impressive modern titles.\n\nWe ain't just fighting for us. We're fighting for everyone. - - - Barret Wallace",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This is a beautiful sequel of the remake project and it keeps staying faithful to the spirit of the original. The graphics are stunning once again, and the soundtrack continues to be amazing, bringing back iconic themes with great new arrangements. The open-world exploration is really interesting too, making the world feel bigger and more alive.\r\n\r\nThat said, the game doesn’t always get the pacing right. Unlike Remake Intergrade, this one expands things a bit too much at times imo, and it can end up feeling repetitive. There are also plenty of minigames, this is pretty nice, but... Many of them are mandatory if you want to progress the story. I really disliked that, because minigames are way more fun when they’re optional.\r\n\r\nAnd unfortunately, just like in the previous entry, you still can’t control other characters outside of battles, which is a bit disappointing.\r\n\r\nOverall, Rebirth has a lot of quality, but some story pacing choices hold it back from being as tight and focused as it could’ve been just like the previous entry.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Amazing must-play for any FF7 fan. Huge enrichment of the story and character relationships and puts some sensible re-orders on the original storyline. Gets a bit lost with the amount of mini-games, but overall completely unmissable - an absolute must play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Final Fantasy VII Rebirth is a well-crafted continuation of the Remake project, offering a large world to explore, polished visuals, and a solid combat system that blends action and strategy. The character interactions are enjoyable, and there is a good amount of side content for players who like to take their time.\n\nWhile some pacing issues and design choices may not appeal to everyone, the overall experience is engaging and shows a lot of effort from the developers. If you enjoyed the first part, this one is worth playing and provides a meaningful expansion of the story and world.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Even with this being a 2024 game and having to compete with all of the 2025 new releases like Ex33 and more, FF7: Rebirth is still the standout in my book.\n\nIt’s got the music, the characters, the world building, the stakes, humor, sadness, just about everything you can ask for in a game. Its biggest downfall is definitely the side questing but that’s easy to ignore and not completely needed unless you truly want to do it and be a completionist.\n\nExtremely looking forward to the third installment and seeing how they wrap up this remake trilogy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While original is my favorite game of all time and most people don't accept Remake's and Rebirth's changes to source material, I have found myself getting the same feeling as I did with original when I first time played it almost three decades ago. Some changes are really unnecessary and cringeworthy, but the story, visuals and most importantly soundtrack is still there. All those remixes and orchestrated versions of original classics are the best I've ever heard in games. Rebirth ain't perfect, but the story is only next to original and I can't wait the conclusion of FFVIIR-trilogy!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really worth playing if you enjoyed Final Fantasy VII Remake, its basically that but better in almost every way.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is very fun, as long as you don't try to do a 100% achievements run because of a few annoying minigames.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Takes the soul of a classic and lets it beat louder than before.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Final Fantasy VII Rebirth was a truly enjoyable experience for me. The world is beautifully designed, the characters feel genuine and the story is handled with care. I especially appreciated the natural interactions between the party, which made the journey feel warm and meaningful.\n\nThe combat system is smooth and engaging, offering a nice mix of action and strategy. While a few sections felt slightly lengthy, the overall pacing and presentation remained strong throughout.\n\nIn the end, Rebirth left a lasting impression on me. It’s a visually stunning and emotionally thoughtful game that I genuinely appreciate.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't know who said Rebirth is not fun. Yeah, in the beginning of the gameplay, I wasn't really engaged, but after playing for some time, I felt excited. The feeling is like the one I had with the FFXV expansion. I don't mean the FFVII Remake because of its linearity. The crafting, linearity, and open world in Rebirth are well crafted. My taste for open worlds is really high. Yeah, I admit that Rebirth isn't as fully immersive as I imagined. My standard now is RDR2, no other game achieves full immersion like RDR2, so it's a mistake to compare Rebirth to it. Because some people said Rebirth was not good, I was originally thinking twice before buying it, until there was a big discount on Steam. Finally, I decided to buy it, and I want to say to people who dissed Rebirth, \"You are absolutely wrong!\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played after the most recent patch, which really helped the framerates. It's a pretty good game overall. Some slow bits when you get to the jungle level, but I'd say worth your time if your an FF or FF7 fan.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This has immense bloat.  Long areas of the game where you thinking....man, I don't want to play this anymore.  Costa del Sol comes to mind.  Hey lets spend 2 hours on dates doing mini games so we can buy some beach wear.  So lame and I nearly quit playing during this sequence but I figured...I played Remake, I've sunk over 30 hours into this already...lets just keep going.  \r\n\r\nIf you've played remake this is the open world version of that.  It's essentially assassin's creed or ubisoft open world slop.  Click on towers, multiple times in multiple regions and lets call that emergent, fulfilling gameplay.  We've gotta stop Sephiroth but lets stop in Cosmo Canyon for a day and flying around in a race of sorts for points.  Or lets stop and scan the same materia cluster 50 times during the course of 6 zones.  Just really poor game design that was outdated 10 years ago.\r\n\r\nCombat is where this game shines.  The story is completely redone from the OG FF VII.  THis is essentially fan fiction to make Zach Fair live again for all the kiddies that felt sad that Zach died in Crisis Core.  Rebirth is indeed a sequel fan fic remake of OG FFVII.  It introduces multiverses now.  All of these questions that will probably never get answers.  Are you in a dream? Is this a seperate reality that is coalescing with the main game? Why is this happening at all!?  If you're paying attention, many will say its due to a cosmic incident of such important, that it affects multiple realities....a terminator genysis sort of plot.  Oh boy.\r\n\r\nThis event is the fight with Sephiroth, and it is affecting Zach in some way. If you didn't play remake and watch the ending, then starting rebirth will confuse the hell out of you.   I finished remake 5 or so years ago and starting rebirth was a bit confusing for me at first. I had forgotten that Zach apparently survives his encounter at the end of Crisis Core.  \r\n\r\nI'm still giving this a thumbs up because I played this for many hours and was engaged for the most part until the Gongaga region. Seriously traversal is fucking annoying in this and is particularly egregious in Gongaga, where you need to bounce around on mushrooms to get around.  Its frustrating and Square...please don't ever make a level like that again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you're looking for a game with a story to get yourself lost in, this game does it better than 90% of other rpg adventure games. It's been a while since I really connected with the main characters and laughed/cried in a video game. Loved every minute of my first playthrough.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Jogo marcante, eu nunca tinha jogado o FFVII clássico no PS1 então cheguei sem saber nada.\r\nO combate é muito bom e a platina é bem difícil, uma das mais difíceis que já fiz.\r\nForam 165 horas e muito sofrimento.\r\nO jogo é charmoso, e as vezes parece que estamos dentro de um anime, mas nem tudo é perfeito.\r\n\r\nPros:\r\nCombate\r\nGráficos lindos\r\nArte e Músicas\r\nQueen's Blood é 10/10\r\nDiversidade nas missões e sidequests\r\nBastante conteúdo\r\n\r\nContras:\r\nA platina é desnecessariamente difícil, digo isso pelas missões de minigame principalmente, são uma tortura de difíceis e alguns minigames são MUITO chatos.\r\nO jogo parece ser mal otimizado, apesar de ter gráficos lindos a experiência não foi lisa sempre, tenho uma RTX 4090 e o 1% low é bem gritante tem hora, e fica dando engasgadas.\r\nAlgumas sidequests (tipo a das galinhas) PQ??????\r\nMundo aberto um pouco repetitivo e andar de chocobo deveria ser melhor, os chocobos agarram e tropeçam em tudo.\r\nFalta um botão de pular.\r\nQueria jogar com a party inteira, só 3 é chato.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is awesome, its absolute cinema. \r\nI get some of the criticism about the mini games being a big part of the game and it being too much. That said I dont mind them, I even like most of them. Imo because of them this game has a lot of variety. \r\nThe game hooked me from the start and I couldnt stop until I finished. Cried multiple times, I can recommend. 12/10 (very much biased)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "WTF is wrong with people? This game is easily the best game of the generation and certainly the best game of the past decade and should've won GOTY. The fact that it didn't is a travesty and shows how woke and retarded this industry and the modern audience really are, they much rather play crap like BG3 or Ghost of Yotei or Assassin Creed Shadows or BOTW (super woke with the trans actor being a dead giveaway) or some FromSoftware game to pretend they're \"Hardcore\". Can these losers platinum this game? No. Yet these same losers claim they're OG Final Fantasy 7 fans, notice how these same losers can't prove they're fans, yet somehow they're the \"Authoritative voice\" on everything FF7. Why are these losers so fixated on this game anyways? Because they consider it a threat to their favorite game, it's that damn good, that's why. These people know nothing, I can promise you that I have a collection of achievements of all their games, a tattoo, autographs and more all related to FF7, which these losers do not have. If there's any Authoritative voice that should be acknowledge is mine, not some pretender. That being said I have thousands of games, and I played most of them in my 40 years of gaming, and I can tell you for a fact this is by far the best, surpassing some of my original favorites like OG FF7 and Chrono Trigger. And I can bore you with semantics like why this game is so great, like attention to detail, game design, story, characters, music, world building, lore, gameplay and so on and so forth, but I won't, instead play it for yourself and don't get influence by outside retarded takes from people who have an agenda. Instead enjoy the game, in fact it's not just one game, it's multiple games in one and some are better than full games, try getting an S (star) rank on all piano scores (the secret is muscle memory and patience which I guarantee you 99.9% of people here do not have), Good Luck!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fantastic story, world feels lived in, the perfect blend of emotional depth with splashes of goofyness. some people complain about it being to long or too slow, but i completly disagree. i love that it gives you soo much to do completly optional outside of the main story, an dyou have to option of exploring and doing side quests, or picking the plot back up whnever you want. i love a game i can live in for a while, its part of the joy of video games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the game, has some cons by having tasks that are super repetetive if you are a completionist, but overall the pros outweigh the cons and would give the game a solid 9.5/10\n\ncan't wait to finish the trilogy when the next game drops.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of the best gameplay and story in the series but with questionable side content at times idk like it felt forced at times which i get i guess in a sense but not that it bothered for the most part so i cant wait for the 3RD <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Had fun. Didn't not have fun. Continue to have fun. I'd recommend it if you like fun video games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Middle chapter games that are part of trilogies and series are really poor fits for Steam's Recommend/Don't Recommend system on reviews. \n\nYou're either invested enough already from FF7 Remake to buy Rebirth, or you're not and you should play Remake instead, or you didn't like Remake and so shouldn't play Rebirth at all. No matter what your decision is probably already made before you read this. \n\nThat said, Rebirth IS a solid sequel to Remake. It takes the extremely linear version of FF7 found there and expands it greatly to cover the bulk of the original game's world exploration phase that takes up the rest of Disc 1, essentially. In converting \"Overworld\" to \"Open World\" the game brings said world to life, and largely follows the Remake's philosophy of maximally expanding on every single environment, character, or moment from the original game. Which makes this just a HUGE experience at the very least.\n\nSo long as you have the time to explore this expansive Planet and like playing lots of mini-games, Rebirth does a fine job with this embiggened scope. You'll laugh, you might cry, and run the gamut on the emotions in-between while you have fun with the now well refined combat system that runs a fine balance between spectacle, twitch reflex and tactical depth. I kind of feel that enemy HP bars could be a bit longer in the mid game, as despite having tons of content to explore, the game is balanced at maybe doing half of it, so completionists like myself get a bit overpowered by then. There are enough bonus challenges and side bosses to serve the difficulty guys like me want, just as a side dish rather than the main course. \n\nThe story makes some . . . choices. Especially at the end. They largely seem to exist to confuse the ultimate outcome for the next game in the series and build anticipation, because of course nothing gets truly resolved in this installment so it's basically impossible to judge the merits of these choices without knowing what the ultimate end actually is. If the next game pays off these choices well, then these choices are brilliant!. If it doesn't, then these choices were awful. But there's no way to actually know which it will be until then!\n\nFor my part, the decisions made here have me interested enough to come back one more time at least to see this trilogy to its conclusion (hopefully its only a trilogy and Squeenix doesn't try to milk it and split the next game into two installments or something silly like that). So I guess I'd say the choices made in Rebirth at least ultimately worked to keep this player invested. But they also don't work to totally assuage fears that this could all pan out really poorly. \n\nRebirth ultimately steers the whole Remake trilogy into what potentially might be the same problems the Mass Effect trilogy ended up running into - hyping up a scenario and writing itself into a corner that few could ever successfully pay off. I REALLY hope that's not the case, but only time will tell. \n\nUntil then though, this is a good game, and should be played by all who liked the one that came before it, regardless of whether or not its sequel flubs it at the finish line.\n\n(oh, and the soundtrack in particular is truly excellent - if nothing else, Rebirth's makes for another banger Squeenix OST)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Final Fantasy VII Remake was my first introduction to the Final Fantasy series. I was instantly hooked. When I got my PC, I knew right away I needed to check out Final Fantasy VII Rebirth. And after putting in over 100 hours into this game I must say it continues to be awe inspiring. This game is one of the best games I had the pleasure to play. From the story to the combat to the soundtrack, almost every part of this game hooked me. My only real negatives is the game does stutter and has texture problems every once in a while. But, once I lowered the graphics, the game ran like butter. Final Fantasy Rebirth is one of the best RPGS out there right and with how much content there is, it'll keep you busy for a good long while!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i never goon to tifa and aerith or yuffie again. everybody please just goon to scarlet.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I played FF7 Remake only because it was free on PS5 and I ended up loving it. Rebirth takes everything that worked in Remake and cranks it up massively. The world is bigger, the characters are better, and the story hooked me the whole way through.\r\n\r\nTo be honest, I’ve never been a big Final Fantasy fan. I always thought the series seemed a bit… nerdy. But Remake and Rebirth have totally won me over. It’s an incredible single-player experience with tons of heart, charm, and some wonderfully weird moments that feel distinctly Japanese in the best way.\r\n\r\nPerformance-wise, the game isn’t perfect, but using FF7RebirthFix sorted out pretty much all of the issues for me. Once that was installed, everything ran smoothly enough to fully enjoy the journey.\r\n\r\nIf you love single-player games with great combat, memorable characters, and a huge world to explore, Rebirth is absolutely worth it. Easily a 9/10, maybe even a 9.5.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Mini-game collection\na waste of music and characters\nDespite being an open world, parts of the game is painfully dull. Exploring the map is a chore, there’s pointless filler everywhere, and every new area repeats the same awful tasks. It completely kills any desire to continue playing.\nA huge disappointment, squandering both the IP and its characters.\n\nExcellent presentation, top-tier character models, and chapter 13 and 14  are genuinely impressive.\nAerith 1000000/10\nlook forward to seeing even better works in the future",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When choosing between Aerith and Tifa as your love interest it should take in to factors like personality and how they treat cloud in addition to their attractiveness.\n\nIn reality it usually boils down to do you find elle fanning or sydney sweeney hotter.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I hope the third series of this game fast released, nostalgic seeing all character in 3d",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll put up a detailed review soon but, for now, I just came here for the badge. I loved this game. I love it so much, it made me retroactively love Final Fantasy VII. (VI is best, eat me.)",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "The story of this game is amazing, combat is great and i think it has some depth in it.\nSide missions are boring and repetetive. Overall I had great time after stoping doing side quests.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It may be a bit long with the desire to do the side quests (and even more *after* that), but still probably had more fun with it than Remake. Hopefully the next one doesn't have quite so much extra filler fluff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it on PS5 (non-Pro), but the compromises were rough. On PC at High settings and 90+ FPS, the game finally looks and feels as it should.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s an experience that keeps surprising me even after hundreds of playthroughs. The world feels alive, the combat never gets old, and the emotional weight hits just as hard every time. Truly impressive how Square Enix managed to make nostalgia feel brand new again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would recommend this game at it's base being FF7 and to continue the story. \r\n\r\nHOWEVER... Be prepared for extensive, repetitious and unnecessary mini games JAM PACKED throughout the entire game. Between the mini games and Chadley popping up after EVERY. SINGLE. THING. YOU. DO. I gave up on almost all the side quests and world exploration soon after Corel.\r\n\r\nOther than those two pita issues the game is solid. Story is great, controls and mechanics mesh well and the visuals (on ultra/high) are stunning from start to finish.\r\n\r\nCan't wait for part 3. I have high hopes that they won't ruin it with mini-game central and Chadley takes more of a back seat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent revisit of the FF7 universe! This game is MASSIVE compared to Remake, especially if you want to do all the sidequests.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played almost every Final Fantasy game and especially FF7(original version) and they did the game justice in this remake any Final Fantasy fan will love this game for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite late writing this review since I'm not the type to write reviews on steam but also writing for the steam nomination tasks. Btw I am writing as I am on Chapter 7 and will not give spoilers either.\n \nPros- \nWorld design\nAll playable characters are fun to play and fight as.\nStory is engaging but can be abit of a drag at times.\nGraphics looks so nice especially on a OLED monitor but frame dips can possibly ruin it at times.\n\nCons- \nSO MANY minigames to the point it becomes such a chore and headache if you want to attempt at 100% the game.\nOptimization isn't the best. Frequent frame dips, not the worst but can be quite noticeable at times. I play on ultrawide so a mod is essential if you desire to play it on one. I am also not 100% sure if the mod is affecting my fps but i doubt it since I had the same issues before modding the game.\n\nThat's all i can think of at this time of writing this review but happy holidays and happy gaming peps! :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Huge improvement in the battle system compared to the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolutely massive game that quickly rose to one of my favorite RPGs of all time. Over 100 hours in and I'm not done yet.\n\nAt times the game can almost become overbearing with the amount of side quests and mini game content, but you can really tell that Square Enix's focus on this was making every aspect of it as fun as possible. \n\nMy only real complaint was having to re-get a chocobo in every location. After the 4th or 5th time that gets tiring. \n\nWell worth a playthrough, but make sure you have the time to truly appreciate this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really enjoyed the story, side quests and the battle mechanics. i do wish the party would talk more just during exploration to add something besides ambience. other than that, it’s super fun and i highly recommend it!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's remake but better in every aspect, the combat is mechanically great and it's story/characters are beloved.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is the best game in the world in my opinion and yes this is because i love cloud strife",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great storyline, tons of minigames and adventurous open world included!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7.5/10\r\nDecent open world, great story, and gameplay feels a little better than the first part.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While this part had much more side content deviating from the original story, I enjoyed most of it very much.\nI won't blame core FF7 fan for not liking the new elements, but I can understand.\n\nIt's a great game with lots of content, visually stunning and deep story elements.\n\nLove it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game expands the world of FFVII into a vibrant, living landscape filled with exploration, emotional storytelling, and impressive combat depth. Each region feels meaningful, offering optional quests, character moments, and environmental variety that make traveling the world a joy rather than a chore.\nThe real highlight is the combat system, which blends the strategic ATB style with action gameplay perfectly. Synergy skills between characters add fresh layers of teamwork, making party composition more engaging than ever.\nCharacter development is outstanding—Cloud, Tifa, Aerith, Barret, and the rest of the cast are brought to life with richer expressions, voice acting, and moments that deepen their relationships. The story balances respect for the original with brave new twists, keeping even longtime fans on the edge of their seats.\nVisually, the game is stunning, with beautiful cinematics, detailed environments, and a soundtrack that masterfully reinterprets classic themes.\nIf you love cinematic RPGs, fast-paced combat, or character-driven adventures, REBIRTH is absolutely worth your time. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play the original Final Fantasy 7. This makes me relive the world in another timeline. I'm so happy about it. Hope to play the last part soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but if running on the map is not a super good experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Didn't finish the game and will not finish. There are two reasons. First, I don't really enjoy the game. I was in the middle of the game where my motto to play finally dropped and then I came back, mostly because I wanted to know how story unfolds, then I got bored again. And then even if I want to come back I can't because my save file is lost and game feels not that enjoyable and great to replay it from the beginning again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll post an update once I've gone and completed the game, but so far I'm quite enjoying what I've played so far. I think they could tone the goofiness down a bit, but besides that the game is living up to everything I've expected.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a huge fan of the original FF7 for PS1, this game rekindled my love for the characters. While it is unfortunate that this game isn't the 'full' remastering of the FF7 game and you'll need to play a few more of them to experience the full story arc, this specific game expands significantly upon development for the characters we grew to love in the original. The side quests, while occasionally tedious, help to expand the world and give it a more immersive feeling. The graphics are beautiful and it's amazing to see some of the iconic scenes in high definition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is about as close to perfect as I could ask for in a FFVII game. I think this entry alone is better than the original FFVII. Visuals, music, voices, combat... everything its perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so awesome! I really felt like i was in the game while playing... too good... give me my steam badge... thanks valve...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Remake part 2 of one of the best JRPG's ever made. Fantastic game with tons of content. Story and characters are still amazingly written and voice acting is great both in Japanese and English. \r\nCon: Too many minigames. Please tone this down in part 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than the first entry in every single way and doesn't feel padded despite being much longer. It isn't the best optimized for graphics memory so you may have to tweak settings a lot to find the best match. For me with a 6gb rtx 3060 I was able to play it fine at medium settings with textures set to low, seemingly its a gpu memory hog and would drop to a snails pace in cutscenes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a fan of the original final fantasy 7 and the first remake, while I am not through this one all the way yet it is a great game with, for me at least, at good amount of difficult areas that you can venture to, maybe ahead of when you should, to give yourself a challenge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was perfect when it originally released almost 30 years ago, it's perfect now in its remake form.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolute masterpiece for players of the original and new players of the game. I suggest playing through both the original and this version. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love Final Fantasy. Love it. I would legally marry this franchise if I could.\n\nIs Rebirth like the original FFVII?\nAbsolutely not. And why on Gaia would you want it to be?\n\nIf you wanna play the originals… play the originals. They’re still there.  Still as good as ever, I reccomend. But this game?\n\nCombat? Fun. Flashy. Half the time I’m mashing buttons like a raccoon on espresso and somehow it still looks cool. Perfect game design.\n\nBugs and glitches? Honestly, for me it’s been pretty chill. No game-breaking disasters, just the occasional weird hitch or animation doing parkour for no reason. Little moment of “okay, that was cursed but we move\"\n\nThe story though. THE STORY.\nIt feels like someone took a normal JRPG script and said:\n“I wonder what it would look like if it was a fever dream?”\n…and then nobody said no.\n\nIt’s like:\n\n-40% simping for Sephiroth and his stupid perfect everything\n\n-25% emotional damage you were not prepared for\n\n-15% nostalgia hitting you like a Limit Break\n\n-10% “thrusting your sword” at anything that looks even slightly hostile\n\n-10% pure fever dream where you’re not sure if it’s lore, a hallucination, or someone’s fanfic Square Enix accidentally greenlit\n\n\nHalf the time I’m sitting there like:\n“I have no idea what’s going on, but I’m entertained, confused, and emotionally compromised, so that’s a 10/10 experience actually.”\n\nIn short:\nIf you want nostalgia, boot up the original.\nIf you want chaos, drama, 40% of your brain simping for Characters, and Cloud being so oblivious to women’s feelings he should count as a debuff, play Rebirth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This might actually be the greatest AAA of the decade no cap\r\n\r\nI genuinely find it difficult to imagine the next part of this remake trilogy expanding on what Rebirth did right without feeling genuinely bloated and overambitious- Besides the divisive plot and it's occasionally questionable pacing. (And, er.. Chadley interjecting in the open world every 20 seconds..)\r\n\r\nThe characters are lovable, the soundtrack is amazing, the world is beautiful (when the lighting doesn't butcher it), the RPG aspect is surprisingly layered and flexible, and all of the playable party members have a level of depth to their gameplay that's hard to find even in recent hit ARPGs, such as Elden Ring.\r\n\r\nSeriously, it's a crime this game was imprisoned on PS5 and missed a fair shot at GOTY. I implore even diehard 'golden-era' (VI-X) FF fans, come at this one with an open mind, and I find it hard to imagine it will disappoint.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolute boatload of fun things to do.  One of the best FF games I've played.  If you're open to this game not being a 1:1 of the original you will surely enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good and bad in the same time idk how to explain, As a new player to the series i only played this game and the remake, i see that the story and the plot is pretty bad and makes no sense althouuu i liked the characters so much , overall 7.8/10, if you like a long beautiful journey in a beautiful world with good characters and a bad story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really great experience for visual, storyline, gameplay & the game has the most enjoyable soundtrack to play with. You'll probably confuse with paralel reality storyline, but if you have been playing old FF7 game & watching the movie, you'll understand the perspective of the mainstory is from the Cloud denial perspective. Which I hope the developer can make a clear conclusion with the release part 3 of the game.\r\n\r\nOverall 9/10 *",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game mechanism: ★★★★★\r\nStory: ★★★★☆\r\nMusic: ★★★★☆\r\n\r\nThe game mechanism is improved lot after final fantasy remake. In rebirth, it has prefect dodge and block.  Besides, each characters have their own attack style, and the character that I like the most is Tifa which has high speed combo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. Great Graphics. Good take on Alternative timeline.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best Final Fantasy Games i played so far\nas a guy who platinum and 100% multiple Final Fantasy Games like FFVII, FFVIII, FFIX, FFX, FFX-2, FFXIII, FFXV, FFVIi Remake, FFXVI, and Stranger of Paradise.. Final Fantasy VII Rebirth is one of the most engaging and massive game that i can spend hours in this. i just bought the PC version because i saw many nice mods i can play around with.\n\nStory\nThe Story in Rebirth is really one of those that hit you hard with endless emotions that you might unable to sleep, eat, or even play any video game once you beat this.. it leave you with theories and lingering thoughts of what really happen.. So don't worry just dive in the game even if you played FF before or not. you will have a good time.\n\nGameplay\nVariety of gameplay that is not monotonous like a \"certain\" games that is popular in the recent days.. this game will keep you engaging and hooked. you will experience what it's like when video games are made to be a fun video game. Combat, Mini Games, Card games and more.. you can walk around the open world of final fantasy and explore. you can ride on a Chocobo just for fun, you can right in different types of vehicles.. you can challenge various npc into a card battle, you can challenge high score with tons of mini games and more! everything is just fun. it's a definition of what a \"VIDEO GAME\" suppose to be. which is fun.\n\nMusic\nEnjoy the classic FF7 music with new remake arrangement. and also many new original tracks that i made for the remakes. they even called the legend himself \"Nobuo Uematsu\" to get involve with the project.\n\nCharacter \nThe characters are well made in depths, each characters looks good, plays good, and also properly made with proper character development. each character have their traits and lovable characteristic. even the NPC are made with care and thoughts. like even in combat there are synergy skill you can used with other characters where is unique to the characters and their relationship. like Tifa with Cloud or Cloud with Aerith and so on. BEWARE you WILL fall in love with the Characters\n\nThis game has been my GOTY in 2024. and i will nominate it to be the best game in Steam Awards along side with Stellar Blade.\n\n10/10 game for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have played the original. I love that game so much. But this remake is amazing. The graphics are beautiful. I loved it. Now remake XI lol. Can hardly wait for the 3 part of this game. Amazing job.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a fan of the Final Fantasy VII universe, the new releases gave me everything I wanted to have. Rebirth puts the ladder a bit higher as Remake, the open world, the whole journey, the cinematics, everything comes good together, even if they seem to be somewhat long. Yes, there is some filler content, but even the fillers give you some more story you are hungering. The wibe of Remake and Rebirth is somewhar different from the original game, not only through the gameplay, but also the story and the atmosphere. The old game hadd some really chilling scenes and situations, mostly because you have mainly read the plot. Here you have the superior graphics and animation, which helps to immerse yourself in a different way.\n\nI can undderstand, that this game is nor for everyone, but if you like RPG-s and don't \"hate\" JRPG, you should get a go with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looking back, probably shouldn't have taken this game and broke it up into 3 very long games. However I've invested the time to beat two of them. I'm in it until the end now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a longtime fan of the original Final Fantasy VII, I was eagerly awaiting the remake, and I can happily say it exceeded all my expectations. The game is a truly captivating experience — the story is engaging and emotionally charged, drawing you in from start to finish. The graphics are absolutely stunning, creating a breathtaking world that feels alive and immersive. The characters are unforgettable, each one brought to life with incredible detail and depth.\n\nI'm already looking forward to the next sequel with great anticipation. By the way, I would love to see a similar remake for Final Fantasy VIII — that would be fantastic!\n\nOverall, Final Fantasy VII Rebirth is an exceptional game that I highly recommend to both fans and newcomers alike. A true masterpiece in every respect!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Final Fantasy VII Rebirth is gorgeous, fun, and full of great character moments and combat. It’s an amazing continuation of the remake series. But wow—there are a lot of minigames. Most are fun, but the sheer number can interrupt the flow.\n\nStill, it’s absolutely worth playing. A fantastic adventure with maybe one distraction too many.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, part 2 of 3. Waiting on the next one. If you ever see it on sale worth the get.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story, great visuals and cutscenes, and truly revolutionary gameplay. Music is great too. I will say it is not the most stable at times, and can suffer from crashes and stuttering. \n\nStill worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rebirth hooked me because it makes the FF7 world feel bigger and more alive than ever. Coming from Remake as my first Final Fantasy, this entry pulled me even deeper into the lore and story. It’s one of the few games that truly invested me in its world and left me wanting more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very well made remake of the original game, and I like the new additions. Waiting for the part 3 to end the story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Final Fantasy VII Rebirth is everything a nostalgic fan could hope for—familiar, emotional, and reimagined with stunning detail. The world is huge and alive, the characters feel more real than ever, and the synergy-focused combat makes every battle feel like a true team effort.\n\nIt respects the heart of the original while adding fresh twists that keep the story exciting, even if you know the classic by heart. For anyone who grew up loving FFVII, Rebirth isn’t just a remake—it’s a beautifully modern return to a world you never stopped caring about.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This one is more open than part one, but they've definitely changed the story more and with more open areas you may find some side quests and bosses need some grinding. Still overall better than part 1 since it's a much bigger game, eager for the conclusion!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What can be said. The final Fantasy series have been the bread and butter for many in my generation. The stories, the character development, companions and enemies. as the years progressed and systems became more advanced, the series grew. So to have them decide to remake one of the most popular installments and as a trilogy no less, well lets just say alot of original player base became excited and scared. We hoped that we could relive Clouds story, but we didn't want him to become someone he was not in the original. \n\nI personally have to say I wasn't disappointed. Of course there are aspects of the game that wont please everyone, but I think we call mostly agree that we all got something we wanted. Well done Square Enix, you have always prioritised the story when you have created games and I tip my hat to you. \n\nIf you are new to the series or joined later in the series, don't panic just start from the game thats most appealing to you, I will always recomend take a walk though history, playing some of the older games. 7 of course is the most popular place to start the pilgramige. but forget not 1 to 6 (if you can get over the grafics we grew up with) and of course 7 to where ever you decide to stop. There will alaways be a story for you.\n\nhappy playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Nine out of ten. Improved combat from Remake, with new mechanics and abilities. Awesome graphics, incredible performances epic music.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Felt like a step up from Remake. A ton of content, and while some of it felt a little dragged out, I enjoyed it overall. \n\n[spoiler] Plus Aerith and Tifa finally got to go on an official beach date. [/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☑ You forget what reality is\r\n☐ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☐ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☐ Fast\r\n☑ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ 10 / 10 }---",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An incredible sequel that improves on Remake's combat in every way. The synergy attacks are satisfying and the world is gorgeous. However, the pacing suffers from too many mandatory minigames and open-world. If you love these characters, it's a must-play. Just ignore the side content if it starts to feel like a chore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite its outdated game engine,FF7 RB was still a great successful game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good game, but would have been great without any western \"alterations\".\nStill easy way above average. (but if I could I would sue/imprison western consulting institutions for spoiling a masterpiece)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A 10/10 masterpiece.\n\nGraphics are cutting edge.\n\nMusic is some of the best of all time.\n\nThe story is even better than the original.\n\nThe game-play is incredible.\n\nSquare hit a home run with this one. It's a real shame so many people have passed on the opportunity to experience it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When developers put their love into a game you can tell, and this game is no exception. Genuinely some of the most fun i have had in any game i have ever played, really unforgettable story, characters and music, never have i seen a game get hate for being too bloated, which i agree on, but i am not complaining. Almost all side content in this game ties in with the story and gives more depth to the characters, giving actual meaning and motivation to explore all nooks and corners in this game. Awesome cutscenes, boss fights which feel like a movie at times because of the amazing battle system. That and all the charming character interactions is all even further elevated by one of or if not the most special soundtrack in all of gaming, and that is coming from someone who has played Expedition 33, i mean where else can you go from cute, catchy cat dance music, then to rap segments and THEN to \"One Winged Angel\" or \"Toward Mt. Nibel\". Can't wait to see how they build onto this in the 3rd part. Everyone involved deserves all the glaze multiplied by 10. This has truly been the final fantasy 7. Masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Final Fantasy VII Rebirth is a sequel to my favourite video game of all time, and while I don't believe it reached the highs of the first, it evolves the gameplay and world and opts to instead have tons of new stuff to do, ways to play, and a larger variety of builds and playstyles.\nThe game has issues with performance, especially with AMD gpus since it has no native implimentation of FSR or XeSS. Expect this game to put your build to the test with its excellent looking open world.\nThe story does a lot of side tracking and covers a decent portion of the PS1s story, while not finishing it, opting to have a third and final game that will be releasing, the story is a certain step down to Remake, which shocked me because not even the introduction of a personally beloved character, Cait Sith could save me from rating it as a down grade.\nAs a game, you will have fun with this game if it is your kind of game, but it's a clear downgrade to Remake, play Remake if you have not already.\nThe issues with this game are:\n- Performance\n- Filler in the story\n\nThis game excels with:\n- Great OST\n- Great character\n- Excellent open world\n- Extremely fun gameplay\n- Okay story\n\n7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game from a guy who beat the original FF7 this edition is not bad. Can't wait for part 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played FF7 as a child, this feels more fleshed out. Don't get me wrong, the original FF7 will always have a place in my heart, but this feels like how my imagination ran wild in the \"2.5D\" game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Final Fantasy VII Rebirth is exactly what you'd expect after playing FF7 Remake. It is a faithful recreation of the world we grew to love way-back-then. Some things may strike you as different or have a different tone when you imagined, which is what makes these remakes special. They haven't taken away from the mood and the presence the original 1997 game created. But it will create a new path, new stories and added bonuses you can believe would have been present in this game.\n\nThe excitement you get from playing this game is crazy, it's well worth the money and especially recent 50% sales make this monstrosity of a game well worth it.\n\nThis same treatment should be extended to FF8 and FF9 - which could all-too-well use this same level of polish and love.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome, completely worth the sales price right now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game I played all year. So good I had to do literally everything.  The story brings back all sorts of nostalgia, while daring to give hope for change. I eagerly look forward to the final chapter.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Way too much padding for time, it gets fatiguing\r\n\r\nGood game otherwise, but the pacing's ruined",
      "voted_up": false,
      "votes_helpful": 102
    },
    {
      "review": "THIS GAME IS NOT A REPLACEMENT FOR THE ORIGINAL. THEY ARE VERY DIFFERENT EXPERIENCES. \n\nLet's see... Removal of blood, gore, suicide, and really anything mature in the slightest. It's SO HEAVILY influenced by modern anime it's annoying. Tropes and all. \nYou constantly meet characters who have nothing to do with FF7 or the plights of it's world. IT'S FLUFF not good worldbuilding. I love the original. It was a very dark and mature game with amazing worldbuilding and some levity, now it's bouncy and colorful... all the time. The polar opposite to what they are emulating. If they tried to make something better than it's legacy, they didn't. Laced with creative decisions that are just baffling.\n\nNot every person you meet has to be a character. In the original you had plenty of people around who would say one line to clue you into what's happening in that area.... Rebirth decides to make every single one lining poor sap into an actual character... that you have 30+ minutes with, and they have zero impact besides a checkmark on your to-do list. None of them make the world feel bigger and fuller like they want you to believe.\n\nThey can never let the scene talk either. Music when it's not needed and especially when there shouldn't be. The biggest drama can happen and they always have to swap to \"SUDDENLY RANDOM SHRINA SOLDIERS LOOK OUT!!#!@#!\", and a mech fight blasting some random music that ignores everything that just happened. There is no sitting with the scene in this game. It's loud and bombastic all the time because Sephiroth is ALWAYS just five minutes away on speed dial. \n\nI had some hope for things with Remake but this solidifies their vision. It's not something I want. \nA lot of us wanted a way for people to experience this story in a modern time, and this is just not it. It's something else entirely wearing the skins of characters you knew.",
      "voted_up": false,
      "votes_helpful": 95
    },
    {
      "review": "after all this years, got some reading in the internet and a lot of talks with my friends about this game, those keep me buy this game. don't get me wrong, FF7 is a pivotal game of my life, especially my elementary times. i loved FF7 mainline story (eventho' there's a lot of FF7 spinoff that doesn't have storyline that make any sense).\n\nand then, despite everyone said this is not a good game, i bought this. and internet and my friends are right. this is not a good FF7 game. This game is a good game, good combat, good graphic, good reintepretation of Gaia, but Square Enix are trying so hard to be EA, the story itself so far good, but the narrative presentation are so cringe. it's not a game for a long time ff7 lover (which is an adult right now). this is for teen or young adult at most. \n\nMaybe when i have time, i will try to finish this game, which is i doubt i will do a completionist playthru. maybe i will finish this game just for the sake of my youth. maybe.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This is what happens when you get a beloved franchise and shove a bunch of irrelevant garbage in it just to extend play time. What a convoluted mess of a game this is: \n\n1) Open world exploration elements are Ubisoft-like\n2) Horrendous side-quests that kill the pacing of the story (even main story has issues in the pacing, imagine doing side quests in the meantime)\n3) Unbelievably badly written NPCs that give no insight whatsoever and serve no purpose\n4) Beloved characters reduced to Disney-like personalities [spoiler] Red XIII [/spoiler]\n5) Character texturing is super high quality but then the environment is PS3 textures. No cohesion at all.\n6) Sephiroth appears almost everywhere all the time and thus removing his horrifying villainy element that was always present in the original, precisely because you saw the destruction he caused around you. \"SoON CloUD, soOn, 7 secOnDS!11 *mysterious smirking* \n7) [spoiler] Aerith's death was trivialized because noone knows if she's dead or alive, you literally feel nothing over it because in one scene she's dead, in the next she's alive, then she's dead again [/spoiler]\n8) This is an actual line in the game by one of the [spoiler] most legendary summons ever presented in a FF game, Gilgamesh: - This is not my Excalibur! This is but Excali poor! (I have never felt more anger in my life) [/spoiler]\n\n*Fun fact about No.8. In Final Fantasy VIII (where we actually see Gilgamesh, not FFVII), he does use a sword called Excalipoor that does 1 damage and then grabs the Excaliber and annihilates everything. So yes it was in the old FF, but my god it was not presented like a Marvel-esque dumb Disney character under the name \"Eccentric Swordsman\", who at one point of this absurdly long running stupid quest for the protorelic, you find him flushing the toilet as you are transported in his dimension and tells you to leave because he's not done. Disgusting childish writing, what were they thinking?\n\nI could go on forever and this would only get worse. \nI forgot to mention the horrible stuttering. \nAt least the battle is fun.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "As a fan of the original, I played Remake and thought it was an average game.  I saw a lot of comments about how Rebirth was a fantastic game and worthy of Game of the Year from content creators like SkillUp.  I thought that maybe Square had improved and created a real good game that while maybe it didn't match with the orginal, it would be a good enough game to stand on it own.  Unfortunately after 15 hours, I'm struggling to continue to play this game.  \r\n\r\nFirst off is just the amount of busy work quests that they added.  I didn't like them in Remake, but they're worse here in Rebirth.  The entire overworld consists of go here, complete a QTE mini-game style quests.  It makes it feel like a mobile game.  It's just unnecessary bulk that is intended to inflate your playtime.  I really miss the games where side quests were optional and you could focus on the main story for your first play through.  In this game, there's so much materia and equipment that you receive from Chadley's quests and other side quests that it doesn't feel like it's optional anymore.  I feel forced to complete this content otherwise I'm missing out on upgrades for my party.  It'd be fine if these were fun and engaging quests, but instead it just feels like garbage intended to waste your time.\r\n\r\nFinally, I have to mention the music.  The original had one of the most memorable sound tracks that I've experienced in gaming.  Since the original didn't have voice acting, the music had to carry the entire emotional weight of every scene.  The fact that it succeeded in doing so is why it's such a memorable sound track.  The music in Rebirth is just completely forgettable.  They went from the some of the most memorable songs to the most generic and forgettable.  \r\n\r\nIf it wasn't for the FF7 IP and nostalgia, I really don't think this game would have done as well.  Aside from the graphics, everything is on par with mobile games.  I'm dropping this and switching to Red Dead Redemption 2.  I haven't played RDR2 before, and my first 30 minutes in RDR2 shows just how bad the storytelling and narrative is in Rebirth and Remake.  So yes, I'm dropping Rebirth after 15 hours in hopes that RDR2 provides a better narrative experience for me.  I may come back to finish this game in the future, but I definitely won't be back for part 3.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The ending of Part 1 is about how we've broken the chains of fate and now we're no longer bound to the original game's story, only for Part 2 to mostly play that story dead fucking straight.\r\n\r\nMaybe the 3rd game is going to tie everything up and make this long REmake journey come together in hindsight, but so far, the 2 parts of this 3 part epic have been awful over all. A lot of tasteless AAA bloat with just enough amazing moments sprinkled around to keep you strung along.\r\n\r\nIt suffers from the problem a lot of remakes do, which is including iconic moments without understanding what the original team did to make those moments iconic. People may pull up that I'm blinded by nostalgia, but I believe there is power in abstraction, and unfortunately this (occasionally) gorgeous paint job leave very little to the imagination.\r\n\r\nBest part of the game was the Queen's Blood mini-game. One thing that kept me going was the joy of having 3 new opponents each location.\r\n\r\n\r\nArt is subjective, but when the settings are turned down to get better frames, the game becomes mighty ugly.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "[h1]Final Fantasy VII Rebirth A game almost ruined by modern trends [/h1]\n\n\nFF7 Rebirth captures the magic of the original PS1 open world beautifully, delivering a decently sized world  with side quests and activities that make progression incredibly satisfying. Gathering and leveling up materia, alongside party growth through diverse quests, feels rewarding enough. Yet, glaring flaws drag it down. Those Ubisoft-style towers? A stupid chore to chase for map unlocks; one per region  would suffice. The world map's segmented design disappoints compared to the seamless PS1 original. Brutal 1-on-1 duels, like Cait Sith and Barret vs. Dyne, clash with the party's synergy-driven combat. And locking out Vincent and Cid as playable members? An unforgivable crime.Still, Rebirth shines as a must-play for fans—flaws and all.\n\nOH and this part of the remake doesn't have a fully flyable highwind airship.\n\nEDIT: Got to a part of the game where you are forced to play a minigame called 3D brawler\n         It isn't winnable without studying it for hours on end and hoping your hits land with RNG \n         Until theres an option to skip it my playthrough is effectively OVER! \n         yep\n\n1.4/10   - Avoid buying for now",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "--- TL;DR ---\nI would not at all consider this game a \"must play\", even for fans of the original. Cutscenes/music will be a high point and the rest will be a very mixed bag.\nIf you loved REMAKE you will probably love this game, otherwise temper your expectations.\nIf you're a diehard fan of the OG and loved Advent Children then you will probably love this game, also you are delusional.\nIf you're a diehard fan of the OG but recognized Advent Children was an Abomination, you should probably temper your expectations.\nIf you're anyone else, probably go look at REMAKE first lol \nI think some other review here mentioned \"Chadley Slavery Simulator\", 100% true. F*** Chadley\n-------------\n\nThis is a case where I'd like to give this a \"maybe\" recommendation. Since that's not an option and there are already so many positive ones, I'll tilt towards the \"No\" side. If I didn't love the originals as much as I do, I think I would have been pretty unimpressed with the whole package, even if it's \"fun enough I guess\" as a whole and definitely has some high points.\n\nThe visuals and soundtrack are incredible, probably the only part I can say I like without reservation. The various regions are beautifully realized, the music always serves the mood, and the cutscenes give superb definition to moments from the original that just can't really be well conveyed with so few polygons.\n\nThe gameplay on the other hand is pretty meh for me. First, the combat. I have a feeling this was a combination of 1) Doing all the side content as soon as it was available (as I was aiming for full completion) and 2) Not setting difficulty to Dynamic. The result is I ended up pretty over-leveled, and just mashing/ATB-spamming (2+ enemies? Triple-Slash. 1 enemy? Braver.) my way through fights was faster than anything else even if it's not as \"resource efficient\". Functionally infinite cure/revive magic takes care of the rest. You can mess with Materia for fun but you'll probably be so strong you won't have to optimize much, if at all. Doing all the Protorelic side quests grants access to the most fun fight in the game (and a few of the most annoying ones), but I won't spoil those. If you play on dynamic or do less side content YMMV. On the bright side, the block/perfect-block/dodge stuff feels a LOT better than it did in REMAKE. I just don't find the system very satisfying compared to other games. \n\nOn the non-combat gameplay side, storyline quests and minigames (like the Junon march, for example), are pretty fun, or at least cute. Unfortunately this feels like it encompasses about 25% of the game's content. The vast, vast majority is the worst kind of Ubislop meme-tower checklist garbage coupled with a baffling number of minigames that aren't particularly fun or memorable. Each region's side content feels pretty cookie-cutter, and the character side quests are basically the same bland fetch-quest or kill X monster activities, with a short character interaction thrown in between each stage of the quest. The character stuff is cute I guess, but the later in the game you are, the more this all feels like a drag. The most fun way to play this game is probably to do just the character side quests for the characters you like, and any side content that happens to be along the way (so you're not under-leveled). Otherwise just tunnel-vision the main story, as everything you're skipping is boring filler. Throw in the Protorelics if you want those aforementioned extra fights, but be aware this is gonna commit you to some pretty rough minigames. \n\nThe story is what I'm torn on the most. The characters (except for Aerith, who for wacky spoiler-y lore reasons ends up kind of *off*) are all true to their OG selves and they're as endearing as ever in a goofy anime way, of course. The story is too, until it decides it wants to do silly convoluted timeline nonsense. The result is a story that is the most awkward combination of 1:1 retelling and rewrite. I would have strongly preferred that they EITHER fully commit to retelling the original story, or fully commit to writing a different one using the same world, characters, and setup. What we got is a 90% retelling where the 10% difference just brings everything down. The ending of REMAKE teases that the writers have granted themselves freedom to do whatever they want (which they already had) and it would have been fine for them to exercise it. But then they chose to do not much of anything different anyway. As a result, the story is mostly good insofar as the original is good. A few key areas (like the Golden Saucer) are elevated to a wonderful new level. Almost the entire end of the game is a disappointing clusterf*** that pretty much ruins the emotional impact of the scenes it retells. Also, If someone hasn't played FF7 OG and Crisis Core or something, I'm not sure ANYTHING involving Zack makes sense. It's definitely not necessary (which even Squeenix knows, because you can completely skip the Zack chapters on 2nd playthrough lmao).\n\nI really wanted to like this game because I absolutely love the original, but unfortunately the reality for me is this whole experience, save for a few key highlights ,was pretty mid. I think Square Enix has become pretty afraid to take risks gameplay or story-wise. So we get a generic open-world gameplay loop with terrible sidequests, a solid but mostly uninteresting combat system, and a story that waffles between one-to-one retelling and occasional Marvel Multiverse Fanservice Soymaxxing. It's all so sadly underwhelming. I think I'll finish out this trilogy and then I'm done with FF games for a while lol",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Way too much filler, way way too much unskipabble interstitial fanfare, too much repetitive dialog and an offensive amount of cringe.\n\nThere's a great game in here, if you mostly stick to the main path and can stomach some weaboo jrpg dialog (everyone is too cutesy or naîve). If you stray too far into the side-content, or if you're cursed (as I am) with completionist syndrome and try to clear all side-quests in every chapter, you're going to have a BAD time.\n\nYes, Chadley, I know I surveyed the lifespring. I did the boring ass 3-button QTE, then the game took control away from me to flash a big \"SURVEY COMPLETE\" on the screen. I don't need you to call me and lock me into dialog just to tell me all about what I just did; this is the 14th time I've done this, can I please just cross this off my checklist and move on? WHY MUST YOU WASTE WHAT LITTLE TIME I HAVE ON THIS EARTH, CHADLEY?!\nNo, seriously, find a \"world intel\" video on YouTube and watch how needlessly drawn out all of these quests are.\n\nI was excited about Queen's Blood (the card game), at first. I loved Triple Triad, this'll be great! Nah, the game is overdesigned and too easily exploitable, so this aspect also just becomes about going through the motions so you can collect everything. There also aren't any stakes, at no point do you risk losing your cards, so you can infinitely brute force matches, if that's your thing.\n\nBut to me, the most egrigeous offense is how this game handles some of the story beats. I'm not going to spoil anything, but so many elements and plot points left me disappointed. There was one specific scene from the original that always made me cry as a child; in the remake, you're not even allowed to sit with the weight of the scene for 5 seconds before a dang ghost appears and brings you to the retcon dimension.\n\nIdk man, there's obviously a market for this game. If you're a fan of modern Squenix games, you'll probably like this. If you're an old head looking for some nostalgia, you might do better to replay the original",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game after a mini game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Please at minimum just fix this awful lighting. Bonus points if you remove the horrific motion blur in cutscenes to let us take screenshots that don't involve characters turning into mush.\r\n\r\nI keep putting off playing through this game because of how inconsistent and generally bad the lighting looks, from the absurd eye adjustment effect when even close to a door, to just really bad quality making character models in gameplay look awful, it essentially just ruins what would be a pretty fantastic looking game otherwise.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This Isnt a remake of FF7, Its a complete rework. They kept almost non of the story elements the same, they spent more time adding mini games than they put into the actual game, This game is deeply flawed for many different reason.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It's hard to recommend this one. I don't hate it but I don't love it either. It's a very mixed game. \n\nThe moment I entered the open world and I had to climb and scan my first Ubisoft tower I got so Angry. The made such a generic open world full \"activities\" which just feel like items on a checklist.\n \nThey also made what was an already complicated story more convoluted by adding timey wimpy soul ghosts and alternate realities.\n\nI like seeing the FF7 crew back and HD but the delivery is very underbaked and underwhelming.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Butchered classic, filled to the brim with mini games and stupid changes to the og story",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Good\n- Graphics are ok\n- Voice acting is good (red excluded, yikes)\n- Combat is sometimes fun\n\nBad\n- Lighting is strange\n- Sephiroth used to be mysterious badass, now he's just Cloud's BFF\n- Full of unnecessary filler content and stupid minigames\n- Sometimes feels like a comedy musical instead of FF7\n- Changes to the OG main story makes no sense\n- Chadley pls shut up, I wanna play the game\n- Cid has been cut and butchered\n- Red has been massacred\n- ... and more to be discovered in game! Fun!\n\nIf you were looking for the OG story with a facelift, this is not it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's taken me almost a year to get through this game. I finished Remake in its entirety, but this one I couldn't push through. Although, Rebirth expanded it's gameplay from Part 1 into interesting avenues, this title was a slog to get through and overly bloated. I kept trying to come back to it, but realized, after nearly a year since my pre-order, I realized I'm just not interested. \n\nThe title didn't live up to it's \"Remake\" moniker. It didn't respect it's source material. Nor did it respect the POWERFUL message that the original was going for. For that reason, the tone became inconsistent from a writing standpoint. They softened the heavy blows and as a result, trivialized the real world allegories the original was alluding to. \n\nThese \"reimaginings\" of the original, just don't live up to the seriousness of the topics and the issues facing our world. Characters that were once muted and subtle, are loud, flamboyant, caricatures of themselves. With wildly large gestures. Scenes don't carry a consistent emotional tone -- one example being Dyne's section. It was no different than playing a comedic parody. There were sparks of greatness, but one that didn't ultimately light a flame. Pass on this title.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "An absolute broken buggy mess. 16+ hours are just minigames and the flow is so tedious it's more frustrating than fun. Story and plot moments are fleeting between irritating segments and the game performance issues (even on lowest settings) are some of the worst I've ever seen. The graphics can be pretty and the character development is great but almost everything else is a railroaded minigame fest with weird pacing and messy gameplay due to pop-in graphical issues and stuttering.\n\nEven with the 20GB patch they put out today, this game plays like hot garbage. PLEASE FIX IT, SQUARE.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Since Steam's ratings are binary, I have to pick \"not recommended\".\r\nBut the truth is more \"its complicated\".\r\n\r\nI did enjoy some aspects of this game. The visuals and presentation is stunning. On my 3080ti, the game ran silk smooth on 144fps the entire way through, even though I locked it to 60 because my monitor can only handle that. I'd say that is impressive.\r\n\r\nJoking aside, I didn't enjoy the action combat in the first Remake and I kinda enjoyed it even less here. Too spammy action combat. I'm more of an RPG guy, so I miss the menu based ATB system. The open world stuff becomes too overwhelming too. Do you really need to spend 10 hours in each hub area before proceeding? It really kills the pace of the story, but to kill some of the harder bosses, you kinda have to...\r\nExcept... when I reached the second large area (Junon), I'd already had enough and set the game on Easy.\r\n\r\nOn Easy, you can ignore most side activities and just buttonmash through the bosses. Makes a 200 hour game only take 50 hours, and when I don't enjoy the actual gameplay, that was the way for me.\r\n\r\nBut what did I enjoy? The spectacle! I can see the love that went into each cutscene, each animation, each musical piece. There is such an attention to detail here it makes me sad I just couldn't enjoy the game more.\r\nWhile FF7 has never been my favorite game in the series, these remakes makes me enjoy the original game even more, and to any newcomer, I'd easily recommend that game over this any day.\r\nIts way shorter, has more subtlety, and I enjoy the gameplay alot more.\r\n\r\nBut if you're a FF7 fan and want to see what the remakes are about? Did you play the first remake and want more? Then, buy!\r\nI'll probably play the next one too, but I doubt I'll ever replay any of the remakes.\r\n\r\nI will replay the original for the 7th time, though...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have a tattoo of the FF7 meteor, so I hope I don't have to explain my love for the PS1 original.  Even in 2025 I'd recommend the original over this remake.  I looked forward to the remake so much, but disappointed at the lack of replay value.  \r\n\r\nThe story plays out differently from original in some ways.  \r\nThere are puzzles I would say are needlessly confusing, even for experienced and intelligent players, more or less requiring \"dumb luck\" to complete.  I can't imagine anyone playing through the game and completing everything perfectly without having to search the internet for help more than once.  In fact, many of those searches revealed other players expressing opinions of disappointment and frustration over various design flaws.\r\n\r\nThe original FF7 told the story without a drawn-out cutscene after every step forward.  There are many cutscenes I would love to skip a few lines of conversation to 'fast forward' to get to the good part, like in Mass Effect 3, but in this remake its \"all or nothing\":  either watch the whole thing or skip the whole thing.  I'd add that the conversations in this game are either poorly translated or written by \"AI\", most of it doesn't make sense or seem \"normal\" from one line to another.  Convo's in original was much clearer.\r\n\r\nAs mentioned, the story doesn't play out in these remakes like the original 3 discs.  It appears they're saving most of everything for the 3rd release; if they include everything from snowboarding to endgame then the last release has to be twice as long as first and this 2nd.  Hopefully we won't have to get new video cards just to play it, like this 2nd release.\r\n\r\nTo summarize, the devs are young.  They may have played the original, but they really don't know what its like to have grown up playing it, nor do they have decades of gaming experience, as they are likely in their 20's.  I'll admit to have a fairly low opinion toward most game testers, I'm sure that I'm not alone in noticing issues that shouldn't exist if the game testers were as experienced as some of us 'grey bush' players.  All they had to do was take the original and just update the graphics and gameplay, maybe throw a few extra quests in... It was perfect already, but they had to try changing things to 'improve' it, when imo they ruined a potentially great remake.  Graphics > gameplay seems to be the norm nowadays.\r\n\r\nBuy it or not, enjoy it or not, its up to you.  This is just one old gamer's opinion.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Unfortunately to me this entire game feels like one giant never ending filler episode crammed into a useless open world, full of points of non-interest, which are so utterly boring it would make ubisoft proud. \n\nIt's a pity since obviously a lot of effort went into making this game but I actually had to force myself through to the ending, which so far I never had to do in any final fantasy game I have played in the past.\n\nThe story also took some weird turns which feel very inspired by Disney's worst concepts, making the entire thing very feel convoluted and making it hard to follow what's actually going on. Perhaps they will shed more light on these things in the next game, but a multi year waiting period to explain things isn't the way you should end your game. \n\nIn the End it probably just isn't a good idea to take an existing story from a single game and stretch it out enough (by adding meaningless content and needlessly complicating the story) so you can milk your customers for three full price titles.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I enjoyed the most of it story wise and combat... but honestly the amount of bloat in this game is unreal!\r\nSolid 7/10, which if the bloat was balanced would easily be a 9/10.\r\nA completionist's nightmare.\r\n\r\nAnother sad moment was basically losing my save progress after almost reaching the end!\r\n\r\nSo close to perfection, and then the devs decided to add another 30 hours of unneccesary gameplay instead of just polishing what could've easily made GotY.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game feels like watching bad anime... open world is isolated... side content is booring and about nothing and so on...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The problem isn't the game itself, which is fun, though I do think its predecessor was better. The problem is that this port is in a pitiful state.\n\nHopefully Square will keep updating this version, but I wouldn't count on it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is absolutely spoiled by constant stutter. It's depressing to experience the game for the first time this way, after anticipating it for so long. Square should be ashamed of their neglectfulness here.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had purchased this game upon release, but it was a buggy mess that would constantly crash before leaving the opening level. I decided that ten months should be enough to try it again, however this game has crashed during the downloading process multiple times since I started trying to install it. I have jumped through a dozen hoops, gone through multiple restarts of my PC and edited settings on my PC, drivers and Steam account, yet the game won't download. I got it to 100% and it crashed, then reset to 30%. I've had download issues before, but not to this degree. I'd like to know if anyone else has been unable to download it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's a good game and all but I already got like 20 hours on it, finished about 50% of the content and I already feel like I am ready to move on. I don't know if it's just me but the game feels way too long and bloated than it should be and to be honest the pacing is horrible because of all the side activities. Now, it's not like I can't finish long games, like bro I got hundreds of hours on some games but for some reason I feel like I don't really want to engage with it anymore and feel like I need to at least reach the credit since i paid for it. why every AAA game now days needs to be so freakin long and bloated.. where are the 15-20 hours games you could finish in a couple of days. For real AAA games now feel like a second job . The cutscenes are very well made I would say that and it has very good OST and music but when it comes to pacing and progression, it feels horrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "would only recommend on ps5 honestly, pc is very badly optimized and it being an open world is no excuse to me. its all for sony to profit more and it just ruined the experience so much for me..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the mechanically worst games I've played, made up for by a somewhat enjoyable story.\nThe game is quite literally broken and doesn't work sometimes. It's very fun.\nThe first game was better.\nI see some other reviews saying that you need to play on easy or do all the side content. False. I completed the game on normal skipping all side content, git gud.\n\nNote: I never played the original FF7, this is from the perspective of someone who's franchise nostalgia starts with FF10.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have a fucking 4090 and an x3d processor and this game cannot run smoothly at any resolution or at any combination of settings. constant stutters, constant jittery fucked up camera and weird visual glitches like flickering textures and light sources, pop-in and weird low res LOD issues. \r\n\r\nI can't comment much about the game itself, seems good, but it's hard to tell with this abysmal fucking port. I bought it at launch and then waited a few months to see if they'd fix the fucking game, they have not. still runs like fuckin bullshit. don't bother unless you hate yourself and want to have a bad time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so dumb. I like the story. I am a big fan of the Series. I very much like the first part but this part 2, is full of side quests. It feels like they are just dragging the game to force that trilogy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has been the biggest disappointment in my 30 year gaming history. I initially downvoted because of the unbelievable amount of bloated content and especially the out of touch amount of mini games. Way before I even reached the last chapter. \n\nI have zero words how disastrous the last chapter is, with its grossly exaggerated amount of bosses. I must've spent at least 30 min in a constant wave of boss battles, if not 45 or even more. just to hit the absolute road block of a last boss. And you have to fu... do everything again if you want to change the difficulty. \n\nThey butchered the game into oblivion already but lost absolute control designing bosses. You save all your power for a specific moment just that a hard lock appears on the health bar and you're overwhelmed afterwards. \n\nI cannot fathom how rediculous they made this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is goofy.\n\nThis game's writing is obnoxously cringe and shallow, especially sidequests, which have the most forgettable and generic NPCs ever. Grown up characters act like they're children and teenagers.\n\nAside from that, the gameplay is fun. Combat built upon Remake's formula and has more depth, more options, but is a visual clusterfuck. Exploration is also fun, but as I said, sidequests don't really matter storywise and their rewards are whatever as well.\n\nGood for FF fans and for people who liked the Remake, if you can get past the goofyness.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Final Afterbirth is more \"why the hell\" modern audience DEI slop. If you want to know what I mean, just visit every shop owner and quest giver at the beginning of the game for a taste. Plus, the weird Sephiroth/ Cloud \" I want you \" stuff is very jarring. Thankfully the original still exists.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "45 hours into the game and cant pass a part going down a elevator i will never buy a game on steam trully waste of money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of best stories ever told in video games ruined by bad pacing, padded out filler content and 6 million mini games. ABSOLUTE SLOP",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "DO NOT BUY THIS GAME IT IS NOT FINAL FANTASY 7 REMAKE IT IS FINAL FANTASY AFTERBIRTH. Some of the worst gameplay decisions I have ever seen in my entire life and now I just got to the card game where it's literally rigged against you. GAMES ARE SUPPOSED TO BE ABOUT HAVING FUN NOT BEING FRUSTRATED TO THE POINT OF NOT WANTING TO PLAY.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love the game, but hate the fact that it suddenly stopped working and has no patch support from Square Enix to fix the \"fatal error\" issue that stops the game from launching permanently.  I can now only play it on my Rog Ally X (an AMD card) but no longer my main PC with the NVidia RTX 4070.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I found this game to be very boring. The story is very tiresome since it keeps switching perspectives. I just want to see how cloud's story is going.. I dont want to see zack, i dont want to see rude, i dont want to see some director. The minigames are also extremely tiresome. Why do i have to do some trial that is sooooo bloody annoying just to see a cut scene? Everything is just so tiresome in this game...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bloated, unfocused, unimaginative, plagued with fillers, with a quantity or quality approach.\r\nGets boring quickly. FF7's magic is not there.\r\n\r\nSavefile from FF7 Remake does not carry over. Excuse me??? That's supposed to be the same story!\r\nMaterias, Materia AP, weapons, armors, items, character progression, everything is lost. Except for 2 summons you can get as \"reward\" for playing Remake.\r\n\r\nThe open world is a sad excuse for a crazy amount of bland fetch/kill quests with no interesting choices/content/mechanisms, plagued with annoying mini-games and constant Chadley/MAI interruptions and useless dialog. There is no exploration as every POI has an icon, and exploration is not rewarded.\r\n\r\nSidequests suffer from the same issue. Get boring VERY quickly.\r\n\r\nCombat is chaotic mess. There are too many unfocused and competing systems and progress bars to interact with (ATB, limits, summoning, synergy, stagger). Many combats are visually difficult to track. Parrying and dodging feels very unprecise, \"mushy\". The action/turn-based mix does not work for me. Playing FF7 Rebirth combat after Stellar Blade (great live system) or Expedition 33 (great turn-based system) feel so dated, confusing and annoying.\r\n\r\nStory and characters are ok, up to Chapter 4 (when I quit). With some annoying inconsistencies. I heard it gets MUCH worse though.\r\n\r\nPresentation is meh for a AAA recent game.\r\nLightning (even with ultra settings) is often very basic and static, shadows almost non-existant, shadows minimal. Very flat and artificial.\r\nThere are many immersion breaking details here and there. Floating grass patches. Low(er)-res textures. Some characters emerge from water \"wet\" while most emerge \"dry\". Some animations don't match the environment. Water animation is pretty bad despite the game featuring water environment. Etc.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is great.....if you like being forced into doing multiple stupid UNSKIPABLE minigames on each level in order to advance at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have not been enjoying my time at all with this game. It's not fun, even though I enjoyed the previous game, Final Fantasy 7 Remake.\r\n\r\nSo I decided to skip the side content and just focus on the story, and the first or second boss, depending on how you count them, just basically said \"Either you git freaking gud, or go back to climbing towers like in Far Cry and chase some little moogles around. Screw you.\"\r\n\r\nSo I said \"screw you\" back and that I'm not getting the final episode of the 7 Remake trilogy when it comes out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so poorly optimized its not funny. Even with a good CPU and GPU get stuttering fps drops that comes and go. Just buy in on another system.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "im no longer invested. \ntoo bad because it was neat before it turned into Mario Party, now i dont care much at all.\nso random, unfunny and campy like Marvel on a bad day.\nweird shit i cant explain, like cowboys selling involuntary prostitution and Cloud just chill wioth it till its his big boobie bish.  crazy shiz boi.\n\nruns like diarrhea.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crappiest crap I ever played. They turned a masterpiece into a Bolliwood video game with no soul.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Playing this game makes me unhappy. I hate the traversal, everything being a mini-game, and the open world bloat (this coming from someone who loves a good open world game when made well). The story makes it worth playing through once if you can stomach it. Please do better on part 3 Sqeenix... please!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It feels like a ps3 game enhanced for the ps4,  no wide screen support, you have to mod it yourself.  I should have waited for it to go on sale,  id say its worth 25 bucks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game feels really bloated, like just way too much going on that feels like its just wasting your time.  Some of the mini games, like the card game are super fun while the relic hunting is just an annoying nightmare.  The story also feels a bit sporadic along.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2025 and you can't disable the motion blur, anti-aliasing, and depth of field effects in the game settings. Looks great standing still or in photo mode, but as soon as you start moving around the game looks like a blurry, melting watercolour painting. Seriously Square, 2025 and I can't turn off motion blur and depth of field in the settings menu. What are you even thinking?\n\nThe combat is hot garbage and the developers are obviously confused. Is it Dark Souls? Is it turn based? Is it Devil May Cry? We don't know. They don't know. Nobody knows. What an absolute mess.\n\nThe cutscenes, voice acting and music are all great. Sadly, I refuse to endure this terrible slop that they call combat to get the chance to see and hear it all. I played all of the first instalment and that was enough for me. As for the poor level of personalization in graphical settings, well that is just Square trying to keeping up their reputation of diabolical PC ports. Bravo!\n\nThanks for the refund Valve.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not a proper PC port. It's awful to see that the PS5 Pro version has 4K and smooth 60 FPS. But even the highest PC rig has stutters and hiccups. Square Enix can't work with Unreal Engine properly and PC players must have bad experiences. I don't know why players give positive reviews for games who didn't optimize properly. Big mystery. Shame on you Square Enix, find normal programmers or go away from the PC market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the stuttering issue was never fixed, (nov 2025 writing this),            7900xtx, 7800x3d,       no stutters apparent in ANY other game, nothing like this fvcka$$ game.         0'/10 experience.      spent more time fukkkng with settings than actually playing the game.                fvck you square enix, worthless developers.   NEVER BUYING FROM YOU AGAIN, ONLY SAILING THE HIGH SEAS FROM NOW ON",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a disgrace for such an iconic game. The combat is boring as hell, the repetitive \"side quests\" reminds me of Assassins Creed. The same thing over and over again. The voice acting is bad. \nKeep FF7 in your memory or play the original one.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Uninteresting story I don't care about the characters and I'm just flat out bored I'm not wasting anymore time on this game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Worse than Remake.  By a massive amount.   i will list each reason\n\n1: the Shaders that they force everyone to load, are for a narrow group of GPU that are from the same group as the PS5.  They are not meant for any other GPU and it will corrupt your saves and active games over time, depending on the amount of difference.  I tested this, and verified it.  I now have to skip loading the Shaders every time I load the game, to prevent it corrupting.  As long as you skip/prevent them, your game will run fine, with a few issues that will listed further down.\n\n2:  Loading issue;  Even if you are on foot, depending on the area, the game will run into loading issues, where you will run in place for a few minutes, will have to wait, save, then reload the game from the save to continue.  SE knows about it, they have openly stated that it is very low on their list of priority. They are more concerned about producing more merchandise to sell. Part of it likely has to do with the broken shaders.  They also know about that, and state that everything works on their end (likely because they have the right shaders for their GPU, the ones that they are not releasing to the public) and as such, its not on even on their list of bugs, and anyone who tries to put in a support ticket for it will be instantly and permanently banned from their website or any website that they can exert control.  I have been banned on 4 so far. \n\n3:  Fort Condor mini game: Has been drastically changed.  First Match, and the enemy AI gets to deploy 10 to 12 units of their choice, even units that should not be available except in Hard Mode last match.  First match should be a fairly simple strategy, but its modified for PC, where you might as well give up on trying to win without using a malware plagued WeMod.  (and yes, I WILL ALWAYS SPEAK OUT AGAINST WEMOD, THEIR SOFTWARE IS A SHINY PACKAGE COVERING MALICIOUS MALWARE INTENT ON STEALING PEOPLES DATA, INCLUDING BANKING AND LOGIN INFORMATION. THEY ARE THE 3RD WORST PEOPLE ON THE ENTIRE PLANET). \n\n4: Overall balance of the game has been ruined by drastic changes between the PS5 and PC version by SE. Again, pretty sure that they are working with Sony Playtstation to try and push people to buy the weak, garbage consoles and those versions of the game.  It would not surprise me, because even after SE claim that they were no longer going to give Exclusivity to any company for release of their games, they are still doing it even now with Sony Playstation.\n\nplayed a bit more, to try and just progress the main storyline.  Now its stuck because of an impossible glitch, the Practice Match against Dio.  All controls, both controller and keyboard stop responding, and because its a Tutorial Match, you cannot lose, and therefore cannot continue. As of now. I cannot ever finish the game.  \n\nThanks Square Enix, for ruining a series by being douchebag greedy twat waffles who do what their told by console companies to destroy PC variations",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[I]\"But I, being poor, have only my dreams. I have spread my dreams under your feet. Tread softly because you tread on my dreams.\"[/I]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The first one was mid, this one is just not fun.  So much cringe,,, so far off the original storyline...  I cannot recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pros:\n1. Beautiful graphics\n2. New soundtrack\n3. Queen's Blood\n\nCons:\n1. Aside from Queen's Blood, the rest of the mini-games all sucked\n2. Whoever designed Cait Sith and throwing boxes should be shot in both kneecaps\n3. Limping, crawling, being blocked by NPCs, and moving slowly is not fun\n4. Locking manuscripts behind hard mode side quests is a bitch move, ain't nobody got time playing those stupid ass side quests for a second time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spent the first 2 weeks trying to figure out why this game crashed every 5 minutes. Once I figured that out, I found the game isn't what I hoped. Too many controls needed to play this game. If you are a mouse and keyboard player stay away.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you want to get strung along for two games in a row to join nomuras dick kicking club and regret your whole life you should buy this for full price",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "All due respect, but the amount of LOST POTENTIAL and just cringe became unbearable. Imaging me thinking that the OG FF7 was also goofy like that so that's fine, it's just those type of games. And then finding out what a masterpiece an OG really was.\n\nthe arc with amusement park is just cringe and bad.\n\nMake FF7 Great Again",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Mini game, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash, then mini game, then mini game, then crash\n\nIf you spend your whole life, then another 37 lifes, you cannot come up with something worse than this piece of shit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring and slow story. Stopped on chapter 8, and the story hasn't progressed once. The group just travels from one location to another for no reason. Everyone in your party is acting like a goofy anime character. Constant crashing and visual bugs. Remake was way better. Don't buy this slop.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I will no longer be supporting this company with their stance on AI replacing workers. \n\nDo not buy their games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Will not run on GTX cards. At all. Why would part 2 not have the same hardware support as part 1? Part 1 ran great on GTX 1080.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is 90% made of boring minigames. So disappointed :(\nWhy did they do this? Where is FF7?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i can't get it to stop stuttering. how does this run WORSE than remake.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's completely broken when it comes to graphics. It refuses to save any graphic settings and it runs like garbage compared to Final Fantasy Remake.  Each time I turn it on I have to enter all of my graphic settings again because it reverts back to Ultra settings the moment I close it. You will notice stuttering, lag, and an insane amount of pop in as soon as you reach your first open area. I had to basically get Nvidia to manage the graphics because the game has very limited graphic settings and some actually just do not work (Shadows and Vsync). It is possible to get the game to run smoothly unless you are willing to look up how to do it on Youtube or something but the fact that it takes that much to play a product I purchased makes it feel like I got scammed.  Just understand that this product does not 100% function as it should and you will face a hassle every time you start it up.  This game is in urgent need of an update.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to love this game so bad. It has a TON of great features. The battle system is fantastic (Though I prefer turn-based combat). The voice acting is amazing. The minigames are great as well. \n\nHowever, there is a glaring, critically lethal problem with this game. The Story.\n\nI played the original back in the 90's. It was transformative in my understanding of what videogames to be and do. It was the first videogame that I cried to.\n\nHowever, they have reworked the story in such a way that all the things that make the original game legendary and meaningful, they have completely changed. Moments that made you cry in the old game now feel hollow. Villains, especially Sephiroth, have been stripped of their aura and mystique. Scenes meant to be solemn, like Barrett and Dyne, are now wildly sensationalized. I heard one person say it like this, and I totally agree: Final Fantasy VII is now Kingdom Hearts.\n\nI thought the first game had a crazy ending, but I was hopeful. I generally despise time bending, time travel, and alternate timelines, and this game embodies all of the things I hate about that story trope. \n\nWhat seems to be the case is that the current Square Enix team tried to make this game all things to all people, and so it ends up being nothing for anybody.\n\nA few other notes are that some of the game mechanics are extremely repetative. Scanning locations, gathering things, and other such mini-missions are exactly the same in every single region. This was fine in the first few places, but then it got old quickly.\n\nIn sum, FFVII Rebirth COULD have been a sensational game, building off of all the things that made the original incredible, and improving on things that were dated. Instead, they changed everything. This problem is rife in modern media; the hubris of modern creators to rewrite things they believe they can improve without any true intellectual understanding of what made the original great to begin with. FFVII was legendary because it dared to go all in on its themes, and it didn't apologize. Rebirth apologizes constantly and commits to nothing, but still wants you feel. I'm sorry, but that's not how it works.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I bought it today. I couldn’t run it. Tried every troubleshooting available online but to no avail. This game is complete headache",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Most comments already talk about the open world and time stalling stuff. So this comment is about the story : I don't see the point of adding all of these changes for the same outcome. I don't want to spoil anything. All  of those teasings and suspense extra moments felt pointless and like a waste of time. I think they should have just followed the original game's story. Nothing they added mattered for the final outcome.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First of all, this game has way too many mini-games, and many of them are pointless and overly complicated, especially that dreadful piano mini-game and the ridiculous workout game. On top of that, to get valuable items, players have to struggle through a pile of useless mini-games. It wastes time for older players who have little free time and want to complete the game 100%. Not to mention, players who aren’t lucky enough to be good at these mini-games are at a huge disadvantage.\n\nThe difficulty in this game is uneven. The game mechanics regarding levels and character status are garbage, and the counter system is ridiculous. You can block one attack, and then a bunch of others come flying in. Dodging feels pointless because the jump distance is basically useless.\n\nThe storyline is okay, but many scenes are just too cheesy. The music varies and fits the scenes, but some tracks are flat-out annoying.\n\nIt feels like Square’s creativity and originality are running out. This game is designed to separate gamers from normal people or those who struggle. Gaming is supposed to be relaxing, not frustrating. Players already deal with enough stress in real life, and this game only adds to it. If the company keeps this up and uses mechanics that humiliate others, it should just close down and stop making games. If I could get a refund after three days on Steam, I would have done it already. This game is trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I had a blast with FFVII Remake Integrade, but this one is just poorly made for PC. There is a lot of micro stuttering which ruined my experience. In the state it is in, I cannot recommend it. Google it and you will find this is a common complaint, even users with powerful GPUs. This game really need better optimization for PC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the shittiest entry in the entire FF series, and that's saying a lot nowadays. Don't bother.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Si bien Final Fantasy VII Rebirth intenta expandir el universo del remake con un mundo más amplio, en mi experiencia la trama se siente floja y, aunque tiene momentos interesantes, el concepto final resulta trillado y forzado. Personalmente considero que FFVII Remake logra mucho mejor en este apartado.\r\n\r\nLa evolución de los personajes es aceptable y aporta cierta profundidad, pero el sistema de exploración me pareció aburridísimo. El mundo abierto está lleno de minijuegos y misiones secundarias que se sienten demasiado alejadas de la historia principal, lo que rompe el ritmo narrativo.\r\n\r\nEn cuanto a gráficos, arte y música, el juego destaca y es innegable el esfuerzo técnico, pero aun así no logra convencerme para darle una valoración positiva. La mezcla entre mundo abierto y secciones más lineales enfocadas en la historia no termina de funcionar; en mi opinión, el juego debió centrarse más en la narrativa que en expandir un mundo abierto poco atractivo.\r\n\r\nEl sistema de combate lo encontré desordenado y menos satisfactorio que los clásicos por turnos, lo que refuerza mi sensación de que el título no logra equilibrar innovación con jugabilidad sólida.\r\n\r\nConclusión: En términos generales, no recomiendo Final Fantasy VII Rebirth. Tiene apartados técnicos notables, pero la historia floja, el mundo abierto aburrido y el combate poco convincente hacen que la experiencia no esté a la altura de lo esperado.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have far too many thoughts on this game. Some things I like, some things I loathe. I am too far in to stop now and I cling to the fun things about it to make up for how badly botched the vast majority of this games' story is.\r\n\r\nThese Final Fantasy 7 remakes need to be studied. They are the most bizarrely, uniquely incompetent exercises in pointlessness in gaming history. We waited 20 years, and this is what we got. We live in a stupid age of stupid corporate decisions.\r\n\r\nThese games are not remakes. They're bizarre works of coke-addled nonsense. Besides the opening and the section in Kalm, the plot is completely different. The only thing that remains from the original is the order in which you visit the locations. Every story beat is changed for the worse. They say the original creator of FF7 was involved, but that's a terrible idea. They told the story 20 years ago - why would they tell the same story again? It's one thing to make some slight changes, but they change *everything*. The opening chapter in Nibelheim is the only part that delivers on the promise of a remake of the classic story. Everything else is completely shot to hell.\r\n\r\nIf you loved Final Fantasy 7, avoid it like the plague. If you never played the original, then you won't have a clue what's going on. I played the original and a bunch of the other games in the bloated canon of FF7 and even I'm bewildered at some of the story elements.\r\n\r\nThis came out in 2024. Remake in 2020. They may have modern graphics, but they play like PS2 games. It's *shockingly* primitive.\r\n\r\nIt's enjoyable 40% of the time as a bizarre comedy masterpiece, but that charm wears thing the further you get into the game. It's hard to keep laughing when the legacy of something so beloved is being trampled on repeatedly.\r\n\r\nI cannot believe that this is the game we got. I cannot believe this much money was spent on such incredible incompetence.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I won't go into incredible detail as no one would read it - but this has been my least favorite FF game in the series. Enemies must be battled according to the game's designed method of defeating them. Desirable materia all locked behind landmark-based side quests. Cut scenes are more cringe than the word itself. Story is on the back burner 97% of the time as you tediously try to maneuver from one checklist item to the next. Queen's blood is sick though, for real no cap.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The story is good, but the game is full of filled content in a lot of missions (principal ones) a lot of stutters (the game goes kind of bad in a RX7900XT) a lot of filled zones, Cloud moves and do actions very low, a lot of charging zones, etc. I feel like this is a really good 20h game, but SquareEnix needed an 80h game so they fill the game with trash to make it larger, I hate wasting my time on filled content.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't believe how much time I put into this game... I mean, there were plenty of little shining moments. I really liked a lot of the character interactions and I won't deny that the writing and acting when it came to those small moments between party members was often really good.\r\n\r\nBut there were also a ton of moments that were boring, poorly written, totally inconsequential, or just way too drawn out. The open world was a slog. A lot of the minigames were annoying and/or janky. A lot of the battles felt pretty easy, even boss fights, but then every so often I'd hit a wall where winning required a strategy so specific or tedious it just immediately sucked all fun and momentum out of me.\r\n\r\nI really liked Remake, but I don't know that I have it in me to finish Rebirth. Ever session with it is a dozen annoyances to try to get to the next fun story moment.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So frustrated by this. 95% filler and 5% story. Sadly the final climax couldn't make up for the miserable journey. Sad as I loved Remake and the characters are great but I felt like banging my head on my desk whenever I got to a new area or a given a new pointless quest. Wish I'd not wasted the time on it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very poor effort. constant white screen. the various workarounds simply caused additional errors.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring. After 40 hours I stop playing and erased it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is broken will not launch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "exhausting\njust play the original",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "FF VII Remake is a better option.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WHAT THE HELL ARE THESE 1% LOWS? I'M USING A 5080 AND THE 1% LOWS ARE TERRIBLE!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "kept playing, waiting for it to get good. it never gets good.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "how did they manage to make it so unfun",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have played this game for 97 hours and it only has enough content to justify 7",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Looks and plays like garbage. So much yapping. Definition of triple A slop. Save your money and buy a good RPG like Trails in the Sky remake",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "10% GAME 90% BLOAT",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I wish I could guilottine Chudley",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "No need to have! Very Loveless made.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "stuttering bed pc port.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "not my ff7 remake",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cringe Garbage",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Idiocracy 101",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "F… those minigames, cardstuff and bullshit. Just let me play final fantasy please!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is everything worse?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So. Much. Padding.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "terrible",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}