{
  "positive": [
    {
      "review": "You have to be okay with losing, then it's really fun.\r\n\r\nOtherwise the rage builds up.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "unless you're planning on playing with friends, this game is genuinely hot shit. extremely unbalanced and WILL give you suicidal thoughts",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "this game is fucking horrible, the sig spammers are fucking mentally slow, and anyone who uses the 2 newest weapons added used ISRA3L GPT to generate their character so they could be fat and still win",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The game is fun and allat but very rage inducing. THIS GAME GIVES FAKE CODES, it doesnt work",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not bad, I guess. These little games are okay for killing time when you're bored!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game but Ijaz is always selling me elo. Makes the game so unplayable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i played this fuckass game and i want to die, everyday i hope jesus comes down with a glock so i can ko myself everytime i open game. 10/10 i would recommend not getting startet because you will be gapped so much by those nolife fuckass motherfuckers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The skill based matchmaking is screwed, especially in 2v2 ranked, but its a fun game to play. Recommend to anyone with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game unironically taught me competitive platform fighters lol. for a free to play game, i will have to recommend this. if you want a platform fighter that is \"good\" then get rivals of aether or something instead. but brawlhalla is perfect if youre looking for something free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun with playing with an Xbox controller, just a bit competitive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's always refreshing to come across a game that isn't pay-to-win. It isn't too difficult to unlock all the characters without spending a dime. The only thing you really need cash for is skins.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game to play with friends or feed your competitive nature.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sig spammer, sig spammer an der wand, wer ist der sig spammigste im ganzen land",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had this game for years and it comes and goes, I've always overlooked this game but I played it for a bit and the animations are quite good and the combat is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brawlhalla is the single worst videogame ever devised by man. I'm sick of playing against these fucking worthless scumbag scythe users who do the same cockamamie combo that for some godforsaken reason i can't force my worthless self to figure out how to dodge. Despite this, I've wasted away $20 and 40 hours of my shit life to this harrowing experience. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really great. I love video games and this is a video game so I love it. Thank you for reading please play my favorite game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm writing my review today to take a break with Brawlhalla. If you want to know my thoughts about it, feel free to read.\n\nBrawlhalla is an interesting platform fighter. You have a ton of characters to choose from with different weapon combinations with 'em (with unique move set, I might add). All characters can be unlocked as you grind through the game. You can also unlock skins (or buy em especially the crossover ones with... a flip ton of Star Wars characters for some reason).  You can also modify your character's stats (not really, it is basically putting a point on either Dexterity, Strength, Speed, or Defense; though it's still good to be able to have those there).\n\nGameplay-wise, it is a solid platform fighter at it's core. A free-to-play fighter on that. \n\nHOWEVER, playing unranked (and even ranked) can be some of the most palpitating, STRESS-INDUCING plays in your life. Most people you will up against knows how to cheese (or even know how to play their character wonderfully) for the most part (ESPECIALLY the GOLD rank... I also heard the Platinum rank can be feisty as well). \n\nAdditionally, there will be pricks that will emote you and drag you down if they win. If you're reading this, I will say that it's the part of ANY competitive game. It cannot be avoided. One thing's for sure, use this salt as a learning exp so that once you've went against that character again, you know how you will counter it. OK?\n\nNow, for some tips in case you need it.\n\n- There's a term the community calls \"Sig-spamming.\" It is the way you over-using your signature attacks towards an opponent. While it is a strat you can do to annoy players (especially trying to rank up from the Bronze and Silver ranks), this is a VERY risky strategy. Why? it is because it will make you predictable AF. Any character's sigs has a weakness, and most players will be able to catch you up. TRUST ME, I know.\n\n- Consider learning how to do combos in a weapon class/character. Seriously, this will help you significantly when it comes to dealing more damage than just poking your opponent. I wish I was able to do that when I've began my journey a long time ago.\n\n- MOST IMPORTANTLY, if you are a beginner, disregard the tier list for a bit, and apply the \"Rule of Cool\" when picking the character you're about to play. If you like how your character plays, that's nice! If not, there are plentiful characters you can play.\n\nNow, do I still recommend you to play this?\n\nHonestly, I'm mixed about it. I can recommend you if you like competitive platform fighters. You can also play against your friends since it has online and couch multiplayer (afaik). \n\nIf you want to play rank/unrank... prepare for war. It can be enjoyable for you, or put you into a rage inducing, keyboard breaking maniac. It is up to you.\n\nThis is why I'm taking a break in it. Seriously, I've been playing for more than 200 hrs, I terribly need to touch grass, man. \n\nAnyways, that's all. \n\nWhile my review states as recommended, please treat this one as a MIXED review.\n\nThank you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite games to play. easy to pick up after being gone for a while and genuinely just like playing this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Movement is fun, very esport like, balanced, devs are great, but if you want a more varied character pool go play smash.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a fun button game...click click click. Rewards can be fun to earn also.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, Pure chaos,get weapon,hit friend,I fly,I respawn,I'm having a blast.9/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is ass but the same time so good idfk how tf they did it since i get ******by spammers every game and yet i still feel prideful when i win against them definitely playing it again 10/10\n\n\n but make sure to give OW2 a negative review we gotta maintain it as the lowest rated steam game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IF you enjoy losing your mind but having some fun, thats good, play this. but u might hate everything but its ok, keep yourself safe if you play this. gl guys.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun until your opponents starts spamming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fantastic free-to-play alternative in the platform fighter genre that is easy to learn but hard to master. The huge roster of unique characters provides endless variety for both solo and online play. While it may not have the competitive depth of some rivals, it delivers pure, chaotic fun that is perfect for quick gaming sessions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a pretty good game for passing time and to play for free time.also the updates make the game even more enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brawlhalla is a fun, fast-paced fighting game with a wide variety of characters and smooth gameplay. It runs easily on almost any device. The mechanics are simple at first, but mastering them takes real skill, especially if you want to climb the ranked ladder. Frequent updates and events keep the game fresh and bring you back for more. A great choice if you enjoy reaction-based, skill-focused fighting games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brawlhalla is a fun and fast-paced platform fighter that's perfect for casual sessions with friends. The core gameplay is easy to pick up but offers a surprising amount of depth with its large and varied cast of characters. While the random item spawns can sometimes feel unfair, it's a fantastic free-to-play game for some quick, chaotic fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best free to play games on steam and extremely fun to hit cool combos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "easy to pass time with and crazyyy mechanics\noverall great game to grind and play competitively",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun, lots of characters. Let's brawl!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "okaish game, nothing special, not too bad either",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mostly enjoyable, but needed quite a bit of modifications in the combo hits, but still I enjoy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever. until you lose and almost want to break everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of the best games of this type to exist. Brilliant to just put on and play a couple matches and chill. Really long and continued dev support for a F2P game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has been one of my favorite games since I started playing it in 2020 and has served as a fun and thrilling bonding experience for me and my sister. The game is exciting, competitive, and visually appealing. I've been so hooked on it that I've experienced playing it on different platforms: first was on the PS4, second on the switch, and thirdly, here on the pc. The only negative feedback I have for this game is that I wish brawlhalla had a cross-platform system like games such as apex, fortnite, and overwatch do. Because of the lack of this cross-progression or universal account, I've had to create a new account 2 times and let go of the progress I already had. Despite this, this game keeps you at the edge of your seat and leaves you screaming at loud when you get that victory you thought you'd defintely lose.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brawlhalla is an enjoyable multiplayer-focused game with many fun modes to play with friends. It offers plenty of variety and chaotic matches that work best in groups. However, playing alone can feel repetitive and less engaging, so it is not recommended as a solo experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game since 2023, I am in love with the style, the characters pop and weapons are so flashy. I adore the music as well. Currently my highest level legend is my lvl 43 **Onyx**, however I have managed to get into Platinum with Battle-boots. If you're starting out, the first legend I recommend is Dusk or Orion, starting with Spear helps you understand the aerial space. Movement plays a heavy part in this game so watch some tutorials on yt for tips and tricks, aswell as weapon guides.\n\n Let's Brawl!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is cool but like very mentally taxing if you want to rank up VERY high skill ceiling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Solid and Accessible Platform Fighter, Brawlhalla is a free-to-play platform fighter that clearly draws inspiration from the Super Smash Bros. series, but carves out its own identity with a unique art style and a heavy emphasis on weapon-based combat. Truly Free-to-Play: you can unlock all characters through gameplay, and the roster rotation means you can try everyone eventually. Paying only speeds up unlocks and buys cosmetics. Simple controls make it very easy to pick up and have fun immediately, but the high-level gameplay with advanced techniques has a deep skill ceiling and simple controls make it very easy to pick up and have fun immediately, but the high-level gameplay with advanced techniques has a deep skill ceiling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very competitive and entertaining. Thumbs up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i play at this game from 2019 in others account. This  is a fuccccking good game to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Endless Fun & Always Fresh!\nAn amazing and completely free-to-play platform fighter. It's easy to pick up but hard to master, making every match exciting. The constant updates, new characters, and crossover events make it a true 'Labor of Love'. Perfect for quick sessions with friends or competitive ranked play. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game brings the worst out of me, getting me angry, ruining friendships  and causing me to question my life choices. This game has literally put me in hospital as i smashed my laptop which cut my hand.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a really nice fighting game, VERY few to none glitches.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "~BENEFITS~\nBrawlhalla is great to play with friends, fun to play alone, and just a great battling game overall.\nThere's plenty of characters to choose from to fit your playstyle and a whole lot of cosmetics.\n\nIt's free to play!\n\n~DOWNSIDES~\nMammoth coins, if you want a certain cosmetic or skin you'll have to pay real cash for them, but luckily cosmetics do not affect gameplay!\n\nCompetitive play, it can get really sweaty really fast, but overall if you enjoy that kind of thing it's great.\n\nBattle pass, this is basically the same issue I have with Mammoth coins, except you have to battle to earn what you bought the pass for, there is a free tier though, so that makes it more doable.\n\n~CONCLUSION~\nA solid 2d multiplayer fighting game, that I totally suggest you at least try, after all it is free!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game itself is fun, but the player base is shit\r\nhard to have fun with people like this all the platform",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is so much fun. You guys must try this game. Best part is that it is free to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are thinking of playing this game start by cutting upward as they wont be able to save you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a free game, Brawlhalla offers an immense amount of fun and depth, especially with friends. You have nothing to lose by giving it a try. If you enjoy the platform fighter genre, it's a worthwhile download that can provide hours of entertainment, though serious players may need to invest in a controller and be prepared for a steep learning curve and a salty online community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun with friend but a little grindy with the legends but makes up with free legends weekly i think",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lance is gay and scythe is for delusional ego furries. Great game though!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun and immediate game for a quick match, but you'll need some time to understand and master all the characters and play styles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a verry nice game  lots of platforms and fighting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great games to have fun. However, for some reasons, the sever sometimes is unstaple which is really annoyed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah it's a pretty decent game, yes its a free game so i got it for free so it's pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very VERY fun with friends. Smash brothers but on every platform. Easy to learn and difficult to master.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after playing this game for 30 years of my life I can say that every. single. player. in silver are unloved, abandoned children who have the skill level of an ipad baby because all they know is one button. \n\nheavy attack.\n\nwhile on the other side there are golds. who are basement dwelling gremlins who have not seen light for the past decade as they spend all their time on hammering away on the keyboard playing this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "googg game, good mecanic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Review for Brawlhalla\n\nBrawlhalla is a super fun and fast-paced fighting game that always keeps you coming back. The gameplay feels smooth, the characters are unique, and the combat is easy to learn but hard to master.\n\nWhat I enjoy the most is the crossover skins system — they’re creative, well-designed, and make the game feel fresh every time you switch to a new one. The constant updates, events, and new content keep the game alive and exciting.\n\nOverall, it’s a great free-to-play game that delivers a solid competitive experience. Definitely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "getting 3 stocked 20 games in a row as my initiation to the game by my friend was very fun, 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only play this game with friends as its the way i got introduced cause if I play online I get passed around like its a bad *****. Solid game tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mein freund namens oskar hat mich dazu gebracht wieder anzufangen und es mach echt spaß!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It feels like good old super smash bros. Great to play online or with friends at local multiplayer.\nFun, fast paced and really focused on skills and practice, although it works just fine for amateurs and veterans alike.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ive ever played tbh, the rank system sucks but the game is constantly updating which is good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with friends, forever around and ready to catch hands :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun and also demanding if you enjoy playing ranked. Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this game on the Nintendo Switch with my friend. And at first we were just messing around. But then I got the first \"combo\" and that sparked a friendly competition to see who is better at the game. I eventually moved to PC where for me, the game flows more naturally. I sunk hundreds of hours into this game competing with my friend having a blast the whole time. If you are looking for a easy to pick up but hard to master game with good developers this game is great. And it also makes great friendly competition between friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive enjoyed over 300 hours of this disgusting atrocity of a game... and i'd do it again in the blink of an eye.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Game Fire if u play with friends , but u gotta spend whole lot o' time learning combos and mastering a certain character , or you gonna be cooked and hate the game <33",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean this game is good. its clearly a bit better knockoff of smash bros, but the ai training bots are ass, they dont act like real people. if you play this game one time you would even know that people combos and the general way they move. developers... please fix your 2015 bots to like atliest 2020 bots.\r\n\r\nthis game is generally good, good job devs. idk why im writing this in 2025. its been over a decade brop devs wont see.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game a lot of characters and fun gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brawlhalla is one of my favorite games ever! It's super fun because you can pick lots of cool characters called Legends. My favorite part is when you knock your friends of the stage",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brawlhalla is one of those games that looks simple at first, but the more you play, the more addictive it gets. Super clean movement, satisfying combos, and that chaos when everyone’s flying around the map is just too much fun. It’s easy to pick up, but you’ll keep grinding because every match feels different. Honestly, it’s the perfect jump-in, play-a-few-rounds game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good gaem, gaem so good i nominated it for the stema goty (all typos are intentoinal)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brawlhalla is just pure fun. Easy to pick up, tons of characters to mess around with, and matches are quick and chaotic in the best way. Perfect game to hop on with friends and waste a few hours smashing each other off the stage.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game. Very addictive and engaging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "monkey play brawl,monkey happy but sad at the same time because monkey lose.monkey buy skin,monkey feel like monkey is on top of the world but monkey still lose.monkey still enjoy the game and play the game once in a while with other monkey friends.monkey highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best combat games ive ever played, i use controller more but sweats always use keyboard. FAIR WARNING SMELLY SYTHE USERS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is like a toxic ex gay boyfriend you always come back to for some reason",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am addicted to Brawlhalla. I bought the characters. Utterly entertaining, amazing and marvelous! Brawlhalla is more than a fighting game since it consists of team play, guilds, arena and many other features. Check the players. The players from all over the world play various styles of a single character, so work out your unique playing style. Enjoy Brawlhalla NOW!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got it on release, haven't played over a decate. Still good, much more content and more to come. Ignited another grind for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my favorite fighting game of all time. I have played so many games in my life but nothing holds a candle in terms of exciting like this 2d platform flash game. There is nothing like being in a 1v1 situation while both being 1 hit your heart will legit starting pumping with pure horror with thoughts whose going be to knocked out with your elo on the line to possible achieve a new peak and all your all hard work of training and getting combos down might or might not pay off. The adrenaline this game gives me is equal to skydiving from my desk at 3am. Thank you Brawlhalla.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It´s a good fight game, it has unique gameplay and weapons.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is really fun but i think a lot of stuff is overpriced",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very fun but u need crazy skill to play a lot of the characters and u also need hours of grinding the character u like that most",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Open game, get inf combod, leave game, great success",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "brings nonstop, chaotic fun with smooth movement, flashy combos, and hype moments that always keep matches exciting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one that i've been really excited to talk about. Brawlhalla. I've spent endless hours with my friends and family playing this game. In the review below you'll get a general idea what the game is about. Me and the friends have literally spent countless hours playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love every frame of this,but please note that there are other attacks than the heavy attacks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game can make you rage quit if you lose a lot in ranked, and if your that kind of person. But Brawlhalla is very fun to play with friend and a good competitive game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only played this game casually with friends and if you want a quick and easy couch coop game and don't want to fork out $500 for a switch to play smash, when you're already trying to get through your 100+ games in your wishlist, it's a good substitute.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's fun but it gets addicting. Just don't play it too much and you might have fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good game if you're in a bad mood and need some relaxation or motivation. Recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing for 1.2k hours, very good, but dont play on console you'll get slapped",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better smash for pc, but controller is easier, don't play Teros.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there is no problem with this game other than it giving you the constant, overbearing need to repeatedly bang your head upon a wall until you look like azoth. ive played this game so much to the point where i make references to it in real life. i went to a trampoline park and thought to myself \"yo red raptor boots nsig would be so active rn\" dont play this game unless you actually want death. once this filthy game has infiltrated your pure little mind its too late to go back. youll never be the same person you were again and you will hear voices whispering to you telling you to hop on brawl and you will listen to them like the good little dog ubisoft wants you to be. youll then willingly watch 5 minutes of ads for coins and then get destroyed in ones by some random with 300 less elo than you who will inevitably invite you to a room to trashtalk you. and despite this, no matter how much you grow to hate this god forsaken game you WILL without fail still log on. its hold on you is too strong. help me",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice game.\nEnjoyed so much with my friends.\nThis game created so many memories of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game! It's just as fun as Super Smash Bros, and the characters are varied and fun. I have one issue; that being that getting new legends is waaaaay to grindy. It took 22 hours just to get one. Otherwise, this game is great!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game and is super fun to play the only issue is as a beginner there is no skill based matchmaking so everyone you fight is super good already",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game is infuriating. It used to be incredibly fun, simply balanced, the devs used to care about the state of the game, now they just release new skins and new characters instead of focusing on actually making the game playable. The servers and input delay is bad, there is no real skill expression if what you enjoy is off meta, for the casual player or even people trying to climb ranked with a friend, there is an insane fall off of enjoyment once you get to the higher hours. I wish I could remove this game from my steam library because it just is such a sad shameless shell of a once incredible fighting game.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Would not recommend.... this game needs to fix its servers. Teleporting everywhere, misinputs, etc. It's honestly embarrassing.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "fuck this game and fuck mike https://steamcommunity.com/profiles/76561199407186038 he is a pussy boy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I would rather eat a tin of fucking pure horse shit than play this game for more than 3 minutes, theres more skill implicated in fucking flipping a coin rather than this game. Anyone who claims to be good at the game then proceeds to play tezca can fucking go get curb stomped by a transexual horse while sucking his own pittiful cock.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this shit game is not only made for spammers but also a game for those who never touched a women in there life. \nif you wanna kill yourself and want some torture before i would recommed this game. not only will it get you mad cuz you know how fat and pathetic the losers are that you are getting spamed by and same for those who never go outside and learn 600 combos just to be in gold and destroing your chance to get to a higher rank... \nI say this from the bottom off my heart i HATE the players and i hate the develepors. \n\nShit game overall dont get it if you have a life",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "genuinely the worst fucking game ive ever touched. every time i play this game i feel like 10 dudes took advantage of me and sold me to the black market. dont invest your time in this game it is not rewarding or fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you ever wondered what it feels like to lose your sanity one match at a time, Brawlhalla has you coverd. This game somehow manages to be too simple and too chaotic at the same time. The movement feels like everyone is running on butter, the hitboxes are basicaly imaginary, and weapons magicaly fly straight into your opponent’s hands while you get stuck with a spear you didn’t even want. And don’t even get me started on matchmaking — you’ll either stomp someone who just installed the game or get instantly launched into orbit by a level 200 sweatlord who hasn’t touched grass since 2018. Every match ends the same. You screaming at your screen, wondering why you’re still playing a game that clearly hates you. Overall, Brawlhalla is the perfect game if you love pain, laggy hit detection, and watching yourself get combo’d into next week. Truly a masterpiece of frustration. Would I recommend it? Absolutely not — unless you want to raise your blood presure for free.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is fundamentally flawed. The implementation of the movement system heavily rewards not engaging with the opponent, giving a massive advantage to passive playstyles.\n\nWhile this can be countered doing so requires you to play equally as passive, slowing the pace of the whole game and punishing aggressive playstyles.\n\nHeavily recommend playing any other game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "unironically this game WAS great, and a blast to play. yeah, some characters used to be more annoying than others. but now, literally every character they release is straight up BETTER than the ones before them. the addition of boots ruined the game by making previously difficult and skill requiring combos easy as all hell to perform, and chakram sports the most braindead light attack gameplay i have ever seen. this was an amazing game, but the developer's choices with the future of this game is tarnishing it's reputation",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i’ve got plenty of hours in brawlhalla. I even bought a 245Hz monitor just to get the smoothest experience possible. but after all that time (and money), i’ve finally realized it’s just not worth it anymore.\n\nthe gameplay that once felt exciting now feels stale and unbalanced. some weapons dominate while others are useless and every “balance patch” just makes things worse. The devs seem completely out of touch with what competitive players actually want.\n\nas a controller player, i’m constantly dealing with input delay that makes the game feel sluggish compared to keyboard users. it’s ridiculous how big the difference can be even tho i tried to make my controller 1ms through programs, but in brawlhalla it always feels like my inputs are a beat behind, no matter how much I tweak my settings. it completely kills the competitive feel.\n\nat this point, i’ve accepted that the game I fell in love with just isn’t the same anymore. it’s grown in ways that doesn't appeal to me and that’s okay. i will always respect the time I spent learning, improving, and meeting other amazing players, but I think I’ve gotten everything I can out of it. sometimes, you just outgrow a game or maybe it outgrows you. :)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h1]Brawlhalla – 713 Hours Inside the Eternal Combo of Regret[/h1]\n[b]Rating:[/b] ★☆☆☆☆ (2/10)\n\nI have [b]713 hours[/b] in Brawlhalla. Not because I love it — but because I can’t escape it. This game is less of a fighting platformer and more of a psychological trap disguised as fun. Once you start, it’s over. Your free time? Gone. Your sanity? Questionable. Your soul? Property of Brawlhalla.\n\nEvery time I think I’m done, the game whispers, “just one more match.” Then it’s 2 AM, my controller is in pieces, and I’m questioning every decision that led me here. It’s not even that Brawlhalla is good — it’s that it’s [i]good enough to hurt you again tomorrow.[/i]\n\nYou win a game? Instant dopamine rush. You lose? Rage, despair, self-reflection. Then — queue again.\nIt’s a loop of sadness wrapped in colorful skins and fake triumphs. The matches blur together, your main becomes meaningless, and you start to realize the true final boss isn’t another player — it’s your own addiction.\n\nThe worst part? You’ll convince yourself you’re improving. You’ll grind, sweat, and cope — and then realize you’ve just spent another 100 hours circling the same emotional drain.\n\n[hr][/hr]\n[h2]Final Thoughts[/h2]\nBrawlhalla isn’t a game. It’s a cycle, a beautifully cruel carousel of frustration and false hope. It gives you just enough joy to keep you chained to it — and enough pain to make you hate yourself for staying.\n\nI don’t play Brawlhalla anymore because it’s fun. I play because [i]it owns me.[/i]",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "не игра, а хуйня ебаная. когда к 700 эло кидает типов, которые играют в игру по четыре года это просто пиздец, максимально не советую играть в эту помойку",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I stopped at the right time and dropped the game before getting addicted but here are my thoughts,\r\nevery player of this game that has more than 10 hours is a smelly fat homoncules that sipps monster energy through one of its various orafaces",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Because he preached i dont wanna let it be unseen;\nThis game is infuriating. It used to be incredibly fun, simply balanced, the devs used to care about the state of the game, now they just release new skins and new characters instead of focusing on actually making the game playable. The servers and input delay is bad, there is no real skill expression if what you enjoy is off meta, for the casual player or even people trying to climb ranked with a friend, there is an insane fall off of enjoyment once you get to the higher hours. I wish I could remove this game from my steam library because it just is such a sad shameless shell of a once incredible fighting game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst experience on the whole entire planet, dont play this if you want a normal life or any kind of human relationship whatsoever. If you didnt listen and actually installed this abomination of a game, i feel deeply sorry for you and for your family, and if you have any children, im sorry expecially for them too. If you ever wanted to feel , just out of curiosity, the pain of losing a wife and at the same time getting whipped with steel shoe laces on every nervous ending of your body while sitting submerged below steaming water filled to the brim with eels with 200 kg weights attached to your legs (without dying), well this is your game!! \nThe main difference is that this game will inflict that amount of pain with such consistency that you WISH you were in prison with african-american life-timers that are absolutely not afraid of guards half their size (and they can just tank tazers), so unless youre into that kind of stuff dont play this game.\nFor the happly married fathers that are reading this review, please for the love of your dears dont. You will lose EVERYTHING, first it will be your monitor with your fist, then the desk, then the pc and then you will end up arrested for triple murder because you punched your wife so hard Mordex came out from the game and killed your kids.\nThis game is nothing but hatred, pain and agony. Forget all the past negative experieces, getting beat by your father as a child, only for him to disapear a couple of days later, forget that one time in middle school when all the kids cornered you and started pissing on you just because you were different.\nWhat you are about to experience will make all those little and insignificant bad memories into little peaceful places for your mind to linger and attach onto, the sheer pain and amount of self control needed to resist suicide after losing several ranked matches in a row is so absurdly high that YOU WISH you signed up to volunteer for the Russia-Ukraine war, but instead here you are, filled with repressed anger and about to find the perfect tool to output it to:\n\n\nBrawlhalla",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst fucking game of all fucking time and i promise if i ever fucking catch one of you faggot fucking devs ever its fucking on sight pussys fuck all of you",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game rewards retxxdation. If you grew up with 3 teachers in all of your classes this game will reward you for being beyond low iq.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After a few dozen hours... over multiple seasons, like no other this game just went from good to garbage. Every game I play now is just a bot misleading to look as another online player. The movements and actions are horrible as far as mechanics. Better have a fast mechanical keyboard or control, or else theyll try to fool you by making you think youre too slow and make your mechanic/graphic go right through the enemy dealing zero damage. Most people who have already played against prior bots know what the movements look like... at this point its a joke to play any game mode. Everything is fake from the 4v4 to the ranked 1v1 and seasonal games. Want to win a game? Do a bunch of random movement to confuse the bots, and theyll all just sit around NOT fighting each other for a few seconds. 90% of opponents have the same movement and predictions. They add the replay feature as a joke to troll you. They will never update anything besides new DLCs. Ive reported multiple clips of my character 100% hitting a heavy attack to just end up getting teleported or \"dodged\". And will get completely ignored uploading clips of bots doing the same thing and the hit registering... money laundering at its finest,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrid absolutely horrible decision to waste my time downloading and playing the game.the grind is insane omg i hate it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Whoever is reading this thinking about buying this game. Dont. It will ruin u and every relationship u hold dear. If satan were to ascend unto earth this game and its creators would be his top disciples",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i fucking hate this dumb ass game lagging every 2 fucking second with a elite gaming pc fuck this shit im out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you want to truly understand the concept of how a man can bring himself to do such atrocious things to another man, this is the game for you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so so so so so so trash bro never install this trash ass game made by trash sad ass people",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a real fighting game. If you like smash or similar games this is great, otherwise avoid. Lots of spam, hardly punishable moves. At high level this game rocks, but for ordinary mortals this devolves to spam fest",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Holy fking dog water game. Literal trash. Netcode is absolute ass.. It's like two guys trying to figure out who the hell should have a say first before they chop each other to pieces. The roll back is insane, Dodging then seeing your dodge and still get hit in those frames.\n\nWack game. Send it back to Jesus",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pure suffering. I would rather cut my balls off with scissors and re attach them for over one billion years then play this stupid game, every single match that you lose drops you 600 elo, but you only gain 0.25 elo whenever you win.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "whether you have 2 gigs or 2tb of ram and any kind of cpu this bih ass game is still gonna be a laggy mess. Legends, most of them, are pretty fun tho, quick and awful matchmaking, leveling system a lil ass but who cares just reach lvl6-8 for all 4 stances and play ts its woman deterring anyway. Don't even try playing ts in 60hz and try to get above plat, nearly impossible, the game and server already adds enough latency to let you literally vape in between hits (true). There is no such thing as an equal ground in gameplay, especially in lower ranks. Axes and lances neg diff most other weapons and legends unless you're Pavelski. Extremely addictive, it'll make you reach for the enemies' throat through the screen and molest their mom. 4/10. Got around 600hrs throughout multiple accounts and not a single second did I get to enjoy anything other than the shiny scythe skins or training with the bot.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "in its current state, Laggy mess. completely unplayable when running into poor connection, worse even when playing in any high Competitive setting, not to mention the toxic and racist players I've had the displeasure of playing with.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bu oyunu geliştiren ubisofta sesleniyorum bu nasıl oyundur amk zaten growtopiadan da belliydi bi siki doğrultamadığınız ayrıca raymani kodlayan o geliştiriciye c öğreten hocanın doğurananını sikeyim",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck this game fuck all spammers \nplz nerf spammer charater and edit all sages\nplz \nwtf ican`t play like that when i`m 1400\nand u give me 1500 \nwtfff \nhow i can beat him \nfuck u\nif u can`t fix ur game just take all the money and close it \nmf",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is utterly shit fix lances and scythes for the love of god they are broken ffs buff yumiko",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate this game its so bad never play it i hate all of you too i hope you go bald every single one ur all chopped all of u i hate so much queen nai i hope you get cracked by thatch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Typical \"F2P\" game with tons of microtransactions, skins, etc. made by Ubisoft. I got the game to play with a friend, but it's not really something I'd play alone outside of that.\n\nI haven't played the game much, since as I said it's not the kind of game I usually play, but to me it justs feels like yet another soulless corporate product made to get as much money from its player as possible through questionable business practices. Hence the \"Not recommended\" review.\n\nIf I ever get to play this again, I might update my review to talk about the actual gameplay, though I don't know if that will ever happen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "comment just steam's survey 2025 and i will take the chance to complay for the poor performance this shitty game is having since they added EAC, especially lately that is getting way worse than before and im not the only one being affected. imagine not being able to hit stable 60 fps in a png game, the devs suck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is only for unemployed low-lives who will never find love and will never reach their goals (if they ever had goals to begin with). The people who unironically play this game have nothing better to do and rely solely on stimulus checks and scrounging around dumpsters for food. Not to mention that the people who enjoy this game never actually shower, and don't actually care about their hygiene, Their breath stinks, their microbiome is like a nuclear wasteland due to all of the fast food that the players eat, and there is grease hard-stuck under each of their belly folds and under each chin they have. Brawlhalla players don't even bother wiping themselves when using the bathroom. They're so unattractive that even smelling like shit doesn't even bother them. When the end of time comes, I hope this game goes into the lake of fire, along with Satan himself, because this game is a mistake, and a scrounge upon existence. If this game were to be gone tomorrow, the world would be such a better place. If you disagree with me, you're probably one of those unemployed perverts that smell like shit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is lowkey mid. you can be doing good the next minute ur getting hit off the map with no shown damage of you getting hit or hitting them. This game honestly was good for the beginning but it absolutely sucks now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not new player friendly by my experience. Probably more for those that wish for a challenge. Personally, I would play more often if not for 90% of my opponents being so toxic over a small victory. Win or lose, it's always the same. I've grown to not enjoy this as much over the three years I've played across my two accounts (one on Playstation and this one)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fucking spamers gays inthis game and u cant get out of gold without breaking ur pc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pls just turn f$$$ing  team kill off bro it pmo this game make you want to blow your brains out with 12 gage  shotgun and scream bad things in public while hiding in a toilet tower",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2025-11-27\r\nBrawlhalla is a game that, for many players, manages to take the joy out of platform fighting and replace it with pure irritation. While some people love it, for others it can feel like a chaotic, unbalanced, and downright maddening experience. And honestly, it’s not hard to see why.\r\n\r\nFirst off, the gameplay often feels like it rewards spam more than skill. Instead of encouraging thoughtful movement, smart punishes, or creative strategies, the game can devolve into a messy mash-up of repeated signature attacks that hit far too hard for how easy they are to throw out. When every other match turns into a “who can spam faster” competition, it sucks the sense of mastery right out of the experience.\r\n\r\nThen there’s the weapon balance. Or rather, the lack of it. Every update seems to just shuffle the problem around instead of fixing it. One patch nukes your favorite weapon, the next one makes some random weapon feel broken beyond belief. For a competitive game, constantly feeling like your skill doesn’t matter because your weapon of choice is either a god-tier machine or a useless noodle is just exhausting.\r\n\r\nMatchmaking doesn’t help either. If you queue ranked, you might find yourself fighting someone who plays like they’ve been grinding since the game’s beta, even if you're sitting in a lower tier. Nothing kills motivation faster than getting juggled for a full stock by someone clearly way outside your skill bracket. And in casual modes? Good luck avoiding the sweaty players farming for clips.\r\n\r\nAnd don’t even start on the maps. Some stages feel like they were designed specifically to annoy you. Weird hitboxes on platforms, awkward kill zones, and layouts that reward cheap tactics over fair fights all contribute to a sense that the game is working against you, not with you.\r\n\r\nFinally, the overall experience can feel repetitive as hell. Once the novelty wears off, you’re left grinding for cosmetics or climbing ranked in a system that frequently feels unfair and unrewarding. Combine that with the constant barrage of spammy playstyles, and the whole game can start feeling like a chore rather than something fun.\r\n\r\nIn the end, Brawlhalla is “the worst game ever,” \r\nGiros Statine",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can see why this game is dying and the community is as toxic as they say; There is absolutely nothing stopping an enemy from spamming the same move over and over if they've got you knocked up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game made me and my whole family develop cancer and aids in my toes  and fingers never play this game it will end ur bloodline",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyed this game a lot with friends, closest thing to SSB... but almost every ranked match I play is always against smurfs, so I wouldn't recommend this game at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have spent countless time in this video game and I have hated every second of It this game is genuinely so excruciating to play I would rather sell my first newborn and have my wife killed in front of me then play another second of this video game the amount of Sig spammers online is crazy why did we even add Rayman to this game I would rather do a self lobotomy while castrating myself than have to play this game for one more second omfg omfg omfg omfg omfg omfg omfg omfg omfg omfg omfg omfg omfg omfg omfg omfg omfg omfg omfg Nerf fucking axe and rocket lance that shit shouldnt even be in the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would rather kill myself, have myself electrocuted into being revived, flayed, split in half, reattached via Elmer's Glue, turned into a meat cube by The Qu, have Red Raptor's motorcycle shoved up my asshole and then have a boiling frying pan club me in the back of the head with speeds akin to that of Benson from Regular Show's 150 Piece Kit. Please, if you value your sanity, or if you're coming into this game knowing how bad it is, and you want to test your mental fortitude.. Don't. Genuinely, You aren't going to come out of this game alive, or happy at the same time. You'll either survive a changed man, only intent on killing himself to escape the treachery known as Brawlhalla, or you'll lay down, ready to eternally rest, having a smile on your face, knowing you can't play the shitfest known as Brawlhalla.\n\n\nEdit: I have gained 7 more hours on this game, and I have had my asshole stretched 7 more kilometers by Red Raptor's motorcycle. Everything I have previously stated, I stand by it so much more. The only saving grace I can find about this game are character designs, and the ability to play as Patrick Star. However, even that comes at a cost, as there are no other ways to get Mammoth Coins aside from coughing them up from your wallet. I would not mind Patrick Star himself mutilating my asshole as opposed to my teammates hurling me across the map 9 times in one stock. For everything I've ever stated about not playing this game, listen closely: Do. Not. Play. Brawlhalla.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The worst, most mind numbing, most unbalanced, horrible game I have ever played. If I made a list of the most unfun games that raise your blood pressure this would be #1.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "skins are more than fortnite man this is crazy apart from that fun game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Brawlhalla is a very simple fighting game, which made it perfect for someone who wanted to get into the scene. Each character has the same model, with 4 distinct stats. They each have two different weapons, and while the light and aerial attacks are all shared between similar weapons, each character has their own unique special/heavy attacks. This game doesn't have that many complicated inputs, and those that could be considered complicated can be learned very quickly. The simplicity of the game was honestly one of the things that drew me into it.\n\nI won't lie, when I did play Brawlhalla, I had fun. I would crash out when my ass was handed to me (I may or may not have lost a monitor to one of these crash outs), and got excited when I could find a random I could goof off with. But the game really isn't in a good spot right now. The new weapons that they add aren't really fun to fight with or against, and Blue Mammoth Games seems more interested in printing money with crossovers and skins than wanting to make an enjoyable game. Introducing a battle pass is - in my opinion - one of the worst choices that they have made with this game. The community is also one of the most toxic that I have had the misfortune of being a part of; I've heard it compared to the League of Legends community if that gives any indication. The developers thought that removing the post-game chat was the best fix for this (spoilers: it wasn't).\n\nI've had an off-and-on again relationship with this game for close to 8 years now, and while I can honestly say I've had a lot of fun, I will be walking away from it for good. If you're thinking of getting into Brawlhalla, I would suggest finding another game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Never playing this devil game, If your a man of god and a person of normal thinking skills don't touch this game. It's highly addictive and is the best game I've ever touched but this game will drive you to new levels of insanity.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "what a bad game the devs are asleep they only think of high rank and its just a spamming game i legit cant go 2 games without meeting a spammer in plat and devs are doing a whole lotta nothing they are just farming money at this point its such a agony i miss when people stop spamming",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game but the lack of new content from devs makes it repettive after a few hundread hours",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Combat is bad. Monetization is bad. Weapons are bad. Movesets are lame. Art style is lame. And hit boxes are dumb. Just go buy Smash Bros",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuckas toxic game where every new opponent is more gay than the last one. Also people spaming and not doing shit LMAO pls dont install this bullshit game please for your own sakes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is dead, weapons aren't balanced,  matchmaking isn't good. there isn't a reason to play the game anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was good, but absolutely ruined by devs lately. Like the new point system in f4a or just flat out putting new weapons every update instead of making the more wanted characters holding existing weapons. (Rocket lance great sword when?)\nHorrible maps too, just adding slop the the map pool",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont play this game unless you want to develop anger issues and a tumor",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a perfectly acceptable game if you don't own smash ultimate, but it doesn't really do anything to make itself worthwhile if you do",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "such a toxic game,and its so addictive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to be good, after Ubisoft started meddling it became a sellout\nMammoth coins used to be something special \nFIGHT THE MICRO-TRANSACTIONS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Brawlhalla used to be my favorite platform fighter. I like the feel of the mechanics better than Smash Bros.\r\n\r\nHowever, since switching to almost exclusively Macs several years ago, the performance is absolutely atrocious. It lags in every single game, the Chasm map is straight up unplayable due to lag for some reason, and the lag in general has gotten even worse recently to the point I don't enjoy the game at all. At first I thought maybe their servers are struggling with more traffic, but turns out the lag is just as bad vs. bots in a local match with WiFi turned off. I have an M1 Max capable of playing Shadow of the Tomb Raider at *ultra* settings *through translation layers*, and yet the 2D platform fighter is unplayable.\r\n\r\nAs I let my addiction go, this game will gradually join League of Legends in the list of competitive games I used to love but can no longer play because they are more focused on adding skins and tons more characters than actually maintaining a stable product.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very boring in my opinion I also dont like the art style but thats probably just me yk",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cara, só não perca seu tempo que nem eu fiz, jogos singleplayer compensam mais",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spammers. This explains its self.\r\nLike legit if you wanna spam dont buy this game.\r\nPeople legit practice spamming I have seen the spam combos like nerf sigs its ruining my time playing the game and others. If you buy the game you legit will have to spend time practicing how to beat then not only along the lines of all the wepons and chars that are actually skilled that you spend all this time practing just to get your butt whooped by a spammer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its brawlhalla, play at your own risk, truly rage enducing especially with every other character being busted as fuck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Theres a reason why its free.  Its just super smash bros but worse. Everythings behind paywalls and its jst spam to win. Id rather go 1v1 a Ness that only spams pk fire then a queen nai.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its an ok game but its all multiplayer and theres no single player content! because the game is over ten years old, most of the player base already know all the tricks and cheap tactics to have an edge on a new player! if youre just starting out youll have a tough time (maybe less so if you have experience with games like super smash bros and the like)! almost everything you unlock is in the games store! there are tons of skins and customization items for you to buy with the games premium currency and almost nothing to buy with the gold coins you earn from playing! if you have the patience to grind it out as a F2P player then maybe give it a shot but otherwise be aware that the game is heavily monetized and if your new you may have a steep learning curve as you find your favorite character! \r\n\r\noverall the game was free so i cant complain too much but playing seemed more of a chore that fun! some daily quests ask you to perform special moves or advanced movement and other skills the tutorial didnt teach you how to do so it makes it difficult to progress unless you google/youtube guides! \r\n\r\nif i had to rate it id give it 3 out of 5 stars! its not a bad smash brothers clone but if you dont have a huge group of friends to play with and only play with randoms online its not that fun!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While writing this review,I am completely filled with rage.Its running thorugh my veins.Please dont start playing this game competitevly.Its unbalanced and the less brain you have, the easier it is to win.I am NOT okay with the fact that you are able to lose 150 elo because of broken weapons and mindless kids who cant form a thought other than right click.This game is like drugs.When you win, you feel like you re on top of the world, but then there comes a 15 defeats loss streak.The closest thing i can think to assimilate this game to is CANCER.Its gotten so bad i started shadow boxing in my room with rage tears in my eyes imagining its my opponent im fighting with irl.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "เกมกากไม่มีความสมดุุลของผู้เล่นเจอแต่โหด\r\nอย่าเล่นไม่มีที่ในเกมนี้ถ้าพี่งเล่นและกาก",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stay away.\r\n\r\nThis game will do nothing but make you angry. Just trust me, its not worth it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you've played this game chances are you have some great friends with some very bad taste who forced you to play this with them. It's the kind of game you never want to admit to someone that you've played it and if you have you regret every second.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not the best game out there, but it's a good game to just idle play while talking to friends.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Im 2 hours deep into this game and already depressed. this game causes genuine cancer not only to your brain but also to your anus.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuck this game, slow inputs, broken hitbox and the most broken dodge system ever\nit doesnt reward actual skill and is more rewarding towards spammers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In the last few years, this game has evolved into something else. For semi-casual gamers like myself, the game is occasionally unplayable due to people's unbelievable rate of improvement. I recently reached platinum, and I was quite pleased of myself for reaching this milestone. However, since then, I've only faced opponents with 1900+ elo and, most of the time, 2000 elo, which would be about diamond level. Given that I've only recently reached plat, it's obvious that I'm not diamond level. Now that everyone understands zero to death combinations, I am unable to play the game for enjoyment. Since I don't spend all day doing zero to death combinations in custom games and getting all of my characters to level 100 before ever hitting gold, I suppose it's a skill issue on my end. What I actually want to say is that Brawlhalla's ranking system is incredibly broken and unjust to people that want to enjoy themselves and progressively improve. I know it's a competitive game, but seeing players with 10 times the hours and 250 more elo in almost every match makes me want to give up. I wish everyone else who is playing Brawlhalla and experiencing the same problem the best of success and hope they reach their next milestone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1 game a side attack hits you form above the other time the opponent has e field around them where you cant hit them, every third attack goes trough my enemy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is piece of shit game sticks ur mouse a lot u cant play like normal, if u want to destroy your setup - its the best choice",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This piece of shit game has made me punch 3 holes in my walls and rip my hair out. No matter what I do I always seem to lose to some retarded sig spammer who has infinite reach and deals 300% damage. And the few games I don't go against a sig spamming retard I go against the sweatiest player ever. If you ever think about downloading this game just know it is the 8th layer of hell disguised as a f2p game.  Never Download This Game If You Value Your Life.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game geneually makes me mad yet its so addicting every match i'm either put against someone who has played in a worldwide tournement or someone who started the game today. This games matchmaking and pricing is so stupid. Dont play this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "how tf does a port of the game on ps feel so much smoother and better compared to the actual thing on pc why do i feel so slow on pc pls fix ts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is pretty fun for the first 100 hours or so but then it starts getting repetative and frustrating.\r\npeople just spam there signeture moves and kill you in seconds. \r\n\r\ntop tip: dont use your refund cards for gold because you only have 3 in toatle and you never get them back. and if u decide to spend money on the game and you regret it there is no going back.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only play this if you're a serious masochist\n\nthe controls are not intuitive and the skill ceiling is through the roof (in a bad way). seriously, go into training mode and fight any bot on \"chosen\" difficulty. you'll see what i'm talking about.\n\nthis wouldn't normally bother me because i enjoy fighting games and a good challenge. but the game really doesn't offer enough depth or strategy besides attack spam, camp for a counter and hope for the best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has the worst matchmaking i have ever seen i go to playing a bot to a pure spammer then a total try hard while i'm just trying to learn the game when i had 2.5 hours and i'm playing against someone who killed me with two combos i have 9 hours and this game messes with my mental health more than the game rust on the rate the games going i wont know how to play unless i play for 1,000 hours........ i have not hated a game this much in my whole life i do not recommand unless you have no job and you can play for 10 hours a day for 8 months",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad game, one of the worst community ever (and devs want this), all overpaid, devs still wants to focus on making skins for money and not adjusting all the game's problems. Too much problems, gameplay ones and software ones.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fix  the kids ho spams and add spire and hammer is that hard i cant play the game bcs one kid just spams",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1. u install the game and play with ur friends\r\n2. u start getting a lil good and knowing the game\r\n3. ur friends play it too much\r\n4. custom game with them\r\n5. unninstallment",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game genuinely sucks. the ranking system is abhorid and EVERYTHING that is remotely good looking is behind a paywall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game but once you hit 1700-1800 rating it's stupid. Bunny hop macros dominate the game. Slow chars move faster than the \"fast\" ones.\r\n\r\nI'm a ranked player regardless of the game and this is something that kills the player at high level. Probably in 1900's there are other \"cheats\" that the game allows..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really want to love this game. But the network and framerate optimization is terrible for what's effectively a flash game, and the ranked matchmaking is terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The actual worst ranked system you will ever see in a competitive game dev make a balance patch every 6 month and just does coloab which is fucking ruining the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WHY ARE QUEEN NAI, LORD VRAXX, AND LORD VRAXX AND LORD VRAXX AND TEROS STILL IN THE GAME?\n\nDONT PLAY THIS GAME. THE DEVS OBVIOUSLY DOES NOT WANT A FIXED GAME\n\nTRUST ME. SAVE YOUR TIME. EVERYONE OVER 500 HR REGRET THEIR LIFE DECISIONS\nNOTE--> ONLY PLAY THIS GAME IF YOU ARE SEARCHING FOR MOTIVATION TO KILL SOMEONE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "worst fighting game made 0 skill at all just sigspamm allll the way to valhallan",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is genuinely the absolute worst. This game is a dogshit copy of smashbros with worse graphics, gameplay, and gimicks. The concept of weapons in this game is dumb and executed poorly. Half the characters are objectively the same. Not to mention, the laggy severs and extreme packetloss that i experience even while running a wired 2 gig connection. Worst 3 hours of gaming ever!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally a piece of shit game, ive broken 2 monitors and ive damaged my pc playing this fuckass game. Always puts me against players way better than me and I'm tired of this shit, fix ur fucking game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game was a soul sucking experience, I played 2v2 ranked and got placed into tin in which I was utterly obliterated because I was going up against plats. My duo was the definitiojn of garbage and kept hitting me and placing me into 2v1 situations. I genuinly think they spent more time spectating than they did playing the game. 3/10 meh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you want to turn bald fast, play this game as it will make you tear out your hair, one match at a time. If you are looking for a semi-serious platform fighting game to play with your friends, then this is perfect. But if you want to hop online to see what the cesspool is all about, be ready to be absolutely trashed, thrown around and taunted. The players of this game are more toxic than The Elephant’s Foot and the Demon Core combined, and you will guaranteed throw your controller either out the window or at your monitor.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game actually sucks at all stages don't play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WHO EVER PLAN TO PLAY THIS GAME HAS TO MAKE SURE THAT THEY HAVE A STABLE MINDSET, BECAUSE I ACTUALLY LOST. I EVEN CRASHED OUT ON SOMEONE ELSE, WHICH WAS WELL DESERVED. IF YOU SEE THIS REVIEW, JUST KNOW IM NOT TOUCHING THIS BULLSHIT ASS GAME ANYMORE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The positive reviews you see are the spammers that think it is fun to spam one singular sig.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spent an hour learning Ken in practise mode to find I can't even play him in Matchmaking unless I buy them lol 0 option to unlock them with Ingame currency have to e buy mammoth coins, Starts you off with 6 fighters I get it's a free to play but kinda underwhelming I'll pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Way too hard to get into as a new player, people are too sweaty or just straight up spamming. Not recommended",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}