{
  "positive": [
    {
      "review": "This feels like it would lots of fun with friends. Unfortunately I don't have a bunch of friends that I can play this with and there are not enough npc's to help you serve customers, and it gets very overwhelming especially when you unlock the ice cream machine. This game would be super fun if they added a person to help with drive through, or a person to help with grilling, or maybe even a person to help with serving ice cream and filling drinks. I probably will not play this game again, unless the add these things",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "10/10 best game ever, love stealing ingredients (cheese specifically) and hiding it around the restaurant",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "An unexpectedly addictive blend of chaos and charm, Fast Food Manager turns running your own little restaurant into pure, joyful momentum. Juggling orders, upgrading equipment, perfecting layouts, and watching your diner come alive is deeply rewarding. It’s fast, funny, and packed with that “one more shift” energy that keeps you playing long after you planned to stop. A delightful management sim that’s easy to love and hard to quit.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "When i get home from my twenty hour shift at the local amazon warehouse i love to boot up this game and just feel as the stress melts away and the anger at the customer fills me up reminding me everyday why im no longer allowed within 500 feet of a mailbox",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is a very simple game but it's really fun. Honestly I think it's one of the best simulator games out there. All other simulator games I've played has had some jankiness and/or bugs. I've not see any in this one. They didn't add in any extra bs. It's just a simple fast food restaurant and nothing more. No super grindy profession type farming. Perfect for when you're just wanting to chill with some friends. I like a lot of the other simulator games but sometimes you're just feeling like you want something stupid simple with a little bit of chaos. Highly recommend for friend groups that love simulator games.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Let me jump over the front counter. Add fighting rowdy/ Karen customers,. Would like to eat the product.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great game to play with friends! Would benefit from more content, more customization, and more gameplay dynamism. 8.5/10",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Ahh, the only fast food sim game where you can lock up your under paid employees in a freezer for not meeting demand. burger/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very fun and intuitive simulator game about the fascinating life of a fast food worker!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I played 4 hours of this in one day and didn't get bored. The longer you play the more it challenges you, essentially as you grow in skill in the game the game keeps amping it up, keeping the difficulty on par with the player.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Pretty fun and decent game. It does bring me back to my restaurant days. Also met some pretty cool people from playing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is the best you get to make food and have fun and its a good game to play when your bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the \"Maybe\" reviews. \r\n\r\nReasons for \"Yes\" include the fact that the game works great in multiplayer, it causes fun chaos on streams, and the progression feels appropriate.\r\n\r\nReasons for \"No\" include that the drive thru does not get used by the ordering NPCs in proper percentage with the front counter (drive thru should wrap while the counter has only a few people), the ordering of certain items feels disproportionate (too much coffee for fast food), and the biggest issue I have right now... the super slow evolution of the game. When compared to the release schedule of other games like Motor Town or Supermarket Together, this game lags way behind, and this is concerning for the future of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "friend forgets to put top bun before wrapping burger. scolds friend. forgets top bun before wrapping burger myself. sighs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun when played with friends and on VC\nOne of us shifted into his work personality since we were all messing around -> 10/10 will mess with them again!\n\nCan't wait for the next update!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is lit!  Not perfect but lots more details than I expected.  And it seems to run very nicely.  Nice online co-op.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun game with friends but still good if you play alone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game caused a rift in my friends group that has never healed. One friend put too many pickles on a sandwich and then blamed another for ruining everything because they didn't make an ice cream. This game causes people to become irrational and lash out at others for no reason. Also, all the unlockable ingredients are burger focused so the only thing that becomes overly tedious to complete are the burgers. There needs to be more balance as far as burger orders go and also there needs to be a way for people to learn how to work with others and understand that this is just a video game where people make hamburgers and that being indifferent about certain tragedies is perfectly normal and not a reason to completely end 20-year long friendships.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Exactly what it says on the box, its not a deep game by any metric, but if you're itching for a FP diner dash kinda thing, then this is a pretty decent.\r\n\r\nWould love to see them add the ability to better customize your store, move things around, have special events (any fast food worker knows the dread of seeing a school bus turn into your lot) , just overall flesh it out a bit more. but I like what I see so far!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the few coop games that incorporates everyone playing. Every task and position is just as important. Such a fun energizing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple to learn, fun to play. My wife and I will play this after we put the kids to bed and its a great game to unwind and laugh over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun with friends, we looked up burger joint lingo and actually started sounding like a real diner",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely fun to hunt for the achievements with a partner. I don't know how I'd cope with this as single player - it was pretty hectic at times. \nTips for improvement: \nThe serving window could last a little longer, and perhaps be something changed each day rather than on the server start. \nI'd love to be able to throw stuff - there are opportunities to mess with other players, but being able to yeet finished burgers through the kitchen is a missed opportunity. \nAs players, we are meant to manage the kitchen - perhaps the 'boss' could have more of a presence (audibly/through messages).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "overall its good, but the game is basically dead so if you want a game updating recently don't buy this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun game to play as a group but as someone who likes to play solo, this is a very difficult game. They should add the ability to hire a Drive Thru Cashier and 1 or 2 AI Cooks that you can designate too certain stations. Not sure if that would be difficult to do but overall it is a fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More fun than I expected. I play with my girlfriend and daughter. We have streamlined our workflow and grown our restaurant. My daughter recommends coming out with a Spongebob Squarepants DLC that turns the game into The Crusty Crab and be able to play as the main characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love everything about it.  I can't wait for more content to be added!  I want to be even more stressed out by the amount of different foods I need to prepare every day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Felt like a real job, cashier aint working, two people standing around and no one working the drive through. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This Game is rly Fun to Play And Its Good with Firends My Fav thig is Just makeing the npcs made at good bruger",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is good for people who love cooking and for people who don't wanna get yelled at by customers for messing up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fast Food Simulator is a surprisingly fun game, especially when playing with friends. The progression system makes unlocking new items exciting and keeps the gameplay fresh. It nails the balance between casual play and the satisfaction of running a busy kitchen.\r\n\r\nMy only real complaint so far is the layout of the drink and ice cream machine. Since it faces the front counter, I often feel forced to prepare food near the register instead of working efficiently in the kitchen area. A small adjustment to its orientation would make the flow much smoother and more natural.\r\n\r\nOverall, it’s a great experience with plenty of replay value, and I’d recommend it to anyone looking for a lighthearted but engaging simulator.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy this game but you definitely need friends to make it better. The more you have the better as you can have a more efficient restaurant. Would recommend but with others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is seriously fun with friends and also I was gifted this game for free to play with my friend and it was a blast.  10/10 and I would even say game of the year if your looking for a coop game to play with your friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has brought many laughs and smiles to my family and friends. It's such a family worthy purchase of a game, Seeing there's coming out with new updates I'm super excited for!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although with controller support, it's not recommended to played it on steam deck.\n\nThe control for the gamepad is bad and highly recommended to play with mouse and keyboard.\n\nOverall, the game is good to have some time with family or friends, though sometimes it's stressed if you can't complete the order.\n\nQuite easy to achieve 100% achievements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ah, just the game I was looking for. A game that gives me a stressful job when I'm not at work. Just what I look forward to when I get home from working retail. Luckily I have friends who are \"more than happy\" to suffer with me as we struggle to get orders out fast enough. Slight sarcasm aside, I love this game and the chaos and confusion it causes which resembles real life pretty well. REV UP THOSE FRYERS!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a fun game! The only downside of the game is that you can't hire someone to help you in the kitchen when playing single player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is really fun to play, as some people said ultimate burger flipper simulator xD\nHaven't tried the game with friends but I as a single player it's really fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very fun with friends and I look forward to any new content that may happen in the future, however I do wish that the devs would use the funds they've undeniably made from this game to commission real art for this games thumbnail and assets. I think that little bit of added charm would complete the experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game just needs a couple things fixed like the cashier when you hire them it throws away the receipts and u cant get the server to serve the food",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty amazing. Much better with a good group of friends, though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun, but can beat it in 15 hrs with the right people, and currently lacks content but other than that, its a really fun game to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun! Straight-forward gameplay with added tutorials you can access within the kitchen. Leveling up is fairly easy but doesn't seem too fast, since you get new items/products every other level. Been playing for 6 hours at the time of this review, and I'm only level 17 (the highest at the moment is 30). Getting money isn't too difficult either, and I didn't have any issues starting out (ex. running out of funds but still needing products). You can change the difficulty level, but I've been chilling at Normal. There are days when you get swamped with orders if you're not fast enough, but you can always get employees (server, cashier, busser, stocker) to assist, which helps you stay in the kitchen.\r\n\r\nThe only problem I've run into was that the busser and server got stuck on each other by the trash can, causing two orders to be late (customer leaving (-50 popularity) and temperatures of food causing complaints (melted ice cream, warm soda, cool fries, etc.)).\r\n\r\nOther than that, totally recommend for those who like food simulators where you gradually get more products as you level up, very hands-on gameplay, and some micromanaging. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a blast in co-op but is a little challenging to play solo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very enjoyable game that increases in complexity as you go. Great with friends, very hard to solo at higher levels.\r\n\r\nWould you like fries with that?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It brings the fun of working at a fast food restaurant and how much you realize how hectic it can get with everything that they have to make.  It makes you appreciate fast food workers much more, because the game makes the customers get mad when you don't bring them a part of their meal or if their ice cream is kind of melted.  The game really makes you feel that shame that you did not make the perfect order for that customer and get the most popularity you can get via the customers word of mouth.   Now I have only played on mostly normal mode and a couple times on hard mode with people who didn't know how to play completely and it was a complete failure, but it makes you want to try and try again to be the best restaurant you can be.  Also, you can name your restaurant anything you want to which is cool.  You can cook a burger perfect in this game getting 100% on each side of the burger and it gives you a rush that you have crafted the perfect patty, a patty that even Spongebob himself would bow down to. \r\n\r\nNow you will start off with not much as it has a good leveling system and does not overwhelm you right away.  You literally start with burger patties and buns with wrappers.  As basic as it can get, but still even on your first day you want to be the best.  Always be the best!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun and super interactive just make sure you have more than two people playing!! Highly recommend to anyone looking for a game to keep you on your toes!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a Very nice game to play with a friend you always have to check on the customers and you’re food stock so it never gets boring but it’s also very stressful from my experience I can recommend the game very much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PLEASE update the game :D \r\nit's fun right now, but, it can be better. Good with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love my 9-5 job flipping frozen burgers non stop. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "haven't played solo yet but play with my friend, is definitely challenging on higher levels when there is 2 of you so we keep having to turn the drive through off to make it through the day!\n\nid like for there to be an easier / quicker way to empty the oil and possibly hiring cooks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a quite fun game, i do experience lag sometimes.. but its most likely because of my awful wifi. I do enjoy this game and I do rreccomend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOVE IT! I never play simulators but after watching Neebs Gaming play I just had to give it a try. I've been hooked. Can't wait to see what gets added in the future!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "'Tis a good game. A little frustrating to play alone sometimes but makes it all the more exciting lol. Love it and looking forward to further updates.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is extremely cozy and perfect to relax about anything you play online alone or with friends. So are you sick of those tryhards Karens & Rednecks that get offended if you stare at them and blame anxiety & the world? Get away from those pussies for a day and open your fast food restaurant! YAAARRRR!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it makes you hungry when you're playing this at 2 in the morning. I just ordered smash burger. gg",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easy in the beginning, stressful with the drive thru\n\nBut always best with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are planning on playing solo, you will find yourself running everywhere, just trying to push out one order at a time. The workload is an awful lot for a solo player, as you have to run everything by yourself up till level 5, and then more ingredients, and items get unlocked. I am yet to unlock the Drivethru, but I'm sure it will double the workload.\n\nIf you are planning on playing with friends, then definitely pick it up, especially on sale. You will either find yourself running it perfectly, or locking your friends in the deep freezer, stacking 10 raw patties on a burger, and force feeding it to a customer. The workload is a bit more evened out for every person that joins, so if you have 4-5 friends that will play, it will run as smooth as butter. All jokes aside, well worth the price, and definitely worth the play.\n\nSolid 8/10\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3613105121",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It get's pretty boring if you play by yourself but if playing with friends or online i is pretty good and in fact i enjoyred playing bymyself for the first few hours getting the new supplies is a  Dopamine  hit although it adds stress but overall playing with friends or online 8.5/10 playing offline around a 6 but a 9/10 for the first few hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, me and my friends had a lot of fun, I was the manager !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game fun making food and fun would reommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "keeps you on your toes cant wait to play with others and interact further in higher levels....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes but for some reson YOU GET CHESSE AT LEVEL 25! I would like chesse earlier in the game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really fun with friends, also a bit chaotic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, recommended for playing with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shout at your friends as you all struggle to figure out the 100%/90% beef patty meta.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this is an awesome game for having only been out a little while. However, I have a couple of notes for folks to consider:\r\nI have no idea why after 13 levels and 15 days I have not unlocked cheese for cheeseburgers or have unlocked fries yet, but have ice cream and a variety of sodas. I think that is a little out of balance, but is so minor I don't mind. \r\nThings get a little weird when you start hiring people. I love that they are so cheap it doesn't matter much if they do well at the job, because there are a few bugs here and there. \r\n1. If the cash register and the busser fall behind, there is this odd glitch where the trays all snap to the first spot the cashier uses, and the tickets coming in will pile on top of each other, and you cannot assign food or ready status to that tray. You have to manually pull the tickets off and assign them their own trays, you cannot set trays on the main counter as the cashier will come and remove them. This happens mainly when the busser neglects to return the tray piles from the trash can. Odd bug, but not a breaker for me. \r\n2. The restocker is terrible. I honestly fired him and just do it myself, it makes less work. They will arbitrarily take items and put them where ever on the shelves immediately in the building to the left of the freezer. All that goes in the freezer for me at this point is the beef, and when ordering 6 cases, they were spread out all over the freezer. You can only pick one case up at a time, so this takes a few minutes to unravel. \r\n\r\n-I would love to see shelf labeling so I can assign stock and product to specific places for the restocker\r\n-The busser and the cashier can be the same person, or the server and busser, I do not think the busser needs to be its own staff, and the 3 roles need to work more in line with one another. The cashier tasks are so instant there is a wild learning curve to setting your own rhythm as you work thru tickets and place trays. \r\n-There is no snapping for placement at all, and that has caused me issues where I grab something I have already placed by mistake, or I can't fit everything on to a tray because I am rushing. Light snapping would be nice, where its easier to most efficiently use all the space available on trays and shelves. \r\n\r\nAll in all I give this baby a solid 7.5/10 \r\nQuality of Life fixes and some added features to the staff would make this game a 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game get to live out my fantasy of being a meth head fry cook 8/10 just need the meth head fry cook look",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to play with friends! 100% recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game to play with friends and family",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game for awhile, so much potential. we need more updates fast.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The tutorials are helpful, the game is very fun, and the developer is always looking for ways to improve it. The game has a lot of potential for future content updates, and there's so much more that has yet to be added, but it is already pretty fun in its current state. \nI definitely recommend playing with friends if you can, but even solo is enjoyable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "at one point of absolute boredom and love for my friends, i would hop on this game at night to pack digital orders after my 9 - 10 shift at my old cafe. i really, really, really, really hate patty duty",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super fun and addicting but the AI isn't quite fleshed out enough to play solo. They do their tasks fine, but the back of house stuff (which is what cannot be automated) is clearly expected to have at least 2 players",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is amusing but also very frustrating , when playing single player, as you start adding more and more items and while the people you hire help a little bit  The \"jobs\" you hire people for are very limited.  The\"busser\" can't be bothered to return the trays to front counter and you're  running the grill, fryers, drinks, drive through and ice cream.  I would fire all the employees for being completely useless. and just standing around when there is work to be done..\r\n\r\nStill, it has promise and I look forward to seeing future improvements.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very chill and simple game, would be great and have more play time if they add more achievements.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "as long as ya got good friends to play with \r\nits a grand ole time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The rush in this game makes me feel what a fast food employee feels!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "do you like working under pressure and multi-task? play this solo!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Amazing game especially if you have friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill game. Open world would be fantastic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its challenging and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game to play during spare time or to kill time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The ultimate burger flipper simulator.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly i just love simulation games and this one is really good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "another viral game that was fun, thats it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game play only with friends!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun. I could play this for hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing with friends is the best thing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun to play with more people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "McDonald's experience game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game that they keep updated!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good to play with others",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got home from work and went to work 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great I kinda learned how to cook",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ill never shit on a fast food employee again lmao",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "make happy customers with chiicken nuggies 6/7",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10 out of 10, would flip burgers again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just like working at McDonalds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game on the market!!!!!!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I cannot lie and say I do not like this game, but I have major issues with the game which may just be me, but it really did impact my experience with the game.\nThe biggest problem with this game is how tedious things can be, for example: emptying oil takes forever and it is insanely annoying to do every SINGLE day in the game. Yes, you could argue and say \"that makes the game realistic\" sure I agree on that, but the fact there is no way to upgrade the ability to drain oil faster is insanely annoying and tedious.\nAnother issue is the fact how long it takes to prepare for the day, later on in the game there is so much things to prepare that it makes it yet again tedious and incredibly boring. You take more time to prepare than you do actually serving customers and playing the game.\n\nDespite those major complaints the game is okay, it runs great it can be addicting no doubt about it. However, progressing later on in the game it is just the same thing over and over again and it just makes the experience just so tedious and uninteresting.\nIf I could leave a mixed review I certainly would as I do love and dislike this game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Good game, but the usage of ai in the thumbnails is disgusting.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "please make this playable long-term SOLO. it's impossible without NPC's to help!! It's a ton of fun, just becomes impossible pretty early on if you're playing solo. even with 3 friends it gets pretty hard.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i bought this on steam a few days ago, but whenever i create my own server, it stops loading, hangs and eventually crashes. i really hope it gets fixed soon because i really want to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's a bug that doesn't let me end the day, so I can't save the game or play past day 1.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Updates are too infrequent and missing a lot of essential things.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great friend slop but poorly optimized and the use of AI art (especially on the steam page) is inexcusable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Received a permanent ban from the discussions for saying \"Dead game, leave a negative review on the store.\" \n\nWithin an hour, yet they couldn't update their game for over a year. (If you don't count the CONTROLLER SUPPORT) as an update, literally...that was the whole update... Support for controller. \n\nThis tells you all you need to know about this developer.\n\nThey should start removing games like this from Steam.\n\nGame Dev has 3,000 hours in Rocket League, and 32 hours in his own game...since release.\n\nAlso they use AI art.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "A Half-Baked Cash Grab Masquerading as a Game\n\nFast Food Simulator promises a sizzling experience behind the counter — flipping burgers, managing orders, and building your culinary empire. Unfortunately, what it actually delivers is a cold, greasy mess that feels less like a genuine simulation and more like an uninspired cash grab rushed out of the kitchen.\n\nOptimization Disaster\n\nFrom the moment you boot up the game, the technical issues start piling up faster than drive-thru orders at rush hour. The frame rate stutters even on high-end PCs, textures pop in and out, and character animations jitter like malfunctioning animatronics. Load times are painfully long, and random crashes make it nearly unplayable. It’s clear that Fast Food Simulator was thrown together without proper optimization or testing.\n\nShallow Gameplay\n\nFor a simulator, there’s shockingly little to simulate. The gameplay loop consists of repetitive, uninspired tasks — clicking on ingredients, assembling orders, and serving customers whose dialogue repeats after five minutes. There’s no meaningful progression system, management mechanics are non-existent, and the AI is laughably bad. It feels like a mobile mini-game stretched out and sold at a premium price.\n\nPoor Visuals and Audio\n\nVisually, the game looks like it’s from 2010 — flat lighting, low-resolution textures, and clunky character models. The soundtrack loops endlessly, and the sound effects are so repetitive that you’ll want to mute the game within minutes. There’s no atmosphere or charm to speak of, just a lifeless digital kitchen.\n\nFinal Verdict\n\nFast Food Simulator is a sloppy, undercooked product that feels more like a cynical attempt to cash in on the simulator trend than a real effort to entertain players. Between its poor optimization, lack of depth, and blatant monetization schemes, there’s little reason to recommend it to anyone — even die-hard fans of quirky simulation games. DO NOT BUY THEY DON'T UPDATE OR CARE ABOUT THERE PLAYERS",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A BIG NO for me. Who in there right mind opens up a fastfood chain with just 1 staff??? the 1st 1 hour stressed me like im playing Dark Soulls! there is a foundation here for Multiplayer but Singleplayer just sucks! Can the DEVS at least give starting crews when playing singleplayer!??? refund for now",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It never works when I TRY! to join it just gets stuck dont recomend .if u find out how to fix it TELL ME.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game gave me ptsd - Would not recommend if you've worked food service/retail",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not bad but needs work cant  hardly play with others",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI usage in the capsule image. Literally a waste of time",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unstable and unplayable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please do not encourage A.I content.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Couldnt play with my friend :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just your usual shovelware......",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "AI art slop",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "AI art bad",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "гавно",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Devs are changing from Steam Online Services to Epic Online Services to handle multiplayer. I wouldn't have bought the game if I knew that beforehand. EOS has consistently never worked properly for me and many other games I've seen switch to it have ended up switching back at a huge cost of time and development effort to the product.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "I cannot lie and say I do not like this game, but I have major issues with the game which may just be me, but it really did impact my experience with the game.\nThe biggest problem with this game is how tedious things can be, for example: emptying oil takes forever and it is insanely annoying to do every SINGLE day in the game. Yes, you could argue and say \"that makes the game realistic\" sure I agree on that, but the fact there is no way to upgrade the ability to drain oil faster is insanely annoying and tedious.\nAnother issue is the fact how long it takes to prepare for the day, later on in the game there is so much things to prepare that it makes it yet again tedious and incredibly boring. You take more time to prepare than you do actually serving customers and playing the game.\n\nDespite those major complaints the game is okay, it runs great it can be addicting no doubt about it. However, progressing later on in the game it is just the same thing over and over again and it just makes the experience just so tedious and uninteresting.\nIf I could leave a mixed review I certainly would as I do love and dislike this game.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Game is a lot of fun but the devs should consider hiring a real artist now to update their thumbnails.",
      "voted_up": false,
      "votes_helpful": 180
    },
    {
      "review": "Dead game. Devs updated nothing since release worth value. Last update was 4 months ago and it was minimal. Don't waste your time. Wish I could get a refund.",
      "voted_up": false,
      "votes_helpful": 130
    },
    {
      "review": "Frustrated with lack of development. Not enough of a game to be worth the price.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "the game itself is trying to commit suicide every second it remains opened, hoping it gets fixed with time but for now I must leave it to rest away from the bugs and crashes",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "In its current state, I cannot recommend this. The game is lots of fun with friends, but once you've reached level 20, the fun dies and it becomes a grind. There's lots of inconsistent game mechanics, annoying bugs, griefers, and most lobbys are either children or foreigners that kick you immediately. There isn't enough here yet, I'd wait for a couple updates or wishlist and grab this for when its about $8 or so.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good game, but the usage of ai in the thumbnails is disgusting.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Seems like it could be a really fun game, but every other customer keeps saying \"buns are in the wrong order\" and then walk out. I go in to the kitchen and randomly, burger buns lids have appeared back on the side. I thought I made a mistake at first but it kept happening so I searched online and it seems to be a common issue for a long time now.\n\nSadly I have refunded the game as I cannot play like this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lacks basic QoL features (missing button prompts for certain actions, for example) and has a terribly unintuitive UI.  Very barebones progression system and lacking customization for both your character and the restaurant.  Charging over $5 for this game is a crime, and even then I wouldn't buy it when alternatives exist for free.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "please make this playable long-term SOLO. it's impossible without NPC's to help!! It's a ton of fun, just becomes impossible pretty early on if you're playing solo. even with 3 friends it gets pretty hard.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is fun but its been glitching, needs more updates and some cooks need to be added. needs some work its been very glitchy and lagging once I reached a higher level.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As a steam deck player don't buy this game. They are now using Epic for matchmaking and honestly there's not enough content in the game, lack of updates and feedback going on.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I think the game is great but wish I had read the fine print as they do use ai for the steam page, you have definitely made enough money from this game for that to not be necessary.\n\noutside of the ai imagery, the game is very fun and charming, inconsistent sometimes tho.\n\nfor example, you need to keep the milk hot but burger patties are fine all day left out, they stay hot\n\nneed to refill drink syrups but never need to replace anything with the ice cream machine\n\ntrash cans need to be emptied but the trash can on the shop floor is infinite and never needs to be emptied\n\nGrabbing things for the supply truck is tedious and not fun, if the items stack in the truck, why can i not stack them anywhere else.\n\nit is a very good time waster and you will always have something to do, haven't played on my own so can't say if the difficulty is balanced there, but playing with 2 people is perfect, we do turn the drive through off though.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately game is too difficult to play alone. Devs have gone radio silence for 4+ months. I had high expectations with updates the game would become even more fun, however it seems like the game is dead.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "like, it's fun but only for the start and then the lack of QoL gets too much, more than one staff of each type would be great, and more staff types too. \n\nI enjoyed playing this game with friends but it's definitely not all there yet, so it's not recommended as of 03/12/2025 but maybe (hopefully) in the future",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i bought this on steam a few days ago, but whenever i create my own server, it stops loading, hangs and eventually crashes. i really hope it gets fixed soon because i really want to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's a bug that doesn't let me end the day, so I can't save the game or play past day 1.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Would be fun with friends but the pace is a slow in the first few levels making multi-player lose interest quickly. Got to lvl 16 solo which is not playable due to hired staff only doing simple jobs. Starts to feel like a real job.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Updates are too infrequent and missing a lot of essential things.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great friend slop but poorly optimized and the use of AI art (especially on the steam page) is inexcusable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A Half-Baked Cash Grab Masquerading as a Game\n\nFast Food Simulator promises a sizzling experience behind the counter — flipping burgers, managing orders, and building your culinary empire. Unfortunately, what it actually delivers is a cold, greasy mess that feels less like a genuine simulation and more like an uninspired cash grab rushed out of the kitchen.\n\nOptimization Disaster\n\nFrom the moment you boot up the game, the technical issues start piling up faster than drive-thru orders at rush hour. The frame rate stutters even on high-end PCs, textures pop in and out, and character animations jitter like malfunctioning animatronics. Load times are painfully long, and random crashes make it nearly unplayable. It’s clear that Fast Food Simulator was thrown together without proper optimization or testing.\n\nShallow Gameplay\n\nFor a simulator, there’s shockingly little to simulate. The gameplay loop consists of repetitive, uninspired tasks — clicking on ingredients, assembling orders, and serving customers whose dialogue repeats after five minutes. There’s no meaningful progression system, management mechanics are non-existent, and the AI is laughably bad. It feels like a mobile mini-game stretched out and sold at a premium price.\n\nPoor Visuals and Audio\n\nVisually, the game looks like it’s from 2010 — flat lighting, low-resolution textures, and clunky character models. The soundtrack loops endlessly, and the sound effects are so repetitive that you’ll want to mute the game within minutes. There’s no atmosphere or charm to speak of, just a lifeless digital kitchen.\n\nFinal Verdict\n\nFast Food Simulator is a sloppy, undercooked product that feels more like a cynical attempt to cash in on the simulator trend than a real effort to entertain players. Between its poor optimization, lack of depth, and blatant monetization schemes, there’s little reason to recommend it to anyone — even die-hard fans of quirky simulation games. DO NOT BUY THEY DON'T UPDATE OR CARE ABOUT THERE PLAYERS",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A BIG NO for me. Who in there right mind opens up a fastfood chain with just 1 staff??? the 1st 1 hour stressed me like im playing Dark Soulls! there is a foundation here for Multiplayer but Singleplayer just sucks! Can the DEVS at least give starting crews when playing singleplayer!??? refund for now",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It never works when I TRY! to join it just gets stuck dont recomend .if u find out how to fix it TELL ME.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not bad but needs work cant  hardly play with others",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI usage in the capsule image. Literally a waste of time",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unstable and unplayable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please do not encourage A.I content.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Couldnt play with my friend :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just your usual shovelware......",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "AI art slop",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "AI art bad",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "гавно",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Devs are changing from Steam Online Services to Epic Online Services to handle multiplayer. I wouldn't have bought the game if I knew that beforehand. EOS has consistently never worked properly for me and many other games I've seen switch to it have ended up switching back at a huge cost of time and development effort to the product.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "I cannot lie and say I do not like this game, but I have major issues with the game which may just be me, but it really did impact my experience with the game.\nThe biggest problem with this game is how tedious things can be, for example: emptying oil takes forever and it is insanely annoying to do every SINGLE day in the game. Yes, you could argue and say \"that makes the game realistic\" sure I agree on that, but the fact there is no way to upgrade the ability to drain oil faster is insanely annoying and tedious.\nAnother issue is the fact how long it takes to prepare for the day, later on in the game there is so much things to prepare that it makes it yet again tedious and incredibly boring. You take more time to prepare than you do actually serving customers and playing the game.\n\nDespite those major complaints the game is okay, it runs great it can be addicting no doubt about it. However, progressing later on in the game it is just the same thing over and over again and it just makes the experience just so tedious and uninteresting.\nIf I could leave a mixed review I certainly would as I do love and dislike this game.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Game is a lot of fun but the devs should consider hiring a real artist now to update their thumbnails.",
      "voted_up": false,
      "votes_helpful": 180
    },
    {
      "review": "Dead game. Devs updated nothing since release worth value. Last update was 4 months ago and it was minimal. Don't waste your time. Wish I could get a refund.",
      "voted_up": false,
      "votes_helpful": 130
    },
    {
      "review": "Frustrated with lack of development. Not enough of a game to be worth the price.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "the game itself is trying to commit suicide every second it remains opened, hoping it gets fixed with time but for now I must leave it to rest away from the bugs and crashes",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "In its current state, I cannot recommend this. The game is lots of fun with friends, but once you've reached level 20, the fun dies and it becomes a grind. There's lots of inconsistent game mechanics, annoying bugs, griefers, and most lobbys are either children or foreigners that kick you immediately. There isn't enough here yet, I'd wait for a couple updates or wishlist and grab this for when its about $8 or so.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good game, but the usage of ai in the thumbnails is disgusting.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Seems like it could be a really fun game, but every other customer keeps saying \"buns are in the wrong order\" and then walk out. I go in to the kitchen and randomly, burger buns lids have appeared back on the side. I thought I made a mistake at first but it kept happening so I searched online and it seems to be a common issue for a long time now.\n\nSadly I have refunded the game as I cannot play like this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lacks basic QoL features (missing button prompts for certain actions, for example) and has a terribly unintuitive UI.  Very barebones progression system and lacking customization for both your character and the restaurant.  Charging over $5 for this game is a crime, and even then I wouldn't buy it when alternatives exist for free.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "please make this playable long-term SOLO. it's impossible without NPC's to help!! It's a ton of fun, just becomes impossible pretty early on if you're playing solo. even with 3 friends it gets pretty hard.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is fun but its been glitching, needs more updates and some cooks need to be added. needs some work its been very glitchy and lagging once I reached a higher level.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As a steam deck player don't buy this game. They are now using Epic for matchmaking and honestly there's not enough content in the game, lack of updates and feedback going on.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I think the game is great but wish I had read the fine print as they do use ai for the steam page, you have definitely made enough money from this game for that to not be necessary.\n\noutside of the ai imagery, the game is very fun and charming, inconsistent sometimes tho.\n\nfor example, you need to keep the milk hot but burger patties are fine all day left out, they stay hot\n\nneed to refill drink syrups but never need to replace anything with the ice cream machine\n\ntrash cans need to be emptied but the trash can on the shop floor is infinite and never needs to be emptied\n\nGrabbing things for the supply truck is tedious and not fun, if the items stack in the truck, why can i not stack them anywhere else.\n\nit is a very good time waster and you will always have something to do, haven't played on my own so can't say if the difficulty is balanced there, but playing with 2 people is perfect, we do turn the drive through off though.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately game is too difficult to play alone. Devs have gone radio silence for 4+ months. I had high expectations with updates the game would become even more fun, however it seems like the game is dead.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "like, it's fun but only for the start and then the lack of QoL gets too much, more than one staff of each type would be great, and more staff types too. \n\nI enjoyed playing this game with friends but it's definitely not all there yet, so it's not recommended as of 03/12/2025 but maybe (hopefully) in the future",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i bought this on steam a few days ago, but whenever i create my own server, it stops loading, hangs and eventually crashes. i really hope it gets fixed soon because i really want to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's a bug that doesn't let me end the day, so I can't save the game or play past day 1.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Would be fun with friends but the pace is a slow in the first few levels making multi-player lose interest quickly. Got to lvl 16 solo which is not playable due to hired staff only doing simple jobs. Starts to feel like a real job.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Updates are too infrequent and missing a lot of essential things.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great friend slop but poorly optimized and the use of AI art (especially on the steam page) is inexcusable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A Half-Baked Cash Grab Masquerading as a Game\n\nFast Food Simulator promises a sizzling experience behind the counter — flipping burgers, managing orders, and building your culinary empire. Unfortunately, what it actually delivers is a cold, greasy mess that feels less like a genuine simulation and more like an uninspired cash grab rushed out of the kitchen.\n\nOptimization Disaster\n\nFrom the moment you boot up the game, the technical issues start piling up faster than drive-thru orders at rush hour. The frame rate stutters even on high-end PCs, textures pop in and out, and character animations jitter like malfunctioning animatronics. Load times are painfully long, and random crashes make it nearly unplayable. It’s clear that Fast Food Simulator was thrown together without proper optimization or testing.\n\nShallow Gameplay\n\nFor a simulator, there’s shockingly little to simulate. The gameplay loop consists of repetitive, uninspired tasks — clicking on ingredients, assembling orders, and serving customers whose dialogue repeats after five minutes. There’s no meaningful progression system, management mechanics are non-existent, and the AI is laughably bad. It feels like a mobile mini-game stretched out and sold at a premium price.\n\nPoor Visuals and Audio\n\nVisually, the game looks like it’s from 2010 — flat lighting, low-resolution textures, and clunky character models. The soundtrack loops endlessly, and the sound effects are so repetitive that you’ll want to mute the game within minutes. There’s no atmosphere or charm to speak of, just a lifeless digital kitchen.\n\nFinal Verdict\n\nFast Food Simulator is a sloppy, undercooked product that feels more like a cynical attempt to cash in on the simulator trend than a real effort to entertain players. Between its poor optimization, lack of depth, and blatant monetization schemes, there’s little reason to recommend it to anyone — even die-hard fans of quirky simulation games. DO NOT BUY THEY DON'T UPDATE OR CARE ABOUT THERE PLAYERS",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A BIG NO for me. Who in there right mind opens up a fastfood chain with just 1 staff??? the 1st 1 hour stressed me like im playing Dark Soulls! there is a foundation here for Multiplayer but Singleplayer just sucks! Can the DEVS at least give starting crews when playing singleplayer!??? refund for now",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It never works when I TRY! to join it just gets stuck dont recomend .if u find out how to fix it TELL ME.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not bad but needs work cant  hardly play with others",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI usage in the capsule image. Literally a waste of time",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unstable and unplayable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please do not encourage A.I content.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Couldnt play with my friend :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just your usual shovelware......",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "AI art slop",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "AI art bad",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "гавно",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Devs are changing from Steam Online Services to Epic Online Services to handle multiplayer. I wouldn't have bought the game if I knew that beforehand. EOS has consistently never worked properly for me and many other games I've seen switch to it have ended up switching back at a huge cost of time and development effort to the product.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "I cannot lie and say I do not like this game, but I have major issues with the game which may just be me, but it really did impact my experience with the game.\nThe biggest problem with this game is how tedious things can be, for example: emptying oil takes forever and it is insanely annoying to do every SINGLE day in the game. Yes, you could argue and say \"that makes the game realistic\" sure I agree on that, but the fact there is no way to upgrade the ability to drain oil faster is insanely annoying and tedious.\nAnother issue is the fact how long it takes to prepare for the day, later on in the game there is so much things to prepare that it makes it yet again tedious and incredibly boring. You take more time to prepare than you do actually serving customers and playing the game.\n\nDespite those major complaints the game is okay, it runs great it can be addicting no doubt about it. However, progressing later on in the game it is just the same thing over and over again and it just makes the experience just so tedious and uninteresting.\nIf I could leave a mixed review I certainly would as I do love and dislike this game.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Game is a lot of fun but the devs should consider hiring a real artist now to update their thumbnails.",
      "voted_up": false,
      "votes_helpful": 180
    },
    {
      "review": "Dead game. Devs updated nothing since release worth value. Last update was 4 months ago and it was minimal. Don't waste your time. Wish I could get a refund.",
      "voted_up": false,
      "votes_helpful": 130
    },
    {
      "review": "Frustrated with lack of development. Not enough of a game to be worth the price.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "the game itself is trying to commit suicide every second it remains opened, hoping it gets fixed with time but for now I must leave it to rest away from the bugs and crashes",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "In its current state, I cannot recommend this. The game is lots of fun with friends, but once you've reached level 20, the fun dies and it becomes a grind. There's lots of inconsistent game mechanics, annoying bugs, griefers, and most lobbys are either children or foreigners that kick you immediately. There isn't enough here yet, I'd wait for a couple updates or wishlist and grab this for when its about $8 or so.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good game, but the usage of ai in the thumbnails is disgusting.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Seems like it could be a really fun game, but every other customer keeps saying \"buns are in the wrong order\" and then walk out. I go in to the kitchen and randomly, burger buns lids have appeared back on the side. I thought I made a mistake at first but it kept happening so I searched online and it seems to be a common issue for a long time now.\n\nSadly I have refunded the game as I cannot play like this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lacks basic QoL features (missing button prompts for certain actions, for example) and has a terribly unintuitive UI.  Very barebones progression system and lacking customization for both your character and the restaurant.  Charging over $5 for this game is a crime, and even then I wouldn't buy it when alternatives exist for free.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "please make this playable long-term SOLO. it's impossible without NPC's to help!! It's a ton of fun, just becomes impossible pretty early on if you're playing solo. even with 3 friends it gets pretty hard.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is fun but its been glitching, needs more updates and some cooks need to be added. needs some work its been very glitchy and lagging once I reached a higher level.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As a steam deck player don't buy this game. They are now using Epic for matchmaking and honestly there's not enough content in the game, lack of updates and feedback going on.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}