{
  "positive": [
    {
      "review": "Geralt saves the day… again. Monsters, magic, and moral choices everywhere. Got lost in side quests for 80 hours and loved every second. Witcher life > real life",
      "voted_up": true,
      "votes_helpful": 144
    },
    {
      "review": "Read all the books, played all the games. My favorite story so far!! \r\nNetflix sucks thou",
      "voted_up": true,
      "votes_helpful": 113
    },
    {
      "review": "I didn’t expect this game to understand me the way it did.\nThe Witcher 3 isn’t just about monsters or magic, it’s about people trying to stay kind in a cruel world. Every quiet sunset ride, every moment you stop on a hill just to listen to the wind, it reminds you how beautiful it is to feel something again.\n\nGeralt may say little, but the world speaks through him.\n“Wind’s howling” hits different when you’ve weathered your own storms.\n\nSome games entertain you. This one stays with you. It teaches you patience, empathy, and the quiet strength of doing the right thing even when no one’s watching.\n\nIf you ever needed a reason to slow down and remember that even in chaos, there’s beauty, this is it.",
      "voted_up": true,
      "votes_helpful": 157
    },
    {
      "review": "It seemed kinda boring at first but after I decided to give it a second chance it gave me one of the best weeks in my life \r\n[h3]10/10 a must play game[/h3]",
      "voted_up": true,
      "votes_helpful": 38
    },
    {
      "review": "Every time I said I will only play for one hour, but that hour turned into at least 5. I can't express in words how much I love this game but I can say for certain that it has ruined all the other RPGs for me.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "The Witcher 3: Wild Hunt is a masterpiece of open-world RPG design. Its open world is not only visually stunning but also alive with detail, from bustling cities and war-torn villages to eerie swamps and monster infested wilderness. The narrative is so rich with moral ambiguity which make you feel that your choices carry real weight and consequences.  This combined with amazing soundtrack, memorable characters and two great expansions (Hearts of Stone and Blood and Wine) makes Geralt of Rivia's journey an unforgettable experience.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "I just finished The Witcher 3: Wild Hunt, and I’m honestly still processing everything I experienced. This game isn’t just something you play. It’s something you live through. The writing is incredible in a way few games ever achieve. Every quest, no matter how small, feels meaningful. Every character feels real. The choices you make don’t fit neatly into good or bad… they feel human, and they stay with you long after you’ve made them.\n\nThe world itself is stunning. From the foggy swamps of Velen to the windswept cliffs of Skellige, every place feels alive and full of history. There were so many moments when I stopped just to take it all in, to watch the light change over the landscape or listen to the sound of a village coming to life in the distance. It’s one of the most beautiful and immersive worlds I’ve ever explored.\n\nThe combat surprised me too. Once it clicks, it’s incredibly satisfying. There’s a rhythm to it, a sense of precision and preparation that makes every encounter feel earned. Mixing swordplay, potions, and signs makes you feel like a true witcher: skilled, focused, and dangerous.\n\nNow that I’ve seen the credits, I can’t help but feel a little empty. The kind of emptiness that comes when you finish something truly special. The Witcher 3 is more than just a game. It’s a story about choice, consequence, and finding a place in a world that doesn’t always make sense. And it’s a journey I’ll never forget.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "The Witcher 3 is one of those rare RPGs that pulls you in and refuses to let go. The world feels alive, the characters are unforgettable, and even the side quests are ridiculously well-written. Combat is fun and fluid, and exploring the countryside never gets old. If you like big adventures with tons of heart, this game’s a must-play.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "In my 20+ years of gaming experience, this game was and still is the only one the left me speechless. I finished it multiple times, and every time after completion I had the same reaction, it is simply THAT good. I remember first time completing it, couldn't play any other game for a year. Not to mention I've read all the books. Won't go too much on the review, just buy the game, even when it is not on the discount, and be ready to live another life as a monster hunter, father, lover, whatever you want.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game is gold standard. It should be on any gamer's bucketlist. Ages like a fine wine.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "jujur ini gamenya awal aku gak terlalu suka tapi makin ke puncak makin dibawa emosionalnya sama ni game, setelah perjuangan rasanya gamenya sepi banget tiba2 kaer mohen gak ada siapa2. rasanya habis perang langsung hampa. pokoknya, ini game buaguss banget detail2 story gila sih apalagi emosional pemainya.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "10 years later and,\n.\nThis is still the greatest RPG I've ever played. I don't know how any game could out-do it. It's perfect in just about every aspect. The story is phenomenal, the gameplay is fun and engaging, the skill progression is rewarding, the graphics are still some of the best I've seen.\n.\n10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I started The Witcher 3 on October 1st, not knowing that this game would slowly become a part of my life for the next two months. The deeper I went, the more I realized that I wasn’t just playing — I was living inside its world.\nEvery system, every mechanic, every side quest, every story beat… they pulled me in with a feeling I rarely get from games today.\n\nModern RPGs may be more advanced, more polished, more cinematic — but this game carries something they often lack: soul.\nThe Witcher 3 feels alive.\nThe characters feel human.\nAnd every choice feels like it matters.\n\nI finished the game twice, including NG+, and Death March taught me patience, timing, and discipline. It was challenging, but never unfair — a difficulty that respected my effort. As someone who enjoys Soulslike games, I could feel the same heartbeat of determination in every battle.\n\nCompleting every achievement — 100% — took me a little over two months. But when the final achievement unlocked, it wasn’t just satisfaction. It was a strange mix of pride and emptiness… the feeling you get when a great journey ends.\n\nThe Witcher 3 is more than just an RPG.\nIt is a story about choices, consequences, love, loss, pain, and hope.\nIt is a world that welcomes you, tests you, and stays with you long after the credits roll.\n\nIf you want to understand what a timeless RPG looks like — start here.\nSome masterpieces age.\nThis one doesn’t.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of my favorite game to 100%, the quests and side quests are amazing, time will fly by when you are exploring this open world with the amazing soundtrack, everybody should buy this game and experience the witcher world and gwent, the best mini game in all of gaming history.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The Witcher 3 is one of the best RPGs I’ve ever played.The world feels alive — every place, from Velen’s muddy villages to Novigrad’s busy streets and Skellige’s cold mountains, has its own mood. Just walking around makes you feel part of the world.The story is emotional and well-written, especially Geralt’s search for Ciri. Even the side quests feel meaningful and often hit harder than the main missions in other games. The characters—Geralt, Ciri, Yennefer, Triss, and many others—are deep, realistic, and memorable.\r\nProgressing your character is satisfying. You can build Geralt the way you want, whether it’s stronger signs, better sword fighting, or using potions and oils like a true Witcher. Combat feels smooth, fast, and tactical, especially when fighting big monsters.Overall, it’s an amazing game with great environment, story, characters, and combat.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Literally the best product ever created, with a formula that cannot be replicated in modern games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game but i just got tired of the same gameplay cycle after 60 hours. Leaving the world i had become somewhat attached to and going to a completely different land where i was supposed to give a flying fuck about some random characters killed the pace a lot for me and i lost interest in the game...\nOkay since its a popular comparison and it is one of my favorite games i guess i will compare it to Skyrim:\nQuests are better in the Witcher 3 as is the writing, theres still plenty of skyrimesque fetch quests but a handful that reach beyond anything from that game. Having to use the same boring witcher sense mechanic in each and every one gets tiresome after a while though.\nThe world is fine but it doesn't hold a candle to Skyrim, something about the Witchers presentation feels fairly generic, the music and all that, its just what you hear in your average run of the mill medieval fantasy game with a few exceptions here and there.\nSkellige no doubt is the best looking part of the map but, again, its beautiful in a generic way. You have pretty vocal harmonies playing over and the whole map is just made up of vast mountains that are what really give it the edge over other parts of the map. (i.e Velen, which is just the same style repeated for the entire skyrim sized region)  The game just lacks a unique visual identity, also the female models are way too oversexualized and it takes away from a lof of the characters, i wish they just made them look like normal people.\nThe acting is fine, i think bad direction shoots it the foot sometimes...",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game, great story. Too bad I’m aging faster than I’m progressing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is so good and it's one of the best games ever.\nThe story, quests and atmosphere is unmatched!!! \n\nI’ve spent over 400 hours on this game in total, but only about 200 of those are on Steam and every single hour was full of enjoyment.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Once in a lifetime game! I bought this game two years ago and never played it because I got bored. Since I finally had some free time, I decided to give it another chance. The first few hours were boring, but its one of those games where you need to be patient before it gets good. This game easily my top 5.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The Witcher 3 might actually be the reason I ignore half my responsibilities. I play “just one quest,” and suddenly it’s 3 AM and I’m emotionally invested in fixing a random villager’s marriage problems. No other RPG makes me care this much about people I’ve never met. The world is huge, the writing is ridiculous in the best possible way, and Geralt somehow manages to be cool, grumpy, and wholesome at the same time. In the end, it’s one of those rare games that stays with you long after you close it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Witcher 3 has basically become a benchmark for modern RPGs, after finally beating it, I get why. The atmosphere is on another level, the game somehow makes even the side quests feel meaningful. Some of them are more engaging than the main story.\n\nI did try it when it first released, but I didn’t really get into it back then. I replayed it recently, after reading a few of Sapkowski’s books and acknowledging all the hype around the universe it definitely hit different this time. The game deserves all the praise it gets for how much it influenced the genre.\n\nThe Witcher 3 comes with three main storylines if you count the DLCs. The base game’s main story left me a bit disappointed by the end, but Hearts of Stone completely stole the show for me — easily my favorite part of the whole experience.\n\nOne thing I really appreciate about this game is the romantic atmosphere it manages to create. It’s not just in the story, but in the combat, the exploration, and the way characters interact with each other. And yeah, I’m team Yen btw =)\n\nIf there’s something that actually annoyed me gameplay-wise, it’s the horse controls. You can’t just calmly look around while riding because the horse keeps turning toward the camera, and there’s no option to disable that in settings. It got me frustrated.\n\nMy personal score would be 8.5/10. It sure deserves 10/10, but my problem is that I went in expecting a perfect masterpiece after hearing about it for so long, also because I played it a decade after the release.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Tried the game multiple times without enjoyment. However after hearing it beloved by other gamers I knew it had to be great (which it is) I tried max difficulty which is the way I recommend anyone to play. What a game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I am reaaaallly taking my time to it and it is always enjoyable coming back to this game, even after I leave it for a good amount of time, can be weeks or months. It's been maybe 2 or 3 years and I haven't even at the middle part of the game. Not even the expansion pack yet.\n\nI enjoy the world and the people in it. I love Geralt and friends. I love exploring the lands, mountain high, ocean low, going in and out of the forest, caverns, secret elven basement. The world map was overwhelming at first (I will never forget the first time I moved to Velen/Novigrad from White Orchard!), but it is scalable and actually not as big as it first seemed. Skellige seas are unnecessarily polluted with question marks but it is still fun. Thank gods for Skellige music.\n\nThe quests are concise, with amazing writing. I think they're not too long or too short. There are some really comedic ones. That's what I love from The Witcher series' writing; there are sprinkles of humour everywhere (Geralt's satire remarks!). Recently I just finished the Now or Never, and Possessions; I think they are several best main quests so far.\n\nHappy to experience The Witcher 3!! Truly worthy of the Best Game title.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A game that immerses and grasps you so good that in the end, after all that's said and done, you are left with a feeling best described by Geralt\n\n\"Wind's howling...\"\n\n10/10 best game ever made. Your choices shape the unveiling world. Excellent replayability. DLCs are possibly the best ever made. \n\nGet it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Wiedźmin 3: Dziki Gon to jeden z tych tytułów, które na długo pozostają w pamięci 🎮✨. To epicka podróż przez mroczny, brutalny i jednocześnie pięknie wykreowany świat, pełen historii, trudnych wyborów i wyrazistych postaci ⚔️🧙♂️. CD Projekt RED stworzył grę, która zachwyca fabułą oraz dbałością o szczegóły – od dialogów, przez animacje, aż po muzykę, która perfekcyjnie buduje klimat 🎶🌌.\n\nNajwiększym atutem gry jest jej narracja 📜: zarówno główny wątek, jak i misje poboczne stoją na niesamowicie wysokim poziomie. Często to właśnie dodatkowe zadania robią największe wrażenie, oferując głębokie, wielowątkowe historie, jakich nie znajdziemy w większości współczesnych RPG-ów 🌟.\n\nŚwiat jest ogromny, żywy i różnorodny – od ponurych bagien Novigradu po dzikie krajobrazy Skellige 🌿🌊. Walka jest dynamiczna, a rozwój postaci pozwala dopasować Geralta do własnego stylu gry ⚔️🔥. Do tego dochodzą dwie świetne kampanie dodatków: Serca z Kamienia oraz Krew i Wino, które same w sobie mogłyby być osobnymi grami 🍷💎.\n\nWiedźmin 3 to absolutny must-play dla każdego fana RPG ❤️🎮. Połączenie fabuły, świata i klimatu tworzy jedną z najlepszych przygód, jakie kiedykolwiek trafiły na rynek. Polecam z całego serca! 🌟",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the best games in its genre. From its story, characters and world, everything comes together to make one of a kind experience. Playing it on deathmarch really brings out what the game has to offer, using potions and signs to carefully learning about the enemies does indeed make you feel like Geralt and living the witcher life. \nThe DLCs arguably provide even better content than the base game, can praise them enough. One of the best open worlds ever crafted.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is awesome, it looks very nice for an old game. One thing that upsets me is that, u cant play as yennefer, or harness the power of chaos/magic.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The only thing that can be said about this game is that it’s one of the best representatives of the RPG genre. You simply must play it if you haven’t done so yet.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Man, this game.\nI played it for the first time years ago on my PS4 and dropped it after a few hours because the combat system was just meh. Always wanted to give it a second try though, I'm not the most patient gamer, more like first impression counts. \nWhen I bought my Steam Deck I thought the time was right for a second try. The SD makes for chill gaming sessions on the sofa and boy is that where this game shines. I could spend hours just wandering around cursing over the stupid annoying flying bitches.\nIt's kinda like Zelda but with a story, and adult targeted. Completely changed my first opinion on it and went through 100+ hrs of playing like it was nothing. It has its flaws, but you get over them and it's a solid gaming experience. And with what it costs nowadays, I can't think of a better deal tbh.\nThe DLCs are absolute musts and they need to be played in the correct order for the best experience and it is: base game up until the final act (you'll know when it's time, don't start the last mission) - Heart of Stone - finish the main game - Blood and Wine\n\nOverall one of the best game ever made",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely gutted that I have finished the game dlcs included! I feel sorry for the next game I will play as it will never satisfy me the way this did - Till The Witcher 4 anyway ;)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Played 28 hours on my pc laptop, then more than 40 hours on my xbox having one of the best game experiences ever. Amazing story, cool game graphics even 10 years after the premiere, and the amazing dedication to slavic mythology - 2137/10 totally recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best story-driven RPGs of the 2010s. While this is the third entry, you can comfortably join the adventures of Geralt of Rivia this late without reading the novels or having played the prior games. The combat can often feel challenging but man is it satisfying to take down a monster after preparing by learning their weaknesses and preparing the suitable counters. Highly recommended for anyone into a good story in a dark world where nearly everyone is merely a shade of grey rather than pure Black or White; and your role in the story is ultimately to maintain the balance.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of, if not the best game I've ever played. It offers a perfect and engaging story throughout the whole game, with a versatile and fast paced gameplay, tons of monsters, great sidequests and more. Also the graphics still hold up perfectly with the Next-Gen update and the use of some mods, only the raytracing is still a little to demanding, but works on my 5070 ti obviously. \r\n\r\nWhat I just said, was only about the main story though, because while the main story is absolutely lovely, the dlc's are just so much better, better and better than an already perfect base game, since the offer an even better story, extendet lore, gameplay and reoccuring characters for book readers/players who played the previous games. And while the environment in the base game is absolutely fascinating, Touissant, in the blood and wine dlc holds a place in my heart as the best and most beautiful video game area ever.\r\n\r\nConcluding I would give the main game an absolute earned 10/10 and the dlcs, which are even better in every aspect there is, a scalebreaking 12/10. \r\n\r\nAbsolute Cinema! |_°o°_|",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Rich story, fun combat system, and so much content between the main quest line, side quests and witcher contracts. This is PEAK single player gameplay and a guaranteed good time for anyone interested in playing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A truly wonderful game.  The world is beautiful, with so much tu explore and almost never feels empty. Side quests are crafted with a lot of love and don't feel like irrelevant and repetitive content dump. An immersive experience like this game is very rare, you can feel the emotions of the characters as you're traversing through the witcher's world.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games of all time hands down \nIncredible music . world design and story \nAnd the dlcs are somehow even better than the base game \nCDPR's finest work imo and a 9.5/10 overall game for me \nHighly recommended",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely fucking AMAZING game!  If you have been CRAVING an RPG to play, THIS is fuckin' IT!  BEAUTIFUL landscapes and views in-game, EXCELLENT cinematic scenes, AWESOME combat system, IMMERSIVE stories and gameplay, INCREDIBLE voice acting, TONS of quests and things to do, MASSIVE world to explore and get lost in...  Just an overall IMMERSIVE and AMAZING game, you will NOT be disappointed.  27 hours in and I'm only running around in Velen still, and there are a BUNCH of places to go and explore further than where I am at.  I know this game is gonna be 100+ hours of fun probably even like 200+ who knows but I'm ADDICTED! <3   ABSOLUTELY RECOMMENDED.  10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The doctor ordered a review. A game that Billy would approve. Geralt is a true specimen of true gachi power.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A truly phenomenal game in every way. The stories are interesting, the characters are fun, and the combat system is exciting, I recommend it to anybody. I'm surprised at just how much there is to this gwent game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Marvelous. Got this game as a gift. Nice story with a lot of options to choose in game, but bloody difficult fighting all these enemies. Takes some finger skills I don't really have, resulting in character dying over and over again, reloading over and over again and finally giving up for a few days. But all in all highly recommended for those of you with lighting reflexes and the hands to follow them.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Probably the best fantasy ARPG have countless hours on xbox and picked it up and decided to get all achievements and enjoy the story once again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☑ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☑ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Ascended\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I only checked now and its a crime I don't have a review for this game,  the first time I played this game was more than a couple of years ago and I absolutely loved it, if there was a time machine or a way to erase memories I would erase this game from my memory just so I could experience it for the first time again. I mean.. fuck... this is the game that started it all, kindled my love to the Witcherverse. I did my first playthrough not even on steam and I rebought this game some time back just to play it all again, it's without question the best game ever made. This game ignited a spark in my soul and birthed a passion in me I never knew existed, from this game I've went to see the show, play the prequels (TW1/TW2) and read the books, and honestly if there was another piece of lore to acquaint I would do so in an instant. I could not recommend enough to dive into this universe if you are a fantasy fan. Sadly the show is quite far from the actual lore but its a cool visual representation to imagine all these characters as real human beings. (Except S4 its absolute dog).\nANYWAYS, I might've strayed from the topic a little, GO PLAY THIS GAME NOW! It's exceptional, this game is a hug on a winter day, a hot soup when its snowing, a soft caressing bed after a long day's work.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An exceptional game. The world feels lived in, the writing is dark and sharp, the characters and stories stay with you long after the credits roll.\n\nOnly the swordplay stumbles a bit. Better play on death march difficulty so you really have to use alchemy and learn monster weaknesses, this improves combat a lot.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty amazed is a understatement. It was always one of those \"can't believe haven't played this yet\" and honestly - when i read when it came out i was floored - being a first time player of a game that was released almost 10 years ago it is incredibly beautiful, story rich, without reaching the DLC content yet. You can tell this was a passion project for many, many individuals. CD Projekt Red games seem to really hit it out of the park.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A masterpiece in every sense. One of the most complex game stories out there with every choice steeped in moral grey, nothing is black and white, and there is rarely such a thing as a truly right choice. The complexity and the writing behind the entire narrative are unmatched. The choices you’re forced to make can feel impossible at times, decisions you can think about for hours, even though you know that none of them may truly be correct and fair in the end. There’s simply no comparison to what they achieved with The Witcher 3. The same can be said about the entire series, though it’s a shame that so many people jumped straight into the third game instead of playing the trilogy in order and experiencing the first two as well.. I wish I had the words to describe these games, but I simply don’t. All the emotions I lived through and the entire journey I experienced within this story are beyond anything I can put into words, it's just an unforgettable experience\n\nSPOILERS ahead:\nSurprisingly, it’s the first time in my life that I’ve naturally reached a \"bad\" ending in a game, the one where Ciri \"dies\" even though we now know that’s not exactly what happens. Unfortunately, with one of the choices at Kaer Morhen, you had no idea there was going to be a snowball fight if you chose \"I know what might lift your spirits\" which didn’t mean getting her drunk at that moment or anything like that. I really dislike how some choices fail to give context about what Geralt will actually do when you choose them, also where I initially thought that joining with Ciri during the Lodge meeting was to offer my support on her side, her point of view, not preventing her from being independent and I didn't wish leaving her alone in the fangs of the sorceress. That said, with The Witcher 4, it’s confirmed that she’s alive, so technically every ending leads to her survival and to taking the path of the Witcher",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I don't know Why I was letting thie game sit in my library for years. Wish I had played it sooner. 66 hours into the game and still haven't proceeded with the main story line. Addicted to GWENT!!! Beating them in Gwent is a feeling I cannot describe. Overall, the game is fantastic and is a must have for anyone who loves story-rich open world games,",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game changed me as a man and as a person, nothing even compares to the feeling you get, when you start playing this game, every play-trough is different and every mission looks new, this game has changed the lifes of many people and i think nothing even compares to this, maybe rdr2 but just by a little percentage.  i played it on the ps4, ps5 and pc now with roundabout 1000 hours. If anybody is struggling in life or has any problems right now, trust me just play this game and you will have tears of joy and you will feel better. I LOVE THIS GAME !!!!!  100/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best game ever made. still thrash all the modern games even though it is nearly made two dacades ago.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games ever and one of my favorites. Almost everything is perfect. The combat is the only thing I felt was a bit lackluster. The soundtrack is great and the extensive maps are perfect for exploration. Visuals are gorgeous. The world is very rich and full of details. The amount and quality of side quests and characters to speak to is plentiful. 10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ziemlich cooles game, habe es mal wieder hervorgeholt, da die 4 Staffel bei Netflix lief",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. It’s visually stunning, and the new next-gen update makes it truly jaw-dropping. The combat and gameplay are awesome, and it features one of the greatest stories in a video game. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I thought the main game was pretty good, but wow the expansions were amazing. Blood and wine was chef's kiss - perfect in every way and Regis, oh sweet Regis is such a treasure ♥",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game with rich story\nmy brain with \"swing swing die\" mentality can't even handle it with how complex the game was, worth to try and learn, didn't regret to bought for single player experience, great stuff!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Going around beating everyone at Gwent is a lot of fun. Oh yeah, and I guess the rest of the game is pretty good too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overwhelmingly positive for good reason. This game has it all. After completing it, I wish I could start all over and make other choices. It isn't a game where you are invincible or have some superhuman comic book powers. In fact, the game play and characters grab your attention because they are human. Even though the cut scenes can be lengthy, I found myself totally interested in the relationships and outcomes of each narrative. Unlike some games that \"taunt you\" into making choices or following a set path, this game is all about you and the characters. Graphics are awesome and the gameplay with controller or mouse is smooth and intentional, not glitchy or buggy in anyway. Truly a joy and pleasure  to  play. FOUR  STARS (or maybe even five).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cant believe waited all this time to play this game! With the next gen update this game is still very playable even in 2025.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved the gme, immersive, great story line and fantastic open world. WIth all the expansions its more than worth the money in this time of corporate greed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a F'ing masterpiece. The storytelling, World, Characters, side quests and Gwent, everything is perfect. I cannot get over it's BGM. It makes you feel like you are playing a movie. \r\n\r\nGOATED!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing it off and on for a couple years, but that's just my own tendency to play long story games in bites. The gameplay is engaging and the story is compelling! Definitely get this if you find it on sale, and I'm excited for the 4th game to come out soon :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really incredible game so far 10/10\n\nI only got into it because I loved Cyberpunk.. had been putting this one off forever because I always had Skyrim to go back to. If you love Lord of the Rings or Skyrim and don't mind playing as some set character with all these powers, slashing your sword at wolves, etc then this game is for you. \n\nIt's a lot like Red Dead Redemption in some ways, but also has character building perks like Farcry along with i assume different weaponry you can unlock, etc etc. It's pretty fun, has fun monsters to kill, interesting as hell. \n\nDefinitely get this on sale along with the DLC due to it being such an old game. You really don't need to play the first 2 but you might want to watch a recap of what happens if you never plan on playing them to have more knowledge of wtf they're talking about at certain points. \n\nAmazing game. I definitely wouldn't say it's THE BEST game of all time as I'm a huge Fallout nerd but, it is definitely worth checking out when you have a few hours to kill. Very movie-esque, but then it's fun and you can explore, etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you’re into medieval themes, The Witcher 3: Wild Hunt is an absolute dream. The world feels rich, gritty, and alive — from the villages and forests to the castles and battlefields. It completely pulled me into its medieval atmosphere in a way few games ever have.\r\n\r\nOn top of that, the game is on sale, which makes it an incredible deal considering how massive, polished, and story-rich it is. You’re basically getting a top-tier RPG experience for the price of a meal.\r\n\r\nHighly recommended. A true masterpiece, especially for medieval fantasy lovers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Witcher 3, along with the Witcher games are Must Play classic games. Witcher 3 maybe one of the best, if not the best game of all time....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game OAT. Peak characters, Peak graphics, Peak story, Peak art, Peak gameplay, Peak design, Peak audio, Peak fighting, Peak open world, Peak difficulty's. PEAK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "probably one of the best games i have played in a long time and ive enjoyed it so much to now buy it on steam and play it on PC. love the story and all the characters, the immersion into the world of the Witcher feels amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game doesn't baby you, everything about it is so intentional and has good physical feedback. The combat doesn't have ridiculous parry timing nor cartoony attack indicators. When you dodge an attack it actually feels like you dodged an attack. Also magic and magic women and magic monsters and magic women and magic women.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is such an underrated gem that im surprised nobody knows about. its amazing what a single dev can create when they put their mind to it. This is the biggest grassroots beginnings i have ever seen and I hope the dev can finally get some recognition at some point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story and gameplay. It's a classic. No need to blabber on about how good it is; it's a great game, I love it, you might too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game! Lots to do and still looks amazing 10 years later, finished the game first time years ago and now starting a new playthrough to run it with RT and amazing graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Geralt is up there with Arthur Morgan as the best protagonists in gaming history. It's worth playing alone for the dialogue and story. Combat is kind of frustrating, but every other aspect makes up for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very boring, clunky, and too easy...but that changed since I played on Death March (yall should play with that).\n\n\nEven tho the story is kinda overrated exc. that Baron side quest and two expansions which has more better story than the base game.\n\nAlso...the game is easy and hella moddable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.  Some say its the best game ever.  I can now understand that statement.  Great story with fun gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "chơi đc 15 tiếng chưa biết hay chỗ nào mà vẫn chơi tiếp.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ABSOLUTELY LOVED IT 100% WORTH FOR THE PRICE OF ONLY 500 Rs IT IS STEAL OF THE YEAR FOR THE GOTY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No need for a review, the title speak for itself. With that being said, the game superb on every aspect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best card came ever made, the monster hunting and dating sim mini games are pretty good to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played it a lottttt and just now deciding to really go ham on all the side quests, there are so many little nuggets of story all over the world in here it's so fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, just one problem so far, the game crashes EVERY time when i even go near fyke isle, i know it isnt performance problems, i run the game fine with my current settings. beside that tho great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I play this game My ages ware 12 now I play this game in PC this game have wonderful story in game and in books about game play I don't think you are thinking that it is getting more attractive every second",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the peak there is nothing better the dialogue is amazing it really feels like Geralt is talking to a real person behind the screen the quests arent unnecessarily stretched out which makes the game incredibly fun to play The story is so engaging that I finished it twice along with the expansions Getting the trophy for all achievements is fun too i hope a game like this will be made again someday",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A bit old, but the graphics are still so good, as is the story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Epic and life changing. The story alone is worth the play through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "personally I think this is one of the best rpg game story wise and the combat may not be too flashy but It certainly is still well made the dodge,parry etc. No need to play the previous witcher games to catch up to the story imo you can just jump right in",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story, great combat, great everything!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great storyline, decent gameplay, nice graphics, interesting side quests. Overall a must play for everyone who loves story-rich RPG and medieval fantasy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great story and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game a lottt of content and definitely worth the money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing story, visuals, and, of course, the best minigame I've come across in a video game: Gwent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I failed to complete this game 10 years ago. Got distracted by other games on Xbox, then ultimately built a PC and delayed coming back to it because I didn't want to restart. Few years ago, I was inspired to mod it with the Halk Hogan 4K texture packs, and really enjoyed it but got distracted again around lvl 10. FINALLY, reinspired to come back, and man am I glad I did. This game is just so good. Story telling is good, all the gear/potions/character ability progression is well-balanced and well-layered without being over complicated or underwhelming. The remaster fixes the need to mod the game, and gives it a modern recoat of paint which makes it look amazing and play amazing. I am only lvl 22 with so much more of the game to play, but can't wait to clear it all. If there's no update... alas I may have gotten distracted again. Here's to the path.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RDR2 has been my absolute favorite game since it came out, This game is so reminicent of the rich storyline of RDR2 and the Massive map size and scale of Elder Scrolls online giving the player the best of both worlds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Maybe the best RPG ever made, definitely in the top 25 video games ever made, holds up today like it is new. It's a book you can play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Witcher 3: Wild Hunt is the best RPG I’ve ever played and i have played a lot and a huge part of that comes from how alive its world feels. The game’s world isn’t just big it’s rich, layered, and filled with stories everywhere you turn. From the war-torn fields of Velen to the bustling streets of Novigrad and the windswept cliffs of Skellige, every region feels like it has its own history, culture, and problems. Nothing feels copy-pasted or empty; even wandering off the main roads leads to moments that feel hand-crafted.\r\n\r\nThe storytelling is just as impressive. The main story—Geralt’s search for Ciri—feels urgent and emotional, but what surprised me most is how strong the side quests are. Many of them could be full stories in other games. A simple contract to hunt a monster often unfolds into moral dilemmas, human tragedy, or unexpected twists. The Bloody Baron questline alone is better written than many entire RPGs.\r\n\r\nEvery character you meet feels believable, even if they only appear for a few minutes. Choices actually matter too—not in a flashy, obvious way, but in quiet consequences that show up hours later. It makes the world feel reactive, like it remembers what you did.\r\n\r\nWhat makes The Witcher 3 so special to me is how all of these pieces worldbuilding, storytelling, exploration, and characters come together so naturally. It’s an RPG where you don’t just play a character; you inhabit a world that feels full of life and history.\r\n\r\nFor me, it’s an unforgettable experience, and easily the best RPG I’ve ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic story and world, fun combat system and consistently exceptional side-quests.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very epic game and considering its release year, its story is amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's one of the best games I've played but be prepared to put aside anything you're doing cause this game is LONG.\nStill awesome though, easily worth the 10$ with all DLC's",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the top 5 video games I've played all-time however the combat mechs on 'blood and bones' mode feels laggy at best and you find yourself needing to pre-emptively time your movements to stay in the fight. Health management does not seem on par as I find myself eating endless loads of food only to have minimal health restored. If you dont mind dying 500 times over and over and over and starting back over from a recent 'save' then you will love this game. If you have no patience, do not even bother picking this one up at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only have around 20 hours so far, but this game is one of the best story games I have ever played. I am only 20 hours in and I can tell that this game is going to usurp RDR2 as my favorite story in a video game.\r\n\r\nI also want to shoutout the Censor mod on Nexus. I would not have picked this game up without it. The mod lets you censor out the nudity and gore from the game to help create a \"cleaner\" experience. Most people I have seen on forums find this extremely cringey since the game is trying to reach an adult audience, but some people are sensitive to sexual explicit material. whether that be a religious conviction, sexual addiction, etc. Look up the mod's description to see what it covers and doesn't cover.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I completed the game on gog. I bought it again on Steam to give more money to the developer.\n\nJust buy it if you still do not have this masterpiece in your library.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy the storytelling, the characters, and the look of this game. Its close tp perfect in what I look for in an RPG.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Story may be great, some fights are really nice. But 90% of the time you are doing boring stuff. Gathering things to combine, mix, sell them or whatever.  Walk/ride from A to B and back.That's not my type of game. It feels more like a riding/walking/trading simulator.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "It's hardly ever mentioned how terrible the menus, invasive tutorials and combat gameplay actually are. Gamebreakingly terrible. It's not a question of age as I found the menu and hidden text one needed to progress in quests to be game breaking 10 years ago. It's disappointing as the voice acting and visuals are of superior quality and I know I'm missing out to a degree.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Atrocious combat mechanics, clunky movement, long boring dialogues, and uninteresting characters. Easily the most overrated game in history with lots of drawbacks. The RPG leveling elements are also weak and meaningless. I've given it multiple fair shots for the last decade due to the \"praise\" it gets, and every time it falls short due to how horribly designed the aforementioned factors are. It fails to captivate and impress in too many aspects. When over 70% of a game is revolved around the combat system and RPG elements, then they should design those systems to be high quality. If you want to be put to sleep with boring dialogue, or if you don't mind atrocious combat with clunky movement during exploration, then this is for you.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "it looks okay but i just couldn't get into the game. way too complicated. everything is way too dark. I keep getting stuck in places and not being able to find my way out. maybe i don't play enough but again, I just want somethin that I can hop on every few days and hack and slash and go on about my life. This game almost forces you to get too into itself and I'm just not into it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For a game that requires you to explore a vast open world setting on horseback, it has terrible riding mechanics. Roach is extremely clunky, the auto-pathing is a joke and the general feel you get from your your horse makes you want to explore on foot. The horse should be a companion and a reliable method of transport, but most of the times the mechanics make exploration unbearable. I haven't played the game long enough to judge its other aspects, but I got the feeling that its clunky feel carry on to most of the game's core gameplay components.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its a no for me. I don't normally have an issue with getting a game to launch. however the amount of effort I had to go to just to get this game to launch left a bad taste in my mouth. I followed a number of guides here on steam regarding known issues for launching problems. 30 minutes of time in this was just to get it running without crashing to desktop, crashing my entire system or refusing to launch. When I got it going its undeniably pretty to look at but so are many games, which are more recent and have far less effort than this. Given the games age I would have thought it would have any problems ironed out. Gameplay I have no idea, refunded.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A Masterpiece... Unless You're Here Just for the Story\r\n\r\nI wanted to experience the critically acclaimed story, explore the beautiful world, and enjoy the visual graphic enhancements provided by the latest update. I intended for this to be a narrative-focused playthrough. To ensure this, I chose the 'Just the Story' (Easy) difficulty because I wanted a pure, low-stress, narrative and exploration experience.\r\n\r\nHowever, the game's core design means the combat remains overly punitive and frustrating. Even with the enemy level scaling option enabled, you often encounter much more powerful foes, forcing you to waste significant time in tedious fights and constantly repeating them after dying, failing to deliver the relaxed, story-focused experience promised by the 'Easy' mode.\r\n\r\nEven on Easy, fights remain technically demanding. I found myself spending excessive time focusing on mechanics—preparing oils, signs, and decoctions—rather than enjoying the story. This felt more like a \"preparation simulator\" than a relaxed adventure.\r\n\r\nThe high time cost of dying and reloading after frustrating, technical encounters completely broke the immersive, relaxed narrative experience I sought.\r\n\r\nIf you love highly technical, frequent combat, this game is for you. If you are seeking a purely narrative-focused RPG on the easiest difficulty, be warned: the combat remains demanding enough to pull you out of the story that you came for.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I cant play this game now with out accepting a new EULA. I have had this game for many years. This is not acceptable",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fights mechanic is ludicrous and bosses are insanly strong, makes you waste days until you managed to beat them. Besides, most of the times you are just watching a movie, solving the so called puzzels being the same.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "terrible visuals on my humble 1060ti, where is the sharpness my goodness, and first time I load into the game, I got bit on my thing with a lobster by a women with her ass open? is that an intro my guy... then they all get killed by a skeleton god, then I wake up with an old guy and fight ghouls with button smasher combat at expert level (bone and sword?), it is absolute bongers, don't buy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes immediately upon launch. Developer requests files I'm unable to find to simply submit a support ticket. Requires a second launch program instead of directly launching from Steam. 0/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Holy shit the combat system is a disaster. I tried to like this game but fuck the controls. Also it's boring asf so I'm not sure how people are glazing this game. 9/10 world tho",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Awful launcher prevents the game from launching fast and reliable, disables mods despite reverting the game to the classic version. Absolute garbage, way to ruin a really great game by overreaching and messing with files of the game on people's computers after the fact.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I tried the game 10 years later and there still aren't mods to properly solve the janky, clunky, slow movement, along with combat.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't like the fantasy world and the movement of the character. The game is not for me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Such a crappy game. There wasn't a minute of the gameplay that was enjoyable. Clunky controls, aweful story just an ugly game. Shame that it exists.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "buggy, unresponsive garbage.\r\n\r\none of the worst sword based combat systems i have ever encountered, inputs just do not go through and there is literally no skill in the game beyond mash dodge or attack till the enemy is dead. that is as long as the unresponsive controls dont just eat your inputs and actually do the commands you want instead of you having to spam the command inout 5/6 times for the game to do the animation once.\r\n\r\nif its on sale for $1 then i would say that this port is worth it otherwise its just going to piss you off when you are fighting the games total lack of responsiveness to be able to even play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's basically a walking/riding simulator and a harrowing lore chat simulator. The interface and crafting system are quite annoying for PC considering it's a standard console port.\nNot to mention the gameplay and leveling system, enemies level up with you, taking away any satisfaction from leveling up and choosing equipment and character builds.\nThe crafting system has tons of items to craft, but thanks to the poor interface, you're left with a mess of items to craft and the items you need to craft them. There's no decent interface or filtering option, so you either play it so much that you know all the recipes by heart, or, like me, you lose your nerve.\n\nSpeaking of quests, I had the feeling that many were designed to drag things out. In fact, after the first couple of hours of playing, I found myself skipping all the conversations because they became very boring after a while. Not to mention that many of the main story quests are pointless, nested quests just to drag out the gameplay.\n\nAnother thing that really bothered me was that leveling is based almost exclusively on completed quests. So, if you're a level 1 character and bust your ass defeating a much higher-level monster, the amount of XP you receive is laughable. Given that, basically, to level up, you're forced to do quests, and the free roaming this game claims to offer is a complete no-brainer.\n\nTo sum things up, if you're more interested in quality gameplay and freedom of action, like me, this game isn't for you. If you enjoy spending hours listening to lore-friendly conversations and admiring landscapes while moving from one place to another just  to complete another quest, this is perfect.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have no idea why this game gets such rave reviews.\n\nAfter nearly 40 hours, nothing in this game has managed to hook me.  The story is boring, the side quests are boring, the combat is incredibly boring, the main character is also beyond boring.\n\nTypically, RPG's like these have no troubles pulling me in, with countless hours spent on and off Steam versions in nearly every single player RPG since, happy to be immersed in whatever world of swords and spells the next guy churns out.\n\nHowever, this one just fell flat for some reason.  I might give it another go one day, but I don't get the hype.  Even Fallout 4 was a better RPG.\n\nI tried to like it.  I really wanted to like this.  I just don't.\n\nIts like trying to play a B-movie.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I don't recommend this game, unless you want the customer \"support\" to demand you not mod in order to get troubleshooting help beyond the basics. If they can't help find the issue with missing quest items, they will blame it on the mods. If you refuse not to mod, even if the mod is not the cause of the missing quest items, they will refuse to help any further.\r\n\r\nFortunately, this game was on sale. Unfortunately, my experience with the game and \"support\" has not been much better than the support gotten when scammers want your info. Don't buy this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The combat feels unsatisfying, fights turn into button-mashing rather than something skillful or satisfying. On top of that, the game drowns you in endless dialogue and cutscenes. Every simple task turns into a long conversation, which kills any sense of momentum or excitement.\r\n\r\nIf you love slow-burn stories and constant talking, this might work for you. But if you’re looking for sharp gameplay and a better balance between action and dialogue, The Witcher 3 quickly becomes more tedious than fun.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've played at least 15 hours of this not on steam and its actually such a mid game fr no cap. \n\nThe combat is so bland and with terrible moves and mechanics and poor enemy variety and mechanics. You can stuck in the terrain sometimes as well and it all feels very much like trying to catch a fistful of water. Imprecise and shoddy. Nothing on Dark Souls for example. It is better than Witcher 2 I guess but then again most games are.\n\nThe writing is tepid with an incredibly boring intro and mainly fetch quests with no interesting set pieces or in depth intrigue. Consider in Witcher 2 the opening where you are helping lead an assault on a castle with a pompous king at your side who you then see slaugthered whilst here you run around the inn and village doing naught but asking for directions. It doesn't get much better and the side quests are just kill something and oh some slight moral ambivalence or sad sack story. That is often what you get with open world games, lot's of mediocre padding and endless horse riding through scenery.\n\nThe rpg levelling system is fine, nothing to write home about. No stats or such just leveling mundane skills that you can only choose a few from.\n\nI played the game heavily modded as well, I can only imagine how utter goose shite the base game is. For all the faults of the second, at least I enjoyed the narrative and choice and genuine intrigue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Overrated asf. Have tried to play this like 6 times on PC and PS5 and drop it in under 5 hours every time. The combat sucks and the game is boring. Don't get all the hype. Not for me I guess.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game features women's behinds both on the Steam store page and in game, which is strictly forbidden according to Valve. I can't believe they would have such a sexual game featuring women in the Steam store, I'm literally shaking and crying right now. How could CD Projekt Red make such a lewd game with fully clothed women and their backsides in the Store Page videos!?! Unbelievable and totally inappropriate!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Might be the worst gameplay i've ever experienced in any action rpg ever. The story and lore is good but it plays like im a grandma with aids.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "combat? genuinely atrocious \r\nexploration? boring and empty\r\nstory? good. but absolutely not worth pushing through this bug ridden nightmare. \r\n1/10 and the one point is for the funny moans people make when you run into them\r\ntldr? play witcher 2",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Horribly overrated crap, horrible clunky UI, terrible main character animations, felt like I'm controlling a wood stick instead of a human. Combat is all the same, roll slash roll again, repeat! Voice acting is all over the place.\nFull of woke propaganda, lesbians eveywhere, but this is what gooners wants, so they now make a lesbian a main character of TW4. That is fine, you won't see them crying about, unless it would be two men that is, then they would cry me a river and ask for their mommy :(  Poor little boys, pretending to be a strong men.\n\nTruth hurts, thanks for the points.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Where is the game in this movie?\n\nYou wander around as the Gaylord of Rivia and press X to advance shitty dialoge you don't give the slightest shit about. Thats 95% of it - the other 5% are clunky combat.\n\nI played a 2 hours on Xbox a few years back, decided to give it another shot with a Steam sale, but I can't bring myself to play this drivel...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Crashing a ridiculous amount. Wil change if they improve stability",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It is simply OK - not the greatest game of all time as many seem to believe. I bought it on GOG on its original release  in 2015 (also later on Steam when cheap as wanted the achievements) and the game at launch was buggy and a clear visual downgrade from their promotional gameplay trailers. Yet CDPR never got the grief Ubisoft got for the release of the original Watch Dogs. I followed this (at the time) small Polish developer from the time leading up to the release of the first Witcher game, which I liked a lot (at the time). I used to have a lot of respect for them as a company, but I think they subsequently started believing their own hype, partly because they were never really held to account by their fanbase. \n\n\nFortunately, this willingness to overlook glaring issues (which other developers would be crucified for) changed somewhat with the release of Cyberpunk 2077, but even now you see that launch disaster being excused by their fans - the bugginess was one thing, but trying to mislead people not to cancel their pre-orders by deliberately obscuring the terrible state of the game on base consoles was another thing entirely - from the company that apparently 'leaves greed to others'.  I have around 200 hours in the Witcher 3 and so certainly got my money's worth, but not once have I ever been tempted to reinstall it and play it again. It's fine, but frankly I find it a little bit boring - gameplay has never been their strong suit. I have decided CDPR games are not really for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "prawdopodobnie jedna z najgorszych gier w historii, nie mam zielonego pojecia jakim cudem ludzie dobrowolnie poddaja sie tej grze",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit game where the mc who is gay makes ballerina dance when he attacks.\n0/10 would not play again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "miesista walka i ladne baby, wszystko czego potrzeba w POLSKIEJ GRZE :D",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a piece of shit. \n\nI bought it on sale for 6.99, so I can't complain too much.\n\nThe controls are terrible - anything from moving to running, swimming or riding. I've not seen anything this bad in ages, since A.C, perhaps.\n\nTravelling is a pain in the ass.\n\nQuesting is also horrible - I have no idea of where I'm supposed to go. I've had to google it, I found out I'm supposed to go do 3 \"optional\" quests in order to find/save the Blood Baron's wife (Anna). Only problem is that although I know what the quests are called (now, after googling), I have no idea of how to get them. One of them is supposed to be in a place called micapse or something. I have no idea of where that is and how to get there, I'm not seeing it at the fast travel points. \n\nThere's been 0 effort put in here for UI/UX.\n\nFuck this developer and fuck this game. Yeah, I feel like I got scammed. I'm not going to ask for a refund, although I probably should. I'll just make sure to never buy another one of their games. What a stinking piece of shit.\n\nReally good music/sounds, but everything else is shit. Oh, and whoever thought NPC collision is a cool thing: fuck you too.\n\nThis thing is at best alpha-level - quality-wise. Would definitely not recommend it to anyone. The story seems good (so far), but I'll never get to find out what happens next, simply because this shit is unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I hope i will not be hated too much for this review but in all honesty i found this game extremely boring and predictable in the narrative. The gameplay combat wise is way too simple while being over complicated for what concerns crafting, perks, and use of the consumables, may be the controls, or the quite uncomfortable menus interface, i don't know, i just feel i need a manual to figure out if i've crafted a potion or something else, if it's applied, if i have to craft it again or what.\nI really wanted to like the game and i managed to reach the end once, sadly, love never bloomed, every time i fire it up giving it, and myself, another chance, it feels like a chore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played game 3h, can't save progress, \r\nstucked on horse -can't get of, \r\nKilled cyclops- loot under map spawned.\r\nWhy so many bugs still in game?\r\nStory 7/10\r\nWorld 9/10\r\nGlitches  5/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't even manage to kill drowners, game combat makes zero sense. You are supposed to be a fast agile witcher yet every light attack takes a full 2 seconds and you do a 360 every attack. You cannot block or parry vs monsters only dodge. Worthless combat design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game wont launch all of a sudden, wtf, refund me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really janky and sorry but Im gonna be honest kinda overrated",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Good game but too much talking, not enough doing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I always start it, never play it. Should tell you something about it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worked Smoothly when installed, now runs like dogshit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Controls are way too clunky on pc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cel mai overhyped joc impreuna cu Red Dead Redepmtionul pizdii.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game wont launch anymore",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "GOofy ahh walking and run animations",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is not a true RPG i feel mislead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The best RPG you've ever played if you're a dad who hasn't had pussy since the Gulf War",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mid and overrated.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "самое каловое управление и механика евер.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring and overated",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Extremely bad combat system.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "overrated",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "AI slop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "booooooooooooooooooooooooooooooooooooooooooooooooooriiiiiiiiiiiiiiiiiiiingggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hmmmmmm",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "awful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried really hard to get into it. Truly. I absolutely love the story, magic system, worldbuilding, and the characters. Loved the show (up until they effed it up). The music, everything. \r\n\r\nBut as a game? After getting bored then coming back and restarting my playthrough 4 times, I think it's overrated/overhyped and mind-numbingly.. boring. I'm SORRY. \r\n\r\nOne of my biggest issues with the game is the user interface/character menu (mainly the inventory). The way all the items are categorized is confusing. And as someone who enjoys collecting things in games, there are simply too too many items and the game gives no indication of what you should take or leave. So my first playthrough I took nothing, and my second time I downloaded a mod to bypass the weight limit so I could take things freely. I can't even tell you which one is the better choice, or when it mattered or not, because I never got far enough in the game to make that judgement. The farthest I've gone is finding Yennefer.\r\n\r\nTraveling is so annoying, even with a horse. Geralt moves way too fast, he's basically always sprinting. You have to look at the map every few seconds to know where you're going, and the map isn’t that nice either.\r\n\r\nThe combat absolutely sucks, it's not enjoyable. You can't even blame skill level because even if you have perfect timing it just feels *bad*.\r\n\r\nThe game is so complex and at the same time not compelling at all.\r\n\r\nAnd that's not to say that you need a lot of patience for this game. You do, but as someone who has spent hundreds of hours on a single game before, it's not a patience issue, it's a BORING issue.\r\n\r\nThe game does look beautiful, it has that going for it. I took a crazy amount of screenshots. And that’s one of the things that made me try it over and over.\r\n\r\nBut generally speaking, I do not recommend this game. I especially don't recommend it to anyone who is playing an open world game for the first time because it'll ruin your opinion of the genre.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Story may be great, some fights are really nice. But 90% of the time you are doing boring stuff. Gathering things to combine, mix, sell them or whatever.  Walk/ride from A to B and back.That's not my type of game. It feels more like a riding/walking/trading simulator.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "It's hardly ever mentioned how terrible the menus, invasive tutorials and combat gameplay actually are. Gamebreakingly terrible. It's not a question of age as I found the menu and hidden text one needed to progress in quests to be game breaking 10 years ago. It's disappointing as the voice acting and visuals are of superior quality and I know I'm missing out to a degree.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Atrocious combat mechanics, clunky movement, long boring dialogues, and uninteresting characters. Easily the most overrated game in history with lots of drawbacks. The RPG leveling elements are also weak and meaningless. I've given it multiple fair shots for the last decade due to the \"praise\" it gets, and every time it falls short due to how horribly designed the aforementioned factors are. It fails to captivate and impress in too many aspects. When over 70% of a game is revolved around the combat system and RPG elements, then they should design those systems to be high quality. If you want to be put to sleep with boring dialogue, or if you don't mind atrocious combat with clunky movement during exploration, then this is for you.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "it looks okay but i just couldn't get into the game. way too complicated. everything is way too dark. I keep getting stuck in places and not being able to find my way out. maybe i don't play enough but again, I just want somethin that I can hop on every few days and hack and slash and go on about my life. This game almost forces you to get too into itself and I'm just not into it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For a game that requires you to explore a vast open world setting on horseback, it has terrible riding mechanics. Roach is extremely clunky, the auto-pathing is a joke and the general feel you get from your your horse makes you want to explore on foot. The horse should be a companion and a reliable method of transport, but most of the times the mechanics make exploration unbearable. I haven't played the game long enough to judge its other aspects, but I got the feeling that its clunky feel carry on to most of the game's core gameplay components.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its a no for me. I don't normally have an issue with getting a game to launch. however the amount of effort I had to go to just to get this game to launch left a bad taste in my mouth. I followed a number of guides here on steam regarding known issues for launching problems. 30 minutes of time in this was just to get it running without crashing to desktop, crashing my entire system or refusing to launch. When I got it going its undeniably pretty to look at but so are many games, which are more recent and have far less effort than this. Given the games age I would have thought it would have any problems ironed out. Gameplay I have no idea, refunded.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A Masterpiece... Unless You're Here Just for the Story\r\n\r\nI wanted to experience the critically acclaimed story, explore the beautiful world, and enjoy the visual graphic enhancements provided by the latest update. I intended for this to be a narrative-focused playthrough. To ensure this, I chose the 'Just the Story' (Easy) difficulty because I wanted a pure, low-stress, narrative and exploration experience.\r\n\r\nHowever, the game's core design means the combat remains overly punitive and frustrating. Even with the enemy level scaling option enabled, you often encounter much more powerful foes, forcing you to waste significant time in tedious fights and constantly repeating them after dying, failing to deliver the relaxed, story-focused experience promised by the 'Easy' mode.\r\n\r\nEven on Easy, fights remain technically demanding. I found myself spending excessive time focusing on mechanics—preparing oils, signs, and decoctions—rather than enjoying the story. This felt more like a \"preparation simulator\" than a relaxed adventure.\r\n\r\nThe high time cost of dying and reloading after frustrating, technical encounters completely broke the immersive, relaxed narrative experience I sought.\r\n\r\nIf you love highly technical, frequent combat, this game is for you. If you are seeking a purely narrative-focused RPG on the easiest difficulty, be warned: the combat remains demanding enough to pull you out of the story that you came for.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I cant play this game now with out accepting a new EULA. I have had this game for many years. This is not acceptable",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fights mechanic is ludicrous and bosses are insanly strong, makes you waste days until you managed to beat them. Besides, most of the times you are just watching a movie, solving the so called puzzels being the same.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "terrible visuals on my humble 1060ti, where is the sharpness my goodness, and first time I load into the game, I got bit on my thing with a lobster by a women with her ass open? is that an intro my guy... then they all get killed by a skeleton god, then I wake up with an old guy and fight ghouls with button smasher combat at expert level (bone and sword?), it is absolute bongers, don't buy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes immediately upon launch. Developer requests files I'm unable to find to simply submit a support ticket. Requires a second launch program instead of directly launching from Steam. 0/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Holy shit the combat system is a disaster. I tried to like this game but fuck the controls. Also it's boring asf so I'm not sure how people are glazing this game. 9/10 world tho",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Awful launcher prevents the game from launching fast and reliable, disables mods despite reverting the game to the classic version. Absolute garbage, way to ruin a really great game by overreaching and messing with files of the game on people's computers after the fact.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's basically a walking/riding simulator and a harrowing lore chat simulator. The interface and crafting system are quite annoying for PC considering it's a standard console port.\nNot to mention the gameplay and leveling system, enemies level up with you, taking away any satisfaction from leveling up and choosing equipment and character builds.\nThe crafting system has tons of items to craft, but thanks to the poor interface, you're left with a mess of items to craft and the items you need to craft them. There's no decent interface or filtering option, so you either play it so much that you know all the recipes by heart, or, like me, you lose your nerve.\n\nSpeaking of quests, I had the feeling that many were designed to drag things out. In fact, after the first couple of hours of playing, I found myself skipping all the conversations because they became very boring after a while. Not to mention that many of the main story quests are pointless, nested quests just to drag out the gameplay.\n\nAnother thing that really bothered me was that leveling is based almost exclusively on completed quests. So, if you're a level 1 character and bust your ass defeating a much higher-level monster, the amount of XP you receive is laughable. Given that, basically, to level up, you're forced to do quests, and the free roaming this game claims to offer is a complete no-brainer.\n\nTo sum things up, if you're more interested in quality gameplay and freedom of action, like me, this game isn't for you. If you enjoy spending hours listening to lore-friendly conversations and admiring landscapes while moving from one place to another just  to complete another quest, this is perfect.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I tried the game 10 years later and there still aren't mods to properly solve the janky, clunky, slow movement, along with combat.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't like the fantasy world and the movement of the character. The game is not for me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Such a crappy game. There wasn't a minute of the gameplay that was enjoyable. Clunky controls, aweful story just an ugly game. Shame that it exists.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "buggy, unresponsive garbage.\r\n\r\none of the worst sword based combat systems i have ever encountered, inputs just do not go through and there is literally no skill in the game beyond mash dodge or attack till the enemy is dead. that is as long as the unresponsive controls dont just eat your inputs and actually do the commands you want instead of you having to spam the command inout 5/6 times for the game to do the animation once.\r\n\r\nif its on sale for $1 then i would say that this port is worth it otherwise its just going to piss you off when you are fighting the games total lack of responsiveness to be able to even play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's basically a walking/riding simulator and a harrowing lore chat simulator. The interface and crafting system are quite annoying for PC considering it's a standard console port.\nNot to mention the gameplay and leveling system, enemies level up with you, taking away any satisfaction from leveling up and choosing equipment and character builds.\nThe crafting system has tons of items to craft, but thanks to the poor interface, you're left with a mess of items to craft and the items you need to craft them. There's no decent interface or filtering option, so you either play it so much that you know all the recipes by heart, or, like me, you lose your nerve.\n\nSpeaking of quests, I had the feeling that many were designed to drag things out. In fact, after the first couple of hours of playing, I found myself skipping all the conversations because they became very boring after a while. Not to mention that many of the main story quests are pointless, nested quests just to drag out the gameplay.\n\nAnother thing that really bothered me was that leveling is based almost exclusively on completed quests. So, if you're a level 1 character and bust your ass defeating a much higher-level monster, the amount of XP you receive is laughable. Given that, basically, to level up, you're forced to do quests, and the free roaming this game claims to offer is a complete no-brainer.\n\nTo sum things up, if you're more interested in quality gameplay and freedom of action, like me, this game isn't for you. If you enjoy spending hours listening to lore-friendly conversations and admiring landscapes while moving from one place to another just  to complete another quest, this is perfect.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have no idea why this game gets such rave reviews.\n\nAfter nearly 40 hours, nothing in this game has managed to hook me.  The story is boring, the side quests are boring, the combat is incredibly boring, the main character is also beyond boring.\n\nTypically, RPG's like these have no troubles pulling me in, with countless hours spent on and off Steam versions in nearly every single player RPG since, happy to be immersed in whatever world of swords and spells the next guy churns out.\n\nHowever, this one just fell flat for some reason.  I might give it another go one day, but I don't get the hype.  Even Fallout 4 was a better RPG.\n\nI tried to like it.  I really wanted to like this.  I just don't.\n\nIts like trying to play a B-movie.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I don't recommend this game, unless you want the customer \"support\" to demand you not mod in order to get troubleshooting help beyond the basics. If they can't help find the issue with missing quest items, they will blame it on the mods. If you refuse not to mod, even if the mod is not the cause of the missing quest items, they will refuse to help any further.\r\n\r\nFortunately, this game was on sale. Unfortunately, my experience with the game and \"support\" has not been much better than the support gotten when scammers want your info. Don't buy this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The combat feels unsatisfying, fights turn into button-mashing rather than something skillful or satisfying. On top of that, the game drowns you in endless dialogue and cutscenes. Every simple task turns into a long conversation, which kills any sense of momentum or excitement.\r\n\r\nIf you love slow-burn stories and constant talking, this might work for you. But if you’re looking for sharp gameplay and a better balance between action and dialogue, The Witcher 3 quickly becomes more tedious than fun.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've played at least 15 hours of this not on steam and its actually such a mid game fr no cap. \n\nThe combat is so bland and with terrible moves and mechanics and poor enemy variety and mechanics. You can stuck in the terrain sometimes as well and it all feels very much like trying to catch a fistful of water. Imprecise and shoddy. Nothing on Dark Souls for example. It is better than Witcher 2 I guess but then again most games are.\n\nThe writing is tepid with an incredibly boring intro and mainly fetch quests with no interesting set pieces or in depth intrigue. Consider in Witcher 2 the opening where you are helping lead an assault on a castle with a pompous king at your side who you then see slaugthered whilst here you run around the inn and village doing naught but asking for directions. It doesn't get much better and the side quests are just kill something and oh some slight moral ambivalence or sad sack story. That is often what you get with open world games, lot's of mediocre padding and endless horse riding through scenery.\n\nThe rpg levelling system is fine, nothing to write home about. No stats or such just leveling mundane skills that you can only choose a few from.\n\nI played the game heavily modded as well, I can only imagine how utter goose shite the base game is. For all the faults of the second, at least I enjoyed the narrative and choice and genuine intrigue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Overrated asf. Have tried to play this like 6 times on PC and PS5 and drop it in under 5 hours every time. The combat sucks and the game is boring. Don't get all the hype. Not for me I guess.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game features women's behinds both on the Steam store page and in game, which is strictly forbidden according to Valve. I can't believe they would have such a sexual game featuring women in the Steam store, I'm literally shaking and crying right now. How could CD Projekt Red make such a lewd game with fully clothed women and their backsides in the Store Page videos!?! Unbelievable and totally inappropriate!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Might be the worst gameplay i've ever experienced in any action rpg ever. The story and lore is good but it plays like im a grandma with aids.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "combat? genuinely atrocious \r\nexploration? boring and empty\r\nstory? good. but absolutely not worth pushing through this bug ridden nightmare. \r\n1/10 and the one point is for the funny moans people make when you run into them\r\ntldr? play witcher 2",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Horribly overrated crap, horrible clunky UI, terrible main character animations, felt like I'm controlling a wood stick instead of a human. Combat is all the same, roll slash roll again, repeat! Voice acting is all over the place.\nFull of woke propaganda, lesbians eveywhere, but this is what gooners wants, so they now make a lesbian a main character of TW4. That is fine, you won't see them crying about, unless it would be two men that is, then they would cry me a river and ask for their mommy :(  Poor little boys, pretending to be a strong men.\n\nTruth hurts, thanks for the points.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Where is the game in this movie?\n\nYou wander around as the Gaylord of Rivia and press X to advance shitty dialoge you don't give the slightest shit about. Thats 95% of it - the other 5% are clunky combat.\n\nI played a 2 hours on Xbox a few years back, decided to give it another shot with a Steam sale, but I can't bring myself to play this drivel...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Crashing a ridiculous amount. Wil change if they improve stability",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It is simply OK - not the greatest game of all time as many seem to believe. I bought it on GOG on its original release  in 2015 (also later on Steam when cheap as wanted the achievements) and the game at launch was buggy and a clear visual downgrade from their promotional gameplay trailers. Yet CDPR never got the grief Ubisoft got for the release of the original Watch Dogs. I followed this (at the time) small Polish developer from the time leading up to the release of the first Witcher game, which I liked a lot (at the time). I used to have a lot of respect for them as a company, but I think they subsequently started believing their own hype, partly because they were never really held to account by their fanbase. \n\n\nFortunately, this willingness to overlook glaring issues (which other developers would be crucified for) changed somewhat with the release of Cyberpunk 2077, but even now you see that launch disaster being excused by their fans - the bugginess was one thing, but trying to mislead people not to cancel their pre-orders by deliberately obscuring the terrible state of the game on base consoles was another thing entirely - from the company that apparently 'leaves greed to others'.  I have around 200 hours in the Witcher 3 and so certainly got my money's worth, but not once have I ever been tempted to reinstall it and play it again. It's fine, but frankly I find it a little bit boring - gameplay has never been their strong suit. I have decided CDPR games are not really for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "prawdopodobnie jedna z najgorszych gier w historii, nie mam zielonego pojecia jakim cudem ludzie dobrowolnie poddaja sie tej grze",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit game where the mc who is gay makes ballerina dance when he attacks.\n0/10 would not play again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "miesista walka i ladne baby, wszystko czego potrzeba w POLSKIEJ GRZE :D",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a piece of shit. \n\nI bought it on sale for 6.99, so I can't complain too much.\n\nThe controls are terrible - anything from moving to running, swimming or riding. I've not seen anything this bad in ages, since A.C, perhaps.\n\nTravelling is a pain in the ass.\n\nQuesting is also horrible - I have no idea of where I'm supposed to go. I've had to google it, I found out I'm supposed to go do 3 \"optional\" quests in order to find/save the Blood Baron's wife (Anna). Only problem is that although I know what the quests are called (now, after googling), I have no idea of how to get them. One of them is supposed to be in a place called micapse or something. I have no idea of where that is and how to get there, I'm not seeing it at the fast travel points. \n\nThere's been 0 effort put in here for UI/UX.\n\nFuck this developer and fuck this game. Yeah, I feel like I got scammed. I'm not going to ask for a refund, although I probably should. I'll just make sure to never buy another one of their games. What a stinking piece of shit.\n\nReally good music/sounds, but everything else is shit. Oh, and whoever thought NPC collision is a cool thing: fuck you too.\n\nThis thing is at best alpha-level - quality-wise. Would definitely not recommend it to anyone. The story seems good (so far), but I'll never get to find out what happens next, simply because this shit is unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I hope i will not be hated too much for this review but in all honesty i found this game extremely boring and predictable in the narrative. The gameplay combat wise is way too simple while being over complicated for what concerns crafting, perks, and use of the consumables, may be the controls, or the quite uncomfortable menus interface, i don't know, i just feel i need a manual to figure out if i've crafted a potion or something else, if it's applied, if i have to craft it again or what.\nI really wanted to like the game and i managed to reach the end once, sadly, love never bloomed, every time i fire it up giving it, and myself, another chance, it feels like a chore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played game 3h, can't save progress, \r\nstucked on horse -can't get of, \r\nKilled cyclops- loot under map spawned.\r\nWhy so many bugs still in game?\r\nStory 7/10\r\nWorld 9/10\r\nGlitches  5/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't even manage to kill drowners, game combat makes zero sense. You are supposed to be a fast agile witcher yet every light attack takes a full 2 seconds and you do a 360 every attack. You cannot block or parry vs monsters only dodge. Worthless combat design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game wont launch all of a sudden, wtf, refund me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really janky and sorry but Im gonna be honest kinda overrated",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}