{
  "positive": [
    {
      "review": "I was having a hectic period in life where I couldn't spare time for games, so I started looking for a game I could play for 5 minutes each break. At the 5-minute break during an extensive work session, I click the banana with a left- and right-click combo, release my energy, sometimes get bonuses, and then return to work. The game also has so many skins, most of which are very cheap, so you can keep switching them as you want a new look. Builders, the Well of the Past, the exchange system, and collecting and trading banana skins are parts of the game that take the fun to the next level. Totally recommended!🪽",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "93 hours played a pointless game... 10/10 Recommend to all ages from the old grandmas to the fetuses! 🍌",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Obviously a masterpiece. Simple, yet perfect. The clicker mechanic is actually pretty addictive when you're just vibing. Free to play done right. No greedy monetization, just pure fun. If you've got 5 minutes to kill, this is your game. I crushed the high scores. Highly recommended for anyone who appreciates quality indie games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It’s silly, it’s simple, and somehow I’m still clicking. Peak low-effort fun — even if the seasonal grind can be a tiny bit annoying",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "what can i say? get it for easy achievements and let it play in the background. still don't know why a \"flash\" game (in spirit) made in unity needs to have two loading screens in order to get you through two scenes! other than childish yet simple UI design, it's not harsh on the eyes, rather charming.\nmight create a banana or two to see what the creator scene is like...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really nice game, but very complicated, so many buttons to press and mechanics to learn, had to watch multiple tutorials on how to click a banana.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Um jogo muito legal, só não é legal a parte de clicar na banana.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game itself is kinda funny but why do you have to pay actual money to get all the achievements",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banana is a strangely addictive little clicker that’s perfect for quick sessions and background grinding. It’s not deep, but it delivers exactly what it promises: silly, low-effort fun with a surprisingly active community.\n\nPros:\n\n    Simple, instantly understandable gameplay.\n\n    Colorful, goofy visuals that stand out in your library.\n\n    Collecting and trading different bananas is oddly satisfying.\n\n    Great as a background game while doing other stuff.\n\nCons:\n\n    Extremely repetitive after a while.\n\n    No real depth, story, or challenge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Атмосфера настолько густая, что ее можно ножом резать. Этот мир не просто хочется исследовать — в нем хочется жить. После прохождения возникло чувство потери.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Наконец-то игра, где нужно думать, а не просто кликать! Глубокая тактическая система, где каждый ход имеет значение. Настоящий вызов для ума.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Лучшая кооперативная игра за последнее время! Весело и хаотично проходить миссии с друзьями. Настоящее испытание на слаженность команды.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best touching game!! \nFully recommended for grandmas and people who just tired from their life and wanted to try something new. Just try it and get free from your life by playing this \"GAME\".\n\nTHANK YOU!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Классная игра, сидишь собираешь бананы, хаахахах, на самом деле прикольно, очень сильно отвлекает. Спасибо за игру",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banana is the most craziest game I have ever bought in my life! I will think about making a future gaming channel if I can and make a video out of it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s a weirdly viral clicker game where you just… click a banana and get random drops. No real gameplay, no story, just idle fun and item trading. It’s free, kinda funny for a minute, but gets old fast. Great for memes, not for gaming. Rating: 4/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A simple clicker game that is strangely fun to play. You just click a banana and watch numbers go up. The best part is you can get free sellable items like cards and bananas that can be traded or sold on Steam. It is silly but relaxing and easy to enjoy while doing other things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banana is a very simple clicker game, but that simplicity is exactly what makes it charming. It’s easy to understand, light-hearted, and offers quick moments of fun. <3 <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banana is a free clicker game where you… click a banana. Sometimes.\nThat’s it. That’s the game.\n\nYou open it, stare at a single JPEG of a banana on a green background, get an achievement for existing, and then leave it running so Steam can occasionally drop banana stickers into your inventory like financial jump scares.\n\n---\n\n### Gameplay (lol)\n\n* Click banana → number go up\n* Leave game open → every **3 hours** get a common banana item\n* After enough playtime, unlock a rarer drop every **18 hours**\n* List banana on Steam Market for 3 cents and hope someone buys your digital potassium\n\nThere are “rarities” like:\n\n* Normal\n* Common\n* Uncommon\n* Rare\n* Epic\n* Ultra Rare (1 in 400,000)\n* Legendary (1 in 10,000,000) – a few even sold for over **$1,000** because reality is broken.\n\n---\n\n### Pros\n\n* Free. Literally costs nothing but your dignity.\n* Lowest system requirements of all time:\n\n  * OS: Yes\n  * GPU: Can it display yellow? You’re in.\n* You can “play” while doing literally anything else. Work, school, sleep, other games—Banana is your weird little side hustle in the taskbar.\n* Steam profile flex: “Yeah bro, my rarest item? A PNG of a fruit.”\n\n---\n\n### Cons\n\n* It’s not really a game, it’s an **economy with a banana attached**. The clicking does nothing except give your finger a sense of purpose.\n* You will start saying things like “I’m investing in bananas” out loud and people will worry.\n* Steam Market prices swing harder than your motivation; your ultra-rare might be worth rent one day and bus fare the next.\n* Spawns endless clones: Cats, Car, Broccoli, Poop, etc. The Fruitpocalypse is real.\n\n---\n\n### Peak Banana Moments\n\n* Booting the game for the first time and realizing there is **no menu**, **no options**, just fruit.\n* Getting your first rare banana and feeling prouder than any actual in-game achievement you’ve ever earned.\n* Tab-checking your inventory at work like a stock trader: “Did my JPEG banana moon yet?”\n* Reading angry forum threads about how this is “ruining Steam” while happily claiming your 3-hour common peel.\n\n---\n\n**7/10**\nAs a video game? 1/10.\nAs a social experiment / Steam Market casino wrapped around a fruit? 10/10.\n\nWould once again launch Banana, click it twice, minimize it for three weeks, and call that “playing” again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is good for getting drops to sell on the market, so just get an auto clicker let the game sit and go do things around the house",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Free lobotomy right here (if you try for the 100%) otherwise very good source of vitamin B6",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game will make you escape the matrix, one cent at a time. #richmentality#hustler#mindset#notliketherest. In 326 years I will have a Bugatti, just trust the process.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best current competitive games, if you're looking for a game full of action,clicking and bananas you've found yourself the best game you could possibly ever play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I clicked the banana… now I can’t stop.\nEvery 3 hours this game emotionally blackmails me with another banana drop.\nPeak gaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banana distills play to its pure telos, where simplicity becomes the highest form of delight.\r\nIn each click lies eudaimonia a harmony of repetition and joy, proof that virtue thrives in the humble.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banana used to be my favorite fruit… now it’s my entire personality. I click a banana for hours like it’s a full-time job",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful little game. I enjoyed it immensely. Would recommend to all.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Banana man me want a ton. Give me double and a bonus one. Give me more for all me friends. This banana flow never end. Do you want a banana? Peel it down and go mm mm mm mm. Do you want a banana? This banana for you. Tonight we dance around the flame. Then we get to play the spirit game. Spirit names we shout out loud. Shake the thunder from the spirit cloud. All the songbirds in the tree. Chant a tune to let the spirits free. Then we see them in the night. Spirits jumpin' by the fire light.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "left an auto clicker going and started doomscrolling",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Joguinho massa, bem simples, dá pra ganhar umas achievements legais, top.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's easy to click on a banana. Perfect for shutting your brain off for 5 minutes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My Partner No Longer Has Erectile Dysfunction Thanks To Banana.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "para perder el tiempo es muy divertido, y ademas te sacas unos centimillos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very simple game if you have nothing to do and just wanna waste your time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PRETTY GOOD ACHIEVEMENT FILLER \r\n\r\nFOR SOME REASON MY ACHIEVEMENTS ARE GLITCHED AND I CANT 100% THE GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is fantastic only downside is you cannot eat the banana :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banana-o-lala\r\nOpen game every 3 hours, get a banana.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was the best rug pull ever created thanks for the 0,03€.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Big Juicy Banana. Click & Click More\n+1 From Me! :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pointless but fun even if it is to boost achievements",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for farming and passing time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "listen if your looking for a great enthusiastic game to sink many hours into with stunning visuals i highly recommend Banana you will get lost in this emerse experience of bananas and get addictid to collecting cards with different bananas worth a wopping 3c 15/10 gaming experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have finally found it…\nThe Elden Ring of Fruit Clicking.\nA masterclass in storytelling:\nYou click a banana… and the banana clicks back.\n\nThis game taught me more patience\nthan school, therapy, and loading screens combined.\nI used to have a life…\nNow I have Bananas.\nMy parents left, my girlfriend left…\nbut the banana stayed.\nAlways… the banana.\n\nPeak graphics.\nOscar-worthy soundtrack (silence, pure art).\nReplayability: infinite.\nEndgame boss: another banana.\n\nI’d sell my kidney for more golden skins.\nActually wait. I already did.\n\n10/10\nBanana saved my soul.\n\nBANANA STRONG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of easy achievments if you are an achievement hunter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Why am I playing this.. It's literally just banana.\n... 1k clicks let's go!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Прикольная игра чисто вечером с друзьями порофлить. Классно в общем. Игра сама по себе отличная, разработчикам огромное спасибо, вечерком классно поиграли",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got a banana within 10 minutes of playing the game. Just open the game every couple of hours to recieve another one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banana is a clicker Game, in which you click a Banana! In Banana you click the Banana to gain even more Bananas! Every 3 hours, you get dropped a banana. Each banana is also made by the community in discord. Come hang out with us and let's grow into something awesome !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like that its first game I've played on steam and its easy achievements",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Exchanging is hard but grinding is easy cause you just have to click at the beginning and after that you just need to afk farm in this game, drop time's kinda long which proves the thing i said (you need 10 drop of the same thing to exchange it), but overall the game's mid-kinda good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Не ожидал, что игра про бананы окажется настолько забавной. Вроде бы полный абсурд, а всё равно улыбает и поднимает настроение. Отличный пример того, как простота может цеплять.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ah vrèman lé bananes et le polé bwaizé c bon et awète de me jigoter le froukoutou :(",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Instructions unclear, I dream of banana.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No one’s paying attention, so here’s the truth: I am very much bitchless",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "top1 game in the world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so you just click and click and make money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been a great game to have running in the background",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fajny clicker, gierka do poczilowania 😊",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better use the auto clicker XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banana banana ba ba banana is banana so banana banana! Banana banana 🍌🍌🍌🍌🍌🍌",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game for passive gains",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My friend flow played this game after using a banana to do naughty stuff... euhh #geekyboy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just use auto clicker it is much easier🤗",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game for gays I absolutly love this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Getting the first achievement as the 67th is crazy...........6    7",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kind of game I know exist but don't know why haha",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i havent played this game in a while, so i dont remember if it was good or not",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a clicker! \r\nUnbelievably boring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game , i can do this for all  of  day with out lose",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This banana wants you to be happy !\nLook, it is even smiling at you",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "GAME IS ABOUT A BNANA AND YOU CLICK ON IT 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s a strange game; you can’t really tell how it works",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A banana alarm clock, worth a minute each day.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Great game for for stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a very good game to lose your time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good clicker game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best 57 hours of my life. Auto-Clicker go brr.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game of all time! Call me a bananamaniac!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game and cool",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, this game is pointless. But...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Did this for funny profile background ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im So fucking rich with this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game for idle friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At least it's better than Marvel Rivals.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100+ hours of just clicking.really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banana is a very simple clicker game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "every click i did was done through my fingers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for timepass.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "an afk game that can make you earn some small amount of money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its ok for you to get free stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A must-have for banana-aficionados",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have just nominated this game at Steam Awards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bana\r\n(for every like, i will do nothing)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Boonerner, is gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game to reach money 0.3$ XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is very good and easy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "escaping poverty one click at a time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What to say: its bananas!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for time pass",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Самая лучшая игра в мире все 10/10",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It's a complete waste of time and scammers, don't try it, your steam inventory is full of garbage and you can't sell them.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "Technically, it's a game.\nYou double-click on it and it runs.\nThere are images and sounds.\n\nUh, I've run out of positives things to say.\nOK bye!",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Exactly what i expected it to be. main complaint is why have a 3 minute count down system when rewards are actually every three hours. i thought my game was broken. if the rewards were every three minutes it would be more enticing to interact with. otherwise it is what other people say, just leave it open and running just for achievements.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not Recommended\nI honestly don’t know how Banana manages to waste this much of a player’s time while offering absolutely nothing in return. The “game” is literally just a static picture of a banana that you click. That’s it. No sound effects, no animations, no upgrades, no variety, no effort. It feels like someone tested a button on their screen, forgot to remove it, and decided to upload it to Steam as a joke. Except it’s not even a funny joke—it’s just lazy.\nWhat really pushed me over the edge was realizing how painfully slow and unrewarding the skin system is. You barely get any skins at all, and when you finally do, they’re almost always the most basic, common garbage you’ve already seen a hundred times. It takes days—actual days—just to get an uncommon skin. Not rare, not epic, not legendary. Uncommon. And even then, the skin doesn’t do anything. It doesn’t make clicking feel better, it doesn’t add new mechanics, and it doesn’t enhance the game in any meaningful way. It’s just another picture slapped on the same lifeless banana.\nThe insane part is that the game tries to make these skins feel special by making them so ridiculously hard to get, but all it really does is highlight how empty the entire experience is. There’s no excitement when you unlock one—only relief that your time-wasting grind finally spat out something slightly different than the usual common skins. And after that brief moment, you’re right back to clicking the same dead screen, wondering how a game this empty convinced you to keep playing for so long.\nThe store page acts like Banana is quirky or weird in a fun way, but that’s misleading. There’s no twist, no charm, no hidden joke. It’s not satire. It’s not commentary. It’s not some clever minimalist experiment. It’s just an empty, thoughtless concept stretched into something that pretends to be engaging when it’s really nothing but a monotonous loop of clicking and disappointment.\nThe more I played, the more obvious it became that there’s no real point to anything you do here. You’re not progressing. You’re not discovering anything. You’re not improving your character or your experience. You’re not even building toward a joke payoff. There’s absolutely no reason to keep playing besides hoping that maybe, just maybe, the next click will finally deliver something worth the time. But it never does.\nI don’t mind simple games, and I don’t mind joke games either, but Banana doesn’t function as either. It’s too empty to be enjoyable and too slow to be funny. The skin system feels designed to drag out your time, the core gameplay is nonexistent, and the whole thing ends up feeling like a parody of what a parody game even is.\nIf you’re looking for something entertaining or unique or even mildly distracting, don’t bother with Banana. This isn’t a game—it’s a time sink that gives nothing back. You’ll get more value, enjoyment, and meaning from staring at an actual banana sitting on your counter, because at least that banana won’t waste your time pretending to be something it isn’t.  SO DONT PLAY!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Aside the pointlessness of this game...\n\nIt's intresting to see how my GPU goes up to 30% by doing nothing...\nI do not think that, is only the game sucking all of this power to only \"function\". Am I mining crypto currency for someone else?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like idle and incremental games. This isn't it. It's quite lacking in content, upgradability. At it's base is a basic clicker, but with no content to go with it. It looks like it tries to use this as a vehicle to sell skins.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You literally just click a banana and the number above it goes up. That is it. Plus it will run in your backround even when you don't want it to. This game sucks. Don't download, it is a waste of your time and space.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a game about banana's, and how to handle banana's, What's not to like....\nIt's a [strike]games[/strike] about banana's!\nIts not really a game after all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very good game but little bit of gambling i spend 50 dollar and get 10 dollar banana . now im very happy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's easy for achievements yes, but the drop rate is too slow. To achieve all of them, you must buy bananas in the market of the same kind to make an exchange. As for the clicking of the game, the boost help a lot. After a a dozen hours you could achieve the billion clicks. As for auto clickers, the game doesn't mind, however, the max is 20 cps. With the boost it's basically unlimited depending on how many you add. There's no point in clicks after the 1 billion. Thereafter the game is running idol to get a varity of bananas dropped in which you could, therotically sell in the market for a penny. The market is flooded with bananas so good luck selling them. You'll be paying more in electricity than you'll get on this game. To sum it up. To get all the achievements you'll need to spend about 12 hours & $3 to platinum this game. Do I recommend? No. It's a waste of time & resources.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "+Fun the first day.\n-Drops are worthless.\n-Too many bot accounts flooding the market.\n+Absolutely genius game idea for the owner and players, poorly executed.\n+Runs in the background even when game not launched helping your progression.\n-After a month takes a week to level up a Builder, so now it's boring.\n-Nothing else to do.\n\nNot worth the effort or time.  Pass.\n1/5 Stars",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So there isn't all that much to this game. The graphics are very basic... ugly in fact no design whatsoever like they threw it together in one day. But that isn't the reason for my thumbs down.\n\nThe good: It's free, good for anxiety like when you're on a call or watching a work vid and you just can't keep still.\n\nThe bad: boring, lifeless, the exchange never works, it keeps saying 'exchange failed', and then the banana's disappear. I get credit for some achievements but not the exchange achievements even though I've had at least one go through. \n\nI give a rating of 2/5 banana's. ;)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Arkada mining yapıyor arkadaşlar oynamayın sakın. İlk çıktığı zamanlarda girmiştim bir tek para kazanılıyormuş falan diye yalan dolandırıcı bir oyun. Yeni halinde mining yaptığını görünce direk sildim. Uyarmak istedim.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs a 'how to' tutorial. Okay, bananas are yellow, and soft. I knew this about my favorite fruit before downloading. Something about exchange....? Dunno, and not indicating how or why.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's boring af cus u just click and wait 3 hours for a probably trash banana. 2/10 rating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seeing this filled me with hope.\nI mean, they say that the darkest hour is right before the dawn.\nAnd we are already at the point in Video Game history when this trash gets \"Very Positive\" rating on Steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As a game, not fun at all. As farm, not profitable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No gameplay and you can't sell bananas.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have no fu*king idea why I bothered getting as many achievements as I did.\nI mean it's better than \"Egg\" but I'm done with this sh!t.\n5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Are you really looking for a 3 cent item? Go work at McDonald's.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is really bullshit   its like scamike manipulation",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most unfinished and sad game (even if it can be categorise as a game) ever.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very boring clicker game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash game. zero effort, ai probably.\n\nstarts lagging at around 500 bananas\n\nfuck",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NFT simulator, Can't belive this shit is considered a game.\nJust play Coockie Clicker, the original and supirior version of this rip-off.\n\nBTW, like a million possitive \"YES!!!<3,3>\" comments.\nYou're playing a scam game who rigges the reviews.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Theres nothing to it. No content, progression or incentive to keep playing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Visually, looks like a NFT scam game. The art style is just bad. Nothing has an animation besides a bouncing or glowing affect. Very confusing rarity drops that seems like you have better odds spending less currency at a time. Also advertising the $150 capsule on the screen for most the time spent playing is just beyond scummy \n\nTheres so little to keep you here and wanting to play that you end up not playing long enough to be able to leave a review. I'm being serious, the animation that plays before the game opens is buggy and restarts itself at least once, and it happens every time you go away from the banana. Absolute sore on the eyes. If I didnt download this on steam, I would think I had a virus.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just waste of time. This game not going to help u get any money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't waste your time on this game,you won't get anything",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its fun, i made like 10 euro at its peak.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Id rather start pissing blood",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just dropped common banana's, no rare or anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nice game for wasting time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Appears to be a meme game for generating NFT bullshit?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not shitty but not novel either",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is free but I still want a refund",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "najgora igrica na svijetu",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's not really any game here...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lwky not good to play but ok to farm money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "most buggy shit ive ever seen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even for a clicker it's dumb",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "money laundering",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good timepass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "such a waste of everyones time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bUllshiiit dont waste ur time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just a click game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "That's... Not a game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I thought it was an iddle game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lan jiao game la",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Scam game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Waste of time really.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No buyers\r\nNo good drops",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "FUCK YOUR MOTHER!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A bit boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It shits in your inventory.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nul à chier",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "poor ui and visual",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fah dih bru ain get no banana",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "לא מה שצפיתי אני רוצה ריפונד של 100 שקלים חדשים עכשיו",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "قومامة لا تظيع وقتك - Bad Game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Complete trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "гагагагага\r\nгавна",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "idk why i played this for 20mins",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i think this is scam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "scam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "chert",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "funny",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "banana",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "assasasa",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "🍌",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BG",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "وع",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "67",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "n",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Of all the clicker games I've seen or played, this is probably the worst. It's buggy, the clicker/idle aspect is short lived af, and it's exchange system is stupid. It's a game meant for those with gambling addictions lol and admittedly I bought into it a little...but shortly realized and left.\nIt's free, but your time isn't, don't waste it.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "trash game, only for the market skins and 0 effort into the actual game",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "It's a complete waste of time and scammers, don't try it, your steam inventory is full of garbage and you can't sell them.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "There is no way the positive reviews for this are legit. It's a clicker game with no progression whatsoever.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "An idle game without any progression, a borderline bitcoin miner put into a game. Achievement dumps make no sense, none of the achievements have correct ways to get them (besides the very basic ones). Stay away, you are missing absolutely nothing by not playing this.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Banana might look funny and quirky at first, but the fun wears off faster than a peeled fruit. There’s not much to actually do — it feels more like a joke that went on a bit too long.\n\nSure, it’s harmless and kind of amusing for a few minutes, but after that, you’re mostly left wondering… was that it?\n\nA cute idea, but not much substance.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "Technically, it's a game.\nYou double-click on it and it runs.\nThere are images and sounds.\n\nUh, I've run out of positives things to say.\nOK bye!",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "I'm a pretty big fan of clicker/idle games myself, but even after a recent update which added buildings, the game still lacks depth and progression. The only real purpose of the game is for the devs to make money off of Steam Market sales. But for you the player it's absolutely not worth doing since the electricity costs more than what you actually earn in return (1 cent every 3 hours).",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "for a clicker & idle game id rate it 3/10\nClick, Click, Click or just use a auto clicker",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "generic nft game. you get 5 cents per day in sales if you EVEN get any sales and trading up is useless. it's gambling and wastes a lot of time. it barely runs on an okay computer which i wouldn't be surprised if it was mining bitcoin in the background or something. seriously, i was getting like 1fps or less on a game where you click a literal banana png (it took 5 minutes just to interact with certain things. just not worth the performance. you HAVE to close it with task manager every time.)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "dont use this even as a hope of getting rare skin\nfk this game. even after so many hour i only got skin with 0.3 INR that nobody buy.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}