{
  "positive": [
    {
      "review": "Abso HATE Val but LOVE this game.  The cards make it super fun! I would def play this game if i were you ;) Add me if u wanna play!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This may be a long review but its my genuine look on this game and I feel people should take it for consideration when playing.\n\nFragpunk deserves more credit than it is given. The gameplay is enjoyable with good gunplay and character mechanics that all feel well balanced. \n\nThe main negative reviews ive seen are mainly about ai generated content, bots-cheaters, and micro transactions \n\nAs for ai content. The only content I can tell would be the showcase picture of skins. for example the battle pass banner for 2 premium skins. other than that the art in the game is great and has a lot of character. Stickers for example would be the guess for ai use. but i cant tell and I enjoy a lot of them. I can care less if a game uses a little ai if its done right. They shouldnt get a negative review for that. \n\nBots and Cheaters. Ive been going through ranked and have not experienced any bots or cheaters. now for casual and arcade idk, but so far its been fun. Play with friends to get the most out of the arcade game modes, there a great addition for casual play and are well made. They added a tower defense game mode with around 100 or more cards just for it and I was suprised how fun it was.\n\nNow for Micro Transactions. By far the most important because people give the most negative reviews about it.\nUpfront im going to say Fragpunk is by far one of the best games to do micro transactions right and Ill explain why. \n\nFirst lets address free content. ill use the current season events for example. You get 3 character skins and 4 weapon skins 25 ultra pop cans with stickers, charms, head and arm ornaments, and profile stuff for free. Now these skins have different variants and vfx, different sound effects, cross hairs, tracers, and animations. I like how even rare and epic skins look good and make me want to use them instead of letting them rot. Not to mention you can use stickers and charms to make your own skins. I added a animated flaming sticker to my knife, last game to come close to that was bo3 and i miss it, but fragpunk brought it back. Ive even gotten random free promos that gave me ultra pop cans and frag coins. the premium currency, a free character unlock and a battle pass voucher thats $10 free.\n\nWhich brings me to the currencies of the game.\n GOLD- used to unlock lancers, fuse stickers for higher rarity up to legendary animated ones. and some event spins\n GLUNITE- to unlock some skins and get normal pop cans but these cans have a chance to drop ultra pop cans\nFRAGCOINS- You buy this currency. But promos and events can give some. This event gives you 600 for free. Mind you the battle pass is 900 and a legendary skin is 968.\n\nThe battle pass gives you 900 for the next one and its easy to climb. 5 weapon skins 2 lancer skins and 18 ultra pop cans. \nagain variants with vfx and animations\n\nNow Paid stuff. legendary skins are 986 lancers and melee are 1986. every legendary comes with sound vfx, bullet tracers, reload animations, kill and popup vfx, and inspect animations. Lancers have unique ability changes and effects. for example chum is a toy robot with a lego chomper, tripmine, and cube smoke effect. My favorite legendary skin is the heart felt dicipline and utility pistol. The pistol has a flip draw animation with a cute snake, shark, and bird that react when you shoot and hide when you aim. Its from the event that gives 600 fragcoins so you can basically get a skin for free.\n\nNow if you want to compare to a similar game like valorant. Epic weapon skins are 1775 and legendary can go from 2175 to 2975 thats 18$ for an epic and 22$ to 30$ for a legendary, melee goes for 3550 for epic 35$ and legendary 5350 to 5950 60$ for one skin. Meanwhile epics are usually unlocked through events, ultra pop cans and battlepass. and I already said the prices for legendary. \n\nLastly mythic skins. very flashy they change the entire gun or lancer better than legendary in most cases even though I like some legendary skins better, you get the idea. There unlocked through ticket draws and ultra pop cans. 500 to be guaranteed 1000 ultimate materials but you can pick which one you want. so far there are 3 mythic melee weapons. also during the draws you can get epic weapon and melee skins. That being said  you can technically get it for free. it will take a while but the fact you can is nice, 25 each event average isnt too bad. thats also not including promos and challenges.\n\ntickets are pretty fun its a gacha system that increases every use mainly for mythic weapon and lancer skins. 33 fragcoins for 1 ticket then doubles almost every time 33,66,132,264,660,825 so on. there are 4 filler rewards 4 legendary skins and a mythic skin. after 3 fillers i got a legendary 264 frag coins for a legendary skin. thats 3$ then I hit another for 660 7$\nthen another for 825 8$. 1980 or 20$ in total but if I just did 264 it would have been free dont forget the event gave me 600 coins and your always guaranteed a legendary once you spend 1155 a little more than a normal legendary but if your lucky its only 495. and you can even hit them on 33,66, or 264. I think its a great deal. although the melee and mythic are a 05% chance. in total everything will cost $66 or $46 if you get the mythic 1 draw before last. Still better than valorant being $60 for just the melee. $66 for 3 legendary weapons 1 melee and 1 mythic weapon skin.\n\nNow last thing i did buy a bundle for $60 which gave me 12800 coins and 20 ultra pop cans. That value is worth 16120 in total 166 for each pop can. $161 worth is a great bundle value\n\nIn conclusion Fragpunk is a great game and I think people also forget its free. microtransactions are expected so they can make money. Cod is $70 to $100 with $15  average skins and the game lasts a year. Fragpunk has been the least greedy game ive seen in a very long time and its free. How can people get upset over microtransactions when its there only way of income, and the game spoils you because everything can be earned. It frustrates me to see a good game loose players over minor things like ai art or bots. first of all the bots wouldnt be needed if the game wasnt being spammed by negative reviews and the ai art can easily be overlooked, i cant tell and all the cosmetics are well made and have soul and effort. \n\nDont complain about a low player count because your the one causing it. if all negative reviews that mentioned bots,ai, and microtransactions were taken out this game would be very positive or even overwhelmingly. Which boosts its capability to grow more players. people are quick to jump to conclusions on any microtrasaction they see and dont actually calculate what they can earn. and once any ai art is used they just completely discard everything. I dont like it either but Fragpunk is not full of it and if there is ai it is very well made to the point you cannot tell.\n\nJust play the game and stop picking niche points, Fragpunk has done far less greedy shit than most games these days. The characters are well made with unique designs and abilities the gun play and movement is great. Shard cards add a dynamic mechanic to the game that change up playstyles and makes you mixup lancers or weapons keeping it fresh. \n\nFragpunk doesnt deserve the hate it gets, people like to hate or find the smallest reason to. Which destroys a lot of games and it sucks to see this behavior become the norm. I want this game to grow because it deserves it, free hero shooters today need humbling because they get away with so much greed and little content updates. While Fragpunk actually allows you to get free stuff and rewards you for playing. They had 3 seasons with a bunch of new game modes interactive events and added 4 new characters, I believe 6 new lancers since Beta yet people still complain over the smallest things.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Very good game mechanically, with good variety and a great game feel.\nCurrently the event of Halloween is a tower defense with deck building mechanics very original for a FPS.\n\nThe only bad thing i really can give to the game is that there is a cosmetic gacha system AND a battlepass AND a cosmetic shop. If you can live with that the game has a lot in store for you.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Отличная игра, которая действительно может посоревноваться с другими шутерами, но есть один существенный недостаток - про игру мало кто знает, ибо разработчики ужасны в маркетинге.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is a blast to play. Its free. which makes the amount of content and quality even more impressive. The mechanics are smooth and responsive, and overall feel and style of the game are fantastic. I have many hours in Valorant, Overwatch 2, CSGO, and a few others, and I highly recommend this game!\r\n\r\nThere's a ton of free stuff you can earn just by playing, and cosmetics are really well done. There are plenty of ways to customize your character without spending money. It's also a lot of fun playing with your friends or solo. \r\n\r\nthings people cry about\r\n-bots!! get use to it. Most games have them now. You're not getting away from them.\r\n-childish feeling! Lets be real its doesn't have that feeling at all. \r\n-lack of characters! It's nice not having a huge pool of characters to learn. I think it has a great amount for the game not being that old. \r\n-the prize pool! Is it rigged? Probably lol ! BUT YOU DON'T HAVE TO SPEND MONEY ON THE GAME! They have tons of free stuff!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "amazing 5v5 defusal game with cards that range from lifesteal to \"plant the bomb anywhere on the map\"\n\nI love it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, amazing first year of this game being out. Would recommend to those who love a fun and quick paced game\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A mix of cod and Valorant.. little bit of csgo.. love it c:",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fast pace Shooter competitive and tons of new stuff only the cosmetics are p2w i would expect that But over all its free so really cant complain and they have New mini games every I dunno ummm so u can play it to see for ur self. Overall this game is more if u wanna have fun. Tons of cards btw. I Liked the games objection for the basic game it make me hyped to sometimes. :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a good and enjoyable game for a change, and it can work well as a tournament game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is awesome, devs are actually updating constantly and providing lots of different content.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is the most underrated game I know, its incredibly fun, the mechanics are truly original even tho they kept the bomb defusing gamemode. Very fun to play with friends and its easy to get the hang of it. I would highly recommand it to anyone. (Please make this game alive !!!!!!!)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Spiderverse graphics, shooting like cod, mechanics like Apex, overall amazing game!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you are dogass at shooter games this one is for you, Its like valorant but the majority of the player base are special olympics competitors, Its like being an adult man and playing dodgeball against 6 armless drooling children.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "+ Every round is unique due to the cards being selected\n+ Great for casual and competitive matches\n- Some cards are OP\n- Skins are expensive\n\nGenerally fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it, spent a few hours on it. Tactical, fun and frustrating at the same time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent anti-cheat, fun gameplay and nice stylization. Only downsides are the usage of AI for some assets and that each match is a max of 7 rounds long (unlike CS where it goes up to 24)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So creative and the way they added so much types of games together in a clean way is really cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love playing this game. The cards make each round different and fun or challenging. I wish they would market this game better and certainly not as a Valo competitor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Too much cards (for me) and competitive is unplayable (for me)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved the Beta Version of Fragpunk with the fast and funny movement, well sadly its overall a bit slower now but got better then to the release day after sum updates, its a good middle thing now.\r\nThe Game itself is pure fun, in a casuel and comp way just bc of the cards, it will get never really boring but it can be a bit overwhelming at the first few matches.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FragPunk is a chaotic breath of fresh air in the stagnant hero-shooter genre, successfully blending precise tactical gunplay with game-breaking creativity. The standout \"Shard Card\" system is a masterpiece of design, allowing players to fundamentally alter the rules of every round—whether it’s flipping the map upside down, turning floors to ice, or equipping explosive ammo—ensuring that the meta never gets stale and no two matches ever feel the same. Combined with a stunning \"glitch-punk\" visual aesthetic that feels like Into the Spider-Verse meets high-stakes combat, Bad Guitar Studio has created a game that is competitively viable yet endlessly fun, making it a must-play for anyone tired of the rigid routines in games like Valorant or CS:GO.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played Valorant and CS2 a little but neither of them really stuck with me. I get that this is super similar to those games, but I really like the spunk/funky vibe that comes with this one. Even if my gameplay is trash, I still dig the many different ways a round can be played due to the shard card system, and I think it's been implemented really well to avoid any one round from being incredibly unfair to one team.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is straight fire. So fun. It's like Rogue Company meets Call Of Duty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game. It runs smoothly and I've not encountered any bug so far. The cards are a good idea, but not all really have an effect on the game. But all in all, it's a good game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and a lot of original elements to it, I only wish teammates that are plat rank can use there god damn brain cells because why we pushing A for the 10th time in a roll after getting destroyed the past 9 times some reason plat players can’t play if there life depended on it, other than that it’s an amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is absolutely incredible, dynamic fast paced gameplay is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was the last game my friend fell in love with and played countless hours before he departed from our world. It's a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game, with some new and refreshing mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Went into a raid solo, called the extraction lift.\n\nSome dude runs up - I shout \"Don't shoot, let's extract together!\"\n\nHe shoots me instantly, of course...\n\nThen another random guy shows up - I scream \"Kill that bastard!\"\n\nHe actually does it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun, seems easy to pick up, at least easier than its counter parts like valorant and stuff.\nSome toxicity but not the worst community out there.\nSeems casual friendly as well, matches dont take 1 hour plus like other games. \nWould recommend overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun game. Looks and feels great. Love all the characters and their designs. Lack of large player base is the only thing critique i have of this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Modern FPS Shooter game with revolutionary gameplay I've never seen before, very unique",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best experience with friends\none of the best and unique visual effects i saw over the years",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely fun and underrated game, ESPECIALLY with friends. PLUS It's free, so don't skip out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "id like to recommend fragpunk, rlly nice and fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great graphics and enjoyable gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cards are a fun change to fps. Every time I'm in the menu I die a little inside, feels like I'm in a mobile game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game, hope it blows up soon. P.S. there is 0 proof this game uses AI art lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In the future, drug-addict mercenaries fight over their narcotic of choice, Glumite. It's a reality-altering substance that's shaped into cool-looking trading cards that they snap in half, to inhale the dust and shards inside I guess, and then mayhem ensues. Their heads get gigantic or tiny, doing squats heals them from grievous injuries, bullets turn into vampires, they carry around a protective turtle shell; you get the jist, the effects can be pretty weird.\n\nThe intro cinematic explains nothing about the game's setting in any satisfying way, but at least it shows-off the game's loud, colorful, and often cheesecakey aesthetic.\n\nThis game has all the usual stuff from games in its genre, like a random roster of playable characters subtly-inspired by pop culture, items locked behind season passes, different battlefields/arenas, different game modes, about 30 different currencies to keep track of, about 40,000 pages and menus to click through with 80,000 progress bars active at any given time egging you on to unlock the next shiny bauble, etc. It's all the same shitake, but at least it looks pretty.\n\nMost of all I appreciate the PvE modes becaue PvP games like these are usually a headache at best. There don't seem to be that many PvE modes though (I only saw 2). One of them is a Sanctum-style base-defense game, the other is the main PvP game but with your human team against the Bots (teams take turns trying to plant or defuse a bomb and the other team tries to stop them). It's rad that you can still earn XP/currency and unlock stuff in PvE. Maybe you can't unlock everything, like certain cosmetics, but so far my PvE actions keep providing progress for the Progress Bar Gods.\n\nSpeaking of cosmetics, the real-world-currency prices range from delightfully cheap charms and accessories to...not that bad actually, but I'm still not on-board with $20 for a single weapon or character skin. Yeah, it's cool that you can radically transform the same character into a Ghost Pirate Captain or Jessie from Team Rocket, but not for 20 bucks. Hard pass, now I won't be buying anything at all, devs.\n\nOne other annoying thing I'll point out is that I saw many typos across the various cards and menus for the English version. Nothing game-breaking, just an eyesore.\n\n[TLDR]\nI like the game overall, even if it does share most of its DNA with other games in the genre. It doesn't take itself too seriously and there's no stigma around playing it, so give it a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only shooter game I've truly enjoyed. I feel so sorry for the developers. I see how hard they're working, making patches, interesting events, and mechanics, but online play has really dropped since release. I'm afraid I won't survive if this game dies and gets shut down. It's a really cool game that I want to play, but it needs some good PR. I wish the developers good luck! Russia is with you, brothers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game! It's actually a great game, it's just looked over all to much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed it so much when it released but it fell off so hard sadly. We kept playing together but at some point waiting for a match just took way too long because of the lack of players. Hope it gets like a huge comeback at some point",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun. Feels like CoD, Fortnite, Borderlands, and overwatch all in one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly this game feels like valorant but just done better and with better features",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome. The card system makes most rounds different. And it's super rewarding to know all the little knowledge and rare interactions for niche things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good but lacks content if this game was bigger and had larger player base it would be awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very good game, sometimes it crashes and but very enjoyable and I'd recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A must for everyone who loves detailed designs and cool combat <3 Would recommend it a hundred percent!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fast, chaotic 5v5 shooter that never feels the same twice. The Shard cards shake up every round, and honestly that’s what makes it fun. It’s quick, colorful, and easy to pick up, but some cards are kinda busted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "oml this game is like a bug zapper I swear but instead of attracting bugs its attracting the dumbest cunts i've ever seen. would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FragPunk is easily top 10 games of 2025, all they need to do is market this game again.\r\nI could not recommend this game enough. Super smooth and fun gameplay, every match feels new. Modes for everyone.\r\ngod it's so fucking peak.\r\n\r\n [spoiler] I wanna fuck that lesbian ass fish girl sonar, god she's so cute [/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great launch but OCE servers were dead early on but seem to be back now. Overall i enjoy the gunplay and the change of visual style and card system keeps things fresher.\r\n\r\nDefinitly worth a download for the price\r\n\r\nIf CS is too sweaty and COD SnD is too toxic this might be the game for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun and entertaining concept on 5v5 arena shooter. Enjoyed every bit of its little pentiss",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game super fun definatly helps with hand eye coordination. better with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FragPunk surprised me in a good way. I really like how the game works with the Shard Cards and the way they change the rules. The skins are also really well done. The art style is bright, stylish, and the cosmetics look genuinely great.\nThere are a few rough edges with balance sometimes, but overall, the gameplay is really fun. \n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun and really uniqe game mechanic that changes the gameplay and makes it stand out among the other games in similar genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm soo sad that this game died:(. i've played this game since Beta and i honestly think this game deserved better.\nIt had soo much potecial.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this the right way to make a search and destroy game without making it complicated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Didn't think I'd like this as it seemed like a bad spinoff of hero shooter but I gave it a try. I was pleasantly surprised with the experience. As someone with thousands of hours in Valorant, I have more fun playing this. Seems to have more on an emphasis on gunplay than abilities, and nothing seems that broken. Maps are interesting and the card system is good at spicing things up. Quite literally [idk the exact number but a very high number] total combinations to make every round interesting and memorable.\n\nIt has quite a bit of a learning curve in terms of knowing the abilities/champs, the maps, movement, and learning what all the cards do. That said, if you just play normals/arcade until you learn the gist of things, you'll have a great time.\n\nI also feel like I have to mention the short, faced-paced games, where each game is only 6-8 rounds max with a potential duel at the end. If you want to run a quick game with friends in less than 10 min, it is possible.\n\nGreat casual game for people who don't want to play ranked (so many modes!) and I just started ranked, but it has been fun so far and the people seem to be very nice. Highly rec to anyone trying to explore fps, and people with a background in tactical fps/hero shooters (cs:go/2, valorant, overwatch)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool games and easy to handle tricks, cards, skills and so more others with all Lancer of each characters you play, so enjoy FragPunk to your list",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game to play, not got to paly for too long but sems like a pretty game, and pretty fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the visual and gun play. the cards are a cool new system but i dont like it personally.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has a lot of potential as a simplified arena shooter but the game lacks the player base to support itself. Maybe  some content creator will breath some life into this game someday or something but for now I can't recommend playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Final Verdict: [b]73/100[/b][/h1]\n\n[b]Poor: 0-74 (0-74%)[/b]\nPerformance or gameplay falls significantly below the passing mark.\nRequires substantial improvement and may have critical flaws or issues.\nNot Recommended - ✘\n\n[h2]Player Opinion Steam Review[/h2]\n\n[b]Gameplay Experience (17/25)[/b]\n\n[i]Intuitive Controls - Easy to use.[/i]\n☐ Very Difficult (+1)\n☐ Difficult (+2)\n☑ Moderate (+3)\n☐ Easy (+4)\n☐ Very Easy (+5)\n\n\n[i]Balanced Gameplay - Fair and equal.[/i]\n☐ Poorly Balanced (+1)\n☐ Somewhat Balanced (+2)\n☑ Moderately Balanced (+3)\n☐ Well Balanced (+4)\n☐ Perfectly Balanced (+5)\n\n\n[i]Player Engagement - Involving and captivating.[/i]\n☐ Not at all (+1)\n☐ Slightly (+2)\n☐ Moderately (+3)\n☑ Very (+4)\n☐ Extremely (+5)\n\n\n[i]Decision Relevance - Meaningful choices.[/i]\n☐ Meaningless (+1)\n☐ Not Meaningful (+2)\n☐ Somewhat Meaningful (+3)\n☐ Quite Meaningful (+4)\n☑ Highly Meaningful (+5)\n\n\n[i]Rewarding Progression - Satisfying advancement.[/i]\n☐ Very Unsatisfying (+1)\n☑ Unsatisfying (+2)\n☐ Neutral (+3)\n☐ Satisfying (+4)\n☐ Very Satisfying (+5)\n\n\n[b]Presentation & Immersion (18/25)[/b]\n\n[i]Compelling Storyline - Engaging narrative.[/i]\n☐ Not Interesting (+1)\n☑ Slightly Interesting (+2)\n☐ Moderately Interesting (+3)\n☐ Very Interesting (+4)\n☐ Extremely Interesting (+5)\n\n\n[i]Immersive Atmosphere - Captivating environment.[/i]\n☐ Not Immersive (+1)\n☐ Slightly Immersive(+2)\n☑ Moderately Immersive (+3)\n☐ Very Immersive (+4)\n☐ Completely Immersive (+5)\n\n\n[i]Visual Aesthetics - Stunning graphics.[/i]\n☐ Not Appealing (+1)\n☐ Slightly Appealing (+2)\n☐ Moderately Appealing (+3)\n☐ Very Appealing (+4)\n☑ Extremely Appealing (+5)\n\n\n[i]Audio Quality - High-quality sound.[/i]\n☐ Not Engaging (+1)\n☐ Slightly Engaging (+2)\n☐ Moderately Engaging (+3)\n☐ Very Engaging (+4)\n☑ Extremely Engaging (+5)\n\n\n[i]Polished HUD - Clean and functional interface.[/i]\n☐ Very Unfriendly (+1)\n☐ Unfriendly (+2)\n☑ Neutral (+3)\n☐ Friendly (+4)\n☐ Very Friendly (+5)\n\n\n[b]Design & Technical Aspects (18/25)[/b]\n\n[i]Game Design - Well-crafted mechanics.[/i]\n☐ Poorly Designed (+1)\n☐ Somewhat Designed (+2)\n☐ Moderately Designed (+3)\n☑ Well Designed (+4)\n☐ Excellently Designed (+5)\n\n\n[i]Content Quality - Rich and diverse.[/i]\n☐ Poor Content (+1)\n☐ Limited Content (+2)\n☑ Moderate Content (+3)\n☐ Extensive Content (+4)\n☐ Abundant Content (+5)\n\n\n[i]AI Behavior - Intelligent and realistic.[/i]\n☐ Very Poor (+1)\n☐ Poor (+2)\n☐ Average (+3)\n☑ Good (+4)\n☐ Excellent (+5)\n\n\n[i]Settings - Flexible and customizable.[/i]\n☐ Very Limited (+1)\n☐ Limited (+2)\n☐ Moderate (+3)\n☑ Flexible (+4)\n☐ Highly Flexible (+5)\n\n\n[i]Technical Issues - Minimal or no problems.[/i]\n☐ Numerous (+1)\n☐ Moderate (+2)\n☑ Limited (+3)\n☐ Minor (+4)\n☐ None (+5)\n\n\n[b]Final Considerations (20/25)[/b]\n\n[i]Overall Satisfaction - General enjoyment level.[/i]\n☐ Very Dissatisfied (+1)\n☐ Dissatisfied (+2)\n☐ Neutral (+3)\n☑ Satisfied (+4)\n☐ Very Satisfied (+5)\n\n\n[i]Microtransactions - In-game purchases.[/i]\n☐ Extensive (+1)\n☑ Substantial (+2)\n☐ Moderate (+3)\n☐ Minimal (+4)\n☐ None (+5)\n\n\n[i]Replay Value - Longevity and replayability.[/i]\n☐ Very Low (+1)\n☐ Low (+2)\n☐ Moderate (+3)\n☑ High (+4)\n☐ Very High (+5)\n\n\n[i]Cost-to-Play Ratio - Money spent vs hours played.[/i]\n☐ Overpriced (+1)\n☐ Poor Value (+2)\n☐ Fair Value (+3)\n☐ Good Value (+4)\n☑ Excellent Value (+5)\n\n\n[i]Recommendation.[/i]\n☐ No (+0)\n☑ Yes (+5)\n\n\n[h2]Generate your review at https://playeropinion.com[/h2]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, brilliant graphics and characters. Voice lines are fun and enjoyable and the weapons are basic but effective. Amazing music and sounds in general along with incredible gameplay makes this well worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty standard hero shooter, lootboxes, battle passes etc, don't go in expecting to not be bombarded with advertising.\n\nCool art style tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To be honest, I expected this game to be just another generic 5v5 bomb defusal first person shooter with cheap roguelike elements. Instead it surprised me quite well mostly with \"Shard Cards\", an unique game changing mechanic that has given me nothing but fun experiences. \n\nAlmost every shard card is unique in it's own way and some are so chaotic that they can completely change the way game is played, from \"take your eye out and place it as a surveillance camera\" to \"when you damage an enemy spawn a grim reaper that will slash everything around them\", and my personal favourite \"when enemy dies they leave a soul on the ground, pick it up and change your gun and character into thiers\" allowing for the most epic clutches ever.\n\nSpeaking of characters, their designs and abilities are interesting too. In this game, no character has ultimate ability, which is fine since they would just steal the spotlight from shard cards. But even without big flashy ultimates, their abilities are still creative, useful and can change the direction of the game drastically.\n\nI guess since this is an FPS game, I should probably review shooting part of the game. Well, the shooting feels great, headshots are satisfying, and guns are diverse enough. As for the secondaries, projectile launchers are a bit unnecessary but overall they are fine.\n\nIf you are a fan of classic 5v5 slow shooters like CS and Valorant, but want an interesting twist, give this game a chance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "plays funny and shoots very smooth, love the grafics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра в целом классная, ещё бы были какие то ивенты для поддержания онлайна",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like CS or Val, but more casual. Ideal tactical shooter if you want to play just for fun with friends.\nAlso implements innovative concepts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very fun... for like maybe 30 mins before you get bored! But Its pretty fun! And you can gamble so thats already a recommend!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is hella fun, honestly I think it's a lot better than valorant, and nitro is my fav character cause she a cutie",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun card gimmick, unfortunately almost no one plays it and any kind of creative use of combination of cards are killed by bot lobbies, will keep playing tho since the gunplay is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, after playing FragPunk I felt refreshed. It’s fast, chaotic in a fun way, and never repetitive. Every match felt new, and I didn’t get that usual burnout you feel after long FPS sessions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Frischer Wind für Shooter jore. \nWichtiges merkmal weniger toxische Community als bei anderen pvp Spielen",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Underrated, good skins, gameplay is good but shard cards can be overwhelming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it a really fun shooter with innovative mechanics, but i wish more people played the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely fun shooter, but it does have its flaws. One: since the game came out, it has started to become apparent that there are more bots than players. No.2, The use of ai art in some areas annoys me a little, but its fun so I merely forget about it. Got to say though, I have seen a lot of players potentially scripting, and there needs to be a better anti-cheat. For a free game, this is a creative twist on a genre. Think about if Valorant, and a card game was combined, BOOM FRAGPUNK! But seriously, I would like them to fight against these issues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its an easy and friendly fps game to start off with",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best shooters I have ever played.I am not much for military shooters except for Combat Arms back in the day.This kind of reminds me of the play style of that for some reason.But otherwise I like the art style and game play.It actually is a decent shooter for those that have arthritis as well.No p2w,no cheaters just straight up fun.Plenty of maps,plenty of modes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WONDERFUL game slightly complex but once u get the hang of it u r GOOD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've tried a lot of shooters like Valorant, Overwatch, Apex, etc. This one is definitely my favorite. It gets a lot of unwarranted hate and I don't get it. It's fun, super flashy, great mechanics with different game modes, new lancers being released frequently, plus you don't spend a dime on anything to get cosmetics and skins. Give it a try and you'll love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got this game because my friends recommended it, I didn't think it looked fun but I reluctantly downloaded it. This game opens a whole new world of possibilities, and even if it doesn't look fun I deeply encourage you to try it. I have over 189 hours on this game as of now and i have loved every moment of it. This game is fun, relentless, and most of all easy to play and learn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am not massively into FPS. But this got my attention, I have found it ewntertasining with a good set of skins etc. Does the trick for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, would recommend for people getting bored of Valorant or Siege. Very high paced and really fun to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its an awesome, outgoing, adventrous game. Its great if you like fist person shooters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "People be hating on this game and comparing it to Valorant… Ive played Valo for 5 years it gets boring because of the repetitive gameplay/mechanics ☹️ Im like level 800+ and spent over $1k on it. BUT this game its different 😝 I just enjoy it so much :> it has a lot of details and the skins are so much better! It’s very underrated. Ppl just don’t appreciate new things, its okay to let go of the past 😣 Ill be back Valorant… I just have to grind this game first 🥰",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool game, what I like most about it though is that you don't need to spend money to get skins. You can get them fairly easily by just playing the game normally :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of the best competitive shooters I have ever played\n\nGenerally reaching the top rank in a game is an absolute slog and painful. Hitting champ on R6 years ago took a mental toll, hitting Pred on Apex broke me and made me uninstall after getting it, etc. Reaching Punkmaster on Fragpunk was genuinely fun the ENTIRE way through. Every game feels different with the card system, and it's the only shooter where you continually see players doing things and causing interactions with abilities and cards that make you stop and think \"why didn't I think of that?\" or \"wow, that's cool\".\n\nI'm really not sure where the review bombers come from that call it a cash grab or Valorant clone, when in reality the only thing it shares in common with Valorant is that it is a 5v5 bomb mode. There are a TON of games like that, and this game does a good job carving a unique identity in that genre. You'll also notice EVERYONE who says those things have under 20 hours, and this game takes 50+ to really start to grasp and get used to. The cash grab accusations are braindead, considering the only paid things are cosmetics, and everything can be earned for free with enough playtime. If you don't have the self control to not spend money on every pretty skin you see, maybe stick to single player games, as Fragpunk's microtransactions are objectively less predatory than games like Apex, Overwatch, CS2, Valorant, etc.\n\nThe real shortcoming of this game is the marketing team. Please for the love of god advertise this game, do a collab, SOMETHING. This game has SO much potential behind it, and it is being wasted by a marketing team who clearly has no idea what they are doing. Also, who decided this game needed a \"Hentai\" tag??? There is ZERO nudity or sexually suggestive material, the most you'll see is a character's midriff or thigh. Is this middle school? If you are like me and have the \"Hentai\" tag blocked from showing up on steam recommendations, this game would never appear for you unless searched for directly.\n\ntldr; Great game, awful marketing team, review bombed by low play time Valorant dudes who are mad they cant find any 15 year olds to groom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had low expectations for this game but was pleasantly surprised with how good the gunplay is. I think the ability cards are a cool idea and the randomness is interesting in matches. I think the gun balance is decent and I hadn’t come across a single cheater either which is nice. I just wonder if maybe I was too late to the party looking at player numbers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game for childeren has school and dont have hour to play games like CS2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but the matchmaking times are atrocious. Ranked is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game the card mechanic really changes things up so its not just another valorant also the ability cooldown really helps with ability spam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "deserves more players, as its unique and fun to play. menu is a little overwhelming for no reason",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good and pretty interesting game but sadly queue is sometimes longer becuase there isnt enough promotion of the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like:\nMovement is pretty vanilla, so no movement demons\nFPS with ADS\nAll guns unlocked from start\nVariety of game modes\n\nDislike:\nNo weapon mods\nThere is too many cards, cards can make the play more fun but can also become confusing at times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's been a while since i played a competitive fps. This brought me back.  Varied characters with abilities that aren't overpowered, anyone can use any gun and the shard card system make it so every round in every match is different. Add to that the many varied and completely different modes and it always feels fresh. Not as fun without friends as you can't get most people to coordinate effectively but otherwise i highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ignore the haters. Genuinely a great shooter where tactics in each round can vary vastly based on the cards at play. Plays great, looks great and has a steady stream of cool cosmetics (both for characters and guns). Lancers are unique enough in their playstyles and have interesting abilities.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game just put the time in you can get good quick wish more players played",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The problem with games like this, is that it blatantly gives away the fact that it's trying to be \"the next big thing\". It feels off, too many cosmetics, not enough unique heroes or at least not unique enough, with bland looks and few to no new mechanics. I am not trying to be difficult. I just honestly hate opening a game and being greeted with a super complicated UI, a series of \"rewards\"  that feel shallow and cheap and also playing it and feeling like Valorant, Overwatch or heck even The Finals would be more fun. I basically have the same issue with Farlight.\n\nEDIT: I think I didnt make myself clear in this review since two people have commented on that already so I will clarify it here: What I meant to say was that DESPITE Marvel Rivals, Overwatch, Valorant and the Finals feeling like they have a soul and wonderful gameplay, games like this seem to be trying to copy their success without any real love for their product. Everything between their gameplay and their monetization feels greedy.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "The Game concept itself is amazing and a lot of fun,\n\nbut holy shit is the Menu and the Reward System a Dopamine Overload Nightmare.\nYou get rewarded for basically anything.\n\nI could take a sh!t or cough and probably get like 30 reward drops in 7 DIFFERENT FCKING MENUS\n\nOh and did I mention that the Stickers and some other aspects of the Game are AI-Generated without proper labelling?\nNot really doing the Community much service with that one.\n\nAlso, we´re just not gonna talk about how overse><ualised some of this shi is...\nBut it is (:\n\nI think it´s kind of a shame that there are so many things wrong with this game,\nbecause the Gameplay honestly does feel smooth, but it just doesn´t feel like this game was made for the Gameplay.\n\nSo yeah this Game will probably not see more than 8-20 hours of Gametime in my life,\nunless the Developer starts actually focusing on selling me the Gameplay\ninstead of trying to see how many menus I´m willing to click through to get some skins.\n\nAlso stop using fricking AI,\nthere is a large community out there and people WILL do cheap work to get a Game kickstarted if you just ask right.\nYou can always pay someone once the Game finds financial success afterwards and I believe\nsome artists bet on it that way since they already get so little work anyways.\n\nSo please man, stop killing our planet with sh1tty AI usage,\nYou´re wasting water and electricity for something that isn´t even useful for Gameplay.\n\nPeace~",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "this game is amazing ive never had such a great experience and u should try it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3 hours of continues lag spikes, the game sends so much data results in big upload on the internet resulting in lag",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it just feels to easy, there id no challenge involved because of bots or everyone is ass at the game (prolly bots). sad but ohh well just play battlefield or cod atp, unless you like easy games, then its defo recommended",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is so fun and it is very unique, it has Gooner bait which I can overlook but it uses AI which is a unforgivable sin. >:<",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "gave up on the game within a month of release or so the changes they made to movement kind of ruined it for me. the playtest version of the movement had basically no movement penalties allowing for us tactical fps players that are into movement and creating insane clips to really express ourself in a really cool way that felt good and fun they just made the game too similar. when i played the playtest my impression of the game was that it was a different thing a different niche so to say the other tactical fps games that are thriving right now they instead made it too similar to valorant, siege or cs where you really have to focus on outplaying Ur enemies by using the utilities that you have in my opinion in this day and age where people stick to their main games like flies to shit you have to be different and attract/convert a certain group of people away from their main games they could have done that by focusing on movement making players like me have that game that we can come into and just be god like by using our movement. lets be honest here it isn't the most completive thing for a tactical shooter to have very little movement restrictions but its FUN and that's what is should be about that's what keeps players.\r\nplease devs i beg you bring back movement make a big fuzz advertise it everywhere and us \"movement players\" will come back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its an ok game but there are many others like it and the card thing gets old pretty fast",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great idea with the Shard Cards, but this game's hard to get into with all the money-grab efforts.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I kinda like the gameplay but gets old and these bots are legit dumber than ravenfield bots",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FragPunk, in my opinion, is the most innovative and the best shooter in its genre — and it’s severely underrated (except for its truly awful visual style).\n\nThat’s why it hurts so much to see that, due to online issues, the Chinese started throwing bots into matches. It’s completely ridiculous. I’d rather wait 20 minutes for a real match than spend one minute doing who-knows-what with bots.\n\nOf course, this only applies to the «quick» game mode. In ranked mode, real players are still participating — though not always, and not at all ranks. Other «arcade» modes also feature bots. And let’s not even get into the fact that not all players prefer ranked mode.\n\nIn short, I just can’t recommend this game to anyone if they’re going to end up playing against bots. The game has had online issues for a long time, but bots aren’t a solution — they’re an accelerator of the game’s demise. I almost always play in ranked mode, but even the knowledge that the second main mode has been ruined by bots is a huge demotivator.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is just tragic. The gameplay, variety of heroes, unique mechanics, etc are all refreshing and a ton of fun but the game is held back by two things:\r\n\r\nAimhacks: Alot of players are walking into flat walls for upwards of ten seconds and still lining up shots with an enemy they couldn't see coming. This isn't at a point it's really a problem yet since the instances Ive seen were really odd, but it's clear that this will become a bigger issue in the future.\r\n\r\nMonitization: There's easily 6+ different pages that keep asking for money, from the battlepass, to the shop, to the 3 different gacha pages, this game just uses EVERY chance it can to BEG you for cash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is trying so fucking hard to be interesting, it killed itself. \"We have operators with abilities! We have cards with team-wide abilities! We have a buy system! We have colors! We have containers! We have different game modes!\"\n\nFragpunk devs thought \"What if we combined every fuckin shooter into one game?\" and thought it would work.\n\nThis game is exhausting to look at and it's really disappointing bc the gameplay is pretty good. Reviews are pretty good but the player count tells all. I don't wanna play 200 hours of a game just to start understanding everything that's going on.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stay far away from this garbage. FragPunk isn't a game; it's assisted-living software for people who couldn't aim at the ocean if they fell out of a boat.\n\nIt’s embarrassing to call this title \"competitive\" when plugging in a controller basically activates a legal aim lock. While mouse and keyboard players sweat, pad players just press L2 and let the game do the dirty work. It’s not \"assist\"—it’s a built-in soft-aimbot. They melt you instantly without missing a shot, even while moving like bots.\n\nScore: 0/10. Uninstalled after three matches. An insult to competitive integrity.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game feels super hollow i've played for 160+ hours spent over 500$ and tbh i have not seen any improvements",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fun to play\r\n\r\nToo bad every single game I played had at least 1 incredibly blatant cheater and the average is 2... on my team...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game, it's just full of cheaters.\n\nOnce I got into lobbies with actual people, it was crazy how blatant the cheating was. Felt like I was playing an unmoderated game from the early 2000s.\n\nUninstalled after someone aimed in, flicked almost a full 180 at an unholy speed that also head-locks me through a wall while I was flanking, then proceeded to dip out and insta-kill me with a headshot.\n\nYes I understand the game has certain abilities that mimic wall-hacks in a fairer way, yes I'm more than confident this was not the use of said ability.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Some of the worst balance I've seen. Counterfeit has invulnerability + clone summons that can reveal your position, Dex can control his clones to do aggressive plays at functionally no cost, Chum can summon critters with the same HP as most lancers while also rushing towards you and dealing stupid damage if you don't deal with them in time. Very sniper heavy meta too, so have fun with that.\r\n\r\nStill hopping on tho.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is cool but the characters don't really offer much as the some of the top rated ones are the free characters which is cool ig (all can be unlocked in game) but i wish they did more with them then just giving them basically the baseline kit but setup slightly differently. the kit is usually (ping, blind, teleport, smoke) and it's so apparent the counter pick ability is immunity to blind cus so many characters do it (because the are no utilities in this game so they have sacrifice unique playstyles to make up for it). Now I'm saying it doesn't work or isn't satisfying but its nothing to actively choose this game over any other one. Now the nail in the coffin for me is the servers, I literally never lag but all of the sudden mid match maybe after 3 games it just freezes as in every stops and run in place and my route flapping just gradually increases every second and will not stop increasing (the game won't even recognize it ran out of time and the match is over and i have manually quit). So all in all I had fun with it for about 2 days and its on to the next.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When i first started this game i loved it, it was a better less sweaty valorant with unique ideas. now, every match wait time for me is around 15-20 minutes. RIDICULOUS. AND to top it off, they use AI for some of their art. i refuse to support that when there are so many talented artists that deserve to be recognized and/or hired. disgusting. so much potential. its too bad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst game ever, u can get banned if u got too much KD, and if u are just good at fps games ! Never spend ur time on this game !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Decently fun gameplay but matchmaking sticks you with bots OR in the current toy siege event it just matches you with nobody, I would gladly wait 10+ minutes with the game on in the background just to play with real people. People are saying even the ranked mode has bots. The game has a lot of self defeating stuff like that. Even though its strictly speaking fun to play and the actual gameplay is well designed! It is probably worth downloading but I would wait for their analysts to figure out what they're doing a bit first.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fun but there are many times where half of the lobby on both teams are bots. Just makes the game frustrating and uninteresting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played a lot of this game when it first came out and i loved it.So its honestly so depressing to come back and see how rampant cheating is. played 2 games and had people with aim hacks and walls on both my own and the enemy team and its really blatant on the kill cam (snapping on heads through walls and only headshots with unnatural robot movement). Until this game sorts out its cheating situation its not worth playing. Otherwise the game is amazing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the ranked system is terrible and even if i have 10-15 kills i still lose rank if i lose the match fix this in the next update or this is a dead game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played with a friend for a minute, quickly dropped it when we both realized it did nothing new, and couldn't focus on one thing to do. I was drawn to it from the name and theming, but from the looks of it they pulled a fortnite and are doing everything they can just to try to stay relevant. We don't need more gooner shooters, if you're desperate to feel something you could do worse and spend money on a game, but I'm sure there's better free options out there.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it just feels to easy, there id no challenge involved because of bots or everyone is ass at the game (prolly bots). sad but ohh well just play battlefield or cod atp, unless you like easy games, then its defo recommended",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "-is like those website shooter games you play in school computer class\n-owned by netease which has bad reputation\n-uses ai for art",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "was a play tester and was promised my stuff back when released logged in and lost it all",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They really fumbled the bag on this one. I could've gone pro yet barely anyone talks in this game, better yet NOBODY talks about this game AT ALL.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a terrible game. Absolute waste of time and effort with an extremely toxic player base, anti-consumer shop, ZERO free in-game currency rewards, and absolute dogsh*t game mechanics (which makes sense, because it's developed by a cheap little Chinese studio that nobody cares about). I'm glad I never spent a dime in this game, and I hope it never succeeds in the future. ABSOLUTE WASTE OF TIME AND INVESTMENT!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fragpunk is a fun, fresh take on modern FPS games. The development team took noticeable aspects from every major shooter game, and mangled them into what we have now. Fantastic graphics, detailed animations, multiple fun game modes, and a high FPS cap, this game keeps many coming back for more. While this game is fun to continue playing, it suffers from too many issues to make the game a recommendable title. \r\n\r\nThis game suffers too much from it's rewards system. Too many ways to earn rewards, too many rewards, too much happening to keep track of your rewards. Almost every aspects of the game has a reward system, and it's own menu for it. Not to mention, what feels like hundreds of other sub menus for said rewards. Rewards rewards rewards. We get it.\r\n\r\nBot fatigue is real in this game. One match may be all bots, another may be all real players. You can go from what is a \"practice match\" to real players while not switching game modes, and it's tiring. It creates too much confusion.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Uses AI slop for their artwork. Constant server issues. 15 different currencies and gambling elements. Not worth the time or the money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "to many hackers....lack of control by the devs. game is unplayable unless you have super low ping",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When I first started playing it was decent, now I only ever play with bots(terrible experience most of the time). I was already getting bored of it because of the bots, but since the recent update I'm not much of a fan, I liked the weekly and daily challenges, those are gone.\n\nI paid for Fragpunk Coins to buy the Ultimate Battle Pass which to my understanding based off of what it says is a one time purchase now you have the battle pass permanently kinda situation, but I don't have that anymore.\n\nNot only do I regret spending money on the Battle Pass I regret that I also bought a membership. I'm done with this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is genuinly the worst game ive ever played, truly awful gameplay, everyone is a smurf and its just worse knockoff valorant even though valorant sucks. just play apex or val lwk.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cel mai de cacat joc, nush cum am reusit sa-mi instalez abominatia asta",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Generic, bloated, uninspired slop. That's really all you need to know.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hear some fun and new way to play fps, but after i die i cant control my charter in next round, very serius bug",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "uses gen AI for art + overpriced cashgrab micro-transactions",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game, got a bit of a balancing issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS TERRIBLE 5 MINUTES OF WAITING TO GET INTO RANKED JUST TO BE HIT WITH EITHER HACKERS OR BOTS CARDS MAKE NO SENSE AND THE RELICS ABSOLUTE DOG WATER WORST GAME EVER DO NOT DOWNLOAD IT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "had great potential, but this game really only cares about money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lowkey kinda lame, basically a Valorant clone",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The devs definitely did a lot to try and make this a less serious/competitive game than Valorant (with plenty of modes and the gameplay having stuff like cards), but it is still at its core a tactical shooter and if you don't like tactical shooters then you likely won't enjoy this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I play it with my friends but the gameplay is kinda bad and the ui is too much and the main menu is like a mobile game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its giving Valorant vibes but with extra steps. The wild cards are totally unbalanced but its a creative concept i enjoyed :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "worst game ever. they don't listen to their player base. Continuous \"route flapping\" spikes making game unplayable, no fix dont waste your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It has been fun playing, but every match now days is either a cheater or someone who has never touched a game in their life IN PUNKMASTER. It is a fun game dont get me wrong. But sadly I'm going to down vote this until they can fix the ame breaking bugs (no dmg taken if you play broker and the hit reg)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not play this game. It's filled with bots, in a game of 10 you're lucky if 3 are real players. Completely ruins the game I would rather wait longer for matches.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "rather play csgo or valorant lol this game is joke",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game's dead\ntungtungsahur event gone",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worth non time movement on rails. 4.5/10 Arc Raiders though 7.8/10.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bots in lobbies + monitized to filth",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games lags for no reason other than that pretty fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not try, not worth your time in the slightest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blo fun za 5 ur pol pa postalo repetative af",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "could be a new nice shooter, but too casual.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "23 minutes is all it takes to see there's nothing new or original here",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game fell off so hard it doesnt even show up on my library",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Shi game, the worse than valorant",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game deleted all my data when i linked to xbox this game is terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Undisclosed use of generative AI.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "only play it because if feels like a train wreak",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "p4 cosmetics game but go play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why is tungtungtungtung sahur in this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For god sake bring Asian servers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game so good it made me uninstall it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Genetikai hulladék ahogy van valorant copi",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The best game for kids",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it was alive for 2 weeks lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its so shit dont waste your time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very very very very very very very very, dom diddy dom diddy dee dee doo LV",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dog sh1t game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad servers in iran",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "upsetting game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The worst copy of valorant and cs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TEAM TAKES FREE WARDROBE PISS ME OFF",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Where you think you hit, is not where you are hitting",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why the actual FUCK did they add brainrot",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Suck bot game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "IT DOES NOT LET ME PLAY THE GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game so bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i thought it was a TD game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "chaines game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tung tung tung sahur",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Very bad this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "didnt like it at all",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pior jogo que ja joguei na minha vida logo depois de gta 5",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit dont load",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know why is it soo hyped",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lots of bots",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doodoo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate gen AI",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Bunz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wasted potential",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cheap chinese cs knockoff",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "had potential but ai",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}