{
  "positive": [
    {
      "review": "For what the game is, I can't rate it as not recommended.\r\nIf you play this you have to have the mentality of an idler to enjoy this game. \r\nPersonally the game is not for me.\r\nThere is plenty of side content to keep you moving but its just a huge time sink to get any rewards. I hit about 58 hours of actual playtime plus not counting offline play and I reached maybe 4% of the games progression. \r\nI can't fathom sitting here any longer, just got bored.\r\nPlays a lot like the Idle game called Unnamed Space Idle, but space idle is much better IMO.\r\nIf you don't like this, give it a try",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great idle game. Takes time to get going, but once it does, its lots of fun. Multiple different mechanics at play, keeping us engaged.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun little idle game.  Dev is still improving it steadily, extending the end game further so there's still things to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hundreds of hours in, still discovering new minigames \n\nFor a free idle game, it's surprisingly keeping me interested for a loooong time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very addicting and a great game to just leave in the background",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like long idle games and grinding for upgrades then this is the one for you. When I originally started playing it had AI backgrounds, but they have since updated to not have those anymore and it looks better and I'm glad they are still updating this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hey chatters, This game is another clicker this time with 1500 achievements however thank the lord similar to cookie clicker and banana i had already done saves on this so i loaded one that was close to be finished and boom completed it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "No idea what happens here most of the time i just click things and hope for the best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "need to have a guide a little too much, but quite a fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is what an idle and offline game should be. You hop in, do your thing, get out again. It is a background game, what more can you really hope for?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really enjoying game, starts off a bit slow and less idle like. but gets better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a neat little game that is easy to play. Has lots of moving parts.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really solid idle game. It starts off slow, but once things pick up, it becomes super fun. There are plenty of different mechanics that keep you interested.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After playing Galaxy Idle Clicker for 1500 hours, here’s a comprehensive review based on long-term experience and feedback from the community:\n\nGameplay Depth & Progression\n\nThe game starts off simple but gradually reveals layers of depth, especially through its progression system where \"Black Holes\" represent major milestones. Each reset introduces new mechanics and unlocks, significantly refreshing the experience and allowing for a variety of builds and strategies as you advance further.\n\nThe later game can get quite passive—there will be stretches where progress slows dramatically, sometimes leaving you with little to do aside from waiting for the next milestone or grinding for unlocks.\n\nLate-Game Mechanics & Strategy\n\nAs you reach higher Black Holes (e.g., BH7 or BH11+), new scaling mechanics and quality-of-life upgrades become available. Optimizing your reset timing (3-hour, 6-hour, or 24-hour runs) and focusing on upgrading multipliers, inventory space, and auto-equips are critical for efficient gains.\n\nProgress becomes more linear after certain milestones, requiring longer runs for maximum return. Early-game strategies (such as frequent short resets) give way to longer, more efficient idle sessions.\n\nDamage and HP upgrades take priority in pushing further into the game, while energy upgrades and cost reduction become more effective in the very late game, but should not be heavily prioritized over multipliers and core progression mechanics.\n\nActive vs. Idle Gameplay\n\nFor most players, after 1000+ hours, the game balances between active pushes (to reach new milestones) and long idle periods (for optimal resource collection). The auto-buy and quality-of-life features, when unlocked, make the idle experience smoother and more rewarding.\n\nCommunity Feedback & Overall Experience\n\nPlayers appreciate the steady flow of new content and mechanics; the pacing is generally enjoyable, especially with the satisfaction of unlocking new features and hitting major milestones.\n\nSome minor annoyances persist, such as occasional lag and periods when there isn’t much to do except wait, but these rarely detract from the overall experience if you enjoy incremental games.\n\nSummary Pros & Cons Table\n\nPros\tCons\nDeep progression with resets and builds\tCan get passive at late stage; long idle times\nSatisfying milestones and quality-of-life upgrades\tOccasional lag; some mechanics scale poorly\nAuto features and upgrade flexibility\tProgress can stagnate, especially near new Black Holes\nEngaged community + steady updates\tMay feel repetitive after many hundreds of hours\nConclusion:\nGalaxy Idle Clicker provides a rewarding incremental experience with plenty to unlock for grinders and idle fans alike. After 1500 hours, you’ll have seen most systems, but the satisfaction in reaching new Black Holes and optimizing runs keeps it engaging for true fans of the genre. If you're happy with passive management and incremental upgrades, it remains one of the better long-term clickers out there",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "7k hours in - it's good as an idler, a few prestige layers, but not overcomplicated",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Nice background running game with 10-15 Minute interaction a day, idler in its core sense",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I highly recommend this game there is a lot to it and its all easy to understand. Best game to check in on during a busy day or just watch your ship make things go boom.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Este un joc super ca sa iti pierzi timpul, iti da satisfactia aceea ca ai evolutat de la un prestige(indiferent de tir,fie 1,2,sau 3) la altu,si mai e si free to play,recomand cu placere pentru cine cauta un joc care sa il joace 1 sau 2 pe zi",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you're not used to complicated idle games (like myself), this will take a while to gather yourself and feel prepared to play. That said, watching the numbers go up is fairly satisfying, and every boss is a reality check as to whether your ship is ready to move on to the next planet. This is also annoying, but I assume it's necessary. Regardless of this burp, I'm enjoying my time.\r\n\r\nOH. And there is a real money store, it looks very pay-to-win, so if it's really important to you to be on the leaderboard, that option exists. I will not be partaking, as I find it foolish and gross. But, it's the only truly negative thing I have to say about a game all about shooting alien ships, saving alien criminals, and mini games involving shooting meteors and saving satellites. Enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice Idle Galaxy clicker game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game to just sit back and not do any then",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Idle Game ever:\n- Long\n- A lot of achievments\n- 100% idle",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I play it from time to time. Pretty good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great way to pass the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the better idle games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finally made it to the big bang",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mesmerising time waster",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goood game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice idle game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is tuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect game to play in background",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Numbers go up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice little game to pass time with.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I feel like new system of offline is slowing me down",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game balance!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great time sink",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good but might need a few more hours to make sure",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good idle game...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a decent idle game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Decent idler game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its fine :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its not bad.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Decent idler.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Entertaining",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I will leave the cat here, so that everybody who passes by can pet it and give it a thumbs up and awards.\n　　　 　　／＞　　フ\n　　　 　　| 　_　 _ l\n　 　　 　／` ミ＿xノ\n　　 　 /　　　 　 |\n　　　 /　 ヽ　　 ﾉ\n　 　 │　　|　|　|\n　／￣|　　 |　|　|\n　| (￣ヽ＿_ヽ_)__)\n　＼二つ",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I will leave the cat here, so that everybody who passes by can pet it and give it a thumbs up and awards.\n　　　 　　／＞　　フ\n　　　 　　| 　_　 _ l\n　 　　 　／` ミ＿xノ\n　　 　 /　　　 　 |\n　　　 /　 ヽ　　 ﾉ\n　 　 │　　|　|　|\n　／￣|　　 |　|　|\n　| (￣ヽ＿_ヽ_)__)\n　＼二つ",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For what the game is, I can't rate it as not recommended.\r\nIf you play this you have to have the mentality of an idler to enjoy this game. \r\nPersonally the game is not for me.\r\nThere is plenty of side content to keep you moving but its just a huge time sink to get any rewards. I hit about 58 hours of actual playtime plus not counting offline play and I reached maybe 4% of the games progression. \r\nI can't fathom sitting here any longer, just got bored.\r\nPlays a lot like the Idle game called Unnamed Space Idle, but space idle is much better IMO.\r\nIf you don't like this, give it a try",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of those idle games similar to NGU idle or Antimatter Dimensions where the time between bigger gameplay changes is measured in weeks instead of days, so if the main game loop of progressing through stages with harder and harder enemies isn't your cup of tea, then this game isn't the best fit for you. You'll find this out in the first couple hours if you end up giving it a try.\n\nThis game borrows a lot of stuff from NGU idle that I really love like a crazy amount of stages broken apart by 3-4 eras, a cash shop that can be easily circumvented by in-game currency, and multi-layered rebirth mechanics.\n\nThe elephant in the room is the AI art. Since I'm not super opinionated on that I don't care much. The backgrounds for each stage are nice looking and the infinite nature of AI art fits the setting of space so I would say it fits the game well.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great idle game. Takes time to get going, but once it does, its lots of fun. Multiple different mechanics at play, keeping us engaged.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you're looking for an idle game to play and unlock a bunch of  stuff, look no further!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun casual clicker based game that changes the longer you play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun little idle game.  Dev is still improving it steadily, extending the end game further so there's still things to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hundreds of hours in, still discovering new minigames \n\nFor a free idle game, it's surprisingly keeping me interested for a loooong time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very addicting and a great game to just leave in the background",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like long idle games and grinding for upgrades then this is the one for you. When I originally started playing it had AI backgrounds, but they have since updated to not have those anymore and it looks better and I'm glad they are still updating this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Started as a clone of Farmers Against Potatoes Idle, ended up being much better: the pacing, the scaling, the constant shower of premium currency, it surpasses the \"original\" in every possible way.\n\nI'm approximately 80% through the current available content and the feeling of progression has been smooth and constant. Playing offline is actually worth it (it guarantees you pity for the mech upgrades so you can farm tokens easily) and the game doesn't require to be constantly opened at all time.\n\nMy only beef with the game is the antimatter meteorites that do require to be online to be farmed. Not only are they limited per supernova, they bring nothing to the table and force you to autoclick the meteorite minigame overnight for a few achievements. They should, in my opinion, be removed entirely.\n\nLast thing I want to adress: yes it looks kinda meh. But you shouldn't care. At the end of the day it's an idle game that's gonna progress when you don't look at it, if you want something good to the eye, you shouldn't really play this genre anyway. The best way to play is actually to hide the canvas (i.e. everything except the menus) and the fancy effects. Not only that's gonna make performance better and you can focus on the essential. If you don't like that approach, you should stay away from the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Game is fine but slow... If there is strategy to be had you have no respec's or way's to change your black hole runs. Once you pick your traits that's it till the next black hole. Not sure if any other choices would really speed the game up or if they're all slow.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hey chatters, This game is another clicker this time with 1500 achievements however thank the lord similar to cookie clicker and banana i had already done saves on this so i loaded one that was close to be finished and boom completed it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Galaxy Idle Clicker shows strong potential as an engaging idle experience. The core gameplay is enjoyable and well-presented, but the progression feels overly linear, which limits long-term depth and strategic involvement. A well-balanced idle game typically encourages careful resource management across multiple systems to optimize growth, yet this title currently offers only a single progression path. Additionally, resets feel underwhelming, and rebuilding progress afterward can be slow and repetitive. Despite these issues, the foundation is promising, and it will be interesting to see how the game develops with future updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple, yet surprisingly addictive! Progression feels well-paced, with plenty of upgrades to keep you engaged. A great way to unwind and watch your galaxy grow, even if you're just checking in for a few minutes at a time. Highly recommended for idle game fans.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you want to zig and zag threw planet?\nLove flying ships?\nLeave your spaceship and explore? .....\nwell this isn't it!\nBUT\nIf you like watching progression grow day!\nenjoy a relaxing games!\nmesmerized by bullet hell's!\n then this might be your game,..\n\ni played this once or twice (runs like a screensaver in the background) and i enjoy it, \nmost of the bad reviews are  people with around 1 or 2 hours crying there not top dog within the first 10mins of playing,\nthe ones complaining with higher hours mostly butch about the art style, (some never grew up with a older game graphics)\nif thats the biggest problem then i think it's doing pretty good, \n\n\n7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No idea what happens here most of the time i just click things and hope for the best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of things to unlock, and I like how they layered in minigames and reset systems",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow... where to start. I read a bunch of the negative reviews, so lets start there. \n\nFarmer Against Potato reskin: are you full blown special? Sure there are some elements from FAP, but thats what you do when designing a new game, you look at others and pull elements you like from them and apply to your game, that doesn't make a reskin, it makes it smart design progression. \n\nAI Art: Why should a small dev team pay an artist to make their game look pretty when AI can do it for free and make it look amazing? Hate to break this to you all, but AI is the way of the future, time to pack up your VHS and cassette tapes and make your way into this century boomers. \n\nMoney Pit and Time Waster: Sigh... the whole point of an idle game is to hit and forget for a few hours. Is it a time waster, yes... thats the point. If you don't want to spend money, then don't, will it take you longer sure, but money isn't required. \n\nMods Were Mean to Me: OMG... you literally posted that you know how to manipulate the game, apparently posted that you with your few dozen hours were further than others with 1000s of hours, that is literally the def of exploitation. So yes, you got called out. Next...\n\nFrom what I have seen the dev(s) try to address issues which is more than I can say for most games big and small. Is this the next big Bethesda title, no... its a fun idle game with lots of fun elements in a futuristic universe. Are there better idle games, maybe, are there worst, maybe... but this is free and fun. I don't understand how people can complain about a free game...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "need to have a guide a little too much, but quite a fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is great idler game with lots achievements.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It is what an idle and offline game should be. You hop in, do your thing, get out again. It is a background game, what more can you really hope for?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really enjoying game, starts off a bit slow and less idle like. but gets better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a neat little game that is easy to play. Has lots of moving parts.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really solid idle game. It starts off slow, but once things pick up, it becomes super fun. There are plenty of different mechanics that keep you interested.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After playing Galaxy Idle Clicker for 1500 hours, here’s a comprehensive review based on long-term experience and feedback from the community:\n\nGameplay Depth & Progression\n\nThe game starts off simple but gradually reveals layers of depth, especially through its progression system where \"Black Holes\" represent major milestones. Each reset introduces new mechanics and unlocks, significantly refreshing the experience and allowing for a variety of builds and strategies as you advance further.\n\nThe later game can get quite passive—there will be stretches where progress slows dramatically, sometimes leaving you with little to do aside from waiting for the next milestone or grinding for unlocks.\n\nLate-Game Mechanics & Strategy\n\nAs you reach higher Black Holes (e.g., BH7 or BH11+), new scaling mechanics and quality-of-life upgrades become available. Optimizing your reset timing (3-hour, 6-hour, or 24-hour runs) and focusing on upgrading multipliers, inventory space, and auto-equips are critical for efficient gains.\n\nProgress becomes more linear after certain milestones, requiring longer runs for maximum return. Early-game strategies (such as frequent short resets) give way to longer, more efficient idle sessions.\n\nDamage and HP upgrades take priority in pushing further into the game, while energy upgrades and cost reduction become more effective in the very late game, but should not be heavily prioritized over multipliers and core progression mechanics.\n\nActive vs. Idle Gameplay\n\nFor most players, after 1000+ hours, the game balances between active pushes (to reach new milestones) and long idle periods (for optimal resource collection). The auto-buy and quality-of-life features, when unlocked, make the idle experience smoother and more rewarding.\n\nCommunity Feedback & Overall Experience\n\nPlayers appreciate the steady flow of new content and mechanics; the pacing is generally enjoyable, especially with the satisfaction of unlocking new features and hitting major milestones.\n\nSome minor annoyances persist, such as occasional lag and periods when there isn’t much to do except wait, but these rarely detract from the overall experience if you enjoy incremental games.\n\nSummary Pros & Cons Table\n\nPros\tCons\nDeep progression with resets and builds\tCan get passive at late stage; long idle times\nSatisfying milestones and quality-of-life upgrades\tOccasional lag; some mechanics scale poorly\nAuto features and upgrade flexibility\tProgress can stagnate, especially near new Black Holes\nEngaged community + steady updates\tMay feel repetitive after many hundreds of hours\nConclusion:\nGalaxy Idle Clicker provides a rewarding incremental experience with plenty to unlock for grinders and idle fans alike. After 1500 hours, you’ll have seen most systems, but the satisfaction in reaching new Black Holes and optimizing runs keeps it engaging for true fans of the genre. If you're happy with passive management and incremental upgrades, it remains one of the better long-term clickers out there",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "7k hours in - it's good as an idler, a few prestige layers, but not overcomplicated",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Nice background running game with 10-15 Minute interaction a day, idler in its core sense",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I highly recommend this game there is a lot to it and its all easy to understand. Best game to check in on during a busy day or just watch your ship make things go boom.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Este un joc super ca sa iti pierzi timpul, iti da satisfactia aceea ca ai evolutat de la un prestige(indiferent de tir,fie 1,2,sau 3) la altu,si mai e si free to play,recomand cu placere pentru cine cauta un joc care sa il joace 1 sau 2 pe zi",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you're not used to complicated idle games (like myself), this will take a while to gather yourself and feel prepared to play. That said, watching the numbers go up is fairly satisfying, and every boss is a reality check as to whether your ship is ready to move on to the next planet. This is also annoying, but I assume it's necessary. Regardless of this burp, I'm enjoying my time.\r\n\r\nOH. And there is a real money store, it looks very pay-to-win, so if it's really important to you to be on the leaderboard, that option exists. I will not be partaking, as I find it foolish and gross. But, it's the only truly negative thing I have to say about a game all about shooting alien ships, saving alien criminals, and mini games involving shooting meteors and saving satellites. Enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "เวลาได้สูญเสียไปในแต่ละวัน ร่างกายกูเป็นอะไรไปเนี่ย",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall a great idle game!  There's a few bumps in the progression curve that feel slow, but these get smoothed out on subsequent runs during the second tier of prestige (Supernova).\n\nThe microtransactions/boosts are big jumps early on and can feel forced when you hit your first speedbumps, but they are in no way mandatory.  Unlike most games which feed you a ton of free premium currency up front then slow down to a drip feed, this one actually gives you significantly more as time goes on.  When you hit the Supernova prestige level, your quest progress resets, which means you're able to claim all the premium currency quests again during your next Supernova, and you're able to complete them much faster (and get more of them) due to the boosts you gained.\n\nDon't forget to check the Steam discussions or Discord for promo codes that will give you more free premium currency, it can get you a couple early QoL upgrades!\n\nUpdate: Closing in on the Big Bang prestige layer and still feeling great about the game.  The amount of antimatter (\"premium\" currency) you get from quests still feels generous, and the fact that you can claim them again when you Supernova means each time you hit that prestige layer you are able to buy a ton of either QoL or multiplier boosting upgrades.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The raw size of this game is INSANE. But also the depth of all the gameplay mechanics and how they coresponce with one another... I got no words, just wow. \n\nNow if you are intrested in starting this crazy space adventure I do want to point out that the beginning is painfully slow. Like REALLY SLOW. There is a reason why only 25% ish of all players (according to steam's achivments) have gotten to were I am. And I understand why because I was ready to give up to. \nHappy I didn't. \n\nWith that being said, the human who made this game is a genius. No doubt!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is definitely one of the games of all time. It has mechanics in this game and using them to interact with the game can get you progress. Make sure to play and you will make it further! I have made it far, but I have a far way to go. One of the things is to keep doing it and not ever even if it is. Dont save your antimatter up too much, but be sure to spend is wisely! Do I get anti matter for a good review? <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really good LONG-TERM idle game. You'll need to play for hundreds of days to see all the game has to offer. If you like huge grindy idle games that you'll run forever in the background this is for you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a really fun idle game ... more depth becomes available as you get deeper into the game.  Nice balance of leave it alone and reset mechanics and mini games to keep you engaged.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This clicker game becomes more idle the longer you play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice Idle Galaxy clicker game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game to just sit back and not do any then",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im like 1900 hours in and my like save file corrupted and the discord helped me like right away to fix it! im very happy it worked!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extreemly addictive ... can't ... stop... playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Idle Game ever:\n- Long\n- A lot of achievments\n- 100% idle",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I play it from time to time. Pretty good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great for passing the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great way to pass the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the better idle games",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The graphics are awful which is a given since it's AI and the UI is so confusing I'm often lost in menus.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TL;DR\nYes there is AI art, no there isn't much of it, yes the game is probably a waste of your time, no I don't think the goal is to get you to buy MTX.\n\nThis game just reeks, and I can't quite place my finger on why. While the AI stuff or the microtransactions are an obvious boogeyman, I don't think either of those things are necessarily deal breakers for games. For one, the majority of the art in this game is obviously purchased assets, and while AI \"art\" is reprehensible in nearly every possible way, it's use seems to mostly be the tutorial gremlins or other alien things, meaning that it's really just a small part of this game. The weird mismatched assets are a far bigger problem. \n\nOn the MTX, I don't believe that Free to Play idle games can't have a premium currency. Some of the greatest Idlers out there, most notably Idling to Rule the Gods and NGU Idle, have premium currencies. The difference between a greedy MTX whore and a great game with optional payments to support the devs and help you along is that you can earn the premium currency through normal gameplay at a reasonable rate, which this game does seem to have if the people who stuck around are to be believed, or where the premium currency is just outright unnecessary.\n\nNo, my problem with this game is something that can really only be described as an intuition that I'm being led along. The mechanics of the game seem competent, if a bit uninspired. The game being really really long is not necessarily problematic, as the aforementioned greats prove. The content I never made it to seems neat. But everything that this game does just makes me feel like I'm being strung along. Not even to get my wallet, more like a cruel joke.\n\nOverall, I just don't trust this game not to waste my time, and unless you really love what you see in the first 2 or so hours, I'd hazard that you just stay away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Didn't need to play it much. FAPI in space. Pretty much same UI late out and all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For a supposed idler there's way too much active involvement required.\r\nUp to 10 seconds of wait time whenever you finish an area. If you're repeating the area to farm resource you can skip the wait time by clicking a button, progressing to the next area however makes the wait time mandatory.\r\nThe meteorite minigame starts off on a 15 minutes cooldown, as does the special meteorite on the main screen. So you better collect those as soon as available to keep the timer ticking or you lose out on plenty of resource.\r\nItem inventory starts out with only 5 slots and items have to be clicked to equipped.\r\n\r\nWhile all of that can be automated through unlocks for premium currency, the amount of currency you earn in the game, especially early on, is so minuscule that if you don't have money to burn best prepare to spent several hundreds of hours to just turn this supposed idler into an actual idler.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Looked like fun, as basic as idle games get, Will not be loading the game back up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pass.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The developer declared war on evil dirty cheaters and put in a White Screen of Death that blocks gameplay. Unfortunately the system is so aggressive that even non-cheaters can get it if it feels like you're progressing too much. I haven't cheated a single thing but twice now I've gotten the White Screen just for having the audacity of leaving the game running for a few days.\r\n\r\nPlenty of Idlers out there that don't have jerk developers. Skip this one",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "The gameplay is fine but the UI is ugly and the entire game uses AI generated graphics that is a complete turn off for clanker haters such as myself",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "Fairly mid-tier incremental game, fairly shallow mechanics that don't offer meaningful choices, there's no strategy to apply beyond a couple of the mechanics having some degree of trade-off between building your economy or building your rewards, but even there the long-term economic play appears fairly obviously superior as the more immediate rewards don't improve anything that's a genuine bottleneck to progress.\r\n\r\nSystems don't interact with each other to any real degree, mostly each system has a \"boost itself\" economic set of upgrades, and a \"boost the main game attributes\" set of reward upgrades, and sometimes another screen of \"boost another system's self boosts or main game boosts\", it's all just \"currency in, percentage boost to something out\" with different currencies. Your choice is a largely irrelevant choice of what order to get upgrades in... which largely affects nothing: given a choice between two upgrades at the same price tier, the advantage one will give you in the time it takes you to afford the other is negligible, so there's no point in specialising horizontally, and both are affordable before you can afford anything of the next tier, so there's no point in specialising vertically.\r\n\r\nEVERY system is like this, except for the paid-for currency, where the free amounts you earn are small enough to force you to choose and save... but then there's nearly always one vastly superior choice to make at any given time, which is usually \"automating the last feature you unlocked\".\r\n\r\nThere's a lot of content here, so very very many upgrades and achievements, but there's no gameplay. Once you've played the first few lightyear resets by hour 4 or whatever, you've basically seen everything there is to see for the next 600+ hours.\r\n\r\nIt's not bad, it's just \"not good\" either, and it's a bit of a resource hog compared to other idle games if I'm honest.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "progress is far too slow in this idle game. usually the end game tends to be slugish and slow, but if its this slow at the start already, i dont want to see how it ends",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the slowest semi-active idle game where you repeat the same actions every 3 hours, while having to check on the game every 15 minutes if you really want to progress, for forever.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The mechanics are acceptable at best. Everybody is critical about how expensive the microtransactions are but that's not the biggest problem with this game. The biggest issue is the huge waste of time the game is. Every time you beat a stage it's a 10 second delay to start the next stage, starting a new prestige you can clear the stage in 4-5 seconds, when you are at your farm level you can clear those stages in about 20 seconds. Even at your farm level when you clear it it's a 10 second wait to \"find more enemies\". This means that well over 1/3 of the time you have this game running is absolutely wasted no resources no xp just dead time. What is the point of an idle game where you get no credit for idling. Another huge problem with it is that even with the skip chance upgrade it takes hours to get back to your farm stage even at the early part of the game. Who wants to sit there and have over 30 percent of there time wasted. Dev needs to implement some kind of system that if you kill the wave within a certain amount of time you auto fly to the next. Until something like that happens, cant recommend a game where you get nothing for playing the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Grindy. You'll burn a ton of electricity if trying to be active with this game. It's probably okay for those that don't care whether they progress or see anything different for weeks. 24 hour + runs should be expected.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Extremely pay to win, with mobile phone game level of micro-transaction pricing. To make matters worse, even if you do pay to win, the time frames required to progress are still obscene; it takes literal months of real time to make any meaningful jumps in progression, and likely a few years to reach the end game. The time (and date) issue can of course can be alleviated by a method in which all players of idle games will be aware of. However, the discord and the steam forums are full of very prideful and arrogant moderators, if you dare suggest that you are further along in the game than them, they will censor and cheater tag you.\n\nSave yourself the frustration and just give it a miss.\n\nEdit: It is funny, after having my comments deleted, and now being banned/removed from the discord, their lapdogs are coming to comment on this review. Get censored xD.\n\nFurther Edit: This is a single player idle game. Advancing the system clock is hardly 'cheating' as I am not gaining an unfair advantage over anyone. Good luck trying to get to the end game as a free to play player, you will have an extremely rough time. As a F2P you can probably quadruple my previous estimates to get to the end game, making the game even more excruciatingly slow. Pass.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The graphics are awful which is a given since it's AI and the UI is so confusing I'm often lost in menus.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Even if you removed the AI assets the interface is still HORRIBLE to look at - This game is boldly going nowhere",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Farmer against potatoes clone and it's not even close to subtle about it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TL;DR\nYes there is AI art, no there isn't much of it, yes the game is probably a waste of your time, no I don't think the goal is to get you to buy MTX.\n\nThis game just reeks, and I can't quite place my finger on why. While the AI stuff or the microtransactions are an obvious boogeyman, I don't think either of those things are necessarily deal breakers for games. For one, the majority of the art in this game is obviously purchased assets, and while AI \"art\" is reprehensible in nearly every possible way, it's use seems to mostly be the tutorial gremlins or other alien things, meaning that it's really just a small part of this game. The weird mismatched assets are a far bigger problem. \n\nOn the MTX, I don't believe that Free to Play idle games can't have a premium currency. Some of the greatest Idlers out there, most notably Idling to Rule the Gods and NGU Idle, have premium currencies. The difference between a greedy MTX whore and a great game with optional payments to support the devs and help you along is that you can earn the premium currency through normal gameplay at a reasonable rate, which this game does seem to have if the people who stuck around are to be believed, or where the premium currency is just outright unnecessary.\n\nNo, my problem with this game is something that can really only be described as an intuition that I'm being led along. The mechanics of the game seem competent, if a bit uninspired. The game being really really long is not necessarily problematic, as the aforementioned greats prove. The content I never made it to seems neat. But everything that this game does just makes me feel like I'm being strung along. Not even to get my wallet, more like a cruel joke.\n\nOverall, I just don't trust this game not to waste my time, and unless you really love what you see in the first 2 or so hours, I'd hazard that you just stay away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overreliance on AI for in-game assets. Even crappy developer art would be better. The point is to make it visibly clear and obvious that there is genuine passion put into the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its a idle clicker, so where in the fuck is the idle clicker part? you just move side to side, you don't even need to click you can just hold it down",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Didn't need to play it much. FAPI in space. Pretty much same UI late out and all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For a supposed idler there's way too much active involvement required.\r\nUp to 10 seconds of wait time whenever you finish an area. If you're repeating the area to farm resource you can skip the wait time by clicking a button, progressing to the next area however makes the wait time mandatory.\r\nThe meteorite minigame starts off on a 15 minutes cooldown, as does the special meteorite on the main screen. So you better collect those as soon as available to keep the timer ticking or you lose out on plenty of resource.\r\nItem inventory starts out with only 5 slots and items have to be clicked to equipped.\r\n\r\nWhile all of that can be automated through unlocks for premium currency, the amount of currency you earn in the game, especially early on, is so minuscule that if you don't have money to burn best prepare to spent several hundreds of hours to just turn this supposed idler into an actual idler.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Looked like fun, as basic as idle games get, Will not be loading the game back up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is very basic, simple idle game with a few critical flaws you can conveniently pay to get rid of. Either dish out couple hundred bucks for the QOL upgrades or suffer through weeks if not months of babysitting the game without any real consequence. \n\nThe AI art is hit or miss, mostly decent enough not to care but sometimes just awful \"AI slop\" \n\nOtherwise the game is decent enough but nothing special. Not past the initial struggle phase but after that it seems like check in once a day, number go up, reset. Already you I can see that there will be no meaningful strategy or decision making. Got a problem? Idle some more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game lacks the endorphine spiral, you spend ages in the beginning and when some automation comes to use it gets so boring and slow. and i have the feeling the developers wanna force you to buy antimatter, or leave the game running 24/7 for 50 years.\r\nnot recommended",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI filled mediocre idle slop",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "baad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pass.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The developer declared war on evil dirty cheaters and put in a White Screen of Death that blocks gameplay. Unfortunately the system is so aggressive that even non-cheaters can get it if it feels like you're progressing too much. I haven't cheated a single thing but twice now I've gotten the White Screen just for having the audacity of leaving the game running for a few days.\r\n\r\nPlenty of Idlers out there that don't have jerk developers. Skip this one",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "The gameplay is fine but the UI is ugly and the entire game uses AI generated graphics that is a complete turn off for clanker haters such as myself",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "Fairly mid-tier incremental game, fairly shallow mechanics that don't offer meaningful choices, there's no strategy to apply beyond a couple of the mechanics having some degree of trade-off between building your economy or building your rewards, but even there the long-term economic play appears fairly obviously superior as the more immediate rewards don't improve anything that's a genuine bottleneck to progress.\r\n\r\nSystems don't interact with each other to any real degree, mostly each system has a \"boost itself\" economic set of upgrades, and a \"boost the main game attributes\" set of reward upgrades, and sometimes another screen of \"boost another system's self boosts or main game boosts\", it's all just \"currency in, percentage boost to something out\" with different currencies. Your choice is a largely irrelevant choice of what order to get upgrades in... which largely affects nothing: given a choice between two upgrades at the same price tier, the advantage one will give you in the time it takes you to afford the other is negligible, so there's no point in specialising horizontally, and both are affordable before you can afford anything of the next tier, so there's no point in specialising vertically.\r\n\r\nEVERY system is like this, except for the paid-for currency, where the free amounts you earn are small enough to force you to choose and save... but then there's nearly always one vastly superior choice to make at any given time, which is usually \"automating the last feature you unlocked\".\r\n\r\nThere's a lot of content here, so very very many upgrades and achievements, but there's no gameplay. Once you've played the first few lightyear resets by hour 4 or whatever, you've basically seen everything there is to see for the next 600+ hours.\r\n\r\nIt's not bad, it's just \"not good\" either, and it's a bit of a resource hog compared to other idle games if I'm honest.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "progress is far too slow in this idle game. usually the end game tends to be slugish and slow, but if its this slow at the start already, i dont want to see how it ends",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the slowest semi-active idle game where you repeat the same actions every 3 hours, while having to check on the game every 15 minutes if you really want to progress, for forever.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The mechanics are acceptable at best. Everybody is critical about how expensive the microtransactions are but that's not the biggest problem with this game. The biggest issue is the huge waste of time the game is. Every time you beat a stage it's a 10 second delay to start the next stage, starting a new prestige you can clear the stage in 4-5 seconds, when you are at your farm level you can clear those stages in about 20 seconds. Even at your farm level when you clear it it's a 10 second wait to \"find more enemies\". This means that well over 1/3 of the time you have this game running is absolutely wasted no resources no xp just dead time. What is the point of an idle game where you get no credit for idling. Another huge problem with it is that even with the skip chance upgrade it takes hours to get back to your farm stage even at the early part of the game. Who wants to sit there and have over 30 percent of there time wasted. Dev needs to implement some kind of system that if you kill the wave within a certain amount of time you auto fly to the next. Until something like that happens, cant recommend a game where you get nothing for playing the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Grindy. You'll burn a ton of electricity if trying to be active with this game. It's probably okay for those that don't care whether they progress or see anything different for weeks. 24 hour + runs should be expected.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Extremely pay to win, with mobile phone game level of micro-transaction pricing. To make matters worse, even if you do pay to win, the time frames required to progress are still obscene; it takes literal months of real time to make any meaningful jumps in progression, and likely a few years to reach the end game. The time (and date) issue can of course can be alleviated by a method in which all players of idle games will be aware of. However, the discord and the steam forums are full of very prideful and arrogant moderators, if you dare suggest that you are further along in the game than them, they will censor and cheater tag you.\n\nSave yourself the frustration and just give it a miss.\n\nEdit: It is funny, after having my comments deleted, and now being banned/removed from the discord, their lapdogs are coming to comment on this review. Get censored xD.\n\nFurther Edit: This is a single player idle game. Advancing the system clock is hardly 'cheating' as I am not gaining an unfair advantage over anyone. Good luck trying to get to the end game as a free to play player, you will have an extremely rough time. As a F2P you can probably quadruple my previous estimates to get to the end game, making the game even more excruciatingly slow. Pass.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The graphics are awful which is a given since it's AI and the UI is so confusing I'm often lost in menus.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Even if you removed the AI assets the interface is still HORRIBLE to look at - This game is boldly going nowhere",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Farmer against potatoes clone and it's not even close to subtle about it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TL;DR\nYes there is AI art, no there isn't much of it, yes the game is probably a waste of your time, no I don't think the goal is to get you to buy MTX.\n\nThis game just reeks, and I can't quite place my finger on why. While the AI stuff or the microtransactions are an obvious boogeyman, I don't think either of those things are necessarily deal breakers for games. For one, the majority of the art in this game is obviously purchased assets, and while AI \"art\" is reprehensible in nearly every possible way, it's use seems to mostly be the tutorial gremlins or other alien things, meaning that it's really just a small part of this game. The weird mismatched assets are a far bigger problem. \n\nOn the MTX, I don't believe that Free to Play idle games can't have a premium currency. Some of the greatest Idlers out there, most notably Idling to Rule the Gods and NGU Idle, have premium currencies. The difference between a greedy MTX whore and a great game with optional payments to support the devs and help you along is that you can earn the premium currency through normal gameplay at a reasonable rate, which this game does seem to have if the people who stuck around are to be believed, or where the premium currency is just outright unnecessary.\n\nNo, my problem with this game is something that can really only be described as an intuition that I'm being led along. The mechanics of the game seem competent, if a bit uninspired. The game being really really long is not necessarily problematic, as the aforementioned greats prove. The content I never made it to seems neat. But everything that this game does just makes me feel like I'm being strung along. Not even to get my wallet, more like a cruel joke.\n\nOverall, I just don't trust this game not to waste my time, and unless you really love what you see in the first 2 or so hours, I'd hazard that you just stay away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overreliance on AI for in-game assets. Even crappy developer art would be better. The point is to make it visibly clear and obvious that there is genuine passion put into the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its a idle clicker, so where in the fuck is the idle clicker part? you just move side to side, you don't even need to click you can just hold it down",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Didn't need to play it much. FAPI in space. Pretty much same UI late out and all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For a supposed idler there's way too much active involvement required.\r\nUp to 10 seconds of wait time whenever you finish an area. If you're repeating the area to farm resource you can skip the wait time by clicking a button, progressing to the next area however makes the wait time mandatory.\r\nThe meteorite minigame starts off on a 15 minutes cooldown, as does the special meteorite on the main screen. So you better collect those as soon as available to keep the timer ticking or you lose out on plenty of resource.\r\nItem inventory starts out with only 5 slots and items have to be clicked to equipped.\r\n\r\nWhile all of that can be automated through unlocks for premium currency, the amount of currency you earn in the game, especially early on, is so minuscule that if you don't have money to burn best prepare to spent several hundreds of hours to just turn this supposed idler into an actual idler.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Looked like fun, as basic as idle games get, Will not be loading the game back up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is very basic, simple idle game with a few critical flaws you can conveniently pay to get rid of. Either dish out couple hundred bucks for the QOL upgrades or suffer through weeks if not months of babysitting the game without any real consequence. \n\nThe AI art is hit or miss, mostly decent enough not to care but sometimes just awful \"AI slop\" \n\nOtherwise the game is decent enough but nothing special. Not past the initial struggle phase but after that it seems like check in once a day, number go up, reset. Already you I can see that there will be no meaningful strategy or decision making. Got a problem? Idle some more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game lacks the endorphine spiral, you spend ages in the beginning and when some automation comes to use it gets so boring and slow. and i have the feeling the developers wanna force you to buy antimatter, or leave the game running 24/7 for 50 years.\r\nnot recommended",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI filled mediocre idle slop",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "baad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pass.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The developer declared war on evil dirty cheaters and put in a White Screen of Death that blocks gameplay. Unfortunately the system is so aggressive that even non-cheaters can get it if it feels like you're progressing too much. I haven't cheated a single thing but twice now I've gotten the White Screen just for having the audacity of leaving the game running for a few days.\r\n\r\nPlenty of Idlers out there that don't have jerk developers. Skip this one",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "The gameplay is fine but the UI is ugly and the entire game uses AI generated graphics that is a complete turn off for clanker haters such as myself",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "Fairly mid-tier incremental game, fairly shallow mechanics that don't offer meaningful choices, there's no strategy to apply beyond a couple of the mechanics having some degree of trade-off between building your economy or building your rewards, but even there the long-term economic play appears fairly obviously superior as the more immediate rewards don't improve anything that's a genuine bottleneck to progress.\r\n\r\nSystems don't interact with each other to any real degree, mostly each system has a \"boost itself\" economic set of upgrades, and a \"boost the main game attributes\" set of reward upgrades, and sometimes another screen of \"boost another system's self boosts or main game boosts\", it's all just \"currency in, percentage boost to something out\" with different currencies. Your choice is a largely irrelevant choice of what order to get upgrades in... which largely affects nothing: given a choice between two upgrades at the same price tier, the advantage one will give you in the time it takes you to afford the other is negligible, so there's no point in specialising horizontally, and both are affordable before you can afford anything of the next tier, so there's no point in specialising vertically.\r\n\r\nEVERY system is like this, except for the paid-for currency, where the free amounts you earn are small enough to force you to choose and save... but then there's nearly always one vastly superior choice to make at any given time, which is usually \"automating the last feature you unlocked\".\r\n\r\nThere's a lot of content here, so very very many upgrades and achievements, but there's no gameplay. Once you've played the first few lightyear resets by hour 4 or whatever, you've basically seen everything there is to see for the next 600+ hours.\r\n\r\nIt's not bad, it's just \"not good\" either, and it's a bit of a resource hog compared to other idle games if I'm honest.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "progress is far too slow in this idle game. usually the end game tends to be slugish and slow, but if its this slow at the start already, i dont want to see how it ends",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the slowest semi-active idle game where you repeat the same actions every 3 hours, while having to check on the game every 15 minutes if you really want to progress, for forever.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The mechanics are acceptable at best. Everybody is critical about how expensive the microtransactions are but that's not the biggest problem with this game. The biggest issue is the huge waste of time the game is. Every time you beat a stage it's a 10 second delay to start the next stage, starting a new prestige you can clear the stage in 4-5 seconds, when you are at your farm level you can clear those stages in about 20 seconds. Even at your farm level when you clear it it's a 10 second wait to \"find more enemies\". This means that well over 1/3 of the time you have this game running is absolutely wasted no resources no xp just dead time. What is the point of an idle game where you get no credit for idling. Another huge problem with it is that even with the skip chance upgrade it takes hours to get back to your farm stage even at the early part of the game. Who wants to sit there and have over 30 percent of there time wasted. Dev needs to implement some kind of system that if you kill the wave within a certain amount of time you auto fly to the next. Until something like that happens, cant recommend a game where you get nothing for playing the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Grindy. You'll burn a ton of electricity if trying to be active with this game. It's probably okay for those that don't care whether they progress or see anything different for weeks. 24 hour + runs should be expected.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Extremely pay to win, with mobile phone game level of micro-transaction pricing. To make matters worse, even if you do pay to win, the time frames required to progress are still obscene; it takes literal months of real time to make any meaningful jumps in progression, and likely a few years to reach the end game. The time (and date) issue can of course can be alleviated by a method in which all players of idle games will be aware of. However, the discord and the steam forums are full of very prideful and arrogant moderators, if you dare suggest that you are further along in the game than them, they will censor and cheater tag you.\n\nSave yourself the frustration and just give it a miss.\n\nEdit: It is funny, after having my comments deleted, and now being banned/removed from the discord, their lapdogs are coming to comment on this review. Get censored xD.\n\nFurther Edit: This is a single player idle game. Advancing the system clock is hardly 'cheating' as I am not gaining an unfair advantage over anyone. Good luck trying to get to the end game as a free to play player, you will have an extremely rough time. As a F2P you can probably quadruple my previous estimates to get to the end game, making the game even more excruciatingly slow. Pass.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The graphics are awful which is a given since it's AI and the UI is so confusing I'm often lost in menus.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Even if you removed the AI assets the interface is still HORRIBLE to look at - This game is boldly going nowhere",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Farmer against potatoes clone and it's not even close to subtle about it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TL;DR\nYes there is AI art, no there isn't much of it, yes the game is probably a waste of your time, no I don't think the goal is to get you to buy MTX.\n\nThis game just reeks, and I can't quite place my finger on why. While the AI stuff or the microtransactions are an obvious boogeyman, I don't think either of those things are necessarily deal breakers for games. For one, the majority of the art in this game is obviously purchased assets, and while AI \"art\" is reprehensible in nearly every possible way, it's use seems to mostly be the tutorial gremlins or other alien things, meaning that it's really just a small part of this game. The weird mismatched assets are a far bigger problem. \n\nOn the MTX, I don't believe that Free to Play idle games can't have a premium currency. Some of the greatest Idlers out there, most notably Idling to Rule the Gods and NGU Idle, have premium currencies. The difference between a greedy MTX whore and a great game with optional payments to support the devs and help you along is that you can earn the premium currency through normal gameplay at a reasonable rate, which this game does seem to have if the people who stuck around are to be believed, or where the premium currency is just outright unnecessary.\n\nNo, my problem with this game is something that can really only be described as an intuition that I'm being led along. The mechanics of the game seem competent, if a bit uninspired. The game being really really long is not necessarily problematic, as the aforementioned greats prove. The content I never made it to seems neat. But everything that this game does just makes me feel like I'm being strung along. Not even to get my wallet, more like a cruel joke.\n\nOverall, I just don't trust this game not to waste my time, and unless you really love what you see in the first 2 or so hours, I'd hazard that you just stay away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overreliance on AI for in-game assets. Even crappy developer art would be better. The point is to make it visibly clear and obvious that there is genuine passion put into the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its a idle clicker, so where in the fuck is the idle clicker part? you just move side to side, you don't even need to click you can just hold it down",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Didn't need to play it much. FAPI in space. Pretty much same UI late out and all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For a supposed idler there's way too much active involvement required.\r\nUp to 10 seconds of wait time whenever you finish an area. If you're repeating the area to farm resource you can skip the wait time by clicking a button, progressing to the next area however makes the wait time mandatory.\r\nThe meteorite minigame starts off on a 15 minutes cooldown, as does the special meteorite on the main screen. So you better collect those as soon as available to keep the timer ticking or you lose out on plenty of resource.\r\nItem inventory starts out with only 5 slots and items have to be clicked to equipped.\r\n\r\nWhile all of that can be automated through unlocks for premium currency, the amount of currency you earn in the game, especially early on, is so minuscule that if you don't have money to burn best prepare to spent several hundreds of hours to just turn this supposed idler into an actual idler.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Looked like fun, as basic as idle games get, Will not be loading the game back up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is very basic, simple idle game with a few critical flaws you can conveniently pay to get rid of. Either dish out couple hundred bucks for the QOL upgrades or suffer through weeks if not months of babysitting the game without any real consequence. \n\nThe AI art is hit or miss, mostly decent enough not to care but sometimes just awful \"AI slop\" \n\nOtherwise the game is decent enough but nothing special. Not past the initial struggle phase but after that it seems like check in once a day, number go up, reset. Already you I can see that there will be no meaningful strategy or decision making. Got a problem? Idle some more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game lacks the endorphine spiral, you spend ages in the beginning and when some automation comes to use it gets so boring and slow. and i have the feeling the developers wanna force you to buy antimatter, or leave the game running 24/7 for 50 years.\r\nnot recommended",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI filled mediocre idle slop",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "baad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pass.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The developer declared war on evil dirty cheaters and put in a White Screen of Death that blocks gameplay. Unfortunately the system is so aggressive that even non-cheaters can get it if it feels like you're progressing too much. I haven't cheated a single thing but twice now I've gotten the White Screen just for having the audacity of leaving the game running for a few days.\r\n\r\nPlenty of Idlers out there that don't have jerk developers. Skip this one",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "The gameplay is fine but the UI is ugly and the entire game uses AI generated graphics that is a complete turn off for clanker haters such as myself",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "Fairly mid-tier incremental game, fairly shallow mechanics that don't offer meaningful choices, there's no strategy to apply beyond a couple of the mechanics having some degree of trade-off between building your economy or building your rewards, but even there the long-term economic play appears fairly obviously superior as the more immediate rewards don't improve anything that's a genuine bottleneck to progress.\r\n\r\nSystems don't interact with each other to any real degree, mostly each system has a \"boost itself\" economic set of upgrades, and a \"boost the main game attributes\" set of reward upgrades, and sometimes another screen of \"boost another system's self boosts or main game boosts\", it's all just \"currency in, percentage boost to something out\" with different currencies. Your choice is a largely irrelevant choice of what order to get upgrades in... which largely affects nothing: given a choice between two upgrades at the same price tier, the advantage one will give you in the time it takes you to afford the other is negligible, so there's no point in specialising horizontally, and both are affordable before you can afford anything of the next tier, so there's no point in specialising vertically.\r\n\r\nEVERY system is like this, except for the paid-for currency, where the free amounts you earn are small enough to force you to choose and save... but then there's nearly always one vastly superior choice to make at any given time, which is usually \"automating the last feature you unlocked\".\r\n\r\nThere's a lot of content here, so very very many upgrades and achievements, but there's no gameplay. Once you've played the first few lightyear resets by hour 4 or whatever, you've basically seen everything there is to see for the next 600+ hours.\r\n\r\nIt's not bad, it's just \"not good\" either, and it's a bit of a resource hog compared to other idle games if I'm honest.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "progress is far too slow in this idle game. usually the end game tends to be slugish and slow, but if its this slow at the start already, i dont want to see how it ends",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the slowest semi-active idle game where you repeat the same actions every 3 hours, while having to check on the game every 15 minutes if you really want to progress, for forever.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The mechanics are acceptable at best. Everybody is critical about how expensive the microtransactions are but that's not the biggest problem with this game. The biggest issue is the huge waste of time the game is. Every time you beat a stage it's a 10 second delay to start the next stage, starting a new prestige you can clear the stage in 4-5 seconds, when you are at your farm level you can clear those stages in about 20 seconds. Even at your farm level when you clear it it's a 10 second wait to \"find more enemies\". This means that well over 1/3 of the time you have this game running is absolutely wasted no resources no xp just dead time. What is the point of an idle game where you get no credit for idling. Another huge problem with it is that even with the skip chance upgrade it takes hours to get back to your farm stage even at the early part of the game. Who wants to sit there and have over 30 percent of there time wasted. Dev needs to implement some kind of system that if you kill the wave within a certain amount of time you auto fly to the next. Until something like that happens, cant recommend a game where you get nothing for playing the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Grindy. You'll burn a ton of electricity if trying to be active with this game. It's probably okay for those that don't care whether they progress or see anything different for weeks. 24 hour + runs should be expected.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Extremely pay to win, with mobile phone game level of micro-transaction pricing. To make matters worse, even if you do pay to win, the time frames required to progress are still obscene; it takes literal months of real time to make any meaningful jumps in progression, and likely a few years to reach the end game. The time (and date) issue can of course can be alleviated by a method in which all players of idle games will be aware of. However, the discord and the steam forums are full of very prideful and arrogant moderators, if you dare suggest that you are further along in the game than them, they will censor and cheater tag you.\n\nSave yourself the frustration and just give it a miss.\n\nEdit: It is funny, after having my comments deleted, and now being banned/removed from the discord, their lapdogs are coming to comment on this review. Get censored xD.\n\nFurther Edit: This is a single player idle game. Advancing the system clock is hardly 'cheating' as I am not gaining an unfair advantage over anyone. Good luck trying to get to the end game as a free to play player, you will have an extremely rough time. As a F2P you can probably quadruple my previous estimates to get to the end game, making the game even more excruciatingly slow. Pass.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The graphics are awful which is a given since it's AI and the UI is so confusing I'm often lost in menus.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Even if you removed the AI assets the interface is still HORRIBLE to look at - This game is boldly going nowhere",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Farmer against potatoes clone and it's not even close to subtle about it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TL;DR\nYes there is AI art, no there isn't much of it, yes the game is probably a waste of your time, no I don't think the goal is to get you to buy MTX.\n\nThis game just reeks, and I can't quite place my finger on why. While the AI stuff or the microtransactions are an obvious boogeyman, I don't think either of those things are necessarily deal breakers for games. For one, the majority of the art in this game is obviously purchased assets, and while AI \"art\" is reprehensible in nearly every possible way, it's use seems to mostly be the tutorial gremlins or other alien things, meaning that it's really just a small part of this game. The weird mismatched assets are a far bigger problem. \n\nOn the MTX, I don't believe that Free to Play idle games can't have a premium currency. Some of the greatest Idlers out there, most notably Idling to Rule the Gods and NGU Idle, have premium currencies. The difference between a greedy MTX whore and a great game with optional payments to support the devs and help you along is that you can earn the premium currency through normal gameplay at a reasonable rate, which this game does seem to have if the people who stuck around are to be believed, or where the premium currency is just outright unnecessary.\n\nNo, my problem with this game is something that can really only be described as an intuition that I'm being led along. The mechanics of the game seem competent, if a bit uninspired. The game being really really long is not necessarily problematic, as the aforementioned greats prove. The content I never made it to seems neat. But everything that this game does just makes me feel like I'm being strung along. Not even to get my wallet, more like a cruel joke.\n\nOverall, I just don't trust this game not to waste my time, and unless you really love what you see in the first 2 or so hours, I'd hazard that you just stay away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overreliance on AI for in-game assets. Even crappy developer art would be better. The point is to make it visibly clear and obvious that there is genuine passion put into the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its a idle clicker, so where in the fuck is the idle clicker part? you just move side to side, you don't even need to click you can just hold it down",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Didn't need to play it much. FAPI in space. Pretty much same UI late out and all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For a supposed idler there's way too much active involvement required.\r\nUp to 10 seconds of wait time whenever you finish an area. If you're repeating the area to farm resource you can skip the wait time by clicking a button, progressing to the next area however makes the wait time mandatory.\r\nThe meteorite minigame starts off on a 15 minutes cooldown, as does the special meteorite on the main screen. So you better collect those as soon as available to keep the timer ticking or you lose out on plenty of resource.\r\nItem inventory starts out with only 5 slots and items have to be clicked to equipped.\r\n\r\nWhile all of that can be automated through unlocks for premium currency, the amount of currency you earn in the game, especially early on, is so minuscule that if you don't have money to burn best prepare to spent several hundreds of hours to just turn this supposed idler into an actual idler.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Looked like fun, as basic as idle games get, Will not be loading the game back up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is very basic, simple idle game with a few critical flaws you can conveniently pay to get rid of. Either dish out couple hundred bucks for the QOL upgrades or suffer through weeks if not months of babysitting the game without any real consequence. \n\nThe AI art is hit or miss, mostly decent enough not to care but sometimes just awful \"AI slop\" \n\nOtherwise the game is decent enough but nothing special. Not past the initial struggle phase but after that it seems like check in once a day, number go up, reset. Already you I can see that there will be no meaningful strategy or decision making. Got a problem? Idle some more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game lacks the endorphine spiral, you spend ages in the beginning and when some automation comes to use it gets so boring and slow. and i have the feeling the developers wanna force you to buy antimatter, or leave the game running 24/7 for 50 years.\r\nnot recommended",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI filled mediocre idle slop",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "baad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pass.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The developer declared war on evil dirty cheaters and put in a White Screen of Death that blocks gameplay. Unfortunately the system is so aggressive that even non-cheaters can get it if it feels like you're progressing too much. I haven't cheated a single thing but twice now I've gotten the White Screen just for having the audacity of leaving the game running for a few days.\r\n\r\nPlenty of Idlers out there that don't have jerk developers. Skip this one",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "The gameplay is fine but the UI is ugly and the entire game uses AI generated graphics that is a complete turn off for clanker haters such as myself",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "Fairly mid-tier incremental game, fairly shallow mechanics that don't offer meaningful choices, there's no strategy to apply beyond a couple of the mechanics having some degree of trade-off between building your economy or building your rewards, but even there the long-term economic play appears fairly obviously superior as the more immediate rewards don't improve anything that's a genuine bottleneck to progress.\r\n\r\nSystems don't interact with each other to any real degree, mostly each system has a \"boost itself\" economic set of upgrades, and a \"boost the main game attributes\" set of reward upgrades, and sometimes another screen of \"boost another system's self boosts or main game boosts\", it's all just \"currency in, percentage boost to something out\" with different currencies. Your choice is a largely irrelevant choice of what order to get upgrades in... which largely affects nothing: given a choice between two upgrades at the same price tier, the advantage one will give you in the time it takes you to afford the other is negligible, so there's no point in specialising horizontally, and both are affordable before you can afford anything of the next tier, so there's no point in specialising vertically.\r\n\r\nEVERY system is like this, except for the paid-for currency, where the free amounts you earn are small enough to force you to choose and save... but then there's nearly always one vastly superior choice to make at any given time, which is usually \"automating the last feature you unlocked\".\r\n\r\nThere's a lot of content here, so very very many upgrades and achievements, but there's no gameplay. Once you've played the first few lightyear resets by hour 4 or whatever, you've basically seen everything there is to see for the next 600+ hours.\r\n\r\nIt's not bad, it's just \"not good\" either, and it's a bit of a resource hog compared to other idle games if I'm honest.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "progress is far too slow in this idle game. usually the end game tends to be slugish and slow, but if its this slow at the start already, i dont want to see how it ends",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the slowest semi-active idle game where you repeat the same actions every 3 hours, while having to check on the game every 15 minutes if you really want to progress, for forever.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The mechanics are acceptable at best. Everybody is critical about how expensive the microtransactions are but that's not the biggest problem with this game. The biggest issue is the huge waste of time the game is. Every time you beat a stage it's a 10 second delay to start the next stage, starting a new prestige you can clear the stage in 4-5 seconds, when you are at your farm level you can clear those stages in about 20 seconds. Even at your farm level when you clear it it's a 10 second wait to \"find more enemies\". This means that well over 1/3 of the time you have this game running is absolutely wasted no resources no xp just dead time. What is the point of an idle game where you get no credit for idling. Another huge problem with it is that even with the skip chance upgrade it takes hours to get back to your farm stage even at the early part of the game. Who wants to sit there and have over 30 percent of there time wasted. Dev needs to implement some kind of system that if you kill the wave within a certain amount of time you auto fly to the next. Until something like that happens, cant recommend a game where you get nothing for playing the game.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}