{
  "positive": [
    {
      "review": "Game of my childhood and still fun to play, with good soundtrack and a bit of nostalgia. HD edition lacks some features and DLCs, which is quite sad and a very unfortunate move, but it still has nice gameplay, very good diversity of creatures and well-balanced factions. Thats how remasters should be done.\nA legendary game. Necropolis rulez",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "There are few games one would return to after 20 years.  This is one of them.  Its got its quirks, but much of the joy is in its simplicity of mechanics but depth of play.  And hey, someone just came out with a board game version of this game specifically, so that speaks to how many people really enjoyed it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Release other games of HoMM series, even III is not full and somehow doesn't come with all the expansion packs. It would be amazing to see HoMM 1,2, and IV, but perhaps it will stay just a dream.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "We play this game every year on Black Friday. Not sure how that tradition ever started, but it is a great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic that I very much enjoyed playing again.  Early game is fun, late game can be tedious but that's a common issue with large scale strategy games.  Very much liked the graphic upgrade too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic. Still fun as hell to play with friends, even though its a billion years old by now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun classic from 30 years ago. This updated version gives it a slightly more modern look, keeping the games classical, simple, yet compelling, game play and whimsical feel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HOMM3 is the perfect balance of nostalgia, in a turn based masterpiece with wonderful music and audio, combined with an very simplistic but quite quaint appeal. \r\n\r\nLove it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is Heroes of Might and Magic III remastered for modern displays, nothing else. If you have ever played this game then understand you are getting nothing else. This doesn't come with any of the 10 expansion packs. Nothing else, nada. Which is SO disappointing.\r\n\r\nHowever, it's not like it's been advertised as anything different, so that's on me. If you're looking to get into the series, then this is a very good entry as Heroes 3 is typically regarded as one of the finest games in the franchise. That being said, you're going to miss out on a ton of content by getting this stand-alone HD version. You might as well purchase the entire OG collection on GOG and it still works and plays wonderfully thanks to their tinkerers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best ever of it's genre, too bad the HD version isn't the complete version (just base version with \"improved\" UI), but stil a great experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Huge nostalgia from kiddo times. I know there is community patch (Hota) with many updates and fixes to the core gameplay, but still, I like the original.\n\nThis game was in sale recently and me with few friends decided to give it a try. It supports steam invite using steam proxy. We were able to play and finish one 4.5h game. Lots of fun and it ran flawlessly without connection or ingame issues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like that this game is what the child in me remembers. Unfortunately, the adult in me still sucks at it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game has so many crevices of strategy making, its crazy for its time of release. Has an elegant UI combined with complimenting OST. Nostalgia machine for many slavs (me too). You can find an even better version on GOG, and you can also combine it with Horn of the Abyss for an ultimate online experience! XD",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, played it a lot in my childhood. Brings a lots of memories. There's not a lot of differences between this remake and the original except that they don't have all the updates the original got, it's only the base game as far as I can see. I'll be getting the GOG version with all the updates but I'm glad I found it here! \r\n\r\n8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "yes its missing some features like random maps and conflux, but its still the insane good game that looks slightly better than the original.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing still, perfect circlejerk game with the homies! Full of bad b1tches! 5 stars!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh, hey, look, I've played this game for more than a thousand hours....\n\nI grew up with this game, and it's one my friends and I still go back to more than any other game we've played (as evidenced by the large number of hours on my account). \n\nPros: It's fun. Like, keep playing an hour past my bedtime fun. Tons of replayability, with lots of factions and maps to explore. There have been tons of attempts to make similar games, but none of them keep pulling me back the way this does. This is probably a perfect game for multiplayer play, with just the right mix different elements; and, it's turn-based, which makes it more laid-back than RTS games are.\n\nCons: Crashes occasionally (but actually more reliable for multiplayer than later games in the series). Doesn't include the expansions (these are on GoG, but that's more challenging to play multiplayer). It's 30 years old, so the graphics are just a tiny bit dated, but really, who cares?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Legend of Legends is a Super Production Not Everyone Knows It, Those Who Know Can't Give Up But Here Are These Invaluable Men Making an HD Edition After How Many Years It Is Very Valuable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an amazing game and I think everyone should try it at least one time with a friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---General Help on Unlocking Locked Campaign---\n\nWhen starting a campaign always press \"Load Campaign\" save this way the Game check marks a completed campaign, proceed to the next campaign through the save you finished your last campaign.\n\n!!! *Do This to keep your Completed campaigns Check Marked !!!* > It's a good idea to call your saves >1 campaign, 2 campaign... and so on, always play on your latest Save and *-Do not Press \"New Game\"- *Notice* Keep your Progress through the \"Load\" Function at all times.\n\nThen you will unlock new Locked campaigns Bellow, *Do the same with them to unlock remaining campaigns this way. *Using Cheat codes disables achievements*. \n\n---General Expression---\n\nThe Long Forgotten Classic of Heroes of Might and Magic 3, the Best Sequel that I've personally played a long time ago, with this Enhanced Graphics pack, you can finally relive a Classic Turn Based Strategy Game, which had a Special place in my childhood, and it has came back to Share Joy once Again, Do not miss out on this great game!\n\n ---The Time-Saving Tip for 10 Victory Difficulty Achievements---\n\n Fast and efficient way to get 10 Victories in each Normal, Hard, Expert and Impossible Difficulty, \"Save' Before the final fight... 'Load' the Save after, rinse and repeat until you gain 10 victories. Start a new single player Scenario on a different difficulty and repeat the Process. Save at the Last battle.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this series of HMM but the best one was the 4th (IV) one and isn't on steam",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I have thousands of hours into the original. This game is just great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super game old but one of the best games for that time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game, my hand fell off playing it, just kidding :-D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best heroes game in my opinion, still fun in 2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "classic nostalgic fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so good that's all just good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brings back memories!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good grafics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i cant open this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome classic !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD JOB",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "memories :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ";]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Unfortunately, it only contains the base game without the expansions. I'd get this only on a deep discount. Instead, get the complete collection on GoG and download HoMM3 HD+ for it.",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "Heroes 3 HD looks nicer and runs smooth. It’s still a super fun strategy game, but missing the old expansions. Great for fans, just not the full package.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "everything is great accept that the expansion games are not available",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Honestly, here in October 2025, this is still the GOAT.\n\nClassic vibes through and through.  Lots of factions.  Tons of different heroes and units.  Simple game with plenty of strategy.  There's a reason (quite a few, actually) why this game is an all time classic.\n\nI really like this HD version.  The pixel graphics still look retro enough but things are just sharp enough to feel tasteful on a nice modern 4k monitor.  The colors of the map look great, especially the gems and all of the points of interest.  I don't believe this has the expansion content, but honestly there's enough game here to play for a long time and it was very well done.  If you want the true experience, the Gog version of HoMM3 has all of the original content as well as the expansion content.\n\nFor anyone new to the genre, this game doesn't entirely explain everything... there's a tutorial but it only gives you about half of what you actually should know.  Feel free to read the manual that comes with it (that's what we actually did back in the day).  You could also watch YouTube tutorials and the like.  But do spend the time to learn the systems here, because once you understand them the game starts to make sense and gets a lot more fun.\n\nAll those modern grand strategy games took cues from this beast of a franchise.  Do you like Total War games?  They revamped the battle system but the grand strategy part of those is a direct derivative of HoMM.\n\nThis is classic high fantasy grand strategy at its OG best.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Heroes of Might and Magic 3 is the best TBS(Turn Based Strategy) of its kind. \n\nThe game still looks good today and its still fun, especially if you played it back in 99-2000 like i did.\n\nThis is probably a nostalgia product which is sad because its still better than a lot of the games that come out today.\n\nThe music is great. Its classical music. The art style is also great. Its the classical art style which looks timeless.\n\nThe castles are all great and the units in them make sense. You have 8 castles in this version.\n\nThe management of a kingdom with 10+ castles can give you this feeling of being a grand ruler :).\n\nEach hero can go on their own little adventure and capture/protect a castle and its mines. Every hero has a use. Remember you can have 8 might heroes on the map and 8 magic heroes to defend for example.\n\nI think this game is one of the best strategy games ever produced but its not very commercial, its very geeky and very nerdy so most people wont play it. You have to be a Lord of the Rings fan + numbers fan + patient... so a LOTR numbers geek.\n\nThe bad part about this version is that it does not offer the 2 expansions as well. It could also do with some difficulty adjustments for some of the missions which are suddenly impossible to beat and some quality of life improvements.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Heroes III is a great game to play by yourself. Many scenarios. levels, factions and random events make each game different.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This is a classic, I like the 3rd one more than any other. Its a good game with solid gameplay and tons of story lines and multiplayer games.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Nostalgic game that is so simple but such a great game to play. Far better than the rubbish produced these days!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Release other games of HoMM series, even III is not full and somehow doesn't come with all the expansion packs. It would be amazing to see HoMM 1,2, and IV, but perhaps it will stay just a dream.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Game of my childhood and still fun to play, with good soundtrack and a bit of nostalgia. HD edition lacks some features and DLCs, which is quite sad and a very unfortunate move, but it still has nice gameplay, very good diversity of creatures and well-balanced factions. Thats how remasters should be done.\nA legendary game. Necropolis rulez",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "The game is good but lack depth for the full experience without the complete edition. if you wish to go back to the old days like myself, it is worth just for old time sake at a much discounted rate which i got it for. Else, personally i will not buy at the given usual price, especially without the complete edition.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There are few games one would return to after 20 years.  This is one of them.  Its got its quirks, but much of the joy is in its simplicity of mechanics but depth of play.  And hey, someone just came out with a board game version of this game specifically, so that speaks to how many people really enjoyed it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The GOAT. Created its own genre and still stands tall by this day. Shame this \"HD Version\" butchers so much of it as the expansions aren't included. I recommend searching for the complete edition and/or the Horn of the Abyss expansions, which are fan-made but awesome and very interesting to play with and way better than this Steam version of the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best Might & Magic game hands down.\r\nWas fun to play with friends back in the day.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "HoMM 3 was the first game I played on a computer with Half-Life. This game has special meaning for me, lots of memorys from my childhood. I love still playing this game. Legendary and epic!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has it all - heroes, might, AND magic... x3!! Truly though, a turn-based classic that still hits decades later from the most seasoned player, to a first timer. I will sink hundreds of hours into masterpiece. 10/10, love you HoMM III <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game looking forward to the new heroes of might and magic old era",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been hesitant to buy this game because of some reviews I have seen (Primarily on other Heroes games). But this was on sale for 3.99 and so I figured what do I have to lose? And my only regret is that I didn't pick this up sooner. I remember playing this with my older siblings over 20 years ago. This remastered version is everything I remember from the original. It scratches that itch quite well and there is nothing like this out there today.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "We play this game every year on Black Friday. Not sure how that tradition ever started, but it is a great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic that I very much enjoyed playing again.  Early game is fun, late game can be tedious but that's a common issue with large scale strategy games.  Very much liked the graphic upgrade too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic. Still fun as hell to play with friends, even though its a billion years old by now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun classic from 30 years ago. This updated version gives it a slightly more modern look, keeping the games classical, simple, yet compelling, game play and whimsical feel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HOMM3 is the perfect balance of nostalgia, in a turn based masterpiece with wonderful music and audio, combined with an very simplistic but quite quaint appeal. \r\n\r\nLove it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is Heroes of Might and Magic III remastered for modern displays, nothing else. If you have ever played this game then understand you are getting nothing else. This doesn't come with any of the 10 expansion packs. Nothing else, nada. Which is SO disappointing.\r\n\r\nHowever, it's not like it's been advertised as anything different, so that's on me. If you're looking to get into the series, then this is a very good entry as Heroes 3 is typically regarded as one of the finest games in the franchise. That being said, you're going to miss out on a ton of content by getting this stand-alone HD version. You might as well purchase the entire OG collection on GOG and it still works and plays wonderfully thanks to their tinkerers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best ever of it's genre, too bad the HD version isn't the complete version (just base version with \"improved\" UI), but stil a great experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Huge nostalgia from kiddo times. I know there is community patch (Hota) with many updates and fixes to the core gameplay, but still, I like the original.\n\nThis game was in sale recently and me with few friends decided to give it a try. It supports steam invite using steam proxy. We were able to play and finish one 4.5h game. Lots of fun and it ran flawlessly without connection or ingame issues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game!  It takes me way back to when I was a teen!  I used to and still do love playing this game!  It's definitely a throw back.  Haven't seen something like it since.  Definitely worth it if you are into these sorts of turn-based games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Picked this up as I wanted to replay the old campaign through Erathia before trying out Olden Era. On top of the fond memories of playing the game years ago, the game also is simply a nice strategy war game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a great game, nice hd graphics for the maps and such.\r\nthere are a few things missing and options that need to be returned.\r\nThe map editor used to have a function where you could randomly create a map then edit afterwards, there is no function to do this anymore and you cannot actually use it to edit other maps.\r\nThere is a faction called elementals that is missing along with heroes and monsters for that faction.\r\n\r\nThe most annoying thing, you cannot turn off the cpu players in hotseat anymore, so now instead of two humans playing for fun, you have to fight the cpu first, I liked having the ability to remove the cpu so we could capture different factions castles and could play more casual.\r\nif they bring back some of the removed functions and the elemental faction, it will be the FULL HEROES 3 experience, until then its just nice to be able to play it again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This turn based strategy game has given me a ton of replay value!  1055 hours and counting!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This classic, if you can get past the simple setup and graphics actually has some challenging and repeatable game play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game ever. The lore and the gameplay is otherworldly. I can't believe it is almost 30 yrs since I started playing this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic never die, there is something about Heroes 3 that is better then the future installement i cannot put my finger on it. Even with old graphic, basic animation and everything...its just fun to go threw a map here and there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing in 2025 as well. I have Thousands of hours logged in all kids of games, as do many of you, and I appreciate this game a lot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, I mean game not that HD remaster but it not so bad if you buy it on sale. For me it is as chess my childhood.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, HOMM3 is indeed still a masterpiece on many aspects.\n\nBut you must admit it aged not so well on some others. Including: Balance, UI/UX, some gameplay loops...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Heroes of Might and Magic III HD no es simplemente un juego, es una obra maestra de diseño de estrategia por turnos. Y no lo digo en plan nostálgico únicamente: lo digo con el ojo crítico de alguien que ha jugado títulos de todas las eras, y ninguno logra equilibrar profundidad mecánica, claridad de interfaz y rejugabilidad infinita como este.\r\n\r\n.Diseño de sistemas impecable\r\n\r\n-Cada facción es un ecosistema matemático en sí mismo: desde el “rush” brutal de Castillo hasta la construcción lenta y sinérgica de Necrópolis.\r\n\r\n-El sistema de recursos múltiples (oro + 6 raros) no es un capricho, es un modelo perfecto de gestión estratégica. El jugador nunca deja de tomar decisiones con peso real.\r\n\r\n.Combate táctico que envejece como vino\r\n\r\n-El campo hexagonal, el movimiento basado en iniciativa, los stacks de unidades: todo tiene una lógica interna clarísima.\r\n\r\n-Cada batalla es un pequeño ajedrez, pero condimentado con la magia y la imprevisibilidad que lo hacen adictivo.\r\n\r\n.Interfaz y ergonomía (sí, incluso en 1999)\r\n\r\n-Para su época era un prodigio: accesible pero profundo, con la información justa al alcance de un click.\r\n\r\n-En HD luce más limpio, más legible, sin perder el alma del original.\r\n\r\n.El ciclo infinito “un turno más”\r\n\r\n-Empieza con una exploración inocente del mapa y termina con un plan maestro de 20 movimientos en cadena, calculando tiempos de reclutamiento, rutas óptimas y probabilidad de encuentro con el enemigo.\r\n\r\n-Esa sensación de planificación estratégica perfecta es algo que casi ningún juego moderno logra emular.\r\n\r\n.Como ingeniero y como gamer, valoro cuando un juego es más que “entretenimiento”: cuando es un sistema robusto que enseña a pensar, que recompensa la coherencia y la visión a largo plazo. Y Heroes III es eso: un simulador de decisiones estratégicas con sabor a fantasía medieval.\r\nNo es nostalgia, es ciencia del diseño de juegos para mí.\r\n\r\nRecomiendo absolutamente este juego. No importa si venís del pasado o si lo descubrís hoy: la experiencia sigue siendo tan fresca, adictiva y sólida como hace 25 años, lo puse a jugar a mi amigo que solamente juega overwatch y fifa a este juego conmigo, y las risas, los momentos divertidos y el interés por hacer las cosas bien, no faltaron.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was a great game 25+ years ago and it is still a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Challenging levels of difficulty and strategy. A high verity of characters with unique abilities. One of the best turn based games, ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like that this game is what the child in me remembers. Unfortunately, the adult in me still sucks at it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Adding review as I realise I hadn't posted it back when I clocked this Steam version back in 2019 - The game itself is a classic 10/10 still one of the best video game soundtracks of all time, still one of the best turn based strategy fantasy games I feel anyone should try at least once.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a Table top game on a computer. if you have the patience you can also build your own maps! the campaign is a little annoying b/c the limitations on hero/castle development but the game is def worth the pocket change lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has so many crevices of strategy making, its crazy for its time of release. Has an elegant UI combined with complimenting OST. Nostalgia machine for many slavs (me too). You can find an even better version on GOG, and you can also combine it with Horn of the Abyss for an ultimate online experience! XD",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, played it a lot in my childhood. Brings a lots of memories. There's not a lot of differences between this remake and the original except that they don't have all the updates the original got, it's only the base game as far as I can see. I'll be getting the GOG version with all the updates but I'm glad I found it here! \r\n\r\n8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "yes its missing some features like random maps and conflux, but its still the insane good game that looks slightly better than the original.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing still, perfect circlejerk game with the homies! Full of bad b1tches! 5 stars!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A shining example of why some of the older games can be better than a a lot of them that they put out even today!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "horsie. horsie move nicely. he picks up colourful resources. there is a magical noise played when you acquire said currency. this is good. \r\n\r\nreminds me of when i was a kid",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Oh, hey, look, I've played this game for more than a thousand hours....\n\nI grew up with this game, and it's one my friends and I still go back to more than any other game we've played (as evidenced by the large number of hours on my account). \n\nPros: It's fun. Like, keep playing an hour past my bedtime fun. Tons of replayability, with lots of factions and maps to explore. There have been tons of attempts to make similar games, but none of them keep pulling me back the way this does. This is probably a perfect game for multiplayer play, with just the right mix different elements; and, it's turn-based, which makes it more laid-back than RTS games are.\n\nCons: Crashes occasionally (but actually more reliable for multiplayer than later games in the series). Doesn't include the expansions (these are on GoG, but that's more challenging to play multiplayer). It's 30 years old, so the graphics are just a tiny bit dated, but really, who cares?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Legend of Legends is a Super Production Not Everyone Knows It, Those Who Know Can't Give Up But Here Are These Invaluable Men Making an HD Edition After How Many Years It Is Very Valuable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an amazing game and I think everyone should try it at least one time with a friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---General Help on Unlocking Locked Campaign---\n\nWhen starting a campaign always press \"Load Campaign\" save this way the Game check marks a completed campaign, proceed to the next campaign through the save you finished your last campaign.\n\n!!! *Do This to keep your Completed campaigns Check Marked !!!* > It's a good idea to call your saves >1 campaign, 2 campaign... and so on, always play on your latest Save and *-Do not Press \"New Game\"- *Notice* Keep your Progress through the \"Load\" Function at all times.\n\nThen you will unlock new Locked campaigns Bellow, *Do the same with them to unlock remaining campaigns this way. *Using Cheat codes disables achievements*. \n\n---General Expression---\n\nThe Long Forgotten Classic of Heroes of Might and Magic 3, the Best Sequel that I've personally played a long time ago, with this Enhanced Graphics pack, you can finally relive a Classic Turn Based Strategy Game, which had a Special place in my childhood, and it has came back to Share Joy once Again, Do not miss out on this great game!\n\n ---The Time-Saving Tip for 10 Victory Difficulty Achievements---\n\n Fast and efficient way to get 10 Victories in each Normal, Hard, Expert and Impossible Difficulty, \"Save' Before the final fight... 'Load' the Save after, rinse and repeat until you gain 10 victories. Start a new single player Scenario on a different difficulty and repeat the Process. Save at the Last battle.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this series of HMM but the best one was the 4th (IV) one and isn't on steam",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "fun game with friend , old game are good I was playing this game when I was 10 years old",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Build, fight, die, recruit, repeat. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do I need to say what the game is?\r\nEveryone knows it.\r\n\r\nThe best out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good, old Heroes 3 in the basic version. Buy only on sale.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Very unethical. While being a remastered version, it lacks campaign content, capacity to play multiplayer where most people play or to play most maps made by players. It also runs slower, there are plenty of timed delays or input delays that do not exist with the complete edition. Quick combat also works differently. Normally if you enable this option, an AI plays the fight for you instantly, but you can choose to do the fight yourself after you see the result. Now you are forced to either have every fight done automatically and weaker, or do every fight manually.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "An amazingly lazy and poor release of one of the best games of all time.  A release that will not lock the mouse cursors to the screen, preventing you from mouse scrolling the map in multi monitor setup.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I love HoMM3 but, this ain't it. total hackjob, no QoL improvements - not even either of the expansions. for a game I put hundreds of hours into so many years ago, a real disappointment.\n\n0/10 slow shipping.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I own 3 Heroes games and I never was able to play them. They won't start",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's probably a fun game for most, I just didn't really like it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy as hell.\n\nShould be freeware, it is so bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "had multiple game launch issues.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even it got sale, i still feel like being scammed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played for 10 hours then wont even start now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "****",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "even ai could make a better remake of this...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't know how they managed, but Ubisoft managed to take a Classic game from 25 years ago, and somehow make it worse.  Here is a list of the problems I found in just the short time I played it (didn't even finish the first scenario):\r\n\r\n1) You can't use the spacebar to activate buildings on the adventure map, which means you have to unnecessarily waste movement.\r\n2) You can't buy non-upgraded creatures from upgraded dwellings, which causes multiple problems.\r\n3) It runs slow, even though the original game was released in the late '90s.\r\n4) In battle, when you hover the cursor over enemy units, it doesn't show you the damage range.\r\n5) The adventure map cursor is larger and unwieldy, and leads to lots of misclicks.\r\n6) This release doesn't contain either of the expansions for the original game, and if you are unaware, the game was incomplete without the expansions.\r\n\r\nThere are probably more problems that I didn't find, but I'm done looking.  I have played literally thousands of hours of the original release of this game; it's such a great game, and it's a shame that this new release is such a downgrade.  I personally find it to be unplayable.  Since buying it, I have learned that there are ways to get a good version of HoMM3, and I would recommend trying that, rather than buying this piece of garbage.",
      "voted_up": false,
      "votes_helpful": 118
    },
    {
      "review": "No mod support, and expansions are missing.\n\nGet the GOG complete edition instead.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "The game of our childhood, but greedy Ubi did not even include the expansions, and they did just the bare minimum.\r\n\r\nNot worth. GOG version is better.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "Very unethical. While being a remastered version, it lacks campaign content, capacity to play multiplayer where most people play or to play most maps made by players. It also runs slower, there are plenty of timed delays or input delays that do not exist with the complete edition. Quick combat also works differently. Normally if you enable this option, an AI plays the fight for you instantly, but you can choose to do the fight yourself after you see the result. Now you are forced to either have every fight done automatically and weaker, or do every fight manually.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Installed the game, it won't boot up.\nUninstalled and re-installed, it won't boot up.\nGo back to 1999, buy a Windows 97 machine and buy the CD.  I happen to have it on CD with a W-97 box so thank you very much steam for not giving me my refund when I asked.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Good game,\nbut where are two DLC of armageddons blade and shadow of death ?",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "An amazingly lazy and poor release of one of the best games of all time.  A release that will not lock the mouse cursors to the screen, preventing you from mouse scrolling the map in multi monitor setup.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "A great game, But get the complete game on GoG with the crafted fan-made expansion horn of the Abyss.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Shit port of a good game. Badly upscaled sprites, and doesn't even have all the VANILLA towns. Play VCMI instead, it's a fan patch for the original version that works way better and looks way better.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love HoMM3 but, this ain't it. total hackjob, no QoL improvements - not even either of the expansions. for a game I put hundreds of hours into so many years ago, a real disappointment.\n\n0/10 slow shipping.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've never seen such a scam anywhere. Ubisoft uploaded a 25-year-old game with slightly updated graphics, but removed all possible additions that came later.\nIt is not possible to generate a map as you wish, enjoy ready-made scenarios with often annoying maps. What is worse, it is not possible to change a ready-made map to suit yourself. How can you get sandbox emotions with such success? A rhetorical question. Of course, you can use special scripts to create maps yourself. As far as I know, they don't even ban you for that, but is the content worth all that effort?\nOne faction that just came with the expansions is not available here, many buildings are also not available. The interface is outdated, many features cannot be implemented.\nI didn't check the map editor manually, I apologize.\nMultiplayer is just as buggy as solo gaming. Tried to connect with my cousin several times - nothing.\nThere is no mod support, even this way you can't fix the situation.\nUbisoft simply uploaded the most outdated game with improved graphics, while leaving the high-quality Complete Edition (with all the cool features I listed above and more) on their website.\nHeroes 3 is truly a legendary game with a great history, present and future. Better go to GOG and buy the Complete Edition there. Then you will thank me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is not the full version of Heroes 3, but the game itself is an immortal legend",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "AI is OP and does not play by the same rules as you are forced to. It can produce troops when there are none and it's gold even on easy is double yours. It does not loose troops in fights with it's self. In campaign mode it takes your troops between chapters but the AI troop count is what you had at the end of the chapter. Totally unbalanced, not recommended.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you want to play the campaigns, don't buy this!!!!!\n\nYou can buy HOMM3 complete elsewhere.  Do it.  The campaign difficulty on those can't be changed, but it is set to moderate.  Every campaign I've played on this HD version is set to very easy, with no way to change it.\n\nThey boast 30,000 hours of development.  In all that time, nobody noticed that the difficulty was set wrong?\n\nIf you check the discussion board, you will see 10 years of complaints, and yet the developer hasn't bothered to fix it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This isn't the complete version of the game and is incompatible with the popular Horns of the Abyss mod.  It is honestly a ripoff.  Buy the game from GOG instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game does not include all DLCs and is a far cry from the variant of the game I played as a child. I later discovered that one can buy a complete edition elsewhere and play it with a free HD mod! This \"rowork\" is a scam.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh.\nPlayer spells made me remember why this game was something i rarely played as a kid. Recalling this fact has made me hate it. Spells and ranged and you win, 90% of the time. I mean good lord this game belongs in the trash, not propped up as some nostalgic fever dream.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm in process to get a refund.\n\nThe HD was great, graphics are good but in this day an age with the ease and speed of making a game like this remastered this is inexcusable. This is the absolute bare bones beginning game and NOT the complete game that came with the DLC's. Remember, old DLC meant complete game, not just add on content like now.\n\nThis means you get only a few maps to play as a single player and that's it. No random map generator, all the loads of content and elemental class from the DLC's etc just absolute barest minimum effort meaning yet another cash grab. How this game got so many thumbs up with so much missing I have no idea why. Without that DLC it's not even worth the price when it's 75% off.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you like to play a campaign on easy difficulty, then this is the game for you.  I have not found a way to set the difficulty for the campaign games, it seems to start on easy with no apparent way of changing it.  Single scenarios appear to have a difficulty setting, but not the main campaigns.  Also, this looks to be an abbreviated game.  I like the newer Heroes games, but this was supposed to be a classic, reality is a big pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubish*t strikes again\n\nGot halfway through the game and spent so much time completing that Seer's Hut mission, beating those demon prison guards (and the dragons underground to get all the items), only to realize the reward was a lie. Sh*t's bugged and your hero doesn't carry over. He appears as a lowly level 1 worm in the tavern in the next mission, to mock you for paying ubisoft money.\n\nYou got me. \nThe rest of the drawbacks, like the cursor being laggy in the old graphics mode so I have to look at these horrendous \"HD\" ones, are bad. But the game straight up lying is too much.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very different from the original, very unbalanced, playing 5 hour rounds only to lose due to enemies being programmed to win, what the fu*k? I level up to the end, get a massive army, all the relics, just so a guy that just sits at his castle and does nothing would beat me with beginner troops? I gotta stop playing this shit, you're ruining nostalgia for me. The original Heroes III was perfectly balanced, this version is bullsh*t.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's good to comeback after few years, wanted to finish all campaigns but after completing 3 of them I cant go to 4 or 5, they still have white/black image. Something is def wrong, bcs when I finish a campaigne i can save the game (but what for?). After loading saves of completed ones game is crashing. How to fix that **** ?!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Multiplayer does not work, you need to be advanced programer to set it up. It would be great that when you press play you can actually play the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "weird fact... when you playing this game like you should.. the cpu does not .... so whatever you do you can't beat the game . it spawn his own help along the way  .if you cheat .. no achievement.. i wish i could be happy playing this game, but OP cpu are not a good way to win me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I own 3 Heroes games and I never was able to play them. They won't start",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's probably a fun game for most, I just didn't really like it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy as hell.\n\nShould be freeware, it is so bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "had multiple game launch issues.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even it got sale, i still feel like being scammed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "****",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "even ai could make a better remake of this...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't know how they managed, but Ubisoft managed to take a Classic game from 25 years ago, and somehow make it worse.  Here is a list of the problems I found in just the short time I played it (didn't even finish the first scenario):\r\n\r\n1) You can't use the spacebar to activate buildings on the adventure map, which means you have to unnecessarily waste movement.\r\n2) You can't buy non-upgraded creatures from upgraded dwellings, which causes multiple problems.\r\n3) It runs slow, even though the original game was released in the late '90s.\r\n4) In battle, when you hover the cursor over enemy units, it doesn't show you the damage range.\r\n5) The adventure map cursor is larger and unwieldy, and leads to lots of misclicks.\r\n6) This release doesn't contain either of the expansions for the original game, and if you are unaware, the game was incomplete without the expansions.\r\n\r\nThere are probably more problems that I didn't find, but I'm done looking.  I have played literally thousands of hours of the original release of this game; it's such a great game, and it's a shame that this new release is such a downgrade.  I personally find it to be unplayable.  Since buying it, I have learned that there are ways to get a good version of HoMM3, and I would recommend trying that, rather than buying this piece of garbage.",
      "voted_up": false,
      "votes_helpful": 118
    },
    {
      "review": "No mod support, and expansions are missing.\n\nGet the GOG complete edition instead.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "The game of our childhood, but greedy Ubi did not even include the expansions, and they did just the bare minimum.\r\n\r\nNot worth. GOG version is better.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "Very unethical. While being a remastered version, it lacks campaign content, capacity to play multiplayer where most people play or to play most maps made by players. It also runs slower, there are plenty of timed delays or input delays that do not exist with the complete edition. Quick combat also works differently. Normally if you enable this option, an AI plays the fight for you instantly, but you can choose to do the fight yourself after you see the result. Now you are forced to either have every fight done automatically and weaker, or do every fight manually.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Installed the game, it won't boot up.\nUninstalled and re-installed, it won't boot up.\nGo back to 1999, buy a Windows 97 machine and buy the CD.  I happen to have it on CD with a W-97 box so thank you very much steam for not giving me my refund when I asked.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Good game,\nbut where are two DLC of armageddons blade and shadow of death ?",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "An amazingly lazy and poor release of one of the best games of all time.  A release that will not lock the mouse cursors to the screen, preventing you from mouse scrolling the map in multi monitor setup.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "A great game, But get the complete game on GoG with the crafted fan-made expansion horn of the Abyss.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Shit port of a good game. Badly upscaled sprites, and doesn't even have all the VANILLA towns. Play VCMI instead, it's a fan patch for the original version that works way better and looks way better.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love HoMM3 but, this ain't it. total hackjob, no QoL improvements - not even either of the expansions. for a game I put hundreds of hours into so many years ago, a real disappointment.\n\n0/10 slow shipping.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've never seen such a scam anywhere. Ubisoft uploaded a 25-year-old game with slightly updated graphics, but removed all possible additions that came later.\nIt is not possible to generate a map as you wish, enjoy ready-made scenarios with often annoying maps. What is worse, it is not possible to change a ready-made map to suit yourself. How can you get sandbox emotions with such success? A rhetorical question. Of course, you can use special scripts to create maps yourself. As far as I know, they don't even ban you for that, but is the content worth all that effort?\nOne faction that just came with the expansions is not available here, many buildings are also not available. The interface is outdated, many features cannot be implemented.\nI didn't check the map editor manually, I apologize.\nMultiplayer is just as buggy as solo gaming. Tried to connect with my cousin several times - nothing.\nThere is no mod support, even this way you can't fix the situation.\nUbisoft simply uploaded the most outdated game with improved graphics, while leaving the high-quality Complete Edition (with all the cool features I listed above and more) on their website.\nHeroes 3 is truly a legendary game with a great history, present and future. Better go to GOG and buy the Complete Edition there. Then you will thank me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is not the full version of Heroes 3, but the game itself is an immortal legend",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "AI is OP and does not play by the same rules as you are forced to. It can produce troops when there are none and it's gold even on easy is double yours. It does not loose troops in fights with it's self. In campaign mode it takes your troops between chapters but the AI troop count is what you had at the end of the chapter. Totally unbalanced, not recommended.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you want to play the campaigns, don't buy this!!!!!\n\nYou can buy HOMM3 complete elsewhere.  Do it.  The campaign difficulty on those can't be changed, but it is set to moderate.  Every campaign I've played on this HD version is set to very easy, with no way to change it.\n\nThey boast 30,000 hours of development.  In all that time, nobody noticed that the difficulty was set wrong?\n\nIf you check the discussion board, you will see 10 years of complaints, and yet the developer hasn't bothered to fix it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This isn't the complete version of the game and is incompatible with the popular Horns of the Abyss mod.  It is honestly a ripoff.  Buy the game from GOG instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game does not include all DLCs and is a far cry from the variant of the game I played as a child. I later discovered that one can buy a complete edition elsewhere and play it with a free HD mod! This \"rowork\" is a scam.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh.\nPlayer spells made me remember why this game was something i rarely played as a kid. Recalling this fact has made me hate it. Spells and ranged and you win, 90% of the time. I mean good lord this game belongs in the trash, not propped up as some nostalgic fever dream.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm in process to get a refund.\n\nThe HD was great, graphics are good but in this day an age with the ease and speed of making a game like this remastered this is inexcusable. This is the absolute bare bones beginning game and NOT the complete game that came with the DLC's. Remember, old DLC meant complete game, not just add on content like now.\n\nThis means you get only a few maps to play as a single player and that's it. No random map generator, all the loads of content and elemental class from the DLC's etc just absolute barest minimum effort meaning yet another cash grab. How this game got so many thumbs up with so much missing I have no idea why. Without that DLC it's not even worth the price when it's 75% off.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you like to play a campaign on easy difficulty, then this is the game for you.  I have not found a way to set the difficulty for the campaign games, it seems to start on easy with no apparent way of changing it.  Single scenarios appear to have a difficulty setting, but not the main campaigns.  Also, this looks to be an abbreviated game.  I like the newer Heroes games, but this was supposed to be a classic, reality is a big pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubish*t strikes again\n\nGot halfway through the game and spent so much time completing that Seer's Hut mission, beating those demon prison guards (and the dragons underground to get all the items), only to realize the reward was a lie. Sh*t's bugged and your hero doesn't carry over. He appears as a lowly level 1 worm in the tavern in the next mission, to mock you for paying ubisoft money.\n\nYou got me. \nThe rest of the drawbacks, like the cursor being laggy in the old graphics mode so I have to look at these horrendous \"HD\" ones, are bad. But the game straight up lying is too much.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very different from the original, very unbalanced, playing 5 hour rounds only to lose due to enemies being programmed to win, what the fu*k? I level up to the end, get a massive army, all the relics, just so a guy that just sits at his castle and does nothing would beat me with beginner troops? I gotta stop playing this shit, you're ruining nostalgia for me. The original Heroes III was perfectly balanced, this version is bullsh*t.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's good to comeback after few years, wanted to finish all campaigns but after completing 3 of them I cant go to 4 or 5, they still have white/black image. Something is def wrong, bcs when I finish a campaigne i can save the game (but what for?). After loading saves of completed ones game is crashing. How to fix that **** ?!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Multiplayer does not work, you need to be advanced programer to set it up. It would be great that when you press play you can actually play the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "weird fact... when you playing this game like you should.. the cpu does not .... so whatever you do you can't beat the game . it spawn his own help along the way  .if you cheat .. no achievement.. i wish i could be happy playing this game, but OP cpu are not a good way to win me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I own 3 Heroes games and I never was able to play them. They won't start",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's probably a fun game for most, I just didn't really like it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy as hell.\n\nShould be freeware, it is so bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "had multiple game launch issues.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even it got sale, i still feel like being scammed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "****",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "even ai could make a better remake of this...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't know how they managed, but Ubisoft managed to take a Classic game from 25 years ago, and somehow make it worse.  Here is a list of the problems I found in just the short time I played it (didn't even finish the first scenario):\r\n\r\n1) You can't use the spacebar to activate buildings on the adventure map, which means you have to unnecessarily waste movement.\r\n2) You can't buy non-upgraded creatures from upgraded dwellings, which causes multiple problems.\r\n3) It runs slow, even though the original game was released in the late '90s.\r\n4) In battle, when you hover the cursor over enemy units, it doesn't show you the damage range.\r\n5) The adventure map cursor is larger and unwieldy, and leads to lots of misclicks.\r\n6) This release doesn't contain either of the expansions for the original game, and if you are unaware, the game was incomplete without the expansions.\r\n\r\nThere are probably more problems that I didn't find, but I'm done looking.  I have played literally thousands of hours of the original release of this game; it's such a great game, and it's a shame that this new release is such a downgrade.  I personally find it to be unplayable.  Since buying it, I have learned that there are ways to get a good version of HoMM3, and I would recommend trying that, rather than buying this piece of garbage.",
      "voted_up": false,
      "votes_helpful": 118
    },
    {
      "review": "No mod support, and expansions are missing.\n\nGet the GOG complete edition instead.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "The game of our childhood, but greedy Ubi did not even include the expansions, and they did just the bare minimum.\r\n\r\nNot worth. GOG version is better.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "Very unethical. While being a remastered version, it lacks campaign content, capacity to play multiplayer where most people play or to play most maps made by players. It also runs slower, there are plenty of timed delays or input delays that do not exist with the complete edition. Quick combat also works differently. Normally if you enable this option, an AI plays the fight for you instantly, but you can choose to do the fight yourself after you see the result. Now you are forced to either have every fight done automatically and weaker, or do every fight manually.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Installed the game, it won't boot up.\nUninstalled and re-installed, it won't boot up.\nGo back to 1999, buy a Windows 97 machine and buy the CD.  I happen to have it on CD with a W-97 box so thank you very much steam for not giving me my refund when I asked.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Good game,\nbut where are two DLC of armageddons blade and shadow of death ?",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "An amazingly lazy and poor release of one of the best games of all time.  A release that will not lock the mouse cursors to the screen, preventing you from mouse scrolling the map in multi monitor setup.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "A great game, But get the complete game on GoG with the crafted fan-made expansion horn of the Abyss.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Shit port of a good game. Badly upscaled sprites, and doesn't even have all the VANILLA towns. Play VCMI instead, it's a fan patch for the original version that works way better and looks way better.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love HoMM3 but, this ain't it. total hackjob, no QoL improvements - not even either of the expansions. for a game I put hundreds of hours into so many years ago, a real disappointment.\n\n0/10 slow shipping.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've never seen such a scam anywhere. Ubisoft uploaded a 25-year-old game with slightly updated graphics, but removed all possible additions that came later.\nIt is not possible to generate a map as you wish, enjoy ready-made scenarios with often annoying maps. What is worse, it is not possible to change a ready-made map to suit yourself. How can you get sandbox emotions with such success? A rhetorical question. Of course, you can use special scripts to create maps yourself. As far as I know, they don't even ban you for that, but is the content worth all that effort?\nOne faction that just came with the expansions is not available here, many buildings are also not available. The interface is outdated, many features cannot be implemented.\nI didn't check the map editor manually, I apologize.\nMultiplayer is just as buggy as solo gaming. Tried to connect with my cousin several times - nothing.\nThere is no mod support, even this way you can't fix the situation.\nUbisoft simply uploaded the most outdated game with improved graphics, while leaving the high-quality Complete Edition (with all the cool features I listed above and more) on their website.\nHeroes 3 is truly a legendary game with a great history, present and future. Better go to GOG and buy the Complete Edition there. Then you will thank me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is not the full version of Heroes 3, but the game itself is an immortal legend",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "AI is OP and does not play by the same rules as you are forced to. It can produce troops when there are none and it's gold even on easy is double yours. It does not loose troops in fights with it's self. In campaign mode it takes your troops between chapters but the AI troop count is what you had at the end of the chapter. Totally unbalanced, not recommended.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you want to play the campaigns, don't buy this!!!!!\n\nYou can buy HOMM3 complete elsewhere.  Do it.  The campaign difficulty on those can't be changed, but it is set to moderate.  Every campaign I've played on this HD version is set to very easy, with no way to change it.\n\nThey boast 30,000 hours of development.  In all that time, nobody noticed that the difficulty was set wrong?\n\nIf you check the discussion board, you will see 10 years of complaints, and yet the developer hasn't bothered to fix it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This isn't the complete version of the game and is incompatible with the popular Horns of the Abyss mod.  It is honestly a ripoff.  Buy the game from GOG instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game does not include all DLCs and is a far cry from the variant of the game I played as a child. I later discovered that one can buy a complete edition elsewhere and play it with a free HD mod! This \"rowork\" is a scam.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh.\nPlayer spells made me remember why this game was something i rarely played as a kid. Recalling this fact has made me hate it. Spells and ranged and you win, 90% of the time. I mean good lord this game belongs in the trash, not propped up as some nostalgic fever dream.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm in process to get a refund.\n\nThe HD was great, graphics are good but in this day an age with the ease and speed of making a game like this remastered this is inexcusable. This is the absolute bare bones beginning game and NOT the complete game that came with the DLC's. Remember, old DLC meant complete game, not just add on content like now.\n\nThis means you get only a few maps to play as a single player and that's it. No random map generator, all the loads of content and elemental class from the DLC's etc just absolute barest minimum effort meaning yet another cash grab. How this game got so many thumbs up with so much missing I have no idea why. Without that DLC it's not even worth the price when it's 75% off.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you like to play a campaign on easy difficulty, then this is the game for you.  I have not found a way to set the difficulty for the campaign games, it seems to start on easy with no apparent way of changing it.  Single scenarios appear to have a difficulty setting, but not the main campaigns.  Also, this looks to be an abbreviated game.  I like the newer Heroes games, but this was supposed to be a classic, reality is a big pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubish*t strikes again\n\nGot halfway through the game and spent so much time completing that Seer's Hut mission, beating those demon prison guards (and the dragons underground to get all the items), only to realize the reward was a lie. Sh*t's bugged and your hero doesn't carry over. He appears as a lowly level 1 worm in the tavern in the next mission, to mock you for paying ubisoft money.\n\nYou got me. \nThe rest of the drawbacks, like the cursor being laggy in the old graphics mode so I have to look at these horrendous \"HD\" ones, are bad. But the game straight up lying is too much.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very different from the original, very unbalanced, playing 5 hour rounds only to lose due to enemies being programmed to win, what the fu*k? I level up to the end, get a massive army, all the relics, just so a guy that just sits at his castle and does nothing would beat me with beginner troops? I gotta stop playing this shit, you're ruining nostalgia for me. The original Heroes III was perfectly balanced, this version is bullsh*t.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's good to comeback after few years, wanted to finish all campaigns but after completing 3 of them I cant go to 4 or 5, they still have white/black image. Something is def wrong, bcs when I finish a campaigne i can save the game (but what for?). After loading saves of completed ones game is crashing. How to fix that **** ?!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Multiplayer does not work, you need to be advanced programer to set it up. It would be great that when you press play you can actually play the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "weird fact... when you playing this game like you should.. the cpu does not .... so whatever you do you can't beat the game . it spawn his own help along the way  .if you cheat .. no achievement.. i wish i could be happy playing this game, but OP cpu are not a good way to win me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I own 3 Heroes games and I never was able to play them. They won't start",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's probably a fun game for most, I just didn't really like it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy as hell.\n\nShould be freeware, it is so bad",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}