{
  "positive": [
    {
      "review": "It was one of the first games I played on my PlayStation 4 back in the day. I replayed it recently, about ten years later, and it’s just as fun as I remembered, maybe even more so.\r\n\r\nFirst of all, Kyrat is beautiful, and I mean beautiful. This game doesn’t look like it’s from 2014. The views are breathtaking, and the setting feels truly unique. It really makes you feel like an outsider in a foreign land.\r\n\r\nThe gunplay is solid. There’s a wide variety of weapons to try out, but truth be told, I stuck with just a few favorites for most of the game.\r\n\r\nThere’s also a ton of side content to do. I genuinely enjoyed 100%ing the game, but I’d be lying if I said I didn’t feel a bit of fatigue after collecting my 40th mask, tearing down my 130th poster, or repeating yet another side mission.\r\n\r\nThe voice acting is phenomenal, especially after making story choices. I actually felt bad after siding with Sabal once, thanks to the amazing performance by Amita’s voice actress. That said, it’s a bit questionable that the characters reveal their true motives and tell you how badly you messed up after you’ve already made your choice.\r\n\r\nPagan Min is wonderful. He’s charismatic, funny, and I always enjoyed listening to him whenever he showed up, same goes for several of the other characters.\r\n\r\nThe story is solid overall, though there’s one part at the airport that I didn’t really care about. It could’ve been handled or explained differently.\r\n\r\nThe Arena is fun, but grinding it to rank 10 for the unique weapon was definitely tedious.\r\n\r\nI also tried the multiplayer for the achievement  it’s pretty much dead, but I’m not surprised, since it didn’t seem particularly interesting.\r\n\r\nAll in all, I can highly recommend this game. It’s my favorite Far Cry title, and I’ll definitely revisit it again at some point in the future.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Best far cry game, ubisoft launcher is trash",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Interesting game, but very short.\n\nI had some trouble at border control, but then an eccentric rich guy showed up and handled the situation. After inviting me to dinner, he mentioned that he knew my late mother. Turns out, he's my step father! Unfortunately, my tour guide overstepped and started texting at the table. Uncle Min (I think that's his name), escorted him out of the room and left me to finish up. After waiting an unbearable amount of time, he finally returned and provided transportation to my sister's grave. Ah! I should have mentioned that I came to this country to unite her with my mother's ashes. It was odd to see a deceased sister I never met, but it felt good to know that her and my mother were at peace. \n\nWould mourn again.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Very good game but for me a bit overwhelming with all of the missions, and not the best optimization.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Played Far Cry 4 for the first time and really enjoyed it.\n\nThe morally ambiguous story makes the antagonist feel like Kyrat’s better choice. Pagan Min seems like the only real hope, while the Golden Path acts like extremists. \n\nBtw, multiplayer is almost dead.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I have played this game originally in 2018, but I returned in 2025 to get the newly added achievements. I can only say that I still enjoyed the game even after more than 10 years since release. I consider it a very nice game with good level design and interesting for completing activities. 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Decided to buy this game for a nostalgia trip, and enjoyed it just as much as when it was new. The graphics and some of the game-play is a little dated, but for an 11 year old game it's still very good. If you haven't played the game before, I would highly recommend it.\n\nIt does need mentioning though that Ubisoft dropped the ball when releasing this game to Steam, and if you download the additional file to access the map editor portion of the game, it will brick your save file. There are solutions available if you google it, but it tends to spoil your afternoon if you weren't expecting it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game itself is excellent in terms of gameplay. I can't say everything else is bad, but the emphasis here is on the gameplay.\nBut the Ubisoft launcher... it's terrible...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nice story line with epic villain and a familiar gameplay.\r\noverall a great game. I love it.\r\nValley of the yeti is also nice, a bit repetitive but a nice story.\r\n\r\nI got 100% achievements, the multiplayer isn't active so you will need to find people online to play with you. So the 100% is a bit of a pain.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This games is great. While the story is not over the top as Far Cry 3's, The Open World and mechanics make up for it, as well as co-op campaign. The Map Editor is offline sadly, but if you want a game on sale that is worth it? This is one of them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry 4 is the last good and interesting far cry campaign , its a must play even in 2025 , better than most games out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "enjoyed it, maybe it was because I played this after 5, but it felt idk outdated, still pretty tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The first game I've played in so long. I used to play only on console (Xbox) decades ago (yea, I'm that old). Played FC4 as I read a review saying it was one of the best in the FC franchise, and I'm glad I picked it up again. It's so much fun and there's really so much you can do in the FC world - still improving my skills, but loving the experience and 'me-time' while absorbed in the game. Have since bought other FC games, and upgraded my PC to play some of the newer games that my old PC can't handle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story fun to follow. Many ways to play the story as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best far cry games and one of my all time favorites, Kyrat is fucked regardless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It doesn't reach the heights of the third game in terms of characters and story, but I found the setting and the explorable world much more enjoyable.\n\nThe characters, apart from the villain, are quite flat and are not given enough time to develop, and the story simply fulfills its role of not interfering with the action. In this vein, the gunplay and movement around the map remain very entertaining.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "veery good for casual and story game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing story and open world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I honestly regret not playing Far Cry 4 earlier. I went in without expecting much, but the game surprised me in the best possible way. Kyrat feels alive, the missions are fun, and exploring the world kept me hooked the entire time. The scenery is absolutely stunning too,,,those cold, gloomy Himalayan vibes really pull you into the atmosphere.\n\nAnd I have to admit Pagan Min ended up being my favorite part of the whole journey. The more the story went on, the more I found myself understanding (and even agreeing with) his point of view. He’s one of those rare villains who completely steals the show.\nMy only real complaint is the performance. Even with a modern setup, the game sometimes dipped below 50 FPS, which was a bit annoying. Without that, it would’ve been almost perfect.\n\nOverall, I really enjoyed my time with Far Cry 4, and I’m honestly kicking myself for not playing it sooner. Definitely recommended. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 for graphics,story and gameplay ...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my first ever far cry (only offline campaign) and here's what I thought :\n\nvisuals are absolutely stunning even for today's standards and I was genuinely shocked that it ran very smoothly with little GPU usage at 144 fps (i use a 3060 Ti) it really shows how unoptimized games are these days.\n\nThe story is pretty cliche and not the best but the subtle world building is cool, and the political aspect of the story is enjoyable If you're into it. And of course, Pagan Min being a fun antagonist to have, although I wouldn't say most intimidating.\n\nThe gameplay good. \nStealth could be better. \nThe various forms of transport is Nice and they actually work well.\nMusic is chef's kiss. I love the radio sessions with the great music and some good old propaganda and also sometimes the radio guy talks about Kyrat, the characters, your choices  etc. which is a really nice touch. \n\nOverall: 8/10  \n\nDefinitely worth buying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game altogether the views, the story and the nostalgia highly recommend it \n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic, better than many newer far cry games. Story, characters, gameplay and a beautiful map. Quite a lot to play, collect stuff and fun side quests. 100% recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though this is an older game, it still holds its charm—especially with the Himalayas in the background and the unexpected attacks from wildlife. It’s a solid experience, and I highly recommend it to anyone looking for a relaxing offline single-player game to unwind with after a hectic day at work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLDR;\r\nI generally like Far Cry games. beautiful vistas, cool guns, nature, interesting villains, if you too like the concept I can recommend this. But out of all of the Far crys this is probably the second worst for me. It's not bad, but the others are better. \r\n\r\nOkay, THE GOOD: Kyrat is a pretty place. \r\nMusic is cool, especialy in the Yogi missions. \r\n\r\nTHE BAD,:\r\n\r\nThe 'Leaving mission area. Mission will fail' message.\r\n\r\nYou can't loot bodies unless standing at a certain angle. Swapping your weapon and looting bodies are bound to the same button, which would be fine if loot was tap, swap was hold, but no, they are both hold button. Interaction prompts are constantly bugged out, sometimes you can takedown enemies from a mile away, sometimes you don't get a prompt at all. \r\n\r\nAbysmal loading times on an SSD and sub 60 fps drops on hardware that's 10 years newer than this game. Especially bad if youtake the camera out.\r\n\r\nUnskippable cutscenes, combined with Cutscene every time you restart a mission.\r\n\r\nGame often forgets to create a checkpoint. Like, after travelling 2000 meters to a compound for a mission, dying, and putting you back to where you started. (often save manually instead, trust me)\r\n\r\nThere's a fake FOV slider, fake because it doesn't show the actual value and maxing it out still looks like it's sub 80. Even after tweaking the ini file it feels off.\r\n\r\nStealth is completely busted, kill one isolated enemy far away from everyone, but if they spot you for a nanosecond, the entire map will suddenly know where you are. Forget chain takedowns entirely. Just shoot everyone with a sniper from very far away.\r\n\r\nSpeaking of, bullets disappear when sniping from a certain distance. \r\n\r\nCivvie running into the side of your car dying, -50 karma.\r\n\r\nTypical uninspired ubislop collectibles. IMO collectibles should have a function in games, not just collect it for the sake of artificially padding out game time. \r\n\r\nCan't fly over mountains, invisible walls repelling the heli. Flying from Utkarsh to the southeast road doesn't even let you fly above the trees. And these limitations seem utterly useless because you can just go around stuff, and it's anti-fun.\r\n\r\nChopper killing you instantly if it tilts even the slightest while landing. \r\n\r\nAnimals suckerpunching you from behind, like a rhino or eagle is fun and 'haha so random' for the first 3 times but it gets massively annoying very quickly.\r\n\r\nAchievement is called: The sky is falling. \r\nDescription: perform a takedown from a buzzer.\r\nYou fly over an enemy, and do a death from above, doesn't work...\r\nYou have to fly next to a vehicle and do a vehicle takedown from the side. THEN WHY THE F IS IT CALLED THE SKY IS FALLING?! I'm pissed because it was quite the achievement to position the buzzer so you can fall on an enemy, and it was massively diappointing to not get the achi for it. The vehicle takedown was much easier. \r\n\r\nWingsuit somemetimes randomly becomes unavailable. I hope you enjoy falling to your death.\r\n\r\nDLC Dependent Achievements.\r\n\r\nThe side-quests get repetitive. For example for Longinus you will be doing the same quest over and over again. Yogi's are a bit more creative but it's still just go to checkpoints a bunch of times. \r\n\r\nThe combat in Shangri-la is just plain awful (till you get the bow shotgun upgrade). Cool bossfight tho.\r\n\r\nSteam counts the ubisoft launcher as play time. So if you forget to close it, congrats, FC4 is now your one of your most played games. I certainly didn't play it for 83 hours. Maybe that's why everyone wants their own launchers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my fifth playthrough and I'm going for 100%. Far Cry 4 is my second-favourite game of all time (first is Minecraft). One thing I love about it is how perfectly balanced the open-world size is for a story-driven game. It’s big enough to explore but not so massive that it pulls you away from the main story. A lot of modern open-world games lose that balance — but Far Cry 4 nails it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry 4 offers stunning scenery, chaotic gunfights, and enough accidental self-inflicted disasters to qualify as a personality trait.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(Game #16 of my 2025 100% Marathon.)\nFar Cry 4 feels like the most polished and cohesive entry to the franchise. The world is jaw-droppingly beautiful at times, showcasing a level of verticality that we don't often see in open world games. The player character and central story are not as interesting as those of Far Cry 3, but the role you play in determining Kyrat's fate through involvement with Amita and Sabal makes up for it, in my opinion. Gunplay is similar to FC3, but still improved in little ways. A 100% run won't force you to do too much extra content, once again taking you to about 75% of the content in exchange for all Steam achievements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry 4 takes the formula from the third game and refines it. The Himalayan setting is beautiful, and the world feels dense and full of things to do. The story isn’t as iconic as in Far Cry 3, but the main antagonist is still interesting, and the gameplay is polished and satisfying.\nIf you enjoy open-world action games with lots of freedom, this one is definitely worth playing.\n\nRating: 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Tough repetitive. Hey, what do you expect, right? It's fuggin Ubisoft.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bring back memories 10/10 game\n\nthough they should optimize it since on my 1060 it was a bit laggy frames dropping out of nowhere",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just replayed this game almost a decade later. Still an absolute masterpiece. I miss Ubisoft's glory days.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it, but it keeps crashing..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The S1rgio\r\n\r\n~ DIFFICULTY ~\r\n✅ Easy\r\n✅ Normal\r\n✅ Hard\r\n✅ A challenge to be reckoned\r\n🔲 In the heat of confrontation, treat your opponent with respect\r\n\r\n\r\n~ GRAPHICS ~\r\n🔲 MS Paint\r\n🔲 Bad\r\n🔲 Meh\r\n🔲 Graphics don't matter for this game\r\n🔲 Good (nothing special)\r\n✅ An original artistic direction\r\n✅ Beautiful\r\n✅ Masterpiece\r\n\r\n\r\n~ STORY ~\r\n✅ This game has no story\r\n🔲 Basic element of the contractual requirements\r\n✅ It's there for people who want it\r\n🔲 Well written\r\n🔲 Leading to more in-depth researches/thoughts\r\n🔲 A model to get inspired by\r\n\r\n\r\n~ LENGTH ~\r\n🔲 Long enough for a cup of tea\r\n✅ Short\r\n✅ Average\r\n✅ Long\r\n🔲 To infinity and beyond\r\n\r\n\r\n~ INTEREST ~\r\n🔲 I would rather watch paint dry\r\n🔲 Hard to enjoy\r\n🔲 Repetitive and/or uninspired\r\n✅ A good moment\r\n✅ Sticking out of the pack\r\n\r\n\r\n~ BUGS ~\r\n✅ Never heard of\r\n🔲 Can get annoying\r\n🔲 Impacts the player's experience\r\n\r\n\r\n~ REQUIREMENTS ~\r\n🔲 You can run it on a microwave\r\n🔲 Low\r\n✅ Average\r\n🔲 High end\r\n\r\n\r\n\r\n~ PRICE ~\r\n✅ Free\r\n✅ Underpriced\r\n✅ Perfect Price\r\n🔲 Could be cheaper\r\n🔲 Overpriced\r\n\r\n\r\n~ WORTH BUYING ~\r\n🔲 No\r\n🔲 If you have nothing else to play\r\n🔲 Wait for sale\r\n✅ Yes\r\n\r\n\r\n\r\n~ Play it or Not ~\r\n✅ Download it\r\n🔲 Don't Download it\r\n🔲 Don't Tuch it and Don't Download it\r\n🔲 Easy to Delete",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coming from Far Cry 3, Far Cry 4 is basically: More of the same, but better.\r\n\r\nThey polished everything, and the world (the Himalayas) is way more fun to explore. You get a grappling hook and a tiny one-man helicopter, which changes everything. Plus, you can ride elephants into battle.\r\n\r\nThe story's not as good, though. The new villain, Pagan Min, is cool and funny, but he's no Vaas. And your character has zero personality.\r\n\r\nBut for pure gameplay, it's an absolute blast. If you loved the loop of Far Cry 3, this is a must-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The characters and dialogues in this game are miles above any of the other games in the franchise. 5 and 6 are right up there with game play but this one is unique in the quality of humor the dialogue it brings as well as the amazing landscapes and overall atmosphere. If you find a few guys playing instruments, stop and listen for a bit and hope there are no ferocious animals nearby to disrupt the peaceful moment. ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My Favorite of the entire Far Cry series.  The villain is so good, I wanted to join his side instead of fighting him. Good story, voice acting is on point, freedom to approach the game how you want, and lots of replay value!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, this is great. So much better than I could've expected.\nThe gameplay is fun as hell, Troy Baker as the villain is amazing, the visuals look great.\n\nAfter getting a little frustrated at [url=https://store.steampowered.com/app/220240/Far_Cry_3]FC3[/url]'s map traversal and not vibing much with [url=https://store.steampowered.com/app/552520/Far_Cry_5]FC5[/url]'s mountain area, I was very afraid that i would not like FC4, since it's mostly based on mountains. But I was wrong, this map is fun to explore around, and that was a very pleasant surprise. \nThe main missions and most sidequests in this game are still fun, unlike some other newer Far Cry games. It's overall just a ton of fun trying to do everything there is to achieve in this entry.\n\nI had a few crashes though, so I had to lower the graphic settings for some \"dream sequences\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game still plays pretty well after almost a decade if not a decade. Lots of nostalgia playing this game with my dad and the chicks are Indian so you know they're hot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good, the story and the graphics are awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Farcry game outside the third. \r\nExpect what you get from 3 but with fun additions and improved mobility.\r\nRecommend playing on Hard difficulty, and challenging yourself with restrictions once familiar with the mechanics.\r\n7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games in all of the Far Cry series, I love snow and mountains and fauna from arctic climates, so this game ticked a box for me even many years ago when I first started playing it. Animations hold up, casting is good, graphics are pretty good, the storyline and quests are pretty okay.\r\n\r\n8/10, love me some tower climber games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very smooth, controls make sense, story is good, game has plenty to do and decent replayability",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In short, I have a hate and love relationship with this game. It is simultaneously one of the best games and one of the worst games I have played.\n\nI love the setting of Kyrat. Beautiful scenery, eastern religion and mysticism, and decently believable settlements. Rabi Ray Rana's broadcast and ramblings are pretty entertaining.\nI hate the setting of Kyrat. Landing with the parachute is janky and irritating a lot of the time, I stumbled upon bad collision on more than one occasion, and the grappling hook system can be a bit janky.\n\nThe game has more bugs than its predecessor. I don't know if this is a Proton thing or not. Aiming down sights or anything else that requires you to hold down RMB can make you feel like Ajay has arthritis or some other ailment: using the mortar was an absolute nightmare. Thankfully you don't need to aim down sights with any of the firearms, hip firing is totally valid despite this not being a 90s game.\nSome unknown locations simply don't register. Like with the ADS conundrum, swimming/diving fast by holding shift also doesn't seem to work properly. You have to essentially do really long presses instead of holding the button down indefinitely.\nSkill issue, maybe, but stealth felt way more brutal and borderline broken at times when compared to the last game.\n\nSpoilers below. You have been warned.\n\nI love the story of Far Cry 4. Pagan Min is an excellent anti-hero-ish character, and it is a shame how little screentime (including his radio messages to Ajay) he got. But even more underutilized were the goons working for Min. Paul and Noore were pretty much just names in the game. Yuma was a bit more memorable than the other two.\nMr. Chiffon's side quests were awesome. As a minor character he was still very memorable, and I love him yapping about fashion and the definition of fierceness. A giant improvement over FC3's billboards.\nYogi and Reggie were pricks, they pricked me, then paid me. Thanks for the free dope I guess?\nShangri-La was pretty good. The takedowns felt way better than the base game's, simply by making them usable more often. The tiger was pretty cute.\nThe other side content is nothing special, but some of the dialogue, particularly in the Armed Escort missions, was good.\n\nI hate the story of Far Cry 4. The Golden Path felt like two idiots fighting, and ironically the real Golden Path would've been to keep the traditions a la Sabal while growing poppies and abolishing the practice of the Tarun Matara and promoting gender equality a la Amita. The whole game I wished I could've joined forces with Pagan.\nI wish that Ajay was a bit more talkative. Maybe not like Jason was, but a little more would've gone a long way.\nWillis has two special powers: backstabbing the player and fluorescence.\nI don't like Longinus' dialogue. And except for the Himalayas mission, they were all lukewarm.\nYogi and Reggie are British.\n\nOverall, this game has a special place in my heart, and I love it despite its flaws and irritating moments.\n8 Digital Pets out of 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the gameplay is amazing, the storyline is also amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game funny lines and an interesting story that fits so well in the fictional country of Kirat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorate first-person shooting game. Bought this on a sale. Go ahead and buy it for yourself!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game's good, but it's more like Far Cry 3.5. It almost feel identical to 3 with minor new features.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A spiritual successor to Far Cry 3, this one refines the formula without trying to reinvent it. Kyrat feels grounded and varied, with a strong sense of place. The gameplay is engaging, with the rich story that unfolds smoothly throughout.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "everybody glazes far cry 3 which was great but this is better tbh.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "drove off a cliff bombed a orphanage and parachuted to bomb factory blew it up and then drove a tuk tuk back home ...this was the first 5 hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "screw the royal army and guard, the biggest threat to kyratis is the wildlife",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My great uncle tony once told me a tale as old as time when he but a humble man celebrating his bachelors party out in the mountains of faroffistan on the other side of the solar system hanging with the locals just vibing drinking bear, doing drugs from sketchy people and overthrowing drug fuelled tyrants which lead had a domino effect of leading to the great gigapower known as stanistan, fly high uncle your legend will live on in and become a franchise to rival stan lee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "same old same old as no 3, but still fun but not ground breaking",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i just like this game, 10/10 anyday, though pagan min is a MASSIVE turn-off, i guess (i don't know, my friend said that).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much murder and explosion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best game i have ever played...Super fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good looking, very smooth, fun to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Far Cry 4 Review[/h1]\n\n[hr]\n[h1]Overview[/h1]\nA solid Far Cry that does exactly what you expect. It looks good, plays fine, and gives you a big checklist playground. It does not meaningfully push the series forward, but if you like the loop you will have a good time.\n\n[hr]\n[h1]What It Is[/h1]\nYou are Ajay Ghale returning to Kyrat, a Himalayan nation torn between Pagan Min’s regime and a rebel faction. You liberate outposts and fortresses, hunt wildlife to upgrade gear, collect resources, and choose how to help the resistance while the story nudges you between key missions.\n\n[hr]\n[h1]World and Atmosphere[/h1]\nKyrat is beautiful and varied. Snowy peaks, forest valleys, hilltop shrines, and cliff roads feel alive with civilians, patrols, wildlife, and random skirmishes. The map size is just right for roaming. Radio towers and viewpoints deliver great vistas. Visuals hold up well for the era.\n\n[hr]\n[h1]Combat and Tools[/h1]\nGunplay is competent. Bows, ARs, SMGs, LMGs, shotguns, pistols, and a few signature guns cover most styles. Stealth with takedowns, bait, and alarms feels familiar from Far Cry 3. Nothing wildly new, but it works.\n\n[hr]\n[h1]Systems and Side Content[/h1]\nTraditional Ubisoft mix: outposts, fortresses, hunting, races, hostage rescues, propaganda posters, collectibles. Loads to do, sometimes too much. Expect repetition if you chase 100 percent or achievements. Arena mode is fun for a bit, but grinding to rank 10 can drag. Multiplayer lobbies are mostly inactive today, so plan boosting if you care about those trophies.\n\n[hr]\n[h1]Story and Villain[/h1]\nThe plot is basic but serviceable. Pagan Min is the standout, a stylish and charismatic antagonist who elevates cutscenes even if he is not quite Vaas-level iconic. Faction choice moments add flavor rather than deep consequences.\n\n[hr]\n[h1]Performance and Polish[/h1]\nRuns well on modern hardware for a 2014 release. Occasional jank is there, but nothing show stopping.\n\n[hr]\n[h1]What Works[/h1]\n[list]\n[*] Striking Himalayan setting with wildlife and constant ambient activity\n[*] Satisfying stealth outpost clears and fortress assaults\n[*] Big toybox of weapons and vehicles\n[*] Pagan Min steals scenes and adds personality\n[/list]\n\n[hr]\n[h1]What Falls Short[/h1]\n[list]\n[*] Feels very close to Far Cry 3 in structure and mechanics\n[*] Side content gets repetitive fast if you do everything\n[*] Arena grind and inactive multiplayer for achievement hunters\n[/list]\n\n[hr]\n[h1]Verdict[/h1]\nRecommended with expectations set. If you want a classic Far Cry loop in a gorgeous new location, Far Cry 4 delivers. If you were hoping for bold changes or a reinvention, this plays it safe. Best enjoyed by focusing on the main path with a curated slice of side activities.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Wingsuited off a cliff straight into a rhino. Peak adventure.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i shot down the twink with a rocket launcher in the endgame and did not side with the women but i did smoke some good meth",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ngl im really enjoy and havin fun with this this one especially with funny thick indian accent when you try to take out propaganda tower lmao, after finished the main campaign i can confirmed its better version of far cry 3 from the story and addition of scuffed helicopter so you can enjoy the scenery while roaming solid 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST FAR CRY GAME WE MUST BRING SOCIALISM TO KYRAT LONG LIVE THE ONE MAN REVOLUTION I LOVE KILLING PEOPLE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "everyone who love Farcry 3 should also play this Farcry4. Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ubisoft connect is the equivalent to a hezbollah torture device",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but not good launcher",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра просто бомба, сюжет, графика, рандомние нпс, как по мне лучше чем 3 часть.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good and i suggest u really should try the Crab Rangoon .D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing graphics for the release",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun and love to play arena in school",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pure fun but tricky in places",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game, i recommend playing it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The NPC's cuss in Hindi.\r\n100/10 -must play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "finished it in 10mins the rest was fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Epic. Well worth your time and money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun for an old game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good but still same f game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W game for it to be so old",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love it when the guards curse in hindi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Mince Multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Far Cry game so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aku nafsu sama badak asia",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my fav far cry games of all time 420/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very impressive even in 2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a solid game. i recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i recommend this because i got nothing else to do in steam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My personal favourite far cry.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I will always love you Ajay, don´t let anyone call you a psicopath",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good but 3 was better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good, just it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game even in 2025 !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE BEST GAME IN THE WORLD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best farcry game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game plays well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "addictive game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "класна гра, рекомендую",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is just farcry, don't over think it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Delicious Crab Rangoons for the King of Kyrat!  :)",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Dont buy this sh1t, if u lose your sh1tsoft acount you may lose the game\n\nF u ubisoft",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "Never buy an Ubisoft game. I tried to run the game but it says \"problem authenticating ownership\". But the funniest thing is that it is my first time running and I only have 1 Ubisoft account, I tried all steps provided by support but still nothing happens. It sucks I can't refund this game because I got it a long time ago. I really hope this company goes under because of its greed and hubris.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I would like to transfer my steam purchased games to a different ubisoft account. Because for example I have 2 version of Far Cry 4. I would like to play original ubisoft connect game on my laptop and steam version on my desktop. Because why not? I have 2 game versions. I have two different computers. But your games tell me that I have to login the same ubisoft account which when I login on both computers, previously registered one disconnects amına koyim.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Does not work on modern systems. As soon as I get past the first Bus sequence which is 5 minutes into the game it drops to single digit FPS or just crashes altogether. Avoid this until Ubisoft decides to fix it. Which at this point I doubt they will.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "ive never seen any game botch borderless mode like this, and its been broken since release (11 years ago). also ubisoft connect is cancer",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Won't run on Linux because Ubisoft thinks Proton is a debugger and blocks the game from starting. Fine, I'll have my money back.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I can't even open the game. many attempts to fix it for an hour, but it still says file system failure. Even pirated games are easier to run. Open your eyes, ubisoft.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ubisoft skcs. for no reason, fc4 wont work any more, and far cry primal which i bought through steam never worked in the first place.\r\n\r\ni messaged ubi through the website after losing hours with their useless troubleshooting steps and now my issue has been escalated for the past 14 days and i cant contact them because itll un-escalate the issue or some bs like that..... \r\n\r\nW game, L company and launcher...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unplayable, stuttering in cut scenes and almost complete freeze in the game, dont bother with this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just play Far Cry 3. This game is just a bunch of classic Ubisoft BS with lots of terrible design choices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Completed the game, started well but got repetitive and tedious fast. Was easier to complete than FC5 though.\n\n- Story is decent but not really up my alley\n- Combat felt boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The campaign missions are mid and anoying. Every time i lauch the game it stretches across my monitors despite everything i try to fix it. The laucher is anoying and uselless. The game itself is actually oretty good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCK ass locked achivment that you cant get cause its online and nobody plays this gold ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "这系列看来也是罐头游戏，因为剧情也拉，跟流水线产的一样。第一人称、垃圾优化、和嗑药版本的正当防卫，第三部叫孤岛惊魂差不多，这部剧情上跟正当防卫差不多，但游戏体验更差",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PC version is shoddily made:\n-MOST FRUSTRATING:  random eagle attacks on humans.\n-Pigs seem to be impervious to arrows.\n-Devil Fish during the first Chiffon quest are blown up by explosives, then you get a notification saying \"Rare Fish must be slain,\" and I'm like LITERALLY I JUST SKINNED THAT S**T AFTER EXPLODING IT\n=Early Game locations are unaccessible (Yalung's Maw, for example). \n-Easy [meaning Story] Mode is a joke (meaning WAYYYY too difficult)\n-Hunting is interrupted by random ATVs/Jeeps (which just drive back and forth needlessly)\n-Hunting targets (especially the Dhare) out of their zones..... ridiculous.\n\nIntriguing plot, though. I'll try to finish it. Pray for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i first played this game when i was 8 years old on my first gen ps3, i loved the crap out of this game back then mainly cus it was a game about shooting people & blowing things up. the problem now is that im 19 and this game aged worse than neglected unwiped ass. it is so freaking boring thank god for the buzzer cus they knew that traversing the environment in this game on foot was unfettered dog poop everything is a gosh darn mountain there are no flat lands. which means u either get in a slow ass car drive to the mission objective, bunny hop there, or u get in a buzzer i picked the latter almost everytime. and even if u feel like exploring there is little to nothing to gain. i know that the buildings are based on nepalian architecture but every single building looks or is the exact same. u go to any of the landmarks its the same ambiance buildings u've seen in an any outpost with some chests scattered about. sometimes it'll lead u to a cave with light from the skybox seeping in with chests that have 2000 rupees in it.  i dont even need to go into the outposts/fortresses cus its just my same complaints from before it is all copied and pasted just reorganized 24 times (same with the bell towers too). i think the thing i enjoyed most doing was collecting skins for the upgrades throwing meat at the ground repeatedly waiting for the animal to come and shooting it in the face was a little fun grind but then oh no the rest of the upgrades are blocked off by having to play the lack luster kyrati fashion week missions, and most of THOSE are locked behind the story missions cus the rest of the outposts are in the northern part of kyrat. the story missions would be so much better if it was like dynamic like far cry 5 and AHEM YOU COULD PLAY THEM IN  CO-OP, i understand that it took them like 4-6 years to design that system but like holy crap this game couldve used it. literally nothing u do feels like it matters, ur just killing onslaughts of enemies and following this loosely told story through unlikable characters and copied and pasted missions. like who am i supposed to route for if everyone is equally as manipulative and terrible than the other. dang all ajay came to kyrat for was to spread his moms ashes unbothered but then hes forced into this bull honky revolution that has nothing to do with him. fighting for a future that involves mega opium trade or child marriages. im happy that u can kill amita after killing sabal and pagan its satisfactory cus its the one time in the game that u actually feel like ur in control of ur own actions and ur not playing as this cuck loser who does everything a story character tells them to. playing this game back also reminded me of this whole like spiritual journey thing this game was going for, yknow with the shangri la missions but its the spiritual journey of a mostly STATIC character with no personality whatsoever!!  like it would've kill the writers to at least write a shed of personality for this guy. he can go on a crazy heroin trip and afterward be like \"Yup!\" no further comment, absolute washboard personality. OH YEA how could i forget this game was made in 2014 SO u gotta put 2 obnoxious stoner druggies that happen to be british CUS EVERY quirky character was british back then. now play these terrible drug trip missions where ur stuff is taken away and you have to run to the mission markers!!! YUP!!!! there was time money and man power allocated for THESE missions I JUST  CAN'T IMAGINE!!!! Also overall traversal in this game feels like ur character has ADHD instead of freaking jumping down from a normal height like any other person ajay will open his wingsuit and glide into the nearest rock cus he feels like it. maybe im hitting the wrong key at the wrong time which then causes this mis input but this happened the majority of my playthrough.  idk the short pump of my long stroke is play far cry 3 instead its literally the same game but better everything overall.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Farcry 4 is one of the best games of the mid 2010's in my book. Essentially, I'd place it neck and neck with the predecessor, Farcry 3. The story is engaging, the lore is solid, progression through it really makes you question the morality behind your choices and which side in the civil war you're supporting, the action is intense and the - \"EAGLE!!!!!1111\" - never fails to get a laugh out of me. \r\n\r\nSo why did I give it a thumbs down? It has nothing to do with the game itself - but with the software launcher. Ubisoft REQUIRES you to download and then launch the game via their crappy, unnecessary third party software, even when you purchase the game through Steam. Their garbage app crashed my PC seemingly every THIRD time I went to launch and play the game. Why does Steam even allow this? \r\n\r\nFarcry 4 is amazing. I'd recommend any fan of the series, or of action RPG shooters to give it a try. But I'd rather go get a used PS4 or Xbone and play it on there rather than risk any further damage to my PC, thanks to the terrible 3rd party app required to play it. This will, sadly - given their repertoire of other classic 2000s and 2010s titles I'd love to replay - be my first, last and ONLY Ubisoft purchase on Steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought it but when trying to play ubisoft showed error and to this day the problem has not resolved. Fick steam and Ubisoft",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't play without an ubisoft account even tough my handlers is Valve. going to wait for the collective action against Ubisoft to see if i can collect on the courth judgement to get a refund outside of steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have no issue with this game but this stupid ubisoft connect is the main issue here i suddenly can login my account after i waste my 25hrs on this game and it suspended me after many login attempt, im not that stupid that i forgot my password, i don't care about that stupid ubisoft connect cant you just remove that shit and let me play game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft Launcher fucking sucks. It can go to hell.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yeah no. The game mechanics are way too old and don't hold up anymore. There are no gun attachments making the gameplay very stale and it definitely wasn't meant to be a story driven game. After playing Far Cry 5 (which at least had good gun mechanics), it definitely feels like a huge step back in quality.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Copypaste, clanky and boring. Too bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "- Im disappointed from positive reviews this game got, it is absolute bullshit - story doesnt make sense and controlls are kinda bad...\nGo play FC5 if you dont play this because of nostalgia, this game is really old and it shows. FC3 has atleast good story.\n- UNSKIPPABLE CUTSCENES FOR THE LOVE OF GOD WHY\n- After I played around 4-5hrs finishing mainly sidequests but also few missions, it did not save for some reason... even tho I saved it manually when finishing,\nalso, it shouldve saved a few times itself considering it saves after missions... for example mission to kill \"special\" animal reset as well...\nIt even reset fortress I did... Only thing that wasnt reset were campaign missions for some reason.\nso yeah, lost hours of gameplay because of [??????]\n- Countless bugs, few times it made me reset and repeat mission because it \"progressed\" right before it said \"completed mission\", it happened more than once in one particular mission\nand when it happened in area mission.... I had to reset every round to \"last checkpoint\" and it made me have no weapons after every reset, last round was especially rough lol\n- Long-ass intro when launching game\n- Most annoying is, because youre gonna be doing it a lot during whole-ass gameplay, looting.\nActually that stupid button is available only sometimes and you have to properly aim at some part of soldiers body, dont be too far/close....\nAlso many times it makes you take weapon instead of \"search\".. bs system if it was only tap for loot, so you dont accidentally take weapon, or enter vehicle near...\nTo add to this - after you drop the weapon and pick it back up, it magically takes out some bullets out of it - wtf?\n- When you kill soldier/animal it takes a while to become lootable/skinnable. Combined with previous point it is double-annoying.\n- Soldiers on hard difficulty are actually very easy, even in north.\n- If you kill soldier, others magically know where you shot from (with silencer obv) if they see that body,\nbut I guess benefit of the doubt - this is mechanic to not be that easy otherwise it could be abused.\n- When you go somewhere and leave outpost, it fucking yells at you to come back and \"save\" the camp from takeover, it happens really really often\nand it is annoying. You are obviously going somewhere, especially when you have some place checkpoint on map, but it gets you to come back for this bull and removes your checkpoint...\nLuckily it is not necessary to do and they lie that enemy can overtake outpost back.\n- When you are on fire it is skewed with healing mechanic, I can't properly explain it in few words, but is is really annoying.\nIf you play/will play this game, you will see what I mean.\n- If you do some interaction that leads to mission end, you actually dont stop moving, for example you can fall out of motherfucking bell tower\n- Boost to karma \"reward\" after you easily finished max karma level hours ago\n- UNSKIPPABLE CUTSCENES REEEEEEEEEEEEEEEE\n- Max karma reward (which takes relatively long to complete) is bull, 25% discount on maps - i bought all maps in first few hours of gameplay\n- When you are climbing something you cant cancel animation, you also can't look around - your view is \"static\"\n- More than once I got bugged because of those \"destructible\" things into corners or rooms and I had to either restart\nor loudly (with grenade for example) break it because knife didnt work\n- Skills constantly spamming you to \"open skill menu\" when you want to open map it opens skills,\nespecially when there are no new skills and you dont want those that are currently available\n- Opening loot menu is annoying there isnt shortcut for it and you need to change multiple tabs and click on \"loot bag\".\nEvery time you turn on/off game it refreshes how you wanted to sort it and goes back to default sorting...\n- Weapon customization has really bad controls, takes unecessary long to modify a gun, etc\n- Wingsuit on shift lol (even when toggled sprinting, sometimes it fucks you even when you spent hours getting used to it)\n- You cant buy all ammo, only for weapons that you have equipped, and when you go buy it one by one (one by one bullets or bullet types) it annoyingly shows\n\"you bought this in case you didnt notice, press little button to continue so you can buy next few bullets\"\n- Buying is also annoying when you swap categories, you need to wait a bit for it to show and also a bit to allow scrolling\n- Ammo is generally bugged, but nothing totally game-breaking\n-- special arrows after mission have weird count usually\n-- scrolling for throwable is total bullshit, why you cant scroll when you are swapping weapon or using syringe....\nor when you scroll up/down it does whatever it wants (it seems predetermined, but logically bullshit it starts from [probably] slot 1 when you scroll up,\nand when you scroll down it starts from different slot lol, instead of starting at throwable youre on currently)\n-- throwable count is after you teleport/restart mission bugged shows bogus numbers\n-- crossbow is bugged, you \"take\" bolts from ground, but since you didnt reload they just disappear because you have full belt,\nsame with assault rifle from dead bodies for example but you have way more AR rounds so its not that annoying that you lose few\n- when you loot with full bag or wallet, and then have some spare space, you cannot loot it again to take what you didnt loot before getting space\n- HUD for ammo hides quickly after you finish using gun and if you want to see how much ammo you have left, you need to swap your weapons, you cant \"reselect\" same slot. It wont refresh hud.\n- syringes are also bugged, I few times after mission encountered that they just disappeared if I crafted some during mission - I lost syringes and leaves\n- kinda good autodrive to not fall out of road when you shoot, actually really good considering how much shit of a controls this game has\n-- but absolutely absolutely retarded autoaim when you drive\n- UNSKIPPABLE CUTSCENES REEEEEEEEEEEEEEEE\n- Special honeybagder was unironically easiest \"predator\" animal and didnt even attack me once, thought it was supposed to be hardest",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst FC story. I just dont like narco trips.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "co-op is unable in it's currrent state",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you cant lunch the damm game on Windows 11",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: PRIVACY RISK & DATA HARVESTING\n\nAs both a long-time gamer and an investor, I look at products through two lenses: quality of experience and business sustainability. Ubisoft is currently failing at both.\n\nThe Privacy Issue: This \"game\" is essentially spyware wrapped in a launcher. The moment you install it, you are forced to agree to a Terms of Service that allows Ubisoft to harvest your personal data—including usage habits, IP location, and hardware specs—and share it with \"trusted partners\" (advertisers and data brokers).\n\nThey are not just selling you a product but a  temporary license to play; they are selling YOU to third parties.\n\nForced Third-Party Account: You cannot play this single-player game without logging into Ubisoft Connect, which exists solely to track engagement metrics and feed their data pipeline.\n\n \"Active Sharing\": Buried in their settings is an option called \"Active Sharing\" which defaults to sharing your personal info with companies like Facebook and LiveRamp.\n\nTelemetry: Even in single-player, the client sends hundreds of packets to external analytics servers (Google, Amazon, Datadog) to track your behavior.\n\nThe Investor Perspective: From a business standpoint, this strategy is disastrous. Ubisoft is trading long-term brand loyalty for short-term data monetization. They are alienating their core customer base to chase \"whales\" and sell user data. This is why their stock is at a 10-year low. A company that treats its paying customers as data points to be harvested rather than people to be entertained is a failing company.\n\nConclusion: I refunded this immediately. Do not support this anti-consumer practice. If you value your privacy and digital ownership, do not buy this.\n\nFinal Verdict: 0/10 - Refunded due to invasive data policies.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game, but ubisoft conect",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, i really love this game, but consider this like, an extra negative review for far cry 5, which is just abysmally bad. I just felt like a single negative review on far cry 5 wasn't enough, so  ubisoft is getting it on FC4 as well. (But FC4 is really good, consider this a positive review)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Glitchy with XBOX controller.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst game in the series imo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "F##k ubisoft with a big rubber d!ck",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can not change language from russian to English",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why the hell this game doesn't have English in my region?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Only Russian is available",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "ubisoft мрази",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I CAN'T FIND MY CD KEYYYYY",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boooooring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fuck you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to be a good game. Ubisoft now requires their own buggy installer to play anything.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Dont buy this sh1t, if u lose your sh1tsoft acount you may lose the game\n\nF u ubisoft",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "3 bugs in the first 5? 10? minutes of gameplay. First, the truck wouldn't leave in the starting mission. Had to reset checkpoint twice. Then, the gun under dash wouldn't spawn. Had to reset checkpoint again. Then, when the truck crashed, it stayed on music playing on a black screen for several minutes. I would love to play this game but it seems like it's going to just be headache after headache thanks to ubisoft just abandoning it. Playing on more than good enough hardware btw.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I would like to transfer my steam purchased games to a different ubisoft account. Because for example I have 2 version of Far Cry 4. I would like to play original ubisoft connect game on my laptop and steam version on my desktop. Because why not? I have 2 game versions. I have two different computers. But your games tell me that I have to login the same ubisoft account which when I login on both computers, previously registered one disconnects amına koyim.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "ive never seen any game botch borderless mode like this, and its been broken since release (11 years ago). also ubisoft connect is cancer",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The intro is promising, but it gets annoying to play after that. You're constantly bombarded with screaming voice lines and unnecessary interruptions of mini-tasks on your way to an objective and it gets old quickly. Weapons are fine but that's worthless if enemies feel like cardboard cutouts and engaging with them becomes a chore every time.\n\nCutscenes are unskippable and I've struggled with trying not to close the game during certain cringe worthy humor attempts from characters that shouldn't have to get more than a 10-second appearance to give you a mission. Cutting out about 90% of dialogue and voice lines would improve this game and maybe I would have finished it.\n\nIt feels like not playing anything would be more fun than playing this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Won't run on Linux because Ubisoft thinks Proton is a debugger and blocks the game from starting. Fine, I'll have my money back.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't think i have ever hated a game more, the amount of bugs, i have played far cry 5 and i did love it but this is just so bad, bullets not registering to the player being given barely any amount of ammo, melle not registering",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Shitsoft being Shitsoft, I bought the game on Ukraine Region, and the voice languages is forced russian, no english at all, and every time you restart the game, the ui returns to Russian\nSuch a restarted move by Shitsoft",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Very torn ont his one. I greatly enjoyed the previous game, but this is just such a mixed bag. The main story is simply not interesting at all. I have no connection to any of the characters, I've already forgot all of their names. Even the villain is so boring, just some blond cocky guy and that's it. The main quests are not special at all, I enjoyed the side content far more, since it's straight forward without needing to listen to badly written characters talking about things that don't interest me at all. Even the Shangri-La quests were not my cup of tea, visually it was beautiful, but it just took me out of the game so much.\n\nThe writing is literaly garbage, I had a radio call at one point and the guy started to talk about how my character must have an itchy asshole, because he's on a mission all the time... It's just so offputting. There are some improvements in the gameplay, I really enjoyed piloting the buzzers and most of the grappling hook segments. The gliding could have been better, but it was not horrible in general.\n\nI also liked the additional events in the open world, it almost made the place feel more alive, but kind of fails at it too, since the NPCs are so unaware of everything, that it takes that away immediately (eg. frendlies driving into your car all the time).\n\nIn short, if you are playing for anything besides the gunplay or stealthily taking out camps, then you will probably not enjoy this game at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you intend to buy the game purely for co-op purposes, find something else. Does not work",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Buggy as hell. It's like reinvented fc3, some things are better, but many of them are worse. Too bad I can't return this anymore. Its unpalyable, i mean this is simply unpleasant to play. \nPlayed a little more: It's just bad and frustrating.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After figuring out that Steam Input is required to use a game pad (Xbox One controller), then figuring out all but 4 CPU cores need to be disabled to run the game at a consistent FPS, I found the game to be horrible. This game should be free to play for how bad it is.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Unplayable, doesn't utilize cores right, even with manually deactivating cores and threads always below 60 fps, needs ubisoft connect bloatware.\nUbisoft doesn't care about this problem, complete ripoff.\n\nDon't waste your time and money guys.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "unplayable, stuttering in cut scenes and almost complete freeze in the game, dont bother with this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ubisoft skcs. for no reason, fc4 wont work any more, and far cry primal which i bought through steam never worked in the first place.\r\n\r\ni messaged ubi through the website after losing hours with their useless troubleshooting steps and now my issue has been escalated for the past 14 days and i cant contact them because itll un-escalate the issue or some bs like that..... \r\n\r\nW game, L company and launcher...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just play Far Cry 3. This game is just a bunch of classic Ubisoft BS with lots of terrible design choices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "这系列看来也是罐头游戏，因为剧情也拉，跟流水线产的一样。第一人称、垃圾优化、和嗑药版本的正当防卫，第三部叫孤岛惊魂差不多，这部剧情上跟正当防卫差不多，但游戏体验更差",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PC version is shoddily made:\n-MOST FRUSTRATING:  random eagle attacks on humans.\n-Pigs seem to be impervious to arrows.\n-Devil Fish during the first Chiffon quest are blown up by explosives, then you get a notification saying \"Rare Fish must be slain,\" and I'm like LITERALLY I JUST SKINNED THAT S**T AFTER EXPLODING IT\n=Early Game locations are unaccessible (Yalung's Maw, for example). \n-Easy [meaning Story] Mode is a joke (meaning WAYYYY too difficult)\n-Hunting is interrupted by random ATVs/Jeeps (which just drive back and forth needlessly)\n-Hunting targets (especially the Dhare) out of their zones..... ridiculous.\n\nIntriguing plot, though. I'll try to finish it. Pray for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i first played this game when i was 8 years old on my first gen ps3, i loved the crap out of this game back then mainly cus it was a game about shooting people & blowing things up. the problem now is that im 19 and this game aged worse than neglected unwiped ass. it is so freaking boring thank god for the buzzer cus they knew that traversing the environment in this game on foot was unfettered dog poop everything is a gosh darn mountain there are no flat lands. which means u either get in a slow ass car drive to the mission objective, bunny hop there, or u get in a buzzer i picked the latter almost everytime. and even if u feel like exploring there is little to nothing to gain. i know that the buildings are based on nepalian architecture but every single building looks or is the exact same. u go to any of the landmarks its the same ambiance buildings u've seen in an any outpost with some chests scattered about. sometimes it'll lead u to a cave with light from the skybox seeping in with chests that have 2000 rupees in it.  i dont even need to go into the outposts/fortresses cus its just my same complaints from before it is all copied and pasted just reorganized 24 times (same with the bell towers too). i think the thing i enjoyed most doing was collecting skins for the upgrades throwing meat at the ground repeatedly waiting for the animal to come and shooting it in the face was a little fun grind but then oh no the rest of the upgrades are blocked off by having to play the lack luster kyrati fashion week missions, and most of THOSE are locked behind the story missions cus the rest of the outposts are in the northern part of kyrat. the story missions would be so much better if it was like dynamic like far cry 5 and AHEM YOU COULD PLAY THEM IN  CO-OP, i understand that it took them like 4-6 years to design that system but like holy crap this game couldve used it. literally nothing u do feels like it matters, ur just killing onslaughts of enemies and following this loosely told story through unlikable characters and copied and pasted missions. like who am i supposed to route for if everyone is equally as manipulative and terrible than the other. dang all ajay came to kyrat for was to spread his moms ashes unbothered but then hes forced into this bull honky revolution that has nothing to do with him. fighting for a future that involves mega opium trade or child marriages. im happy that u can kill amita after killing sabal and pagan its satisfactory cus its the one time in the game that u actually feel like ur in control of ur own actions and ur not playing as this cuck loser who does everything a story character tells them to. playing this game back also reminded me of this whole like spiritual journey thing this game was going for, yknow with the shangri la missions but its the spiritual journey of a mostly STATIC character with no personality whatsoever!!  like it would've kill the writers to at least write a shed of personality for this guy. he can go on a crazy heroin trip and afterward be like \"Yup!\" no further comment, absolute washboard personality. OH YEA how could i forget this game was made in 2014 SO u gotta put 2 obnoxious stoner druggies that happen to be british CUS EVERY quirky character was british back then. now play these terrible drug trip missions where ur stuff is taken away and you have to run to the mission markers!!! YUP!!!! there was time money and man power allocated for THESE missions I JUST  CAN'T IMAGINE!!!! Also overall traversal in this game feels like ur character has ADHD instead of freaking jumping down from a normal height like any other person ajay will open his wingsuit and glide into the nearest rock cus he feels like it. maybe im hitting the wrong key at the wrong time which then causes this mis input but this happened the majority of my playthrough.  idk the short pump of my long stroke is play far cry 3 instead its literally the same game but better everything overall.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Farcry 4 is one of the best games of the mid 2010's in my book. Essentially, I'd place it neck and neck with the predecessor, Farcry 3. The story is engaging, the lore is solid, progression through it really makes you question the morality behind your choices and which side in the civil war you're supporting, the action is intense and the - \"EAGLE!!!!!1111\" - never fails to get a laugh out of me. \r\n\r\nSo why did I give it a thumbs down? It has nothing to do with the game itself - but with the software launcher. Ubisoft REQUIRES you to download and then launch the game via their crappy, unnecessary third party software, even when you purchase the game through Steam. Their garbage app crashed my PC seemingly every THIRD time I went to launch and play the game. Why does Steam even allow this? \r\n\r\nFarcry 4 is amazing. I'd recommend any fan of the series, or of action RPG shooters to give it a try. But I'd rather go get a used PS4 or Xbone and play it on there rather than risk any further damage to my PC, thanks to the terrible 3rd party app required to play it. This will, sadly - given their repertoire of other classic 2000s and 2010s titles I'd love to replay - be my first, last and ONLY Ubisoft purchase on Steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought it but when trying to play ubisoft showed error and to this day the problem has not resolved. Fick steam and Ubisoft",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool idea, but didnt like following things... Very clunky - my sniper bullets sometimes get blocked by a bush thats partly in the way of my target but he can easy hit me with his pistol back. Driving is worse than GTA. The healing animation + reload animation is frustrating when you run out of bullets and health at the same time. Also - enemy waves. Kill 20 to get in the base, then repel 100. All that with 90 bullets and 1 vest. Lots of time-limit missions and waves of enemies. I just dislike the difficulty for difficulty sake. Also, tons of side missions that dont really make any sense to do. You still can just do main missions with 0 need to do all the towers and camps, and 200 other things. Seems like just put there so it looks like \"a lot to do\" but there is very few moments when that makes sense. Could be an great game with half the pointless side crap all around the map, and a bit less wave repelling with very limited bullets. Other than that, everything looks nice and and maybe it didnt feel right since im plating it at 2025 and the clunky-oldness just isnt worth for me to get frustrated about all the waves.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I purchased DLC, paid for it, and was told it was in \"game menu\" - it was NOT! I have been unhappy with the LOOOOOOOOOOOOOOOOOONG LOAD TIMES for some time. The game likes to promote itself and its parts EVERY time I launch it, and in looking for me DLC I experienced that on steroids. It is otherwise a good game, but me, I AM DONE WITH IT.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is fine, PC version doesn't work so hot. Buggy and laggy, even on a PC that well exceeds the recommended specs. You sure you don't have a console you can play this on?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not a good storyline as 3 comapatively and not a good and appropiate story objectively and in general.. \r\nL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't play without an ubisoft account even tough my handlers is Valve. going to wait for the collective action against Ubisoft to see if i can collect on the courth judgement to get a refund outside of steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have no issue with this game but this stupid ubisoft connect is the main issue here i suddenly can login my account after i waste my 25hrs on this game and it suspended me after many login attempt, im not that stupid that i forgot my password, i don't care about that stupid ubisoft connect cant you just remove that shit and let me play game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yeah no. The game mechanics are way too old and don't hold up anymore. There are no gun attachments making the gameplay very stale and it definitely wasn't meant to be a story driven game. After playing Far Cry 5 (which at least had good gun mechanics), it definitely feels like a huge step back in quality.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Copypaste, clanky and boring. Too bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "- Im disappointed from positive reviews this game got, it is absolute bullshit - story doesnt make sense and controlls are kinda bad...\nGo play FC5 if you dont play this because of nostalgia, this game is really old and it shows. FC3 has atleast good story.\n- UNSKIPPABLE CUTSCENES FOR THE LOVE OF GOD WHY\n- After I played around 4-5hrs finishing mainly sidequests but also few missions, it did not save for some reason... even tho I saved it manually when finishing,\nalso, it shouldve saved a few times itself considering it saves after missions... for example mission to kill \"special\" animal reset as well...\nIt even reset fortress I did... Only thing that wasnt reset were campaign missions for some reason.\nso yeah, lost hours of gameplay because of [??????]\n- Countless bugs, few times it made me reset and repeat mission because it \"progressed\" right before it said \"completed mission\", it happened more than once in one particular mission\nand when it happened in area mission.... I had to reset every round to \"last checkpoint\" and it made me have no weapons after every reset, last round was especially rough lol\n- Long-ass intro when launching game\n- Most annoying is, because youre gonna be doing it a lot during whole-ass gameplay, looting.\nActually that stupid button is available only sometimes and you have to properly aim at some part of soldiers body, dont be too far/close....\nAlso many times it makes you take weapon instead of \"search\".. bs system if it was only tap for loot, so you dont accidentally take weapon, or enter vehicle near...\nTo add to this - after you drop the weapon and pick it back up, it magically takes out some bullets out of it - wtf?\n- When you kill soldier/animal it takes a while to become lootable/skinnable. Combined with previous point it is double-annoying.\n- Soldiers on hard difficulty are actually very easy, even in north.\n- If you kill soldier, others magically know where you shot from (with silencer obv) if they see that body,\nbut I guess benefit of the doubt - this is mechanic to not be that easy otherwise it could be abused.\n- When you go somewhere and leave outpost, it fucking yells at you to come back and \"save\" the camp from takeover, it happens really really often\nand it is annoying. You are obviously going somewhere, especially when you have some place checkpoint on map, but it gets you to come back for this bull and removes your checkpoint...\nLuckily it is not necessary to do and they lie that enemy can overtake outpost back.\n- When you are on fire it is skewed with healing mechanic, I can't properly explain it in few words, but is is really annoying.\nIf you play/will play this game, you will see what I mean.\n- If you do some interaction that leads to mission end, you actually dont stop moving, for example you can fall out of motherfucking bell tower\n- Boost to karma \"reward\" after you easily finished max karma level hours ago\n- UNSKIPPABLE CUTSCENES REEEEEEEEEEEEEEEE\n- Max karma reward (which takes relatively long to complete) is bull, 25% discount on maps - i bought all maps in first few hours of gameplay\n- When you are climbing something you cant cancel animation, you also can't look around - your view is \"static\"\n- More than once I got bugged because of those \"destructible\" things into corners or rooms and I had to either restart\nor loudly (with grenade for example) break it because knife didnt work\n- Skills constantly spamming you to \"open skill menu\" when you want to open map it opens skills,\nespecially when there are no new skills and you dont want those that are currently available\n- Opening loot menu is annoying there isnt shortcut for it and you need to change multiple tabs and click on \"loot bag\".\nEvery time you turn on/off game it refreshes how you wanted to sort it and goes back to default sorting...\n- Weapon customization has really bad controls, takes unecessary long to modify a gun, etc\n- Wingsuit on shift lol (even when toggled sprinting, sometimes it fucks you even when you spent hours getting used to it)\n- You cant buy all ammo, only for weapons that you have equipped, and when you go buy it one by one (one by one bullets or bullet types) it annoyingly shows\n\"you bought this in case you didnt notice, press little button to continue so you can buy next few bullets\"\n- Buying is also annoying when you swap categories, you need to wait a bit for it to show and also a bit to allow scrolling\n- Ammo is generally bugged, but nothing totally game-breaking\n-- special arrows after mission have weird count usually\n-- scrolling for throwable is total bullshit, why you cant scroll when you are swapping weapon or using syringe....\nor when you scroll up/down it does whatever it wants (it seems predetermined, but logically bullshit it starts from [probably] slot 1 when you scroll up,\nand when you scroll down it starts from different slot lol, instead of starting at throwable youre on currently)\n-- throwable count is after you teleport/restart mission bugged shows bogus numbers\n-- crossbow is bugged, you \"take\" bolts from ground, but since you didnt reload they just disappear because you have full belt,\nsame with assault rifle from dead bodies for example but you have way more AR rounds so its not that annoying that you lose few\n- when you loot with full bag or wallet, and then have some spare space, you cannot loot it again to take what you didnt loot before getting space\n- HUD for ammo hides quickly after you finish using gun and if you want to see how much ammo you have left, you need to swap your weapons, you cant \"reselect\" same slot. It wont refresh hud.\n- syringes are also bugged, I few times after mission encountered that they just disappeared if I crafted some during mission - I lost syringes and leaves\n- kinda good autodrive to not fall out of road when you shoot, actually really good considering how much shit of a controls this game has\n-- but absolutely absolutely retarded autoaim when you drive\n- UNSKIPPABLE CUTSCENES REEEEEEEEEEEEEEEE\n- Special honeybagder was unironically easiest \"predator\" animal and didnt even attack me once, thought it was supposed to be hardest",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst FC story. I just dont like narco trips.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "co-op is unable in it's currrent state",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you cant lunch the damm game on Windows 11",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great game, but ubisoft conect",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, i really love this game, but consider this like, an extra negative review for far cry 5, which is just abysmally bad. I just felt like a single negative review on far cry 5 wasn't enough, so  ubisoft is getting it on FC4 as well. (But FC4 is really good, consider this a positive review)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst game in the series imo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "F##k ubisoft with a big rubber d!ck",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can not change language from russian to English",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why the hell this game doesn't have English in my region?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Only Russian is available",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "boooooring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dont buy this sh1t, if u lose your sh1tsoft acount you may lose the game\n\nF u ubisoft",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "Never buy an Ubisoft game. I tried to run the game but it says \"problem authenticating ownership\". But the funniest thing is that it is my first time running and I only have 1 Ubisoft account, I tried all steps provided by support but still nothing happens. It sucks I can't refund this game because I got it a long time ago. I really hope this company goes under because of its greed and hubris.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Used to be a good game. Ubisoft now requires their own buggy installer to play anything.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "I would like to transfer my steam purchased games to a different ubisoft account. Because for example I have 2 version of Far Cry 4. I would like to play original ubisoft connect game on my laptop and steam version on my desktop. Because why not? I have 2 game versions. I have two different computers. But your games tell me that I have to login the same ubisoft account which when I login on both computers, previously registered one disconnects amına koyim.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "3 bugs in the first 5? 10? minutes of gameplay. First, the truck wouldn't leave in the starting mission. Had to reset checkpoint twice. Then, the gun under dash wouldn't spawn. Had to reset checkpoint again. Then, when the truck crashed, it stayed on music playing on a black screen for several minutes. I would love to play this game but it seems like it's going to just be headache after headache thanks to ubisoft just abandoning it. Playing on more than good enough hardware btw.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "ive never seen any game botch borderless mode like this, and its been broken since release (11 years ago). also ubisoft connect is cancer",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The intro is promising, but it gets annoying to play after that. You're constantly bombarded with screaming voice lines and unnecessary interruptions of mini-tasks on your way to an objective and it gets old quickly. Weapons are fine but that's worthless if enemies feel like cardboard cutouts and engaging with them becomes a chore every time.\n\nCutscenes are unskippable and I've struggled with trying not to close the game during certain cringe worthy humor attempts from characters that shouldn't have to get more than a 10-second appearance to give you a mission. Cutting out about 90% of dialogue and voice lines would improve this game and maybe I would have finished it.\n\nIt feels like not playing anything would be more fun than playing this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Won't run on Linux because Ubisoft thinks Proton is a debugger and blocks the game from starting. Fine, I'll have my money back.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I can't even open the game. many attempts to fix it for an hour, but it still says file system failure. Even pirated games are easier to run. Open your eyes, ubisoft.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Compared to other games in this series this one is a big flop, The villian works perfectly but the story just sucks and the gameplay just didn't feel enjoyable. Had a few issues with this game first the wingsuit button and the run button are the same so if you try to run and jump you will end up going into wingsuit mode and hit a wall and die. This mainly happens when trying to climb broadcast towers, jumping gaps, or trying to land on enemies. A major oversite and really annoying. Secondly I hate that they changed to the thumbsticks over the trigger for driving (with controller). A few bugs in this one and the game does crash on occasion as well so make sure to save periodically.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't think i have ever hated a game more, the amount of bugs, i have played far cry 5 and i did love it but this is just so bad, bullets not registering to the player being given barely any amount of ammo, melle not registering",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Shitsoft being Shitsoft, I bought the game on Ukraine Region, and the voice languages is forced russian, no english at all, and every time you restart the game, the ui returns to Russian\nSuch a restarted move by Shitsoft",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Very torn ont his one. I greatly enjoyed the previous game, but this is just such a mixed bag. The main story is simply not interesting at all. I have no connection to any of the characters, I've already forgot all of their names. Even the villain is so boring, just some blond cocky guy and that's it. The main quests are not special at all, I enjoyed the side content far more, since it's straight forward without needing to listen to badly written characters talking about things that don't interest me at all. Even the Shangri-La quests were not my cup of tea, visually it was beautiful, but it just took me out of the game so much.\n\nThe writing is literaly garbage, I had a radio call at one point and the guy started to talk about how my character must have an itchy asshole, because he's on a mission all the time... It's just so offputting. There are some improvements in the gameplay, I really enjoyed piloting the buzzers and most of the grappling hook segments. The gliding could have been better, but it was not horrible in general.\n\nI also liked the additional events in the open world, it almost made the place feel more alive, but kind of fails at it too, since the NPCs are so unaware of everything, that it takes that away immediately (eg. frendlies driving into your car all the time).\n\nIn short, if you are playing for anything besides the gunplay or stealthily taking out camps, then you will probably not enjoy this game at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you intend to buy the game purely for co-op purposes, find something else. Does not work",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Does not work on modern systems. As soon as I get past the first Bus sequence which is 5 minutes into the game it drops to single digit FPS or just crashes altogether. Avoid this until Ubisoft decides to fix it. Which at this point I doubt they will.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Buggy as hell. It's like reinvented fc3, some things are better, but many of them are worse. Too bad I can't return this anymore. Its unpalyable, i mean this is simply unpleasant to play. \nPlayed a little more: It's just bad and frustrating.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After figuring out that Steam Input is required to use a game pad (Xbox One controller), then figuring out all but 4 CPU cores need to be disabled to run the game at a consistent FPS, I found the game to be horrible. This game should be free to play for how bad it is.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Unplayable, doesn't utilize cores right, even with manually deactivating cores and threads always below 60 fps, needs ubisoft connect bloatware.\nUbisoft doesn't care about this problem, complete ripoff.\n\nDon't waste your time and money guys.",
      "voted_up": false,
      "votes_helpful": 5
    }
  ]
}