{
  "positive": [
    {
      "review": "It's a nice timekiller while you're waiting on your other game to load or just sitting there like a lump. It's very similar to the V-pet one, but better graphics.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h2] Pocket Waifu: Desktop Pet[/h2]  \n\nThis is the BEST FREE desktop companion I've ever seen. \nShe's cute there are so many interactions we can do. You can give her snacks and plushies, dress her up, I haven't tried all the options and activities yet but you can go fishing, gaming, to get in game money or rewards, you also get seasonal activities. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The pet is pretty cute.  High kawaii value. The buy on market is pretty easy and cheap too.  It's a good game. Just remember to click on bear and send \"to the mines\"...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Как же все продумано до мелочей! Деталь, на которую не обратил внимания в начале, позже оказалась ключевой зацепкой. Чувствуется уважение к игроку и его интеллекту.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Прикольные вайфу, которые захватывают тебя с первого вида. С первого взгляда. Игра прикольная всем советую, а главное что бесплатная и аналог ее нет",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Didn't know the streamer, but his desktop idler is actually pretty good. Looks nice, lots of options to unlock, with some minor manual management tasks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a virtual pet\r\nit's silvervale\r\nit runs in the background\r\nit's free\r\nit's adorable and very cute\r\ni don't see any reason not to have this as someone who was a child in the 90s",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Идеальный темп — не торопит, давая возможность впитать атмосферу. Прекрасный антистресс после тяжелого дня, когда хочется просто погрузиться в другой мир.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really nice little feature you can have on your desktop, personally love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DOOT DOOT DOOT do, DOOT DOOT DOOT do, DOOT DOOT DOOT do, DOOT DOOT DOOT do, DOOT DOOT DOOT do, DOOT DOOT DOOT do, FIRE!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I put her on my knees and stroked her, good girl on the desktop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's so cute and i love to take care of smol Silvervale ♥",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good goonable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cute",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST MINI WAIFU",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute pet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "adorable :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Inikah my..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I work in front of the computer and don't get to see many friends because everyone has to go live in other provinces But the game makes me not feel lonely sometimes Having this little friend makes me a little happy",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "This is a desktop pet that is not a virus. \r\n\r\nGives me something to occasionally do.\r\n\r\nNeeds animation for petting her while she's doing the stream activity.\r\n\r\nFour and a half out of five stars.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Desk waifu is super cute. Really easy to earn in game money. Love the fun achievements.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's a nice timekiller while you're waiting on your other game to load or just sitting there like a lump. It's very similar to the V-pet one, but better graphics.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h2] Pocket Waifu: Desktop Pet[/h2]  \n\nThis is the BEST FREE desktop companion I've ever seen. \nShe's cute there are so many interactions we can do. You can give her snacks and plushies, dress her up, I haven't tried all the options and activities yet but you can go fishing, gaming, to get in game money or rewards, you also get seasonal activities. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The pet is pretty cute.  High kawaii value. The buy on market is pretty easy and cheap too.  It's a good game. Just remember to click on bear and send \"to the mines\"...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Silvy is such a cute and fun desktop pet to have. Makes your time at your PC just a little bit more fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly its quite nice to have her just chill in the backround while you do work, or other stuff. I would highly recommend it to others",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dude this is so awesome\n\nonly complaint is that there's no steam cloud, and i own multiple computers so having two different save data for both is kinda buns </3 and that steam considers this a game and not software, so whenever you close another game, steam actively exposes you for hopping on an already active \"game\".\n\neven with that, the aesthetic and one of my oshis being the face, is pretty awesome and cute!\n\noverall 8/10 (please PLEASE add steam cloud if possible)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "20/10 would recommend! It's so freaking cute and brings back the 2000's with lots of different customization and activities <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty cute little desktop pet, Liking the associated streamer is probably a plus but I don't watch them and it's still cool to have. Definitively good either way!\r\n\r\nPlenty of settings and customization for all your needs, things to do when you want to do them and optional daily things with minimal fomo.\r\n\r\nHaving multiple monitors is highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun little \"game\" to have running in the background.\r\n\r\nThe animations are very cute and there's lots of cosmetics to collect.\r\n\r\nJust don't expect much gameplay since it requires very little input, sorta like a low stakes tamagotchi.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a really cute thing to have on your computer, especially when you are playing another game and see little Silver running around on the screen being all cute. Would definitely recommend that others should download it if they want a little companion on their computer screen or just want to see a cute little creature roam about to keep you company",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice little pet sim. Lots of collectibles and achievements to earn. Gotta love the waifu.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cute, I like having a little buddy on my screen and this one is the least distracting and you can change outfits. You can have her do an activity and leave her alone (stream, play game, movie) or you can chose one you interact with (fetch, fishing). My only complaint is that it takes a while to increase affection",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "now i can watch More Donghua Series and play a game at a same time , But i feel like i adopted the Baby <3\r\ncurrently i'm very busy and can't even play and game but i found this one , Thanks for the Creators .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This desktop pet game is well thought out and well balances all the mechanics. I like that you can't just spam an activity, you have to use all of them to keep Lil Silvy happy. I also like the UI of this a lot more compared to other desktop pets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good annual update, glad that the developers haven't abandoned the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A surprisingly charming little desktop companion. It's simple, but the customization options are fun, and watching it interact with your screen is oddly satisfying. A nice way to add a bit of personality to your workspace without being too distracting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lil Silver is adorable and I enjoy having her up while playing something chill like a simulator game or city builder, etc. I love the interactions, like with fetch, getting her a plushie and have her chase it around the screen, and her occasional messages that pop up by her.\r\n\r\nI do wish she \"bugged\" me more often. I like when she declares her mighty need for a strawberry milkshake, and I can be like \"I gotchu. Boom, milkshake.\"\r\n(In real life, I like my pets bugging me for treats and attention, that's just me though)\r\n\r\nI can tell this was made with heart. It's cute, I really like it, it cheers me up, and I enjoy the pet care aspect to it (making sure she eats, has time to play and sleep and not just \"to the mines with ye!\"). I also have had no technical issues with this, I often have it running while gaming, writing, etc. and it's been a pleasant addition to my computer.\r\n\r\nWhat else can I say? Easy recommendation from me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cute, love the little outfits and activities you can do, and leveling up, at least in the early stages, is relatively easy. Very cute idle game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's really nice to have a little Silvervale who can help me with my taxes!\r\n\r\nWait, Why are the police at my door?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A cute little desktop pet with a lot of charm.\r\n\r\nThere’s a surprising amount of activity, achievements, and little things to unlock that keep you coming back. \r\n\r\nIt’s fun just having her hang out while you work or chill online.\r\n\r\nI never followed Silvervale’s VTuber journey or any of the drama around her, but I really like the design — super cute and expressive.\r\n\r\nIt can be a little demanding on your device. Mine runs a bit hot, but it’s manageable.\r\n\r\nSome people say it acts like a virus because it tries to reinstall itself after being uninstalled — that never happened to me, though.\r\n\r\nYou can run this while playing other games (from what I’ve heard), but I usually just have it open while doing online stuff or work.\r\n\r\nYes, there’s a gacha mechanic and microtransactions, but it’s all cosmetic. Nothing affects gameplay.\r\n\r\nAnd hey, it’s free. So why not give it a try? Worst case, if you get bored, just uninstall it and move on.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's a cute game and pretty fun, but \"profile features limited\" ruins it for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly helps me work and sometimes she says \"posture check!\" and I genuinely sit up straighter, she's so freaking cute too",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Как же все продумано до мелочей! Деталь, на которую не обратил внимания в начале, позже оказалась ключевой зацепкой. Чувствуется уважение к игроку и его интеллекту.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Прикольные вайфу, которые захватывают тебя с первого вида. С первого взгляда. Игра прикольная всем советую, а главное что бесплатная и аналог ее нет",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Didn't know the streamer, but his desktop idler is actually pretty good. Looks nice, lots of options to unlock, with some minor manual management tasks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super cute and adorable, love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a virtual pet\r\nit's silvervale\r\nit runs in the background\r\nit's free\r\nit's adorable and very cute\r\ni don't see any reason not to have this as someone who was a child in the 90s",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Идеальный темп — не торопит, давая возможность впитать атмосферу. Прекрасный антистресс после тяжелого дня, когда хочется просто погрузиться в другой мир.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cute and easy to manage, makes for a nice desktop companion to have in the background.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this makes my lonely hikkikomori big chungus life 1000% better i love my lil anime girl on my pc cured my depression and also cured cancer 420/10 would bonk her nose again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a lil thang for free for novelty. over the last year or 2 it had many improvements",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Goofly littele game for the 2nd Monitor Simply Lovley",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really nice little feature you can have on your desktop, personally love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love my pocket waifu before I had no one... but now I have her. She makes me whole she makjes me feel something nothing else can. Her presence is that of a sunny day with misty grass and fog. I need her more than anyhthing in myentire life. I hav4e dedeicated my entyire presdsncero to makiegneaigf po kcemrt wiafieu femieawa",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Funny little fella running around the screen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "'Pocket Waifu: Desktop Pet' is basically a Tamagotchi for the modern era—an adorable, mostly AFK little companion who hangs out on your desktop without ever making you clean up digital poop. It happily runs in the background while you play other games or get work done, though some heavier titles made my PC grumble a bit.\n\nStill, it’s surprisingly charming having a tiny buddy on-screen, watching streams on the second monitor with you or handing you cute little cards to read whenever you feel like it. It’s low effort, high vibes, & a delightful little sprinkle of companionship while you game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 would recommend to a friend. Cured My depression.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is absolutely adorable and i love it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "DOOT DOOT DOOT do, DOOT DOOT DOOT do, DOOT DOOT DOOT do, DOOT DOOT DOOT do, DOOT DOOT DOOT do, DOOT DOOT DOOT do, FIRE!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Who wants a cute little waifu on your desktop? Please, I do ::heart::",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I put her on my knees and stroked her, good girl on the desktop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's just this little thing on my second monitor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aww it's increadibly cute i recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "she is the most adorable bean that i could have on my desktop <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's so cute and i love to take care of smol Silvervale ♥",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They added gambling... BEST FEATURE EVER",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am rather fond of this pink and blue creature",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game get free steam items",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cute waifu thats all you need to know",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My fav game!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "idk its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Add NSFW lezgoooo!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I quite like the little creature",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sometimes, when feeling down or alone, all you need is an imaginary friend. I happen to have a second monitor placed to my right in such a way that makes it seem like she's perfectly looking at my main monitor when in the \"watch movie\" activity.\nI can't express how weird this feels but, being able to look to my right and see someone staring at the screen watching the movie I've put on, even if she's just a simple 3D model in an idle animation, is somehow really comforting. If not for her, I'd be watching alone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I  love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute... Nuff said",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wolf girl.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good goonable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "She so adorable :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "She is always with me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cute",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST MINI WAIFU",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you are lonley here is good choise for a fren",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cuteeeeeeeeee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute pet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Why I don't like most desktop pets:\n     Either:\n          -too boring\n          -too intrusive\n          -are trying to replace a virtual assistant (and doing a terrible job)\n          -are trying to replace your girlfriend (and doing a terrible job). \n\nWhy I like this one:\n     Interactive\n     Non-intrusive\n     Cute\n     Clean\n     Fun\n     Runs on the side so you can play fetch with it when your friends won't shut-up and push the launch button already.\n\nNotes\n\n     It's also very much like a tamagotchi, but it's really easy to take care of, and I think the needs adds more to the interactivity of it than it adds to tediousness.\n\n     I wish it were more customize-able, probably starting with a more basic\\blank canvas look, and getting to a point where different people would have desktop pets/\"waifus\" that look like different unique characters after dressing them up with their unlocked items. Unfortunately it seems to all be based on a v-tuber or something (who is listed as the publisher) and therefore won't deviate from that likeness too much. Fortunately it's not a bad look.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "zaebok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "adorable :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "meow <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mi mi mi mi cute",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Inikah my..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Waifu",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete, the waifu constantly moves from where you place it on the screen and then just walks straight into the middle of the screen blocking your view. Other than that however, i enjoyed the basic idea and execution . Just for me with ADHD, a constantly moving screen pet didnt work out all that great for me ,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vtuber slop game that used to have a good market.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't get rid of it nothing works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please get help.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I nutted to this",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}