{
  "positive": [
    {
      "review": "Good fixes. No more selecting engineers every time to build a new unit on the ground. One of my all time favorite games for decades!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "What can I say about this game? It's still an old classic with a new fresh paint of coat. On top of that you can finally easily play it online with or against your friends. Plus of course the game gets regular updates and new content. Its still gives me the feeling when i was a kid watching my brother play the game. I really can recommend it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Greetings, sire, the desert awaits you!\n\nStronghold Crusader DE is a successful definitive edition of a timeless classic. Multiplayer, co-op missions, new crusader trails, new units, new AI lords, revised graphics, many bug fixes, and quality of life improvements, let this 23-year-old classic shine in new light.\nThe unique mix of real-time strategy and castle building is still simply fun, and the game has lost none of its old charm.\n\nI see you in the desert, sire!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "nostalgic feeling of the classic times of the game. Pure gem that one can't forget with additional great contents that you can enjoy alone or with friends.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best medieval strategy city-building game ever. Updated package rerelease of the original classic from 2002. I've played this game since I was 5 years old and just seeing new content added to this game I grew up with feels unreal and comfy in a nostalgic way.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Although that annoying WOOD NEEDED voice line is there 🤣, this game is one of the best medieval strategy game ever.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I truly love this game and have played the original for decades. I love to see a developer actually care about what their fans want and consistently deliver it. This remaster breathes new life into a true classic that already held up well. Not in a lazy way either, it truly feels like they just picked up where they left off in 2001. Very rare to see in todays gaming industry. Props to Firefly! If you haven't played this game, I recommend you correct that :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best medieval strategy city-building game ever.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A true classic with some cool updated editions. Hopefully in the future they will make it to were the Coat of Arms/Avatar files can be customized again other than using the defaults or steam avatars. Other than that this Definitive Edition doesn't disappoint.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a great RTS game combined with resource management. It reminds of Lords of the Realm 2 combined with Age of Empires.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its the good old Strongolhd Crusader, that looks better and has some new features. What do i want more? Still an unbeaten strategy game for me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "goooooood game, though the AI is still the same old weakness coming from stronghold crusader :(",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its a Retelling of my favorite game. The only real issues I have is the A.I. and the targeting system of the catapults. I had 500 archers shoot at a catapult and they fired 2 meters in front of it and it walked right into my castle in comedic fasion. If the pathfinding for the enemy was improved it would make the game a lot more difficult. (I build walls and moats and it takes them forever to even atempt to get past it).\r\n\r\n:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played Crusader when it was originally released back in early 2000's. The DE is how you would remember the game. It is also the way to play Stronghold, probabely the best Stronghold in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a nice game but more updates and co-op games would be nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They did a great job of bringing the game all together. And I love the larger maps and the new game play content. And the price is great. I recommend it and give it a 10 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you used to play this in your childhood, you should absolutely get DE. Bigger maps, new AI lords, new units etc. I hope that the devs will continue to support this game with updates as long as possible",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game one of my favorites of all time. played for countless hours over the years. this is by far the best version out to date updated polished graphics plus added maps and Ai lords and quality of life additions if you are a fan of stronghold then you need this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dieses Spiel ist sehr gut abwechslungreich hat gute Musik und bietet viel Spielzeit aber am meisten spaß macht es mit Freunden.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started playing Stronghold Crusader around 2003 and it was always a hot topic the next day in school who advanced most in the campaign.\nand now, 20 years later, we can coop that campaign! i love it <3\na true classic masterpiece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Imma be real with ya'll, game is the GOAT of ye olde RTS.\n\nNo more no less",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 better than the original. Recommend you get it on sale but even at full price you will get your monies worth!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok. Still OG bit glitches are there. There are some quality of life upgrades like for example market auto sell feature but also a lot crap things like unreadable minimap and many control glitches.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A true classic medieval strategy game with some cool updated editions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100% too good long time like old pc and now back game yyaaaayyy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The legendary base game which we already had combined with new troops and new enemies/allies. The campaign can be a little bit frustrating with the new troop spawners they have. But you have coop mission and you can play the game in multiplayer without having to install/use any third party software. Was unsure at first but I am happy I bought it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple, but addicting gameplay. \n\nOne thing they could definitiely improve is the AI in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Arguably and probably the RTS masterpiece allowing you to reenact the epic and historical battles of the European and Arab factions. Which side you'll choose will be entirely up to you. What I loved more, not only the refreshed graphics of everything, but also the additions of various lords/ladies and the Beduin faction enabling you to experience its special units ready to aid you on your conquest.\n\nFunny but awesome thing about this strategy game is it will also make you believe that medieval wars can also be won by the power of bread and ale, only those who play this game will know and understand that. In case you haven't played SCDE yet, I sincerely highly recommend this to you. If history and medieval/feudal warfare are your cup of tea, then you'll not regret having and playing this game. It is as captivating as addictive.\n\nI want to end my review with one of the most common voice lines in game: Gold Needed!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is very fun, I have play almost 60 hours and I still want to play more.\nthe new heros are amazing and the coop adding is perfect. I hope to make the Ai animes more smart about fighting to make it more chalenging",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "more functions and better graphics, but not better than the original crusader.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A blast from the past, is it worth it? Yep, If you ever want a strategy game that you can also relax while playing, with a good campaign, this game is worth picking up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I will be quick\r\n10/10 – A strategic masterpiece and one of the finest castle-building games ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good improvement on the OG crusader, I'm looking forward to the coming updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stronghold Crusader never clicked for me in prior iterations. The DE version has so many options and different ways to play that it feels like several games in one. The constant updates and bug fixes mean the game is getting better and receiving fresh content. Many different strategies are viable and I have evolved my own approach after lots of hours. If you like building up your economy and forces to take down castles, enjoy this experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stays true to Stronghold gameplay, while actually still being updated & refined.\nCrossbowmen are best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the Stronghold series and have spent a lot of time building and razing castles in them. I am glad to see they came back to this title and give it some love and updates. If you enjoy RTS games, medieval themed warfare, and fire, you will probably enjoy this game. GOD WILLS IT!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This, Ladies and Gentlemen, is how you do a proper Remaster/Definitive Edition. New content aside (and there is plenty of that), the amount of quality-of-life improvements that transports the game properly into the current year.  20 € for the base game is not unreasonable either; and given that there will be a Steam Workshop integration soon, the about 220 hours I have put into the original will surely be eclipsed sooner or later.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Captures the exact feeling of its original, while adding stuff thats actually fitting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my childhood favorite games has been remastered!\nThe game is visualy improved\nThey are regularly releasing updates and fixing bugs and glitches ( making the game even harder😆)\nThe new sands of time trail is pretty challenging \nnot enjoyable like the crusader trail though .\nNEW BEDOUIN TROOPS ARE NOT NEAR AS GOOD AS ORIGINAL ARAB TROOPS !\nI've played most of the game using Original troops like maceman ,horse archer ,assassin , etc.\nThere is little need of using bedouin troops in my opinion.\nI think the game suffers from lack of creativity !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game feels a little bit more undone comparing to Stronghold DE but it's ok.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent remaster of one of the best rts's of all time. Worth buying for the co op alone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Eh Nice to really kill time. Ur like eh let me get a quick game and then realize you have been playin for 3 hours hahaha",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game to anyone who enjoys strategy titles.\r\nEven though some of the bugs and issues can be frustrating and annoying, it still delivers a highly enjoyable and satisfying experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is how you make a \"Definitive Edition\". Is just like the game you used to play as a teenager but better, adding new stuff and not ruining the game in the process.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a beautiful game, now finally reaching its true potential with this remaster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Here it is: Stronghold Crusader DE, for which we waited so long. \n\nI like the fresh graphic style, the new missions and the new AI's. A all-time classic game and fun with friends in Coop.\n\nWell done Firefly!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I need to recommend a game I`ve been nominated. Very good! I was about to write a review `bout this game anyway, without being \"obligated\". And you may say \"kAN, wtf, you wanted this game so much, why not recommend it ?\" Chill out bruh, I didn`t forgot about it.\n\nSO, SIT BACK AND RELAX AWARD! Indeed, even since I was very little, came from School and hop directly on this game to relax, build some castles and listen to that Gorgeous Sweet Medieval music.\n\nThe fact that I didn`t recommend it by now could be the reason that I`m waiting for The Winter Update, which will bring A LOT of important Features we all need, including The AIV Editor to Edit existing Lords or to create NEW ONES from Scratch ( which is something, I wanted since the first game came out lol) and I`m a little nervous about it tbh. But I`m 100% Sure the guys from Firefly will deliver the update very well in the end. I trust them, no doubt.\n\nIn rest what can I say, The New Lords are pretty cool, very interesting strategies thay have, I never imagined some of them playing how they play. \n\n\"The Sands of Time\" Trails ( where you need to beat your CPU opponents in the fastest time possible, enduring the Harsh Conditions of the Desert) proved to be a pain in the ass, but I had a guy who taught me some strategies and I beat those Trails very well.\n\nCo-op is awsome as well but with an AI as ally could be hard, but we do what we can.\n\nIn my final opinion, after the FINAL Update which is The Winter Update like I said, this game will remain to be played MANY, MANY years from now own. By veteran players and Future Generations as well!\n\nTHANK YOU Firefly Studios for creating a Remake we all wanted and by bringing to us our Childhood back in these Uncertain days we all live.  One Love!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "+Solid remaster, challenging new missions. \n-AI sometimes still ab bit dumb, my granary is empty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Works well on Linux using Proton.\r\n\r\nA beloved classic from my childhood. I'm glad it's seen a revival. The devs are still actively improving the game with excellent community suggestions and new additions. It is still as fun as the old Stronghold Crusader was. The new units and Lords are a lot of fun to play with. Nostalgia 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To sie nazywa dobra gra i warta pieniedzy, duzo wiecej kontentu niz stara wersja, praktycznie zero bagów, updaty, dlc i wszystko za uczciwą cene, co wiecej chciec ?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great attention grabber. enjoyable. its like the pharaoh game on steroids. really gets the brain working.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely worth the affordable price. They killed it this time. The maps are much larger which was one of my only complaints about the original. Also, they improved the game like creating an auto buy/sell option and holding shift to buy several materials or troops at once. And in my opinion, the best improvement was all the new missions they added for veteran players and created a co-op campaign.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for nostalgia, bad for actually playing.\n\nCustom matches aren’t worth playing because they’re far too easy, even if you give the AI an advantage. You already have a fully built castle and 500 knights before the AI has even finished building its castle. That means you can just charge in after ten minutes and finish off the opponent. Totally boring.\n\nThe story missions are all designed to be extremely unfair. The AI cheats, sometimes has far more resources than the player, or can simply generate troops for free. I don't need to enter a car race with a tractor against a Formula 1 car. If I know from the start that it’s rigged against me, I don’t see the point in playing.\n\nIn my opinion, increasing the difficulty should mean making the AI smarter, not just giving it cheats. \n\nSo you can either play against AFK bots or against cheaters, there’s nothing in between.\n\nSo it’s not really worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It really is the original but better. This isn't a bait and switch, nothing was left behind. It's just the old game with more NPC options, lots more maps, and of course better resolution. And an optional third faction of units.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the stronghold series is fantastic. If you can't afford the definitive edition then the original stronghold crusader would be the way to go as unfortunately there isnt too much difference",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a perfect paint job on such a classic game adding new features but also keeping the same vibe of the old version. It's perfect, and once you beat all the trail missions and campaigns, defeat all the lords, create your castle you leave the game, but all the people that played it will remember it as the best RTS game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was my favorite game when I was younger. This version perfectly brings back the classic epicness of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it was a beautiful game that was singing to my soul 20 years ago and it is a beautiful game that is singing to my soul now. getting this definitive edition was the final push to complete the original trial. this was the first time i did that. first time i saw that ending video. it was beautiful. i feel like i've accomplished some long running goal that i started 20 years ago. if you have also tried and stopped then this comment is a signal to finish the job 😎.\r\n\r\nbesides that i really appreciate auto-buying feature and the ability to build on annoying women and children. new enemies and missions is also very welcome. beautiful art style also wasnt stupidly fucked up and any changes compliment the original style (very nice job devs).\r\n\r\nnext text is directed more to devs and describes my annoyances: this game is sorely missing is troop auto-buying (as stronghold crusader 2 had). besides that you can't build on top of camels (and maybe some creatures else, dont remember). if you have a moat marked on ground and tree grows on it then whoever was digging the moat will stall and pretty much freeze (this issue was severely annoying, had multiple cases where i thought im secure but then enemy walks in through the wooded areas or whatever). \r\n\r\nany way beautiful game, 100% recommend getting. ♥♥♥♥♥",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Exactly what fans of the original Crusader wanted. Everything is very close to the old game; the mechanics are the same, so there's nothing new to learn, but the maps are significantly more difficult. There are also some great QOL changes (auto market, place buildings over people) and many of the settings from the old UCP found their way into the game (for example the buffs for arab swordsmen and spearmen or the improved AI sieges).\nA few issues I would like to point out though:\n- The building shortcuts no longer open the building UI, but center the camera on the building, which is very annoying when tackling some of the harder new crusade missions\n- The pull down walls / peek over walls feature is no longer in the game. Why would you remove that? It was great to see how much food/weapons an AI owns or to see the stonepiles on your quarries from weird angles. Even after hours of playing the Definitive Edition, I still press \"V\" all the time and am disappointed.\n- The music randomly stutters or stops sometimes, which I suspect to be caused by the feature that turns it down when a voiceline is played. I'd love this feature to be optional.\n\nIf you want to try out this game and don't want to spend 20 bucks on it, you can try the original Crusader, which isn't to different from the Definitive Edition. I honestly think of this as an opportunity to say thank you to Firefly for over 20 years of great fun with Crusader.\n\nOverall a solid 5/7, but a true gem for everyone who loved the old game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good ol'Childhood game\r\n\r\nWith some bug fixes its quite decent now. the game can be more challenging\r\nand some new stuff makes the game had more flavor and spices to it\r\n\r\nPeak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant, just like old times but perfectly reimagined.\n\nEndless fun due to multiplayer with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a remaster of the original.If you are a clasic gamer or if you wana try clasic games this is the \nchoise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute banger of a game! a good \"modern\" version of the game. with the old scool vibes and texture. the new additions are fun, however not hard or \"new\"enough. same as 1 extra building. the thropies are fun however. and i love the full multiplayer support and co-op options. i would recomend to buy this game for an nice eazy trip to memory lane",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a long-time player, loading up this DE brought back memories. My son saw the original version yesterday and immediately called the graphics \"ugly and clearly ancient.\" The Definitive Edition definitely looks better now, which is great for new players. However, I have a few notes for the developers:\r\n\r\nI still play primarily as the European Lords, but the new Arabian unit icons feel a bit ridiculous/silly now. The old icons had a much tougher, more intimidating look. More critically, I found a few important features malfunctioning—specifically, the shields cannot be carried up onto the towers. This is a small bug but a very crucial function for upcoming stages! Please fix this, as it seriously impacts defensive strategies. Overall, a good effort, but fix the bugs and maybe reconsider the unit icon art direction!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For me it was and still is the best game of all times. Glad I can play it in 4k. Bugs from previous editions fixed, happy it has the dlcs in it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Should be golden standard for remasters,you breath new life in to the game with new content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This remaster of the original Stronghold crusader & extreme is great. 10/10.\nThe original Stronghold game is a fun single player experience. Its short but tough. But personally i think stronghold crusader is where Firefly Studios really shined in its original set of stronghold releases. But with the release of definitive edition they went above and beyond. \n\nPros:\nMore polished. \nHas full multiplayer support. \nImproved textures. \nNew Units.\nNew campaign trails both single-player and new coop.\n\nCons: (Mostly the reason i wrote this review)\nAfter the most recent October 2025 update there appears to be a game speed bug for multiplayer lobbies where despite changing game speed in settings. The game only starts and runs at 40 speed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game and wish co-op was longer like the other trails, or maybe should also allow us to play co-op for the other trails on a separate mode, saw a thing on stronghold kingdoms promoting a spartan world, they should make a Stronghold Sparta and/or Rome, since they came out with the warlords release, if they do make a game integrating those worlds, maybe they should make the game with these graphics rather than the new one, or have a choice to play either or",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They ressurrected a 23 year old game and even gave it additional content equivalent to a mini expansion. More fun than doing crack with your friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game a long time ago on disc when i was a kid. Have been thinking about it over the years. Glad i found it here. I like how there is no construction time for buildings etc, the missions are fun, the graphics are good and the simplicity of the game is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute Matserpiece, easily the best Stronghold Game of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "-A FEW WORDS FIRST\nOh yes, if it ain't broke don't fix it, just remaster it. Crusader is timeless and the fact they brought it back to life is simply great! Nice little addition and the core game is just as gold as it used to be. A definite must play game for any RTS fan. Firefly studios needs to stop trying to make 3D games and give us a new 2D Stronghold in medieval Europe, they just can't miss when they make OG looking Stronghold games, so if you want a successful new game just give us that! Great remaster to a legendary game. \n\n-GRAPHICS: 10/10\nPure old school 2D RTS sharpened to 2020s high res standards. Game looks as gorgeous as it did back in 2002.\n\n-GAMEPLAY: 10/10\nBuild a castle without limits, build an army, mount your walls, siege the enemy or be sieged, in the meanwhile make sure you have food for your people, manage your economy and to keep the population happy, otherwise they'll leave and you'll just loose cause there won't be anyone to defend your castle. Literally one of a kind. There is no other RTS out there like Stronghold, wish the studio would realize that and make a new 2D Stronghold like this one and stop making failed 3D attempts.\n\n-STORY: -\nI don't play RTS campaigns.\n\n-BUGS/GLITCHES: 10/10\nThe game is perfect, if it ain't broke don't fix it, og crusader wasn't, so this isn't either. \n\n-FX/SOUNDTRACK: 10/10\nMusic that rings in your ears for the last 23 years is brought back once again to ring again for the next 23 years. Amazing voice acting, beautiful effects and overall extremely immersive soundtrack and FX. \n\n-ORIGINALITY: 10/10\nOne of a kind. There is no other like Stronghold. \n\n-MICRO TRANSACTIONS:\nDLCs only. \n\n-WHO SHOULD PLAY THIS:\nAny RTS fan has to play this. If you haven't then you're missing out on the best Medieval RTS of all time. \n\n-DIFFICULTY:\nAmazingly flexible. The game doesn't have your typical easy/medium etc. Here it depends on the AI Lord you fight against. For example the Rat is an easy fow, the Pig is a medium fow and the Wolf is a hard fow. \n\n-REPLAYABILITY/LENGTH:\nGame has always had a place on all of my PCs since 2002 and I'm happy this got remastered. Do the math, this has replayability and length. \n\n-PC REQUIREMENTS For Max Settings\nAnything can run this game pretty much. \n\n-OVERALL SCORE: 10/10\nA masterpiece and personal favorite RTS of mine revived! Thank you Firefly Studios, now make a new Stronghold in 2D!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great improvement on the older game. I feel like they could've been more experimental and went in different directions though. I suppose it's why this is a definitive edition only, mostly the same with some new.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the best game ever. I have been a big stronghold fan since i was a young lad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice childhood memory. My 2nd game after settler 2 gold edition",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is upgraded version of original stronghold with way more stuff to do. Its good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing as the original, with an additional campaign type, the Bedouin forces and all that to a moderate price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sometimes these bugs appear: Peasants stop spawning at the campground; ballista and mangoel cant be placed on the tower but the gold is deducted; cows in the dairy farm doesnt spawn. Now Im at \"Trade Routes\" mission and these bugs have appeared. Any input what to do ?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Totally worth the money,\nBetter looking, more missions, more kings, more maps, more options to choose from\nRegular updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game. I have played this game since the original came out. love the new setup.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As an OG Stronghold fan, this is everything i could have ever wanted from the remaster. Nostalgic and familiar, even with the new additions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "- AI still the same\n- Old exploits fixed \n- Used to work on calculator specs now those system requirements...\n- One achievement locked behind Paid DLC dirty move...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply, great game, like the new troops added, love the new co-op mode, looking forward to all future content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like how firefly studios remade the game looks great and new units to use as your army",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An old addictive RTS. Some bugs are fixed with this new version which makes the game even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best RTS ever and the remake is cool hope they work on the online more like public servers and some the ai need more work too and the end the game is worth buying inded",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best Castle Sims of all time returns, with more features. What's not to love?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good old days. The Game is missing the pvp Multiplayer Match making and rank system, :d",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty neat remaster for an all-time classic. Hope they keep the iconic visual style for future games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This version is significantly better than the original thanks to QoL features such as the automatic market, 21:9 support, and new content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good remaster! And not just the visuals and animation, but more missions, more lords, bigger maps, new units and the co-op is a cherry on top. \n\nOh and more content is on the way!  \"What? Yeah? We are the macemen! - Move, you dogs!\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a worthy remake of the original classic castle builder. It improved in every single aspect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Childhood game, always will be my favorite. new version is awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you played this as a kid, it's back and just as you remembered, but with added content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoyable, i like the reworks! The only thing I just cant used to is this really slow movement on the map... Scroll speed on 15 still so slow... :/",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was good 20 years ago.  It's even better now. (SeH-Meh-Tre-Cole-Hal-Em!)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very beautiful and nostalgic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good if you dont already own Stronghold Crusader in another form. The DE has very little in terms of additions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Greetings, sire! The desert awaits you!\"\n\nSo much warmth and nostalgia in this simple sentence.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The best game ever. Thank you for the childhood!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game advertises, that you can have an army up to 10,000 people, but in a game with 8 players involved, the game will just tell you, that you reached the maximum army size at around 300 people. Realizing this fact and bringing it to attention, will just get you banned from their community page and pretended, like this issue never happened.\nSame goes to other things, like Moat diggers randomly stop digging moats near trees or archers keep on shooting in front of a target instead of shooting their target.",
      "voted_up": false,
      "votes_helpful": 70
    },
    {
      "review": "Played the original since 2004 and the game is fucked. Took to much drugs when balancing the units or the playtesters are a bunch of mixmaxing degenerates. Has to be one of the two.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "as the singer player progress to later stage, the game is straight up cheese where you either rush and cheese the npc to win, and it seem the game didn't even play the game themselves",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "At first everything was great, really good in fact, but then they decided to ruin the games with these new AI leaders. I never uninstalled the original Stronghold Crusader from my PCs, but this one will soon be a goner.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is a great game but unfortunately the game keeps freezing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game controls are really poor.  Not very playable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They really didn't need to \"rebalance\" the game. The fact that they removed the ability to have portable shields on towers is a huge nope. The healers that they added are not gonna cut it as the healing is rather slow and enemies often target them. Your ballistas and archers are gonna be dying a lot, like a lot. Stronghold Crusader 2 had at least a unit that gives armor to surrounding units to give time for healers. You just don't take an ability away without compensating it in return. Either there has to be a support unit, or towers need to be buffed for further damage reduction.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this is just a rehash of previously published games/ The graphics are poor and the time to defeat discourages players from playing that scenario. You should do better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm a Stronghold fanboy, Stronghold Crusader was the first PC game I've ever played. With all the hype around the DE I just had to buy this and the DLC, Yet, noticing all the bugs, I couldn't help but think of a mod I heard about before called UCP. UCP changes everything, Suddenly, you can't bum rush the Sultan on the first mission with 30 macemen because it's like wow he actually developed some walls and a survival instict. Where is all this awesome fun in the DE? I stopped supporting you guys after stronghold 3 with a single exception for Stronghold Crusader 2 which was also trash. You guys are worse than Bethesda. You're like that local mom and pop shop that treats you worse than Walmart. Your \"very positive\" rating is entirely undeserved and you ******* know it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Took out the feature of allowing shields in Towers.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was really surprised by the balance of the new units, especially the Bedouins. The Eunuch is almost completely naked and dressed in a strange outfit that looks more like a stripper’s costume — and this is not an insult, it’s just a fact, I was genuinely shocked. Yet this unit can withstand 7 crossbow shots, deals high damage to multiple enemies at once, and can even defeat a Pikeman in full armor. Meanwhile, an Arab swordsman in full armor falls after only three arrows.\n\nAdding a Medic to the Bedouins also creates further imbalance. In fact, almost all of their units feel overpowered or inconsistent, breaking the strategic logic of the game. The new units look odd and don’t match the classic style of Stronghold Crusader at all.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "not bad BUT why still selling DLC?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game advertises, that you can have an army up to 10,000 people, but in a game with 8 players involved, the game will just tell you, that you reached the maximum army size at around 300 people. Realizing this fact and bringing it to attention, will just get you banned from their community page and pretended, like this issue never happened.\nSame goes to other things, like Moat diggers randomly stop digging moats near trees or archers keep on shooting in front of a target instead of shooting their target.",
      "voted_up": false,
      "votes_helpful": 90
    },
    {
      "review": "It's a nice overhaul, good new missions but guys... this game is most fun at multiplayer. But the multiplayer is almost as bad as it's always been. Game crashing randomly, people desyncing, lags etc. It's 2025, you really should have had this fixed already. Until then I cannot recommend. It's only for singleplayer gamers.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "TL;DR\n\nThe game is fine. Fine as the good old Stronghold Crusader fine. And that is my issue with this game. \n\nSH - Stronghold\nSHDE - Stronghold Definitive Edition\nSHC - Stronghold Crusader\nSHCDE - Stronghold Crusader Definitive Edition\nSHCE - Stronghold Crusader Extreme\nSHCEDE - Stronghold Crusader Extreme Definitive Edition\n\nI will open up this review with obvious - SH and SHC are a good, old and well known titles (at least among rts fans). The SHDE is still on my to play list, so I will not reference it much, but SHCDE is second release of definitives. And it feels almost undistinguishable from SHC - which is the best thing about it. I played the game, at the time of writing this review for 155 hours and 100% it, although I did not play PvP content.\n\nSo what's wrong with this game? Well, honestly speaking - if you have HD version, don't bother. They refreshed textures - yes, Added mosques for Arabian Lords - yes, Added new units - yes and added more PvE Content - yes. Sounds amazing right? Yeah, so did I thought. Here is the issue - they \"fixed\" exploits, removed some features and then added a lot of annoying bugs (which are being fixed almost instantly when reported... but still) which make this game almost annoying to even touch. Let me quickly describe bugs and annoyances:\n\nAwesome stuff, that I love:\n  - Auto buy/sell - Chefs kiss.\n\nBugs:\n  - Units randomly stay locked on screen in T-Pose animation, not being there.\n\nQoL:\n  - Selecting unit group, and putting unit rallying point is same, and does not \"deselect\" after recruiting - which means you will put gather points instead of ordering units, which will lead to deaths\n  - Not sure why there is no auto-recruit option...\n  - You cannot put mobile shields on top of walls - which is fine, as we now have healers, but still. It was a thing, it is not anymore.\n  - Still No replace traps?\n  - No \"Repair everything\" button?\n  - No option to repair siege engines?\n  - Why does siege tower dismount engineers?\n  \t- Why do they dismount on top of the wall?!\n  - Why we can't repair buildings\n  - No binds for undo?\n  \t- The undo is just plain dumb, it's time based, so you can place barracks, recruit units and then undo the barracks and place tower...\n\nUnits:\n  - Enemy archers have Patriot arrows, that out range your units and you can do shit about it, even though your units are on towers and enemy archer is fuck knows where\n  \t- Note for developer -> It's most likely caused by group of units moving into range, and the farthest still shooting fsr.\n  - If you put your/enemy units sufficiently close to wall, they can shoot THROUGH it and kill units behind it.\n  - It works the other way around, if you have Fire Ballista, bot will shoot through your walls for no apparent reason (you can surround your unit with walls - does not matter how thick - and it will still keep getting damaged), which works for other units as well.\n  - Targeting unit, leads to hell tone of prediction, which leads to units move erratically, and sometimes missing target\n  - Some enemies will randomly target your walls and \"peck\" on them, which is extremely annoying\n  - Some units run when on aggresive stance but move slow when ordered manually\n  - Units move different speed on recruitment\n  - Units have suicidal tendencies, and the \"shift click\" does not let you set correct path for them to move\n    - This is even more annoying with gather points, which cause units to not fight sometimes\n  - Archers just tend to miss, they all either hit perfectly, over-shoot or under-shoot. So, if first arrow misses, they will all miss.\n\nAssasins:\n  - units meant to scale walls and quickly sneak the enemy lord - They randomly refuse to move and just scatter, making more than sufficient force die without dealing any damage.\n  - they randomly walk around enemy castle, walking into traps and arrow fire, even though they had perfectly fine piece of wall to climb, wasting your gold.\n  - if you give them order during their climb animation, they will ignore it.\n\nLord:\n  - Why can't we have lord bindable?!\n  - Why I do not have indication that I selected lord?! \n\nBeduin units:\n  - Skirmisher - Ugh, why is it in the game?\n  - Sapper - Okay - cheap, fast and destroy walls super quick. I used it sometimes for fun.\n  - Lancer - Ugh; squishy, low damage and does not really deal damage to buildings. What is his purpose?\n  - Heavy camel - UGHBDFSADFSD; Solid arrow resistance, okay damage and can fight close range. Can't shoot when moving. Meh. Never used it.\n  - Demolisher - Digs moats, removes oil pits and killing pits + has shield to cover from fire arrow. In exchange is slow, and has shit damage to units. Worst thing - his shield does not last long and cannot be healed... On paper looks good, when you use him he just plainly is bad.\n  - Eunuch - Slow moving, Squishy, Slow attacking aoe unit for clearing towers... Except that towers need to be cleared before he arrives, otherwise he will not survive.\n  - Healer - Long needed addition. Awesome, perfect, cool - Thumbs up.\n  - Ambusher - Ugh, fire thrower with \"stealth\"... Sorry, for PvE it's a joke.\n\nSands of time\n\nThis is where I broke. I forced myself to get 100% so I played this fully. This just does not fit. This game is about \"STRONG\" yes. But as well about \"HOLD\", which does not mean you should be forced to do something in limited time. I like that they added option to disable time, but this just does not fit the theme. It would be so much better (even looking at the later achievement part) if you would need to hold against infinite hords of enemies, untill your castle brakes. I do not know, limit something per mission to make it more interesting and voila! I will not waste time on this category, it's huge miss for me.\n\nCoop trail\n\nOkay, this one is goated. Well played devs!\n\n\nAchievements...\nOh god. I hate them. They are not really \"achievements\":\n\n- Tyrant - Kill 1'000'000 units.\n\t- I am sorry. How many? This is not achievement, this is time tracker. \"How long do you play this game?\", 'Oh I played it quite long, I am on 735'387!', \"Wow, that's a lot of time!\".\n\t- Tip: Playu SHCEDE Mission: '8. Wazir's Fortress', but save once you setup. Units tend to \"dry up\", after some time.\n\n- Muhammmad al-Idrisi - Upload map to workshop\n\t- What? So you want the workshop to be full of garbage? Make it at least so it needs to reach specific like/download amount!\n\n- Top of The Class - Complete Tutorial\n\t- ... If you consider this achievement, I am truly sorry.\n\n- Banned from circus - Kill 1'000 Lions\n\t- This is grind, absolute and undoubtful grind.\n\t- Tip: Play SHCED Mission: '18. Lionheart'\n\n- Almost there - Complete and time trial with champion rating\n\t- Maybe remove above achievement and give for each trials? They were indeed hard and quite challanging to make in champion time?\n\n- Stay back - Win by recruiting only ranged units\n\t- Yes, but it does not count starting units...\n\n- Subscribe to play scribe - ...\n\t- ...\n\n- Welcome, Lord Bessy! - Have 30 Dairy Farms\n\t- How is it an achievement... Nest will be build 50 apothecaries?\n\n\n\nAt the end\n\nIf you do not want to play Coop trail, skip this. I really like devs commitment to series, but I as well feel some kind of dark force. All I know is that this definitive edition combined with Crusader II show that devs most likely forgot what made this series so good, or I just do not understand how to play games. \n\nEither way, I will continue to play this game with next patches, but for now... Sorry. This is atrocious experience, when you remove things that already existed.",
      "voted_up": false,
      "votes_helpful": 69
    },
    {
      "review": "Had to return. Everything good about Stronghold: Crusader is watered down here and weaker. It's shocking to me that this team has been re-releasing the early Stronghold games for over 20 years and still can't figure out what the fans enjoy about it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I am a fan of this game since i have my memory and I really appreciate that Firefly is back working on their best horse. With the new game and DLCs i was hoping for Innovation...\nThis game is very old and they really didnt change a lot. The new Units are fine and important additions to provide but are often just copy pasta. This game has so much unused potential, its insane! \nA few design suggestions:\n- The assasins should be able to climb certain heights with their grappel. Making them unique and usefull.\n- Add units to the already existing recruitment buildings. An armored spearmen who uses the lance and armor. A good shield protected against arrows but doesnt do alot of damage in melee. A basic soldier like unit. \n- Add new production chains or new buildings/Towers etc. Its so simple to add a few more amazing arabic towers.\n\nThe balance is horrible. Some AI Lords are useless just as back in the day. Some units are to expensive and have no purpose and some are just to OP.\n\nThese are just a few suggestions to make clear, that the games potential is not used. Instead we get two new lords who are yet again copy pasta from already existing lords. The community made custom lords themselves who had more flavour....\n\nI really love the game but i feel like they use the sales to fund their new game title instead of focusing on what really worked for them. I would love to see the game flourish and would love to help were i can but i dont think its in the studios interest.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "so bad game. lagging each moment and disconnection with no reason and so manybuggs nos bug fix no updates and very little active players iam upset from this game and regreting buying it and i wish i could have my money back, really very bad game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, but sadly multiplayer is a complete mess, it just crashes all the time and\nyou're lucky if you get to play together for 5 consecutive minutes. \n\nI was really hoping that I'd get to play my fav childhood game with my friends, but it just won't work\n\nMy 2nd problem is with the AI opponents. They barely put troops on their towers, their attacks are poorly coordinated and don't increase in scale. (eg. they place siege weapons so close that your archers decimate them) Overall, they're just really stupid and the improvements made on them are not sufficient. \n\nI want this game to do better and succeed, but right now, with these issues, it's just disappointing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After the 1.05 update, multiplayer isn’t multiplayer anymore, it’s a crash simulator. Extreme Troops mode? 4v4 games? Yeah, right — maybe in some parallel universe. At this point I half expect the game to crash on the main menu. Truly revolutionary stuff. Ridiculous.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Multiplayer constantly crashes, resyncs, and bugs out despite the numerous attempted fixes done by devs...\nWill change review when fixed",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sadly the multiplayer, which is my main buying point, does not work consistently and thus I can't enjoy the game. \nResyncing every 20 seconds or so make the game unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Issue: Multiplayer lobby does not show any available hosts or rooms.\nDetails: \n- When I open the multiplayer lobby, the list is always empty (screenshot attached).\n- I have tried refreshing, changing matchmaking region (Default/Global/Local), but no hosts are visible.\n- My internet connection is stable and the game is updated to the latest version.\n- Even when friends are hosting, their lobbies do not appear for me.\n\nPlease advise if this is a known bug or if there are additional steps I need to follow.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "multiplayer doesn't work properly, input delay when playing online.\ncan't play co-op skirmishes with another person VS AI.\nCo-Op trail campaign trail is all built around an annoying gimmick where each of you only has access to half the resources. \nknow it's an RTS and it comes with the territory but the castle building aspect seems to have been put to the side because it seem's early assassin rushes are the only/best option.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "picked it up to play co-op with a friend, turns out the only Co-op its the shitty trails that's way overtuned and clearly made for people who are veterens of the game. don't know why they wouldn't allow you to A. invite to friend to a skirmish or B. let you add bots to multiplayer. clearly not a technical issue as they have the AI everywhere else in the game but the multiplayer. if you wanna play with friends against bots don't waste your time here",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "At first everything was great, really good in fact, but then they decided to ruin the games with these new AI leaders. I never uninstalled the original Stronghold Crusader from my PCs, but this one will soon be a goner.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played the original since 2004 and the game is fucked. Took to much drugs when balancing the units or the playtesters are a bunch of mixmaxing degenerates. Has to be one of the two.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "as the singer player progress to later stage, the game is straight up cheese where you either rush and cheese the npc to win, and it seem the game didn't even play the game themselves",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its a bad remake especially for the price. The bots are very dumb, attacking in a way that doesnt make sense. The troop controls are bad. The mission maps are bad. I feel like they sold the exact same game from 2000s and just slapped a new price on it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is a great game but unfortunately the game keeps freezing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game controls are really poor.  Not very playable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They really didn't need to \"rebalance\" the game. The fact that they removed the ability to have portable shields on towers is a huge nope. The healers that they added are not gonna cut it as the healing is rather slow and enemies often target them. Your ballistas and archers are gonna be dying a lot, like a lot. Stronghold Crusader 2 had at least a unit that gives armor to surrounding units to give time for healers. You just don't take an ability away without compensating it in return. Either there has to be a support unit, or towers need to be buffed for further damage reduction.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Multiplayer immer noch nach Monaten verbuggt und unspielbar",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this is just a rehash of previously published games/ The graphics are poor and the time to defeat discourages players from playing that scenario. You should do better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm a Stronghold fanboy, Stronghold Crusader was the first PC game I've ever played. With all the hype around the DE I just had to buy this and the DLC, Yet, noticing all the bugs, I couldn't help but think of a mod I heard about before called UCP. UCP changes everything, Suddenly, you can't bum rush the Sultan on the first mission with 30 macemen because it's like wow he actually developed some walls and a survival instict. Where is all this awesome fun in the DE? I stopped supporting you guys after stronghold 3 with a single exception for Stronghold Crusader 2 which was also trash. You guys are worse than Bethesda. You're like that local mom and pop shop that treats you worse than Walmart. Your \"very positive\" rating is entirely undeserved and you ******* know it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Every multiplayer crashes. You play 34 min very well but on battle, resyc, drop outs, you cant not play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Took out the feature of allowing shields in Towers.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was really surprised by the balance of the new units, especially the Bedouins. The Eunuch is almost completely naked and dressed in a strange outfit that looks more like a stripper’s costume — and this is not an insult, it’s just a fact, I was genuinely shocked. Yet this unit can withstand 7 crossbow shots, deals high damage to multiple enemies at once, and can even defeat a Pikeman in full armor. Meanwhile, an Arab swordsman in full armor falls after only three arrows.\n\nAdding a Medic to the Bedouins also creates further imbalance. In fact, almost all of their units feel overpowered or inconsistent, breaking the strategic logic of the game. The new units look odd and don’t match the classic style of Stronghold Crusader at all.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "not bad BUT why still selling DLC?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game advertises, that you can have an army up to 10,000 people, but in a game with 8 players involved, the game will just tell you, that you reached the maximum army size at around 300 people. Realizing this fact and bringing it to attention, will just get you banned from their community page and pretended, like this issue never happened.\nSame goes to other things, like Moat diggers randomly stop digging moats near trees or archers keep on shooting in front of a target instead of shooting their target.",
      "voted_up": false,
      "votes_helpful": 90
    },
    {
      "review": "It's a nice overhaul, good new missions but guys... this game is most fun at multiplayer. But the multiplayer is almost as bad as it's always been. Game crashing randomly, people desyncing, lags etc. It's 2025, you really should have had this fixed already. Until then I cannot recommend. It's only for singleplayer gamers.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "TL;DR\n\nThe game is fine. Fine as the good old Stronghold Crusader fine. And that is my issue with this game. \n\nSH - Stronghold\nSHDE - Stronghold Definitive Edition\nSHC - Stronghold Crusader\nSHCDE - Stronghold Crusader Definitive Edition\nSHCE - Stronghold Crusader Extreme\nSHCEDE - Stronghold Crusader Extreme Definitive Edition\n\nI will open up this review with obvious - SH and SHC are a good, old and well known titles (at least among rts fans). The SHDE is still on my to play list, so I will not reference it much, but SHCDE is second release of definitives. And it feels almost undistinguishable from SHC - which is the best thing about it. I played the game, at the time of writing this review for 155 hours and 100% it, although I did not play PvP content.\n\nSo what's wrong with this game? Well, honestly speaking - if you have HD version, don't bother. They refreshed textures - yes, Added mosques for Arabian Lords - yes, Added new units - yes and added more PvE Content - yes. Sounds amazing right? Yeah, so did I thought. Here is the issue - they \"fixed\" exploits, removed some features and then added a lot of annoying bugs (which are being fixed almost instantly when reported... but still) which make this game almost annoying to even touch. Let me quickly describe bugs and annoyances:\n\nAwesome stuff, that I love:\n  - Auto buy/sell - Chefs kiss.\n\nBugs:\n  - Units randomly stay locked on screen in T-Pose animation, not being there.\n\nQoL:\n  - Selecting unit group, and putting unit rallying point is same, and does not \"deselect\" after recruiting - which means you will put gather points instead of ordering units, which will lead to deaths\n  - Not sure why there is no auto-recruit option...\n  - You cannot put mobile shields on top of walls - which is fine, as we now have healers, but still. It was a thing, it is not anymore.\n  - Still No replace traps?\n  - No \"Repair everything\" button?\n  - No option to repair siege engines?\n  - Why does siege tower dismount engineers?\n  \t- Why do they dismount on top of the wall?!\n  - Why we can't repair buildings\n  - No binds for undo?\n  \t- The undo is just plain dumb, it's time based, so you can place barracks, recruit units and then undo the barracks and place tower...\n\nUnits:\n  - Enemy archers have Patriot arrows, that out range your units and you can do shit about it, even though your units are on towers and enemy archer is fuck knows where\n  \t- Note for developer -> It's most likely caused by group of units moving into range, and the farthest still shooting fsr.\n  - If you put your/enemy units sufficiently close to wall, they can shoot THROUGH it and kill units behind it.\n  - It works the other way around, if you have Fire Ballista, bot will shoot through your walls for no apparent reason (you can surround your unit with walls - does not matter how thick - and it will still keep getting damaged), which works for other units as well.\n  - Targeting unit, leads to hell tone of prediction, which leads to units move erratically, and sometimes missing target\n  - Some enemies will randomly target your walls and \"peck\" on them, which is extremely annoying\n  - Some units run when on aggresive stance but move slow when ordered manually\n  - Units move different speed on recruitment\n  - Units have suicidal tendencies, and the \"shift click\" does not let you set correct path for them to move\n    - This is even more annoying with gather points, which cause units to not fight sometimes\n  - Archers just tend to miss, they all either hit perfectly, over-shoot or under-shoot. So, if first arrow misses, they will all miss.\n\nAssasins:\n  - units meant to scale walls and quickly sneak the enemy lord - They randomly refuse to move and just scatter, making more than sufficient force die without dealing any damage.\n  - they randomly walk around enemy castle, walking into traps and arrow fire, even though they had perfectly fine piece of wall to climb, wasting your gold.\n  - if you give them order during their climb animation, they will ignore it.\n\nLord:\n  - Why can't we have lord bindable?!\n  - Why I do not have indication that I selected lord?! \n\nBeduin units:\n  - Skirmisher - Ugh, why is it in the game?\n  - Sapper - Okay - cheap, fast and destroy walls super quick. I used it sometimes for fun.\n  - Lancer - Ugh; squishy, low damage and does not really deal damage to buildings. What is his purpose?\n  - Heavy camel - UGHBDFSADFSD; Solid arrow resistance, okay damage and can fight close range. Can't shoot when moving. Meh. Never used it.\n  - Demolisher - Digs moats, removes oil pits and killing pits + has shield to cover from fire arrow. In exchange is slow, and has shit damage to units. Worst thing - his shield does not last long and cannot be healed... On paper looks good, when you use him he just plainly is bad.\n  - Eunuch - Slow moving, Squishy, Slow attacking aoe unit for clearing towers... Except that towers need to be cleared before he arrives, otherwise he will not survive.\n  - Healer - Long needed addition. Awesome, perfect, cool - Thumbs up.\n  - Ambusher - Ugh, fire thrower with \"stealth\"... Sorry, for PvE it's a joke.\n\nSands of time\n\nThis is where I broke. I forced myself to get 100% so I played this fully. This just does not fit. This game is about \"STRONG\" yes. But as well about \"HOLD\", which does not mean you should be forced to do something in limited time. I like that they added option to disable time, but this just does not fit the theme. It would be so much better (even looking at the later achievement part) if you would need to hold against infinite hords of enemies, untill your castle brakes. I do not know, limit something per mission to make it more interesting and voila! I will not waste time on this category, it's huge miss for me.\n\nCoop trail\n\nOkay, this one is goated. Well played devs!\n\n\nAchievements...\nOh god. I hate them. They are not really \"achievements\":\n\n- Tyrant - Kill 1'000'000 units.\n\t- I am sorry. How many? This is not achievement, this is time tracker. \"How long do you play this game?\", 'Oh I played it quite long, I am on 735'387!', \"Wow, that's a lot of time!\".\n\t- Tip: Playu SHCEDE Mission: '8. Wazir's Fortress', but save once you setup. Units tend to \"dry up\", after some time.\n\n- Muhammmad al-Idrisi - Upload map to workshop\n\t- What? So you want the workshop to be full of garbage? Make it at least so it needs to reach specific like/download amount!\n\n- Top of The Class - Complete Tutorial\n\t- ... If you consider this achievement, I am truly sorry.\n\n- Banned from circus - Kill 1'000 Lions\n\t- This is grind, absolute and undoubtful grind.\n\t- Tip: Play SHCED Mission: '18. Lionheart'\n\n- Almost there - Complete and time trial with champion rating\n\t- Maybe remove above achievement and give for each trials? They were indeed hard and quite challanging to make in champion time?\n\n- Stay back - Win by recruiting only ranged units\n\t- Yes, but it does not count starting units...\n\n- Subscribe to play scribe - ...\n\t- ...\n\n- Welcome, Lord Bessy! - Have 30 Dairy Farms\n\t- How is it an achievement... Nest will be build 50 apothecaries?\n\n\n\nAt the end\n\nIf you do not want to play Coop trail, skip this. I really like devs commitment to series, but I as well feel some kind of dark force. All I know is that this definitive edition combined with Crusader II show that devs most likely forgot what made this series so good, or I just do not understand how to play games. \n\nEither way, I will continue to play this game with next patches, but for now... Sorry. This is atrocious experience, when you remove things that already existed.",
      "voted_up": false,
      "votes_helpful": 69
    },
    {
      "review": "Had to return. Everything good about Stronghold: Crusader is watered down here and weaker. It's shocking to me that this team has been re-releasing the early Stronghold games for over 20 years and still can't figure out what the fans enjoy about it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I am a fan of this game since i have my memory and I really appreciate that Firefly is back working on their best horse. With the new game and DLCs i was hoping for Innovation...\nThis game is very old and they really didnt change a lot. The new Units are fine and important additions to provide but are often just copy pasta. This game has so much unused potential, its insane! \nA few design suggestions:\n- The assasins should be able to climb certain heights with their grappel. Making them unique and usefull.\n- Add units to the already existing recruitment buildings. An armored spearmen who uses the lance and armor. A good shield protected against arrows but doesnt do alot of damage in melee. A basic soldier like unit. \n- Add new production chains or new buildings/Towers etc. Its so simple to add a few more amazing arabic towers.\n\nThe balance is horrible. Some AI Lords are useless just as back in the day. Some units are to expensive and have no purpose and some are just to OP.\n\nThese are just a few suggestions to make clear, that the games potential is not used. Instead we get two new lords who are yet again copy pasta from already existing lords. The community made custom lords themselves who had more flavour....\n\nI really love the game but i feel like they use the sales to fund their new game title instead of focusing on what really worked for them. I would love to see the game flourish and would love to help were i can but i dont think its in the studios interest.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "so bad game. lagging each moment and disconnection with no reason and so manybuggs nos bug fix no updates and very little active players iam upset from this game and regreting buying it and i wish i could have my money back, really very bad game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, but sadly multiplayer is a complete mess, it just crashes all the time and\nyou're lucky if you get to play together for 5 consecutive minutes. \n\nI was really hoping that I'd get to play my fav childhood game with my friends, but it just won't work\n\nMy 2nd problem is with the AI opponents. They barely put troops on their towers, their attacks are poorly coordinated and don't increase in scale. (eg. they place siege weapons so close that your archers decimate them) Overall, they're just really stupid and the improvements made on them are not sufficient. \n\nI want this game to do better and succeed, but right now, with these issues, it's just disappointing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After the 1.05 update, multiplayer isn’t multiplayer anymore, it’s a crash simulator. Extreme Troops mode? 4v4 games? Yeah, right — maybe in some parallel universe. At this point I half expect the game to crash on the main menu. Truly revolutionary stuff. Ridiculous.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Multiplayer constantly crashes, resyncs, and bugs out despite the numerous attempted fixes done by devs...\nWill change review when fixed",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sadly the multiplayer, which is my main buying point, does not work consistently and thus I can't enjoy the game. \nResyncing every 20 seconds or so make the game unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Issue: Multiplayer lobby does not show any available hosts or rooms.\nDetails: \n- When I open the multiplayer lobby, the list is always empty (screenshot attached).\n- I have tried refreshing, changing matchmaking region (Default/Global/Local), but no hosts are visible.\n- My internet connection is stable and the game is updated to the latest version.\n- Even when friends are hosting, their lobbies do not appear for me.\n\nPlease advise if this is a known bug or if there are additional steps I need to follow.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "multiplayer doesn't work properly, input delay when playing online.\ncan't play co-op skirmishes with another person VS AI.\nCo-Op trail campaign trail is all built around an annoying gimmick where each of you only has access to half the resources. \nknow it's an RTS and it comes with the territory but the castle building aspect seems to have been put to the side because it seem's early assassin rushes are the only/best option.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "picked it up to play co-op with a friend, turns out the only Co-op its the shitty trails that's way overtuned and clearly made for people who are veterens of the game. don't know why they wouldn't allow you to A. invite to friend to a skirmish or B. let you add bots to multiplayer. clearly not a technical issue as they have the AI everywhere else in the game but the multiplayer. if you wanna play with friends against bots don't waste your time here",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "At first everything was great, really good in fact, but then they decided to ruin the games with these new AI leaders. I never uninstalled the original Stronghold Crusader from my PCs, but this one will soon be a goner.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played the original since 2004 and the game is fucked. Took to much drugs when balancing the units or the playtesters are a bunch of mixmaxing degenerates. Has to be one of the two.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "as the singer player progress to later stage, the game is straight up cheese where you either rush and cheese the npc to win, and it seem the game didn't even play the game themselves",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its a bad remake especially for the price. The bots are very dumb, attacking in a way that doesnt make sense. The troop controls are bad. The mission maps are bad. I feel like they sold the exact same game from 2000s and just slapped a new price on it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is a great game but unfortunately the game keeps freezing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game controls are really poor.  Not very playable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They really didn't need to \"rebalance\" the game. The fact that they removed the ability to have portable shields on towers is a huge nope. The healers that they added are not gonna cut it as the healing is rather slow and enemies often target them. Your ballistas and archers are gonna be dying a lot, like a lot. Stronghold Crusader 2 had at least a unit that gives armor to surrounding units to give time for healers. You just don't take an ability away without compensating it in return. Either there has to be a support unit, or towers need to be buffed for further damage reduction.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Multiplayer immer noch nach Monaten verbuggt und unspielbar",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this is just a rehash of previously published games/ The graphics are poor and the time to defeat discourages players from playing that scenario. You should do better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm a Stronghold fanboy, Stronghold Crusader was the first PC game I've ever played. With all the hype around the DE I just had to buy this and the DLC, Yet, noticing all the bugs, I couldn't help but think of a mod I heard about before called UCP. UCP changes everything, Suddenly, you can't bum rush the Sultan on the first mission with 30 macemen because it's like wow he actually developed some walls and a survival instict. Where is all this awesome fun in the DE? I stopped supporting you guys after stronghold 3 with a single exception for Stronghold Crusader 2 which was also trash. You guys are worse than Bethesda. You're like that local mom and pop shop that treats you worse than Walmart. Your \"very positive\" rating is entirely undeserved and you ******* know it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Every multiplayer crashes. You play 34 min very well but on battle, resyc, drop outs, you cant not play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Took out the feature of allowing shields in Towers.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was really surprised by the balance of the new units, especially the Bedouins. The Eunuch is almost completely naked and dressed in a strange outfit that looks more like a stripper’s costume — and this is not an insult, it’s just a fact, I was genuinely shocked. Yet this unit can withstand 7 crossbow shots, deals high damage to multiple enemies at once, and can even defeat a Pikeman in full armor. Meanwhile, an Arab swordsman in full armor falls after only three arrows.\n\nAdding a Medic to the Bedouins also creates further imbalance. In fact, almost all of their units feel overpowered or inconsistent, breaking the strategic logic of the game. The new units look odd and don’t match the classic style of Stronghold Crusader at all.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "not bad BUT why still selling DLC?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game advertises, that you can have an army up to 10,000 people, but in a game with 8 players involved, the game will just tell you, that you reached the maximum army size at around 300 people. Realizing this fact and bringing it to attention, will just get you banned from their community page and pretended, like this issue never happened.\nSame goes to other things, like Moat diggers randomly stop digging moats near trees or archers keep on shooting in front of a target instead of shooting their target.",
      "voted_up": false,
      "votes_helpful": 90
    },
    {
      "review": "It's a nice overhaul, good new missions but guys... this game is most fun at multiplayer. But the multiplayer is almost as bad as it's always been. Game crashing randomly, people desyncing, lags etc. It's 2025, you really should have had this fixed already. Until then I cannot recommend. It's only for singleplayer gamers.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "TL;DR\n\nThe game is fine. Fine as the good old Stronghold Crusader fine. And that is my issue with this game. \n\nSH - Stronghold\nSHDE - Stronghold Definitive Edition\nSHC - Stronghold Crusader\nSHCDE - Stronghold Crusader Definitive Edition\nSHCE - Stronghold Crusader Extreme\nSHCEDE - Stronghold Crusader Extreme Definitive Edition\n\nI will open up this review with obvious - SH and SHC are a good, old and well known titles (at least among rts fans). The SHDE is still on my to play list, so I will not reference it much, but SHCDE is second release of definitives. And it feels almost undistinguishable from SHC - which is the best thing about it. I played the game, at the time of writing this review for 155 hours and 100% it, although I did not play PvP content.\n\nSo what's wrong with this game? Well, honestly speaking - if you have HD version, don't bother. They refreshed textures - yes, Added mosques for Arabian Lords - yes, Added new units - yes and added more PvE Content - yes. Sounds amazing right? Yeah, so did I thought. Here is the issue - they \"fixed\" exploits, removed some features and then added a lot of annoying bugs (which are being fixed almost instantly when reported... but still) which make this game almost annoying to even touch. Let me quickly describe bugs and annoyances:\n\nAwesome stuff, that I love:\n  - Auto buy/sell - Chefs kiss.\n\nBugs:\n  - Units randomly stay locked on screen in T-Pose animation, not being there.\n\nQoL:\n  - Selecting unit group, and putting unit rallying point is same, and does not \"deselect\" after recruiting - which means you will put gather points instead of ordering units, which will lead to deaths\n  - Not sure why there is no auto-recruit option...\n  - You cannot put mobile shields on top of walls - which is fine, as we now have healers, but still. It was a thing, it is not anymore.\n  - Still No replace traps?\n  - No \"Repair everything\" button?\n  - No option to repair siege engines?\n  - Why does siege tower dismount engineers?\n  \t- Why do they dismount on top of the wall?!\n  - Why we can't repair buildings\n  - No binds for undo?\n  \t- The undo is just plain dumb, it's time based, so you can place barracks, recruit units and then undo the barracks and place tower...\n\nUnits:\n  - Enemy archers have Patriot arrows, that out range your units and you can do shit about it, even though your units are on towers and enemy archer is fuck knows where\n  \t- Note for developer -> It's most likely caused by group of units moving into range, and the farthest still shooting fsr.\n  - If you put your/enemy units sufficiently close to wall, they can shoot THROUGH it and kill units behind it.\n  - It works the other way around, if you have Fire Ballista, bot will shoot through your walls for no apparent reason (you can surround your unit with walls - does not matter how thick - and it will still keep getting damaged), which works for other units as well.\n  - Targeting unit, leads to hell tone of prediction, which leads to units move erratically, and sometimes missing target\n  - Some enemies will randomly target your walls and \"peck\" on them, which is extremely annoying\n  - Some units run when on aggresive stance but move slow when ordered manually\n  - Units move different speed on recruitment\n  - Units have suicidal tendencies, and the \"shift click\" does not let you set correct path for them to move\n    - This is even more annoying with gather points, which cause units to not fight sometimes\n  - Archers just tend to miss, they all either hit perfectly, over-shoot or under-shoot. So, if first arrow misses, they will all miss.\n\nAssasins:\n  - units meant to scale walls and quickly sneak the enemy lord - They randomly refuse to move and just scatter, making more than sufficient force die without dealing any damage.\n  - they randomly walk around enemy castle, walking into traps and arrow fire, even though they had perfectly fine piece of wall to climb, wasting your gold.\n  - if you give them order during their climb animation, they will ignore it.\n\nLord:\n  - Why can't we have lord bindable?!\n  - Why I do not have indication that I selected lord?! \n\nBeduin units:\n  - Skirmisher - Ugh, why is it in the game?\n  - Sapper - Okay - cheap, fast and destroy walls super quick. I used it sometimes for fun.\n  - Lancer - Ugh; squishy, low damage and does not really deal damage to buildings. What is his purpose?\n  - Heavy camel - UGHBDFSADFSD; Solid arrow resistance, okay damage and can fight close range. Can't shoot when moving. Meh. Never used it.\n  - Demolisher - Digs moats, removes oil pits and killing pits + has shield to cover from fire arrow. In exchange is slow, and has shit damage to units. Worst thing - his shield does not last long and cannot be healed... On paper looks good, when you use him he just plainly is bad.\n  - Eunuch - Slow moving, Squishy, Slow attacking aoe unit for clearing towers... Except that towers need to be cleared before he arrives, otherwise he will not survive.\n  - Healer - Long needed addition. Awesome, perfect, cool - Thumbs up.\n  - Ambusher - Ugh, fire thrower with \"stealth\"... Sorry, for PvE it's a joke.\n\nSands of time\n\nThis is where I broke. I forced myself to get 100% so I played this fully. This just does not fit. This game is about \"STRONG\" yes. But as well about \"HOLD\", which does not mean you should be forced to do something in limited time. I like that they added option to disable time, but this just does not fit the theme. It would be so much better (even looking at the later achievement part) if you would need to hold against infinite hords of enemies, untill your castle brakes. I do not know, limit something per mission to make it more interesting and voila! I will not waste time on this category, it's huge miss for me.\n\nCoop trail\n\nOkay, this one is goated. Well played devs!\n\n\nAchievements...\nOh god. I hate them. They are not really \"achievements\":\n\n- Tyrant - Kill 1'000'000 units.\n\t- I am sorry. How many? This is not achievement, this is time tracker. \"How long do you play this game?\", 'Oh I played it quite long, I am on 735'387!', \"Wow, that's a lot of time!\".\n\t- Tip: Playu SHCEDE Mission: '8. Wazir's Fortress', but save once you setup. Units tend to \"dry up\", after some time.\n\n- Muhammmad al-Idrisi - Upload map to workshop\n\t- What? So you want the workshop to be full of garbage? Make it at least so it needs to reach specific like/download amount!\n\n- Top of The Class - Complete Tutorial\n\t- ... If you consider this achievement, I am truly sorry.\n\n- Banned from circus - Kill 1'000 Lions\n\t- This is grind, absolute and undoubtful grind.\n\t- Tip: Play SHCED Mission: '18. Lionheart'\n\n- Almost there - Complete and time trial with champion rating\n\t- Maybe remove above achievement and give for each trials? They were indeed hard and quite challanging to make in champion time?\n\n- Stay back - Win by recruiting only ranged units\n\t- Yes, but it does not count starting units...\n\n- Subscribe to play scribe - ...\n\t- ...\n\n- Welcome, Lord Bessy! - Have 30 Dairy Farms\n\t- How is it an achievement... Nest will be build 50 apothecaries?\n\n\n\nAt the end\n\nIf you do not want to play Coop trail, skip this. I really like devs commitment to series, but I as well feel some kind of dark force. All I know is that this definitive edition combined with Crusader II show that devs most likely forgot what made this series so good, or I just do not understand how to play games. \n\nEither way, I will continue to play this game with next patches, but for now... Sorry. This is atrocious experience, when you remove things that already existed.",
      "voted_up": false,
      "votes_helpful": 69
    },
    {
      "review": "Had to return. Everything good about Stronghold: Crusader is watered down here and weaker. It's shocking to me that this team has been re-releasing the early Stronghold games for over 20 years and still can't figure out what the fans enjoy about it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I am a fan of this game since i have my memory and I really appreciate that Firefly is back working on their best horse. With the new game and DLCs i was hoping for Innovation...\nThis game is very old and they really didnt change a lot. The new Units are fine and important additions to provide but are often just copy pasta. This game has so much unused potential, its insane! \nA few design suggestions:\n- The assasins should be able to climb certain heights with their grappel. Making them unique and usefull.\n- Add units to the already existing recruitment buildings. An armored spearmen who uses the lance and armor. A good shield protected against arrows but doesnt do alot of damage in melee. A basic soldier like unit. \n- Add new production chains or new buildings/Towers etc. Its so simple to add a few more amazing arabic towers.\n\nThe balance is horrible. Some AI Lords are useless just as back in the day. Some units are to expensive and have no purpose and some are just to OP.\n\nThese are just a few suggestions to make clear, that the games potential is not used. Instead we get two new lords who are yet again copy pasta from already existing lords. The community made custom lords themselves who had more flavour....\n\nI really love the game but i feel like they use the sales to fund their new game title instead of focusing on what really worked for them. I would love to see the game flourish and would love to help were i can but i dont think its in the studios interest.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "so bad game. lagging each moment and disconnection with no reason and so manybuggs nos bug fix no updates and very little active players iam upset from this game and regreting buying it and i wish i could have my money back, really very bad game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, but sadly multiplayer is a complete mess, it just crashes all the time and\nyou're lucky if you get to play together for 5 consecutive minutes. \n\nI was really hoping that I'd get to play my fav childhood game with my friends, but it just won't work\n\nMy 2nd problem is with the AI opponents. They barely put troops on their towers, their attacks are poorly coordinated and don't increase in scale. (eg. they place siege weapons so close that your archers decimate them) Overall, they're just really stupid and the improvements made on them are not sufficient. \n\nI want this game to do better and succeed, but right now, with these issues, it's just disappointing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After the 1.05 update, multiplayer isn’t multiplayer anymore, it’s a crash simulator. Extreme Troops mode? 4v4 games? Yeah, right — maybe in some parallel universe. At this point I half expect the game to crash on the main menu. Truly revolutionary stuff. Ridiculous.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Multiplayer constantly crashes, resyncs, and bugs out despite the numerous attempted fixes done by devs...\nWill change review when fixed",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sadly the multiplayer, which is my main buying point, does not work consistently and thus I can't enjoy the game. \nResyncing every 20 seconds or so make the game unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Issue: Multiplayer lobby does not show any available hosts or rooms.\nDetails: \n- When I open the multiplayer lobby, the list is always empty (screenshot attached).\n- I have tried refreshing, changing matchmaking region (Default/Global/Local), but no hosts are visible.\n- My internet connection is stable and the game is updated to the latest version.\n- Even when friends are hosting, their lobbies do not appear for me.\n\nPlease advise if this is a known bug or if there are additional steps I need to follow.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "multiplayer doesn't work properly, input delay when playing online.\ncan't play co-op skirmishes with another person VS AI.\nCo-Op trail campaign trail is all built around an annoying gimmick where each of you only has access to half the resources. \nknow it's an RTS and it comes with the territory but the castle building aspect seems to have been put to the side because it seem's early assassin rushes are the only/best option.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "picked it up to play co-op with a friend, turns out the only Co-op its the shitty trails that's way overtuned and clearly made for people who are veterens of the game. don't know why they wouldn't allow you to A. invite to friend to a skirmish or B. let you add bots to multiplayer. clearly not a technical issue as they have the AI everywhere else in the game but the multiplayer. if you wanna play with friends against bots don't waste your time here",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "At first everything was great, really good in fact, but then they decided to ruin the games with these new AI leaders. I never uninstalled the original Stronghold Crusader from my PCs, but this one will soon be a goner.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played the original since 2004 and the game is fucked. Took to much drugs when balancing the units or the playtesters are a bunch of mixmaxing degenerates. Has to be one of the two.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "as the singer player progress to later stage, the game is straight up cheese where you either rush and cheese the npc to win, and it seem the game didn't even play the game themselves",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its a bad remake especially for the price. The bots are very dumb, attacking in a way that doesnt make sense. The troop controls are bad. The mission maps are bad. I feel like they sold the exact same game from 2000s and just slapped a new price on it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is a great game but unfortunately the game keeps freezing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game controls are really poor.  Not very playable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They really didn't need to \"rebalance\" the game. The fact that they removed the ability to have portable shields on towers is a huge nope. The healers that they added are not gonna cut it as the healing is rather slow and enemies often target them. Your ballistas and archers are gonna be dying a lot, like a lot. Stronghold Crusader 2 had at least a unit that gives armor to surrounding units to give time for healers. You just don't take an ability away without compensating it in return. Either there has to be a support unit, or towers need to be buffed for further damage reduction.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Multiplayer immer noch nach Monaten verbuggt und unspielbar",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this is just a rehash of previously published games/ The graphics are poor and the time to defeat discourages players from playing that scenario. You should do better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm a Stronghold fanboy, Stronghold Crusader was the first PC game I've ever played. With all the hype around the DE I just had to buy this and the DLC, Yet, noticing all the bugs, I couldn't help but think of a mod I heard about before called UCP. UCP changes everything, Suddenly, you can't bum rush the Sultan on the first mission with 30 macemen because it's like wow he actually developed some walls and a survival instict. Where is all this awesome fun in the DE? I stopped supporting you guys after stronghold 3 with a single exception for Stronghold Crusader 2 which was also trash. You guys are worse than Bethesda. You're like that local mom and pop shop that treats you worse than Walmart. Your \"very positive\" rating is entirely undeserved and you ******* know it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Every multiplayer crashes. You play 34 min very well but on battle, resyc, drop outs, you cant not play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Took out the feature of allowing shields in Towers.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was really surprised by the balance of the new units, especially the Bedouins. The Eunuch is almost completely naked and dressed in a strange outfit that looks more like a stripper’s costume — and this is not an insult, it’s just a fact, I was genuinely shocked. Yet this unit can withstand 7 crossbow shots, deals high damage to multiple enemies at once, and can even defeat a Pikeman in full armor. Meanwhile, an Arab swordsman in full armor falls after only three arrows.\n\nAdding a Medic to the Bedouins also creates further imbalance. In fact, almost all of their units feel overpowered or inconsistent, breaking the strategic logic of the game. The new units look odd and don’t match the classic style of Stronghold Crusader at all.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "not bad BUT why still selling DLC?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game advertises, that you can have an army up to 10,000 people, but in a game with 8 players involved, the game will just tell you, that you reached the maximum army size at around 300 people. Realizing this fact and bringing it to attention, will just get you banned from their community page and pretended, like this issue never happened.\nSame goes to other things, like Moat diggers randomly stop digging moats near trees or archers keep on shooting in front of a target instead of shooting their target.",
      "voted_up": false,
      "votes_helpful": 90
    },
    {
      "review": "It's a nice overhaul, good new missions but guys... this game is most fun at multiplayer. But the multiplayer is almost as bad as it's always been. Game crashing randomly, people desyncing, lags etc. It's 2025, you really should have had this fixed already. Until then I cannot recommend. It's only for singleplayer gamers.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "TL;DR\n\nThe game is fine. Fine as the good old Stronghold Crusader fine. And that is my issue with this game. \n\nSH - Stronghold\nSHDE - Stronghold Definitive Edition\nSHC - Stronghold Crusader\nSHCDE - Stronghold Crusader Definitive Edition\nSHCE - Stronghold Crusader Extreme\nSHCEDE - Stronghold Crusader Extreme Definitive Edition\n\nI will open up this review with obvious - SH and SHC are a good, old and well known titles (at least among rts fans). The SHDE is still on my to play list, so I will not reference it much, but SHCDE is second release of definitives. And it feels almost undistinguishable from SHC - which is the best thing about it. I played the game, at the time of writing this review for 155 hours and 100% it, although I did not play PvP content.\n\nSo what's wrong with this game? Well, honestly speaking - if you have HD version, don't bother. They refreshed textures - yes, Added mosques for Arabian Lords - yes, Added new units - yes and added more PvE Content - yes. Sounds amazing right? Yeah, so did I thought. Here is the issue - they \"fixed\" exploits, removed some features and then added a lot of annoying bugs (which are being fixed almost instantly when reported... but still) which make this game almost annoying to even touch. Let me quickly describe bugs and annoyances:\n\nAwesome stuff, that I love:\n  - Auto buy/sell - Chefs kiss.\n\nBugs:\n  - Units randomly stay locked on screen in T-Pose animation, not being there.\n\nQoL:\n  - Selecting unit group, and putting unit rallying point is same, and does not \"deselect\" after recruiting - which means you will put gather points instead of ordering units, which will lead to deaths\n  - Not sure why there is no auto-recruit option...\n  - You cannot put mobile shields on top of walls - which is fine, as we now have healers, but still. It was a thing, it is not anymore.\n  - Still No replace traps?\n  - No \"Repair everything\" button?\n  - No option to repair siege engines?\n  - Why does siege tower dismount engineers?\n  \t- Why do they dismount on top of the wall?!\n  - Why we can't repair buildings\n  - No binds for undo?\n  \t- The undo is just plain dumb, it's time based, so you can place barracks, recruit units and then undo the barracks and place tower...\n\nUnits:\n  - Enemy archers have Patriot arrows, that out range your units and you can do shit about it, even though your units are on towers and enemy archer is fuck knows where\n  \t- Note for developer -> It's most likely caused by group of units moving into range, and the farthest still shooting fsr.\n  - If you put your/enemy units sufficiently close to wall, they can shoot THROUGH it and kill units behind it.\n  - It works the other way around, if you have Fire Ballista, bot will shoot through your walls for no apparent reason (you can surround your unit with walls - does not matter how thick - and it will still keep getting damaged), which works for other units as well.\n  - Targeting unit, leads to hell tone of prediction, which leads to units move erratically, and sometimes missing target\n  - Some enemies will randomly target your walls and \"peck\" on them, which is extremely annoying\n  - Some units run when on aggresive stance but move slow when ordered manually\n  - Units move different speed on recruitment\n  - Units have suicidal tendencies, and the \"shift click\" does not let you set correct path for them to move\n    - This is even more annoying with gather points, which cause units to not fight sometimes\n  - Archers just tend to miss, they all either hit perfectly, over-shoot or under-shoot. So, if first arrow misses, they will all miss.\n\nAssasins:\n  - units meant to scale walls and quickly sneak the enemy lord - They randomly refuse to move and just scatter, making more than sufficient force die without dealing any damage.\n  - they randomly walk around enemy castle, walking into traps and arrow fire, even though they had perfectly fine piece of wall to climb, wasting your gold.\n  - if you give them order during their climb animation, they will ignore it.\n\nLord:\n  - Why can't we have lord bindable?!\n  - Why I do not have indication that I selected lord?! \n\nBeduin units:\n  - Skirmisher - Ugh, why is it in the game?\n  - Sapper - Okay - cheap, fast and destroy walls super quick. I used it sometimes for fun.\n  - Lancer - Ugh; squishy, low damage and does not really deal damage to buildings. What is his purpose?\n  - Heavy camel - UGHBDFSADFSD; Solid arrow resistance, okay damage and can fight close range. Can't shoot when moving. Meh. Never used it.\n  - Demolisher - Digs moats, removes oil pits and killing pits + has shield to cover from fire arrow. In exchange is slow, and has shit damage to units. Worst thing - his shield does not last long and cannot be healed... On paper looks good, when you use him he just plainly is bad.\n  - Eunuch - Slow moving, Squishy, Slow attacking aoe unit for clearing towers... Except that towers need to be cleared before he arrives, otherwise he will not survive.\n  - Healer - Long needed addition. Awesome, perfect, cool - Thumbs up.\n  - Ambusher - Ugh, fire thrower with \"stealth\"... Sorry, for PvE it's a joke.\n\nSands of time\n\nThis is where I broke. I forced myself to get 100% so I played this fully. This just does not fit. This game is about \"STRONG\" yes. But as well about \"HOLD\", which does not mean you should be forced to do something in limited time. I like that they added option to disable time, but this just does not fit the theme. It would be so much better (even looking at the later achievement part) if you would need to hold against infinite hords of enemies, untill your castle brakes. I do not know, limit something per mission to make it more interesting and voila! I will not waste time on this category, it's huge miss for me.\n\nCoop trail\n\nOkay, this one is goated. Well played devs!\n\n\nAchievements...\nOh god. I hate them. They are not really \"achievements\":\n\n- Tyrant - Kill 1'000'000 units.\n\t- I am sorry. How many? This is not achievement, this is time tracker. \"How long do you play this game?\", 'Oh I played it quite long, I am on 735'387!', \"Wow, that's a lot of time!\".\n\t- Tip: Playu SHCEDE Mission: '8. Wazir's Fortress', but save once you setup. Units tend to \"dry up\", after some time.\n\n- Muhammmad al-Idrisi - Upload map to workshop\n\t- What? So you want the workshop to be full of garbage? Make it at least so it needs to reach specific like/download amount!\n\n- Top of The Class - Complete Tutorial\n\t- ... If you consider this achievement, I am truly sorry.\n\n- Banned from circus - Kill 1'000 Lions\n\t- This is grind, absolute and undoubtful grind.\n\t- Tip: Play SHCED Mission: '18. Lionheart'\n\n- Almost there - Complete and time trial with champion rating\n\t- Maybe remove above achievement and give for each trials? They were indeed hard and quite challanging to make in champion time?\n\n- Stay back - Win by recruiting only ranged units\n\t- Yes, but it does not count starting units...\n\n- Subscribe to play scribe - ...\n\t- ...\n\n- Welcome, Lord Bessy! - Have 30 Dairy Farms\n\t- How is it an achievement... Nest will be build 50 apothecaries?\n\n\n\nAt the end\n\nIf you do not want to play Coop trail, skip this. I really like devs commitment to series, but I as well feel some kind of dark force. All I know is that this definitive edition combined with Crusader II show that devs most likely forgot what made this series so good, or I just do not understand how to play games. \n\nEither way, I will continue to play this game with next patches, but for now... Sorry. This is atrocious experience, when you remove things that already existed.",
      "voted_up": false,
      "votes_helpful": 69
    },
    {
      "review": "Had to return. Everything good about Stronghold: Crusader is watered down here and weaker. It's shocking to me that this team has been re-releasing the early Stronghold games for over 20 years and still can't figure out what the fans enjoy about it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I am a fan of this game since i have my memory and I really appreciate that Firefly is back working on their best horse. With the new game and DLCs i was hoping for Innovation...\nThis game is very old and they really didnt change a lot. The new Units are fine and important additions to provide but are often just copy pasta. This game has so much unused potential, its insane! \nA few design suggestions:\n- The assasins should be able to climb certain heights with their grappel. Making them unique and usefull.\n- Add units to the already existing recruitment buildings. An armored spearmen who uses the lance and armor. A good shield protected against arrows but doesnt do alot of damage in melee. A basic soldier like unit. \n- Add new production chains or new buildings/Towers etc. Its so simple to add a few more amazing arabic towers.\n\nThe balance is horrible. Some AI Lords are useless just as back in the day. Some units are to expensive and have no purpose and some are just to OP.\n\nThese are just a few suggestions to make clear, that the games potential is not used. Instead we get two new lords who are yet again copy pasta from already existing lords. The community made custom lords themselves who had more flavour....\n\nI really love the game but i feel like they use the sales to fund their new game title instead of focusing on what really worked for them. I would love to see the game flourish and would love to help were i can but i dont think its in the studios interest.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "so bad game. lagging each moment and disconnection with no reason and so manybuggs nos bug fix no updates and very little active players iam upset from this game and regreting buying it and i wish i could have my money back, really very bad game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, but sadly multiplayer is a complete mess, it just crashes all the time and\nyou're lucky if you get to play together for 5 consecutive minutes. \n\nI was really hoping that I'd get to play my fav childhood game with my friends, but it just won't work\n\nMy 2nd problem is with the AI opponents. They barely put troops on their towers, their attacks are poorly coordinated and don't increase in scale. (eg. they place siege weapons so close that your archers decimate them) Overall, they're just really stupid and the improvements made on them are not sufficient. \n\nI want this game to do better and succeed, but right now, with these issues, it's just disappointing.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}