{
  "positive": [
    {
      "review": "Amazing game, love the inventory management and some fun build you can make and test how crazy things can get in the experimental endless mode.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Difficult in the beginning but I got hooked quite quickly. The gameplay and progession for, music and looks of the game are all great.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "VERY short, takes about an hour to beat. That being said, it's early access, a lot of the negative reviews read like they have never played a Roguelike before. For what the game is, it's GREAT... It's just really short, one level so far. If they add more and support this game like Vampire Survivors does, then this will be AMAZING.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The backpack puzzeling aspect makes this game so much more interesting to me than other games in the \"survivor\" genre. Its not just a straight upgrade path, but a balance you need to find on which weapons to use and how to optimse the backpack space you have availabel.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Giving a thumbs up because overall the game is fun and the game loop is great.\r\n\r\nMy main issue is that the balancing that feels very off when you play it. \r\n\r\nThe more you progress in the game the less fun it becomes: you finish the first levels easily, you unlock new characters, gears and and (unnecessarily) bigger maps but the game becomes more tedious ; \r\n\r\nZombies become harder to kill, do more damage & are more maps are thrown at you and and since you have unlocked more items, you are less likely to craft a strong build you would like. \r\n\r\nSome runs simply fail because you lack one or two core items (boots that give mobility, a component of a legendary item that simply never drops, legendary items that never drop), and after playing for 20 - 30 minutes you die and you get a ridiculously low amount of currency to upgrade your passive skills. And all this leads to some level frustration.\r\n\r\nI hope they manage to balance things out because overall I enjoyed the game so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A run starts out slow due to the lack of item variety and class imbalance, but I hope it will be improved from time to time.\nOverall, it's worth a try with an acceptable price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the best! It is addictiv and enjoyable! The time from morning to night goes by in blink of an eye.\nOne of the best games i have ever played!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like the old browser games back in school days - Highly addicting and lots of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loot, shoot, return through the loop!\n\nThis games is a great direction to take a sequel.\nI loved the first game and just wanted more.\nThis almost feels like a complete re imagining with the perspective and 2.5d change.\n\nOnly critique, I wish there was more. I'm in love with this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can lose alot of hours to this game.\r\n\r\nIt scratches all the right it itches.\r\n\r\n10/10 Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun with load of items for different builds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, focus on getting loot and getting out at first! Its not your typical kill all enemies survivor, especially during the early levels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great fun while it lasted. Hope there's more to come, especially more items as I love playing around with different builds. Different map setups (like a beach/snowy mountains) and the addition of more and challenging bosses would be awesome as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A absolute great sequel to the last game (without the derpy extra characters). Can't complain too much about the game other then the rng can be a evil.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After spending quite a lot of time with this very game and the demo version beforehand - yes, it is quite addictive! Always searching for the next best build you can manage to obtain, trying out different builds, different characters, trying to obtain new ones - especially the beta endless mode is merciless while at the same time something you can't stay away from. There are people out there that have managed to get to day 1.000 something and I'm still trying to make it at least to day 100... Love the game and it's possible combos!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fantastic. I hope for an update to adjust the economy slightly. I understand getting playtime out of progression, but I also understand grinding for apples is a bit of a drag when things are so crazy expensive. Here is to hope that this will scale back a bit.\n\nDon't stay in early status forever, this game is too good to get lost in the backlogs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a hidden gem. The gameplay loop is simple, and the backpack inventory mini game scratches that it's from Backpack Hero's. \r\n\r\nIt can be a bit repetetive at first, but it opens up with the different characters and weapon crafting. \r\n\r\nPlays very well on the steamdeck!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Take a little bit of Vampire Survivors, add some Backpack Battles, use some pixel art with a hin of 3d Dot Game Heroes and you have one of the most fun Survivor like / Bullet Heaven games you can find.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great roguelight with lots of options to create that perfect, screen clearing build. \nPixelart is nice and music and sounds are good too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely excellent, just want to see more content, more guns, more bullets, more enemies, more easter eggs, more levels, more school buses, more socks, more petrol, more roller blades, more backpack, more, more, more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, the builds and inventory/loot system is fantastic, but needs significantly more content. 23 hours in and there isn't a lot more of a reason to play anymore, which is a real shame.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this in demo and on the day of release. Truly addicting and fun! \n\nThe void + Robotic arm are one of the best things to hoard. Makes things OP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and entertaining game.lacks updates but its expected, it came out a few moths ago.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It still has a lot of bugs, it is fun though. Half the runs i go on, once i use a quick use item, i cant collect nor use another one, so its gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm really like this one so far and with some more work it could be top tier. The backpack system is simple and fun, so is the bullet heaven action. I also appreciate that I can quit the game mid run and come back to it.\n\nThe major thing lacking for me is the music, it's terrible and I had to turn it off, but then it felt empty and weird. So lately I've been using the Roboquest soundtrack instead and it transforms the experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the demo when it was first put out. I didn't play the demo much but i loved the game. I like how its easy and slowly gets harder. I also like that we can change the custom. The devlpovers put a lot of time into the game and made it a lot of fun for everyone. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is extremely fun. Unlike most Roguelikes, this one allows for countless builds and risk vs reward situations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, many options, the meta progression is fun but takes a while.\r\nRecommend it for boring lessons in school.\r\nIf you want, there is an endless mode where you can spend a lot of time and compete with the world or your friendlist.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played the demo a lot before I received the full game using a steam key, the game is amazing. core game play, graphics, everything. I can tell these developers who made this are actually talented people. amazing game overall 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, nice progression, and well-designed core mechanic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The days were indeed deadly... but mostly for the zombies that encountered my AK. A beautiful vacation of mayhem, explosions and orchestrated chaos. 10/10 would BBQ another horde.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Still in early access and needs more content but is already a serious time eater.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "in EA, so keep that in mind. Right now there is not a ton here, but what is, is quite solid. The things that are wonky are mainly that ranged weapons suck, and melee builds are superior except for the character who reduces reload times on ranged weapons, which is the main issue, reload times are long enough that it allows enemies to swarm you and kill you until you get reload times way down and there is only 1 item that reduces reload times outside of the special item of the one character, so 2 but you have to play the one guy to get it. Then also there is one enemy type that is the only real threat and it throws tons of enemies at you so it becomes an issue really fast. They are ones that dash at you. And they are the only ones that will kill you most of the time. You cant hurt them during their dash, and they are invulnerable for a 1 second period after they dash for some reason too. Another issue is really that the crafting system has bad recipes. Some items that take a lot of awkward items in amounts that are kind of tough to get, lead to really underwhelming items. Meanwhile some pretty universally good ones thankfully at least, have easy to get items. The worst is the melee item chainsaw, which requires 2 ranged weapon items for some reason? And then the pizza launcher item is also really bad but takes 3 other crafted items to build. I really hope they tweak some of these to be easier to get, and add more recipes. Especially for the items that allow you hold more weapons, which right now you have to get really lucky to find since they are the top rarity.\r\n\r\nThere is a lot of space to grow and you can see the blank spots in parts of the game as placeholders to add tons more, so I'm looking forward to that. The gameplay is addictive and while there is a lot of room to grow, what we have here is already solidly built and plenty of fun to be had. I like the way you unlock characters being through gameplay instead of some boring meta progress tokens. Feels like the old games of the past in the 80s and 90s and early 2000's.\r\n\r\nThere have been solid additions so far, but they come slow. So don't expect weekly updates. The focus is definately to first build a solid game with good features before adding tons of content on a weak foundation which is the right way to do this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DD:R is a cool concept for a shooter, adding survival elements so every level plays like a scavenger mission. Could use more enemy variety and faster progression - feels a bit grindy - but it's fun.\n\nWant to know more? Check out my Bite Size Review here:\nhttps://www.cshpicone.com/gaming/bite-sized-game-reviews/bsr-deadly-days-roadtrip\n\nFor more niche curation, follow me at: https://store.steampowered.com/curator/27440015-CSH-Picone/\n\nWant more honest niche & indie reviews? Check out: https://www.cshpicone.com/gaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, it feels very balanced and can be very hard but also you can feel very powerful when you have a good build going :D Only tip I can give (though I can't heed it myself): Don't try to take all loot on the first few maps :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I HATE IT. Loot RNG sucks and screws you over all the time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wow. what a game. the game keeps you coming back for more no matter how many times you fail",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Usually demos don't lure me into buying a game but this one was different",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to kill time! cant wait to see what else gets added!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good as hell, if you liked the first game this one is even better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game with a different look at how back pack games are played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've played the past years.\nCan't wait to see what else the dev will release in the future.\nNominated it for GOTY.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AAA+++ SUPER GAME but MISS CZECH language <3 :) Ready for another UPDATE <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game fixed my marriage and brought my lost dog back home.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "forced  review for a badge but a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "forced review for a badge but a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game, am waiting for new content :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommendation: HEAVILY RECOMMENDED.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game concept",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, i suck at it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game (Steam Awards)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just one more run....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "itz gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greed will kill you... Also zombies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im addicted. help",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "addict",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "+1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far...\r\n+ Good progression system.\r\n+ Fun tetris-inventory system akin to RE inventory. \r\n+ Not too difficult missions with reasonable boss fight.\r\n+ Crafting, unlocking weapons.\r\n+ Variety in map design for each segment of a run.\r\n+ Classes, weapons and upgrades to unlock\r\n+ Endless mode\r\n\r\n- Need more regions (climate, weather and geography).\r\n- More weapons. More active abilities aside from dash that can be chosen during mission start.\r\n- Need some voice for immersion.\r\n- Base is empty. You drive a bus, alone. \r\n- No NPC to interact with\r\n\r\nWould be fun to have:\r\n+ Coop\r\n+ Add NPCs at the base. \r\n+ Add conversations for immersion.\r\n+ MOD SUPPORT",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Played the beta / demo for 30+ hours.\nI can safely say that this is my game of the year. Might not beat the crazy competition this year, but this is GOTY worthy in my opinion.\n\nOnly other game within the genre that gets close is Brotato.",
      "voted_up": true,
      "votes_helpful": 28
    },
    {
      "review": "First things first: The game is fantastic and, even in Early Access, is an absolute must-buy for anyone who enjoys Brotato and Backlash Battles.\n\nSince there's no roadmap yet, I'd like to take this opportunity to point out a few things the game needs before the 1.0 release: More items and more crafting. More options for building defense. More ways to improve, enhance, or convert status effects. More characters with dedicated effects.\n\nThe foundation the game will build on in the future is enormous. I look forward to every update and wish everyone lots of fun.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "A solid survivor like with it's own unique twist. It has a surprising amount of content for an early access. I think it's well worth the $15 price tag. I know others have said it lacks content but for me, I'v found lots to enjoy. Perhaps because I enjoy unlocking all the characters. Some of them take a lot of work, especially the one they just released with the Halloween update. I've figured out how to carve the pumpkin but getting the right build to do it... It still eludes me.\n\nP.S. - I forgot to mention that it runs wonderfully on the Steam Deck or similar device.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "As a terminal rouge-like/ lite addict, I highly recommend this game. I have logged so much time playing games in the genre and I have a wishlist for new games:\n\n1. Progression should add to the sand box instead of scaling stats.\n\n2. Upgrade choices should interact with each other in unique ways\n\n3. I want the ability to completely break the game. I want to fry an egg on my GPU at the end of an endless run when things are going my way.\n\nThis game meets all of that criteria, and more. The backpack system is a unique bonus to gameplay, and is how I hoped this feature thatâ€™s popular in other games would eventually be implemented in an action rougelike.\n\nFor those who know: this game is Vampire Survivors meets Backpack Hero.\n\n*I received this game in a giveaway in the developers discord, theyâ€™ve built a really great community!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Super addictive gameplay, zombie killing roadtrip on steroids.\nAfter more than 300 hours deep diving the demo this is way beyond expectation.\n\nCurrent state as start of EA better than other complete games.\n\nBuy and kill, die and repeat over and over again.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Fun little game, plenty of zombies to shoot in style. What's not to like ?",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Very fun game. Even in early access definitely worth the money. Doubly so with the current discount. \n\nItem management gives it a good amount of depth, which will just get better with more updates. Gameplay itself is very satisfying while keeping a good level of difficulty. \n\nHonestly, I don't know how I ended up with 21 hours in it already. It felt like maybe 5. Time was flying.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game has it all! You get weapon management, upgrades, challenging mid-bosses, an infinite competitive game mode, and a compelling story mode. Everything!\n\nIf you like the genre, play it and you'll easily spend hours and hours on it! This game pays for itself!\n\nAlso perfect for on the go with the SteamDeck.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Geiler mix aus Brotato und Backpack battles. Hatte ziemliche krasse Runs mit 150+ Tagen. Bin gespannt jetzt bei Release des EA. Mir wurde der Key gestellt, aber die 60h+ hab ich freiwillig investiert :)",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Echt ein fantastisches Spiel, welches viele kleine Mechaniken in einem kobiniert. Klar wird das Rad nicht neu erfunden, aber das was das Game macht, macht es zu groÃŸen Teilen richtig. Und wa gibt noch viel Potential fÃ¼r zukÃ¼nftige Erweiterungen.\n\nWer also eine spaÃŸiges Spiel fÃ¼r Zwischendurch, oder ein Game zum vollkommen reinsuchten und Minmaxen sucht, ist hiermit sehr gut bedient.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game is standing shoulder to shoulder with the best in it's genre.  I'm having a lot of fun working my way through the unlockable content & am overall very satisfied with the gameplay loop/mechanics.  In order for it to have the replayabllity of some other roguelite titans more items & characters would need to be added but even if the developer leaves it as is, I feel I've gotten my monies worth.  Strongly recommended.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A supremely fun game.\n\nThis game blends survivors like game play (auto attack and aim with click to manually shoot anytime) with inventory management ala backpack battles and the like, with an \"extraction shooter\" element (you must gather X fuel to leave each map) that makes the length of each map vary quite a bit as each map can vary for loot and fuel presence, and how long your survive, how lucky you get finding fuel, and how long you elect to try to \"farm\" extra before you leave.  Day turns to night and the zombies get more and more powerful so you are always working to be as efficient as possible.  It's a very enjoyable mix.\n\nThere are the typical long term progression perks one can acquire and more characters to unlock as in a survivors style game.\n\nThe overall loop is very satisfying if not wildly addicting.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great game with fun gameplay and beautiful art style, but still room for improvement.\n\nThe game concept is very simple: loot a bunch of cool stuff, build your loadout and shred zombies with it. Then, after collecting enough gas, you can extract from the current stage and go on to the next stage. After 7 stages you fight the final boss and after defeating it, you have completed your first run. Back in your camp, there is some meta progression to unlock and then you start all over again.\n\nDespite the base game mechanics being very simple, each run is still a fun and more or less unique experience (more on that later). The complexity comes from the different items, weapons and characters and the way you combine them. Managing your inventory, choosing which items to equip, which to sell and building your loadout is really cool. I really like how items are affected by your inventory arrangement, in particular. This can all lead to some pretty insane loadout configurations. And testing those against hordes of zombies is REALLY fun.\n\nHowever, there are also some aspects that are still in need of improvement. First of all, the game needs a lot more content. There is already an okay amount in the game, but it's stretched very thin and restricted by a lot of meta progression upgrades. It took me about 45 hours (including the 10h I spent on the demo) to unlock all content (damn the astronaut). Looking back now, it feels like the time I've spent on the game and the amount of content I unlocked during that time don't really add up. The balance just seems a little off and there were some times, when I just rushed through another run to get duct tape for an upgrade, so that I could finally get more items for more complex builds.\nAll of that just felt a little dry and unrewarding [u] sometimes[/u] . Especially because you can only get a maximum amount of 2 duct tape in one run and therefore have to defeat the boss, if you want to progress. This can be a little frustrating, because it takes away your motivation to experiment with new loadouts and higher danger levels. You have to play it safe and always get the 2 possible duct tape to ensure your progress.\nThat also leads to my last point of criticism. Currently, endgame is a very dull experience. After finishing a couple of runs, you pretty much get the hang of it and defeating the boss isn't really much of a challenge anymore. What keeps the game interesting is honing your loadout to perfection by getting every last backpack space filled with the best possible item to boost your weapon and then see how far you can get with that. And this is all possible by staying in one stage for as long as you can last or by choosing the endless mode after completing a run. But there are some problems you'll run into.\nFor starters you get no meta progression in endless mode, which makes it kind of pointless, if you haven't unlocked everything yet. Also, as I mentioned earlier, there is not enough content in the game yet, so endless mode gets repetitive really quickly (more than in other similar games). And finally, you come across perfomance issues rather quickly, especially with some specific weapons and builds. Some of those perfomance issues have already been patched but not all of them. To be fair, it was highlighted by the devs that endless mode is still a work in progress and more of a fun bonus. Nevertheless, it plays a big part in keeping the game interesting after few hours of playtime, which is why I chose to view it as a main part of the game.\n\nTo put it in a nutshell, the game can be really fun to play and has a lot of potential, but it still lacks in content and some proper endgame mechanics. Whether those are achieved by improving the endless mode or by adding another way to keep endgame interesting is yet to be seen. Eventhough, I focused a lot on aspects that still need improvement in the section above, I still recommend this game because I had a lot of fun playing it. It is still in early access, so most of the things I criticised will probably be fixed over time (or at least I hope so)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The Game is simply awesome. Buy it and play it. \nPlayed it since GC 2024 in Germany. Played the Demo Version and this was a \"nothing can stop me from buying it \" game.. \nEven tho there is an extremely unsatisfying detail... you get 2 Dogs for the Supportrer Bundle... but no Cat? or an Ape with a Banana? like ... come on ... who wants Dogs... \nlooking forward to buy the Supporter Pack as soon as the Cat ist in it",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "More Item, More Fun. At least until my computer slows down. That P.I.Z.Z.A Launcher is awesome, I wish I could use it, I'm done crafting it, but it lacks a robot arm to use it, so I died before I could use it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "What a fun roguelite! Pick it up now in the Autumn Sale 2025! Amazing 3D-Pixel world. Gorgeous music. Due to dash more control than similar titles and hence more engagement. Fun dry, deadpan humor. Evolving enemies. Calm until it's not. But you know: No pressure! Lifts the whole survivor genre to the next level. Easily worth the price of admission now. It already works. Looking forward to what zany & weird shit will appear in the future. Kudos to the beautiful people creating this. <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good fun mix of looter-extraction-swarm-survivor games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Needs more content, but plays well for early access. No issues with crashes or bugs, and did not experience any slowdowns until going into endless mode and spamming projectiles everywhere.\n\nI do think success in a run is currently too dependent on unlocking backpack space in the first map, The power curve of your build is reliant on exploring and farming the first maps as hard as possible, then in the later game you don't really even need to explore for items because you get so many from leveling up once your build is capable of melting hordes past the time limit. However, if you don't find backpack space in your early drops then you are pretty much boned, because you won't have the power to farm, and you will also be junking items because of limited storage space.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing game, love the inventory management and some fun build you can make and test how crazy things can get in the experimental endless mode.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Difficult in the beginning but I got hooked quite quickly. The gameplay and progession for, music and looks of the game are all great.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "VERY short, takes about an hour to beat. That being said, it's early access, a lot of the negative reviews read like they have never played a Roguelike before. For what the game is, it's GREAT... It's just really short, one level so far. If they add more and support this game like Vampire Survivors does, then this will be AMAZING.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game has a lot of potential, and I'll check it out again when it's released at the latest. I'm already looking forward to it.\r\nAt this point, however, it's still extremely unfinished. The balancing in particular is terrible. Melee weapons feel overpowered, while most ranged weapons are useless. The â€œbuff itemsâ€ are relatively insignificant, but nice to collect.\r\nI would also like to see at least one more upgrade level for the items.\r\nThe rogue-lite elements are rudimentary, but they serve their purpose. I'm also expecting more content here!\r\n\r\n\r\nAll in all, I will recommend this game. For a fresh early access release, it's already quite entertaining for 2-3 hours.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Editing review as the devs have added a sort of tutorial system that provides the early game explanations I had been missing. Super bonus points for devs listening to their player base!! Don't see that too often these days.\n\nI'm enjoying it so far. Working on getting all the achievements currently available, which mostly seem to be based on doing introductory things, finishing a run, and then finding costumes/unlockable characters. The items are fun to experiment with and figure out which ones I like best, and I am a bit of a sucker for organizing and playing tetris with my inventory system. Fans of the OG Resident Evil games will feel right at home with that. Over all, though there are other similar zombie hoard survival rogue-likes that I enjoy more, this game is very fun and addictive (and HARD, oh goodness, but the fun challenging kind not the frustrating kind) and I'm looking forward to it coming out of early access and the additional content that is clearly planned for the game as there are numerous \"to be added\" silhouettes in the game. The devs are clearly paying attention to things their players are saying, both in reviews and the Discord (and perhaps even the subreddit), which is so refreshing. They clearly love this game and want us to love it too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it is a little rough with the first survivor and the movement can be a bit funny too at times but once you get into the rhythm of things its very very addicting lol",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ðŸ§Ÿâ™‚ï¸ Deadly Days: Roadtrip (Full Release)\n\n50 Stunden im Playtest waren schon wild â€“ und jetzt in der Vollversion bin ich endgÃ¼ltig verloren. Dieses Spiel hat mich mehr eingesogen als jedes Open-World-MMO, und das in Pixeloptik!\n\nðŸŽ’ Das Inventar- und Item-System ist immer noch mein Highlight: Synergien basteln, Upgrades finden und plÃ¶tzlich eine Kombo haben, die alles wegfegt â€“ unbezahlbar.\nðŸŽ¨ Die Grafik hat weiter diesen geilen Nostalgie-Charme, der mich sofort zurÃ¼ck in meine Kindheit kickt (nur dass ich diesmal nicht heimlich zocken muss).\n\nEs gibt kaum was zu meckern. Das Spiel macht einfach sÃ¼chtig.\nWenn man â€žnur mal kurz reinschauenâ€œ will, ist das hier praktisch ein Todesurteil fÃ¼r die To-Do-Liste.\n\nFazit: Ich hab schon im Playtest 50 Stunden versenkt, und die Vollversion hat mich noch mehr am Haken. Wer SpaÃŸ, Loot und chaotische Zombie-Action liebt, MUSS das hier spielen.\n\nStill the best!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "All about the gameplay this one. Roguelite zombie shooter, fun loot mechanic. Little reminiscent of Death road to Canada. You have to really carefully manage backpack space and make intelligent decisions about what to carry, buy or upgrade. has a \"twin stick\" mechanism where you can aim for specific targets, which is unusual but really good fun ( and rather handy). It's tough. I might just suck, but 12 hrs in I'm still to reach the first boss! That said, not frustrating in the least. a potential star of the genre",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Deadly Days: Roadtrip est un excellent jeu. C'est fortement addictif et mÃ©lange backpack battle (pour crÃ©er des synergies) et Vampire Survivors. Il y a systÃ©matiquement une tension entre rester un peu plus sur la map (pour monter de niveau et obtenir de nouveaux objets) et prendre le bus pour passer a la prochaine destination.\n\nJe n'ai pas tout dÃ©bloquÃ© en 10 heures, j'y jouerai plus c'est certain !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The backpack puzzeling aspect makes this game so much more interesting to me than other games in the \"survivor\" genre. Its not just a straight upgrade path, but a balance you need to find on which weapons to use and how to optimse the backpack space you have availabel.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of fun, easy to pick up and play and I'm looking forward to more of the content to be released.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game has 3 major flaws that makes it inferior to the rest of the genre:\n1. The core loop is frustrating and just conflicts with the fantasy:\nYou want to get more loot to get stronger and kill more zombies, but the clock is against you, the game pushes you to finish stages fast (passing on loot) or the enemies will get so strong you can't finish the run.\nSo the game wants you to rush, but that means you get less cool loot, but that's the only way to win the run.\nEven the level up mechanic (summons an air drop that gives you the only ability to get stronger mid-run) encourages you to let the clock tick in order to get something cool.\n\nIn the same time, your ability to actually finish a stage fast is heavily dictated by RNG, you need to travel the whole map to scavange loot bags that *might* have the fuel you need to finish the level and might not, and after that you need to run back to the bus.\n\nThis whole loop just feels unfun.\n\n2. The runs start way too slow where you can only hold 1-2 weapons for a long long time until you get additional weapon slots, It takes a long time until you feel something interesting or powerful is going on, and even that is very limited by the next point:\n\n3. Items are boring, build varieity is pretty much non-existent, all builds are played the same, all weapons feel the same, visually everything is the same.\nunlike other backpack games, you rarely get hard decisions of what to keep and what to throw since most items are just unusable or only synergise with specific stuff.\n\nMaybe they can fix these stuff, but as long as any of these points stay valid, there are other games in the genere that do it much better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Way too RNG based needs better balancing, and better openings to other different builds. You get hardlined into builds too early in runs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AT the current state - total nope!\nIt has promise, a ton of good points and concepts - but atm 10h is what you get at best... Nov 2025.\nAfterwards it's repetitive boring samey grind for nothing... There are cool concepts, builds, ideas, the inventory thing is the highlight tbh, all the rest is lacking unfortunately!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "you ruined the game.so sad cause i loved it looked forward to playing everyday..today i uninstalled. fuck u guys",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no. absurdly grindy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's alright.\n\nCollecting items and puzzling out a build in a cramped backpack is fun to do - and the game is easy enough that you can get away with wackier un-optimized builds. Hypothetically anyway.\n\nUnfortunately there isn't much build variety, and they rarely change the way you engage with the game, so everything feels more-or-less the same. Additional characters and items are added as you progress, but they do far too little to shake things up, and take far too long to unlock. \n\nWhat's here is good, but there's very little here to begin with, and it's all very straightforward and safe. You could wait for more content to be added, but I'd expect pistols with slightly varying rates of fire before anything notable or impressive.  You could have a good time here, sure, but given the stiff competition in it's genre (and price-point) I can't bring myself to recommend it.\n\n---------------------------------------------\nEdit:\n\nHi Leon!\n\nMy review was pretty short and may be conveying the wrong message, so to clarify:\nMy main criticism here is the lack of mechanical variety and player engagement, not the literal amount of updates the team pushed out. \n\nWhile appreciated, I'm not interested in cosmetic updates like the ability to swing on a swing set, splash screens, and popup notifications. Nor am I talking about basic functionality like run persistency, crit chance, or bullet settings. Using your list as an example, I'm interested in talking about the titan block event, the armored enemies, and items like the radar.\n\nThe titan block event is technically variety, in that it's an alternative to the highway blockage event, but I think its addition is overall a detriment to the game. The highway blockage requires the player to sit and protect a specific spot - which is different than their usual activities of constantly running around the map scrounging for loot and kiting enemies. I like this! The Titan block event, however, involves the player kiting enemies ( literally the same enemies they normally fight, just scaled up ) until they die, which is what the player is always doing. I don't like this, because now the Titan block event dilutes the pool for unique gameplay experiences, in favor of making me do more of the same thing I've BEEN doing. Technically, adding the Titan block event created variety in block events, but it REDUCED mechanical variety.\n\nThe same thing can be said of armored enemies that have resistance to damage (especially melee) and prevent piercing. A different enemy type technically adds complexity, sure, but as a player I don't engage armored enemies any differently than I would normal enemies. I can't change my loadout on the fly to accommodate their melee or piercing resistance (all I can do is attack them till they die, same as every other enemy in the game), and they aren't obtrusive enough to warrant me doing so anyway. Technically, adding armored enemies adds variety, but practically they have no impact on my experience or approach to a run - they might as well be cosmetic.\n\nThe radar item is a neat idea - but a random chance to get extra level-up rewards is not something that a player actively chooses, it's something that randomly happens to them. That's not inherently wrong, but (subjectively speaking) in a game about puzzle-solving and active player choice, I'd rather cut out the middleman and make the player actively deliberate over limited options, rather than removing engagement through passive radar procs.\n\nOn paper these updates add variety and complexity to the game (increasing player engagement), but the practical result is the stagnation or regression of both. When I mention adding \"pistols with slightly varying rates of fire\", I do mean that somewhat literally (weapons that are visually/ thematically distinct, but mechanically more of the same), but it's moreso meant to evoke the image of updates that don't push the boundaries of the game or make a large impact, in favor of slightly-modified content that's already here.\n\nI don't want to be overly negative, and I don't think the game is devoid of fun or value - there's cool stuff here! I also think the act of making something is to be lauded and I wish the absolute best for your team! \nBut this is also a product that's being sold for money (early access or no) in a highly competitive market, and you \"just launched into early access yesterday and there is a journey to be made\", so of course there are flaws in the game and critique to be had. I don't know if there's a cultural barrier, but your response here (and in other negative reviews) feels passive aggressive and I don't think reflects on the Pixelsplit team the way you intended.\n\nFor what it's worth, I did play the Demo! It's why I wishlisted the game, followed the updates as they've come out the past few months, purchased the game the day it released, put multiple hours into it, and then tried to communicate my thoughts on the game. That's also why I'm putting in the effort to reply and clarify my stance - I don't want to dissuade the dev team, or have them think I'm being snide. I want it to be clear that I think the game has fun, strong elements - but that the game's current state and the style of updates don't leave me confident enough to recommend it - at least not yet.",
      "voted_up": false,
      "votes_helpful": 74
    },
    {
      "review": "TL:DR Game has potential...But do not waste money on this game. Wait until it goes to massive sale, or they add YEARS worth of content.\r\n\r\nPros:\r\n- The Inventory expansion mechanic is really nice and innovative.\r\n- Combining loot into better loot and rotating everything in order to find the best placement is so much fun\r\n- First few zones are pretty good.\r\n\r\nCon:\r\n- Game only has 1 level that is divided to few zones, beat the boss at the end. Game over. \r\n- There is SO little content right now. It feels like you played through the beginner tutorial level, get some kind of build going, well too bad, game is over already.\r\n- The game is designed to be juuuust long enough that once you beat the one and only boss and realize there is nothing else to do, you have gone barely over that 2 hour window so you cannot refund anymore.\r\n- There are so few characters, i believe 6, where 3 of them you can unlock rather quick, but they are just flat out worse and somehow less interesting than the starting one, which is really bad, since starting characters only \"ability\" is slightly bigger starting inventory bag",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "tediously slow. losing runs just because you can't find enough fuel. will come back to it later.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game has a LOT of potential. I would give this a neutral if i could so i'm forced to make it a negative one because there's stuff to fix here.\r\n\r\nThe balance feels bad, overall winning a standard run is not too difficult if you know what you're doing but you never really get to feel powerful. For a game that takes inspiration in backpack battles/hero there's really not a lot of backpacking to do. In backpack battles you can have as many weapons as you can fit and then improve them with other items but here, due to the hand limitation more often than not you'll simply have to ignore a good chunk of things because you can't simply fit them so they mark your weapon of choice. \r\n\r\nThere is a roboarm item that helps with that but being an S shaped legendary item it's rare and not easy to fit, plus then you will have the issue of finding and fitting stuff to take advantadge of the roboarm BUT, since this will be late into the run chances are low that you'll get to that. \r\n\r\nEndless is a thing, and it doesn't affect your win on a run, but the jump from day 7 (day 8 is the final boss) to day 9 is so massive that even my strongest builds can't make a dent on the hordes and it's simply not fun...which sucks because that's where you would be able to actually exploit the limits of building in the game (and things like the roboarm). This is potentially due to ranged weapons having a reload time that will simply give time for the horde to respawn and group up around you so there is a massive reliance on anything that lets you hit multiple targets (like the drill, which makes bullets go through enemies). I imagine melee builds can be more successful but i haven't tried them yet since i prefer ranged combat in survivors games. It is irrelevant to the case tho, because if an entire archetype feels bad...that's something that should 100% be fixed. \r\n\r\nAnother big issue with the game is optimization. Optimization in survivors games can be tricky, as the massive amount of calculations, enemies, projectiles and items on the floor all take a toll on performance (Soulstone survivors devs had to basically remake the game to offer a better performance) but it is something necessary. Of course in an endless run eventually you'll have a problem but, if a regular AK firing 2 explosive projectiles multiple times per second whilst applying poison (a pretty basic thing is just basically ak+fork+fireworks+snake/rat) is already making the framerate drop insanely...we have a problem.  Specially when the graphics are pixel art(no complains there, the art is fantastic) which is not performance-intensive. \r\n\r\nAnyway, i'm eager to see what the devs cook, the potential of this game is amazing but it clearly needs time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hate to leave a negative review the game does a lot of stuff well , backpack system and crafting are pretty cool but how you progress your account is beyond silly to me , one of the things i like most in games like this is going endless and for some reason the devs thought it was a cool idea to not allow you to gain resources when you go endless to essentially timegate and stretch the playtime. So the moment the runs becomes crazy and fun you gotta reset again if you want to make progress.  Input lag is also rather high , fix those two issues and the game is cool (low amount of content too but ea i guess)",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "pretty boring pretty fast, great idea but its just not clicking",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The fuel mechanic killed any interest I had in this game. Movement feels painfully slow. You have to pause at every loot bag and wait for a bar to fill while hoping to find fuel. The RNG felt awful on some maps.\n\nThe inventory system initially seemed promising, but in practice, everything I found offered only small incremental bonuses (+X%) instead of meaningful or game-changing upgrades. I wasn't willing to put more time in to see how the loot systems might pay off.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Nope, cannot be bothered to grind metaprogression for baseline stats, at like 3% intervals at a time, so 30 hours later I can actually start playing the game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Unfortunately, all this game did was make me want to play Death Road to Canada. The mode here is pretty repetitive, and you can't go inside any buildings. There's really not much here to this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's...okay.  Deadly Days still needs much more time in the oven to bake.  Really feels more like Supply Run The Game: Gasoline Edition.  The day/night cycle is fairly quick with one simple objective - get your bus's odometer to full by looting for gas on every stage.  The darker it gets, the harder the enemies become.  \n\nEverything else is just backpack management while trying to stay alive.  I am a little bummed out you cannot go inside building and can only loot simple areas like dumpsters and cars mostly.  This kind of feels like a budget-y cell phone game in its initial early access.\n\nI'm looking forward to the progress this makes, but as of right now it isn't capturing much attention.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has 3 major flaws that makes it inferior to the rest of the genre:\n1. The core loop is frustrating and just conflicts with the fantasy:\nYou want to get more loot to get stronger and kill more zombies, but the clock is against you, the game pushes you to finish stages fast (passing on loot) or the enemies will get so strong you can't finish the run.\nSo the game wants you to rush, but that means you get less cool loot, but that's the only way to win the run.\nEven the level up mechanic (summons an air drop that gives you the only ability to get stronger mid-run) encourages you to let the clock tick in order to get something cool.\n\nIn the same time, your ability to actually finish a stage fast is heavily dictated by RNG, you need to travel the whole map to scavange loot bags that *might* have the fuel you need to finish the level and might not, and after that you need to run back to the bus.\n\nThis whole loop just feels unfun.\n\n2. The runs start way too slow where you can only hold 1-2 weapons for a long long time until you get additional weapon slots, It takes a long time until you feel something interesting or powerful is going on, and even that is very limited by the next point:\n\n3. Items are boring, build varieity is pretty much non-existent, all builds are played the same, all weapons feel the same, visually everything is the same.\nunlike other backpack games, you rarely get hard decisions of what to keep and what to throw since most items are just unusable or only synergise with specific stuff.\n\nMaybe they can fix these stuff, but as long as any of these points stay valid, there are other games in the genere that do it much better",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too RNG based needs better balancing, and better openings to other different builds. You get hardlined into builds too early in runs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way to may runs lost to crashes and bad save intervals.\n\nwould recommend if if it gets more stable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you ruined the game.so sad cause i loved it looked forward to playing everyday..today i uninstalled. fuck u guys",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "RNG Trash and BS Scaling speed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no. absurdly grindy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's alright.\n\nCollecting items and puzzling out a build in a cramped backpack is fun to do - and the game is easy enough that you can get away with wackier un-optimized builds. Hypothetically anyway.\n\nUnfortunately there isn't much build variety, and they rarely change the way you engage with the game, so everything feels more-or-less the same. Additional characters and items are added as you progress, but they do far too little to shake things up, and take far too long to unlock. \n\nWhat's here is good, but there's very little here to begin with, and it's all very straightforward and safe. You could wait for more content to be added, but I'd expect pistols with slightly varying rates of fire before anything notable or impressive.  You could have a good time here, sure, but given the stiff competition in it's genre (and price-point) I can't bring myself to recommend it.\n\n---------------------------------------------\nEdit:\n\nHi Leon!\n\nMy review was pretty short and may be conveying the wrong message, so to clarify:\nMy main criticism here is the lack of mechanical variety and player engagement, not the literal amount of updates the team pushed out. \n\nWhile appreciated, I'm not interested in cosmetic updates like the ability to swing on a swing set, splash screens, and popup notifications. Nor am I talking about basic functionality like run persistency, crit chance, or bullet settings. Using your list as an example, I'm interested in talking about the titan block event, the armored enemies, and items like the radar.\n\nThe titan block event is technically variety, in that it's an alternative to the highway blockage event, but I think its addition is overall a detriment to the game. The highway blockage requires the player to sit and protect a specific spot - which is different than their usual activities of constantly running around the map scrounging for loot and kiting enemies. I like this! The Titan block event, however, involves the player kiting enemies ( literally the same enemies they normally fight, just scaled up ) until they die, which is what the player is always doing. I don't like this, because now the Titan block event dilutes the pool for unique gameplay experiences, in favor of making me do more of the same thing I've BEEN doing. Technically, adding the Titan block event created variety in block events, but it REDUCED mechanical variety.\n\nThe same thing can be said of armored enemies that have resistance to damage (especially melee) and prevent piercing. A different enemy type technically adds complexity, sure, but as a player I don't engage armored enemies any differently than I would normal enemies. I can't change my loadout on the fly to accommodate their melee or piercing resistance (all I can do is attack them till they die, same as every other enemy in the game), and they aren't obtrusive enough to warrant me doing so anyway. Technically, adding armored enemies adds variety, but practically they have no impact on my experience or approach to a run - they might as well be cosmetic.\n\nThe radar item is a neat idea - but a random chance to get extra level-up rewards is not something that a player actively chooses, it's something that randomly happens to them. That's not inherently wrong, but (subjectively speaking) in a game about puzzle-solving and active player choice, I'd rather cut out the middleman and make the player actively deliberate over limited options, rather than removing engagement through passive radar procs.\n\nOn paper these updates add variety and complexity to the game (increasing player engagement), but the practical result is the stagnation or regression of both. When I mention adding \"pistols with slightly varying rates of fire\", I do mean that somewhat literally (weapons that are visually/ thematically distinct, but mechanically more of the same), but it's moreso meant to evoke the image of updates that don't push the boundaries of the game or make a large impact, in favor of slightly-modified content that's already here.\n\nI don't want to be overly negative, and I don't think the game is devoid of fun or value - there's cool stuff here! I also think the act of making something is to be lauded and I wish the absolute best for your team! \nBut this is also a product that's being sold for money (early access or no) in a highly competitive market, and you \"just launched into early access yesterday and there is a journey to be made\", so of course there are flaws in the game and critique to be had. I don't know if there's a cultural barrier, but your response here (and in other negative reviews) feels passive aggressive and I don't think reflects on the Pixelsplit team the way you intended.\n\nFor what it's worth, I did play the Demo! It's why I wishlisted the game, followed the updates as they've come out the past few months, purchased the game the day it released, put multiple hours into it, and then tried to communicate my thoughts on the game. That's also why I'm putting in the effort to reply and clarify my stance - I don't want to dissuade the dev team, or have them think I'm being snide. I want it to be clear that I think the game has fun, strong elements - but that the game's current state and the style of updates don't leave me confident enough to recommend it - at least not yet.",
      "voted_up": false,
      "votes_helpful": 74
    },
    {
      "review": "TL:DR Game has potential...But do not waste money on this game. Wait until it goes to massive sale, or they add YEARS worth of content.\r\n\r\nPros:\r\n- The Inventory expansion mechanic is really nice and innovative.\r\n- Combining loot into better loot and rotating everything in order to find the best placement is so much fun\r\n- First few zones are pretty good.\r\n\r\nCon:\r\n- Game only has 1 level that is divided to few zones, beat the boss at the end. Game over. \r\n- There is SO little content right now. It feels like you played through the beginner tutorial level, get some kind of build going, well too bad, game is over already.\r\n- The game is designed to be juuuust long enough that once you beat the one and only boss and realize there is nothing else to do, you have gone barely over that 2 hour window so you cannot refund anymore.\r\n- There are so few characters, i believe 6, where 3 of them you can unlock rather quick, but they are just flat out worse and somehow less interesting than the starting one, which is really bad, since starting characters only \"ability\" is slightly bigger starting inventory bag",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "tediously slow. losing runs just because you can't find enough fuel. will come back to it later.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game has a LOT of potential. I would give this a neutral if i could so i'm forced to make it a negative one because there's stuff to fix here.\r\n\r\nThe balance feels bad, overall winning a standard run is not too difficult if you know what you're doing but you never really get to feel powerful. For a game that takes inspiration in backpack battles/hero there's really not a lot of backpacking to do. In backpack battles you can have as many weapons as you can fit and then improve them with other items but here, due to the hand limitation more often than not you'll simply have to ignore a good chunk of things because you can't simply fit them so they mark your weapon of choice. \r\n\r\nThere is a roboarm item that helps with that but being an S shaped legendary item it's rare and not easy to fit, plus then you will have the issue of finding and fitting stuff to take advantadge of the roboarm BUT, since this will be late into the run chances are low that you'll get to that. \r\n\r\nEndless is a thing, and it doesn't affect your win on a run, but the jump from day 7 (day 8 is the final boss) to day 9 is so massive that even my strongest builds can't make a dent on the hordes and it's simply not fun...which sucks because that's where you would be able to actually exploit the limits of building in the game (and things like the roboarm). This is potentially due to ranged weapons having a reload time that will simply give time for the horde to respawn and group up around you so there is a massive reliance on anything that lets you hit multiple targets (like the drill, which makes bullets go through enemies). I imagine melee builds can be more successful but i haven't tried them yet since i prefer ranged combat in survivors games. It is irrelevant to the case tho, because if an entire archetype feels bad...that's something that should 100% be fixed. \r\n\r\nAnother big issue with the game is optimization. Optimization in survivors games can be tricky, as the massive amount of calculations, enemies, projectiles and items on the floor all take a toll on performance (Soulstone survivors devs had to basically remake the game to offer a better performance) but it is something necessary. Of course in an endless run eventually you'll have a problem but, if a regular AK firing 2 explosive projectiles multiple times per second whilst applying poison (a pretty basic thing is just basically ak+fork+fireworks+snake/rat) is already making the framerate drop insanely...we have a problem.  Specially when the graphics are pixel art(no complains there, the art is fantastic) which is not performance-intensive. \r\n\r\nAnyway, i'm eager to see what the devs cook, the potential of this game is amazing but it clearly needs time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hate to leave a negative review the game does a lot of stuff well , backpack system and crafting are pretty cool but how you progress your account is beyond silly to me , one of the things i like most in games like this is going endless and for some reason the devs thought it was a cool idea to not allow you to gain resources when you go endless to essentially timegate and stretch the playtime. So the moment the runs becomes crazy and fun you gotta reset again if you want to make progress.  Input lag is also rather high , fix those two issues and the game is cool (low amount of content too but ea i guess)",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "pretty boring pretty fast, great idea but its just not clicking",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The fuel mechanic killed any interest I had in this game. Movement feels painfully slow. You have to pause at every loot bag and wait for a bar to fill while hoping to find fuel. The RNG felt awful on some maps.\n\nThe inventory system initially seemed promising, but in practice, everything I found offered only small incremental bonuses (+X%) instead of meaningful or game-changing upgrades. I wasn't willing to put more time in to see how the loot systems might pay off.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Nope, cannot be bothered to grind metaprogression for baseline stats, at like 3% intervals at a time, so 30 hours later I can actually start playing the game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Unfortunately, all this game did was make me want to play Death Road to Canada. The mode here is pretty repetitive, and you can't go inside any buildings. There's really not much here to this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's...okay.  Deadly Days still needs much more time in the oven to bake.  Really feels more like Supply Run The Game: Gasoline Edition.  The day/night cycle is fairly quick with one simple objective - get your bus's odometer to full by looting for gas on every stage.  The darker it gets, the harder the enemies become.  \n\nEverything else is just backpack management while trying to stay alive.  I am a little bummed out you cannot go inside building and can only loot simple areas like dumpsters and cars mostly.  This kind of feels like a budget-y cell phone game in its initial early access.\n\nI'm looking forward to the progress this makes, but as of right now it isn't capturing much attention.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has 3 major flaws that makes it inferior to the rest of the genre:\n1. The core loop is frustrating and just conflicts with the fantasy:\nYou want to get more loot to get stronger and kill more zombies, but the clock is against you, the game pushes you to finish stages fast (passing on loot) or the enemies will get so strong you can't finish the run.\nSo the game wants you to rush, but that means you get less cool loot, but that's the only way to win the run.\nEven the level up mechanic (summons an air drop that gives you the only ability to get stronger mid-run) encourages you to let the clock tick in order to get something cool.\n\nIn the same time, your ability to actually finish a stage fast is heavily dictated by RNG, you need to travel the whole map to scavange loot bags that *might* have the fuel you need to finish the level and might not, and after that you need to run back to the bus.\n\nThis whole loop just feels unfun.\n\n2. The runs start way too slow where you can only hold 1-2 weapons for a long long time until you get additional weapon slots, It takes a long time until you feel something interesting or powerful is going on, and even that is very limited by the next point:\n\n3. Items are boring, build varieity is pretty much non-existent, all builds are played the same, all weapons feel the same, visually everything is the same.\nunlike other backpack games, you rarely get hard decisions of what to keep and what to throw since most items are just unusable or only synergise with specific stuff.\n\nMaybe they can fix these stuff, but as long as any of these points stay valid, there are other games in the genere that do it much better",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too RNG based needs better balancing, and better openings to other different builds. You get hardlined into builds too early in runs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way to may runs lost to crashes and bad save intervals.\n\nwould recommend if if it gets more stable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you ruined the game.so sad cause i loved it looked forward to playing everyday..today i uninstalled. fuck u guys",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "RNG Trash and BS Scaling speed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no. absurdly grindy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's alright.\n\nCollecting items and puzzling out a build in a cramped backpack is fun to do - and the game is easy enough that you can get away with wackier un-optimized builds. Hypothetically anyway.\n\nUnfortunately there isn't much build variety, and they rarely change the way you engage with the game, so everything feels more-or-less the same. Additional characters and items are added as you progress, but they do far too little to shake things up, and take far too long to unlock. \n\nWhat's here is good, but there's very little here to begin with, and it's all very straightforward and safe. You could wait for more content to be added, but I'd expect pistols with slightly varying rates of fire before anything notable or impressive.  You could have a good time here, sure, but given the stiff competition in it's genre (and price-point) I can't bring myself to recommend it.\n\n---------------------------------------------\nEdit:\n\nHi Leon!\n\nMy review was pretty short and may be conveying the wrong message, so to clarify:\nMy main criticism here is the lack of mechanical variety and player engagement, not the literal amount of updates the team pushed out. \n\nWhile appreciated, I'm not interested in cosmetic updates like the ability to swing on a swing set, splash screens, and popup notifications. Nor am I talking about basic functionality like run persistency, crit chance, or bullet settings. Using your list as an example, I'm interested in talking about the titan block event, the armored enemies, and items like the radar.\n\nThe titan block event is technically variety, in that it's an alternative to the highway blockage event, but I think its addition is overall a detriment to the game. The highway blockage requires the player to sit and protect a specific spot - which is different than their usual activities of constantly running around the map scrounging for loot and kiting enemies. I like this! The Titan block event, however, involves the player kiting enemies ( literally the same enemies they normally fight, just scaled up ) until they die, which is what the player is always doing. I don't like this, because now the Titan block event dilutes the pool for unique gameplay experiences, in favor of making me do more of the same thing I've BEEN doing. Technically, adding the Titan block event created variety in block events, but it REDUCED mechanical variety.\n\nThe same thing can be said of armored enemies that have resistance to damage (especially melee) and prevent piercing. A different enemy type technically adds complexity, sure, but as a player I don't engage armored enemies any differently than I would normal enemies. I can't change my loadout on the fly to accommodate their melee or piercing resistance (all I can do is attack them till they die, same as every other enemy in the game), and they aren't obtrusive enough to warrant me doing so anyway. Technically, adding armored enemies adds variety, but practically they have no impact on my experience or approach to a run - they might as well be cosmetic.\n\nThe radar item is a neat idea - but a random chance to get extra level-up rewards is not something that a player actively chooses, it's something that randomly happens to them. That's not inherently wrong, but (subjectively speaking) in a game about puzzle-solving and active player choice, I'd rather cut out the middleman and make the player actively deliberate over limited options, rather than removing engagement through passive radar procs.\n\nOn paper these updates add variety and complexity to the game (increasing player engagement), but the practical result is the stagnation or regression of both. When I mention adding \"pistols with slightly varying rates of fire\", I do mean that somewhat literally (weapons that are visually/ thematically distinct, but mechanically more of the same), but it's moreso meant to evoke the image of updates that don't push the boundaries of the game or make a large impact, in favor of slightly-modified content that's already here.\n\nI don't want to be overly negative, and I don't think the game is devoid of fun or value - there's cool stuff here! I also think the act of making something is to be lauded and I wish the absolute best for your team! \nBut this is also a product that's being sold for money (early access or no) in a highly competitive market, and you \"just launched into early access yesterday and there is a journey to be made\", so of course there are flaws in the game and critique to be had. I don't know if there's a cultural barrier, but your response here (and in other negative reviews) feels passive aggressive and I don't think reflects on the Pixelsplit team the way you intended.\n\nFor what it's worth, I did play the Demo! It's why I wishlisted the game, followed the updates as they've come out the past few months, purchased the game the day it released, put multiple hours into it, and then tried to communicate my thoughts on the game. That's also why I'm putting in the effort to reply and clarify my stance - I don't want to dissuade the dev team, or have them think I'm being snide. I want it to be clear that I think the game has fun, strong elements - but that the game's current state and the style of updates don't leave me confident enough to recommend it - at least not yet.",
      "voted_up": false,
      "votes_helpful": 74
    },
    {
      "review": "TL:DR Game has potential...But do not waste money on this game. Wait until it goes to massive sale, or they add YEARS worth of content.\r\n\r\nPros:\r\n- The Inventory expansion mechanic is really nice and innovative.\r\n- Combining loot into better loot and rotating everything in order to find the best placement is so much fun\r\n- First few zones are pretty good.\r\n\r\nCon:\r\n- Game only has 1 level that is divided to few zones, beat the boss at the end. Game over. \r\n- There is SO little content right now. It feels like you played through the beginner tutorial level, get some kind of build going, well too bad, game is over already.\r\n- The game is designed to be juuuust long enough that once you beat the one and only boss and realize there is nothing else to do, you have gone barely over that 2 hour window so you cannot refund anymore.\r\n- There are so few characters, i believe 6, where 3 of them you can unlock rather quick, but they are just flat out worse and somehow less interesting than the starting one, which is really bad, since starting characters only \"ability\" is slightly bigger starting inventory bag",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "tediously slow. losing runs just because you can't find enough fuel. will come back to it later.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game has a LOT of potential. I would give this a neutral if i could so i'm forced to make it a negative one because there's stuff to fix here.\r\n\r\nThe balance feels bad, overall winning a standard run is not too difficult if you know what you're doing but you never really get to feel powerful. For a game that takes inspiration in backpack battles/hero there's really not a lot of backpacking to do. In backpack battles you can have as many weapons as you can fit and then improve them with other items but here, due to the hand limitation more often than not you'll simply have to ignore a good chunk of things because you can't simply fit them so they mark your weapon of choice. \r\n\r\nThere is a roboarm item that helps with that but being an S shaped legendary item it's rare and not easy to fit, plus then you will have the issue of finding and fitting stuff to take advantadge of the roboarm BUT, since this will be late into the run chances are low that you'll get to that. \r\n\r\nEndless is a thing, and it doesn't affect your win on a run, but the jump from day 7 (day 8 is the final boss) to day 9 is so massive that even my strongest builds can't make a dent on the hordes and it's simply not fun...which sucks because that's where you would be able to actually exploit the limits of building in the game (and things like the roboarm). This is potentially due to ranged weapons having a reload time that will simply give time for the horde to respawn and group up around you so there is a massive reliance on anything that lets you hit multiple targets (like the drill, which makes bullets go through enemies). I imagine melee builds can be more successful but i haven't tried them yet since i prefer ranged combat in survivors games. It is irrelevant to the case tho, because if an entire archetype feels bad...that's something that should 100% be fixed. \r\n\r\nAnother big issue with the game is optimization. Optimization in survivors games can be tricky, as the massive amount of calculations, enemies, projectiles and items on the floor all take a toll on performance (Soulstone survivors devs had to basically remake the game to offer a better performance) but it is something necessary. Of course in an endless run eventually you'll have a problem but, if a regular AK firing 2 explosive projectiles multiple times per second whilst applying poison (a pretty basic thing is just basically ak+fork+fireworks+snake/rat) is already making the framerate drop insanely...we have a problem.  Specially when the graphics are pixel art(no complains there, the art is fantastic) which is not performance-intensive. \r\n\r\nAnyway, i'm eager to see what the devs cook, the potential of this game is amazing but it clearly needs time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hate to leave a negative review the game does a lot of stuff well , backpack system and crafting are pretty cool but how you progress your account is beyond silly to me , one of the things i like most in games like this is going endless and for some reason the devs thought it was a cool idea to not allow you to gain resources when you go endless to essentially timegate and stretch the playtime. So the moment the runs becomes crazy and fun you gotta reset again if you want to make progress.  Input lag is also rather high , fix those two issues and the game is cool (low amount of content too but ea i guess)",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "pretty boring pretty fast, great idea but its just not clicking",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The fuel mechanic killed any interest I had in this game. Movement feels painfully slow. You have to pause at every loot bag and wait for a bar to fill while hoping to find fuel. The RNG felt awful on some maps.\n\nThe inventory system initially seemed promising, but in practice, everything I found offered only small incremental bonuses (+X%) instead of meaningful or game-changing upgrades. I wasn't willing to put more time in to see how the loot systems might pay off.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Nope, cannot be bothered to grind metaprogression for baseline stats, at like 3% intervals at a time, so 30 hours later I can actually start playing the game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Unfortunately, all this game did was make me want to play Death Road to Canada. The mode here is pretty repetitive, and you can't go inside any buildings. There's really not much here to this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's...okay.  Deadly Days still needs much more time in the oven to bake.  Really feels more like Supply Run The Game: Gasoline Edition.  The day/night cycle is fairly quick with one simple objective - get your bus's odometer to full by looting for gas on every stage.  The darker it gets, the harder the enemies become.  \n\nEverything else is just backpack management while trying to stay alive.  I am a little bummed out you cannot go inside building and can only loot simple areas like dumpsters and cars mostly.  This kind of feels like a budget-y cell phone game in its initial early access.\n\nI'm looking forward to the progress this makes, but as of right now it isn't capturing much attention.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has 3 major flaws that makes it inferior to the rest of the genre:\n1. The core loop is frustrating and just conflicts with the fantasy:\nYou want to get more loot to get stronger and kill more zombies, but the clock is against you, the game pushes you to finish stages fast (passing on loot) or the enemies will get so strong you can't finish the run.\nSo the game wants you to rush, but that means you get less cool loot, but that's the only way to win the run.\nEven the level up mechanic (summons an air drop that gives you the only ability to get stronger mid-run) encourages you to let the clock tick in order to get something cool.\n\nIn the same time, your ability to actually finish a stage fast is heavily dictated by RNG, you need to travel the whole map to scavange loot bags that *might* have the fuel you need to finish the level and might not, and after that you need to run back to the bus.\n\nThis whole loop just feels unfun.\n\n2. The runs start way too slow where you can only hold 1-2 weapons for a long long time until you get additional weapon slots, It takes a long time until you feel something interesting or powerful is going on, and even that is very limited by the next point:\n\n3. Items are boring, build varieity is pretty much non-existent, all builds are played the same, all weapons feel the same, visually everything is the same.\nunlike other backpack games, you rarely get hard decisions of what to keep and what to throw since most items are just unusable or only synergise with specific stuff.\n\nMaybe they can fix these stuff, but as long as any of these points stay valid, there are other games in the genere that do it much better",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too RNG based needs better balancing, and better openings to other different builds. You get hardlined into builds too early in runs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way to may runs lost to crashes and bad save intervals.\n\nwould recommend if if it gets more stable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you ruined the game.so sad cause i loved it looked forward to playing everyday..today i uninstalled. fuck u guys",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "RNG Trash and BS Scaling speed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no. absurdly grindy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's alright.\n\nCollecting items and puzzling out a build in a cramped backpack is fun to do - and the game is easy enough that you can get away with wackier un-optimized builds. Hypothetically anyway.\n\nUnfortunately there isn't much build variety, and they rarely change the way you engage with the game, so everything feels more-or-less the same. Additional characters and items are added as you progress, but they do far too little to shake things up, and take far too long to unlock. \n\nWhat's here is good, but there's very little here to begin with, and it's all very straightforward and safe. You could wait for more content to be added, but I'd expect pistols with slightly varying rates of fire before anything notable or impressive.  You could have a good time here, sure, but given the stiff competition in it's genre (and price-point) I can't bring myself to recommend it.\n\n---------------------------------------------\nEdit:\n\nHi Leon!\n\nMy review was pretty short and may be conveying the wrong message, so to clarify:\nMy main criticism here is the lack of mechanical variety and player engagement, not the literal amount of updates the team pushed out. \n\nWhile appreciated, I'm not interested in cosmetic updates like the ability to swing on a swing set, splash screens, and popup notifications. Nor am I talking about basic functionality like run persistency, crit chance, or bullet settings. Using your list as an example, I'm interested in talking about the titan block event, the armored enemies, and items like the radar.\n\nThe titan block event is technically variety, in that it's an alternative to the highway blockage event, but I think its addition is overall a detriment to the game. The highway blockage requires the player to sit and protect a specific spot - which is different than their usual activities of constantly running around the map scrounging for loot and kiting enemies. I like this! The Titan block event, however, involves the player kiting enemies ( literally the same enemies they normally fight, just scaled up ) until they die, which is what the player is always doing. I don't like this, because now the Titan block event dilutes the pool for unique gameplay experiences, in favor of making me do more of the same thing I've BEEN doing. Technically, adding the Titan block event created variety in block events, but it REDUCED mechanical variety.\n\nThe same thing can be said of armored enemies that have resistance to damage (especially melee) and prevent piercing. A different enemy type technically adds complexity, sure, but as a player I don't engage armored enemies any differently than I would normal enemies. I can't change my loadout on the fly to accommodate their melee or piercing resistance (all I can do is attack them till they die, same as every other enemy in the game), and they aren't obtrusive enough to warrant me doing so anyway. Technically, adding armored enemies adds variety, but practically they have no impact on my experience or approach to a run - they might as well be cosmetic.\n\nThe radar item is a neat idea - but a random chance to get extra level-up rewards is not something that a player actively chooses, it's something that randomly happens to them. That's not inherently wrong, but (subjectively speaking) in a game about puzzle-solving and active player choice, I'd rather cut out the middleman and make the player actively deliberate over limited options, rather than removing engagement through passive radar procs.\n\nOn paper these updates add variety and complexity to the game (increasing player engagement), but the practical result is the stagnation or regression of both. When I mention adding \"pistols with slightly varying rates of fire\", I do mean that somewhat literally (weapons that are visually/ thematically distinct, but mechanically more of the same), but it's moreso meant to evoke the image of updates that don't push the boundaries of the game or make a large impact, in favor of slightly-modified content that's already here.\n\nI don't want to be overly negative, and I don't think the game is devoid of fun or value - there's cool stuff here! I also think the act of making something is to be lauded and I wish the absolute best for your team! \nBut this is also a product that's being sold for money (early access or no) in a highly competitive market, and you \"just launched into early access yesterday and there is a journey to be made\", so of course there are flaws in the game and critique to be had. I don't know if there's a cultural barrier, but your response here (and in other negative reviews) feels passive aggressive and I don't think reflects on the Pixelsplit team the way you intended.\n\nFor what it's worth, I did play the Demo! It's why I wishlisted the game, followed the updates as they've come out the past few months, purchased the game the day it released, put multiple hours into it, and then tried to communicate my thoughts on the game. That's also why I'm putting in the effort to reply and clarify my stance - I don't want to dissuade the dev team, or have them think I'm being snide. I want it to be clear that I think the game has fun, strong elements - but that the game's current state and the style of updates don't leave me confident enough to recommend it - at least not yet.",
      "voted_up": false,
      "votes_helpful": 74
    },
    {
      "review": "TL:DR Game has potential...But do not waste money on this game. Wait until it goes to massive sale, or they add YEARS worth of content.\r\n\r\nPros:\r\n- The Inventory expansion mechanic is really nice and innovative.\r\n- Combining loot into better loot and rotating everything in order to find the best placement is so much fun\r\n- First few zones are pretty good.\r\n\r\nCon:\r\n- Game only has 1 level that is divided to few zones, beat the boss at the end. Game over. \r\n- There is SO little content right now. It feels like you played through the beginner tutorial level, get some kind of build going, well too bad, game is over already.\r\n- The game is designed to be juuuust long enough that once you beat the one and only boss and realize there is nothing else to do, you have gone barely over that 2 hour window so you cannot refund anymore.\r\n- There are so few characters, i believe 6, where 3 of them you can unlock rather quick, but they are just flat out worse and somehow less interesting than the starting one, which is really bad, since starting characters only \"ability\" is slightly bigger starting inventory bag",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "tediously slow. losing runs just because you can't find enough fuel. will come back to it later.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game has a LOT of potential. I would give this a neutral if i could so i'm forced to make it a negative one because there's stuff to fix here.\r\n\r\nThe balance feels bad, overall winning a standard run is not too difficult if you know what you're doing but you never really get to feel powerful. For a game that takes inspiration in backpack battles/hero there's really not a lot of backpacking to do. In backpack battles you can have as many weapons as you can fit and then improve them with other items but here, due to the hand limitation more often than not you'll simply have to ignore a good chunk of things because you can't simply fit them so they mark your weapon of choice. \r\n\r\nThere is a roboarm item that helps with that but being an S shaped legendary item it's rare and not easy to fit, plus then you will have the issue of finding and fitting stuff to take advantadge of the roboarm BUT, since this will be late into the run chances are low that you'll get to that. \r\n\r\nEndless is a thing, and it doesn't affect your win on a run, but the jump from day 7 (day 8 is the final boss) to day 9 is so massive that even my strongest builds can't make a dent on the hordes and it's simply not fun...which sucks because that's where you would be able to actually exploit the limits of building in the game (and things like the roboarm). This is potentially due to ranged weapons having a reload time that will simply give time for the horde to respawn and group up around you so there is a massive reliance on anything that lets you hit multiple targets (like the drill, which makes bullets go through enemies). I imagine melee builds can be more successful but i haven't tried them yet since i prefer ranged combat in survivors games. It is irrelevant to the case tho, because if an entire archetype feels bad...that's something that should 100% be fixed. \r\n\r\nAnother big issue with the game is optimization. Optimization in survivors games can be tricky, as the massive amount of calculations, enemies, projectiles and items on the floor all take a toll on performance (Soulstone survivors devs had to basically remake the game to offer a better performance) but it is something necessary. Of course in an endless run eventually you'll have a problem but, if a regular AK firing 2 explosive projectiles multiple times per second whilst applying poison (a pretty basic thing is just basically ak+fork+fireworks+snake/rat) is already making the framerate drop insanely...we have a problem.  Specially when the graphics are pixel art(no complains there, the art is fantastic) which is not performance-intensive. \r\n\r\nAnyway, i'm eager to see what the devs cook, the potential of this game is amazing but it clearly needs time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hate to leave a negative review the game does a lot of stuff well , backpack system and crafting are pretty cool but how you progress your account is beyond silly to me , one of the things i like most in games like this is going endless and for some reason the devs thought it was a cool idea to not allow you to gain resources when you go endless to essentially timegate and stretch the playtime. So the moment the runs becomes crazy and fun you gotta reset again if you want to make progress.  Input lag is also rather high , fix those two issues and the game is cool (low amount of content too but ea i guess)",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "pretty boring pretty fast, great idea but its just not clicking",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The fuel mechanic killed any interest I had in this game. Movement feels painfully slow. You have to pause at every loot bag and wait for a bar to fill while hoping to find fuel. The RNG felt awful on some maps.\n\nThe inventory system initially seemed promising, but in practice, everything I found offered only small incremental bonuses (+X%) instead of meaningful or game-changing upgrades. I wasn't willing to put more time in to see how the loot systems might pay off.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Nope, cannot be bothered to grind metaprogression for baseline stats, at like 3% intervals at a time, so 30 hours later I can actually start playing the game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Unfortunately, all this game did was make me want to play Death Road to Canada. The mode here is pretty repetitive, and you can't go inside any buildings. There's really not much here to this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's...okay.  Deadly Days still needs much more time in the oven to bake.  Really feels more like Supply Run The Game: Gasoline Edition.  The day/night cycle is fairly quick with one simple objective - get your bus's odometer to full by looting for gas on every stage.  The darker it gets, the harder the enemies become.  \n\nEverything else is just backpack management while trying to stay alive.  I am a little bummed out you cannot go inside building and can only loot simple areas like dumpsters and cars mostly.  This kind of feels like a budget-y cell phone game in its initial early access.\n\nI'm looking forward to the progress this makes, but as of right now it isn't capturing much attention.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has 3 major flaws that makes it inferior to the rest of the genre:\n1. The core loop is frustrating and just conflicts with the fantasy:\nYou want to get more loot to get stronger and kill more zombies, but the clock is against you, the game pushes you to finish stages fast (passing on loot) or the enemies will get so strong you can't finish the run.\nSo the game wants you to rush, but that means you get less cool loot, but that's the only way to win the run.\nEven the level up mechanic (summons an air drop that gives you the only ability to get stronger mid-run) encourages you to let the clock tick in order to get something cool.\n\nIn the same time, your ability to actually finish a stage fast is heavily dictated by RNG, you need to travel the whole map to scavange loot bags that *might* have the fuel you need to finish the level and might not, and after that you need to run back to the bus.\n\nThis whole loop just feels unfun.\n\n2. The runs start way too slow where you can only hold 1-2 weapons for a long long time until you get additional weapon slots, It takes a long time until you feel something interesting or powerful is going on, and even that is very limited by the next point:\n\n3. Items are boring, build varieity is pretty much non-existent, all builds are played the same, all weapons feel the same, visually everything is the same.\nunlike other backpack games, you rarely get hard decisions of what to keep and what to throw since most items are just unusable or only synergise with specific stuff.\n\nMaybe they can fix these stuff, but as long as any of these points stay valid, there are other games in the genere that do it much better",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too RNG based needs better balancing, and better openings to other different builds. You get hardlined into builds too early in runs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way to may runs lost to crashes and bad save intervals.\n\nwould recommend if if it gets more stable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you ruined the game.so sad cause i loved it looked forward to playing everyday..today i uninstalled. fuck u guys",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "RNG Trash and BS Scaling speed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no. absurdly grindy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's alright.\n\nCollecting items and puzzling out a build in a cramped backpack is fun to do - and the game is easy enough that you can get away with wackier un-optimized builds. Hypothetically anyway.\n\nUnfortunately there isn't much build variety, and they rarely change the way you engage with the game, so everything feels more-or-less the same. Additional characters and items are added as you progress, but they do far too little to shake things up, and take far too long to unlock. \n\nWhat's here is good, but there's very little here to begin with, and it's all very straightforward and safe. You could wait for more content to be added, but I'd expect pistols with slightly varying rates of fire before anything notable or impressive.  You could have a good time here, sure, but given the stiff competition in it's genre (and price-point) I can't bring myself to recommend it.\n\n---------------------------------------------\nEdit:\n\nHi Leon!\n\nMy review was pretty short and may be conveying the wrong message, so to clarify:\nMy main criticism here is the lack of mechanical variety and player engagement, not the literal amount of updates the team pushed out. \n\nWhile appreciated, I'm not interested in cosmetic updates like the ability to swing on a swing set, splash screens, and popup notifications. Nor am I talking about basic functionality like run persistency, crit chance, or bullet settings. Using your list as an example, I'm interested in talking about the titan block event, the armored enemies, and items like the radar.\n\nThe titan block event is technically variety, in that it's an alternative to the highway blockage event, but I think its addition is overall a detriment to the game. The highway blockage requires the player to sit and protect a specific spot - which is different than their usual activities of constantly running around the map scrounging for loot and kiting enemies. I like this! The Titan block event, however, involves the player kiting enemies ( literally the same enemies they normally fight, just scaled up ) until they die, which is what the player is always doing. I don't like this, because now the Titan block event dilutes the pool for unique gameplay experiences, in favor of making me do more of the same thing I've BEEN doing. Technically, adding the Titan block event created variety in block events, but it REDUCED mechanical variety.\n\nThe same thing can be said of armored enemies that have resistance to damage (especially melee) and prevent piercing. A different enemy type technically adds complexity, sure, but as a player I don't engage armored enemies any differently than I would normal enemies. I can't change my loadout on the fly to accommodate their melee or piercing resistance (all I can do is attack them till they die, same as every other enemy in the game), and they aren't obtrusive enough to warrant me doing so anyway. Technically, adding armored enemies adds variety, but practically they have no impact on my experience or approach to a run - they might as well be cosmetic.\n\nThe radar item is a neat idea - but a random chance to get extra level-up rewards is not something that a player actively chooses, it's something that randomly happens to them. That's not inherently wrong, but (subjectively speaking) in a game about puzzle-solving and active player choice, I'd rather cut out the middleman and make the player actively deliberate over limited options, rather than removing engagement through passive radar procs.\n\nOn paper these updates add variety and complexity to the game (increasing player engagement), but the practical result is the stagnation or regression of both. When I mention adding \"pistols with slightly varying rates of fire\", I do mean that somewhat literally (weapons that are visually/ thematically distinct, but mechanically more of the same), but it's moreso meant to evoke the image of updates that don't push the boundaries of the game or make a large impact, in favor of slightly-modified content that's already here.\n\nI don't want to be overly negative, and I don't think the game is devoid of fun or value - there's cool stuff here! I also think the act of making something is to be lauded and I wish the absolute best for your team! \nBut this is also a product that's being sold for money (early access or no) in a highly competitive market, and you \"just launched into early access yesterday and there is a journey to be made\", so of course there are flaws in the game and critique to be had. I don't know if there's a cultural barrier, but your response here (and in other negative reviews) feels passive aggressive and I don't think reflects on the Pixelsplit team the way you intended.\n\nFor what it's worth, I did play the Demo! It's why I wishlisted the game, followed the updates as they've come out the past few months, purchased the game the day it released, put multiple hours into it, and then tried to communicate my thoughts on the game. That's also why I'm putting in the effort to reply and clarify my stance - I don't want to dissuade the dev team, or have them think I'm being snide. I want it to be clear that I think the game has fun, strong elements - but that the game's current state and the style of updates don't leave me confident enough to recommend it - at least not yet.",
      "voted_up": false,
      "votes_helpful": 74
    },
    {
      "review": "TL:DR Game has potential...But do not waste money on this game. Wait until it goes to massive sale, or they add YEARS worth of content.\r\n\r\nPros:\r\n- The Inventory expansion mechanic is really nice and innovative.\r\n- Combining loot into better loot and rotating everything in order to find the best placement is so much fun\r\n- First few zones are pretty good.\r\n\r\nCon:\r\n- Game only has 1 level that is divided to few zones, beat the boss at the end. Game over. \r\n- There is SO little content right now. It feels like you played through the beginner tutorial level, get some kind of build going, well too bad, game is over already.\r\n- The game is designed to be juuuust long enough that once you beat the one and only boss and realize there is nothing else to do, you have gone barely over that 2 hour window so you cannot refund anymore.\r\n- There are so few characters, i believe 6, where 3 of them you can unlock rather quick, but they are just flat out worse and somehow less interesting than the starting one, which is really bad, since starting characters only \"ability\" is slightly bigger starting inventory bag",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "tediously slow. losing runs just because you can't find enough fuel. will come back to it later.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game has a LOT of potential. I would give this a neutral if i could so i'm forced to make it a negative one because there's stuff to fix here.\r\n\r\nThe balance feels bad, overall winning a standard run is not too difficult if you know what you're doing but you never really get to feel powerful. For a game that takes inspiration in backpack battles/hero there's really not a lot of backpacking to do. In backpack battles you can have as many weapons as you can fit and then improve them with other items but here, due to the hand limitation more often than not you'll simply have to ignore a good chunk of things because you can't simply fit them so they mark your weapon of choice. \r\n\r\nThere is a roboarm item that helps with that but being an S shaped legendary item it's rare and not easy to fit, plus then you will have the issue of finding and fitting stuff to take advantadge of the roboarm BUT, since this will be late into the run chances are low that you'll get to that. \r\n\r\nEndless is a thing, and it doesn't affect your win on a run, but the jump from day 7 (day 8 is the final boss) to day 9 is so massive that even my strongest builds can't make a dent on the hordes and it's simply not fun...which sucks because that's where you would be able to actually exploit the limits of building in the game (and things like the roboarm). This is potentially due to ranged weapons having a reload time that will simply give time for the horde to respawn and group up around you so there is a massive reliance on anything that lets you hit multiple targets (like the drill, which makes bullets go through enemies). I imagine melee builds can be more successful but i haven't tried them yet since i prefer ranged combat in survivors games. It is irrelevant to the case tho, because if an entire archetype feels bad...that's something that should 100% be fixed. \r\n\r\nAnother big issue with the game is optimization. Optimization in survivors games can be tricky, as the massive amount of calculations, enemies, projectiles and items on the floor all take a toll on performance (Soulstone survivors devs had to basically remake the game to offer a better performance) but it is something necessary. Of course in an endless run eventually you'll have a problem but, if a regular AK firing 2 explosive projectiles multiple times per second whilst applying poison (a pretty basic thing is just basically ak+fork+fireworks+snake/rat) is already making the framerate drop insanely...we have a problem.  Specially when the graphics are pixel art(no complains there, the art is fantastic) which is not performance-intensive. \r\n\r\nAnyway, i'm eager to see what the devs cook, the potential of this game is amazing but it clearly needs time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hate to leave a negative review the game does a lot of stuff well , backpack system and crafting are pretty cool but how you progress your account is beyond silly to me , one of the things i like most in games like this is going endless and for some reason the devs thought it was a cool idea to not allow you to gain resources when you go endless to essentially timegate and stretch the playtime. So the moment the runs becomes crazy and fun you gotta reset again if you want to make progress.  Input lag is also rather high , fix those two issues and the game is cool (low amount of content too but ea i guess)",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "pretty boring pretty fast, great idea but its just not clicking",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The fuel mechanic killed any interest I had in this game. Movement feels painfully slow. You have to pause at every loot bag and wait for a bar to fill while hoping to find fuel. The RNG felt awful on some maps.\n\nThe inventory system initially seemed promising, but in practice, everything I found offered only small incremental bonuses (+X%) instead of meaningful or game-changing upgrades. I wasn't willing to put more time in to see how the loot systems might pay off.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Nope, cannot be bothered to grind metaprogression for baseline stats, at like 3% intervals at a time, so 30 hours later I can actually start playing the game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Unfortunately, all this game did was make me want to play Death Road to Canada. The mode here is pretty repetitive, and you can't go inside any buildings. There's really not much here to this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's...okay.  Deadly Days still needs much more time in the oven to bake.  Really feels more like Supply Run The Game: Gasoline Edition.  The day/night cycle is fairly quick with one simple objective - get your bus's odometer to full by looting for gas on every stage.  The darker it gets, the harder the enemies become.  \n\nEverything else is just backpack management while trying to stay alive.  I am a little bummed out you cannot go inside building and can only loot simple areas like dumpsters and cars mostly.  This kind of feels like a budget-y cell phone game in its initial early access.\n\nI'm looking forward to the progress this makes, but as of right now it isn't capturing much attention.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has 3 major flaws that makes it inferior to the rest of the genre:\n1. The core loop is frustrating and just conflicts with the fantasy:\nYou want to get more loot to get stronger and kill more zombies, but the clock is against you, the game pushes you to finish stages fast (passing on loot) or the enemies will get so strong you can't finish the run.\nSo the game wants you to rush, but that means you get less cool loot, but that's the only way to win the run.\nEven the level up mechanic (summons an air drop that gives you the only ability to get stronger mid-run) encourages you to let the clock tick in order to get something cool.\n\nIn the same time, your ability to actually finish a stage fast is heavily dictated by RNG, you need to travel the whole map to scavange loot bags that *might* have the fuel you need to finish the level and might not, and after that you need to run back to the bus.\n\nThis whole loop just feels unfun.\n\n2. The runs start way too slow where you can only hold 1-2 weapons for a long long time until you get additional weapon slots, It takes a long time until you feel something interesting or powerful is going on, and even that is very limited by the next point:\n\n3. Items are boring, build varieity is pretty much non-existent, all builds are played the same, all weapons feel the same, visually everything is the same.\nunlike other backpack games, you rarely get hard decisions of what to keep and what to throw since most items are just unusable or only synergise with specific stuff.\n\nMaybe they can fix these stuff, but as long as any of these points stay valid, there are other games in the genere that do it much better",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too RNG based needs better balancing, and better openings to other different builds. You get hardlined into builds too early in runs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way to may runs lost to crashes and bad save intervals.\n\nwould recommend if if it gets more stable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you ruined the game.so sad cause i loved it looked forward to playing everyday..today i uninstalled. fuck u guys",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "RNG Trash and BS Scaling speed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no. absurdly grindy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's alright.\n\nCollecting items and puzzling out a build in a cramped backpack is fun to do - and the game is easy enough that you can get away with wackier un-optimized builds. Hypothetically anyway.\n\nUnfortunately there isn't much build variety, and they rarely change the way you engage with the game, so everything feels more-or-less the same. Additional characters and items are added as you progress, but they do far too little to shake things up, and take far too long to unlock. \n\nWhat's here is good, but there's very little here to begin with, and it's all very straightforward and safe. You could wait for more content to be added, but I'd expect pistols with slightly varying rates of fire before anything notable or impressive.  You could have a good time here, sure, but given the stiff competition in it's genre (and price-point) I can't bring myself to recommend it.\n\n---------------------------------------------\nEdit:\n\nHi Leon!\n\nMy review was pretty short and may be conveying the wrong message, so to clarify:\nMy main criticism here is the lack of mechanical variety and player engagement, not the literal amount of updates the team pushed out. \n\nWhile appreciated, I'm not interested in cosmetic updates like the ability to swing on a swing set, splash screens, and popup notifications. Nor am I talking about basic functionality like run persistency, crit chance, or bullet settings. Using your list as an example, I'm interested in talking about the titan block event, the armored enemies, and items like the radar.\n\nThe titan block event is technically variety, in that it's an alternative to the highway blockage event, but I think its addition is overall a detriment to the game. The highway blockage requires the player to sit and protect a specific spot - which is different than their usual activities of constantly running around the map scrounging for loot and kiting enemies. I like this! The Titan block event, however, involves the player kiting enemies ( literally the same enemies they normally fight, just scaled up ) until they die, which is what the player is always doing. I don't like this, because now the Titan block event dilutes the pool for unique gameplay experiences, in favor of making me do more of the same thing I've BEEN doing. Technically, adding the Titan block event created variety in block events, but it REDUCED mechanical variety.\n\nThe same thing can be said of armored enemies that have resistance to damage (especially melee) and prevent piercing. A different enemy type technically adds complexity, sure, but as a player I don't engage armored enemies any differently than I would normal enemies. I can't change my loadout on the fly to accommodate their melee or piercing resistance (all I can do is attack them till they die, same as every other enemy in the game), and they aren't obtrusive enough to warrant me doing so anyway. Technically, adding armored enemies adds variety, but practically they have no impact on my experience or approach to a run - they might as well be cosmetic.\n\nThe radar item is a neat idea - but a random chance to get extra level-up rewards is not something that a player actively chooses, it's something that randomly happens to them. That's not inherently wrong, but (subjectively speaking) in a game about puzzle-solving and active player choice, I'd rather cut out the middleman and make the player actively deliberate over limited options, rather than removing engagement through passive radar procs.\n\nOn paper these updates add variety and complexity to the game (increasing player engagement), but the practical result is the stagnation or regression of both. When I mention adding \"pistols with slightly varying rates of fire\", I do mean that somewhat literally (weapons that are visually/ thematically distinct, but mechanically more of the same), but it's moreso meant to evoke the image of updates that don't push the boundaries of the game or make a large impact, in favor of slightly-modified content that's already here.\n\nI don't want to be overly negative, and I don't think the game is devoid of fun or value - there's cool stuff here! I also think the act of making something is to be lauded and I wish the absolute best for your team! \nBut this is also a product that's being sold for money (early access or no) in a highly competitive market, and you \"just launched into early access yesterday and there is a journey to be made\", so of course there are flaws in the game and critique to be had. I don't know if there's a cultural barrier, but your response here (and in other negative reviews) feels passive aggressive and I don't think reflects on the Pixelsplit team the way you intended.\n\nFor what it's worth, I did play the Demo! It's why I wishlisted the game, followed the updates as they've come out the past few months, purchased the game the day it released, put multiple hours into it, and then tried to communicate my thoughts on the game. That's also why I'm putting in the effort to reply and clarify my stance - I don't want to dissuade the dev team, or have them think I'm being snide. I want it to be clear that I think the game has fun, strong elements - but that the game's current state and the style of updates don't leave me confident enough to recommend it - at least not yet.",
      "voted_up": false,
      "votes_helpful": 74
    },
    {
      "review": "TL:DR Game has potential...But do not waste money on this game. Wait until it goes to massive sale, or they add YEARS worth of content.\r\n\r\nPros:\r\n- The Inventory expansion mechanic is really nice and innovative.\r\n- Combining loot into better loot and rotating everything in order to find the best placement is so much fun\r\n- First few zones are pretty good.\r\n\r\nCon:\r\n- Game only has 1 level that is divided to few zones, beat the boss at the end. Game over. \r\n- There is SO little content right now. It feels like you played through the beginner tutorial level, get some kind of build going, well too bad, game is over already.\r\n- The game is designed to be juuuust long enough that once you beat the one and only boss and realize there is nothing else to do, you have gone barely over that 2 hour window so you cannot refund anymore.\r\n- There are so few characters, i believe 6, where 3 of them you can unlock rather quick, but they are just flat out worse and somehow less interesting than the starting one, which is really bad, since starting characters only \"ability\" is slightly bigger starting inventory bag",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "tediously slow. losing runs just because you can't find enough fuel. will come back to it later.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game has a LOT of potential. I would give this a neutral if i could so i'm forced to make it a negative one because there's stuff to fix here.\r\n\r\nThe balance feels bad, overall winning a standard run is not too difficult if you know what you're doing but you never really get to feel powerful. For a game that takes inspiration in backpack battles/hero there's really not a lot of backpacking to do. In backpack battles you can have as many weapons as you can fit and then improve them with other items but here, due to the hand limitation more often than not you'll simply have to ignore a good chunk of things because you can't simply fit them so they mark your weapon of choice. \r\n\r\nThere is a roboarm item that helps with that but being an S shaped legendary item it's rare and not easy to fit, plus then you will have the issue of finding and fitting stuff to take advantadge of the roboarm BUT, since this will be late into the run chances are low that you'll get to that. \r\n\r\nEndless is a thing, and it doesn't affect your win on a run, but the jump from day 7 (day 8 is the final boss) to day 9 is so massive that even my strongest builds can't make a dent on the hordes and it's simply not fun...which sucks because that's where you would be able to actually exploit the limits of building in the game (and things like the roboarm). This is potentially due to ranged weapons having a reload time that will simply give time for the horde to respawn and group up around you so there is a massive reliance on anything that lets you hit multiple targets (like the drill, which makes bullets go through enemies). I imagine melee builds can be more successful but i haven't tried them yet since i prefer ranged combat in survivors games. It is irrelevant to the case tho, because if an entire archetype feels bad...that's something that should 100% be fixed. \r\n\r\nAnother big issue with the game is optimization. Optimization in survivors games can be tricky, as the massive amount of calculations, enemies, projectiles and items on the floor all take a toll on performance (Soulstone survivors devs had to basically remake the game to offer a better performance) but it is something necessary. Of course in an endless run eventually you'll have a problem but, if a regular AK firing 2 explosive projectiles multiple times per second whilst applying poison (a pretty basic thing is just basically ak+fork+fireworks+snake/rat) is already making the framerate drop insanely...we have a problem.  Specially when the graphics are pixel art(no complains there, the art is fantastic) which is not performance-intensive. \r\n\r\nAnyway, i'm eager to see what the devs cook, the potential of this game is amazing but it clearly needs time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hate to leave a negative review the game does a lot of stuff well , backpack system and crafting are pretty cool but how you progress your account is beyond silly to me , one of the things i like most in games like this is going endless and for some reason the devs thought it was a cool idea to not allow you to gain resources when you go endless to essentially timegate and stretch the playtime. So the moment the runs becomes crazy and fun you gotta reset again if you want to make progress.  Input lag is also rather high , fix those two issues and the game is cool (low amount of content too but ea i guess)",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "pretty boring pretty fast, great idea but its just not clicking",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The fuel mechanic killed any interest I had in this game. Movement feels painfully slow. You have to pause at every loot bag and wait for a bar to fill while hoping to find fuel. The RNG felt awful on some maps.\n\nThe inventory system initially seemed promising, but in practice, everything I found offered only small incremental bonuses (+X%) instead of meaningful or game-changing upgrades. I wasn't willing to put more time in to see how the loot systems might pay off.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Nope, cannot be bothered to grind metaprogression for baseline stats, at like 3% intervals at a time, so 30 hours later I can actually start playing the game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Unfortunately, all this game did was make me want to play Death Road to Canada. The mode here is pretty repetitive, and you can't go inside any buildings. There's really not much here to this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's...okay.  Deadly Days still needs much more time in the oven to bake.  Really feels more like Supply Run The Game: Gasoline Edition.  The day/night cycle is fairly quick with one simple objective - get your bus's odometer to full by looting for gas on every stage.  The darker it gets, the harder the enemies become.  \n\nEverything else is just backpack management while trying to stay alive.  I am a little bummed out you cannot go inside building and can only loot simple areas like dumpsters and cars mostly.  This kind of feels like a budget-y cell phone game in its initial early access.\n\nI'm looking forward to the progress this makes, but as of right now it isn't capturing much attention.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has 3 major flaws that makes it inferior to the rest of the genre:\n1. The core loop is frustrating and just conflicts with the fantasy:\nYou want to get more loot to get stronger and kill more zombies, but the clock is against you, the game pushes you to finish stages fast (passing on loot) or the enemies will get so strong you can't finish the run.\nSo the game wants you to rush, but that means you get less cool loot, but that's the only way to win the run.\nEven the level up mechanic (summons an air drop that gives you the only ability to get stronger mid-run) encourages you to let the clock tick in order to get something cool.\n\nIn the same time, your ability to actually finish a stage fast is heavily dictated by RNG, you need to travel the whole map to scavange loot bags that *might* have the fuel you need to finish the level and might not, and after that you need to run back to the bus.\n\nThis whole loop just feels unfun.\n\n2. The runs start way too slow where you can only hold 1-2 weapons for a long long time until you get additional weapon slots, It takes a long time until you feel something interesting or powerful is going on, and even that is very limited by the next point:\n\n3. Items are boring, build varieity is pretty much non-existent, all builds are played the same, all weapons feel the same, visually everything is the same.\nunlike other backpack games, you rarely get hard decisions of what to keep and what to throw since most items are just unusable or only synergise with specific stuff.\n\nMaybe they can fix these stuff, but as long as any of these points stay valid, there are other games in the genere that do it much better",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too RNG based needs better balancing, and better openings to other different builds. You get hardlined into builds too early in runs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way to may runs lost to crashes and bad save intervals.\n\nwould recommend if if it gets more stable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you ruined the game.so sad cause i loved it looked forward to playing everyday..today i uninstalled. fuck u guys",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "RNG Trash and BS Scaling speed.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}