{
  "positive": [
    {
      "review": "Bright, blocky, and surprisingly deep, Trove mixes MMO progression with casual adventuring. Collecting gear, exploring biomes, and building your own spaces gives it a playful charm that’s easy to get hooked on.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was coming from Skyblock on Hypixel. Loved the game, hated the community so much I eventually stopped playing. So I was looking for something kind of similar. This does it. This scratches that little itch in my brain for the grind of progression and I love it. Will recommend and be playing for A WHILE.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a fun game. Some areas barely have enemies and then there are areas where there are just to many enemies and you can be ganged up on very easily but all around, it's a fun game. I recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoy playing trove, i have around 700 h in this game but i didnt played on steam, game is chill you can relax have fun play with someone specialy on d15 cuz solo probaby you can do it solo, i came back to game again and the lag on server is fixed now finally you can play without getting mad about world becouse isnt loading propertly, game is kind p2w without patron Daily task like eraning clubits are 3x longer , 3 days vs 1 day so its help a lot, p2w here isnt bad at all preatty fast you can earn stuff without it and you dont need to spend all your money becouse p2w in this game is kind cheap, everything is good untill you hit mid game when grind is insane, farming good gems, Gear, dragons, mr, the worst imo is farming for cosmic primal the eggs are Hard to earn and you need to preatty big amount of time, still Miss Shadow Tower, community are mid depends someone is cool other parson can troll like ships in this game 1 person can ruin everything, lots of people quit becouse of lags what trove use to had and becouse of huge Grind, but the strongest one survive, trove is my childhood game and im glad the game is still here and i can play it after coupe of years, steam problem is isnt all mods uploaded so you dont have half of good mods thats not good, take care guys, I wish you great day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is quite a grind but I feel it has been rewarding.  I played over 850 hours and got several characters progressed to the 30k power mark before I stopped playing for a while.  I'm just getting back into it now.  I have always enjoyed that you can be really creative with your cornerstone and with clan space, and make some really cool things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not sure if i should start from the start or the finish but may this comment find anyone looking on this game in 2025 and years too come the game is good if u have the hours to put in sadly the market is crashed and its full of dupers but if u like an old school voxel mmorpg that even if its p2w u can conquer it f2p.If u have the determination even it being a dead game at this point its worth the feeling of succes im saying this as someone who played the game in its golden ages on its launcher even before gamigo took over and everything went haywire this game needs ur time but its worth it the grind and feeling of defeat after taking down an enemy after 1 minute but coming back to it after a few days and 1 shoting it is always satisfying also its very creative kudos to the great guildmasters and its members with one of the most beautifull hubs made other than that just enjoy it if u like a good old grindy mmorpg that died with time and dont listen to the people with a few hours barely put in a about the game trashtalking it. It had worse days before servers always crashing and so on thankfully they fixed it over the years but the people also went with it.Other than that if u indeed going to try this game out give it a few good hours to sink and i hope u have fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "might worst game to get addicted to, because of how grindy the game is. but still fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game that offers entertainment for hours. Exploring the different worlds and quests keep the game interesting in between farming high tier loot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's super fun it's like minecraft but it has classes and duongeons that you don't have to donwload mods for the game its free and it is cross platform.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I dont know how i got so many hours in the game. I cant remember what it is about. 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was playing this on my Playstation 4 before but now, it's not that enjoyable anymore but still very peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best chilling grind game ever, 100% recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nobody reads my reviews anyway.\nI'll throw in a recipe for Varenyky.\n\nRecipe for Potato Dumplings (Varenyky)\nIngredients:\nFor the dough:\nWheat flour – 500 g\nWater – 200 ml\nEgg – 1\nSalt – 1 tsp\nFor the filling:\nPotatoes – 1 kg\nOnions – 2\nLard or butter – 50 g\nSalt – to taste\nGround black pepper – to taste\nPreparation steps:\nMaking the dough:\nSifting the flour: Sift the flour into a large bowl.\nMaking the dough: Add salt and the egg to the flour. Gradually pour in the water, constantly stirring. Knead the dough until it becomes smooth and elastic.\nResting the dough: Wrap the dough in plastic wrap or cover it with a towel and let it rest for 30 minutes.\nPreparing the filling:\nBoiling the potatoes: Peel the potatoes, cut them into large pieces, and boil until tender in salted water.\nPreparing the onions: While the potatoes are boiling, finely chop the onions. Sauté the onions in lard or butter until golden brown.\nMaking the potato puree: Drain the potatoes and mash them. Add the sautéed onions, salt, and pepper to taste, and mix well.\nForming the dumplings:\nRolling out the dough: Roll out the dough into a thin sheet about 2-3 mm thick. Use a glass or cutter to cut out circles approximately 7-8 cm in diameter.\nForming the dumplings: Place a spoonful of potato filling on each circle of dough. Fold the dough in half and pinch the edges tightly to seal the dumplings.\nCooking the dumplings:\nBoiling water: Bring a large pot of water to a boil, add salt.\nCooking the dumplings: Gently drop the dumplings into the boiling water, stirring carefully to prevent sticking. Cook until done (approximately 5-7 minutes after they float to the surface).\nServing:\nRemoving the dumplings: Remove the dumplings with a slotted spoon and place them on a plate.\nServing: Serve the dumplings hot, optionally drizzling with melted butter, sour cream, or sautéed onions.\nEnjoy your meal!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "beautiful gameplay with a amazing soundtrack",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game that saved my childhood, thank you for existing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IT IS SO FUN AND EASY!! But I hate the microtransactions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game, very addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever no debate required",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS AWESOME!!!! YES GET IT!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "676767...6767. 676767677776666777??? 6767767.41 67767.\r\npeak game pls play its amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "over 9000 dungeons",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's trove.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gouted gamr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "LEUK HOOR",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "normal",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TUFF",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "big house",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "CHILDHOOD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yea",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6.7 hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a good game to turn your brain off to but the sheer amount of grinding you need for certain classes only for boomeranger to be considered better to most is kinda just bad business.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "One of my favorite games. It is best enjoyed in small amounts.   The game is relaxing yet there are opportunities for dungeon exploration as well and combat.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's a fun game. Some areas barely have enemies and then there are areas where there are just to many enemies and you can be ganged up on very easily but all around, it's a fun game. I recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have over 500 hours of this game on my Playstation account. It was a fun, grindy game back in the day. Do I think its still worth playing now? Yes, but you will get bored quickly as soon as you reach around 20k power rank because that's when it becomes almost impossible to get stronger.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was coming from Skyblock on Hypixel. Loved the game, hated the community so much I eventually stopped playing. So I was looking for something kind of similar. This does it. This scratches that little itch in my brain for the grind of progression and I love it. Will recommend and be playing for A WHILE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy playing trove, i have around 700 h in this game but i didnt played on steam, game is chill you can relax have fun play with someone specialy on d15 cuz solo probaby you can do it solo, i came back to game again and the lag on server is fixed now finally you can play without getting mad about world becouse isnt loading propertly, game is kind p2w without patron Daily task like eraning clubits are 3x longer , 3 days vs 1 day so its help a lot, p2w here isnt bad at all preatty fast you can earn stuff without it and you dont need to spend all your money becouse p2w in this game is kind cheap, everything is good untill you hit mid game when grind is insane, farming good gems, Gear, dragons, mr, the worst imo is farming for cosmic primal the eggs are Hard to earn and you need to preatty big amount of time, still Miss Shadow Tower, community are mid depends someone is cool other parson can troll like ships in this game 1 person can ruin everything, lots of people quit becouse of lags what trove use to had and becouse of huge Grind, but the strongest one survive, trove is my childhood game and im glad the game is still here and i can play it after coupe of years, steam problem is isnt all mods uploaded so you dont have half of good mods thats not good, take care guys, I wish you great day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is quite a grind but I feel it has been rewarding.  I played over 850 hours and got several characters progressed to the 30k power mark before I stopped playing for a while.  I'm just getting back into it now.  I have always enjoyed that you can be really creative with your cornerstone and with clan space, and make some really cool things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not sure if i should start from the start or the finish but may this comment find anyone looking on this game in 2025 and years too come the game is good if u have the hours to put in sadly the market is crashed and its full of dupers but if u like an old school voxel mmorpg that even if its p2w u can conquer it f2p.If u have the determination even it being a dead game at this point its worth the feeling of succes im saying this as someone who played the game in its golden ages on its launcher even before gamigo took over and everything went haywire this game needs ur time but its worth it the grind and feeling of defeat after taking down an enemy after 1 minute but coming back to it after a few days and 1 shoting it is always satisfying also its very creative kudos to the great guildmasters and its members with one of the most beautifull hubs made other than that just enjoy it if u like a good old grindy mmorpg that died with time and dont listen to the people with a few hours barely put in a about the game trashtalking it. It had worse days before servers always crashing and so on thankfully they fixed it over the years but the people also went with it.Other than that if u indeed going to try this game out give it a few good hours to sink and i hope u have fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "might worst game to get addicted to, because of how grindy the game is. but still fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game that offers entertainment for hours. Exploring the different worlds and quests keep the game interesting in between farming high tier loot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive been taken by the ungodly force... please, if you have a bad pc that cant run this game very well, then thats a sign that the trove gods are telling you something.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best game i think ever created i would recommend this to anybody and everybody. its also a really unique game which makes it like no other. absolutely amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game, too pay 2 win though... maybe lower the amount of bought things..??? still super good storyline, and i love the different areas and quests!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ive played this game for many years on xbox and ive honestly got to say its one of the best roguelike games to genuinely chill on, if youre into adventuring and collecting loot galore, then this games for you, the aspect of multiple islands that scale with you and adapt to your level  really elevate the gameplay, i really reccomend this game as its very fun and you can really lose yourself in the world of trove for hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, lots of grinding and stuff I dont understand",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly quite fun, got introduced to the game from my PS4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i see the Game Trove at having a great potential here is why:\n\nBig maps\nMany Dungeons to explore\npixelated game \nAlot of enemies\nAlot of items\nMassive Quest game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got into playing a lot of trove in 2018/2019. Its a fun one. The grind is definitely real though. I think I played so much at the time I actually ran out of content to play in the game. Cause touching it a few years later, I have no idea what I did back then and all the new stuff but im just glad to see its still going\n\nTbh. The building aspect is fun as is the combat, dungeon crawlers and dragons.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but lacks updates and progression",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love how it combines creativity, adventure, and exploration all in one. The worlds are colorful and full of surprises — whether you’re building your own base or hunting for rare treasures. The community is friendly, and the gameplay is fun both solo and with friends. I highly recommend it to anyone who enjoys a relaxed, creative, and cheerful experience!\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is really fun to play with someone, especially when grinding together,\nplayed it before on my old account back when i was in high school...\nthough im letting it go, its just not my thing anymore.\n\ngood game, if u like grinding and adventures definitely recommended!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but lacks tutorial, so if you're keen; opt for Youtube tutorials",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an old game that really shouldn't matter, but it's a lot of fun! Great time sink!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Weird, fun, fast paced game. Can appear deceptively simple but I think it hides endless hours of fun and progression.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came back to play this for nostalgia, I ended up leveling up boomeranger for the fun of it and almost max level.\r\nIt's confusing to continue where you left off, but it ends up being easier when you figure out where you're going.\r\n\r\nIt's a simple but complex adventure game [somehow]\r\nand ended up being one of my late childhood games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool adventure game for you and your friends. Explore caves, bosses and dungeons with your friends. Cool skins and cosmetics as well. Recommended for the younger generation",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Minecraft but if was a dedicated MMORPG. I remember playing this a while back in the day. Plenty of things to do with friends, but I became bored of the grind.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing game, sad to see such a little player base, absolutely recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game amazing community 10/10 dungeon crawler/builder 15/10 with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's super fun it's like minecraft but it has classes and duongeons that you don't have to donwload mods for the game its free and it is cross platform.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game i used to play it on PS But it was super buggy there and i moved to pc And its so much better,  \r\nFYI ONLY PLAY THIS GAME IF YOU HAVE EITHER ALOT OF SPARE TIME OR WILLING TO GRIND ALOT AND LOVE REPETATIVE GRINDY GAMES",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I dont know how i got so many hours in the game. I cant remember what it is about. 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "lots of pony and rainbows\r\n\r\nI was given compensation for this comment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grab your friends, hone your blades, and set off for an epic procedurally generated adventure in Trove! Battle the Shadow in realms filled with dungeons and items created by your fellow players. Whether hunting treasure or building realms of your own, it’s never been this good to be square!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was playing this on my Playstation 4 before but now, it's not that enjoyable anymore but still very peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nobody reads my reviews anyway.\nI'll throw in a recipe for Varenyky.\n\nRecipe for Potato Dumplings (Varenyky)\nIngredients:\nFor the dough:\nWheat flour – 500 g\nWater – 200 ml\nEgg – 1\nSalt – 1 tsp\nFor the filling:\nPotatoes – 1 kg\nOnions – 2\nLard or butter – 50 g\nSalt – to taste\nGround black pepper – to taste\nPreparation steps:\nMaking the dough:\nSifting the flour: Sift the flour into a large bowl.\nMaking the dough: Add salt and the egg to the flour. Gradually pour in the water, constantly stirring. Knead the dough until it becomes smooth and elastic.\nResting the dough: Wrap the dough in plastic wrap or cover it with a towel and let it rest for 30 minutes.\nPreparing the filling:\nBoiling the potatoes: Peel the potatoes, cut them into large pieces, and boil until tender in salted water.\nPreparing the onions: While the potatoes are boiling, finely chop the onions. Sauté the onions in lard or butter until golden brown.\nMaking the potato puree: Drain the potatoes and mash them. Add the sautéed onions, salt, and pepper to taste, and mix well.\nForming the dumplings:\nRolling out the dough: Roll out the dough into a thin sheet about 2-3 mm thick. Use a glass or cutter to cut out circles approximately 7-8 cm in diameter.\nForming the dumplings: Place a spoonful of potato filling on each circle of dough. Fold the dough in half and pinch the edges tightly to seal the dumplings.\nCooking the dumplings:\nBoiling water: Bring a large pot of water to a boil, add salt.\nCooking the dumplings: Gently drop the dumplings into the boiling water, stirring carefully to prevent sticking. Cook until done (approximately 5-7 minutes after they float to the surface).\nServing:\nRemoving the dumplings: Remove the dumplings with a slotted spoon and place them on a plate.\nServing: Serve the dumplings hot, optionally drizzling with melted butter, sour cream, or sautéed onions.\nEnjoy your meal!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "beautiful gameplay with a amazing soundtrack",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun, grindy but not as bad as other games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trove is like someone asked, ‘What if Minecraft and an MMO had a baby who really loved loot?’ You hop in, choose a class—anything from ice-melting sages to candy-swinging barbarians—and suddenly you’re riding dragons, looting boxy dungeons, and building a floating castle made of bacon swords and piñatas. It’s creative chaos in a good way. 8/10—would definitively glue eyeballs to the screen again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In the short time I've played this I've-\n\n-Shot flames out my rear end.\n\n-Turned into a dragon.\n\n-Built a space needle to the moon.\n\n-Attended a mushroom coronation.\n\n-Murdered everyone there.\n\n-Rode a Velociraptor.\n\n-Rode a Velociraptor as a dragon.\n\n-Used the dragon baby I stole as a weapon of mass destruction.\n\n-Met up with my friends.\n\n-Raided 10,001 dungeons.\n\n-Massacred the entirety of Texas.\n\n-Killed some pirates.\n\n-Become pirates.\n\n-Got bored and killed pirates again.\n\n-Built a 5-star hotel fortress.\n\n-Stopped an evil overlord from returning from beyond the grave.\n\n-Killed a family of spiders and lizards.\n\n-Ate pie.\n\n-Got drunk.\n\n-Went to heal and died cause my flask was empty from being drunk.\n\n-Came back from the dead.\n\n-Killed those who killed me.\n\n-Teabagged thier corpses.\n\n-Saw a unicorn.\n\n-Tried to burn said unicorn.\n\n-Got &%# kicked by unicorn.\n\n-Taunted best friends for not helping me.\n\n-Profanity.\n\n-Went to the beach.\n\n-Bedazzled my nipples.\n\n-Fished.\n\n-Rage quit and lit fish on fire.\n\n-Entered Tron.\n\n-Killed Cuthulu.\n\n-Destroyed aimbot.\n\n-leveled up & got phat l3wts.\n\n-Argue over who has better gear.\n\n-Raid some more stuff.\n\n-Danced.\n\n-Danced as a dragon doing Gangnam style while my friends mudered a robot with weapons crafted from it's babies.\n\n\n10/10 Would dragon dance while killing babies again.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "the game that saved my childhood, thank you for existing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there should be a skin for the knight, where he's wearing pj's and/or a scrooge-esque nightcap and robe, called \"night knight\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have never actually played this game i don't know why i have 400 hours i think it's malware but if it is malware it's probably fun malware",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really enjoy this game its realy awsome how much costumization there is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like open world games then its really fun. So much characters to chose from and you can always switch them if you don't like it later on. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game so peak that a block of brown costs the sun, meanwhile ganda costing 10k flux",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Graphics : 6/10 \r\nIt is cartoon like voxels , you either like it or you don't\r\n\r\nGameplay : 9/10 \r\nA solid combination of base building and character development with many character classes and game play styles possible.\r\n\r\nCommunity : 9/10 \r\nThe larger clubs are pretty good , but this is an online game so there are some exception to this and some toxic people .",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun and good community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good. grand. fun. colorful. i ride a cupcake.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game dawg its batter than all other grinding games tbh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IT IS SO FUN AND EASY!! But I hate the microtransactions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In the short time I've played this I've-\n\n-Shot flames out my rear end.\n\n-Turned into a dragon.\n\n-Built a space needle to the moon.\n\n-Attended a mushroom coronation.\n\n-Murdered everyone there.\n\n-Rode a Velociraptor.\n\n-Rode a Velociraptor as a dragon.\n\n-Used the dragon baby I stole as a weapon of mass destruction.\n\n-Met up with my friends.\n\n-Raided 10,001 dungeons.\n\n-Massacred the entirety of Texas.\n\n-Killed some pirates.\n\n-Become pirates.\n\n-Got bored and killed pirates again.\n\n-Built a 5-star hotel fortress.\n\n-Stopped an evil overlord from returning from beyond the grave.\n\n-Killed a family of spiders and lizards.\n\n-Ate pie.\n\n-Got drunk.\n\n-Went to heal and died cause my flask was empty from being drunk.\n\n-Came back from the dead.\n\n-Killed those who killed me.\n\n-Teabagged thier corpses.\n\n-Saw a unicorn.\n\n-Tried to burn said unicorn.\n\n-Got &%# kicked by unicorn.\n\n-Taunted best friends for not helping me.\n\n-Profanity.\n\n-Went to the beach.\n\n-Bedazzled my nipples.\n\n-Fished.\n\n-Rage quit and lit fish on fire.\n\n-Entered Tron.\n\n-Killed Cuthulu.\n\n-Destroyed aimbot.\n\n-leveled up & got phat l3wts.\n\n-Argue over who has better gear.\n\n-Raid some more stuff.\n\n-Danced.\n\n-Danced as a dragon doing Gangnam style while my friends mudered a robot with weapons crafted from it's babies.\n\n\n10/10 Would dragon dance while killing babies again.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "amazing game, very addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Insane AFK farming game. Unemployment guaranteed!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Get bigger stat = big adrenaline dopamine explosion boom",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Originally being a PS4 player since the games earlier days I thought I'd give it try on PC, that was a mistake.\n\nThe game has become incredibly grindy to the point of absolute and complete boredom, every step from crafting classes, items or furniture has become insanely bloated with meaningless resources and extra steps. \n\nThe game supposedly has a botting problem, but it's the other way around, it has a gameplay problem. Grinding for that next piece of gear, mount, pet or cosmetic is fun when done in moderation, this whole game's identity has become the grind.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I spent 20 minutes \"in game\" and another 30 trying to get this piece of ass game to load. first you HAVE to make an account, not with trove, not with gamigo, but with \"glyph\" some other random ass 3rd party loader, which refused to acknowledge I had even made \"error logging in try again later\" so I reset password, it asks me to log in with the new password, it sends me a passcode, I enter the code, it tells me to log in, I log in, it sends me ANOTHER code.. from the same login location.. \"looks like you're logging in from a new place\" no. no I am not. eventually my account is \"live\". open game, seems fine BOOM the game is in some absurd resolution where i can see 1/10th of the corner of the opening screen, do some googling \"you need to install blah blah blah\" \"if youre using nvidia do this\" \"amd super resolution must be turned off for this ONE SPECIFIC GAME\" i gave up, uninstalled and requested to delete my account. AVOID ANY GAMIGO GAME LIKE THE PLAGUE HOLY SH*T",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Another game destroyed by corporate greed. It isnt as good as it used to be...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Don't bother playing. The game is insanely time gated and its full of cheaters that fcked up the marketplace. Its just not worth your time and money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the game is designed for you to spend a lot of money but the game has so many performance issues that still havent been fixed after years and i mean years so dont waste your time or money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i kept playing hoping it would get better but it never did, game is all grind and ads for their bright shiny new cosmetics which dont even do anything",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The current devs ignore the community despite claiming to answer questions from the \"community.\" Also the game's economy has been destroyed by dupers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game supports some of the most vile and racist players out there. Do not give money to Gamigo until they do something about the racism.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Poorly optimised game that if it actually loads correctly crashes... For me when the game starts (and that is not from clicking play from steam, nope you must have some launcher to separate it) it does not make it a central view, i.e. the game is almost tabbed out... Then the second issue is if it did launch, when I open it I'm stuck with a blue or white screen varying, I noticed that I can move zoom in and rotate the camera, not sure where the focus is the game is launched... Then when the game is playing I get random screen tearing and see glitches, almost like it is running something in the background hmm... I lowered the graphics even though my pc could handle it, but it was maxing my gpu at 99%, I still had this issue. Then the game will just crash and ask to send an error report and you start the loading up process again.\r\n\r\nNow onto the actual gameplay... It doesn't feel that bad... I do like running around clearing dungeons get loot and repeat... However the tutorial is shockingly bad, literally doesn't fully explain anything, doesn't point you in any direction, doesn't explain skills or well anything it seems. I may be a bit crazy, maybe I accidently skipped some text, but it is all shoved in the top right corner anyway, with very little direction. I do like that you can just go and do whatever you want really. But when you start to feel weak, which happens fast, you end up grinding the same dungeons for the same loot. Occasionally you may get better  loot but not always. Then there is the systems upon systems of systems of crafting tables... Just spend 10 minutes in the hub and there is like 100 crafting tables to do something, I can't tell you what the game doesn't do a good job of explaining it at all...\r\n\r\nAll in all I like the little loop of find dungeon, kill, loot and repeat. But it doesn't feel rewarding at all, I would keep playing but when it almost feels like the game is saying STOP! By crashing or saying I have enough power rank for a new area only to die instantly to an enemy, well I say ok I will stop, thank you very much goodbye.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is literally torture. After all my hours i started new accounts about 4 times, it takes u like 4-5 days to get to 30k-35k PR and then the progress STOPS it feels like the devs dont play their own game, all events are repeated and the classes dont change much. If a class does come out they only way u can try it is by buying it because they make new classes expencive as fuck for some reason",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would not recommend this game. The launcher it uses Glyph, kept flagging as malware so I had to delete the files and you can't play trove without it. I do like this game on console versions like Xbox and Playstation.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Trove\" feels like a bunch of loose blocks glued together. The game world loads slowly, the frame rate drops, sword swings miss, enemies appear unexpectedly, missions frequently interrupt, movement feels sluggish, the UI fights the player, performance drops during simple actions, and the screen becomes noisy.\n\nRepetition encourages endless grinding, rewards feel empty, classes feel vague, crafting becomes a chore, and the server frequently disconnects.\n\nThe first hour is enjoyable, but boredom sets in quickly. The world feels weightless, but combat feels underpowered, and progress stutters.\n\nFor a quick bit of fun, sure. For long sessions, skip this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game used to be good, then gamigo bought it. If you know who gamigo is and what their business model is, then that should be all you need to know.\n\nI used to love this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First played this 10 years ago, I remember it being a cool sandbox fighting game with Minecraft like graphics. \nLoaded it up today, joined some random world and the first quest doesn't even work. Not able to interact or do anything. I don't have time to look up \"What to do\" tutorials for a 10 year old game that looks like it's supposed to be able to be easily played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A former shell of itself, player counts are nowhere near to what they were, a lot of p2w. Gamigo has done so much damage to this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You have no idea how badly I want to like this game.\nI absolutely loved the game up until I got to level 25, I think. Shadow gems (or whatever the purple ones are called) specifically ruined it for me. The game was paced greatly, quests sprinkling in extra EXP and items for you. Once those quests are done, you're on your own. \nI thought I'd be fine being on my own, being the knight class, but turns out the knight class is actually a support class, not an offense class. I couldn't begin to even approach a reasonable outlook as to why anybody thought that the knight class should not be a primary attacker. THE primary attacker.\nI'd recommend the first 25~ish hours of this game to anyone, it's a fantastic game for about... that long. As soon as you get to shadow gems, act like that's the end of the game, and your experience will be much better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "98 hours and I need to start from the beginning I will not waist my time again and I even had spent money on this RIP that I guess",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is in a constant state of wasting its own potential",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It was interesting in 2015-16\nNow it's dead garbage",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is just bad no other words",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WTF is this abstract pixelated minecraft - like game? I hated it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ruined their game. Not fun anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My acc just got lost :))) after playing it for 80h ... thanks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The saddest thing in life is wasted talent",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am an israeli game dev and this is my game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "L game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Is alr",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whether you are planning on returning to this game after a break or are looking to get into a quite uniquely-styled voxel game, DON'T play this game in 2025. It has no semblence of what it used to be anymore and there are no redeeming qualities left.\n\nWhat it has devolved into over the years is a disgustingly monetized snoozefest that is CHOCK FULL with hackers that have absolutely RUINED the games economy over time and are on top of the leaderboards with the most unachievable stats you could imagine. Everyone knows it, no one does a thing. Look up videos about it if you don't believe me.\nYou will never catch up unless you are prepared to spend literally thousands of dollars on upgrading your gems and mastery points - I am not joking or exaggerating here.\n\nI do sincerely miss the good old Trove I fell in love with years ago but this is now the epitome of pay-to-win, arguably even pay-to-reasonably-progress, and there is a probably just an underpaid skeleton crew left who either can't keep up or don't care about the game enough to make any meaningful changes to its many flawed systems.\n\nI've come back over the years to check on it and can confidently say there is no passion left in this game nor will there ever be again.\nIt purely exists to milk the player for as much money as they possibly can by making every single system as frustrating and grindy as possible.\n\nI'll probably try to reach 42,5k Power Rank for the most recent highest difficulty just so I can say I REALLY gave it a fair shot and see nothing truly has changed...and then dip again for another 2 years.\n\nStay the fuck away from this game for your own good. If you want to grind and not get scammed by a greedy publisher and deal with hackers play Warframe instead.",
      "voted_up": false,
      "votes_helpful": 67
    },
    {
      "review": "If you have tons of money, this game is for you!\nUnrewarding grind with little to no effect.\nHorrible event structuring, so that only those in late game can compete and those in end game can actually win.\n\nFind a different MMO, I promise this one is not the best choice.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "super hard to get into today if you didnt start like 7-8 years ago and late game is so tidious",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "This game is a lot of fun. i played it when i was a kid and i just got back into it like 3 weeks ago. The reason i dont suggest this game and the reason im quitting is after 3 weekly resets im getting absolutly nothing to grow my class and get stronger. and with the way the rng is in this game that could go on for months so there is really no reason to continue on where im at. like i said its a great game its just not worth it unless youve been playing for years.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Originally being a PS4 player since the games earlier days I thought I'd give it try on PC, that was a mistake.\n\nThe game has become incredibly grindy to the point of absolute and complete boredom, every step from crafting classes, items or furniture has become insanely bloated with meaningless resources and extra steps. \n\nThe game supposedly has a botting problem, but it's the other way around, it has a gameplay problem. Grinding for that next piece of gear, mount, pet or cosmetic is fun when done in moderation, this whole game's identity has become the grind.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I spent 20 minutes \"in game\" and another 30 trying to get this piece of ass game to load. first you HAVE to make an account, not with trove, not with gamigo, but with \"glyph\" some other random ass 3rd party loader, which refused to acknowledge I had even made \"error logging in try again later\" so I reset password, it asks me to log in with the new password, it sends me a passcode, I enter the code, it tells me to log in, I log in, it sends me ANOTHER code.. from the same login location.. \"looks like you're logging in from a new place\" no. no I am not. eventually my account is \"live\". open game, seems fine BOOM the game is in some absurd resolution where i can see 1/10th of the corner of the opening screen, do some googling \"you need to install blah blah blah\" \"if youre using nvidia do this\" \"amd super resolution must be turned off for this ONE SPECIFIC GAME\" i gave up, uninstalled and requested to delete my account. AVOID ANY GAMIGO GAME LIKE THE PLAGUE HOLY SH*T",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "So apparently they delete peoples characters now, Decided to jump back on after god knows how long & bang no more character!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Another game destroyed by corporate greed. It isnt as good as it used to be...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Wow this game fell off hard. It was really fun on release: gameplay was rewarding, progression was linear, rarity was balanced. Then they felt the need to add more content. It was too much too fast that no person could keep up with. The only option, conveniently for them, was to buy the now purchasable progression. It is now a terrible game. The world has everything, yet feels empty. \"Higher difficulty\" just means more health and dmg, not more complex fights. Terrible game design, terrible devs, pay to win. Garbage game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game is designed for you to spend a lot of money but the game has so many performance issues that still havent been fixed after years and i mean years so dont waste your time or money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "although this game is amazing it requires a lot of prior knowledge and each update feels like its getting less and less advisable to new players. new tutorial is supposed to teach you how to play but it feels like it teaches you how to waste more time if anything. If you have prior MMO RPG knowledge however its a great game...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "use to love this game sm but hate it so badly with the updates and changes theyre bringing bring back prime 2021 trove",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shite game dont play if your autisic it will only get worse. would recommend if you want your pockets ran through.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i kept playing hoping it would get better but it never did, game is all grind and ads for their bright shiny new cosmetics which dont even do anything",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The current devs ignore the community despite claiming to answer questions from the \"community.\" Also the game's economy has been destroyed by dupers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Killed my pc\nI have such hatred for this game I will literally sacrifice the devs to Satan and pound their corpses until my balls are the size of atoms and more purple than thanos.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "lowkey i played this game last in 2016 when i was a child and i thought it was cubeworld\n\ntried to install it again and it just installed a third party launcher and told me to sign in\n\nfuck that lmao",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "An interesting little game that basically boils down to pixelated WOW. I can see this being a very addictive game, fun if your into Minecraft but want it to be more RPG oriented. Never really got far enough to experience many of the more complicated systems of the game but from what I played it was at least a little enjoyable. However, the game has also now largely become pay to win, and is rampant with hackers that the developers don't care about dealing with.\n\nRating: 5/10 - Voxel RPG very similar to WOW, could be seen as addictive, rampant with pay to win systems and hackers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is literally torture. After all my hours i started new accounts about 4 times, it takes u like 4-5 days to get to 30k-35k PR and then the progress STOPS it feels like the devs dont play their own game, all events are repeated and the classes dont change much. If a class does come out they only way u can try it is by buying it because they make new classes expencive as fuck for some reason",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would not recommend this game. The launcher it uses Glyph, kept flagging as malware so I had to delete the files and you can't play trove without it. I do like this game on console versions like Xbox and Playstation.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Trove\" feels like a bunch of loose blocks glued together. The game world loads slowly, the frame rate drops, sword swings miss, enemies appear unexpectedly, missions frequently interrupt, movement feels sluggish, the UI fights the player, performance drops during simple actions, and the screen becomes noisy.\n\nRepetition encourages endless grinding, rewards feel empty, classes feel vague, crafting becomes a chore, and the server frequently disconnects.\n\nThe first hour is enjoyable, but boredom sets in quickly. The world feels weightless, but combat feels underpowered, and progress stutters.\n\nFor a quick bit of fun, sure. For long sessions, skip this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game used to be good, then gamigo bought it. If you know who gamigo is and what their business model is, then that should be all you need to know.\n\nI used to love this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would still be playing this game if it didn't crash 20-30 seconds after launching. It used to crash every hour or so, which I was okay with. Now it's completely unplayable. I can't really recommend this to anyone until they fix this fundamental issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely boring and repetitive. No wonder its free.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the whole glyph process with the account recovery and the needing a seperate website to even play the game is fucking bullshit make sure you write down all your passwords because remember password doesn't do jackshit or fuckall.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No tutorial!  Spent 5-10 minutes walking around, not understanding the point of this game, and bounced.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only played the game for my friend and to be honest its not something I'd play. game is not horrible its just not something I can get into. At least the game is free I'll give them that",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gone to the dogs all to together after it was sold, it was pay to win before but this just takes the cake now...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[quote=Trove players] This place is a message… and part of a system of messages… pay attention to it!\n\nSending this message was important to us. We considered ourselves to be a powerful culture.\n\nThis place is not a place of honor… no highly esteemed deed is commemorated here… nothing valued is here.\n\nWhat is here was dangerous and repulsive to us. This message is a warning about danger.\n\nThe danger is in a particular location… it increases toward a center… the center of danger is here… of a particular size and shape, and below us.\n\nThe danger is still present, in your time, as it was in ours.\n\nThe danger is to the body, and it can kill.\n\nThe form of the danger is an evaporation of money.\n\nThe danger is unleashed only if you devote time to playing this game. This game is best left shunned and uninhabited. [/quote]\n\n…\n\nReferences equating the game to a poisonous nuclear waste dump aside, Trove’s life was a tragic one. \n\nTrove was born much like its older siblings: full of potential. It had a unique concept, beautiful designs, and entertaining mechanics. It was capable of many things. \n\nUnfortunately, like its older siblings, Trove was born to two corrupt parents: Trion and Worlds. On the outside, they appeared to be ordinary people, but the Incorporated family was anything but. \n\nYou see, Trion and Worlds were corrupted by the world in which they inhabited. They were obsessed with greed and money, and Trove was the new baby of the family. \n\nTrove’s experience was not unfamiliar to its older siblings. First, Trove would be fed adequately and had proper attention to ensure it would grow big and strong. The siblings, weak and frail, had no power to avert it other than warning Trove to not fall for it. Alas, Trove continued. \n\nTrion and Worlds kept giving Trove all the resources it needed: a playerbase, constant updates, and meaningful time. What’s not to love? Maybe Trion and Worlds finally saw that they needed to care for their children in order for them to actually be successful. \n\nThen, to the surprise of not one of those siblings, the Incorporated parents once again repeated the same pattern: once they thought Trove was grown enough, they paraded it around, slapped stickers and price tags on it, and ignored Trove’s complains of illness and discomfort in order to save money. \n\nIn truth, Trion and Worlds had given Trove the resources it needed to be grown enough, but they had once again planned on wringing as much money out of it as they can. Unfortunately, they also went forward with this plan too soon — Trove was not fully grown to stand on its own, and did not have a sufficient number of players or content to keep them satisfied enough to stay despite shortcomings. The Incorporated parents had overmonetized Trove too early.\n\nThis continued for a couple years with Trove slowly starting to become emaciated but glowing with makeup. It was at this time that I, foolishly, became swindled by Trove and spent a lot of time and a bit of money, impressed by Trove’s beauty and satisfied with the gameplay, its content, even its grind. I was oblivious to what was going on under the surface. \n\nBut eventually, I tired of the phase and moved on to other prospects. Shortly after, it was here that a large, scary individual by the name of Gamigo approached the Incorporated parents and said, “I can give Trove better resources and restore it to its former glory. You will have your dream of lavishness and debauchery, for the price of relinquishing ownership of your once-beloved and profitable child.”\n\nTrion and Worlds accepted, and gave the birth certificate to Gamigo so that the god of capitalism could oversee the adoption, sending Trove and all its siblings to the care of Gamigo. \n\nFour days later, after praying to the god of capitalism, Gamigo lured Trion and Worlds into the rear shipment area and executed both of them with a single gunshot in the head. They were never seen again. Gamigo had full control of Trove and the rest of the Incorporated family. \n\nGamigo took full advantage of its new money printers, and took pity on Trove. It looked down and said, “you are unwell and sick. Let me guide you to greatness. Take my hand and follow me to the cafeteria, where my employees shall surely provide you with new content and purpose.” Trove had no choice but to accept. \n\nThe food Trove was forced to eat was the stuff of nightmares. It was, quite literally, a single substance that not only could be redressed to look different on the surface, but it was also a special substance that supplanted some of the unique features that Trion and Worlds both saw on their personal child. This nutritional substance was called Delves, delivered and eaten as Geode, which altered Trove’s appearance and gameplay to be less unique and more trend-chasey, but it remained the same level of uncanny valley that many previous admirers, like myself, became disgusted by. \n\nNow, Trove’d identity and substance has been supplanted by the slop that Gamigo bestowed upon it. It is no less distasteful and shameful to witness to those who know of Trove’s story, but it is now almost completely devoid of any reference to its parents of Trion and  Worlds Incorporated aside from the most rudimentary mechanics and visual design. Some things, like Shadow Towers, are perhaps left behind by Gamigo — the slop engineered to avoid this particular foreign body — as a semblance of pity upon Trove’s now-dead parents; a symbol of mercy by Gamigo to show that it is not completely enslaved to the god of capitalism because it allowed Trove the privilege of keeping a memento of its past life, despite Trove itself having been grown and developed to have no agency in its life and only born to be the vessel in which its “caregivers” — if they can even be considered giving “care” — channel money through as tribute to the god of capitalism. \n\nI leave you with this: Trove’s beauty belies a beguiling succubus underneath whose only thoughts are to keep you addicted and to pay tribute. Trove, like its siblings, was born as a means to an end: to serve the greed of Trion and Worlds Incorporated, but it now serves the greed of Gamigo alone. Unfortunately, I am only a fellow human born to likewise be a cog in the machine, and I sometimes find myself unable to deafen my ears to its siren song. You and I must, nonetheless, resist all temptation, without error!\n\nI say once again:\n\n[quote=Trove players] .. This place is not a place of honor… no highly esteemed deed is commemorated here… nothing valued is here.\n\n.. \n\nThe danger is unleashed only if you devote time to playing this game. [b] This game is best left shunned and uninhabited. [/b] [/quote]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I tried coming back to this game after a few years break.\n\nI couldn't figure out what the hell was going on.\n\nI stopped trying after a straight week.\n\nIn its current state, the game is NOT newbie-friendly in the slightest.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A former shell of itself, player counts are nowhere near to what they were, a lot of p2w. Gamigo has done so much damage to this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First played this 10 years ago, I remember it being a cool sandbox fighting game with Minecraft like graphics. \nLoaded it up today, joined some random world and the first quest doesn't even work. Not able to interact or do anything. I don't have time to look up \"What to do\" tutorials for a 10 year old game that looks like it's supposed to be able to be easily played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You have no idea how badly I want to like this game.\nI absolutely loved the game up until I got to level 25, I think. Shadow gems (or whatever the purple ones are called) specifically ruined it for me. The game was paced greatly, quests sprinkling in extra EXP and items for you. Once those quests are done, you're on your own. \nI thought I'd be fine being on my own, being the knight class, but turns out the knight class is actually a support class, not an offense class. I couldn't begin to even approach a reasonable outlook as to why anybody thought that the knight class should not be a primary attacker. THE primary attacker.\nI'd recommend the first 25~ish hours of this game to anyone, it's a fantastic game for about... that long. As soon as you get to shadow gems, act like that's the end of the game, and your experience will be much better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Decided to return to the game after a couple of years. When trying to log in, I get an error, incorrect username or password. Fine, I reset the password, but then I get the same error again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Infelizmente esse jogo esta morto, depois de muito tempo tentei voltar pra reviver os bons momentos do passado, e mesmo depois de vários anos as únicas coisas novas no jogo são mais itens pra comprar e gastar dinheiro, o jogo esta cheio de hackers que ocupam todas as colocações mais altas dos rankings.\r\n\r\nE a equipe responsável não faz nada a respeito porque certamente estão ocupados criando mais itens pra vender na loja, já que isso é a unica coisa que parece importar pra eles.\r\n\r\nEm resumo não perca teu tempo com esse jogo, tudo demora um eternidade pra ser feito e isso é proposital, pra tentar te forçar a gastar dinheiro pra conseguir as coisas mais rápidos.\r\nEsse jogo é uma definição perfeita da expressão PAY-TO-WIN.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Needs a seperate account apart from Steam, which is annoying on it's own, but it also straight up doesn't work and if I try to get help, I am met with a site that wants to steal my data and track it, written in Spanish, a language I dont even speak... sketchy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Long time player before it ever came to steam, in the past I would of said yes play it, its lots of fun with a bit of hic-ups here and there but mostly good with a very active community,\r\n\r\nBut now, barely anyone around. its just turned to trash with lots of problems, over the years of playing I have stopped and returned multiple times for updates and a bit of fun,  there were more lag issues as the years went on,  but now its basically unplayable, being disconnected multiple times within  just 20 minutes,    rebounding from lag so much that you cant even fight anything and you are taking damage that doesn't even register to you until your almost dead \r\n\r\ngame mechanics and systems that don't make sense or just seem petty,  I use to like flipping money on the market place, buying and selling,  but now you get a charge on what you make,  where does this charge even go, whats its purpose,  seems unnecessary,  \r\n\r\ngot on today to have some nostalgic fun and grind some of the new stuff, but with the lag and rebounding ontop of disconnecting,  its not even worth the nostalgia",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Trash, after 187 hours of Trove been randomly logged out of my account. email for authentication never comes through i cba anymore. get it together or im not coming back to Trove",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overgrindy, micro-transaction filled garbage only worth playing if you have no money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "98 hours and I need to start from the beginning I will not waist my time again and I even had spent money on this RIP that I guess",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is unavailable to russian players.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is in a constant state of wasting its own potential",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "My family left me after i said i gotta finish the dungeons during my wedding.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was interesting in 2015-16\nNow it's dead garbage",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is just bad no other words",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WTF is this abstract pixelated minecraft - like game? I hated it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ruined their game. Not fun anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My acc just got lost :))) after playing it for 80h ... thanks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "He beat me with sticks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game fucking sucks now",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am an israeli game dev and this is my game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "L game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Is alr",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whether you are planning on returning to this game after a break or are looking to get into a quite uniquely-styled voxel game, DON'T play this game in 2025. It has no semblence of what it used to be anymore and there are no redeeming qualities left.\n\nWhat it has devolved into over the years is a disgustingly monetized snoozefest that is CHOCK FULL with hackers that have absolutely RUINED the games economy over time and are on top of the leaderboards with the most unachievable stats you could imagine. Everyone knows it, no one does a thing. Look up videos about it if you don't believe me.\nYou will never catch up unless you are prepared to spend literally thousands of dollars on upgrading your gems and mastery points - I am not joking or exaggerating here.\n\nI do sincerely miss the good old Trove I fell in love with years ago but this is now the epitome of pay-to-win, arguably even pay-to-reasonably-progress, and there is a probably just an underpaid skeleton crew left who either can't keep up or don't care about the game enough to make any meaningful changes to its many flawed systems.\n\nI've come back over the years to check on it and can confidently say there is no passion left in this game nor will there ever be again.\nIt purely exists to milk the player for as much money as they possibly can by making every single system as frustrating and grindy as possible.\n\nI'll probably try to reach 42,5k Power Rank for the most recent highest difficulty just so I can say I REALLY gave it a fair shot and see nothing truly has changed...and then dip again for another 2 years.\n\nStay the fuck away from this game for your own good. If you want to grind and not get scammed by a greedy publisher and deal with hackers play Warframe instead.",
      "voted_up": false,
      "votes_helpful": 67
    },
    {
      "review": "super hard to get into today if you didnt start like 7-8 years ago and late game is so tidious",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Originally being a PS4 player since the games earlier days I thought I'd give it try on PC, that was a mistake.\n\nThe game has become incredibly grindy to the point of absolute and complete boredom, every step from crafting classes, items or furniture has become insanely bloated with meaningless resources and extra steps. \n\nThe game supposedly has a botting problem, but it's the other way around, it has a gameplay problem. Grinding for that next piece of gear, mount, pet or cosmetic is fun when done in moderation, this whole game's identity has become the grind.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "I spent 20 minutes \"in game\" and another 30 trying to get this piece of ass game to load. first you HAVE to make an account, not with trove, not with gamigo, but with \"glyph\" some other random ass 3rd party loader, which refused to acknowledge I had even made \"error logging in try again later\" so I reset password, it asks me to log in with the new password, it sends me a passcode, I enter the code, it tells me to log in, I log in, it sends me ANOTHER code.. from the same login location.. \"looks like you're logging in from a new place\" no. no I am not. eventually my account is \"live\". open game, seems fine BOOM the game is in some absurd resolution where i can see 1/10th of the corner of the opening screen, do some googling \"you need to install blah blah blah\" \"if youre using nvidia do this\" \"amd super resolution must be turned off for this ONE SPECIFIC GAME\" i gave up, uninstalled and requested to delete my account. AVOID ANY GAMIGO GAME LIKE THE PLAGUE HOLY SH*T",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "So apparently they delete peoples characters now, Decided to jump back on after god knows how long & bang no more character!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Don't bother playing. The game is insanely time gated and its full of cheaters that fcked up the marketplace. Its just not worth your time and money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Another game destroyed by corporate greed. It isnt as good as it used to be...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Wow this game fell off hard. It was really fun on release: gameplay was rewarding, progression was linear, rarity was balanced. Then they felt the need to add more content. It was too much too fast that no person could keep up with. The only option, conveniently for them, was to buy the now purchasable progression. It is now a terrible game. The world has everything, yet feels empty. \"Higher difficulty\" just means more health and dmg, not more complex fights. Terrible game design, terrible devs, pay to win. Garbage game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game supports some of the most vile and racist players out there. Do not give money to Gamigo until they do something about the racism.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the game is designed for you to spend a lot of money but the game has so many performance issues that still havent been fixed after years and i mean years so dont waste your time or money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "although this game is amazing it requires a lot of prior knowledge and each update feels like its getting less and less advisable to new players. new tutorial is supposed to teach you how to play but it feels like it teaches you how to waste more time if anything. If you have prior MMO RPG knowledge however its a great game...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "use to love this game sm but hate it so badly with the updates and changes theyre bringing bring back prime 2021 trove",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shite game dont play if your autisic it will only get worse. would recommend if you want your pockets ran through.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i kept playing hoping it would get better but it never did, game is all grind and ads for their bright shiny new cosmetics which dont even do anything",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The current devs ignore the community despite claiming to answer questions from the \"community.\" Also the game's economy has been destroyed by dupers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Killed my pc\nI have such hatred for this game I will literally sacrifice the devs to Satan and pound their corpses until my balls are the size of atoms and more purple than thanos.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}