{
  "positive": [
    {
      "review": "This game is basically just Call of Duty if Call of Duty was a completely different game entirely",
      "voted_up": true,
      "votes_helpful": 105
    },
    {
      "review": "I would rather sand my balls on a belt grinder then play this game ever again.\n\n\n10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 66
    },
    {
      "review": "I also have 1200 hours on Playstation. With that being said, this game is meth. horrible for your health. but for some odd reason I can't stop clicking that big green play button. You want a digitized version of running your balls down a jumping cactus? here it is. this game brings me more pain than my ex wife leaving me and taking the kids. \r\n\r\nFXCK YOU, UBISOFT. 10/10 AM GUNNA KEEP PLAYING THIS DOGSHXT A$$ GAME",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "Hey, my name is Tamer, and I just want to say that this game is not fun, I don't recommend spending your sweet time on it and Damager, give me those points. Bye.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "cant see nothing but beauty in this game, former ubisoft nailed it, i mean its just like love & hate kinda relationship\nSolid 8.5",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "very fun, knight chapter in story mode is the best one",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Hella fun game.  Cool combat, awesome executions.  Takes some skill for sure.  If you have any iota of rage in your body then be prepared to let it loose.  Maybe invest in a second controller, have a pillow to scream in next to you, buy a punching bag....etc...  This game will test your sanity.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "for the first 400 hours you will get fcked but then after 500 more hours you alright but hate the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is like being in an abusive relationship with a manipulative Italian woman, it keeps you fed but beats you mentally and physically within an inch of your life, you keep going back because you think that's the love you deserve, but it's just coping. I have more hours on console than Steam, I could've avoided buying this game again, however, I chose to, why? I don't know, I hate For Honor, It's the best. I'm addicted to the small bursts of serotonin I get when I do good, knowing I'll inevitably be broken down again the very next second like the fragile glass that this game turns my will into. Also whoever came up with Virtuosa on the Ubisoft team should be locked up in a maximum security prison with the other sick freaks.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i play with my friend, first 5 game there is no honor, for the next 5 games there is no honor too, but for the enemies",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this steam hour count is a lie, i ACTUALLY (begrudgingly) have 1400 hours in this game. i wouldn't be here were it not for account merging with other platforms, that's a nice change.\n\nall in all a pretty frustrating game with a sad budget and personality crisis nowadays, but weirdly addicting if you ignore all the universal emote/execution slop and silly effects to get into customising your characters. just don't forget that - even if presented differently - at the end of the day this IS a fighting game and it comes down to reads, not reactions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "after 500 hours with 200 reps+ i can say this game isn't horrible but it can be super frustrating A lot of the times, but i say with more experience and learning from mistakes, getting better is possible but its a harsh HARSH road too getting better in this game but The Most Satisfying thing to get good at, i do recommend the game but do note its a HARD game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Currently the best state this game has ever been in. I wish it had been like this from the very beginning, not nine years later...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played the game for over 500 hours on my Ubi Account before connecting to steam but I still love it. As with every fighting game it is difficult for beginners to start years after the game launched due to the seasoned veterans but there are various gamemodes that are incredibly fun and that let you contribute even if you are still trying to learn new heroes. \r\nAmazing fighting-UI, amazing models, amazing artstyle and hit detection. I'm still in love with this singular fighting system and I can only hope there will be further games developed like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For Honor – A Unique, Skill-Driven Battlefield Experience\n\n★★★★☆ (4/5)\n\nFor Honor delivers one of the most distinct melee combat systems in gaming. The Art of Battle system feels deep, weighty, and incredibly satisfying once you get the hang of it. Every duel becomes a mind game—reading your opponent, feinting, parrying, and landing that perfect counter hit. When everything clicks, it feels amazing.\n\nThe roster of heroes is diverse and full of personality, each offering a unique playstyle that keeps matches fresh. Whether you prefer the elegance of the Nobushi, the raw power of the Raider, or the precision of the Orochi, there’s always someone fun to master.\n\nThe biggest drawback is Ubisoft’s tendency toward aggressive monetization and the grind tied to unlocking cosmetics. It doesn’t ruin the core gameplay, but it does add a layer of frustration that shouldn’t be there in a game that already shines through its mechanics.\n\nStill, at its heart, For Honor is a thrilling, competitive experience with a combat system unlike anything else on the market. If you enjoy skill-based PvP, tense duels, and medieval chaos, it’s absolutely worth jumping into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun and fleshed out game that's fairly easy to pick up and can pull you in like a black hole. Gameplay can range from very fun to incredibly frustrating (don't play this game if you tend to rage easily) and it can become very challenging to actually enjoy the game without cursing someone's entire bloodline. I heavily recommend playing this game with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game, it like your toxic ex gf, you keep co...... nvm just try it and learn to parry and faint =)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft Please add a skin for the Highlander \"Guts\" from the anime Berserk to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game it self is not that bad, bu the mp is torture because of a bug that is in the game now for over 7 years. It can randomly jsut happen that you get kicked from a match for no reason, some people never have this issue some have it every match. Its frustrating. campaign is pretty good tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you have a life to throw away? Did you already throw away your life to this game on another console? WELL LOOK NO FUTHER, this game will consume you and now with the addition of Cross-Progression, you can throw away your life for a second time! Don't miss out now, you might just miss it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never Ever EVER Play this game you willl genuienly want to die the people who play this game are evil incarnate",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, takes time to learn the mechanics, but it's worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of my  favorite games of all time, been playing since the beta so I've seen the good and bad of the game. The combat is one of the best and unique parts that make this game stand out so much. its easy yet rewording to fight other players but some hero's definitely out shine others. I'm glad that it still gets new updates and hopefully it continues, hoping for a new game but ubisoft today would for sure mess it up. I don't know if i would recommend it to a new player without any friends to play with because in the beginner stage everyone is just spamming light attacks so i can  see newer people getting frustrated. I wish we still had honor like when the game first came out but in dom prepare to get 1v3 or 4th with no hesitation. But I will always love this game and so glad they added cross progression into it, I never thought they ever would.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Games been trash since the Core Combat Update, but I'll always love it and it has a choke hold on me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Already played a few hundred hours on ubisoft connect but bought it again on steam cause connect sucks, but its one of the most fun (albeit toxic) fighting games there are due to its extremely unique combat system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "-bro its just fun \r\n-the skins are fire\r\n-the finishers are fire\r\n-the gameplay is fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So okay,\r\n\r\nThis is a very harsh maybe on a person to person basis. Even if you love this game, the community itself will make you hate it. Even despite that, the very basic tandem between combat and strategy absolutely sticks here. \r\n\r\nWhile it will not show to everyone instantly, there is a flow to the combat itself. Every fighter is good if you know them well enough, but some fighters are absolutely more built towards a certain type of playstyle (such as Warmonger/wolfmom being specifically built to just dogwalk any breach match with a certain feat selection, or Nobushi being more viable as a defensive trapper rather than a straight up bruiser, as she has no damaging unblockable attacks at all, only her kick is actually an \"unblockable\" but if you hidden stance or dodge correctly, any attack you do is technically unblockable if that makes sense)\r\n\r\nEven within that, there is a very defined skill curve in pvp play. If someone finds they can use a cheap tactic against you, most absolutely will steamroll you using it over and over and delight in your frustration. However, this is a very *methodical* game, as how I said earlier if you dodge correctly. That being said, a player who knows everything about every fighter will bait you into using certain tactics (such as feinting a heavy attack to make you throw one to parry back or even worse, dodge attack when it can't be feinted as only certain fighters can fakeout their dodge attacks). This pairs to the defined flow of combat, a heavy attack being parried will throw them off balance long enough to get a single light attack in (or for certain fighters that can double light attack on startup, that); however, exactly in pair with that, a light attack being parried will throw the fighter off balance long enough for you to throw nearly ANY attack in the game for free, only very specific attacks will be too long to get the hit in for free, but you'll be able to tell which those will be usually. To add to it, deflects are different on certain fighters, and blocking will have a \"superior\" quality to certain actions or fighters, like Conquerer (the Mace Flail Shield user) being able to dodge into an attack if timed right and make any attack short of an unblockable one and make that fighter's attack rebound rather than just be blocked normally, providing an opening to widen options, or how some fighters have start up light attacks that act as crushing counters if used against standard attacks right as theyd be hit, so on and so forth.\r\n\r\nMore than that, comes the revenge system, which most players completely disregard (or worse still intentionally abuse to hurt their own team if they dislike someone they're fighting on the same side of), where the fighter will shout into the air and throw anyone attacking them onto the ground. At this point, any attack they do will have higher damage compared to normal and any time they grab and throw you, you are guaranteed to go to the ground unless someone interrupts your body falling or being thrown. In this a count system begins whenever a second/third etc enemy hits them. Once their emblem beside their health bar is shining, they're probably going to get fed revenge if they get attacked due to a tag system in place. A player hitting will put a tag on the person being hit, a single tag is fine. Once a second player hits the defending player within 5 seconds (I believe) a second tag is placed and the timer is reset. Any attack at this point will feed revenge, and revenge is fed differently for different actions. Specifically as in a grab/guardbreak can actually feed revenge at different rates depending on what is happening in the fight. If the defending player with revenge feed is able to dodge effectively they get a high decimal percentage (like 0. something) to revenge per that attack, whichever it may be. It gets abit complicated, and some have done some research into it far more than I have, but over time I've been able to just see it myself in effect and it can singlehandedly turn a battle onto its side and throw a 1v2/3 where the defending player is low on health into a slaughter of surprise where the defending player is the only one left emote spamming over everyone, and yes this can absolutely happen in 1v4 and whatever other combination of 4v4 finding each other on the field and choosing to fight. Veteran players will note this aspect keenly in game and know when to properly affect a fight without causing an issue, such as just feinting attacks to scare the defending fighter into acting and mis-stepping. Trap plays will take the most part of what you will see. A 2v1 can go sour for the 2 if a single ladder is involved.\r\n\r\nWithin that, you'd just need to know the specific attack patterns and unique quirks to each fighter (like how Black Prior/BP can duck and counter an entire squad of fighters at once and get a free heavy in on every one of them). A very good way to understand the light overall of each fighter is to just go into the training menu and practice in there, I myself go in there for a bit when a new fighter drops to test it out and see what they're capable of by throwing myself as them against a mirror lvl 3 bot in the arena. Pretty quickly you'll see what you can do with them.\r\n\r\nThere is more to it, i.e. the feat system that is further explained in the game, but as I mentioned with Warmonger, pretty much every fighter has unique feats to themselves that are triggered by how much score you earn in the match, which the revenge mechanic also is tied to, as dishonorable combat (2v1, etc) will earn the attackers less points than they wouldve had otherwise, and the defending player more points than otherwise.\r\n\r\nBeyond that, it gets a tiny bit hairy but mostly its just timing variation in when attacks are thrown, like if you just barely take a bit longer to throw an attack in a chain while still being able to trigger the animation of that chain attack, and feint strategy, and map specific knowledge (like pitfalls that you can be thrown into or ballista that will take a very noticeable chunk out of your health in certain maps).\r\n\r\nThis is an acquired taste, not everyone will like this, but for those who can stick through the rage and disappointment, there is a very defined basis here that you can build and learn upon. Mistakes will not only be your own, but you can learn to avoid those mistakes entirely if you note how a match should usually go in higher tiers of fighters. There is a weird matchmaking here, that will try to pair you with similar skill levels, but it is still not a human judging the skill, its going off of stat basis and round counters rather than....how you fight, if that makes any sense?\r\n\r\nI do recommend this to someone looking for an actual combat game that you CAN find success in, but only through actual sweat and anxiety because this shi has levels man.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun no bugs and has great animations, executions, and is kinda funny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "always loved this game since release on ps4, best mechanics and definitely what combat fighting games need",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Very infuriating but great game! New characters have been peak!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This a great melee sword fighting game, easy recommandation",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is very enjoyable, but the gameplay can feel repetitive. Once you understand your character, it essentially becomes a button-mashing experience.\n\nBut over all its been fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE BEST! Highly recommended! But only remember to drink water and eat food because you gonna be lost for hours in this game..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game taught why some people don't leave toxic relationships",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game i so hard to  get used to due to it's unique style of gamplay but the comunity is terrible. I think you have to play with othr friends to have fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only play this game if your on life support, because it will kill all of your happiness.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played For Honor since the beta on Xbox. I've seen the worst this game and community could be. This imo this the BEST fighting game there is. its perfect Art of Battle system is truly vast and will take ages to learn but its so worth it. 10/10 im straight dummin my glass when I play this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, like a easier Tekken game with a innovative pvp controls.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "to the people complaining about X annoying hero, Y bad moveset, 90% of that is a skill issue.\r\n\r\nmost of the game is incredibly well balanced considering how jank the game actually is, there are a few outliers that are fairly overtuned, but with how great this game's SBMM is 90% of the time, you won't end up in the rape corner the way most reviewers would have you believe.\r\n\r\nthis game is one of the best i have every played, it has many, MANY rough edges, but it's still a great experience if you have the time, effort, and mental capacity for patience to learn the game and commit yourself to it.\r\n\r\noh, and if you rage at games EVER ? just don't bother, something will get broken.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the game you play when you feel too good in your life and you have decided to fuck this all and kill yourself mentally",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plays Viking, Screams a lot and Dies to a light attack. Perfect game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games ever, with the most rewardingly complex mechanics and combat. Fun (even more so with friends) medieval-themed title, with lots of customization options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has problems but it's a good time overall. I really like the customisation in this game even though more recent heroes have little to work with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, but frustrating. Challenging multiplayer which requires practise to master. Limited, but fun customisation. The story mode is engaging with interesting characters. Overall, I recommend this game if you enjoy games with challenging gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is like meth, you dabble in it to start. Get addicted, play for hours. Take a break for 6 months, get the itch. Then you come back and find the new characters are around like it's fent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I still remember the day when for honor was released and we were so hyped while watching the trailers. i do  admit it wasn't exactly like the trailers. though it didn't stop us from enjoying the master-craft of a game it is. absolutely recommend this game to anyone who wishes to experience the medieval wars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just lost every game today, tried to stay up until I won, it's two hours past when I planned on going to sleep. I have work tomorrow. Going to go stare at my shotgun for a few minutes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HIT THEM WITH THE SWORD REALLY HARD OR DODGE THEM !!!!!!!  This is the best advice everrrrr for this game. It really makes me smile when the dead guy from the other team is on my screen ;) I hope you find this game fun because it has taken me through the ringer and i gotta say, this is not for the faint of hearts. I struggled like a fish on land trying to understand how to get gud. If I can do it all the chubs can!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you want to relax and play for fun go offline cuz going against real players ur eather gonna fight a new player or one of the most lifeless creature known to mankind but overall would def recomand",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is decent, but some characters need to get deleted. (Virtuosa)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hate. This game is the biggest piece of dogshit I have ever played. It sucks so much. The servers. The players. The characters. Everyone lightspams in this game and it’s not a skill issue because the servers are so shit that it takes half a year to detect that I have decided to block nobushis 56 light attack. Everything about this game sucks. Ubisoft also sucks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay, solid graphics for a 2007 game, equally skilled player matches are basically CINEMA.\nThere are several problems that marr a great game, and they can be fixed but it seems Ubisoft could not care less for it.\n►Put the game as a F2P, significantly lower the entry price or make every weekend a free weekend. (Ubisoft has milked this game for 9 years and counting and player base is still stuck at 1.5k-4k on Steam. Give it a rest already.)\n►Add a toggle that is CLIENT SIDED ONLY which turns off or severely limits Emote spamming. Its not much but it will help with toxicity.\n►Add a Split-Screen 1v1 game mode for offline play with friends.\n►Remove Casual 1v1 playlist and keep Ranked BETA to consolidate player pools.\n►When this game eventually shutsdown, Ubisoft better leave an SDK or Dedicated Server assets so we can still play it or we are going to have a Déjà Crew.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is very fun! I like it a lot!\r\nWhile the character design may not be as interesting, or over the top as other fighting gamres. I think it kind of adds to the charm. :3\r\nFurthermore, by my estimate, nintey percent of the customisation is earnable in-game. Which is truly impressive for a live service game in the modern age.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pros:\r\n- you learn\r\n  1. how to ragequit faster\r\n  2. new insults and swear words\r\n- fun\r\n- both good controller and m&k controls\r\n- addictive (why is this in pros?!)\r\n- great combat system\r\n- big variety in heroes (some of which are easy mode)\r\n- the game is about fashion, not fighting\r\n- (it has great fashion when you play the characters more)\r\n- there are sigma characters (e.g. Warden)\r\n- (at the point of writing this)  crossplay, but only in main modes\r\n- co-op campaign (no crossplay)\r\n- voice chat\r\n- funni semi-spammable quickchat system (e.g. \"Wow!\" or \"Good fight!\")\r\n\r\ncons:\r\n- you learn\r\n  1. how to ragequit faster\r\n  2. new insults and swear words\r\n- less fun sometimes\r\n- addictive (be careful)\r\n- multiple heroes to carry less skilled (/more casual) gamers for way too far in the game\r\n- can be very time-heavy, especially for completionists (at the point of writing this, the max rep for any \r\n  char is 90, reaching lvl 10 on just one hero took me about 50 hours)\r\n- voice chat\r\n- toxic semi-spammable quickchat system for toxic players \r\n\r\nThanks Ubisoft, I hate it (but I also love it)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the game I cant really complain I ve had it for like a year and I still like it the story arcade and the dominon Evything is perfect and I love the charcters and everything 10 out of 10 recommend n my opion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so fun and definitely doesn't make me want to end it all. Every time I get on I'm greeted by the smartest people in the game, constantly ganking me, emote spamming, and quick-chat spamming. It NEVER gets old. Play this game forever, and ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so bad but it addictive and I can't quit, i have it on all platforms now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun there's always something to get better at. There's players who are either better or worse than you so you can always improve and get better on which ever character to want to master.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is very fun. I'm not gonna go into details, but I consider it fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun. Skill based game play is easy to understand but hard to master.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I actually totally despise this game and everything it stands for. But MAN is it fun. Even though my blood BOILS when I am having fun, I am having ALOT of fun. I have in total THOUSANDS of hours on xbox and PC, mainly xbox, but this game sucks in so many good ways.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "horrible waste of water game, i dont know why anyone would play this over League of Legends. \ncommunity is dead and it clearly doesn't meet the criteria for being a good ubisoft game.\n\nbesides that nobushi is quite a baddie, 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The hate on this game is unjustified.\n\nIt had a rough launch but now it’s on the best the game can be. \nTry it when it is on sale. Give it a chance because it’s worth your time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's like playing league of legends, if you want to punish yourself you play the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1v1 gameplay feels great and pretty much always have. High level game play involves a lot of mind tricks, pattern predicting, etc. The team game mode is less polished and more chaotic. Fun in spurts but the game really shines in duels. That being said, some characters are significantly easier to play well than others. That does feel bad sometimes. However, there is almost always a way to beat any character in the game if you are simply better than the player you are facing.  \n\nIf you are looking for a 1v1 dueling game where the duels are mechanically demanding but mentally intensive (at a higher level) yet much more accessible than a game like tekken, this game might be for you. If you are expecting well done team game elements, this game is probably not for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's taken my life and I hate it but I CAN'T STOP. 8/10 addiction obliterate Varangian guard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a PVA player it has been a relaxing and fun experience. the grinding is mostly fair it could be worse. i did play some PVP as well and it has some issues that could be potentially frustrating. duels and brawls offer the best PVP experience in my opinion. have not played story so i cant give an opinion. overall if you love melee combat i can easily recommend the PVA in this game but if your looking for a competitive game this could work but thats where most of my problems have been at. good game to play with friends too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun a little hard to get into at the beginning but blasting Dear Maria while swinging a great axe into a japanese general is top 8.3 experiences",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Somehow manages to be a very fun game with unique combat mechanics whilst also being the most effective rage game I have ever had the displeasure of playing. 10/10 would get 4vs1'd again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the story mode and combat a lot. However, I don't really think a game that costs money should have a battle pass, but I do like the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For Honor™ is a melee action game developed by Ubisoft that combines fighting-game precision with third-person action. It places players in brutal duels and large-scale battles between Knights, Vikings, and Samurai, each faction offering distinct combat styles and philosophies.\n\nThe core mechanic, the Art of Battle system, defines the game’s identity. It’s a directional combat system that requires reading opponents, managing stamina, and timing attacks, parries, and guards. Every engagement feels personal and skill-based—small mistakes are punished, and mastery takes time.\n\nEach hero has a unique move set, abilities, and weapon type. The roster includes fast assassins, balanced vanguards, defensive heavies, and support hybrids. Learning matchups and adapting to opponent patterns gives the game a deep tactical layer, comparable to a fighting game more than a traditional brawler.\n\nThe game features several modes: 1v1 duels, 2v2 brawls, and 4v4 objective-based Dominion. Solo play exists, but For Honor is primarily built around online multiplayer. The single-player campaign serves as an extended tutorial, offering lore and practice rather than long-term engagement.\n\nVisually, For Honor delivers high production value. The armor, animations, and environments are meticulously detailed, and the choreography of combat feels weighty and grounded. The soundtrack and sound effects—clashing steel, shouts, and heavy footsteps—enhance immersion.\n\nOver time, Ubisoft has expanded and refined the game with new heroes, maps, and balance updates. Dedicated servers improved stability, and regular seasons keep the meta evolving. The learning curve remains steep, but players who invest time find a rewarding competitive system.\n\nOverall, For Honor™ stands out as a unique hybrid of fighting and action genres. Its deliberate combat, strong aesthetics, and deep mechanics create a skill-driven experience unlike most multiplayer games. It demands patience and precision but offers intense satisfaction to those who master its rhythm of steel and strategy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Words cannot describe how much I hate this game. This game is a mix of cringe spammers and sweats who dedicated their whole lives to this game. Every time I'm so excited to play this game, and five minutes later I'm already considering suicide. Everyone has all chat turned off, so you can't even tell them how fucking annoying they are. And don’t even get me started on the team, no one has voice chat, and no one is capable of teamwork. All they care about is getting fucking kills (all they do is activate their revenge mode, and we all die). Overall, this game is awesome and I can’t wait to play it again tonight. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good game especially for those who want a fantasy / dark fantasy experience, very fun to play, huge character variety and customisation.\nMY PERSONAL LIKES AND HATES:\nI HATE NOBUSHI\nI HATE OROCHI\nI love lawbringer heheheha\nalso khatun good character\nuhh nerf nobushi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For Honor is an interesting one.\n\nLike a friend said, the Art of War fighting mechanic in this game is one of the most creative systems out there when it comes to combat. Nothing out there resembles it which I feel keeps the niche of this game solidified. You have a left guard, a right guard, and a top guard where almost all attacks will come from, keeping you engaged with defending yourself while going for their openings. These three guards alone to me are the backbone of why this game somehow refuses to die and at the least holds a consistent small playerbase. In this there are undodgeables which guarantee a hit if thrown while someone's dodging, unblockables which will pierce any guard unless parried, deflects which allow you to dodge into the attack (even undodgeables) to turn the enemy attack into your advantage, and a whole lot more. The depth alone is what causes such a long, steep learning curve. It can be satisfying, it can sometimes be frustrating, maybe even overwhelming. The one thing however in the midst of all that that it does is legitimately make you [i]feel[/i] like you're the warrior you play when you're absolutely unleashing hell on someone or guarding yourself methodically.\n\nYou have the Knights, the Vikings, the Samurai, the Wu Lin which are basically ancient Chinese dynasty-era warriors, and the Outlanders which are essentially the developer's way of making faction-independent warriors that don't correspond to the previous factions but would be fascinating if realized (i.e. the Pirate, the Ocelot aka a Mayan warrior, the Medjay aka an Egyptian strongarm, and more). With all of these factions, you 100% have individual heroes that have their own flavor of combat albeit overtime to bring everyone near the same power ballpark, some aspects of that have molded across the playing field sadly. For example, my mains have their own quirks: the Shugoki strives on bruteing through the enemy's attacks and has a unique hug move where, if landed, heals him a bit. The Sohei has a move that must be primed by landing a light and heavy finisher on all 3 guard sides. If primed and the attack lands, it's a nigh insta-kill. The Black Prior goes far with a longshield that can do a one of a kind move that, if timed expertly, can counter any attack in the game by flipping the enemy over their shield with a slash of their gut.\n\nAlongside this all, [i]customization[/i]. This game has some phenomenally vast fashion both in your fit and your executions that help bring your warrior to look one of a kind. Every Rep you gain on a character (think prestige) grants a new bracket of gear and fashion you can find while playing. It goes Rep 1, 3, 5, and then 7 where the real goodies starts rolling out. Overtime, you can make your Knight look like something out of a Gothic castle or your Samurai look like something straight out of Wano. That said, it's a REAL grindy game helped a bit by Orders which every day give you solid chunks of coin. Initially for awhile though, you won't mind it much since a lot of time will be spent with the aforementioned learning curve.\n\nFinally, the community. With every PvP game w/ multiple heroes of vast playstyles, it can sometimes get real damn toxic. Sadly these days that's the song and dance with PvP games (especially Ubi games lmao) and it can get pretty rough sometimes. Thankfully, at least from my recent experiences, I think in Duels and Brawls people aren't as toxic as the Age of Wolves era which is nice to see. If you're a new player, and it'll be obvious, people will tend to go easy or give tips to the character you're playing. Just be prepared to take some breathers. This game will sometimes chew you up like old gum and spit you out. It's absolutely a love-hate game where you'll have wonderfully one of a kind warriors that border on OCs and have matches where you feel like an unstoppable brute, and then you'll have nights where you get steamrolled by a dickhead Aramusha who loves spamming Thanks! and emote. It's the nature of the beast with games like this. Hell on here and on PS4 I got a collective 1,000 hours total and Shinobis & Warmongers still get me riled up haha!\n\nNothing lasts forever but For Honor is one of those games that I feel will go on for a very, very long time. There's nothing on my radar that wants to be a contender against this game which gives it its staying power imo. Had I not pick this game up, I wouldn't have met my closest friend and by proxy the entire next chapter of my life. These two aspects taken into account, this game's a dysfunctional family home where the dopamine and the depression go hand in hand like butter and toast. Keep on keeping on, For Honor.\n\n(P.S. - if any of my friends read this and get the game because of it, HMU! I'll happily show the ropes. And get this game on sale!! When the sale hits this game, it goes for like beans and pennies)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Take this from a 2000 hour player from ps4 now on pc, who has been here since launch.\n\nthere is nothing like this game on the market, Still, a gem of a fighting game.\n\nYes you will have the usual, Exploit mechanics, meta characters, or the \"light spam\" character also, witch if you are having a tilted night or just not focusing anymore will cause you a few matches.Every single fighting game has this component\n\nBut skill will trump all of that, if you have the fundamentals down non of that is an issue. Because when i lok at the Negative reviews for this game ,thoughs are the only complaints besides toxic players but its a pvp game soo... yeah??\n\nit may take a long time to learn the timings and all the move sets but in the end its worth it if you are a fighting game enjoyer, all in all its fun. \n\nAlso there is nothing like clutching a 1v3 when breaking , capturing the zone and bringing your team back for a win.\n\nJust try it, and dont be afraid to learn\n\nOnly negative is that ubisoft is just a greedy company, i made a new for honor account since i couldnt cross save, lo and behold cross save comes out 5 days later. I went to support and long story short, i have to buy a second copy of the game for my original email?? why in the world do i have to buy multiple copies for one email when there software is capable of logging me into multiple emails?? so yeah, good game but id understand if you dont feel like giving ubisoft money.\n\nAlso i was chat blocked for calling someone an idiot, but im called a dumb Nword in most matches and they are still playing?? nice.. nice...\n\nbut yeah good game lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've put too much time into the game across 3 platforms to stop. I need therapy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak, 10/10. The game knows what it wants to be and nails it in every way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is very  good game and great for children",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have several hundred hours on the Epic Games version of For Honor, my Steam hours aren't my total.\nUnique, extremely fun and difficult medieval fighting game as long as you're a mature adult who doesn't babyrage over losing in an unranked videogame. Failure is the only way to learn, and you'll be doing a lot of learning.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Matchmaking is a little tough with the current amount of players. Otherwise its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love hate relationship, cant wait to get back into it, just need a faster monitor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have 2K hours on both accounts. You either like it or hate it, not between. Its very original, not many if any of its kind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great choice for everyone that hate life. Painful, addictive and damage inducing creation that emerged behind the back of God...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hard in the beggining but after you do some basic combos, you will be on fire...in a good way of course!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you want to emulate being in a super abusive relationship with no way out then you got to get this game and you've come to the right place.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very hard for the uncoordinated like me but very fun. It's essentially capture the flag with the combat style of Assassin's creed on steroids.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game reminds me how shitty my life choices are. Still would play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game but makes you want to rip ur ballsack off. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great investment if you would like a steady flow of new controllers to spice things up. or for consistent noise complaints.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "u wanna kill yourself? \r\nyes, why?\r\njust because then i can recommend For Honor.\r\nThanks now i will go play it and then cut my veins\r\nno problem i will proceed with cutting them myself too \r\nhave a bad one\r\nyou too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A simple mechanic but with a very focus on timing and combos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After watching game of thrones I gotta say, \r\nthis is pretty peak.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its making me go crazy, but its so adicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "New account because my Xbox corrupted and I can’t play on that anymore. However, I can still give an honest review as someone who played For Honor for years and is now returning to the game.\n \nComing back after such a long break has been a mix of nostalgia and frustration. The core combat is still unique and satisfying, but the overall player experience has definitely changed. Some of the newer heroes feel noticeably overpowered compared to the older roster you can tell immediately which characters were added later just by how overpowered their moves are.\n\nPlayer behaviour has shifted too. People have gotten a lot more scummy in their playstyle, with a massive increase in ganking. It used to happen before, but now it feels like the default strategy in Dominion and even in some Brawl matches. You barely get a chance to fight 1v1 unless you purposely isolate someone, and even in the 1v1 mode all i ever come across is people spamming lights and running away.\n\nAnd like i just mentioned light-spam has also become way more common. Whether it’s newer players relying on quick attacks or veterans abusing fast chains, it’s something you run into constantly. If you’re rusty, it feels even worse because every hero seems to have multiple lightning-fast attacks now.\n\nDespite all this, the core of For Honor is still fun. The combat still rewards skill, timing, and mind-games, and when you actually get a fair fight, the game reminds you why it stood out in the first place. But returning players should definitely expect a rougher, sweatier environment than the game had years ago.\n\nalso dont bother with the sub-reddit, there toxic, stick to a horde mentality, harras you (im surpried i wasnt called  a slur) and the moment you call any of this out or go against there set oppinions you will get harrased and attacked.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like the game play and it is cinimatic (idk how to spell)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is my fav game of all time, 10/10 combat. MAKE MORE ARMOR TIERS PLEASE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is a Love and Hate kinda relationship lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most fun and frustrating game ever made. Peak.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of if not the most realistic fighting game I've ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game every time a spamer come I c#m I love this game this game is so good and all hero are same power and some of them not op it all lie",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Okay so I'm returning player who hasn't played for 3+ years and basically my experience so far was horrible and  not fun at all compared to before .\r\nI don't know what kind of people are playing this game nowadays but so far I've only encountered those who just ganking and rushing 4vs1 and characters who spam attacks especially those who have low ms on their light attacks \r\nI will not recommend this game to anyone",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Im 3 years clean of For Honor but I have buddy who plays this game like a family tradition. He said he hated the game with a passion and would stop multiple times, but always relaspe a week later, saying \"New character\" or \"Hop on, it will be better this time\"(it wasnt) and now its effecting our friendship. As the person who presented him with this game i hold myself mostly accountable for his addiction, but i fear it has crept too deep into his being and it might be too late to save him. the only thing i can do now is to warn others to not let the ones close to you experince this game. The dopemein in this game is like an expensive addiction. you think you pay with the stuff you have broken but no, you pay with you're sainity. That being said this game is its one and only and there is no other game that made me feel a type of way like For honor   8/10",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It was good in the beginning—just knights, samurais, and vikings fighting each other. The heroes were balanced enough that everyone had a chance, regardless of which hero they played. The game was easy to get into, and customizations were attainable without microtransactions. There were no magical abilities that could poison or trap you.\r\n\r\nToday, the game has gone in the opposite direction. A few characters are broken and way too overpowered, making the battlefield extremely unbalanced. Unlocking customizations is slow without microtransactions. The new heroes are unbalanced and have ridiculous magical abilities that stun, trap, or poison you. It’s starting to feel more like ESO than the For Honor we knew at launch. If you want to play, play it on PS4/PS5, not on PC—hackers and sweats everywhere.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Some of the most unique and in depth combat of any game I’ve played and is very addictive. Unfortunately it has horrendous servers, brain dead balancing and some of if not the greasiest slimiest losers the world has ever seen I’m usually joking when I tell people they should kill themselves but the world would actually be better off with some of these people not in it.\n\nIt has gotten to the point where i simply leave matches to not deal with the mental retardation the game likes to throw at me",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game fucking sucks. dont get tricked into playing it. i have about 150 reps or so. its not fun 9/10. you can get better balancing throwing darts at a fucking board of ideas then this team.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you wanted to know what waterboarding feels like, for some bizarre reason, just simply free up a 100gb of space on your computer and download this....this limbo of a game 🥀💕",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the shittiest game in the world if you want to suffer play this shitty game full of pussies of people who only know one combo and it's made by the dirtiest company shitsoft",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is fucking abysmal, but its like a trap once you get into it you can't stop. Save yourself, don't buy this piece of shit ass game and if you already have get out now before it consumes your life. I have over like 600 hours including on my PS5 I fell like i can personally say all of my relationships with family and friends have been ruined by this game. On top of that its made by Ubisoft.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's painful to write this review... I've played this game from the very start... Pre-Ordered the gold edition on Xbox, back then it was perfect. I have 3000 hours across all platforms. You logged in, everything seemed realistic. It fit the narrative. The Campaign, Multiplayer. everything was perfect. back then I would have rated this game 10/10\n\nNow they've ruined a game that could have been great, Broken heroes.( Virtousa what is that sh\"\"). Characters that don't fit the narrative, Cosmetics that don't fit the narrative. \"New\" maps that feel exaclty like the old ones. No new game modes added. Pirates?????. I'm not sure what the possible roadmap is for this game anymore. \n\nI'm going to have to give a 4/10 at this stage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "player base is too small to support the game, overpowered chars, gank squads, and sweaty smurfs have ruined the game and now new player are thrown head first into high skill ranked matches, with toxic low behavior rank players becouse NO ONE plays anymore other then the desk goblins that just spam unblockable lights and poison.\n\ndead game, go watch clips of it from like 5 years ago, that, or take a chainsaw to your genitals. you masochist.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has to be the most infuriating piece of trash created for idle entertainment i've ever put my eyes upon. DO NOT get this game unless you want to be against scripters and light spammers,  no one knows how to actually play the game anymore. FOR HONOR??? NO FOR DESPAIR FOR ANGER IM ANGRY RAHHHH",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Never played a game that made winning feel like losing, worst game ever made hands down, please save yourself and you're family member's from ever putting their hands on this game, you will quite literally be saving brain-cells and hours of you're God blessed life NOT playing this heap of Dogshit, whom ever made this game made a pact with the devil to make sure you never have fun but will always keep you in a loop of simple gambling addiction with every match palyed. For the love of everything holy go no further, this is a safeguard from saving you pain unimaginable. God bless you and not this game. NO HONOR .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Easily over 1000 hours between PSN and PC. it's a great fighting game/moba hybrid. problem is and always has been its community - it has the fanbase you'd expect from a medieval-setting product released in the mid-2000s. Lots of Punisher fans, lots of people preaching Jesus at you, etc. If I had a dollar for every time I got harassed for having a trans flag as my emblem I could buy one of Newell's yachts.\nAutomated moderation won't protect you from people telling you that you should die, but it WILL let transphobes mass-report you into multiple temporary bans, and Ubisoft Support will make the baffling play to both deny you evidence that the ban is your fault AND refuse to lift it at the same time.\n\nDon't bother. Go buy an indie fighter for cheaper instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Lemme just go ahead and say it looks a lot more phenomenal than it actually is.\n\nIf you're coming here expecting this epic, medieval/ancient history clash you're getting that, but realism? Realistic combat? No sir-\n\nI WISH I could say I enjoy the combat, because I actually don't, and only anybody who is remotely sane enough with their interest in this game will agree with me\n\nI'm not gonna whine about it being unplayable, cause honestly I'm dogsh*t compared to some players. But the problem here is that combat lacks immersiveness and proper structure, whoever made this game obviously doesn't understand the concept of balance, and probably shouldn't be making a melee pvp game.\n\nFor example you have orochi, the incarnation of mainstream Gen-Z tryhards, it's arguably the most picked 'Hero' aside from other easy-to-master heroes, such as Shaolin, or Shinobi.\n\nThese types of Heroes have a good number of hacks and are EASY top-tier picks for pvp, but that's also the problem, it's that everyone is pulled towards whoever has the most gimmicks and cancer-inducing mix-ups you've ever seen, and it only gets worst the better you get\n\nAnd depending on who you main, you will suffer.\n\nI know, I know, there's always skill and work-arounds to every type of hero, but that logic will only take you so far, and thus, I have to plea sanity\n\nMy heart goes out to anyone genuinely trying to stick to their main in this mess of a game.\n\n- P.S\nI will probably reinstall this game again in the future, then uninstall it the same week\n- Compliant from a Lawbringer main",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really fun fighting mechanics and high skill ceiling. Its community is my least favorite out of any game I have ever played and that destroys my playing experience",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is Dead don't buy it, its a waste of money \n\nWaiting time is 10min+ and you only see the 3 same characters with people who have 1000h+ in them with multiple prestige levels\n\nits not even worth the 4Euros while on sale",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Games cool and very unique, in fact it can be kinda addictive, but Ima be real, its such a terrible experience sometimes. Randoms who play like headless chickens, the balancing is just bad, 90% of the game modes have barely any activity if any at all, so you're basically forced to do dominion or duels unless you want to wait over 5 minutes to find a match or be booted back to the main menu.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please don’t play this game my friends forced me into it and even as a master in cock and ball torture I can say it’s some of the worst shit I’ve played and see stay far away for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game used to be fun but i cannot recommend this game anymore. game should be called no honor because it is filled with the worst kinds of players than intentionally team up on one guy with ridiculous numbers. people only play the same few easy busted characters and spam light moves rendering you useless. all the easiest characters are all dlc as well. the game is no longer about best man winning as it is now more of a who can spam harder, who can do desperate frantic bleed light attacks for a win they shouldn't of had. and not to mention if you play with friends you online matchmaking will put you in the sweatiest lobbies you'd never think an employed person under 400LBS could achive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game but wants me to log into an account what i don't even have its really cool now i have a game what i cant even play. thank you ubisoft for wasting my money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Still has great core combat, but the balance issues and lingering bugs drag the experience down. Too many problems get in the way of the fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FOR VALHALLA (or whatever the samurai or knights or pirates yell). The game is a good idea, but the issue is that the only people who play the game have 15 gorjillion hours already. I played on playstation years ago, then tried to play it again on PC, and man it is so unforgiving. Just too much to try and learn to have a decent time, this has a worse learning curve than MOBAs because SBMM does not exist in it. If you've been playing for a while I am sure the game is a load of fun, but it is nearly impossible to get into a lobby and have a good time, in any gamemode.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "considered ending it all after one game\n\nedit: nvm its not that bad. What playing warden does to a man",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only people left in this game and the ones that never left. They are the sweatiest, most bitchless individuals that I've ever seen and I used to be really good at this game back on Xbox.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks, and I honestly don’t understand why people still play it. 0/10 my balls hurt",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As much as i loved this game on PS the PC port is absolute trash. For months I have been unable to launch this game through Steam and i've done everything i can think of to try to get it to launch. At first it was my VPN so i disabled that and it worked for a bit but now it just constantly crashes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely don't recommend. Ads everywhere. Terrible single player experience. No data reset option. Absolute failure.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so ass like fr so bad. it was peak a long time ago but now its just a scam. dont get",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its the best bad game ive ever played... but its still a bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Far from the first to call this game a toxic relationship, the game I love died years ago now and more often than not I regret playing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is addicting and I can't stop playing but seriously fuck this game and its wack ass controls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If your really into gay things you will love this game, its full of ganking by 2+ fat guys, this game if game is only for the mentally ill people. Played this on xbox and on my life I will never play this game again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "have 1000+ hours on PS5. This game is toxic, full of sweats and does nothing but make you rage every second. It's hands down my favorite game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Awful community. Horrid balancing. Go play chivalry 2 if you're a medieval combat nerd, and even then, that's also ass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The controls are clunky and inconvenient as well as inefficient.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I do not recommend this game. I've been playing it since year 1, got it a week after release, and it was good really good back then. But over the years it's just gotten worse and worse, shitty heros with bad play and design. A really damn good story and lore thrown out the window for some fucking slop. I'm done acting like this game is still good, that it gets attention from UBI. we all know it don't, it stopped getting good attention at Marching Fire. I've poured possibly thousands of hours of my life in this game over the years. I'm sad and disipointed that the game is the way it is now, I loved this game, I really did. But it ain't nothing like it used to be. We get a lot of shit with a shiny ruby in it sometimes, and that is somehow enough for us. I'm sad I'm writing this, I don't wanna but I'm giving my honest truth. Y'all have a great day/night.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "been playing for years and it just gets worse and worse jc and the dev team share one whole brain cell there thoughts and decision making on the game for example every game getting ass fucked(ganked) constantly and getting not even a drop of revenge even when i side step or block or parry dont matter the game will deside to give it to me when i have a sliver of hp but then even if lets say i do get it i still get butt raped in a corner or getting constant toe stab while getting puched or getting hit with 6000 feets. when the patch notes came out and when i saw that it got fix(revenge) its still shit im telling you the game aint bad its just the mf player base and how bad the dev team is every single game every mf hold there partners cock and it makes me also not wanna play my heros just forces me to play a boring anti-gank hero...........",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is just full of spammers used to really enjoy the game before all the new characters were added, now its just spamming heaven with no skill boring and annoying, probably will never touch For Honor again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't recommend this game to others don't waste you time and your money with this game.\n\n1. All the characters are so hard to unlock or buy, after hours play like 45 hours we can just unlock one character and that is so bad.\n2. in my level i think I had played well but fighting with some characters are completely impossible to win.\n3. after 50 hours play finally i could unlock my favorite character and he is suck.\n4. must of the players are pro player maybe more than hundreds hours play and it is not fair for some players like me to play with them as enemy definitely they will win not once not twice you just can win 1/5 fights and that fight would be win by your good teammates.\nthis game mede me angry.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you hate yourself this game is great, that being said if you hate yourself and want to torture yourself. This game is perfect. Other than that do not play this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you want to keep your sanity, don't buy this game, otherwise you'll end up in a madhouse with soft walls. Everything in this game, from attack detection to the gameplay itself, is fucked up by Ubisoft. The game has gone from being about predicting what your opponent will do to being a staring contest throughout the entire match. Either you wait for your opponent to make a move or they wait for yours, and you just stand there and stare at each other until other players show up and chaos ensues. The attack detection is on par with EA Epic and Rockstar combined. You can have a halberd that spans half the map, but you can only fucking dream of hitting anyone because a character with a sword the length of an ant will reach you no matter where you are. Matchmaking is also the same. You can play for god's sake and win all the matches, but what's the point if you're the one doing the most and your allies are just running around doing nothing? It also works the other way around when it comes to opponents, but the difference here is that there are players on the opposing team who know what they're doing. they are supposed to do and they can play where in yours only you can do something and the rest as I mentioned above matchmaking is simply pathetic the community itself is crap you can meet lots of toxic players did I already mention predicting attacks in this game? Well, I'll also add that you can stop predicting them because most of what you can do is actually luck rather than knowing where the opponent will land their attack. The hitboxes are on par with the game itself.\n\nOh, and I almost forgot that Ubisoft can't nerf overly powerful characters. One of them is Virtuosa, a warrior with a rapier who has the Goku Ultra Instinct stance in her attack kit. So, no matter what attack you throw at her, she'll avoid it, and you can't say shit about it. Her only weaknesses are undodgable attacks and guard breaks. But what's the point if she can easily knock you out with her light attack, which, by the way, is too fast from her stance. But everyone defends her because her win rate is too low to nerf her, which is bullshit. It's been about 3 or 4 months since she was released, and still nothing. She's still in the same state she was in when she was released because Ubisoft can't see that she's too powerful, now imagine you are being attacked by two enemies and one of them is her, so you can put down your gamepad or keyboard and watch yourself die because you can't do shit. This whole game is a fucking mess that Ubisoft can't handle. A lot of things need to be changed, but Ubisoft is in no hurry. On the contrary, they break more than they fix.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For honor is possibly the worst game ever made. From the moves in the game not working to having certain heros completely unbalanced not to mention the non stop ganking. This game is a joke. For a game with honor in the title there is literally none. The entire player base of this game are the lowest people you could ever find. People who are literal cowards scared of a video game how sad can you be. There are maybe five heros in the game who you can actually play and stand a chance at being good otherwise you'll be light spammed and dodge spammed to death. What a joke of a game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It used to be innovative, fun and fair experience, now its a waste of time and disk storage, if you manage to find a match after an hour of matchmaking (that said on what the game calls \"highly active\" modes) consider yourself lucky, oh and also even after you find one its either full of bots or legacy players so dont even think about having any fun after a hard day or whatever. Servers get at least 3 errors a day, even during a match, no matter how good your connection is, and there's no way for new players to level up. Ubisoft since you butchered this game so much why not just change the name of the game into something more accurate, like: \"Waiting in the lobby for eternity simulator\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is bad for mental health but I can't stop. Its like a drug, the highs are super high but when its low, you want to rip your face in half.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd rather hit myself over the privates with a ball-pin hammer than play publics for any extended time period.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The steel you earn while playing can be spent and the things you've spent it on can disappear. making investing time in to the game useless, agonizing to discover late into playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is dogshit, just rock paper scissors except sometimes your opponent is a ninja who throws scissors 6 times before you ever threw paper and then emotes on your corpse. super clunky and unresponsive too",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "generally a good game. Had fun at the start. Now its LITERAL HELL. For a game called \"for honor\", everyone online plays like they never heard the word. like i said, it wasn't bad at the start. Dominion matches (4v4) were fun, and players would honor 1v1s. But THE MOMENT you get a single character past rep 5 (like 2-3 days of playing 1 character only), its like someone physically put you in the unemployment lobbies. And not in the \"really skilled but beatable\" way, God i wish it were that way.\r\n\r\n As soon as you hit rep 5 YOU WILL get 4v1'd EVERY encounter, you WILL NOT see a 1v1 ever again, your teammates WILL thirst any 1v1 you manage to lock in on the last hit and you WILL NOT get points for it. And even if you stop playing that rep 5 character and switch to a lvl 1 character you've never used, YOU WILL STAY TRAPPED IN THOSE SAME LOBBIES WITH 0 GEAR OR PERKS. Funny part is that 99% of the time its the console players ruining the matches, but if you turn off crossplay it is next to impossible to even find a lobby (let alone find a match). and just to make sure the game stays ruined with no way to redeem it, You CANNOT communicate with the other team through voice or text. so once the match is fucked, its fucked. End of story. You will be forced to watch the same 4 players dog pile you in a 4v1, you will watch them all spam uninterruptable attacks, you will watch each of their executions in full, and after that you will still be stuck watching the respawn counter countdown from 15 over, and over, and over, and over, and over, and over for 10-20 minutes for every match. And leaving the match as a means to save your sanity will gain you a MINIMUM 30 MINUTE BAN, EVEN IN CASUAL. \r\n\r\nTLDR: Only buy it if you're not fond of your mental health. 5/10 would smash my controller again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Basically perm banned for username \"violation\". Sure, I understand xFuttBucker69 may not be the most community friendly name, however, i don't think i should've been essentially perm banned for it. Whenever i try to boot the game now, ubisofts trash app launches, prompting me to create a new username. When i try doing so it rejects whatever i put in and will not let me in regardless. Not to mention how horrible the community is towards new and existing players, this game is the most toxic game i have ever played with the worst possible game company backing it. I HATE ubisoft with a passion and refuse to purchase or play any of their newer releases, and you really shouldnt either.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst dogshit fighting game you will ever play. This game is Dantes Inferno; this is all seven layers of hell. The only good thing about this game is the aesthetic. Good luck finding a match in anything but Dominion, and have fun getting 4v1 constantly while they spam unblockables at you from all directions, all four players at once. They have a revenge mechanic that gives you a temporary health buff when you're outnumbered, but you'll never be able to activate it. But as soon as you look at an enemy the wrong way? They have revenge. This game is a steaming pile of do,g, and it's embarrassing that I have this many hours in this trash ass game. If I could go back in time even once, I would sabotage this game's development so its evil couldn't leech into the world as it does. EVEN IN MY SLEEP I still hear the voicelines. \r\n\r\n10/10 DONT RECOMMEND",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "almost decade old game with the most toxic people still trying to one up each other, not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft slop. \r\n\r\nStarted the story mode, 5 seconds in I notice I accidentaly picked main characther to be female instead of the guy because in the picture they had plate armor on so you couldnt notice, hear the voice, go to menu, no way to reset, google it, ubisoft saved the choice permanently online. There is no way to revert and choose guy? Its such a easy fix, the only reason that they havent added a way to atleast reset the chapter is because they expected this to happend to people and they didnt want them to have the option to reset. I think its good you can choose to be male or female in the game but if your going to allow me to choose also allow me to revert it if I make a mistake.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i was afk for not even a minute and got a 15 minute ban wtf. they need a rejoin option or something or to increase the afk time limit or reduce the penalty bc this is some bs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i'm beyond frustrated trying to get the game to launch. it has become a 100gb digital paperweight.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "How unga bunga brain dev team not give me pugilist ME UNGA BUNGA UNHAPPY. On a serious note actually add some cool weapons please and thank you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS IS LITERALLY THE WORST GAME OF ALL TIME, I CAN NOT STRESS HOW BAD THIS GAME IS. IT'S BORING, PAY TO WIN, REPETITVE, TERRIBLE, AWFUL, PLAYED BY RACISTS AND CRIMINALS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game will eat your soul. It's too late for me, but you can still be saved. Send help.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Never hated the game but couldn't like it cuz devs hate their own game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the games balancing is abysmal and it isn't fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just don't play it, live in blissful ignorance of the hate this game will welcome into your heart.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THE GREATEST SKILL CHECK IS UBISOFT THEMSELFS I SIMPLY CANNOT PLAY ON STEAM",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "STUPID AS SHIT GOY GAME DO NOT PLAY THIS DEVS SUCK GAME SUCKS UBISOFT SUCKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game got worse over time. became unbalanced. favors cheap playstyle. inconsistent input reads. again got worse time with the updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever made, pay to win bullshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't let the name fool you, there is no honor in this game. But if you like 4 dudes ganging up on you then this is the game for you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "devs care about money not making the game good just play kingdom come.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kill the ubi devs by public drawing and courtering. pls",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game sucks. What more do you want me to say.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game made me beat my chidlren do not download if u have children",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "keeps crashing at the matchmaking...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's bad, but there is nothing really like it so.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game fucking sucks but nah it just fucking sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unbalanced as hell do not buy ubisoft sucks at making games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Everything in this game is ass but there is no other game like it </3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just torch the whole company at this point honestly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "why icant play this game and link with Ubisoft do nothing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The players smell like sewage because all they do is cheese",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this shit does not help ubisoft's reputation for terrible half finished games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What was once a great game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game of agony and dispair(peak tho)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If ubisoft were a smart and competent company they would release a 60+ hour campaign that centered around the warden and his characterization as a deeply caring and honorable man\n\nInstead we have micro-transactions and lobbies filled with the sweatiest, grimiest, most repugnant cuckhold greasmasters you’ll ever have the displeasure of fighting against\n\nTl;dr find a better way to spend your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unique combat but its boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bane of living basically a drug",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "IF you have a life don't play it BUT if you hate it I recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, not worth the trouble",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just save yourself before you become hollow like the rest of us..",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "worst game ive ever fucking touched",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst spent 31 hours of my fuckin life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "People really still play this garbage game?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "toxic cheaters",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "tried it... it sucks...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game bad 10?10 would not play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is butt",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cannot run game...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game took my soul",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bum game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ubisoft is dog shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game wont run",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pain and suffering",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}