{
  "positive": [
    {
      "review": "it is zomby game and you have to survive and it very scary because some zombie are fast and some are ghost and some explode and some spit blue goop and it very hard to kill them and you have to eat and drink and you got to idk, i never finish the game cause i die but it very fun to play with friends and yeah",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This was THE game I would always play when I was a kid and first got a pc. My first pc was too crap to run almost anything besides roblox and THIS. I've loaded countless of hours into this game, spent alot of time collecting skins, played hundreds of servers, made several servers, lost and gained friends, I even streamed this game for a fat minute.\r\n\r\nI loved everything about this game, and although I dont play it anymore I still love this game and would suggest it to anyone",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Nostalgic f2p zombie survival. Crafting, base-building, and multiplayer are fun and addictive, and the community keeps it lively even today. The graphics are simple, but that doesn’t take away the fun.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Unturned remains a solid pick — especially if you’re looking for a free survival sandbox to play with friends, enjoy exploring, building or just messing around in a zombie world. The community and modding support give it longevity.\r\nHowever — if you prioritise top-tier graphics, finely honed survival mechanics or a massive, uniformly populated modern game with all the latest bells and whistles, you may find it a little wanting or dated.\r\n\r\nFinal Call:\r\nJump in and have fun, particularly in a good server or with friends — but go in with the understanding that Unturned’s greatest strengths lie in community and freedom, not in cutting-edge visuals or ultra-refined systems.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really fun and enjoyable. It’s simple, smooth, and entertaining, with great gameplay and good vibes all around. Addictive and satisfying, I keep coming back for more. Overall, a solid game that’s fun, relaxing, and has just the right amount of challenge.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The coolest game possible I had a lot of fun playing this game and I'm still having fun whoever installs it is the smartest I love you people",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "funny game goofy graphics sadly no good or worth while pve servers mostly all modded pvp servers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unturned is the game where I log in for a chill survival session and immediately get bitten, shot, or blown up by something I didn’t even see. Zombies are relentless, bases collapse in hilarious ways, and somehow I end up running naked across the map yelling at a tree for cover. Ridiculous, brutal, and endlessly entertaining.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ">join 10x for easy start\r\n>spawn\r\n>find a hammer and baton\r\n>get sniped from somewhere\r\n>respawn\r\n>get spawnkilled\r\n>respawn\r\n>get killed while trying to leave ur spawn area\r\n>respawn\r\n>finally escape ur spawn\r\n>run to nearest building\r\n>full of dead bodies and loot\r\n>get shot at from a window across the street\r\n>grab 4 diff guns\r\n>only 1 has ammo\r\n>tanto pistol\r\n>fire blindly\r\n>you actually kill them\r\n>realise its night time\r\n>20 zombies storm in and maul you to death because youre an idiot\r\n>die\r\n>quit\r\n\r\namazing game, 9/11, would do it all again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Uzun zamandır oynadığım ve şu siralar oynadığım ama çok güzel bir oyun özellike düşük sistemli kişilerin rahatça oynayabileceği bir oyun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though its going a different path now, it was fun and is still fun to play with friends. Maybe someday I will look back when I have friends to play with again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though it seems similar to other games, it really is unique with the style and concept, theres bosses in world settings, the maps are constructed well, and theres never a time where you are truly safe.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "had a lot of fun playing this game! Recommend first playing offline to understand the basics of the game. Very good for a f2p game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game, but loads pretty long",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game, I would recommend it for the big variety of things and possibilities.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "have fun and game with friends on this gunning and looting game with the pve and pvp aspect of the game going agasint zombies at diffrent veriety diffuculty and players",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if u have a new pc and want a good free game to get better at other games, play this game! i made friends and bases in a ton of worlds and had so much fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gifted by a friend to me, great game. Love it. Perfect amount of difficulty, not too easy but not too hard.\r\nLove the realistic survival aspect of it.\r\n\r\nPlease fix the curated maps killing me everytime i respawn or play them after i die the first time in them though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good and fun game tho we got raided, but that happens",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple graphics, but incredibly fun and deep gameplay. The best free survival sandbox game to play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game over all, its a pain to start servers and to mod them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun and silly. one hell of a vibe. I mainly play single player but also great community. Vast servers and good people. A pve/pvp that you can keep going back to after you get off",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played since beta and it's great to see how far this game has gotten despite being a simple low poly game. More and harder easter egg runs would definitely make this game more engaging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Бесплатный аналог Left 4 Dead\nВ целом игра очень понравилась, постоянно держит в напряжении, особенно на первых порах выживания. Вообщем полноценное выживалити. Ну и конечно куда же без скинов))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My friend got me into this game cause he played it a lot when he was younger, we made a base in the middle of nowhere and it got completely raided 2 days later, that server is now somewhat of a warzone, great game. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game amazing atmosphere healthy community and all round good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it when i accidentally throw a flashbang at me and my friend when he is screaming because of zombies and flashbang both of us.\r\nGreat when i shoot a zombie 5 times in the head and he does not die with a sportshoot.\r\n10/1o Game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great survival game, especially for free. It's both fun in singleplayer AND multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the perfect pick whenever I’m unsure what to play. I dive in for hours, then take long breaks—yet I always come back to it. :P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great survival game to play solo or with friends. There are also constant updates from the dev.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was a lot of fun when it first came out. It just needs a bit more work to reach its full potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good OG game but quickly boring nowadays. New maps are boring and you get bored easily. Still a great game to come back sometimes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a nice free zombie game on steam. Looks simple and blocky which actually fits this game's theme a lot tbh. Definitely would recommend this with friends/groups with some sort of proximity voice chat or normal vc!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing this game sence 2015 and it never disapointed me sure i played it less over the decade + but its worth it <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to mod\nGood with or without them\nMostly make review for game awards",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely beast of a free to play survival crafter. Top tier. PvE is fantastic and can be customized with setting and mods, PvP can be sweaty but overall fun. Def worth playing and supporting the dev with the Gold upgrade.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is for player who cant buy games like Day-Z and yes i know most of the community sucks but i have found many pockets of good players still making this game good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Since the beginning, Unturned has been, and continues to be, one of the best zombie survival games out there. Its simple graphics let the addicting gameplay and surprisingly rich story stand out, and I am happy to have found this game, even this many years after it released.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Divertido, leve e com uma workshop gordurosa que melhora ainda mais a experiência do jogo. Recomendo a jogar co-op!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thought it was too easy. Realised i was playing on easy mode. Switch to hard mode. Immediately outrun and killed.\n\nNice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i've played lots of zombie games in my life but the only thing that this game made me like was the art style. i plan to play more of unturned , and make a video on it. \n\notherwise \nw voice chat feature\ngreat tutorial\ncool maps\nand more\nyou should play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game feels the same after all those years... i dunno if its bad and good things",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good but is also kinda badd??? idk how to explain it but if your looking for smth fun then this would be it\n:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ignore the hours - that's mainly due to me never turning off the game OR my computer... for several nights.. I WAS LIKE 12 OKAY - LEAVE ME ALONE!! \r\n\r\nBut seriously, besides the nights that Unturned was left open, I was playing the everloving crap out of this game. Only thing that keeps me coming back is how simple it is.\r\nYea I could find a minecraft mod/modpack or a roblox game similar, but its not going to have the same feel as unturned. I've also tried other zombie games (mainly project zomboid) and find that they're just not as enjoyable as unturned either. \r\n\r\nMaybe I'm just bad - but i still recommend at least checking out this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its just a fun game to play a break from all these sweaty games nowadays very relaxing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of those games that is fantastic to play for many hours - very simple. Playing with friends makes it even better. I feel like I grew up with this game, and so there is a great deal of nostalgia involved in my judgement.\r\nOne of the games of all time. Seriously.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The games fun but only on some servers. Dont play solo if you want to have fun. Othor wise if you like pvp like rust but simpler play it. It also has rp servers so those can be a fun alternitive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though PVP is hard, its quite good. I like the terrain & towns. good game reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good free game with very good mechanics. If you looking for a game to play with your friends is a good game to have fun, BUT, If you will try to go to public servers, ve avere that majority of players on servers very toxic and just looking for killing people because they are not so good at CS:GO or something like that. \r\nIn general: Good game for singleplay or to coop, but because of some players that just appear with red reputation game experience is destroyed after some encounters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game to play alone or with friends - Watch out on public servers, players are toxic and may kill you quickly. Overall great game and definitely a worth it game to put some hours in for free!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite the simple graphics the game is really enjoyable to play through solo or with friends! I've been playing this for about 4 years, I lost my old steam account and ended up making a new one just to come back and play this more! Nothing ever feels broken or unbalanced and any issues that do come up seem to get addressed rather quickly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my friend installed it this morning and test played it with me in the night but his pc is hot as f like 65-70 while he played other game its not that high can you guys help me whats wrong ?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was good definitely would recommend it for people that like Base building and are good at fast-paced Shooters I did not personally like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game might want to install mods to be a bit better play with friends for best expreince.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Nice Sandbox Survival Game I've played since 2017 (I prefer playing single PVE) .However, the new content is becoming increasingly scarce and all maps retain the homogeneous game-play: get a gas mask  and plenty filters and loot in Dead-Zone.If you want to play the game,try RUSSIA/BUAK/ELVER.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is pretty fun with friends, not alone tho. I still have a lot of things to learn after playing the 6 hours,\nand the game is pretty well optimized too, currently running an 1660 super and can put it all to max graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is excellent. You can play with friends, join other servers alone, and many more features. This game is fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game's fun, challenging sometimes, but overall the zombies are too easy. Yukon's the only vanilla map I really play on anymore, cause it's a great challenge, and the other vanilla ones are a tad too easy.\n\nThe only thing I wish this game had was better zombie AI, and the ability for them to patrol and attack a players base throughout the playthrough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played unturnov for a couple hundred hours when i was like 15  literally so gas love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it! It's either having fun killing kids in multiplayer, or you are the kid getting killed. :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Love and recomend this game for anyone who is wanting to play a fun survival game and am supper happy to see a future update possibly soon? but nelson we the people want more updates #make Unturned grate again!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game just needs more players on other servers instead of 50 people on 2 servers then no one on the rest",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, free, surprisingly good. need i say more? if you can get over the graphics you will love this!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "shoot zombie, find stuff, eat, drink, survive. 10/10. (little bit hard but if you practice you'll get good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Made a hotel base. saw people getting attacked by a bear. they tell me there friendly so i let them in. one dies to the bear before he gets in. the one that made it told me he was shady. other dude shows up says he is CJ. Shady asks me what games i have so i told him. he then said i have all the games he plays so he invites me to a party and friends me on ps. after the years it was only me and CJ left so me and him got close. still talk to him to this day.\n\n10/10 if it wasn't dead",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like rust but blocky plus its freee and you can add mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun played for almost 1,500 hours took a break trying to get back in but it seems like most the the players are far less and more toxic so watch out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect game thanks to modders and map makers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "15 minutes in and im alredy impressed. Unturnet has surprisingly deep survival mechanics, simple but effective crafting, and the zombie chaos keeps you on your toes, Fun and easy to pick up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Hey, it’s good to be back home again.\nSometimes this old farm feels like a long lost friend.\nYes, and hey, it’s good to be back home again.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i'm doin this for the steam awards only play with friends and on servers it's fun oh and modded and HOLKY SHIHBASKDGWJFGAJSGF THAT'S A BOSS WHY WOULD YOU SHOOT A GUN HERE WE\"RE IN BERLIN YOU RETARD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "joined a server and instantly got attacked by like 10 zombies i recommend the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cannot reccomend enough, fr tho. Best story and lore you will EVER know, I dead serious guarantee you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Free to play zombie game ever, works well even for the worst of Pc's",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nelson We Need Unturned 2, wish on one day next game out from u, like the first Unturned on 2017s",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hard to play with a low grade computer but i love the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it! Very fun with friends on a high pop server.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oyun çok güzel eskiden fena sarıyordu ekip ile",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game.I have a lot of fun with my friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun, especially with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a really good game but i sometimes get bored really quickly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can eat the glue. Eating the glue is really fun!!!!!!! (And there are zombies sometimes)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good mechanics zombies overpowered tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the dark souls of blocky free surival-type games without a community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game. I plan to play this game for hundreds of hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i liked this game was very simple and my laptop can run it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What can I say... \n\nThis game has so much inside, from friends that will guide you, to foes who will kill you.\nI've spent so much time in this game, that it is marked in my mind. I've met a lot of awesome people through this game, and I've had so many good friendships too. I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i had played this game for 14 hours with bigger breaks. this is a game that u can play on whatever pc or laptop. is a good game 👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, just dont select black skintone because you get targeted (You don't wanna know how I know).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You kill zombie.Zombie bad.Kill with hand,so find weapon.Weapon found.Kill zombie.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good little game when you just want to kill some zombies and not get kill by ppl :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is similar to Minecraft I recommend it to others",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My other acc has 2000 hours on the game, Unturned is a really enjoyable to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best game ever i have been playing this game FOR SO LONG/844.5 hrs this is from a one week i have to stop so thats what i did so that was from early 2023",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dieses spiel ist ein absoluter banger mann kann sugar basisen bauen und es gibt zombies.Außerdem gibt es einen blut mond bei diesem werden die Zombies wesendlich stärker!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a good game to hang out with friends and drop cards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its much more fun that it seems to (tutorial is boring but gameplay not)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its unturned... a childhood favorite! Just try it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun cool thing to play if you don't have any money to buy other games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Metal grinding simulator (with zombies as extra)",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Played this game back in the old version and multiple times as it got updates. And this game has just become boring. It isn't survival and it sure as hell isn't singleplayer, all the maps (especially the new ones) are made only with PVP in mind to the point where you don't even need to really reload, you can just drop the gun and pick up a new one. And if you are playing offline all you need to do is find a axe and a saw, thats it. After that, you can play hoarding simulator. Older maps don't get updated with time and to make zombies more deadly they just make them bullet sponges, A4 to the head takes multiple shots and a car gets stopped and even pushed back if you try to run them over",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I appreciate that it was free, but it's honestly kinda trash. It doesn't really feel like the zombies even matter. They never move and barely do anything unless you just don't see them and there's just too much focus on PVP. To be honest, DayZ would definitely be a much better choice if this is your type of game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "We're never getting the next game overhaul :(\ncurrent game version just isnt fun, its so janky and outdated.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game keeps crashing, keeps validating some random shits all the time, loading forever and on top of that it cant be uninstalled",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the game I grew up with. I remeber the august mornings during the weekends, I had soccer practice and I really didn't give a flying fuck about soccer, all I wanted to do was go back home and play this new game I found called unturned. I remeber the first time playing unturned, I was crouching around Seattle during the night, figuring out how to use a mic and asking if anyone was around me before getting scared and logging off. Throughout the years I've hopped on this game on and off, even got my mom into it a little and got her a gold upgrade as a mothers day gift when I was 8 lol. Man I miss those days when Unturned was more of a survival game than a pvp game with a hunger and thirst system that doesn't even matter anymore because people are too scared to go over easy mode. I wish this game would bring an update with some good survival mechanics but until then I have to give my favorite game of all time a no on recommendations.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i couldnt leave the game because it dosent let you for a while after opening the menu",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played it back in 2015. It was fun. Picked it up today. Since those ten years there's been pretty much no new content apart from maps that have been made by the community. As far as I'm aware the dev(s) doesn't/don't add much if anything new from themselves. Just one of those PvPvE games which turned out quite meh. Also it's 2025 and the game still doesn't host servers through Steam. Gotta set up your own dedicated server which isn't difficult, just a bit ass and clunky.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Download when your 15 and dont have any money type game. Seriously, What do you expect? It's video game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a ok game i guess, but it can be better.\nfor those who want to buy though, just save money for dayz, even though this is free.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "one of the worst games i have ever had the displeasure of playing. it punishes you for everything you do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was going to post a good review, but an this program is trash, the graphics I could have accepted, its what is shown, but the user interface and the crafting menus are just a total mess, I have to craft a table, but searching for the crafting recipie or ingredients required is all over the place. tried to find the stupid blowtorch recipie a tool you need to make another station....why do I have to search for it everywhere and still not find it, I click the tabs for tool and it gives me things besides tools.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is great but one shit mechanic, i died and 70% of my stuff despawned, it would be better if the game allowed me to hold shift and click so i can retrieve most of my stuff and the stupid bed glitched out so when i spawn home it spawned me a kilometer away from the bed, fucking developer get your head in the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is only alive because of the community, and the map they make. Official updates and content to the game is barely made nowadays, and any new update don't really improve upon the game's enjoyability. The game is also poorly optimized, the game randomly freezing sometimes for no reason at all. It also does not help that this game has predatory lootbox mechanics as seen in games like CSGO.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible game, singleplayer or multi, public servers are toxic. do NOT waste your time on this like me and my friend did.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game unfortunately has lost it's purpose. To provide a platform of impartiality. Instead, this has become the demon it swore to defend, meanwhile other games are capitalizing on that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's time to let this game go.\r\n\r\nas of 2025, this game is gustavo fring lospolloshermanos disapproved.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As a vetern of 4-5 years and after returning to the game i am very upset to see what this game has come to nothing new I have to get mods just for something existing, idk why but i dont think the actually dev does anything anymore for the game which is sad, i hope to see this game return to its former glory and as someone who doesnt typically like leaving reviews just refund the games that annoy me or just suck but as this is a free to play MY FINAL WORDS \"This Game dukey now if i could i would refund it and to those that would play this game just play a actual good game like zomboid\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I Installed the Game beacuse it looked intresting. I booted up the game, i clicked play and it made me install a map that took half an hour to install. After that there was a loading screen that took 5 minuets to load, when i finally loaded in my game was laggy then crashed, Would not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3/10 Just a generic pvp game. This game has nothing to do with zombies.\r\n\r\nPros:\r\n\r\n-PVP \r\n-Mod Support\r\n-Easy Multiplayer\r\n-Smooth controls\r\n\r\nCons:\r\n\r\n-PVE. The zombies become trivially easy in the first 5 minutes.\r\n-Loot progression. You can have the best loot in the game in 5 minutes because military areas aren't any harder than regular areas.\r\n-Weak survival mechanics. You have infinite food and water and heals very easily\r\n-No endgame or difficult challenges",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no good support for servers with friends. total cheeks if you have friends. really fun if youre lonely",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is rust/state of decay but better. Despite the fact that it is better, it is still the same type of game, so it sucks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am quitting UNTURNED because it's a ridiculous system. Nelson Sexton does whatever he can do to help his favorite players and curated developers. Neglecting his community and his game. Being the first ever game ive owned and played on steam with my friends, Nelson Sexton has let down me and his community with his actions and has proven himself incompetent at game design and as a leader of a community. It DOES NOT seem worth it to me and many others to continue to play or make content for this game any longer, especially if the game developer will eventually steal curated content, claim it as his own, and everyone will fall for it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think this game just became a breeding ground for twinks, I can never return for I fear what may happen to the longevity of my soul. And other than playing femboy pokemon your options are limited and always result in frustration and beration by a scary old man.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just another like muck if it was more like zomboid. Multiplayer seems mid, low key prolly more fun running it down solo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "#NelsonStopKillingUnturned\nWhy did I pour over 3k hours into a game that's basically dead now?\nThey were great memories, but still.. why, man?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty boring, but at least it looks nice",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this fucking fucking fucking fuck fuckity fuck fuck game is fucking shitty fucking piss off this fucking game pisses me the fuck off i swear to fucking god this game fucking sucks so much fucking dick its not even fucking funny fuck this fucking game i swear to fucking god which sorry ass motherfucker made this fucking shitty ass fucking game fuck you im gonna fuck your mother doggystyle you fucking cock sucking worthless shitfuck fuckface fucking bitch i fucking despise you and everything you stand for you left wing neo nazi fuck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don’t enjoy playing this. It isn’t fun. Every time I try and play it’s just unenjoyable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried to raid a starter base and some dude got mad and said he'll dox me. Turns out he wasn't lying, now I have to deal with 15 gallons of exotic zebra sperm.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "кал полнейшин, друг в нее играл, больше нет его в живых , к счастью умер",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Make unturned better and fair for all players and modders.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Would genuinely be greatif the devs of this game cared...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "uhhh dont pvp on pandahut servers most toxic place ever and will be touched",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you have ever wanted to feel like your doing something well this isnt the game for that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This shitty game blue screened my pc 4 times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "turturial doesnt help on starting",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "need add. 3000h to express feelings",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever dont play it  tfouuu nikomk",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm not interested in the developer's political preferences",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nelson is a fucking dumbass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the creator is an awful hypocrite.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "These cubes are driving me crazy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very very bad graphic",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "govno. s chitami veselo :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is very bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i don't even know what to say it's just garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bruhh lag :( my potato laptop is angry",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't like it\nugly",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "jugo caca",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible dev",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This shit sucks",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its mid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "deadgame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kötü.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Roblox.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just no",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "b",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ";-;",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I blasted the developer for not attracting new players to the game. The game has so much potential, yet the player base keeps dropping every year and servers are shutting down. The dev keeps releasing pointless updates that don’t bring in any new players. The dumbest update ever was when they made the microphone turned off by default — many players didn’t even know how to turn it back on, and after that the servers became quieter than a graveyard.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "Played this game back in the old version and multiple times as it got updates. And this game has just become boring. It isn't survival and it sure as hell isn't singleplayer, all the maps (especially the new ones) are made only with PVP in mind to the point where you don't even need to really reload, you can just drop the gun and pick up a new one. And if you are playing offline all you need to do is find a axe and a saw, thats it. After that, you can play hoarding simulator. Older maps don't get updated with time and to make zombies more deadly they just make them bullet sponges, A4 to the head takes multiple shots and a car gets stopped and even pushed back if you try to run them over",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "literally my childhood game, but the creator is a hypocrite that doesn't care about the community, even though the community has kept the game alive with curated maps",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "As a former Unturned Player who played PEI to Elver, I'm going to leave a thumbs down on this. Why you ask? Because I've seen the drama and it's not great, Nelson Sexton.. \n\nFor years I've been patiently waiting for this game to be a middle ground between nostalgic times and improving the game performance so that it can run potato graphic pcs can still run the game..\n\nBut now, I see games rise and fall due to huge mistakes.. because some people are either power hungry greedy.. or manipulative mastermind sort of people.. or even an ahole.. \n\nEither way, I'm not going to wait anymore and leave this game for good, my hope for this game is all but lost to the abyss now..\n\nP.S: Thx so much for the OG Elver devs, they're the best.. the best of the best at story telling..",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "The game's developer Nelson is ignoring hard working creators while punishing the rest for years modders and map makers have built this game with sweat and passion, only have their work tossed apart.\n\nCreatos are getting blocked and their hardwork erased, while Nelson keep making changes helping his personal friends rather than the community.\n\nI feel that one reason is Nelson believes he's losing control over the design/creative process of Unturned and as such is seeking to regain control. Another reason could be that Nelson is worried about the personal/private activities of some of the developers and doesn't want it damaging the image of Unturned, himself, and SDG.\n\nI hope Nelson can come out himself and make things clear, rather than having his wife be a liason for the community \nthereforementioned example happened months ago, im not sure if it still stands). \n\nIf Nelson decides to go public about what he is expecting for the future of Unturned, reiterating and/or creating new expectations and guidelines for developers, with also a full explanation as to why a lot of maps and developers were suddenly removed, would help in rebuilding trust and interest in the game. \n\nIt is sad to see that Nelson, who left the Roblox platform in part due to unfair treatment of its developers, seems to be going towards the same direction with Unturned.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "You either die a hero or live long enough to see yourself become the villain. I've been playing this game since 2016. I hate the current state of it. This is not the unturned i would spend 4 days straight playing until exhaustion. Nelson Sexton is a shitty developer.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I used to really like this game and even if I do like some of the newer stuff they have done, it is so poorly optimized and has such massive load times and stability issues now that I just can't justify keeping it downloaded at this point nor recommend it",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I regret buying that gold package and funding Nelson's fatass, get out of here stalker there is nothing here for you",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Why did the devs add a mechanic in singleplayer which makes you lose all your items if you quit after dying?\nRidiculous waste of time after grinding for hours",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I got banned permanently because of battleye's anti cheat even though I never cheated, meanwhile i see motherfuckers with flying bicycles in RP servers. Fuck this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I appreciate that it was free, but it's honestly kinda trash. It doesn't really feel like the zombies even matter. They never move and barely do anything unless you just don't see them and there's just too much focus on PVP. To be honest, DayZ would definitely be a much better choice if this is your type of game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "overly complicated to play with a friend for no reason. should be able to just create a server from in game and just play with someone, like how most games are. i dont want to do extra shit just to play a game with a friend for an hour. playing by yourself is extremely boring and gets old fast.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "exit button doesn't work on mac, had to use force quit, uninstalled the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it didnt have to be this way...i love this game, but some of the devs and big names on this community, that have too much power, care too little about their game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "We're never getting the next game overhaul :(\ncurrent game version just isnt fun, its so janky and outdated.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game might as well be considered abandoned. Most \"Updates\" come in the form of announcements for workshop maps and cosmetic bundles for said map.\nThe last REAL update as of the time I'm writing this review was an unneeded revamp to crafting. \nI have fond memories of this game and would rather write a positive review, but the state of the game, and the community \nis in, I just can't. This game is a community run project, ran by a community that is a mess.\n\nUnturned II would be more than a tech demo by now had the dev continued working on it. \nMaybe he is working on it in silence, I'd like to hope so.\nPlease Nelson, get it together.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "game keeps crashing, keeps validating some random shits all the time, loading forever and on top of that it cant be uninstalled",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has become horrible. Nelson has ruined everything. The servers list, the iconic crafting system and more. The servers are a mess now, with only 10x/100x servers and p2w rp. Not worth playing too much anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no longer a good game , same for the community , whoever reading this dont bother playing it",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is the game I grew up with. I remeber the august mornings during the weekends, I had soccer practice and I really didn't give a flying fuck about soccer, all I wanted to do was go back home and play this new game I found called unturned. I remeber the first time playing unturned, I was crouching around Seattle during the night, figuring out how to use a mic and asking if anyone was around me before getting scared and logging off. Throughout the years I've hopped on this game on and off, even got my mom into it a little and got her a gold upgrade as a mothers day gift when I was 8 lol. Man I miss those days when Unturned was more of a survival game than a pvp game with a hunger and thirst system that doesn't even matter anymore because people are too scared to go over easy mode. I wish this game would bring an update with some good survival mechanics but until then I have to give my favorite game of all time a no on recommendations.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i couldnt leave the game because it dosent let you for a while after opening the menu",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played it back in 2015. It was fun. Picked it up today. Since those ten years there's been pretty much no new content apart from maps that have been made by the community. As far as I'm aware the dev(s) doesn't/don't add much if anything new from themselves. Just one of those PvPvE games which turned out quite meh. Also it's 2025 and the game still doesn't host servers through Steam. Gotta set up your own dedicated server which isn't difficult, just a bit ass and clunky.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Download when your 15 and dont have any money type game. Seriously, What do you expect? It's video game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a ok game i guess, but it can be better.\nfor those who want to buy though, just save money for dayz, even though this is free.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "one of the worst games i have ever had the displeasure of playing. it punishes you for everything you do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was going to post a good review, but an this program is trash, the graphics I could have accepted, its what is shown, but the user interface and the crafting menus are just a total mess, I have to craft a table, but searching for the crafting recipie or ingredients required is all over the place. tried to find the stupid blowtorch recipie a tool you need to make another station....why do I have to search for it everywhere and still not find it, I click the tabs for tool and it gives me things besides tools.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is great but one shit mechanic, i died and 70% of my stuff despawned, it would be better if the game allowed me to hold shift and click so i can retrieve most of my stuff and the stupid bed glitched out so when i spawn home it spawned me a kilometer away from the bed, fucking developer get your head in the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is only alive because of the community, and the map they make. Official updates and content to the game is barely made nowadays, and any new update don't really improve upon the game's enjoyability. The game is also poorly optimized, the game randomly freezing sometimes for no reason at all. It also does not help that this game has predatory lootbox mechanics as seen in games like CSGO.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible game, singleplayer or multi, public servers are toxic. do NOT waste your time on this like me and my friend did.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game unfortunately has lost it's purpose. To provide a platform of impartiality. Instead, this has become the demon it swore to defend, meanwhile other games are capitalizing on that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's time to let this game go.\r\n\r\nas of 2025, this game is gustavo fring lospolloshermanos disapproved.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As a vetern of 4-5 years and after returning to the game i am very upset to see what this game has come to nothing new I have to get mods just for something existing, idk why but i dont think the actually dev does anything anymore for the game which is sad, i hope to see this game return to its former glory and as someone who doesnt typically like leaving reviews just refund the games that annoy me or just suck but as this is a free to play MY FINAL WORDS \"This Game dukey now if i could i would refund it and to those that would play this game just play a actual good game like zomboid\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I Installed the Game beacuse it looked intresting. I booted up the game, i clicked play and it made me install a map that took half an hour to install. After that there was a loading screen that took 5 minuets to load, when i finally loaded in my game was laggy then crashed, Would not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3/10 Just a generic pvp game. This game has nothing to do with zombies.\r\n\r\nPros:\r\n\r\n-PVP \r\n-Mod Support\r\n-Easy Multiplayer\r\n-Smooth controls\r\n\r\nCons:\r\n\r\n-PVE. The zombies become trivially easy in the first 5 minutes.\r\n-Loot progression. You can have the best loot in the game in 5 minutes because military areas aren't any harder than regular areas.\r\n-Weak survival mechanics. You have infinite food and water and heals very easily\r\n-No endgame or difficult challenges",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no good support for servers with friends. total cheeks if you have friends. really fun if youre lonely",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is rust/state of decay but better. Despite the fact that it is better, it is still the same type of game, so it sucks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am quitting UNTURNED because it's a ridiculous system. Nelson Sexton does whatever he can do to help his favorite players and curated developers. Neglecting his community and his game. Being the first ever game ive owned and played on steam with my friends, Nelson Sexton has let down me and his community with his actions and has proven himself incompetent at game design and as a leader of a community. It DOES NOT seem worth it to me and many others to continue to play or make content for this game any longer, especially if the game developer will eventually steal curated content, claim it as his own, and everyone will fall for it.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}