{
  "positive": [
    {
      "review": "Ignore my steam hours played - I owned this game since very early access via the Microsoft store, back when it was a very basic (and yet already brilliant) walking survival sim and only mystery lake in a basic form existed. Every year I spend HOURS surviving in the wilderness playing over, and over again. It's the best survival game, the tensions of will i get caught in a storm, what if there is a wolf around the next corner, where can i find shelter to start a fire and warm up are what make this game great, it truly feels like real survival and real (gentle) anxiety over how to manage. Honestly it's brilliant. I think we've easily been playing it as a household for 10+ years and I think i'll always bring it out for wintertime, though I now know the maps too well and it's perhaps a little less tension building when i can find my way around in a white-out. \r\nThis steam version was purchased recently so that, using a mod, my husband and I can multiplayer the game something we've always wanted. (which is less good than solo survival due to the mod hiccups but better than waiting for blackfrost to launch)\r\nWe love this so much that blackfrost (TLD2) will be a day one purchase. \r\n\r\nIf you like survival games, this is the best one out there. If you like wintery games for some seasonal immersion, this is the game. From a tiny start up idea such a wonderful game (and add ons) has grown! Really worth it.\r\n*I dont know why steam has wintermute separate to the main game, but my microsoft version has them combined (perks of early access purchase i guess!) it's an enjoyable dlc (second draft with the passenger plane much better than when they first released it) but the base game is where the gold and hundreds of hours to sink lies.*",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "The maps are enormous. The more you play, the more you discover how to use resources intelligently, learning to build caches and storage areas. There's so much to explore. I only play in survival mode, and the sole objective is to survive as long as possible without a time limit. It's great for learning skills one by one and discovering all the possibilities. I've played 33 hours so far and have only completed two maps, the easiest ones. This world is huge. The reality of survival is impressive and makes the game more challenging. You can die from illness, injury, cold, fatigue, dehydration, or hunger. The more you carry, the heavier you are, increasing your risk of injury and making you tire quickly. You must cook meat and boil water to avoid getting sick. There are antibiotics, painkillers, disinfectants, and so on. It's impossible to make a fire if the wind is too strong, and being in a blizzard kills quickly. Animals can attack you and you can hunt them for their skin and meat.   If you like realistic survival games without zombies or anything like that, this is the perfect game in my opinion.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "A quiet survival masterpiece!\n\nAfter 480+ hours over 5 years, The Long Dark still amazes me. It’s not about action or chaos — it’s about solitude, survival, and the beauty of small victories.\n\nEvery sound, every decision, every flicker of warmth matters. You don’t just survive; you learn and adapt.\n\nI’ve faced wolves, blizzards, starvation — and somehow, I keep coming back. The atmosphere, tension, and sense of accomplishment are unmatched.\n\nIf you enjoy thoughtful, immersive survival where every mistake teaches you something new, The Long Dark is one of the best experiences out there.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "Game can be either a cozy game or a horror game depending on your difficulty, actions, or the environments will.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I think it's really good! If you prefer elemental survival over wilderness (bc ur scared like me) then you can use custom mode to make it a comfortable yet still challenging game! Really creative and interesting to discover areas when going in blind",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "A great game that I always return to, especially when the weather gets colder outside. The aurora and weather model in this game is outstanding -- like a glorious painting.\n\nLong Dark has a great and engaging Story Mode and an even better Survival Mode. It can be as challenging as you like it -- hardcore survival or walk in the park. I can't wait to see how the story ends in Episode 5!\n\nAnd always remember, fellow survivors: Overconfidence is the a quickest way to death.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Can easily walk through the snowy landscapes until I realize I've already been playing for 5 hours, just because this game pulls you in so much. Love it.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Кайфовая игра! Очень атмосферная, просто погружаешься в этот мир и начинаешь выживать. Жду продолжения.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I've been following this game since it was first released, and even wrote an article for it on Tumblr waaaay way back to help get it some traction. The game has changed so much since that playthrough I did for the article - in the best possible way. You can tell that the devs care so much about this game and the experience you as a player will have. It is extremely in depth and addictive, and there is always a challenge to test yourself with. I enjoy walking around and coming up with a plan that I can achieve within the day, whether it be looting, hunting, fishing, waiting out storms, creating a base, or trying to travel to another location that will have more lucrative items I need. I highly recommend this game -- you can tell the devs care about it, and it's community cares about it too. 11/10 game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my favourite games ever made. Super challenging and unforgiving with ever evolving new goals to give yourself. Beautiful environments and a unique style with brilliantly done environmental storytelling. A lonely, difficult and strangely cozy game that I find myself returning to again and again over the years.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very nice, I discovered this game right after reading The Call of The Wild and To Build a Fire, where this game give all that you need to live your own story.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A journey you would never forget, coming back again and again to spend a night or two in a cozy abandoned cabin trying to stay alive among merciless snow storms and wildlife. Worth your attention and time 100%.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was an earlier player in the development cycle and this game has come a long way. If you pay full price, you'll definitely get your monies worth. Play Wintermute story mode first because it is like a tutorial and lore drop for the survival mode. Most of your play will be in Survival mode.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "i highly recommend The long dark if you enjoy Survival games. its a lot of fun. only thing i wish it had was sights/scopes for the hunting rifles i am so bad at aiming lmao",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great story and great survival. Watercolor like visual, very pleasing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As survival games go (PVE), The Long Dark is one of the best that I've played.  The graphics are very good, and the ability to change the difficulty settings gives you a game that you can return to again and again.  I'd highly recommend it for the \"replayability\" alone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has been one of my favorites for years. The updates and content added does take time...however this is a truly unique game of this genre. No one does survival horror quite like this and I'm excited for Long Dark 2 to come out so I can play with my friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the most relaxing and also the most nerve-wracking game.  It boils everything down to one thing.  Just survive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a cool, slightly depressive survival game, a valid amount of mechanics, a lot to explore, some stuff to master (throwing rocks at bunnies), DLC not needed to enjoy, 8/10 all in all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Since the first beginning I am in love with this game. One of the best survival games ever made...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "simulator for hunting down wolves and eating ketchup chips\n\n11/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great survival game if you enjoy exploring and setting your own goals. I like how there's actual considerations like wet clothing making you colder and not every attempt to repair items or start fires is successful. Play on the lowest setting if you want to avoid danger from animals.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Long Dark is my favourite game in so many ways. As humans, who mostly live in our protected cities, the wilderness is where we reconnect with the food chain. We are vulnerable, we are fragile, and we are determined to survive anyway. TLD gets to that visceral place, placing us in an environment that doesn't care if we live or die. \n\nI've been playing a single TLD save now for more that 1,250 game days. I am immersed in the world. I've even expanded my play to explore the game beyond the sandbox (see my guide 'Backcountry Hikes in The Long Dark')\n\nI also live in Vancouver, Canada, so I recognize the plants, the animals, the fish, and some of the buildings. The Canadian identity in the game is always present and celebrated, showcasing mukluks to canned peaches (iykyk).\n\nAfter 12 years, it truly is a labour of love — and I, for one, love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is THE GREATEST survival game off all time in my opinion. I highly recommend it to everyone, because its such an amazing game and its replayabilty is of the charts. the learning curve is a little steap with this one though. One moment your fine and then you get a little gready to loot one more car and then your stuck out in a blizzard freezing to death or you get jumped by a wolf or die by one of the other various means this game has. your not the main character of this game (not inculding wintermute mode), you are just striving to last one more day in this crushing cold. amazing game, fantastic story, super great community and i cant wait tell Ep 5!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best survival games around, if not the best. I find myself coming back to it at least once a year and I still haven't fully explored all the regions. The only negative aspect of the game that I can think of is that progress towards in-game feats doesn't work when using custom settings. However, there are mods available to resolve this issue.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the pinical of survival games I have only played so many hours and yet there is much to learn for me. There is only a certain feeling you get when its late at night and a wolf pack jumps out at you with only your weapon to help you survive. The map is MASSIVE with a lot to do, although its fun it can be a walking sim at times. If you like starting from almost nothing and exploring your way in great bear island this game is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For all of those complaining, the game has been in active development for many years now. It has received numerous updates and additional content in that time, while also being heavily discounted multiple times. They've only now charged for the DLC, which improves the main survival mode in many ways, and that's still an amazing value for the price.\n\nI really like the game and what the studio stands for, also can't wait for EP5 and Blackfrost, whenever both'll be ready.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is compelling, and even the sandbox (survival) style is actually interesting. There's a small learning curve but there's an aspect of this game that is engaging to every sort of player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game in December 2014, back when it was still in Early Access. I may not be one of the backers, but I've been here for this whole, long journey. It's been amazing and an absolute privilege to get to witness the dev team get the funding and support to expand this project to something that is now multitudes larger than it was ever intended to be.\n\nI want to express [i]so[/i] much love and appreciation for the developers for sticking with it this whole time, even when the means to do so may have been stretched thin.\n\nI await the last episode in this long saga with great anticipation, and continue to look forward to future stories you make!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "重温经典，优化比以往好多了，推荐喜欢沉浸式探索生存的玩家游玩awa",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I generally play this in an edited survival setting so it's more of a cozy game than the original borderline horror. I can die, but there aren't wolves howling at me across the map every time I enter a new zone. There's enough food that I won't die of starvation in the first day, but I do need to pay attention to what I'm carrying and where I stay for longer periods. \n\nThe maps are giant and the art is pretty lovely, everything's mostly realistic including the sounds of the wind rattling the doors and windows, or the occasional bird flying past.\n\nOverall, I really like it. I've played on higher settings, gotten a few of the achievements, but there's always something new to find, or a new location I haven't gotten to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What can i say about The Long Dark. \n\nWell the name says a lot. \n\nBut more important, you will not find a more imersive experience. The kind folks at Hinterland Studio absolutly knows what they are doing. A Masterpiece none the less.\n\nI have playede many great games in my time. Nothing compares to the Long Dark. its hard to describe why tracking miles on miles on miles in deep snow while getting stalked by 4 leged creatures is so absolutly amazing. But it is.\n\nGo buy, any price. 15/10. \n\nAlthoug do not be fond of spare time, it will eat it up and its great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing this game since early access and I can honestly say that it is still one of my all time favourite games. It is the one that I recommend any time someone asks me for my favourite game. It's the game I always come back to when I want to relax. As a winter lover, this is the perfect game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every frame is a painting. This game has such good art style and it good game to chill with on lower difficulty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had a good run with this game on PS4. Replaying the story mode again in preparation for Chapter 5. Has a lot of potential to be replayed, and I am excited to see what Blackfrost will bring to the Long Dark franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game much more play time on xbox than steam but ive played for at least a couple hundred hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☑ Potato\r\n☐ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☑ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☑ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☑ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Long Dark is one of the most atmospheric and emotional survival games ever made — not because of jump scares or nonstop action, but because the world itself quietly tries to kill you. There are no zombies, no mutants, no enemies beyond wildlife and the cold. It’s just you, silence, and the constant need to make smart choices if you want to see another sunrise.\n\nWhat makes it stand out is how grounded it feels. Every decision matters: how much food you carry, whether you risk traveling during a blizzard, if you should light a fire now or save the matches for later. The game forces patience and respect for nature, and the slower pace actually becomes one of its strengths — every success feels earned, and every mistake can be fatal.\n\nThe art style is beautiful in a minimalistic, hand-painted way, and the sound design — distant winds, cracking ice, and the terrifying howl of a wolf — creates a lonely but immersive atmosphere. Story mode has emotional weight and strong characters, while survival mode is a pure open sandbox where every run feels different.\n\nThe game isn’t about power fantasies — it’s about endurance, awareness, and learning from failure. Sometimes the harshness can feel unforgiving, but that’s exactly what makes surviving even a single night feel meaningful.\n\nIf you enjoy slow, thoughtful survival experiences that reward planning, immersion, and patience, The Long Dark is an unforgettable journey — harsh, beautiful, and one of the best pure survival games ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a visually appealing game, truly beautiful. You can create a nice, exploring atmosphere or you can create a hard survival game. I've had this game for years, and it's still one of my favorites.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An immersive, authentic survival experience. Well thought out gameplay and pleasing art style. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is not a game but a masterpiece of artwork. Beautiful, mesmerizing. Made with the heart as much as with the brain. The graphics, the sound... The reality of the nature... The sublimity of suffering... The aurora night, oh man, indescribable!\r\nThe only one thing (damn, always that \"only one thing\") is missing so badly: the support for VR! I can't even imagine what that would feel like!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I always come back to this game... until I die eventually and quit for a while.^^ It's a rogue-like survival game after all. (But now it has a \"cheat death\" option that gives you three extra lifes... at a staggering cost however.) What I like:\r\n- endless exploration of a vast, complex world with hidden secrets and stories that makes you feel tiny in it\r\n- beautifully atmospheric graphic and sound design\r\n- suspenseful progression - will you make it out alive? ...eventually you stabilize your run, but harsh late-game regions still test your skills\r\n- the struggle against unforgiving nature in survival mode - one misjudgement or foolish mistake might seal your fate\r\n- no other humans in survival mode - no one shoots at you or tries to raid you!\r\nWhat I don't like:\r\n- It's quite a walking simulator after all with little possibility to speed up travel. Would be more cool if there was some speed-travel option inside already explored areas of the map...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a unique experience that no other game was able to show me up to this point. The feeling of being left alone without any helping hands or anything to guide you is amazing. Probably goes in my personal top 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have many hours more when this game was on Game Preview on XBOX and let me say that I appreciate the effort of Hinterlands' studio to support a 10+ year old game. It's a game I can fall back on when I have nothing else to play and want to take a break from other fast paced games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Phenomenal, terrifying, and so, so cold. Everyday I wish I could experience this game for the first time. There's no zombies, no monsters, no big threat hunting you, just this ever-present lingering danger of survival in the arctic and the wild animals lurking nearby. Not to mention, holy shit it's cold in here and there are dead bodies a-plenty. This world hates any and all sources of warmth and comfort, especially at harder difficulties, but you can change that and have a pleasant time scavenging and rummaging like a human sized raccoon. Truly a wonderful experience, great to pick up and play even if it's not on sale. Game Studio 10/10, Art Design 10/10, Audio Design 10/10, Story 10/10, Gameplay 10/10. One of the best games on steam hands down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the long dark for the gameplay and especially the story mode.\r\nIts not a master piece and walking all day could be boring but I've been here since episode 3 and so far its great!\r\nWhile Hinterlands schedule probably could have been better, from the dlc, sequel and episode 5. \r\nbut im a patient man, and i understand that the Hinterland team is working hard on episode 5 and i'm happily await for any content the team provides.\r\nIf you love survival games that are slow, quiet and calming with moments of intense danger and crafting your own story, then this game is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of the best games I've ever played, and that's not something I'd say lightly about any game I like (also worth noting most of my playtime is on the PlayStation version)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a great play for most play styles. If you like combat, go fight wolves; If you like decorating you can collect objects and furniture and decorate your house(s). I love the survival mechanics and how you can store things in your house and they won't despawn. I can understand the critics, but overall really great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game amazing story overall fantastic. this is a game i will always come back to 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Long Dark is a uniquely atmospheric survival experience that stands out through its simplicity, realism, and emotional depth. Unlike many survival games focused on combat or constant action, The Long Dark embraces quiet tension. It places you alone in the frozen Canadian wilderness, where your greatest enemies are not monsters or other players, but the cold, hunger, and the relentless passage of time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful visuals like an oil painting. Sunsets and sunrises are all the more scenic!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After all these years I still return to do a cold infused run in the Canadian winter every once in a while and always get reminded why this game still remains as one of my favorites. \n\nAlso, I think this is the only game that has made me yell at a campfire. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great survival, was supporting since early ages and EA days, happy to see this game grow into this\nPlay, survive, repeat\n\nReally happy for developer & publisher :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quack Quack\n\nI've been playing this game over the years and seeing all the new ways to tweak and add to the gameplay. This is THE winter survival game and if you're ready to sink 10s of 100s of hours into a game that will have you sitting at your PC at 2 a.m. on a rainy/cold morning, drinking coffee and wracking your brain for when you should take a risk, This game will have that. \nArt - Gorgeous and Simple.\nGameplay - Easy to handle but tough and calculating to master.\nWays to play - Quite a few depending on the routes you want to take and how uniquely you want to challenge yourself.\nStory - There is an entire separate story mode that is attached as well.\nDLC - Worth every penny.\n\nCan't wait for The Long Dark 2 (Blackfrost), It's just gonna keep getting better and better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best survival game you could play, take your time, write things, remember the landmarks, learn to shoot the bow and learn to recognize when a blizzard is coming and you'll be fine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok so this might sound a LITTLE crazy but this is genuinely the BEST game that I have ever played, it has gotten me through hard times and through many years of my life. I have been following this games development since the beginning in 2014 and I knew that it would become a great game. The graphics make the game look like everything is painted with water colors, the sound design is exquisite, don't even get me started on the MUSIC. \nThe story mode is INCREADIBLE and the world is so interesting to learn and speculate about. If you are considering getting this game, I highly endorse it, it does not matter if you play on the easiest difficulty or if you challenge yourself with Interloper or Misery difficulties, what matters is you enjoying freezing to death while being chased by 3 wolves and a very hungry bear, and even if you die, every death is a learning experience. The community around this game has also been one of the best ive ever experienced. Hinterland, my heart goes out to the entire team, thank you for all of the great work that you have done over these 11 years (and counting!)\n\nTLDR: PLAY THE GAME!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is a genuine masterpiece of the survival genre, and manages to somehow find that perfect balance where you never reach a point that is truely \"secure\" but the loop of sustaining yourself never becomes overly tedious. many other games that strive for a fun survival experience, tend to reach a tipping point where survival is no longer difficult, like Subnautica and The Forrest, while others that push for a more difficult and realistic survival experience can quickly become tedious and boring, like Project Zomboid. The Long Dark (and its expansion) surpass this challenge and creates a very difficult, but always fun survival experience. I cannot recommend it enough, and cannot wait for the sequel!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think the gaming world was missing a title like The Long Dark, especially with its four-chapter story mode. I literally got lost in this world — not only in the survival aspect, but also in its beautiful graphics and scenery. I know it’s hard to relax while playing a survival game, but somehow this one actually lets you do it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've spent many hours over the years enjoying this game's singular artistic style, atmosphere, and environment as I play through the story. I love that I'm able to multitask in real life while walking the long stretches in this game. I look forward to further chapters and seeing how the story wraps up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't usually play games like these, but this one caught my eye on a sale. Surprisingly relaxing, I like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started playing this game early and have always loved it. Easily one of the most terrifying games I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, good ambiance. can't wait for wintermute to be completed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not many games make me cry, this game definitely did. It wasn't even during a major plot point, I was simply traveling in Pleasant Valley, and every step that got me closer to the next safe space with a fire made my eyes produce more tears of joy. \n\nIt's truly peak survival bliss.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hella depressing game to play, but very good! Difficult too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend survival mode w/ Tales From The Far Territory. It's hard, rewarding, and really enjoyable if you're looking for this type of game (survive the environment, not players)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game it's gotten way better since 2016 \"Walking sim\" is just a hater statement",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've really enjoyed this game. I pick it up every few months a play through the story mode. I also enjoyed the survival mode. I'm excited for the final chapter to be released for the main story. Thank you for continuing to work on the story!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this every year in winter for the last seven or eight years. So many great memories and it is still getting better every year",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Elegy\"\r\nDo you remember? the steady thrum of the city’s heartbeat.\r\nTechnology, the always pumping lifeblood of a thousand, now dead industries.\r\nIndustry, now a wrecked husk on a long forgotten shore.\r\nDo you remember the sky?\r\nAlight with beautiful fire.\r\nA sky so bright you forgot the stars even existed.\r\nBut the stars, they didn’t forget us.\r\nWhat kind of survivor were you?\r\nDid you walk the expanse of nature, and feel the wind burning your soul?\r\nDid it remind you of who you were?\r\nDid it shape you?\r\nDid it break you?\r\nHow did you keep breathing after it took everything you knew and loved?\r\nDid you survive with compassion?\r\nDid you remember truth in humanity?\r\nDid you survive for yourself alone?\r\nDid you revel in the solitude?\r\nDid you hunger for a connection?\r\nDid you seek out others and could you save them? Could you save yourself?\r\nDid you hold onto the promises of old men after their fires died out?\r\nDid you hear their voices echo in your head, as you face the wrath of the nature that they’d ignored? Unleashed?\r\nDid you settle into the silence?\r\nDid you crawl into it, whimpering?\r\nDid it crush you?\r\nDid you embrace it?\r\nDid you remember the power you could summon?\r\nIt flowed through the wires, a ghost in the machine,\r\nA Trojan horse, our glory, our servant, our doom.\r\nDid you stare at the sun, the moon, the wind, your constant companion?\r\nDo you remember yesterday?\r\nWhat is tomorrow?\r\nHow will you face this quiet apocalypse?\r\nWhere were you when the lights went out?\r\nHow far will you go to survive?\r\nThe Long Dark...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am quite happy to have been part of the journey this company has gone through with the development of this game. It is extremely immersive both in it's story and survival modes. The difficulties are fair and unforgiving. The environment is wonderfully beautiful and along with the game's soundtrack, are just a couple reason's to go back and play this game. \r\n\r\nI am extremely excited for Blackfrost: The Long Dark 2, and to see where they take their franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest realistic survival game out as of today. \nRecommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Art Style is unique and can create many beautiful vistas. \nSurvival aspect is pretty fun, and can be grueling at sometimes.\nI think the game is excellent, however like \"SaidNextOne\" said, the developers have been lacking. Hopefully they actually properly finish the game before moving on.\n\nI'll give it a recommended because the game is great, but a be cautious, because of the developers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely an amazing survival game brutal and beautiful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought this game no long after release, I'm still struggling to find a game this inmersive. Also huge shout out to the developers who kept adding content to this game through all this years. Definitely give it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm absolutely in love with The Long Dark and have been since 2015. I would recommend this game, as it is a search for your own survival in the cold wilderness of Great Bear and beyond.\nI started out very scared of the dark, of wolves, and so on, but through learning all the different mechanics in this game through years (and years to come), I must say I'm still scared of those things but I've found the will to pick up what I need for a journey and brave through the snowstorms to find what I need to survive just a little longer.\nI started playing the story first (which I recommend to do if you are playing for the first time), just to get familiar with all those mechanics. Survival mode is fun but very much u unpredictable. Going through the story helped me a lot through countless deaths (and even more so in survival mode).\nThe story is almost finished, after all these years, and I'm looking forward to seeing it (where I'll probably start from the beginning just to get to the ending again). This game has been updated for years, and I could not be more grateful. However, it's the end of the year now, I really hope to still see it get updated this year, or at least see a log of when the developers think they might release, would let me wait more patiently than I have been lately.\nDespite that, I would totally recommend this game as it has tons of replay-ability. Yes, it may not seem like it has much of a goal, but the goal to just survive is hard enough I can assure you. It will keep you busy, cold and hoping for a fireplace in an abandoned cottage where you can heat up some soup before you freeze to death (yet again).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a 10/10 and stands above all as the most hardcore survival game I've ever played. If you're a plan of rogue-likes, open world, and survival, wishlist it.\r\n\r\n\r\n\r\n\r\nImagine if there was pvp tho 0.0 that would be sick, right?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best atmospheric survival games, I have ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another indie game of my childhood. Got the game and died ten times over the course of dozen days in total. \r\nA demonic bear chased me over the course of all those runs. Until i genuinely started hunting him with real life hunting tactics. Finally got the ol reliable rifle and shot the monster, broke the curse and felt free...\r\nFor about 20 days and another came, shot him, another took his place. \r\nThis a hopeless endless journey that will make you love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is great.\nThe developers promised to release Episode 5 back in 2023, but it has been delayed about five times and still isn’t out. Meanwhile, they released a $20 DLC and even announced a sequel, yet the main game has remained unfinished for nearly eight years since its Steam release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hardcore survival game. An invisible enemy will haunt you at all times... the cold.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game…\nI remember watching youube videos of it back in 2017-2020... those were good times. I still miss that era, but the game itself is still peak. Timeless fun, and it hits just as hard now as it did back then.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The greatest survival game ever made.  Tried everything else; keep coming back.  Hinterland FTW.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's one of those games that at first feels brutal, especially at higher difficulties. But once you get the hang of its mechanics, you realize it's a game you can just chill and get lost in the world. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game but please release the episode 5 of the wintermute. I can't fully enjoyed the game when the final episode is not playable!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Long Dark offers a hauntingly immersive survival experience. I loved its unforgiving difficulty, isolated atmosphere, and the subtle Aurora mystery threaded through the world. I haven’t played much yet, but every session felt gripping—and I’m definitely looking forward to returning to its cold, captivating wilderness.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100/10 My Youtube playlist Rickrolled me at the same exact time I got mauled by a bear. interesting experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "even now the atmosphere of this game is stunning. just taking the game slow and stopping too take in the scenery. the games style has made it timeless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game if you enjoy post apocalyptic survival and scavenging games. Good game to play to disconnect from society focusing solely on survival in a harsh environment Recommend heavily if you are a fan of nature, hunting, survival in the wild and harsh environment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every time I come back to the Long Dark I am once again impressed by how beautiful and eerie the game feels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Long Dark is one of those rare survival games that feels both meditative and merciless. From the moment the plane crashes in the frozen Canadian wilderness, the experience grips the player with its quiet intensity. The gameplay focuses on realism rather than fast-paced action—there are no zombies or over-the-top weapons here. Instead, survival depends on managing body temperature, calorie intake, fatigue, and resource scarcity. Every decision, from when to light a fire to whether to risk crossing a frozen lake, feels crucial.\n\nVisually, the game is stunning. The art style combines painterly environments with minimalist textures, creating an atmosphere that feels both harsh and beautiful. Snow-covered forests, abandoned cabins, and distant mountain ranges are rendered with striking simplicity. The soundscape complements this perfectly—gentle gusts of wind, the crunch of snow underfoot, and the distant howl of wolves all deepen the sense of isolation.\n\nThe storyline, especially in the episodic Wintermute campaign, adds emotional depth to the survival experience. It follows characters driven by loss, hope, and resilience, blending personal drama with environmental storytelling. Even in Sandbox mode, the world tells countless subtle stories through notes, remnants, and locations left behind.\n\nOverall, The Long Dark blends survival mechanics with a hauntingly realistic portrayal of nature’s indifference and human endurance. It’s a game that rewards patience, reflection, and careful thought—a truly immersive testament to the beauty and brutality of the north.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still waiting for the second season to come out for co-op. The background music is extremely atmospheric, a pretty much immersive objective-based game can always get a strong sense of reality that is perfect. The most difficult part is to remember the direction and locations. I would recommend to come out with maps in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "even tough it's not perfect, this game has (re)created a passion for meditative games and i'm now taking it from the completionist angle",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As it stands, an excellent game that can provide many hours of entertainment, even if the main story line isn't complete.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My all-time favorite. Definetly not for everyone, but I personnaly always come back to it. \nI have spent lives in this hell and I'll never get enough. It's a punishing, raw and stunning experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hmmm...what to say about this game. \n\nFirst played this game around 2015 and my first impressions were that I loved what I was seeing. Now with over 500+ hours and 100% of the achievements I can safely say this is one of the best games I have played. Not many can top this little gem and with Long Dark 2 on the way. Things are only going to get better.\n\nI put my trust in the Hinterlands crew since they seem to know what they are doing and know what people want. \nIf only I could give this more then a positive review if I could. \n\nNow it's time for me to go back to my favourite winter Apocalypse game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, super underrated. The only thing i don't like is not being able to jump but that's not a huge deal for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall its a fun and challenging game with a nice setting that gets a bit eerie at times. The story mode is pretty good, though there's not a ton of content and new releases are taking a long time. Survival mode is a lot of fun as well and probably where you will get the most playtime out of. My main issue is that it doesn't really force you to explore every region unless you can survive for a long time which is harder than it should be for silly reasons like dying to hunger or thirst while sleeping or chopping wood. Realistically you can survive days without water and weeks without food so forcing players to eat or drink before doing simple tasks is a bit tedious and aggravating if you aren't paying close attention especially when you have food or water in your pack. I'd still recommend the game, you just need to pay close attention to a lot of small details and always watch for wildlife. If you like that sort of challenge though this will be right up your alley.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game tests your limits at every turn. You're constantly on edge, and even the coolest loot won't save you from danger. TFTFT has become even more exciting with the addition of new dangers and diseases. 8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most interesting, detailed survival game ever. Love the developers for creating such a game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I cant comment on the story, I've only played sandbox and I cant fault it.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "God knows, I loved — and still love — this game. It’s a peculiar one: slow-paced, sometimes illogical from a realistic point of view, but it creates a world and atmosphere of its own.\nYet the further things go, the more the developers distance themselves from the players. The game is technically still unfinished. Players have been waiting for the final episode of the story for more than four years now.\n\nWhat are the developers doing?\nThey’ve split the sandbox and the story into two separate games. They release paid DLC. Yes, not immediately, yes, with delays — but still, they release it. They’ve even announced a sequel. But they haven’t finished the story.\n\nOriginally posted by HiddenBlade:\nEpisodes 1 & 2: 8/1/2017 (1.0 Launch)\nEpisode 3: 10/22/2019 (2 years, 2 months, 22 days)\nEpisode 4: 10/6/2021 (1 year, 11 months, 20 days)\nDev Diaries:\n~4/22: E5 in 2023\n~10/22: E5 in late 2023\n~5/23: \"[not] this year\"\n~11/23: \"It'll ship in 2024\"\n~12/23: \"late 2024\"\n~10/24: \"We haven't announced a release date yet\"\n~4/25: \"end of 2025\"\nCurrent date: 11/12/2025 (4 years, 37 days since Episode 4; 49 days till 2026) \n\nNaturally, that frustrates the players. The players start asking questions. They start reminding the developers of their unfulfilled promises.\nAnd what do the developers do? First, they stop posting specific release dates so that no one can hold them to their word. Then they start heavily moderating the forum, deleting comments that criticize their inaction, and banning players who post them.\nEventually, they just stop saying anything at all.\n\nWell then — good luck to them!",
      "voted_up": false,
      "votes_helpful": 263
    },
    {
      "review": "Truely I love this game but it seems like the developers dont care about their players.\n\nI bought this game years back when it first came to early access. I had been so excited and impressed by it. Then the waiting came. Waiting years for episode 1 and 2 to come out. Waiting years for eps 3. Waiting years for eps 4. And unfortunately most of owning this game is just waiting. I could understand a game taking up to 5 years to complete maybe, but this is just disrespectful to everyone that has spent money on the game. We dont need visual boosts that wont be noticed much by most players. We dont need every little area and word in the game to be perfect. Ive played the episodes so much that ive gotten tired and bored of them while waiting for the next one.\n\nThis game came out in 2017, if it takes you a DECADE to finish your game then you shouldnt have started it in the first place. Or, at least, made the game smaller. I've waited 8 years for Episode 5 and I can say without a doubt that NOTHING in the episode will justify waiting that long to finish this damn game. Stop sending your programmers to work on two other games and just focus on the one you promised your players 8 years ago.",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "I start the game, get to a village with a church, community center, market, houses, transportation, but nowhere is there a knife, axe, saw, etc. There's nothing to live in a place like this. How is that possible? It seems to me that the developers have strayed far from reality in order to complicate the gaming experience.\n\nI live in the city, but even I have a bunch of knives, a few axes, and lots of hacksaws. Everyone does. If I were to leave my home, I definitely wouldn't take everything with me, just like everyone else. I'll say it again, I live in the city. And here in the whole village, there are only drinks in aluminum cans. That's nonsense, not reality. It's some kind of unhealthy gamer reality—the whole village living on chips and soda.\n\nThe game is billed as a survival game, but it's empty. Instead of tools where they logically belong, and I got there, you're stuffed with junk to make it slower for you to move around the map. You'll be fighting not what you were expecting, but the developers who decided to take the easy way out. Slow down with this, slow down with that, and it seems like time has already passed, the purchase was probably not in vain, and you are formally surviving.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I was going to write a very long review about this game to avoid just saying \"It's bad\", but I'll shorten it.\n\nThe Long Dark is a great game similar to project zomboid where you survive until the inevitable, but I didn't really have fun in it because of how repetitive the gameplay loop is (refill your sleep, hunger etc) after it got drained in 2 minutes of sprinting for some reason. It is also not a story game, the story has to be purchased as a DLC.\n\nIt's great if you just want  a game to relax, but it's hard to do so when a lot of illogical things make the game harder than it should be (not being able to sleep without a mattress, the character not climbing slopes higher than 45 degrees, NO JUMPING, wolves running away when scared then 100% coming back until they get you next time, and my personal favorite and cause of end of my 30Hrs game, bears not dying after taking 4 pistol shots to the head and coming back like wolves 3 TIMES). The character also feels like a bag of potato that can't move any faster than walking speed without tanking through the energy stat like crazy.\n\nI usually don't put negative reviews on games unless I wish I hadn't bought them and unfortunately, although I had my share of fun on this game, it got too repetitive and I felt like I did everything there was to do after a few hours. I'm using this review as a warning, make sure it is the type of game you like. The Long Dark is absolutely not a bad game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Yes, this game is a work of art, but it absolutely, 100%, in every way, will disrespect your time and then gaslight you. \n\nI have put 150 hours into the game, which is saying something - time slips away because every decision matters. That should be a good thing, but, when you discover how your time investment of 100 hrs here, 50 hrs there, can be permanently lost in an instant because of the deliberately confusing and ambiguous UI design, you'll feel betrayed. Shame on the developers.\n\nMyself and others have lost 100+ hr runs because of the UI design. The UI does NOT inform you of what kinds of afflictions/debuffs that you have, even imminently lethal ones. This information is hidden inside of the menus. So, unless you remember to deliberately make the choice to open the menu to find out whether or not you might be dying (yes, even when your health bar is completely full, you can die in a single mouse click), it's on you to decide to access the menu or not, in order to discover that you're in danger of losing everything. Yes, the UI does not inform you that you could die in the next mouse click. Surprise! Permadeath, 100+ hrs of work deleted in an instant. \n\nIt's your fault, silly. Tsk tsk, you should've been checking the menus!\n\nThe game lets you \"pass time\" and also \"go to sleep\" while you're bleeding out, and also while you have lacerations, which are wounds that re-open in your sleep. Because there are NO visual indicators on the UI that you're bleeding out, or wounded, you can literally kill yourself by passing time or going to sleep. You did it! It was your choice to unalive yourself, silly! \n\nThe UI is completely bare except for an almost perpetual (always-on, meaningless boy-cried-wolf type of alert[!], for all non-ideal states, such as having the mere risk of potentially getting hypothermia... erm, this goes without saying, it's freaking cold out there). \n\nI lost 80 hrs of work on Stalker difficulty because I went to sleep for 2 hrs with blood loss, which I did, because.. I didn't know I had blood loss. Nothing on the UI warned me about it.\n\nContinuing with this, it also lets you make the choice to pass time and go to sleep while you're freezing to death, or close to predators. I lost a 70-hr run on the easier Voyageur difficulty because I slept outside in the same area as a (confirmed) single wolf, but a wolf that I had just shot twice in the head with a revolver, and then when struggling with it, stabbed with my knife. It ran away, tail between its legs, yelping, bleeding out, guaranteed to die within 2-3 minutes. Yet, it somehow went over to me and killed me in my sleep before its demise. (FYI - bleeding out wildlife will not track you down to attack you.. so, um, excuse me?)\n\nI've also had shorter runs lost because of this sleeping mechanic as well, sleeping while it's warm, even bundled up, inside, literally in shelter, only for the weather to rapidly change to freezing, and then kill me in my sleep. \n\nThis actually sounds thrilling, right? Going to sleep is the scariest gamble you could do, right?Well, the game forces you to sleep to stay alive, so no, this is simply disrespectful to the player.\n\nFor those that don't know - the game saves instantly as things happen, and your saves are instantly deleted as you're dying, not afterward. It's truly brutal. You can't even Alt+F4 to save yourself.\n\nWhy would I start over again, spend another 100 hours, only to lose everything when I decide to go to sleep? You've gotta be insane. The Long Dark - after 150 hours, you'll find out that the scariest, most dangerous thing in the treacherous, barren, icy, -60°F Canadian wilderness, filled to the brim with wolves, bears, and cougars, is your very own plush, down-filled sleeping bag.\n\nIt would be trivial to add red warnings to the UI, even red icons for the different afflictions, and a flashing red blood drop icon for blood loss (it'll only be on your screen for seconds before you bandage, or minutes before you die), but unfortunately the developers have pursued ambiguity in order to gaslight the player into questioning their sanity after hundreds of hours of labor poured into their runs. An absolute shame.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "This game is unfinished yet they've announced a second game to this one? We've been waiting several years at this point for Episode 5 to come out and we've all been left exceptionally disappointed. The lack of communication from the dev's and they've actually deleted comments about episode 5 on announcements of other things they've been working on is just wild. Currently, I absolutely do not recommend this game. At this point, it is just feeling more like a cash grab then anything.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "[h1] 🅶🆄🆃 [/h1]\r\n⮩ Controller wird unterstützt (habe es mit dem Xbox-Controller durchgespielt, ist aber sehr gewöhnungsbedürftig und man kann im Spiel selbst keine Tastenbelegung ändern).\r\n⮩ Große Anzahl an verschiedenen Maps/Orten, die man erkunden kann. Manche Areale sind leicht, andere tödlich schwer.\r\n⮩ Gute englische/amerikanische Synchronisation (ich hasse britische Sprechweise abgrundtief).\r\n⮩ Hat einen Storymodus (unfertig), einen Survival-Modus (endlos) und einige Challenge-Modi (verschiedene Extra-Missionen).\r\n\r\n[h1] 🆂🅲🅷🅻🅴🅲🅷🆃 [/h1]\r\n⮩ Das Spiel ist schon so lange in Entwicklung, dass Teil 2 bereits angekündigt wurde und daran gearbeitet wird, obwohl Teil 1 nicht einmal abgeschlossen ist. Die Story besteht aus 5 Episoden, aber bisher sind nur 4 veröffentlicht.\r\n⮩ Es gibt ein kostenpflichtiges DLC, was ich überhaupt nicht nachvollziehen kann – die Story ist nicht abgeschlossen und das DLC ist extrem schlecht umgesetzt (karge Landschaft, kilometerweit nichts zu looten oder zu erkunden, reiner Walking-Simulator).\r\n⮩ Es gibt „Legacy“-Erfolge, die man heute nicht mehr erspielen kann. Ich hasse sowas. Warum bringt man Inhalte ins Spiel, lässt sie nur z. B. für einen Monat als Event aktiv und entfernt sie dann wieder? Lasst es doch einfach als Nebenmission für alle offen!\r\n⮩ Im Menü kann man nicht direkt die Story laden. Wenn man darauf klickt, schließt sich das Spiel und öffnet sich erneut – wie ein Call-of-Duty-Launcher. Richtig ekelhaft. Warum baut man sowas? Immer wenn man zwischen Kampagne und anderen Missionen wechseln will, muss man das Spiel neu öffnen.\r\n⮩ Keine bzw. schlechte Karten-Navigation. Nur in der Kampagne hat man einen Pfeil, der zeigt, wo man sich befindet. In allen anderen Spielmodi kann man mit einem Stück Kohle zeichnen, wodurch die Position auf der Map sichtbar wird – ABER nur wenn gutes Wetter ist und es draußen hell ist. Totaler Unsinn. Wenn man den Pfeil bewusst weglässt, um es „schwieriger“ zu machen, warum gibt es dann nicht wie in anderen Spielen vernünftige Orientierungspunkte? Beispiel: Green Hell – dort kann man Koordinaten auf der Uhr ablesen und mit der Karte vergleichen. Hier gibt es nur schlecht gezeichnete bzw. halbwegs korrekte Karten.\r\n⮩ Die Entwickler verwechseln Realismus mit Schwierigkeit. Sie wollen ein realistisches Survival-Spiel machen, aber es wirkt einfach frustrierend und schlecht. Im Menü steht, dass sie es realistisch halten wollen, aber Gegner tracken einen permanent – egal was passiert. Du schießt einem Wolf zweimal in den Kopf? Er kommt wieder. Du stichst ein Messer in seine Brust und er blutet? Egal, er kommt wieder. Er greift dich an, bis du stirbst oder das Spiel beendest :) Realismus on point. Verletzte Tiere greifen in der Realität nicht weiter an, besonders wenn sie selbst in größere Gefahr geraten würden, z. B. durch Feuer. Aber hier interessiert das die Tiere nicht.\r\n⮩ Das Kampfsystem ist ebenfalls nervig: Nicht an jeder Werkbank kann man Waffen herstellen. Es gibt verschiedene Typen und manchmal hat eine komplette Map genau die Werkbank nicht, die man braucht. Also wieder ein Walking-Simulator: von A nach B nach C, nur um einen Gegenstand herzustellen.\r\n⮩ Dunkelheit / schlechte Lichtverhältnisse sind ein zentraler Faktor. Warum gibt es Taschenlampen im Spiel, wenn sie nur funktionieren, wenn – gefühlt einmal alle paar Jahre – Nordlichter (Aurora Borealis) erscheinen?\r\n⮩ Die UI ist versteckt. Das raubt massiv den Spielspaß. Man sieht weder die Temperatur draußen noch ob man eine Blutung hat, die wieder aufgerissen ist. Ich bin schon oft gestorben, obwohl ich perfekt ausgerüstet war und draußen „Schlafen“ gedrückt habe, nur um dann im Blackscreen zu sterben (Eissturm, zufälliges Tier usw.). Warum warnt das Spiel nicht und lässt einen aufstehen, wenn sich plötzlich etwas ändert?\r\n⮩ Man kann keine eigenen Strukturen bauen, um sich eine eigene Survival-Base einzurichten. Manchmal ist man im „Niemandsland“ und hat nichts, wohin man sich zurückziehen könnte. Dann stirbt man zwangsläufig, weil der Charakter müde wird und weit und breit nur Schnee und Gegner sind.\r\n⮩ Die Entwickler reagieren ungern auf Kritik und löschen/bannen Spieler. Ich habe das schon öfter mitbekommen. Beispiel eines bereits gelöschten Kommentars, den ich gespeichert hatte, weil ich wissen wollte, ob die Entwickler darauf reagieren würden (ging um ständig verspätete oder gar nicht mehr genannte Release-Termine):\r\n„And what do the developers do? First, they stop posting specific release dates so that no one can hold them to their word. Then they start heavily moderating the forum, deleting comments that criticize their inaction, and banning players who post them.“\r\n⮩ Hatte bereits auch Gamebreaking Bugs, indem ich ein Kapitel komplett von vorne Spielen musste. Story Episode 4, in den Katakomben, man muss eine Maschiene mit einem Hammer zerstören, der Hammer spawned einfach nicht.\r\n\r\n[h1] 🅵🅰🆉🅸🆃 [/h1]\r\n★★★★☆☆☆☆☆☆ | 4 von 10 Sternen. Ich empfehle euch stattdessen Green Hell zu kaufen. Es macht viel mehr spaß und ist besser gebaut. Ich habe darin schon mehr als 400h Spielzeit und finde leider nichts annähernd survival lastiges was mich ebenso packt. Falls das jmd spielen mag oder Hilfe dabei braucht, addet und schreibt mich gerne an. Ich werde zwar Long Dark noch spielen, aber nur, weil ich Schwabe bin und bereits Geld dafür gezahlt habe. Ist ein schönes Kunstprojekt, keine frage, aber der durchgehende Frust setzt mir zu sehr zu. Deshalb keine Kaufempfehlung von mir.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This opinion comes from the perspective of: a) A streamer b) A fellow game developer who specializes in UI and UX. \n\nAUDIO:\nAs a streamer, it sucked to stream this game because of something that should have been extremely easy to solve from a technical standpoint: \"Play audio in background\". When I stream, I constantly have to switch windows to check things or scroll chat. Every time I do that, the game mutes itself unless it's the active window. Imagine how annoying that is for the viewer!\n\nMost games will play the audio in the background, and if they don't - there is usually an option in the settings to be able to do that. Or else the windowed mode will allow background audio - but not in this game. I found myself thinking: Did they not consider the streaming experience at all? No wonder there were hardly any people streaming this game.\n\nAs a side note, I also found it extremely clunky and weird that survival mode supported:\n1) full screen\n2) windowed\n3) windowed borderless\n\nBut story mode only supported\n1) full screen\n2) windowed\n\n???\n\nUSABILITY:\nI found this game highly unintuitive and confusing to play. Had I not had chat helping me through my first experience, I probably would have given up sooner. Games should be easy to get into but hard to master. Usability aside, there were also a lot of things that just didn't make sense. Here we are in the middle of the Canadian wilderness surrounded by thousands of trees, and yet we can't cut trees down? Ok we can cut limbs off of fallen trees, but even then you can't do that with any makeshift tool in the very beginning. Whaaat? This sort of thing was immersion breaking for me, as most survival games allow you to use your: \"What would I do in real life in this situation?\" logic and then succeed in the game by doing said thing. Instead, the game forces you to learn it's own \"logic\", which is tedious. \n\nI do have some positive things to say as well: Beautiful and immersive visual and audio experience. And I will force myself to try and play it some more since I have so many friends who love this game. But I will have to \"force\" myself. And that's not a good thing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "There is something oddly frustrating about this game, especially in terms of its survival aspect.  \n\nThe run that particularly frustrated me was when I ended up in the abandoned canning factory and ate some of the canned sardines and then immediately got food poisoning, which I couldn't do anything about because I had used up all of my calories and water just locating the factory in the first place.  To feel some level of progression, and then have it arbitrarily taken from you does not make you want to attempt it again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Don’t buy this game unless you’re a clinically severe masochist. (I had no idea there were this many M-type people around in the world.)\n\nI’ve played over 1,000 different games, but I can hardly think of another one that was less fun than this. There is absolutely no sense of enjoyment here at all. The game is painfully lonely and actually pushed me into a really bad depression. It’s like real life… but ten times worse and with none of the meaning.\n\nHonestly, you’d be much much better off just eating, watching YouTube, or doing literally anything else with your time. If you manage to survive for over a year in this game, I bet you can probably achieve anything in real life.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "its not bad, its just not for me.\r\nvery fidgety, slow interactions and kinda tedious.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Time to edit with even more frustration:\n\nThe Save/Load menu is completely broken, nothing works, no buttons work, cant load older save files, in the game on Wintermute you have to rely on F5 and F6, that's all, if you want an older save point, bad shit, the menu won't work and be careful when it \"works\", last time it reset me back to Episode 1 while i was already in Episode 2 because of some odd known bug with the saves that get rolled back.\n\nUnskippable cutscenes, HOLY SHIT, this is just beyond stupid, you'll see that credit scene on every episode start or end, can't skip it. The bear mauls you, can't skip it, enjoy being stuck 20 seconds with a bear on the screen everytime it gets you. Characters talking, can't skip it, idc about her life story yap yap yap, just let me get back to my objective.\n\nI tried to give this game more time after my first review, i just can't. This game menu is broken completely, known bugs about this as well on other platforms. Not worth your money.\n\n\nTLDR: Saving is meaningless, bugs break them constantly, can't skip anything, constant yap from some characters that you dont even care for bec they mean nothing to the story. Devs abandoned the game, no fixes (or have no idea how to even fix this).",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Overpriced game and \"dlc's\". Dev's decided to sell the story separately to the game at double the price, which is ridiculous. This game is definitely an acquired taste and in some ways can be entertaining to play (if you've got loads of free time), but I hate that it's marketed as a game for everyone because it most certainly isn't. I enjoyed playing for a while, but for a sandbox game that's $20, it's not something I would replay and therefore I cannot recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Still not a complete game. The main story hasn't been updated for over 4 years yet they keep releasing paid DLC. Do not support this developer unless you enjoy unfinished games and broken promises.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Yeah, no lol. I would not recommend this to anyone. The moment I saw the low condition movement system, I knew this game and me would not click. Joy was the one emotion I did not feel playing this game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Your character starts starving to death after walking 1 mile. \r\n\r\nYour character needs an 8 hour nap after running 500 meters.\r\n\r\nYour character requires 30 minutes to break down a cardboard box. \r\n\r\nEvery craftable item requires you to find and use a specific, uncraftable tool not guaranteed to spawn. If it is guaranteed, then it's guaranteed somewhere, out there. Maybe close to spawn, maybe not. You'll just have to start walking.\r\n\r\nYour character starts starving to death after walking 1 mile.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is great, really. It's an amazing single player survival with a good story..\n\nBut the problem is.. the game was in early release, and launched when I was still in high school.. \n\nNow I'm an adult... with a wife... and I own a home... and this game still isn't finished, while they've announced a sequel. \n\nBy the time this game finishes, I might be retired, and by the time the sequel comes out (if it does), my grandkids might get to play it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "(FOR WINTER MUTE ONLY)\n\nWinter Mute is incredibly boring. The DLC is basically a walking simulator, except the world is a barren wasteland. \n\nFirst off, there is almost no game play impact from the survival elements. \n\nYou will have an abundance of food, infinite water, endless fire making tools and a bounty of medical supplies, all within the first 2 hours of play. \nThe world doesn’t feel harsh or extreme, it just feels empty: especially in chapter 2. \nYou will never be in danger, and there is basically no challenge to staying alive. \n\nThe missions and story are incredibly brain dead and boring. The following is the mission structure for pretty much the entire DLC:\n\n1. Talk to NPC,\n2. NPC tells you about some item they need,\n3. Spend 10-20 minutes (Yes seriously) walking to said item,\n4. Pick up item,\n5. Spend 10-20 minutes walking back with said item,\n6. Repeat from step 1.\n\nThe problem with this game design is that it’s so hollow. You really do just spend 10-20 minutes walking to and from “objectives”, there are no puzzles, no combat elements, no stealth sections. If you are lucky a wind storm might happen and then you get to sit in a house or a car for 2-5 minuets and wait for it to be over: wow! exciting!\n\nThis game also has the worst boss design of any game I have ever played. The bear boss is literal garbage, and its clear it was never play tested. The developers are incompetent and its clear that they do not understand game design nor are they able to make something enjoyable.\n\nThe DLC really is just a bad walking simulator, and unlike an intentional walking simulator, the story and world are no where near engaging enough to support this severe lack of game play.\n\nThe game is also extremely buggy, and full of technical woes. It barely playable even after 10+ years of updates. Truly shocking.\n\nDo not buy Winter Mute, seriously. \n\nIf you want to experience it then just watch a play-through on YouTube as they will cut the bulk of the “game play” that is boring walking.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely love that you can't shoot a wolf 5 feet away from you, even though it would have been a garunteed hit, then losing all my stuff and starting over. Love it. Yippee.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like this game generally, but seriously, it's been YEARS waiting for the final episode. Kerbal 2 anyone?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game doesn`t even have a JUMP function. I should have known that this game would be trash from the beginning. Wasted 10h of my life",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This opinion comes from the perspective of: a) A streamer b) A fellow game developer who specializes in UI and UX. \n\nAUDIO:\nAs a streamer, it sucked to stream this game because of something that should have been extremely easy to solve from a technical standpoint: \"Play audio in background\". When I stream, I constantly have to switch windows to check things or scroll chat. Every time I do that, the game mutes itself unless it's the active window. Imagine how annoying that is for the viewer!\n\nMost games will play the audio in the background, and if they don't - there is usually an option in the settings to be able to do that. Or else the windowed mode will allow background audio - but not in this game. I found myself thinking: Did they not consider the streaming experience at all? No wonder there were hardly any people streaming this game.\n\nAs a side note, I also found it extremely clunky and weird that survival mode supported:\n1) full screen\n2) windowed\n3) windowed borderless\n\nBut story mode only supported\n1) full screen\n2) windowed\n\n???\n\nUSABILITY:\nI found this game highly unintuitive and confusing to play. Had I not had chat helping me through my first experience, I probably would have given up sooner. Games should be easy to get into but hard to master. Usability aside, there were also a lot of things that just didn't make sense. Here we are in the middle of the Canadian wilderness surrounded by thousands of trees, and yet we can't cut trees down? Ok we can cut limbs off of fallen trees, but even then you can't do that with any makeshift tool in the very beginning. Whaaat? This sort of thing was immersion breaking for me, as most survival games allow you to use your: \"What would I do in real life in this situation?\" logic and then succeed in the game by doing said thing. Instead, the game forces you to learn it's own \"logic\", which is tedious. \n\nI do have some positive things to say as well: Beautiful and immersive visual and audio experience. And I will force myself to try and play it some more since I have so many friends who love this game. But I will have to \"force\" myself. And that's not a good thing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Walk up the slightest incline. Sprained limb.\n\nWalk down 1 cm. Sprained limb. \n\nNot encumbered, not tired, probably insane by now.\n\nThe wildlife and arctic chill aren't even the true threat in this game, your jello limbs are.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The survival aspect is really well done and super cool.... However,  I love story a lot, and the story in this game is stupid. The bear is the worst and makes absolutely no sense compared to the rest of the story. I will not be finishing this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ugly tumblr art, skip cutscenes, walk along a boring linear path, run into some bunnies running around in circles forever completely unaware of you, game tells you to throw rocks at them, throwing controls are garbage, bunnies continue to run around as if you aren't even there, uninstall",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's been more than 10 years, with lots of updates and DLCs and all the same bugs and QoL issues remaining. Quests and achievements are a nightmare. Terrain always have 0.5 pixel of step you cannot step over and get stuck. And they added one more level of difficulty: \"Misery\". That is what you'll feel playing this. You wanted satisfaction and joy? Well rarely, mostly misery.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When you go low on health, you start flying and levitating around the world. My review will turn positive when that stops happening. 1/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly. Would rather sink my teeth into a rotten carcass than play this again. Once again I have succumbed to the Pole's requests and wasted a 5 sheet on this. Could've got a Greggs with that but instead I am left with yet another sodden icon on my library, just staring at me. Hoping, praying to be played again. Can't even refund it either as I bought a key for it!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely love that you can't shoot a wolf 5 feet away from you, even though it would have been a garunteed hit, then losing all my stuff and starting over. Love it. Yippee.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Design wise this game is a mistake. Mechanics are a joke, I need to click then always click again to pick up sth, climbing is a locked animation and you dont have control over it which cause sometimes unwanted climbing cause you missclicked, and then you have to wait until animation ends. Interactions are annoying. Story mode tutorials and guiding is just bad. I resigned when I had a low life and my character didn't want to move as I wanted which caused mowing away from campfire all the time and I was freezing with no chance to heat up. Every crafting or destroying lasts forever and game doesnt tell that this will cost you a lot of stats. In endless mode I chose random place and then I was exploring for 20 minutes running around empty world, I didnt find a single animal. Crafting tree is also very unintuitive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game. But there are hidden mechanics and quirks which kick in to make your run worse if you're doing well, such as the game screwing with your aiming among other things. That has made the game unplayable and takes any joy right out of it, add to it the fact that the devs announced TLD II without even finishing this one makes this not worth buying, sadly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm fairly confident that watching paint dry would be more fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its a Long Dark game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont recommend, wolves aren't like this in real life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring and sloppy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They never finished the main game",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The Long Cash Grab",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The bear",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "God knows, I loved — and still love — this game. It’s a peculiar one: slow-paced, sometimes illogical from a realistic point of view, but it creates a world and atmosphere of its own.\nYet the further things go, the more the developers distance themselves from the players. The game is technically still unfinished. Players have been waiting for the final episode of the story for more than four years now.\n\nWhat are the developers doing?\nThey’ve split the sandbox and the story into two separate games. They release paid DLC. Yes, not immediately, yes, with delays — but still, they release it. They’ve even announced a sequel. But they haven’t finished the story.\n\nOriginally posted by HiddenBlade:\nEpisodes 1 & 2: 8/1/2017 (1.0 Launch)\nEpisode 3: 10/22/2019 (2 years, 2 months, 22 days)\nEpisode 4: 10/6/2021 (1 year, 11 months, 20 days)\nDev Diaries:\n~4/22: E5 in 2023\n~10/22: E5 in late 2023\n~5/23: \"[not] this year\"\n~11/23: \"It'll ship in 2024\"\n~12/23: \"late 2024\"\n~10/24: \"We haven't announced a release date yet\"\n~4/25: \"end of 2025\"\nCurrent date: 11/12/2025 (4 years, 37 days since Episode 4; 49 days till 2026) \n\nNaturally, that frustrates the players. The players start asking questions. They start reminding the developers of their unfulfilled promises.\nAnd what do the developers do? First, they stop posting specific release dates so that no one can hold them to their word. Then they start heavily moderating the forum, deleting comments that criticize their inaction, and banning players who post them.\nEventually, they just stop saying anything at all.\n\nWell then — good luck to them!",
      "voted_up": false,
      "votes_helpful": 263
    },
    {
      "review": "I’ve played The Long Dark for years, and while the survival mode is strong, I can’t recommend it anymore. The game has been in development for over 9 years (Early Access started in 2014) and the story mode, Wintermute, is still incomplete. After nearly a decade, the developers have shifted focus to selling *paid* DLC instead of finishing the game we already paid for.\r\n\r\nWhat really leaves a bad taste is how the devs handle criticism. I’ve asked questions in their official showcase streams about when the full game will be finished, and I’ve been muted or shadowbanned for it. Instead of addressing long-standing concerns, they silence them. That tells me they know the community is frustrated but would rather ignore it than engage honestly.\r\n\r\nAt this point, it feels like they’re more interested in milking the player base than in delivering on their original promise. If you’re new to The Long Dark, just know you’re buying into a product that’s been dragging on for nearly a decade, still isn’t finished, and has devs who punish players for asking the obvious questions.",
      "voted_up": false,
      "votes_helpful": 490
    },
    {
      "review": "+ good atmosphere\n+ vast map with unique locations\n\n+/- realistic in some aspects, but not at all in others\n+/- challenging which can be good or bad if you like it\n\n- there's a glaring lack of content outside of the idea of pure survival, with you being unable to do things you would immediately think of for survival, and that is a big problem for a game which tries to do exactly the survival part \n- critique is not tolerated by the devs which is noticable because they're outspoken at the same time\n- the game was in development for a long time and while it's still in development the devs started selling paid DLC with significant content",
      "voted_up": false,
      "votes_helpful": 94
    },
    {
      "review": "Announcing the sequel before finishing the game is not a good look. Good game, bad business practices.",
      "voted_up": false,
      "votes_helpful": 76
    },
    {
      "review": "Truely I love this game but it seems like the developers dont care about their players.\n\nI bought this game years back when it first came to early access. I had been so excited and impressed by it. Then the waiting came. Waiting years for episode 1 and 2 to come out. Waiting years for eps 3. Waiting years for eps 4. And unfortunately most of owning this game is just waiting. I could understand a game taking up to 5 years to complete maybe, but this is just disrespectful to everyone that has spent money on the game. We dont need visual boosts that wont be noticed much by most players. We dont need every little area and word in the game to be perfect. Ive played the episodes so much that ive gotten tired and bored of them while waiting for the next one.\n\nThis game came out in 2017, if it takes you a DECADE to finish your game then you shouldnt have started it in the first place. Or, at least, made the game smaller. I've waited 8 years for Episode 5 and I can say without a doubt that NOTHING in the episode will justify waiting that long to finish this damn game. Stop sending your programmers to work on two other games and just focus on the one you promised your players 8 years ago.",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "Why no episode 5  yet?  Great game, but come on.  We've been waiting for a VERY long time.  Plus announcing the new game before finishing this one is lame.  I'll happily take this down and replace with a positive review once the game is finished.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The game was released way back in 2013. During 12 long years the dev haven´t managed to finish the storyline which they divided into 5 chapters (4 are out now), instead they have milked the idea by selling DLC stories and starting to develop another game. It´s like one buys a house and gets 4 walls and floor but no roof after waiting 12 years and the constructor says you can buy a garage and summer home from me also but you will need to wait for ever for that roof you paid for over a decade ago. It´s a good game, but the devs are either greedy, moronic or incompetent. \nAlso banning anyone  that points that out ^ will not help em...",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "I start the game, get to a village with a church, community center, market, houses, transportation, but nowhere is there a knife, axe, saw, etc. There's nothing to live in a place like this. How is that possible? It seems to me that the developers have strayed far from reality in order to complicate the gaming experience.\n\nI live in the city, but even I have a bunch of knives, a few axes, and lots of hacksaws. Everyone does. If I were to leave my home, I definitely wouldn't take everything with me, just like everyone else. I'll say it again, I live in the city. And here in the whole village, there are only drinks in aluminum cans. That's nonsense, not reality. It's some kind of unhealthy gamer reality—the whole village living on chips and soda.\n\nThe game is billed as a survival game, but it's empty. Instead of tools where they logically belong, and I got there, you're stuffed with junk to make it slower for you to move around the map. You'll be fighting not what you were expecting, but the developers who decided to take the easy way out. Slow down with this, slow down with that, and it seems like time has already passed, the purchase was probably not in vain, and you are formally surviving.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I was going to write a very long review about this game to avoid just saying \"It's bad\", but I'll shorten it.\n\nThe Long Dark is a great game similar to project zomboid where you survive until the inevitable, but I didn't really have fun in it because of how repetitive the gameplay loop is (refill your sleep, hunger etc) after it got drained in 2 minutes of sprinting for some reason. It is also not a story game, the story has to be purchased as a DLC.\n\nIt's great if you just want  a game to relax, but it's hard to do so when a lot of illogical things make the game harder than it should be (not being able to sleep without a mattress, the character not climbing slopes higher than 45 degrees, NO JUMPING, wolves running away when scared then 100% coming back until they get you next time, and my personal favorite and cause of end of my 30Hrs game, bears not dying after taking 4 pistol shots to the head and coming back like wolves 3 TIMES). The character also feels like a bag of potato that can't move any faster than walking speed without tanking through the energy stat like crazy.\n\nI usually don't put negative reviews on games unless I wish I hadn't bought them and unfortunately, although I had my share of fun on this game, it got too repetitive and I felt like I did everything there was to do after a few hours. I'm using this review as a warning, make sure it is the type of game you like. The Long Dark is absolutely not a bad game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Yes, this game is a work of art, but it absolutely, 100%, in every way, will disrespect your time and then gaslight you. \n\nI have put 150 hours into the game, which is saying something - time slips away because every decision matters. That should be a good thing, but, when you discover how your time investment of 100 hrs here, 50 hrs there, can be permanently lost in an instant because of the deliberately confusing and ambiguous UI design, you'll feel betrayed. Shame on the developers.\n\nMyself and others have lost 100+ hr runs because of the UI design. The UI does NOT inform you of what kinds of afflictions/debuffs that you have, even imminently lethal ones. This information is hidden inside of the menus. So, unless you remember to deliberately make the choice to open the menu to find out whether or not you might be dying (yes, even when your health bar is completely full, you can die in a single mouse click), it's on you to decide to access the menu or not, in order to discover that you're in danger of losing everything. Yes, the UI does not inform you that you could die in the next mouse click. Surprise! Permadeath, 100+ hrs of work deleted in an instant. \n\nIt's your fault, silly. Tsk tsk, you should've been checking the menus!\n\nThe game lets you \"pass time\" and also \"go to sleep\" while you're bleeding out, and also while you have lacerations, which are wounds that re-open in your sleep. Because there are NO visual indicators on the UI that you're bleeding out, or wounded, you can literally kill yourself by passing time or going to sleep. You did it! It was your choice to unalive yourself, silly! \n\nThe UI is completely bare except for an almost perpetual (always-on, meaningless boy-cried-wolf type of alert[!], for all non-ideal states, such as having the mere risk of potentially getting hypothermia... erm, this goes without saying, it's freaking cold out there). \n\nI lost 80 hrs of work on Stalker difficulty because I went to sleep for 2 hrs with blood loss, which I did, because.. I didn't know I had blood loss. Nothing on the UI warned me about it.\n\nContinuing with this, it also lets you make the choice to pass time and go to sleep while you're freezing to death, or close to predators. I lost a 70-hr run on the easier Voyageur difficulty because I slept outside in the same area as a (confirmed) single wolf, but a wolf that I had just shot twice in the head with a revolver, and then when struggling with it, stabbed with my knife. It ran away, tail between its legs, yelping, bleeding out, guaranteed to die within 2-3 minutes. Yet, it somehow went over to me and killed me in my sleep before its demise. (FYI - bleeding out wildlife will not track you down to attack you.. so, um, excuse me?)\n\nI've also had shorter runs lost because of this sleeping mechanic as well, sleeping while it's warm, even bundled up, inside, literally in shelter, only for the weather to rapidly change to freezing, and then kill me in my sleep. \n\nThis actually sounds thrilling, right? Going to sleep is the scariest gamble you could do, right?Well, the game forces you to sleep to stay alive, so no, this is simply disrespectful to the player.\n\nFor those that don't know - the game saves instantly as things happen, and your saves are instantly deleted as you're dying, not afterward. It's truly brutal. You can't even Alt+F4 to save yourself.\n\nWhy would I start over again, spend another 100 hours, only to lose everything when I decide to go to sleep? You've gotta be insane. The Long Dark - after 150 hours, you'll find out that the scariest, most dangerous thing in the treacherous, barren, icy, -60°F Canadian wilderness, filled to the brim with wolves, bears, and cougars, is your very own plush, down-filled sleeping bag.\n\nIt would be trivial to add red warnings to the UI, even red icons for the different afflictions, and a flashing red blood drop icon for blood loss (it'll only be on your screen for seconds before you bandage, or minutes before you die), but unfortunately the developers have pursued ambiguity in order to gaslight the player into questioning their sanity after hundreds of hours of labor poured into their runs. An absolute shame.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Probably gonna get GTA VI before the final chapter for this game. \n\nStop working on other projects and finish this game.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I bought this game in my early 20's and came back to it in my early to mid 30's thinking the game HAS to be finished, right? Wrong. Instead, I see a new video advertising 10 years of free updates with no paid DLC until now. What about the ONE update we all want? The actual game. Is the DLC unfinished too?",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "This game is unfinished yet they've announced a second game to this one? We've been waiting several years at this point for Episode 5 to come out and we've all been left exceptionally disappointed. The lack of communication from the dev's and they've actually deleted comments about episode 5 on announcements of other things they've been working on is just wild. Currently, I absolutely do not recommend this game. At this point, it is just feeling more like a cash grab then anything.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "70 hours later, finished up to episode 4.  ive have mixed feelings.  overall, its a frustrating meandering slog that forces you to travel long distances through an uninspired winter hellscape while trying to build fires, hunt for food and craft clothing.  its fun for the first episode, but gets increasingly tedious as the story progresses.  the game also punishes you for hoarding items that you painstakingly crafted/scavenged for and takes them away at the end of each episode.  can you help it when every five minutes you are at risk of dying of hypothermia?  i hated the permanent frostbite mechanic, once you spend too much time in the cold, your stamina bar is permanently reduced.  the story becomes bizarre and disjointed by the end, i had no idea what was going on by the end of episode 4 and didnt care enough to want to buy the next DLC pack or whatever the hell they are selling.  yea i did spend 70 hours slogging through this game, but it was a love/hate relationship.   i wish it could have been more love than hate",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "first game's still not finished. still has bugs. but hey, lets make paid DLC and a second game! and god forbid anyone criticizes us for that. absolute joke of a company. only buy if you want an unfinished product or if you want to support sleazy devs",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "I am a core player with 1000 hours of experience, and I can survive for over 100 days on the highest difficulty level without SL. A negative review is due to the developer's arrogant attitude, not the game itself. The quality of the game is not a problem.\nEvery version update always makes players anxious, as it may damage their save files and prevent them from continuing to play, or make dependent mods unusable. The following comment I posted in the Steam discussion section was banned, so I posted it again in the comment section.\nHere is the original text：\n\n[h1] One upgrade, one disaster: How did developers personally destroy their gaming community?[/h1] \n\nIf you are a player of single player games, have you ever relied on those exciting mods to get a brand new experience? If your answer is yes, then you may also empathize with today's incident and even feel angry. A game that has sold millions of copies, its developer's recent decision is destroying the player ecosystem on which it relies for survival. What exactly did they do?\n\n[h2]An unnecessary 'technological leap'[/h2]\nThe developer of the game 'The Long Dark', Hinterland, recently upgraded the game engine to the latest Unity 6. Does it sound like a technological advancement? But in fact, this is highly likely to cause all existing mod support to instantly fail.\nFor players who rely on third-party loaders, this is nothing short of a disaster. You need to struggle to find a version compatible with the new engine, or you can only wait in despair for all mod authors to update one by one - if they can still update. The worst-case scenario is that some core functions are completely modified, and your beloved Mod may never be resurrected.\nThe 'Three Deadly Sins' Behind Absurd Decisions\nWhy is this upgrade decision both crazy and irresponsible?\n[h2]Zero Necessity[/h2]: What disruptive features does a mature standalone project, which has been developed for ten years, have at the end of its sales lifecycle that requires betting on the entire Mod ecosystem to pursue a brand new, yet unstable engine? It is entirely possible to achieve everything with an old version engine. This is not like a practical technical requirement, but more like a \"big shot decision\" made by the management.\n[h2]The complete imbalance between costs and benefits[/h2]: this is a typical 'lose lose' situation. Developers need to invest huge manpower costs to deal with a massive number of API errors and compatibility issues, which will inevitably lead to a significant delay in the game development cycle; Players, on the other hand, need to endure long waits, which may ultimately result in only \"insignificant performance improvements\" and \"potential more unknown bugs\". The low cost-effectiveness of upgrading an old project's engine with such a bone wrenching upgrade is astonishing.\n[h2]Thoroughly ignoring the player community[/h2]: This upgrade was like a 'surprise attack', with no prior communication with the Mod community that relied on it for survival. This arrogance completely exposes the developer's disregard for the Mod ecosystem that has shaped the long-term lifeline of the game. They seem to have forgotten that the experience of Mod players is also an indispensable part of the player experience. A successful single player gaming community should have thrived through official support.\nThe direct consequence of this decision is to put countless players in a dilemma: either they have to go to great lengths to find a solution, or they are forced to abandon all mods and return to the \"pure version\" of the game. And the more profound impact is to hurt the enthusiasm of mod authors and the stability of the entire creative ecosystem.\nThis is not just a technical issue, but also exposes the shortsightedness of project decision-making and lack of respect for core users.\nGame developers, please take every technical decision seriously! Technological progress should never be used to destroy the player community. A rational and responsible decision must weigh the pros and cons, respect players, especially mod authors and users who extend the life of the game with love and creativity.\nThis' engine upgrade 'is not a ladder of progress, but a mirror that reflects the decision-making level's technical fanaticism and indifference towards players that are detached from reality.\nDevelopers should at least open the option to roll back game versions on Steam, so that mod players can continue playing with the old version.\n\n（英文机翻回来有点怪）\n我是一名1000小时的核心玩家，我能在最高难度不SL存活100天以上，差评是给开发商傲慢的态度，而不是给游戏本身，游戏质量是没问题的。\n每次版本更新，总是令玩家提心吊胆，因为可能会让你的存档损坏无法继续游玩，或者是依赖的mod无法使用。以下的评论我在steam讨论区发了被禁言了，于是我在评论区重新发出来。\n以下是原文：\n\n一次“升级”，一场灾难：开发者是如何亲手摧毁自己的游戏社区的？\n\n如果你是一个单机游戏的玩家，你是否曾依赖那些精彩的Mod来获得全新的体验？如果你的答案是肯定的，那么今天这件事，你可能也会感同身受，甚至怒火中烧。一个畅销数百万份的游戏，其开发商最近的一个决策，正在摧毁其赖以生存的玩家生态。他们到底做了什么？\n\n事件核心——一场毫无必要的“技术跃进”\n游戏《The Long Dark》的开发商Hinterland最近将游戏引擎升级到了最新的UNITY 6。听起来像是技术进步？但事实上：这极可能导致现有的所有模组（Mod）支持瞬间失效。\n对于依赖第三方加载器的玩家来说，这无异于一场灾难。你需要艰难地寻找兼容新引擎的版本，或者只能绝望地等待所有Mod作者逐一更新——如果他们还能更新的话。最坏的情况是，一些核心函数被彻底更改，你心爱的Mod可能永远无法复活。\n\n荒谬决策背后的“三宗罪”\n为什么说这个升级决定既疯狂又不负责任？\n\n必要性为零：一个已经开发十年的成熟单机项目，在销售生命末期，究竟有什么颠覆性功能，必须赌上整个Mod生态去追逐一个全新的、尚未稳定的引擎？用旧版本引擎完全能做到现有的一切。这不像务实的技术需求，更像是管理层“好大喜功”的拍脑袋决定。\n\n成本与收益完全失衡：这是一场典型的“双输”。开发商需要投入巨大的人力成本去处理海量的API报错和兼容性问题，必然导致游戏开发周期大幅延期；而玩家则需要忍受漫长的等待，最终换来的可能只是“微不足道的性能提升”和“潜在更多的未知Bug”。为一个老项目进行这种伤筋动骨的引擎升级，其性价比之低令人咋舌。\n\n对玩家社群的彻底漠视：此次升级如同一次“偷袭”，事先完全没有与赖以生存的Mod社区进行任何沟通。这种傲慢，彻底暴露了开发商对塑造了游戏长期生命线的Mod生态的轻视。他们似乎忘了，Mod玩家的体验同样是玩家体验不可或缺的一部分。一个成功的单机游戏社区，本应通过官方支持而更加繁荣。\n\n这一决策的直接后果，就是让无数玩家陷入两难：要么费尽周折寻找解决方案，要么被迫放弃所有Mod，退回“纯净版”游戏。而更深远的影响，是伤害了Mod作者的热情和整个创作生态的稳定性。\n这不仅仅是技术问题，更暴露了项目决策的短视与对核心用户的不尊重。\n\n游戏开发者请慎重对待你们的每一次技术决策！技术进步绝不应用来摧毁玩家社区。一个理性、负责任的决策，必须权衡利弊、尊重玩家，尤其是那些用热爱与创意延长游戏生命的Mod作者与用户。\n这一次的“引擎升级”，不是进步的阶梯，而是一面镜子，照出了决策层脱离实际的技术狂热与对玩家的冷漠。\n\n开发者至少应该打开在Steam上回滚游戏版本的选项，这样mod玩家就可以继续玩旧版本。",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Tried the story and found the execution to be absolute garbage. Poorly designed levels with little to no signposting are issues which are normally band-aid fixed with navigation markers but this game has chosen to not even do that. The movement is a slow crawling slog, the NPC dialogue is similarly slow, drawn out, and the character is constantly frozen on the spot whilst they get their one or two-liners off. \n\nWhen \"condition\" gets too low, the character gets dizzy which the devs apparently think means equates to ZOOMING UNCONTROLLABLY AROUND THE LANDSCAPE, far faster than we could ever even sprint. I didn't make it through Ep1 because I came across a bug/oversight that I couldn't be bothered to go back and replay crawling through the convoluted fetch quests (with backtracking aplenty) to progress.\n\nAs I understand, most of the positive reviews are from the normal survival mode, so maybe it's just the story mode that is absolutely irredeemable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've played this for a decent amount of time, and I really can't recommend it... Is it fun? In sections, yes. The biggest problem is that while I enjoy the idea of a difficult survival experience, there is no incentive that really pushes you forward. Besides that, the large amount of variation your character gets on startup is ridiculous. Sometimes you get a good start area, others you die because of how poorly you were dropped into the game, and that doesn't make for a fun experience at all when you spend 30 minutes running through a snow storm at night. Mapping is fun, but tedious, no real helpful way to track your progress... Just feels like wasted potential.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h1] 🅶🆄🆃 [/h1]\r\n⮩ Controller wird unterstützt (habe es mit dem Xbox-Controller durchgespielt, ist aber sehr gewöhnungsbedürftig und man kann im Spiel selbst keine Tastenbelegung ändern).\r\n⮩ Große Anzahl an verschiedenen Maps/Orten, die man erkunden kann. Manche Areale sind leicht, andere tödlich schwer.\r\n⮩ Gute englische/amerikanische Synchronisation (ich hasse britische Sprechweise abgrundtief).\r\n⮩ Hat einen Storymodus (unfertig), einen Survival-Modus (endlos) und einige Challenge-Modi (verschiedene Extra-Missionen).\r\n\r\n[h1] 🆂🅲🅷🅻🅴🅲🅷🆃 [/h1]\r\n⮩ Das Spiel ist schon so lange in Entwicklung, dass Teil 2 bereits angekündigt wurde und daran gearbeitet wird, obwohl Teil 1 nicht einmal abgeschlossen ist. Die Story besteht aus 5 Episoden, aber bisher sind nur 4 veröffentlicht.\r\n⮩ Es gibt ein kostenpflichtiges DLC, was ich überhaupt nicht nachvollziehen kann – die Story ist nicht abgeschlossen und das DLC ist extrem schlecht umgesetzt (karge Landschaft, kilometerweit nichts zu looten oder zu erkunden, reiner Walking-Simulator).\r\n⮩ Es gibt „Legacy“-Erfolge, die man heute nicht mehr erspielen kann. Ich hasse sowas. Warum bringt man Inhalte ins Spiel, lässt sie nur z. B. für einen Monat als Event aktiv und entfernt sie dann wieder? Lasst es doch einfach als Nebenmission für alle offen!\r\n⮩ Im Menü kann man nicht direkt die Story laden. Wenn man darauf klickt, schließt sich das Spiel und öffnet sich erneut – wie ein Call-of-Duty-Launcher. Richtig ekelhaft. Warum baut man sowas? Immer wenn man zwischen Kampagne und anderen Missionen wechseln will, muss man das Spiel neu öffnen.\r\n⮩ Keine bzw. schlechte Karten-Navigation. Nur in der Kampagne hat man einen Pfeil, der zeigt, wo man sich befindet. In allen anderen Spielmodi kann man mit einem Stück Kohle zeichnen, wodurch die Position auf der Map sichtbar wird – ABER nur wenn gutes Wetter ist und es draußen hell ist. Totaler Unsinn. Wenn man den Pfeil bewusst weglässt, um es „schwieriger“ zu machen, warum gibt es dann nicht wie in anderen Spielen vernünftige Orientierungspunkte? Beispiel: Green Hell – dort kann man Koordinaten auf der Uhr ablesen und mit der Karte vergleichen. Hier gibt es nur schlecht gezeichnete bzw. halbwegs korrekte Karten.\r\n⮩ Die Entwickler verwechseln Realismus mit Schwierigkeit. Sie wollen ein realistisches Survival-Spiel machen, aber es wirkt einfach frustrierend und schlecht. Im Menü steht, dass sie es realistisch halten wollen, aber Gegner tracken einen permanent – egal was passiert. Du schießt einem Wolf zweimal in den Kopf? Er kommt wieder. Du stichst ein Messer in seine Brust und er blutet? Egal, er kommt wieder. Er greift dich an, bis du stirbst oder das Spiel beendest :) Realismus on point. Verletzte Tiere greifen in der Realität nicht weiter an, besonders wenn sie selbst in größere Gefahr geraten würden, z. B. durch Feuer. Aber hier interessiert das die Tiere nicht.\r\n⮩ Das Kampfsystem ist ebenfalls nervig: Nicht an jeder Werkbank kann man Waffen herstellen. Es gibt verschiedene Typen und manchmal hat eine komplette Map genau die Werkbank nicht, die man braucht. Also wieder ein Walking-Simulator: von A nach B nach C, nur um einen Gegenstand herzustellen.\r\n⮩ Dunkelheit / schlechte Lichtverhältnisse sind ein zentraler Faktor. Warum gibt es Taschenlampen im Spiel, wenn sie nur funktionieren, wenn – gefühlt einmal alle paar Jahre – Nordlichter (Aurora Borealis) erscheinen?\r\n⮩ Die UI ist versteckt. Das raubt massiv den Spielspaß. Man sieht weder die Temperatur draußen noch ob man eine Blutung hat, die wieder aufgerissen ist. Ich bin schon oft gestorben, obwohl ich perfekt ausgerüstet war und draußen „Schlafen“ gedrückt habe, nur um dann im Blackscreen zu sterben (Eissturm, zufälliges Tier usw.). Warum warnt das Spiel nicht und lässt einen aufstehen, wenn sich plötzlich etwas ändert?\r\n⮩ Man kann keine eigenen Strukturen bauen, um sich eine eigene Survival-Base einzurichten. Manchmal ist man im „Niemandsland“ und hat nichts, wohin man sich zurückziehen könnte. Dann stirbt man zwangsläufig, weil der Charakter müde wird und weit und breit nur Schnee und Gegner sind.\r\n⮩ Die Entwickler reagieren ungern auf Kritik und löschen/bannen Spieler. Ich habe das schon öfter mitbekommen. Beispiel eines bereits gelöschten Kommentars, den ich gespeichert hatte, weil ich wissen wollte, ob die Entwickler darauf reagieren würden (ging um ständig verspätete oder gar nicht mehr genannte Release-Termine):\r\n„And what do the developers do? First, they stop posting specific release dates so that no one can hold them to their word. Then they start heavily moderating the forum, deleting comments that criticize their inaction, and banning players who post them.“\r\n⮩ Hatte bereits auch Gamebreaking Bugs, indem ich ein Kapitel komplett von vorne Spielen musste. Story Episode 4, in den Katakomben, man muss eine Maschiene mit einem Hammer zerstören, der Hammer spawned einfach nicht.\r\n\r\n[h1] 🅵🅰🆉🅸🆃 [/h1]\r\n★★★★☆☆☆☆☆☆ | 4 von 10 Sternen. Ich empfehle euch stattdessen Green Hell zu kaufen. Es macht viel mehr spaß und ist besser gebaut. Ich habe darin schon mehr als 400h Spielzeit und finde leider nichts annähernd survival lastiges was mich ebenso packt. Falls das jmd spielen mag oder Hilfe dabei braucht, addet und schreibt mich gerne an. Ich werde zwar Long Dark noch spielen, aber nur, weil ich Schwabe bin und bereits Geld dafür gezahlt habe. Ist ein schönes Kunstprojekt, keine frage, aber der durchgehende Frust setzt mir zu sehr zu. Deshalb keine Kaufempfehlung von mir.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "There is something oddly frustrating about this game, especially in terms of its survival aspect.  \n\nThe run that particularly frustrated me was when I ended up in the abandoned canning factory and ate some of the canned sardines and then immediately got food poisoning, which I couldn't do anything about because I had used up all of my calories and water just locating the factory in the first place.  To feel some level of progression, and then have it arbitrarily taken from you does not make you want to attempt it again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Don’t buy this game unless you’re a clinically severe masochist. (I had no idea there were this many M-type people around in the world.)\n\nI’ve played over 1,000 different games, but I can hardly think of another one that was less fun than this. There is absolutely no sense of enjoyment here at all. The game is painfully lonely and actually pushed me into a really bad depression. It’s like real life… but ten times worse and with none of the meaning.\n\nHonestly, you’d be much much better off just eating, watching YouTube, or doing literally anything else with your time. If you manage to survive for over a year in this game, I bet you can probably achieve anything in real life.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "its not bad, its just not for me.\r\nvery fidgety, slow interactions and kinda tedious.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Time to edit with even more frustration:\n\nThe Save/Load menu is completely broken, nothing works, no buttons work, cant load older save files, in the game on Wintermute you have to rely on F5 and F6, that's all, if you want an older save point, bad shit, the menu won't work and be careful when it \"works\", last time it reset me back to Episode 1 while i was already in Episode 2 because of some odd known bug with the saves that get rolled back.\n\nUnskippable cutscenes, HOLY SHIT, this is just beyond stupid, you'll see that credit scene on every episode start or end, can't skip it. The bear mauls you, can't skip it, enjoy being stuck 20 seconds with a bear on the screen everytime it gets you. Characters talking, can't skip it, idc about her life story yap yap yap, just let me get back to my objective.\n\nI tried to give this game more time after my first review, i just can't. This game menu is broken completely, known bugs about this as well on other platforms. Not worth your money.\n\n\nTLDR: Saving is meaningless, bugs break them constantly, can't skip anything, constant yap from some characters that you dont even care for bec they mean nothing to the story. Devs abandoned the game, no fixes (or have no idea how to even fix this).",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’d heard a lot of good things about this game, so I gave it a try. Turns out it’s basically a walking simulator with some pretty questionable mechanics and restrictions. Maybe it was fine when it came out, but it really hasn’t aged well. I don't like this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is great, really. It's an amazing single player survival with a good story..\n\nBut the problem is.. the game was in early release, and launched when I was still in high school.. \n\nNow I'm an adult... with a wife... and I own a home... and this game still isn't finished, while they've announced a sequel. \n\nBy the time this game finishes, I might be retired, and by the time the sequel comes out (if it does), my grandkids might get to play it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Overall I like the game but the fact that you cannot pull out your hatchet or knife to defend yourself against a wolf or to throw at a rabbit to hunt while having the arrow craft require 5 crow feathers and if you cant find the bow have fun getting the materials to craft it. For this reason I cannot recommend the game I hope they don't do this in the second one.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Overpriced game and \"dlc's\". Dev's decided to sell the story separately to the game at double the price, which is ridiculous. This game is definitely an acquired taste and in some ways can be entertaining to play (if you've got loads of free time), but I hate that it's marketed as a game for everyone because it most certainly isn't. I enjoyed playing for a while, but for a sandbox game that's $20, it's not something I would replay and therefore I cannot recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Still not a complete game. The main story hasn't been updated for over 4 years yet they keep releasing paid DLC. Do not support this developer unless you enjoy unfinished games and broken promises.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Constantly losing my saves, I played half day and game still fcuked up, it is not like this game is new or mode is something new. I do not talk about other parts which are promised and nobody so far has seen them.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yeah, no lol. I would not recommend this to anyone. The moment I saw the low condition movement system, I knew this game and me would not click. Joy was the one emotion I did not feel playing this game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Your character starts starving to death after walking 1 mile. \r\n\r\nYour character needs an 8 hour nap after running 500 meters.\r\n\r\nYour character requires 30 minutes to break down a cardboard box. \r\n\r\nEvery craftable item requires you to find and use a specific, uncraftable tool not guaranteed to spawn. If it is guaranteed, then it's guaranteed somewhere, out there. Maybe close to spawn, maybe not. You'll just have to start walking.\r\n\r\nYour character starts starving to death after walking 1 mile.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "(FOR WINTER MUTE ONLY)\n\nWinter Mute is incredibly boring. The DLC is basically a walking simulator, except the world is a barren wasteland. \n\nFirst off, there is almost no game play impact from the survival elements. \n\nYou will have an abundance of food, infinite water, endless fire making tools and a bounty of medical supplies, all within the first 2 hours of play. \nThe world doesn’t feel harsh or extreme, it just feels empty: especially in chapter 2. \nYou will never be in danger, and there is basically no challenge to staying alive. \n\nThe missions and story are incredibly brain dead and boring. The following is the mission structure for pretty much the entire DLC:\n\n1. Talk to NPC,\n2. NPC tells you about some item they need,\n3. Spend 10-20 minutes (Yes seriously) walking to said item,\n4. Pick up item,\n5. Spend 10-20 minutes walking back with said item,\n6. Repeat from step 1.\n\nThe problem with this game design is that it’s so hollow. You really do just spend 10-20 minutes walking to and from “objectives”, there are no puzzles, no combat elements, no stealth sections. If you are lucky a wind storm might happen and then you get to sit in a house or a car for 2-5 minuets and wait for it to be over: wow! exciting!\n\nThis game also has the worst boss design of any game I have ever played. The bear boss is literal garbage, and its clear it was never play tested. The developers are incompetent and its clear that they do not understand game design nor are they able to make something enjoyable.\n\nThe DLC really is just a bad walking simulator, and unlike an intentional walking simulator, the story and world are no where near engaging enough to support this severe lack of game play.\n\nThe game is also extremely buggy, and full of technical woes. It barely playable even after 10+ years of updates. Truly shocking.\n\nDo not buy Winter Mute, seriously. \n\nIf you want to experience it then just watch a play-through on YouTube as they will cut the bulk of the “game play” that is boring walking.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's fun for a while but this is just a chore simulator.  As you increase levels, you will be trying to make fire, boil water, cook food, every 10 minutes in real life.  It's very difficult to actually explore.  You will walk perhaps a mile in this game and it's night.  \n\nLike I said, chore simulator after a while.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like this game generally, but seriously, it's been YEARS waiting for the final episode. Kerbal 2 anyone?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game doesn`t even have a JUMP function. I should have known that this game would be trash from the beginning. Wasted 10h of my life",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This opinion comes from the perspective of: a) A streamer b) A fellow game developer who specializes in UI and UX. \n\nAUDIO:\nAs a streamer, it sucked to stream this game because of something that should have been extremely easy to solve from a technical standpoint: \"Play audio in background\". When I stream, I constantly have to switch windows to check things or scroll chat. Every time I do that, the game mutes itself unless it's the active window. Imagine how annoying that is for the viewer!\n\nMost games will play the audio in the background, and if they don't - there is usually an option in the settings to be able to do that. Or else the windowed mode will allow background audio - but not in this game. I found myself thinking: Did they not consider the streaming experience at all? No wonder there were hardly any people streaming this game.\n\nAs a side note, I also found it extremely clunky and weird that survival mode supported:\n1) full screen\n2) windowed\n3) windowed borderless\n\nBut story mode only supported\n1) full screen\n2) windowed\n\n???\n\nUSABILITY:\nI found this game highly unintuitive and confusing to play. Had I not had chat helping me through my first experience, I probably would have given up sooner. Games should be easy to get into but hard to master. Usability aside, there were also a lot of things that just didn't make sense. Here we are in the middle of the Canadian wilderness surrounded by thousands of trees, and yet we can't cut trees down? Ok we can cut limbs off of fallen trees, but even then you can't do that with any makeshift tool in the very beginning. Whaaat? This sort of thing was immersion breaking for me, as most survival games allow you to use your: \"What would I do in real life in this situation?\" logic and then succeed in the game by doing said thing. Instead, the game forces you to learn it's own \"logic\", which is tedious. \n\nI do have some positive things to say as well: Beautiful and immersive visual and audio experience. And I will force myself to try and play it some more since I have so many friends who love this game. But I will have to \"force\" myself. And that's not a good thing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Walk up the slightest incline. Sprained limb.\n\nWalk down 1 cm. Sprained limb. \n\nNot encumbered, not tired, probably insane by now.\n\nThe wildlife and arctic chill aren't even the true threat in this game, your jello limbs are.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The survival aspect is really well done and super cool.... However,  I love story a lot, and the story in this game is stupid. The bear is the worst and makes absolutely no sense compared to the rest of the story. I will not be finishing this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ugly tumblr art, skip cutscenes, walk along a boring linear path, run into some bunnies running around in circles forever completely unaware of you, game tells you to throw rocks at them, throwing controls are garbage, bunnies continue to run around as if you aren't even there, uninstall",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's been more than 10 years, with lots of updates and DLCs and all the same bugs and QoL issues remaining. Quests and achievements are a nightmare. Terrain always have 0.5 pixel of step you cannot step over and get stuck. And they added one more level of difficulty: \"Misery\". That is what you'll feel playing this. You wanted satisfaction and joy? Well rarely, mostly misery.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When you go low on health, you start flying and levitating around the world. My review will turn positive when that stops happening. 1/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly. Would rather sink my teeth into a rotten carcass than play this again. Once again I have succumbed to the Pole's requests and wasted a 5 sheet on this. Could've got a Greggs with that but instead I am left with yet another sodden icon on my library, just staring at me. Hoping, praying to be played again. Can't even refund it either as I bought a key for it!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely love that you can't shoot a wolf 5 feet away from you, even though it would have been a garunteed hit, then losing all my stuff and starting over. Love it. Yippee.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Design wise this game is a mistake. Mechanics are a joke, I need to click then always click again to pick up sth, climbing is a locked animation and you dont have control over it which cause sometimes unwanted climbing cause you missclicked, and then you have to wait until animation ends. Interactions are annoying. Story mode tutorials and guiding is just bad. I resigned when I had a low life and my character didn't want to move as I wanted which caused mowing away from campfire all the time and I was freezing with no chance to heat up. Every crafting or destroying lasts forever and game doesnt tell that this will cost you a lot of stats. In endless mode I chose random place and then I was exploring for 20 minutes running around empty world, I didnt find a single animal. Crafting tree is also very unintuitive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game. But there are hidden mechanics and quirks which kick in to make your run worse if you're doing well, such as the game screwing with your aiming among other things. That has made the game unplayable and takes any joy right out of it, add to it the fact that the devs announced TLD II without even finishing this one makes this not worth buying, sadly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm fairly confident that watching paint dry would be more fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its a Long Dark game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont recommend, wolves aren't like this in real life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring and sloppy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They never finished the main game",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The Long Cash Grab",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The bear",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "God knows, I loved — and still love — this game. It’s a peculiar one: slow-paced, sometimes illogical from a realistic point of view, but it creates a world and atmosphere of its own.\nYet the further things go, the more the developers distance themselves from the players. The game is technically still unfinished. Players have been waiting for the final episode of the story for more than four years now.\n\nWhat are the developers doing?\nThey’ve split the sandbox and the story into two separate games. They release paid DLC. Yes, not immediately, yes, with delays — but still, they release it. They’ve even announced a sequel. But they haven’t finished the story.\n\nOriginally posted by HiddenBlade:\nEpisodes 1 & 2: 8/1/2017 (1.0 Launch)\nEpisode 3: 10/22/2019 (2 years, 2 months, 22 days)\nEpisode 4: 10/6/2021 (1 year, 11 months, 20 days)\nDev Diaries:\n~4/22: E5 in 2023\n~10/22: E5 in late 2023\n~5/23: \"[not] this year\"\n~11/23: \"It'll ship in 2024\"\n~12/23: \"late 2024\"\n~10/24: \"We haven't announced a release date yet\"\n~4/25: \"end of 2025\"\nCurrent date: 11/12/2025 (4 years, 37 days since Episode 4; 49 days till 2026) \n\nNaturally, that frustrates the players. The players start asking questions. They start reminding the developers of their unfulfilled promises.\nAnd what do the developers do? First, they stop posting specific release dates so that no one can hold them to their word. Then they start heavily moderating the forum, deleting comments that criticize their inaction, and banning players who post them.\nEventually, they just stop saying anything at all.\n\nWell then — good luck to them!",
      "voted_up": false,
      "votes_helpful": 263
    },
    {
      "review": "I’ve played The Long Dark for years, and while the survival mode is strong, I can’t recommend it anymore. The game has been in development for over 9 years (Early Access started in 2014) and the story mode, Wintermute, is still incomplete. After nearly a decade, the developers have shifted focus to selling *paid* DLC instead of finishing the game we already paid for.\r\n\r\nWhat really leaves a bad taste is how the devs handle criticism. I’ve asked questions in their official showcase streams about when the full game will be finished, and I’ve been muted or shadowbanned for it. Instead of addressing long-standing concerns, they silence them. That tells me they know the community is frustrated but would rather ignore it than engage honestly.\r\n\r\nAt this point, it feels like they’re more interested in milking the player base than in delivering on their original promise. If you’re new to The Long Dark, just know you’re buying into a product that’s been dragging on for nearly a decade, still isn’t finished, and has devs who punish players for asking the obvious questions.",
      "voted_up": false,
      "votes_helpful": 490
    },
    {
      "review": "+ good atmosphere\n+ vast map with unique locations\n\n+/- realistic in some aspects, but not at all in others\n+/- challenging which can be good or bad if you like it\n\n- there's a glaring lack of content outside of the idea of pure survival, with you being unable to do things you would immediately think of for survival, and that is a big problem for a game which tries to do exactly the survival part \n- critique is not tolerated by the devs which is noticable because they're outspoken at the same time\n- the game was in development for a long time and while it's still in development the devs started selling paid DLC with significant content",
      "voted_up": false,
      "votes_helpful": 94
    },
    {
      "review": "Announcing the sequel before finishing the game is not a good look. Good game, bad business practices.",
      "voted_up": false,
      "votes_helpful": 76
    },
    {
      "review": "Truely I love this game but it seems like the developers dont care about their players.\n\nI bought this game years back when it first came to early access. I had been so excited and impressed by it. Then the waiting came. Waiting years for episode 1 and 2 to come out. Waiting years for eps 3. Waiting years for eps 4. And unfortunately most of owning this game is just waiting. I could understand a game taking up to 5 years to complete maybe, but this is just disrespectful to everyone that has spent money on the game. We dont need visual boosts that wont be noticed much by most players. We dont need every little area and word in the game to be perfect. Ive played the episodes so much that ive gotten tired and bored of them while waiting for the next one.\n\nThis game came out in 2017, if it takes you a DECADE to finish your game then you shouldnt have started it in the first place. Or, at least, made the game smaller. I've waited 8 years for Episode 5 and I can say without a doubt that NOTHING in the episode will justify waiting that long to finish this damn game. Stop sending your programmers to work on two other games and just focus on the one you promised your players 8 years ago.",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "Why no episode 5  yet?  Great game, but come on.  We've been waiting for a VERY long time.  Plus announcing the new game before finishing this one is lame.  I'll happily take this down and replace with a positive review once the game is finished.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The game was released way back in 2013. During 12 long years the dev haven´t managed to finish the storyline which they divided into 5 chapters (4 are out now), instead they have milked the idea by selling DLC stories and starting to develop another game. It´s like one buys a house and gets 4 walls and floor but no roof after waiting 12 years and the constructor says you can buy a garage and summer home from me also but you will need to wait for ever for that roof you paid for over a decade ago. It´s a good game, but the devs are either greedy, moronic or incompetent. \nAlso banning anyone  that points that out ^ will not help em...",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "I start the game, get to a village with a church, community center, market, houses, transportation, but nowhere is there a knife, axe, saw, etc. There's nothing to live in a place like this. How is that possible? It seems to me that the developers have strayed far from reality in order to complicate the gaming experience.\n\nI live in the city, but even I have a bunch of knives, a few axes, and lots of hacksaws. Everyone does. If I were to leave my home, I definitely wouldn't take everything with me, just like everyone else. I'll say it again, I live in the city. And here in the whole village, there are only drinks in aluminum cans. That's nonsense, not reality. It's some kind of unhealthy gamer reality—the whole village living on chips and soda.\n\nThe game is billed as a survival game, but it's empty. Instead of tools where they logically belong, and I got there, you're stuffed with junk to make it slower for you to move around the map. You'll be fighting not what you were expecting, but the developers who decided to take the easy way out. Slow down with this, slow down with that, and it seems like time has already passed, the purchase was probably not in vain, and you are formally surviving.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I was going to write a very long review about this game to avoid just saying \"It's bad\", but I'll shorten it.\n\nThe Long Dark is a great game similar to project zomboid where you survive until the inevitable, but I didn't really have fun in it because of how repetitive the gameplay loop is (refill your sleep, hunger etc) after it got drained in 2 minutes of sprinting for some reason. It is also not a story game, the story has to be purchased as a DLC.\n\nIt's great if you just want  a game to relax, but it's hard to do so when a lot of illogical things make the game harder than it should be (not being able to sleep without a mattress, the character not climbing slopes higher than 45 degrees, NO JUMPING, wolves running away when scared then 100% coming back until they get you next time, and my personal favorite and cause of end of my 30Hrs game, bears not dying after taking 4 pistol shots to the head and coming back like wolves 3 TIMES). The character also feels like a bag of potato that can't move any faster than walking speed without tanking through the energy stat like crazy.\n\nI usually don't put negative reviews on games unless I wish I hadn't bought them and unfortunately, although I had my share of fun on this game, it got too repetitive and I felt like I did everything there was to do after a few hours. I'm using this review as a warning, make sure it is the type of game you like. The Long Dark is absolutely not a bad game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Yes, this game is a work of art, but it absolutely, 100%, in every way, will disrespect your time and then gaslight you. \n\nI have put 150 hours into the game, which is saying something - time slips away because every decision matters. That should be a good thing, but, when you discover how your time investment of 100 hrs here, 50 hrs there, can be permanently lost in an instant because of the deliberately confusing and ambiguous UI design, you'll feel betrayed. Shame on the developers.\n\nMyself and others have lost 100+ hr runs because of the UI design. The UI does NOT inform you of what kinds of afflictions/debuffs that you have, even imminently lethal ones. This information is hidden inside of the menus. So, unless you remember to deliberately make the choice to open the menu to find out whether or not you might be dying (yes, even when your health bar is completely full, you can die in a single mouse click), it's on you to decide to access the menu or not, in order to discover that you're in danger of losing everything. Yes, the UI does not inform you that you could die in the next mouse click. Surprise! Permadeath, 100+ hrs of work deleted in an instant. \n\nIt's your fault, silly. Tsk tsk, you should've been checking the menus!\n\nThe game lets you \"pass time\" and also \"go to sleep\" while you're bleeding out, and also while you have lacerations, which are wounds that re-open in your sleep. Because there are NO visual indicators on the UI that you're bleeding out, or wounded, you can literally kill yourself by passing time or going to sleep. You did it! It was your choice to unalive yourself, silly! \n\nThe UI is completely bare except for an almost perpetual (always-on, meaningless boy-cried-wolf type of alert[!], for all non-ideal states, such as having the mere risk of potentially getting hypothermia... erm, this goes without saying, it's freaking cold out there). \n\nI lost 80 hrs of work on Stalker difficulty because I went to sleep for 2 hrs with blood loss, which I did, because.. I didn't know I had blood loss. Nothing on the UI warned me about it.\n\nContinuing with this, it also lets you make the choice to pass time and go to sleep while you're freezing to death, or close to predators. I lost a 70-hr run on the easier Voyageur difficulty because I slept outside in the same area as a (confirmed) single wolf, but a wolf that I had just shot twice in the head with a revolver, and then when struggling with it, stabbed with my knife. It ran away, tail between its legs, yelping, bleeding out, guaranteed to die within 2-3 minutes. Yet, it somehow went over to me and killed me in my sleep before its demise. (FYI - bleeding out wildlife will not track you down to attack you.. so, um, excuse me?)\n\nI've also had shorter runs lost because of this sleeping mechanic as well, sleeping while it's warm, even bundled up, inside, literally in shelter, only for the weather to rapidly change to freezing, and then kill me in my sleep. \n\nThis actually sounds thrilling, right? Going to sleep is the scariest gamble you could do, right?Well, the game forces you to sleep to stay alive, so no, this is simply disrespectful to the player.\n\nFor those that don't know - the game saves instantly as things happen, and your saves are instantly deleted as you're dying, not afterward. It's truly brutal. You can't even Alt+F4 to save yourself.\n\nWhy would I start over again, spend another 100 hours, only to lose everything when I decide to go to sleep? You've gotta be insane. The Long Dark - after 150 hours, you'll find out that the scariest, most dangerous thing in the treacherous, barren, icy, -60°F Canadian wilderness, filled to the brim with wolves, bears, and cougars, is your very own plush, down-filled sleeping bag.\n\nIt would be trivial to add red warnings to the UI, even red icons for the different afflictions, and a flashing red blood drop icon for blood loss (it'll only be on your screen for seconds before you bandage, or minutes before you die), but unfortunately the developers have pursued ambiguity in order to gaslight the player into questioning their sanity after hundreds of hours of labor poured into their runs. An absolute shame.",
      "voted_up": false,
      "votes_helpful": 20
    }
  ]
}