{
  "positive": [
    {
      "review": "Unrealistic.\r\n\r\nFerrari won. That was my first sign. Then Bortoleto got 2nd.",
      "voted_up": true,
      "votes_helpful": 196
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☑ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ Replayability }---\n☐ One and done\n☐ Maybe after a year\n☑ Worth a second run\n☐ Played it 20 times and still not bored\n\n---{ Microtransactions }---\n☐ None\n☑ Only cosmetics\n☐ Slightly pay-to-progress\n☐ Pay-to-win\n☐ More shops than gameplay\n☐ Casino Simulator\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 215
    },
    {
      "review": "Really cool game with realistic feature, I recomend not playing in public servers",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "Won a race with Ferrari, and the game crashed. Even EA doesn't believe in Ferrari.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 26
    },
    {
      "review": "As a first-time F1 game player, I actually had a really good time. It’s definitely worth trying if you’re into F1 and want something that feels a bit arcade-like but still has some sim elements. It’s not on the level of iRacing or Assetto Corsa, but it has its own strengths.\n\nThe game is easy to play with friends, and it’s nice to see a co-op career mode included. Breaking Point is also a great addition, giving players a story to follow and challenges to complete.\n\nMy Team is honestly awesome. I enjoy it way more than the regular driver career mode. The recent AI update improved things, although the AI is still too slow on corner entry.\n\nOverall, I hope the series keeps improving, and I’m looking forward to seeing what F1 26 brings.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "It feels better than F1 24, but it still makes you miss the 2020 game. In online races with your friends, you can enjoy the game to the fullest.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "In real life, Ferrari can't find their way to the podium. In this game? I can make them champions.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Best game overall since F1 20, easy to drive even on controller.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I would love it for preset helmets for teams | Stickers to put on your helmet without mods, like the Unicorn Sticker, Mobil 1, Visa, Ect, just like how you can customize the car in My Team, just like in Nascar 25 for example, you can customize pretty much everything in your career in that game, and also add more customize options for My team. Helmets, Livery, Ect. That's pretty much all I have. Great game. Worth buying",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I think it's a nice improvement on the last game. The car feels much better to drive, the game looks nicer and runs pretty alright and the new my team 2.0 mode is fun. In terms of AI the game is also a big improvement, I never played any of the older F1 games but it's definitely a lot better than F1 24 on the difficulty that i play against (100-110 depending on the track)  However not much else has really changed in terms of gameplay, still the same driver career mode and F1 World is still just kind of pointless, and this is still EA so you better expect some overpriced DLC and cosmetics in the shop.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of the best F1's out there, the game is genuinely fun and enjoyable to play. I really like the physics improvement, the way the car handles feels satisfactory. The tire simulation is not the best, but it is pretty solid, and the dirt air really punishes on this game. It's not a full sim title like Assetto and iRacing, but it's fun and doesn't demand a lot of concentration like the titles i mentioned before. The online is a mess and thats why it's awesome (not a mess in technical way, the players are just completly insane or full sweats). I really recommend picking it up during the sale (the full price is a bit expensive). All the modes are incredibly fun and thinking about having 2 seasons in 1 F1 game (reminds me of F1 2015) adds a cool and immersive touch to career mode.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Learning more about the f1 sport via this game... Everything is good so far!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Can do better but compare to 24 I see upgrades here so, keep up Codemaster, before saying goodbye.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "F1 25 brings a noticeable improvement in handling, AI behaviour, and overall gameplay polish. The Standard Edition gives you the full experience without needing the Iconic pack. Career mode feels solid, graphics look cleaner, and multiplayer is smoother this year. Still has a few bugs and AI inconsistencies, but overall it’s a fun and worthy upgrade for F1 fans.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Handling is the best it's been in years. Optimised well and looks great.\n\nAI is decent enough but difficulty sliders seem to just make one or two drivers insanely quick and not the rest.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yes it is very nice good game and they are extending it for another year.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best f1 game to be released after f1 2020, game is really fun and the car handling is very good this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "F1 25 gets a lot of things right. The gameplay is a big step up from the previous entry more responsive, more dynamic, and overall much more fun again. I also appreciate the decision to release F1 26 as a DLC, giving the developers more time to focus on F1 27.\n\nThe continuation of the Braking Point story is well done, too, building nicely on the previous chapter.\n\nOverall, it's a strong update to the series and an easy recommendation for any F1 fan.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best F1 game i played since long time, gonna play this game for so long maybe untill 2027",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its crazy how big a upgrate this game is compared to f1 24. i really like f1 25 yea. but that the 2026 season is gonna be a dlc is like very questionable",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Pro's:\n- Race at Jeddah\n- Divebomb Hülkenberg\n- Hülkenberg pushes you into the wall\n- You get DNF\n- Hülkenberg gets no penalty\n\nCon's:\n- There is a McLaren team\n\nBut seriously its a very enjoyable game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Open lobbies are just great \r\n1ste you start with 20 on the grid and last one standings wins!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall a great game, the only problem is it sometimes doesn't launch, but the fix is to put into the launch options -graphicsadapter=0 and then make sure all of your drivers are updated. This fix helped me play the game on Intel iris xe graphics with 128mb video storage and 8gb shared vram.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game the now gamemodes are questionable but the game itself is beatiful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, for F1 fans with real voice overs and visuals of tracks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "F1 2025 takes the racing sim to new heights with stunning graphics, refined gameplay, and immersive features. The game’s visuals are breathtaking, with realistic car models, dynamic weather, and lifelike tracks that bring the sport to life.\n\nThe gameplay strikes a perfect balance between realism and accessibility. The physics system has been upgraded, and weather effects now impact handling, making every race unpredictable. The revamped AI feels more natural, with opponents making smarter, race-driven decisions.\n\nCareer Mode has been expanded, offering deeper team management and personal rivalries. You can now develop your car, manage budgets, and face contract negotiations, adding layers of strategy to the experience.\n\nMultiplayer remains top-notch, with smooth online racing and fun live events. The sound design is spot on, capturing the roar of engines and track ambiance perfectly.\n\nOverall, F1 2025 is a thrilling and polished racing game that sets a new standard for the series.\n\nRating: 9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Challenging mechanics and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pulling 3 second penalty out of their ass\nanywars super fun game by getting 10 seconds by driving 1 kmh too fast in pit lane really",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing, had a little bit of a hard time figuring out how to get more fps. for anyone out there do not put your graphics above high unless you have a NASA super computer. Other than that the game is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can't believe EA finally made a decent f1 game. Much better than f124 by a longshot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, just don't like how clunky it feels with controller",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very challenging and realistic. I love how well everything handles even using an XBox game controller",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great. its so fun and keeps you engaged. anyone who likes F1 this is the game for you. very begginer friendly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So, compared to last years game, this is a win. it has many features that are completely new, for example the renewed my-team career mode, and its really better than the last years versions. The AI is way better than before, which you really notice because the AI in F1 24 to say it lightly, was complete garbage. Playing with a wheel is really fun and i can recommend it to anyone who is planning on putting over 50h in this game. Even with the price of 60€, in my opinion its still worth it (although there are sales that put it down to atleast 50€ every so often)!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This f1 îs better then the last game.I like to play two players carrer this mod is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really fun and immersive. It is worth the money!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so fun in two player career,i bought this on a recent sale and i wasnt expecting much but man its amazing. its easy to get used to the controls and everything,its even better if you have a steering wheel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm [b] just useless. [/b] The game has [b] no problem. [/b] The second car is on pole, so they probably [b] just need [/b] to change driver",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is crazy good with friends. single player is fun only the first couple of months. so buy it in sale with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun and engaging gemplay but it can fell pretty repetitive when you reach a point",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean its good, no doubt, with a good pc you can really enjoy it and a wheel. Not to say controller is bad Ive played 3 or so hours with it and its easily playable. JUST ONE THING\r\n\r\nTHESE DAMN PUBLIC LOBBIES, it genuinly feels like you are going against lobtomized children. NO RESPECT for driving this sorta stuff you wouldnt see in ACC or LMU. jus sayin",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game feels good; it's not perfect, but it's definitely an improvement, although the AI is sometimes a bit odd.\r\n\r\nI like both career and multiplayer, and I'll definitely try out ranked mode soon.\r\nAll in all, the game looks good compared to, for example, F1 22 and 23.\r\n\r\nI'm looking forward to spending many hours on this game.\r\n\r\nHave a great time playing it! (P.S.: I bought it for 30 euros, which feels like a good price compared to the standard price).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game, way better than F1 24. Thanks EA for actually creating a sick game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "McLaren car is cracked as hell, Stroll rear ended me on a straight, pretty damn realistic.\n\nWish the online community was better and penalty system was slightly adjusted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i find f1 25 better because the physic changed and the ai are not as wreckless like its predessesor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☑ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has evolved significantly since F1 22 featuring improved handling systems and more realistic F1 racing. The AI in career modes are more advanced, making bolder moves that enhance the overall immersion. This year they have created some new experiences with the new reversed tracks which a fun to race on making the game more enjoyable for different players. For players eager to try F1 racing online, be prepared for the unexpected (In my experiences there are unpredictable and unique moments can occur when you least expect it) personally I would stay away from online for your own mental state.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic F1 game which fully immerses you in to the cockpit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game for everyone who has racing or is a max verstappen fan",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really cool game with realistic feature. As an F1 Enthusiast I support this game, wholeheartedly,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, nice game! \r\nThings that could be improved:\r\n1. add APXGP back! Right now there's no way to acquire this team in game.\r\n2. add more victory voice lines. Also include voice lines for driver icons.\r\n3. guy on the radio should be less talkative.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game engine is better, the AI even though it's still lacking sometimes, is better than last year, and the game feels great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is just such a good Game! The graphics are surprisingly stunning, even on low settings. The handling feels very responsive. Although not the best Physics, it's still pretty good! And lastly, there many things in it, like Driver championship, F2, Team creation, etc. They really outdid themselves for this Title! Would definitely recommend if your a fan of fast, competitive and online chaos!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game looks good. After a few laps, I can confirm that the controller and wheel are working properly. Even with the controller, it is possible to handle the cars.\nUnfortunately, the game won't start on Linux. It detects Proton and closes with a note about not supporting it.\nSetting up my Fanatec wheel was a little bit annoying, but after understanding where the issue was, it`s fine.\nOverall, I'm glad I bought it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seriously a lovely experience. I've played multiple F1 games in the past and this is by far the most immersive.\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EA have actually listened and extended a game for more than a year, interesting to see how that goes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, I love watching formula and after a bad race for my favourite driver I just sit there and get them a fwe WDC's myself :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! love the storyline and gameplay gotten from the storymode! finally some interactive storyline with fun situations you have to drive hard and fast to get out of!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "F1 is a good game since 2018. So you can't say it's a bad game. Of course the peak was 2020 but 25 is not a bad game.\n\nThe AI is cooked. But the bugs are very crazy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☑ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☑ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☑ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "F1 25 feels like the series finally found its balance again. The handling is the first thing that stood out to me — the cars feel more planted and predictable compared to the last couple of games. When you push into a corner, you actually feel the grip building or disappearing instead of the car suddenly snapping. It makes driving fast way more enjoyable.\n\nVisually, the game looks great. Tracks feel more alive, lighting is cleaner, and racing in the rain is honestly awesome. The spray, the reflections, the way the car struggles for traction — it all feels more believable.\n\nCareer Mode is probably where I’ve spent the most time, and it’s solid this year. AI drivers behave more realistically, overtakes make sense, and the weekend progression feels smoother. You can actually see your team getting better over the season rather than random boosts.\n\nMultiplayer has been pretty stable so far. Lobbies load faster, and there’s noticeably less chaos thanks to the improved collision and penalty systems.\n\nIt’s not a revolutionary jump, but it’s a genuinely enjoyable step forward. If you’ve been waiting for a more polished and consistent F1 game, F1 25 definitely feels like one of the better entries in recent years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun game would definetly reccomend if like f1 or any motorsports",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great addition to the franchise.\n\nPlenty of content, greatly improved physics and AI with a lot of close racing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoying myself so far, handling on controller is pretty good. Hoping to get a sim setup soon to really test it out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The graphics are good and the gameplay is also varied, especially with ultra settings and ray tracing on in rainy racing conditions, the graphics are really cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It still full of EA crap, but it still fun to play with friends. If you want better simulation, go back to Assetto Corsa with RSS, VRC and other mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is no one more shocked than me that i have recomended a F1 EA game for anyone to pick up. this game has shocked me very pleasantly and is what an F1 game should be. the handling Chef's kiss, the AI i think there is room for improvement yes but it is a hell of a lot better than 24's AI. they are aggressive but fair and i love that about them. after playing only 17.1  hours roughly of F1, i sowre to never buy a EA sports F1 game again, but i found it on sale and the fact they are giving this game a dlc for f1 26 and taking a year off to improve F1 27, i am cautiously optimistic that they will produce a all round game for that year based off of this game. if you are debating or holding off on buying this game i would recommend you buy it especially around the time of this review as it is 50% off its original price. very good all round game in my opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If u want to be brain damaged just launch this game and play some online in it, no matter what u do there will be one Kvyat in the race ,and just gonna torpedo you. Very Good game ,lost at least 20 brain cells.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was driving as leclerc, strategist made me pit for wets with 0 drops of rain on track, and took a 40 second pitstop. Accurate",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, just a bit complicated if you're looking for a racing game. Really nice to play with a wheel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "F1 25 is a major improvement over F1 24. The driving model feels much better and delivers real fun, especially at higher AI levels. Unfortunately, the online mode isn’t very engaging and is full of sore losers who can’t handle being overtaken.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent game not many changes compared to 2024 also i had wish they will add old models too v8/v12 era for custom race but sadly not in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, much better than the f1 24 im terms of the gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only get it on sale, but overall good. only thing is 1. the handling still isnt great, but better than the previous games and 2. it sometimes crashes on my amd card",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is worth your money, Handsdown one of the best game since Fifa23 soo, i  strongly recomend it, if this is your first F1 game it  would be the game that make you enjoy F1 more than EA previous release (F122 F123 F124)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got Strolled while racing in Monaco\n10/10 game, very realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game, easy controlling, even without any assist, Braking Point continues, with career objectives mid-race and an option to choose Konnersport as your own team in Team Career or choose one of Konnersport drivers. After you finish BP Chapter 15, you can also select Konnersport to be the 11th team in DC, if you choose to start from scratch. You can also select icons to be able to compete with. I really miss an important detail, which could make the games image more enjoyable, if a ranking gp could be enabled, I mean a 5 laps long training circuit or choose one from the calendar or any previous circuits, to determine what is the best competitive difficulty level for yourself. You could also add something like in F1 Manager, a setup calculator, because I don't want to waste 2 hours just to browse and save them from time trial. I know I know, I am not a programmer, I can't even imagine how hard would it be to add these extra details, but all I know is the car setup is crucial at anytime, it can influence straight line speed or cornering speed, there are some premade setups which are helpful, but if you have a balanced circuit with both fast corners, slow corners and straights like Miami, if you go Balanced, you lose time on straights, if you go with minimal front and rear wings you lose time in the corners. I know that there isn't such setup, that can fit all corners, but to find the middle way, where you gain some time on straights, but you can compensate with the other, I mean lets stay in Miami, I adjust the wings to 7-7 so what should I adjust to compensate the low downforce? Yes, the help menu gives some help, but now with the rapid constant innovation of AI this could be achievable to get a more helpful guide how to adjust the perfect setup. For instance if you lock up everytime in turn 9 in Bahrain, how to adjust to be less severe or frequent. Mostly it depends on the driver, but sometimes it can be evitable with a tiny modification. \r\nThank You, best simulation game ever. Hope to see some difference!! ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wouldn't say it is better but as an F1 fan, obv we love it and multiplayer is the only crazy part haha!!! Buy it when it's on sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wish the game was a bit better but fun with a community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good game i wont lie, the issues in this game mainly come from the fact people playing multiplayer cant drive to save their lives",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good, but FFB gets disabled after alt-tabbing and the only way to get it back without restarting the game is unplugging and replugging the wheel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, career mode very much improved",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "drives better than 22 and 24, but not better than 23. \nI like the new My Team car livery editor\nMy Team rework is cool, but I miss being my own driver in it, but that is not much\nHappy 2026 will be a paid dlc not a new game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Except that servers are down every other hr, the game is gooood :D\n\nAwesome visuals if you have the muscle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love this game and would recommend to anyone who is a big F1 fan like me. I would also recommend getting the icon version because i got Ayrton Senna from it and also Michael Schumacher.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Graficos e optimização muitos bons, acredito que seria interessante trazer carros antigos para quem sente falta, jogos antigos tinham entao nao seria grande trabalho!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is quite solid. It has story/career mode, time trials, F2, multiplayer, invitationals and overall plays quite nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better compared to F1 24, performance doesnt exit with alt+tab",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Driving without assists is really hard but with a bit of practice it is a really good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, they should consider bringing back the APXGP pack",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i had real fun while playing this game. the multiplayer could have been advertised more properly and could have organized some online events for the race",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the only place where you would be able to beat max verstappen (but its the temu AI version which you set to the lowest difficulty.)\n\ni like how you can adjust the difficulty at any time to suit your skill level.\n\ngame is fun but i dont really like season pass being in a racing game.\ngame is really good and so much fun when you have a racing sim compared to just using a controller.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very smooth driving the graphics are good if you LOVE F1 you will enjoy this game alot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very realistic\r\ni got a message that Lance Stroll is out at the first lap at my first monaco race\r\n\r\nHighly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is by far the best f1 game yet since f1 2020. Skip 24, 23, 21 This is the game to go to. The driving model feels great the AI races are fun and over all since its getting 2026 dlc its a great pick up to get for your sim racing library",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only 7 hours in and I'm loving the changes to Career mode. I like the option to play as owner and not owner/driver. I still suck at the actual racing, but that's not the game's fault lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If your looking for demolition derby gameplay just play multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "why is this game so easy i was p1 in first lap (formation lap) still got penalised and was last",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Does not run on SteamOS, and has an invasive anti-cheat. Doesn't even let you play single-player in that case. Garbage practices by EA as usual. Would not recommend.\n\nIf you are on SteamOS or rely on a VM for any reason, this one is not worth buying right now. Same game as F1 23 tbvh.",
      "voted_up": false,
      "votes_helpful": 118
    },
    {
      "review": "Multi-billion dollar company, and yet the game has been worse than the 2020 game for five years in a row now.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h3]Boring, uninteresting, another F1 installment that's no different from the previous ones, but EA really wants to sell the same thing every year at full price.",
      "voted_up": false,
      "votes_helpful": 63
    },
    {
      "review": "Wasnt even able to get into the game due to javelin anti-cheat errors lmao. Those 2.6 hours is me restarting the game over and over again with multiple methods to try fixing it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the same game again with minor changes and loads of bugs. take the rights from ea, they ruined the games.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Absolutely terrible game do not buy, they don't care about this game, they do not listen to feedback or communicate with us, the game is constantly losing players every single game yet they still manage to release games like this. The game is still incredibly glitchy after half a year of being out, handling is terrible but an improvement on F1 24, tyre wear system is good but everything else is terrible.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I've become one of those \"negative review, 70 hours played\" kind of people, huh.\n\nSee, F1 25 is a step up over 24 in a few regards, largely (and impressively) performance. The game runs well on ultrawides and VR and the whole nine yards where its predecessor did not. Codemasters' strong work on the solid base here continues to shine through, but what's kind of nagged at me throughout is I felt consistently like I was waiting for the point where I'd settle in and it would Get Good, and at the 71 hour mark, that should have been earlier than now.\n\nLaser-scanned tracks! That's cool. I could not tell you which of them they laser-scanned, just by like, playing. Reverse tracks! I would love to dunk on how pointless it is that there's only three of them, replacing the usual bonus track from the past few games, but I will say, Reverse Zandvoort kinda slaps.\n\nBraking Point reaches its end with a conclusion that I know I played when this game came out but I could not tell you what happened in it. It is a Sports League Tie-In Story so things can't actually really happen. I will concede that despite myself, I was a lil' emotional over one decision involving a character I'd been playing as in three separate games, so they do deserve some credit on that.\n\nMy Team 2.0 is the thing I latched onto, the reason I bought this. Building your HQ, assembling your own car, all the RPG elements cranked up to 11, it really seems fascinating. But it's really incomplete and inconsistent.\n\nIn practice, there are *not* countless different builds you can end up with, or competition levels you can be at compared to other cars, like R&D in other games (and modes) in the series. Instead, there are three tiers of Breakthroughs for each department. Functionally, each competitor is thus at one of four levels of competition, and you will be bottlenecked by having to wait for the next Breakthrough *when* you have caught up on all of your R&D really quickly. Not if. It will be when, if you are any degree of competent at it (and I'm not! and I still had that problem!). Between HQ management, tire and engine management, driver and staff management, and car development management, it *should* be that perfect ebb and flow this series is sometimes the pinnacle of, where you do lots of prep, put the car out on the track, and hope it's what you need.\n\nIn practice, it is lots and lots of menus and completely pointless jabbering from 3D-modeled advisors that interrupt you constantly, repeating the same few voice lines and animations, getting in the way of running races that feel exactly the same as the rest of the game. As you are no longer an owner/driver, you do pick which driver you play as, but this leaves the mode feeling disconnected or pasted over the existing framework, as you aren't even the same guy when race weekend hits. \n\nThe sponsor decal system feels fantastic and visual customization is immensely better than it's ever been, and even online public lobbies are lovely to look at with incentives to easily whip up something good-looking. Filling the car out with new sponsors over the course of My Team is super satisfying.\n\nAs ever, radioing the crew by just pressing a button and then actually speaking feels real dang nice.\n\nThe lil' bit of voice clips and the way you're addressed changing when you're playing as one of the actual season drivers is real neat and adds a little something.\n\nThere is a wealth of voiceover commentary in this video game, all of which will trigger at the complete wrong times. Your crew will merrily radio in to keep up the good work managing your tires, while they are blowing and firing you into a wall. Davidson will, without fail, every Sprint weekend, first declare \"well, they say that a change is as good as a rest...\" and then, however you place in the Sprint, start the race day commentary by telling everyone you did amazing and you've got to be riding high after that success *and,* under a second later, that it couldn't have gone much worse, what a shame. It cannot get out of its own way, and I cannot stay immersed for over 20 minutes. All this presentation is supposed to be their one big showy leg up, yeah? It ought to at least be good.\n\nDriver Career is identical to F1 24, except you can also race as or against the APXGP team from the F1 movie- what's that? Sorry? Oh, you didn't order it the month it came out? No, then. You can't do that. Nah, one of the entire playable teams in the game they just removed all way to access. Sorry about that.\n\nYou can use any *real* team from the F1 2025 season, though, and you can even select their special liveries from throughout the year- what's that? Oh. No, you can only do that outside of career mode- oh! And you have to have played certain specific online events when they were around. They're gone now, so no, you can't do that.\n\nF1 World has an RPG-esque system, where you can unlock all sorts of upgrades for your multiplayer car. If you don't want those, you can trade them in to unlock pictures for a little F1 history scrapbook- what's that? Oh, that was F1 24. I see. In this one, you can trade them in to get... extremely small amounts of in-game currency usable only for buying more parts for the same mode. Okay.\n\nThis is a game starving for a coherent vision and content, and it is rapidly losing both the longer it's out. If you purchase it now, you will be getting an actively worse, lesser game than when it released, and it needed help when it released. I really, really want to love it. When it fires on all cylinders, you catch glimpses of a beautifully assembled game. However, it does not do that for over a couple minutes at a time.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm mainly playing this on the consoles. Whether you're a casual player or a competitive one, this is a great F1 game with substantial, noticeable improvements on its predecessor. \n\nPurchased the PC/Steam version to play in VR (don't have PSVR) however the PC version kept crashing on me. So I had to refund.\n\nDon't know if the issues are resolved. \nAnd I won't be purchasing again unless it is heavily discounted. \n\n\"Not Recommended\" review is for my PC experience only. If it works well on your machine, or if you want to play on the consoles, I absolutely recommend F1 25.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you can get it to load, it's a pretty standard offering for F1 games over the past few years, nothing new on the surface.  The handling feels better than recent ones, and the single player career mode is interesting with some familiarity with some new twists.\r\n\r\nBut...that's if you can get it to load.  The load times in best case scenarios are incredibly long, including when just trying to quit the game.  For example, starting the game, loading the menu, then loading a race can take 7-8 minutes.  Worst case, the game constantly crashes when trying to start, and with the load time issue, it's nearly impossible to tell if the game will ever load.\r\n\r\nAlong with that, it's an EA product, meaning it's constantly trying to advertise and upsell you.  Popups whenever going to the main menu trying to tell you about their latest package you can pay money for.\r\n\r\nOverall, I liked the actual racing, but the wrapper around it was just too much of a pain to deal with.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "OMG, the constant \"Communicating with Servers\" screen makes me want to burn this game. I have huge internet bandwidth, why does it take 10 seconds+ every third item I recieve, or change menu mode. Seriously, update your anti-cheat in the background.\nBut too late to refund... So I might as well persevere, considering I'm in a 2 Player Career with a friend. At least that's not bugged.... Oh wait, it is... sometimes grid forms up in team order, not qualifying order. \nThen there's the AI.... They're either backing out early (braking early) which makes it hard to predict them if you're following, or they stick solid on the outside, and tap you and you spin out, yet they're unaffected. You can literally try to push them off track and they barely move, yet they touch you and your in the wall. Apparently it's to do with their simple physics/traction model, but when you're trying to race wheel to wheel, you are literally on a knifes edge...\nThen there's the public multiplayer modes... unless you like being sent to the shadow realm with no repercussions for the perpetrator, jump on a public lobby... there is absolutely no inkling of good racing there. just f-wits and griefers.\nOnce my 2 Player season is over, i'll be uninstalling and switching to another racing game, then await the 2026 DLC, for next F1 season.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "great game but keeps crashing on loading screen. not the only one having problems as its all over forums and ea has done nothing to fix it. waste of money until it gets sorted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "F1 25 is a complete disappointment for VR users. I genuinely want a refund. I bought this specifically to play in VR, but after countless attempts, the game refuses to launch properly in VR at all. I tried every setup method, launch option, runtime, and hotkey trick out there, and nothing works.\n\nI tested both OpenXR and SteamVR, added launch options like -vr and -steamvr, tried forcing VR through command lines, toggled OpenXR runtimes, and even adjusted hotkeys to switch display modes. The result is the same. The game either boots flat on monitor, gets stuck, or fails to initialise VR entirely. A AAA racing title should not require players to go through hours of technical trial and error just to start a race.\n\nThe VR implementation feels untested and unstable. Hotkeys don’t respond, the game keeps fighting over VR runtime selection, and there is no clean way to launch directly into VR without breaking something else. I never managed to start a single proper VR session.\n\nEA needs to urgently fix F1 25’s VR launch process, hotkey conflicts, and the messy OpenXR/SteamVR integration. At this point, this is a one star product for VR players. Broken at launch, not user friendly, and absolutely not worth the money until they patch it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DON'T BUY IT UNLESS IT'S 75% OFF\n\nEA being EA... They released an update that broke what was working, and what wasn't working is now working at 45% capacity. I never would have expected how well they would manage to imitate Apple's strategy. Over time, the game is dying like the battery percentage on an iPhone. When it was released, everything worked more or less OK, but now? I turn on the game and the sound glitches, it lags, and so on. Adding a \"new mode,\" yeah, sure... Why does it look like what we get every year? But this time, they're giving us the chance to get unique team liveries. WOW, thank God I was able to connect to the event on the first try... \nEA, please start thinking before you bury the F1 game series... Money isn't everything.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game cant even handle two player carrier and its the same shit over and over again fuck you EA sports for ruining a good game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The driving is ok, but Driver and My Team career feel very barren, multiplayer is a hellhole and gating limited time rewards behind it is an awful experience. I still like the game but I wouldn't recommend if you have any other F1 game honestly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuck ea cunts ruining the game, codemasters had it working fine without them, shit game when it does work buggy as fuck and in general shit fuckass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "แถบจะไม่มีอะไรต่างจากปีก่อนเลย นอกการเรื่องการขับที่ดีขึ้น และ ไลน์อัพนักขับใหม่ \r\n\r\nในmode Career mode ก็ไม่ได้แต่ต่างกันขนาดนั้น ทั้งทีนี้คือmode จะทำให้ผู้เล่นติดอยู่กับเกมได้มากที่สุด\r\n\r\nในส่วนก็ mode multiplayer ก็เหมือนกับภาคใหม่ๆก่อนหน้าของ F1 มีก็มีไปงั้นๆหละไม่ได้สัมผัสถึงความ competition อะไรทั้งนั้น\r\nแล้วไอ้ F1 Movie อะไรนั้นถ้าคุณเล่นจบเชื่อผมเถอะว่าคุณไม่ได้อยากกลับไปเล่นมันอีกครั้งหรอก \r\n\r\nอ๋อและก็ใช้ที่สำคัญที่สุด AI และพวกประสิทธิภาพแต่ละ team โดยเฉพาะ Ferrari มันเร็วกว่ามากในบ้างสนาม ทั้งที่ปีนี้ทุกคนก็รู้ว่าเป็นไงในความจริง ดูเหมือน Aiพวกนั้นจะไม่ได้รับผมกระทบใดๆเลยในด้านของฟิสิกส์ของรถ dirty air, การสึกหรอของยาง เขาเหมือนทำให้รถขอAiมันเร็วขึ้นเฉยๆแค่นั้นเองให้ เอาง่ายๆคือ **ความยาก = Ai รถเร็วขึ้น** แค่นั้นจริงๆ\r\n\r\nละทั้งหมดนี้ ผมจะให้คะแนนเท่ากับ \r\nMclaren double DNF/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Coop's career is not working. Unable to connect, issues with sending save files... Anticheat crashes the game because of overlay software that is not at all connected to the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is borderline unplayable in VR. They removed upscaling so the game looks terrible. The shadows are too distracting and the render resolution is so poor that it looks like you are playing a 480p game. This will be the last game i play from the franchise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stopped Running after the first session.\nCant start the game in either normal or VR Mode.\nIt ALSO generally just takes 10 minutes to start to begin with.\n\nVictory Voicelines are fucking annoying and theres no \"no reaction\" option for some reason.\nVideo Settings are overcomplicated.\nDeactivating Racing Assist does NOT deactivate Racing assistance for whatever reason.\nWithout Raytracing the game gets around 160 FPS and with RT enabled that drops to 50 FPS.\nI guess thats the best thing I can say about this game. Its non RT graphics are decent.\nBut the rest is overwhelmingly dissapointing.\nBetter off playing Trackmania or something.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "couldn't connect to multiplayer sessions, no previous pending allegations from ea account by the way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy the game, sure, but it's more or less an exact copy of F1 24 with better handling.\r\n\r\nTo be honest, I have almost zero respect for these developers. How can a game like this still have this many bugs? I'm 5 hours in, and I've already experienced the following:\r\n\r\n• My driver ending the race a different gender to the one they started in.\r\n• A high pitch whine when I zoom into my ingame monitor.\r\n• In online career, I qualified 5th, and my friend qualified 17th... yet I started the race 17th, and they started 5th.\r\n• The AI having perfect grip and acceleration out of corners in the wet!\r\n\r\nI just don't understand how we keep letting companies get away with stuff like this! Just because there's the possibility of future updates? Games rarely used to be released if they had game breaking bugs. Now we just give rubbish companies a pass? Stupid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The first time trying to load multiplayer in VR loads indefinitely. You need to login to EA, but it won't let you do that until you turn off Steam VR and open the game in \"desktop mode\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EA's Anti Cheat triggers Windows Defender every time I launch this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kernel level anticheat that can't be disabled even if you want to only play singleplayer. It's basically the same game as in the past couple of years but with a sprinkle of new bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you have free will and an inner monologue, the anti-cheat will detect it and the game will not start. Modern audiences only.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is very hard to recommend unfortunately but after giving it a thumbs down, I decided to give the thumbs up after some heavy and not yet finished tinkering. On PC and PCVR, this is not a plug and play experience. Technically the game crashed an awful lot at the beginning, with auto settings the game applied itself.\n\nHere is my hardware:\nRyzen 5800X3D\n32 GB of really kickass ram\n4080 Super\n4 TB of SSDs\n\nThe game decided to run itself on ultra high settings with pathtracing enabled. I hit the benchmark button and was greeted with a 1080p game, looking like garbage on my 3400*1440 monitor, Also the benchmark crashed. I decided to set all raytraving and pathracing effects to off and the rest to ultra high, as well as native resolution. The game runs with 120 fps like that, super stable and good. Raytraving and Pathracing won't work even on ultra high end hardware if you don't wand frequent crashes or garbage resolution, so avoid it at all costs.\n\nThe internal upscaler is not working correctly. If you decide to use it, ultra wide monitors will force the game to crash as soon as the upscaling takes effect. \n\nPCVR is a different matter:\nThe Game decided to use the following settings: Medium VR, again with a garbage resolution of 1700*1700 Pixel on the Meta Quest 3. I started to tinker around and was able to up the resolution to 3200*3200 on mid settings but the game stutters then and again. I think the best way is to lower all graphic settings to low or off and set the resolution as high as possible, I will try 3700*3700 and see if that works. I figured lower resoluions just look distracting in racing games. I am tryint to achieve 90 fps instead of 120 here. Let's see how this will go.\n\nGameplay wise this is the best F1 game ever made, period. The braking point story is cringe and garbage as ever but the racing action is actually really good and the szenarios are fun and engaging. My team is back and better than ever, letting you cheat this time if you want it. You can hire a garbage driver and a good driver and always drive with the bad one to achieve better. But this may appeal to many people for this is a fantasy management game, so I guess this is fine.\n\nThe car handling is better than ever, with LIDAR scanning, finally! Some kerbs have become kerbs and you always know what the car and the tyres are doing. I remmeber it being a bit hard in 2023 at times. Also you must know that the odd number team is the better one. The straight number iterations are made by other developers, wherefore I always skip these and intend to skip the next one too.\n\nIs this worth 60 €. No. But on sale for 30 € it is a nice tech demo for PCVR. Also since the game has so many difficulty settings, basically anone can play it. It runs great on conroller too, but I hate E.A. for making this steamdeck unfriendly. This is just dumb game design, by dumb people.\n\nEdit: Still constant random crashes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game would be nice if they optimized it. I don’t have the best computer but I don’t have a potato either. I only know it’s not optimized because it definitely takes a lot to compute the FFB to my wheel and makes my stream lag and just starts making gameplay lag and then sends me off into oblivion like it’s trying to break my wrists. I am even running it on ULTRA LOW SERTINGS…. SMH. You’re a driving game that hasn’t optimized your wheel ffb yet",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if your a big f1 fan, want somewhat realism and all that jazz this game is for you, i love the game but this gets a bad review from me because the game always crashes. i enjoy everything with this game but the constant crashes are a huge let down. my rig isnt the strongest but it should play this well for what it is. till is fix/stops happening its a thumbs down for me, dont this change your chose when it comes to picking this game up, just consider this before doing so, the game really makes you feel like your in the drivers sit and in a real race pick it up and try it, i'll change this if the problem gets fixed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible product. Spend more than an hour just trying to get it to run on my pc. Eventually gave up on it after trying everything i could think of or find on reddit or other forums. \nFor reference i have a 4070 super and a 14th gen i7, so it really should not have any difficulty running this game, escpecially on medium settings. But for some unknown reason it wouldn't even boot the damn game half the time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sadly this game doesn't work on Linux/SteamOS due to it's anticheat which means this game wont run for me and also doesn't work on SteamDeck nor the upcoming Steam Machine which is disappointing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game would be a legend if the vr actually worked game plays great on a monitor but to tout it as a vr game and it doesnt even open very lame EA has no answer to this either  highly disappointing at least we still have the other Sims to play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game only if you want to ruin racing for yourself. The multiplayer is an absolutely catastrophic experience, where it’s impossible to complete a single decent race. Every single time, a player behind you wont use brakes into corners, they will brake into you, send you off the track, then overtake you AND you’ll still get a penalty for going off track. These people have all the assists turned on and still cheat to win. A clear proof that EA employs the dumbest people in the gaming industry is the fact they added a survival challenge to the game. This forces all players to go through this disgusting experience just to unlock new liveries. It’s time to move on to an adult simulator, because this is nothing but a stupid arcade game for kids. The story in Breaking Point is comparable to Hallmark shows; you literally can’t wait to skip next cutscene. The SteamVR disconnects often when switching from 3D back to 2D. You then have to restart the entire game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too many glitches and the screen colors always change right now my screen is just red and ive been trying to fix it it was yellow then very dark it always changes since i bought the game if u looking to race formula 1 cars id recommend asetto corza",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've never played a game franchise as popular as F1 with so many terrible core problems. Constant glitches/bugs, disconnect issues, unrealistic tire pressure setups, bland force feedback, and no real option for a competitive mode leads to an miserable online experience with people crashing into each-other for no reason, paired with constant game crashes and disconnects. The only option for close and clean racing every time is league racing; but then you run into the disconnect, and just generally bad EA server problems on top of bugs and glitches such as your audio cutting completely. Don't buy this game if you want a sim, and don't buy this game unless your idea of fun is bumper Formula 1 cars. A lot of these issues have been here for several game cycles in a row now, and for the developers to not have fixed them is just pathetic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is just terrible. Having to deal with random FPS spikes while braking really messed up your laptime. AIs are just stupid beyond words. Probably the worst in the series. Handling in this game is so bad that even exiting corners in 4th gear can induce insane rear sliding as if I am using slicks on wet track. Fking joke of a game. I hope EA loses their license because they clearly make the series go down into the shithole ever since they took over from F1 22 onwards.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lots of bugs, warnings and flags that don't make sense.\nterrible user experience",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only got the game to launch once. From what I played, it's pretty good insofar as it is mostly the same game as the last 3 or 4 iterations. The handling is easier, not necessarily better. But yeah, aside from this, the game doesn't launch for me. I have tried every fix you can find, and so far nothing actually fixes the issue. Its pretty unacceptable to release a game where the in-built anticheat software can make the game literally unplayable. If you want to risk it, buy it. I wouldn't recommend it lest you have to go through this bullshit.\n\nUPDATE: The game launches, and I have to verify game files every second launch. Garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For those wanting an F1 experience, F1 25 is not for you. Any of the older games will be far better than this abomination. It was only a matter of time before F1 games went to sh!t after EA bought out Codemasters. F1 25 is no exception and becomes the poster child on how a company that was doing so well has completely fuc!ed it all up.\n\nThe removal of making your own driver in My Team Career was the first step into the stupidity that has become F1 25. The constant bugs, crashes, lack of AI consistency. It's a cr@p heap that shows Codemasters has fallen into the depths of darkness where all studios go to die, EA... Sad really. The only hope now is that someone else (Sony or other) wins the license in the next renewal bidding war and we can possibly go to something better because at Codemasters and EA, I've lost all hope.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "At times great but half of the time buggy and frustrating mess. Should have kept playing F1 23 to be honest and maybe will go back. Mainly playing co-op career with a friend and using wheel and pedals. \n\nAnnoying feature no 1: AI difficulty fluctuates a lot! We play with 107 difficulty and some of the tracks are downright impossible with the AI, then the next race you are coasting +10 seconds ahead of the AI and the race just doesnt feel fun. With some tracks the AI difficulty feels just right but you need to memorize and adjust the difficulty alot track by track if you want a steady and fair challenge for yourself.\n\nAnnoying feature no. 2: BUGS! BUGS EVERYWHERE! Some races you qualify 1st but when race starts you are 6th and all cars are in random order in the grid, sometimes on top of each other. This sometimes results instant blue flag and penalties and you risk getting a new bug forcing the game to close and restarting.\n\nFew times the game has crashed during practise session and when you log back in, your parts have copied their wear values from sh*tty parts and your newer engine has 88% wear now.\n\nSometimes at start of the race you get instant yellow flags and no overtake allowed even if you get better start so you are forced to lift and wait for the yellow flags to end..\n\nSometimes all force feedback is gone when starting a new session and you find out at the pitlane exit and destroy your car in the wall. Happens both ps5 and PC both Fanatec gear.\n\nIf your game crashes after changing part before next session (or taking new parts for race, getting grid penalty) the game may change back your bad parts but keep the grid penalty. Especially tasty bug with co-op career… Codies really cooked a tasty bug here. FUN!\n\nPrepare to update drivers ratings all the time. It just works…. Badly. What are you even updating if you are again asked to update after 5minutes?\n\nAnd then the crown jewel. You give time for 50% race weekend -> hour practise, full qualifying -> one hour race. Just to notice when you come to the finish line  in 4th -> all but one AI get instant DNF at the finish line and alpine driver wins the race from 14th position, alone,\n\n\nThere are many many small bugs on top of these examples (visual, AI not giving space when in outlap, drops in force feedback for a fraction of a second  during turn etc.) I would not recommend this game if you intend to play co-op career with you friend. If you are about to drive alone then go ahead, I think you will be fine as you can instant replay and restsrt the session.\n\nVery disappointed for the game quality, unfortunately no other options are readily available for co-op career play so hopefully some other companies get to make F1 games so we could have some options, EA can’t seem to help themselves not be greedy gooses. Working game would be nice, i dont care about and never will buy new helmet colours or stupid victory dances.. First make a working game and after that think about yout games as a service bull****.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Thrustmaster T248 is not recognized on PC by this game, but is recognized by older games of F1. Do not buy before you verify that your setup works with F125  specifically, as EA doesn't seem to care about finding a solution from what I see on forums. \n\nWhat a waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're a VR player give this a miss. I can play F1 2023 in VR and it's crisp and smooth. This game has wildly varying frame rates that will make you feel unwell no matter how seasoned a VR player you are and many of the options you would normally expect to be able to tweak are missing, notably no DLSS options in VR but it is there in non-VR so the engine does implement it (and I read that it was there on release but was later patched out as they couldn't get it to work in VR) and no control over how blurry the TAA mode is which is strange as TAA is usually quite crisp. Reducing render scale has very little effect on the performance and makes an already blurry game almost illegible (hard to spot an apex when its a fuzzy blur). There is also an issue with stuttering when you move your head around that EA acknowledge but only plan to fix in a \"future F1 release\" cause they've got to crack on with getting next years fresh cash grab out the door instead of supporting this trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game audio bugs out constantly able to hear everything but ai audio (race engineers/cutscenes)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Keeps crashing over and over it worked before but now keeps crashing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "runs crap on my rtx 5070ti i get 50fps max game looks good but runs like dog turd",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just a bad game, rules inconsistent, not fun at higher levels etc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "We are all Apes. Paying year on year for the same recycled drivel. Yes the game has changed but how much has really improved to warrant £50 every year. \r\n\r\nP.S Screw RaceNet",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After long installing sessions and endless waiting (next up) I'm still not able to play this game on my Vive Pro (NVIDIA GeForce GTX 1080. Seems not to work on VR.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the AI player keep ramming into you. you'll buy this game and stop playing it soon after. another shitty EA game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It really fun with 2 player career but there has been multiple times when we complete quali 1 & 2 position and when we get to the starting grid the person in pole position is in 6th and person in 2 moved to pole on grid with no penalties. This issue really needs to be addressed and fixed. Its very frustrating",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "what the fuck is wrong with the PIT stops?\r\nthey put me on medium when it's raining, putting me on old medium when safety car is deployed while I GOT A PAIR OF FRESH SOFT",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a Bit too much of everything just feels like a fever whenever try to go through the menu , F1 2018 had a better menu than this one , easier to navigate too",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought this game back in August of 2025, barely touched it.  It cost $67 after tax with the 20% discount then for the Iconic Edition.  They must be getting desperate for sales because now their F1 25 Iconic Edition has a much larger 50% discount and only cost $40.  Kind of BS.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game doesn't launch. There are endless fixes for people suffering from the same issues as me. It's not my computer, my rig is a beast. None of the fixes I've tried have worked so far, but really, why should I have to spend hours looking for and trying fixes? This game has been out for some time now, they should have fixed this s*(&.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "F1 25 had the potential to be the best modern Formula 1 game yet, but the online experience drags the whole thing down… again. The matchmaking and online services are somehow still a mess, and it’s honestly baffling that these problems keep returning year after year.\r\n\r\nIt’s 2025. This series is published by EA. How in the world have they still not fixed the most basic part of an online racing game? The driving feels great, the presentation is amazing, but none of that matters when the online side works like it’s held together with duct tape and wishful thinking.\r\n\r\nFans deserve better.\r\nF1 25 desperately needs a serious patch—preferably yesterday—because right now the online experience is the biggest DNF of the season.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The 2 player career refused to work, no matter what me and my friend did, the game crashed a lot and in my first hour of playing i didn't get to drive once.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Servers are a mess. I got booted 30 minutes into a race. My friend and I spent more time trying to connect to that race than we did actually racing in it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "VR implementation is terrible, entire world lags and jitters around nauseatingly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worse than 24\npodium pass took 2 days to finish standard tier during texas\nDavidoff dies :( \nreserve tracks were stupid\nend of life support will be s**t",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I CAN'T PLAY ONINE, CUZ MY EA ACCOUNT GOT HACKED, AND EA BANNED PERMANENT MY ACCOUNT, I EMAILED EA FOR 5 TIMES, BUT NO RESPON",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Supports VR but completely unusable.\nI own a Quest 3 and have played dozens of VR racing titles (Dirt Rally 2.0, Automobilista 2, Le Mans Ultimate, Assetto Corsa, EA WRC, etc.) without any issues — but F1 2025 has a severe camera tracking bug that makes the VR literally unplayable.\n\nThe image lags behind my head movement with a strange “easing” interpolation, like artificial smoothing is forced on top of the HMD tracking. The game itself applies a delayed, elastic camera motion that cannot be disabled.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "absolute hot garbage im being rammed by a 9 year old kid straight out of juvenile thinking he's prime kimi talibantonelli or og osama bin russell do not buy if you tryna play online the penalty system is straight ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The VR is not good..the headtracking is not optmized.. a lot of lagging and the is strange.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've been bummed up the ass that many times my anus started to bleed. If you're into that i would recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT PLAY THIS. Servers are less stable than my ex girlfriend, and AI don't know how to move on formation lap, haha heehee funny EA moment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS NEEDS TO BE FIXED! \n\nDuring the safety car period, I was leading the pack when Piastri crashed into me from behind, spinning me 180°. He took zero damage and no penalty. I rejoined behind the SC in my rightful position—only to get hit with a penalty for an \"illegal overtake.\" WTF?!\n\nEvery time the AI slams into me, they suffer zero damage and no penalty.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please fix Javelin fucking the game up because of Windows.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "2025 tiktok music . shitty intro that you cant skip. cant use the mouse in menus.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game did not load and I never got to play it £25 down the drain",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was doing an amazing race in the rain (2-player career), started p3 as Leclerc in Spa. My steering wheel started doing weird stuff causing me to lose many positions, and then I forgot to brake in a turn 9 and lost my front wing, so I fell down to p20, but I managed to get back up to p6. Then I was gonna overtake Max (AI), I started on the outside, got past, gave Max a lot of space, and somehow they still drive into me and spin me out causing me to lose 1/2 of the positions I gained. W",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to try the game on free trial when it was available. The game didnt even launch i tried everything. Read online that it was not only me who was getting that issue. Ea are pathetic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Complaint: unplayable game due to countless bugs \nDear Codemasters / EA Support\nI am writing to express my extreme dissatisfaction with your racing game ( F1 25 ). This game is absolute garbage – it’s filled with over 100 different bugs that make it completely unplayable and frustrating beyond belief. \nStarting in 20th position despite qualifying first, which has been reported repeatedly by players and ruins any sense of fairness or progression. On top of that, I get hit with DNFs even after successfully finishing the entire race, costing me points, rewards, and hours of effort. \nWhat the hell do your developers even do for a living? This level of incompetence is mind-blowing. How can a supposedly professional studio release such nonsense year after year without fixing these core problems? It’s a total scam – players like me waste money and time on a broken product. \nI demand a full refund immediately, or at the very least, a patch that actually addresses these game-breaking bugs. \nFix your damn game!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game keeps randomly crashing in settings",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[quote] It's amazing - all these facilities, and you make a piece of crap like this  [/quote]\n\nAnother “product” from EA.\nOn the bright side: the car suspension feels great and the sound design is excellent.\nOther than that, it’s the same F1 (22, 23, 24) with the same problems: terrible AI and plenty of bugs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i knew this game was cooked when i saw ferrari in something higher than p8 and kick sauber higher than p12",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SAYS IVE GOT 35 MINS BUT I HAVENT EVEN LOADED INTO LOBY FUCKING SHIT PILE",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really like playing f1, and I liked f1 24 handling better than f1 25. Yes I know I am one of the fewer people who feel this but yes. And on f1 25 they didn't improve too much than what was offered before. I guess the career mode of owner was evolved, but I am not the one interested in playing that. I am looking for more positive changes in driver championship. Nevertheless, product is good, not worth the price when launched. But with discounts, 50% off, I guess this game will do. Thanks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please fix the AI in the wet. It's a miserable experience watching them gap you by 31 seconds (minus the 19 spins on lap 1)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i start up the game and load up a race it crashes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCK YOU AND FUCK YOUR LONG ASS CUTSCENES I JUST WANT TO RACE!!!! LET ME FUCKING RACE!!!!!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not worth it. \n\nIf you're gonna buy this buy at 99% Discount.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "SETTINGS WILL NOT UPDATE IT IS STUCK ON MANUALLLLL",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "on a controller this game feels like im driving the ferrari f14t",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit game cant get anything right",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games keeps crashing no matter the settings.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "resets dificulty every game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game Launch Error. Error Code:0x00000003\nf u EA.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Make a good F1 game and I'll get back to you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "vr barley works its terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant even open up the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game just like shit, big shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst VR game ever made",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCKING GAY GAME IT KEEP CRASHING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game wont start",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst purchase of my life",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible EA garbage",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolute shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ea are not good people",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is 67",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}