{
  "positive": [
    {
      "review": "I'm giving this game a thumbs up because of the herculean effort put in by Zenimax to bring the continent of Tamriel to life. As a long-time fan of the Elder Scrolls series, it's really satisfying to see so much of the map available to explore. And the content is, overall, high-quality too.\r\n\r\nThat said, I have stopped playing this game. ESO asks a lot from you as a player, both in terms of money and time. On the price side of things, it is a full priced game [i]and[/i] it has a(n optional) subscription [i]and[/i] it has numerous full-sized DLCs [i]and[/i] it has microtransactions [i]and[/i] it has lootboxes. It adds up.\r\n\r\nThough, for once, it's difficult to say the expenses aren't justified considering the sheer amount of content ESO has. And that's where the time issue comes in. This may be the only game I've ever played that feels like it has [i]too[/i] much content. And it's real content, too, not proc-gen stuff (though there are repeatables). I got into ESO while unemployed, and I [i]still[/i] didn't feel like I had enough time for it. It was very easy to get caught up in just doing daily quests (of which there are hundreds), and never have time to do anything else (like play the story quests, or roleplay, or PVP, or).\r\n\r\nThe gameplay itself is solid. The combat's nothing to write home about, but that's normal for an MMO. The writing makes an effort to actually be good, and a lot of the time it succeeds. Overall the game has a steady, deliberate pace that might feel subdued if you're expecting Skyrim-style hijinks, but works well if you have the patience to take your time and explore. The artstyle is mixed, with some of the older zones looking distinctly unpolished compared to some truly stunning design in the more recent content. And of course the music slaps.\r\n\r\nESO is the game to play if you have both money and a lot of time to spare, and you like the idea of this being your main game. You can get lost in it, for better and for worse. For me, it was a bit too much.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "Logged in ‘just to try it’… and suddenly I have 500 hours, no social life, and an unhealthy obsession with Khajiit that rivals their addiction to skooma. At this point, even my guildmates call me ‘Furryborn.’ I don’t play ESO — ESO plays me.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Has a new player I would recommend this game, even for solo players or the less social like myself, it's stories are amazing specially some of the earlier DLC's.\r\n\r\nI would recommend looking some early videos before diving in head first, cause a lot of it can be overwhelming first time on, but try and follow the chronological order of it, it made it feel more immersive after you've got some early tips. Find a guild I've noticed the community really helps newer players if you find the right one. Think of your character as part of the story, world and just enjoy it.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Started playing a few weeks ago, I absolutely love this game. As a big fan od Elder Scrolls games, I have always for some reason ignored the existance of this game. I shouldn't have, it's extremely fun and addicting and pretty. Especially if you play together with somebody, my experience has been 10/10, even though I don't know much about the end game stuff yet.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "No matter how much time passes,it seems to always drag me back to play this game. I have taken numerous long breaks from playing but I always come back and get hooked on it all over again",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Even though it’s an 11-year-old game and the age definitely shows in the graphics, animations, and a few other areas, as a new player, it's genuinely fun. The quests are enjoyable, and there’s something satisfying about clearing out regions on the map and fully completing zones. The community has also been great — people are welcoming and actually willing to help new or returning players without expecting much in return. The downside is definitely the monetization (as usual with Bethesda, lmao). A lot of things like cosmetics, certain regions, and extra story content sit behind a paywall, but ultimately it comes down to whether each player is willing to pay for those extras or not. Even without the DLCs and add-ons, there’s still plenty to do in the base game for a new player.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "[Switched to Steam just yesterday so hours don't reflect time played]\n\nThis is basically the most solo mmo in existence. If not THE most, then easily top 3. Next to GW2 and SWTOR. If you've ever wanted to play a single-player Elder Scrolls with optional multiplayer that's constantly being updated, ESO is it. \n\nCan't say I'm a fan of their monetization. Buy to play, sub and now the new content passes not included as a part of the sub? Not great. Or how the crafting bag exemplifies creating a problem only to solve it through money (sub). But if you time your purchases and don't care about playing the newest content right when it drops then it doesn't matter. There's been over a decade of stuff added to this title which makes immediate access to brand new content irrelevant for newcomers. As for timing purchases, wait for a big sale (like Christmas, Thanksgiving or anniversary) to grab the large chapter bundles that come out yearly or so. Plus, sub for like 6 months and sit on your Crown allotment, then buy expansion content through the crown store when it goes on deep sale. You can then play without sub for a long time.\n\nBut you know, if you see the subscription as simply part of the service, it's really not so bad. FFXIV is B2P and sub, yet no one ever complains about that. The only reason Zenimax gets heat for this is because of how aggressive their monetization is. People don't like being maneuvered to do things, and not having everything included in the sub price now is just a bad idea. That said, the overall business model is pretty much the same. Minus the content pass which hopefully doesn't become an ongoing thing. \n\nThere's some excellent writing, humor, and tons of fantasy lore the likes of which only Elder Scrolls can deliver. Also a surprising amount of 'gray' choices. While I enjoy the usual trappings of mmo grind same as anyone else, the conflicting morality behind much of the story is a big part of the draw. It's excellent.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game is you love the Elder Scrolls, lots of build guides and a helpful community.\nNOT PAY TO WIN! no more than say FF14 Online, as in you need DLCs to get access to dngs, classes and so on.\n\nESO+ ....or the Sub for ESO is recommended but not required, I spent most of of the 300 (rounded) hours F2P and didn't NEED to sub, I did simply for the convenience, and its VERY convenient...but not required.\n\nI say buy it and play it, for only 30ish bucks (24.99 CAD) there is a LOAD of content and I think like 2 free DLCs which is dope, and the other DLCs aren't stupid expensive like FF14 is.\n\n100% give it a buy, especially when on sale, ask for help if you need it, look up guides...I'm a fan of single bar builds for newbies, try 2 bar builds later on when you are more comfortable with skills and how they work...\nEh...Single bar and 2 bar means that you can either play with 1 weapon with 1 skillbar for your skills or 2 weapons and 2 different skillbars, 2 weps usually have a synergy with each other and other players.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "the dlcs seem pay to play but you still have hours upon end of just the base game and side quests.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☑ Eargasm\r\n☐ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☑ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Skyrim with friends. Big map to explore and a lot of activities to do. For an MMO the grind isn't insane and the community is really friendly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "0% Modding and 100% fun ...Membership required",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’ve played Elder Scrolls Online for around 600 hours and created multiple characters along the way. The community is great, the game is great, and the lore is genuinely impressive.\r\n\r\nThat said, the experience eventually started to feel repetitive. At its core, it follows the same MMO loop—grinding, crafting, gathering ingredients—and while I totally understand that this comes with the genre, I found myself getting tired of it faster than I expected.\r\n\r\nOverall, ESO is a solid game. The graphics are decent and the world-building is top-notch. I just ended up burning out sooner than I anticipated.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i only play it cause my friend plays it. TBH kind of chill and coo im more of a destiny type of guy but i dont mind the sloppy seconds",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun gameplay, cute graphics, great story and best of all, I get to be in Tamriel!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ESO is a great game i like it i played it and loved it. but i gotta admit.. i didn't really like the subclassing update. It really messed up a whole part of creativity in the game. Everyone runs the mathematically highest dps skills, and they just leave the players that want to play normally with all 3 class skill lines behind by a lot. which isn't very mmo like. other than that i guess everything is going all good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, its not perfect, but its a great game. Lots of content; thousands of hours of game play. Crowns are a touch expensive and its unfortunate that you require ESO+ membership to have an unlimited craft bag but ZOS has been generous too and made it so that you do not rely on micro transactions to enjoy the game. I would like to see the craft bag made available even in a \"limited\" capacity for non ESO+ members. Its initially difficult to enjoy the game when you run out of storage fast. Over all though I would say this is a great game however and would recommend it",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "ESO has quite a steep learning curve and the download size is hefty at 140 GB, but it is worth it. \r\nRuns wel on a mini PC with an AMD Ryzen 7 6800H processor without a graphics card.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun not too good of graphics but the fighting is fun and i like the story. overall 9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This review is from a player with years of gameplay written for new potential players, mostly.  Elder Scrolls Online is a terrific game.  Leveling your character, exploring new environments, doing quests while getting stronger and receiving reward is very enjoyable.  In it's base form, there are different classes to test out with unique skill lines and unique abilities.  There are different weapon skill lines with their own unique abilities.  You can play your character(s) with a focus and specialization of dealing damage, or play with a focus on the ability to heal others while contributing some damage, or perhaps specialize your build to draw and hold the attention of enemies as a bulwark while players you are grouped with are left free to bring dungeon bosses down.  In this way, ESO is similar to other multi-player games available.  There are very easy dungeons to run where you can learn your role and have plenty of room to make mistakes.  As you master skills and get comfortable there are progressively more difficult options, such as veteran dungeons and trials that test your more - with better reward.\r\n\r\nTo me, the above is reason enough to try the game.  The other aspect of the game which has been very enjoyable for me is the player-vs-player battlegrounds and the alliance wars.  Honestly, this is the most challenging and evolving activity in the game.  In its current state, ESO PvP needs work.  I have over 3600 hours of gameplay, experiencing many different adjustments to the game through changes in classes, armor sets, mythic gear used in PvP, and the present state has the most unbalanced PvP I have seen in years.  Some players having the benefit of time, practice, resources and knowledge have made devastating builds that can kill you in an instant and turn into an unkillable tank in the next instant.  Even for me it is incredibly frustrating (and I am no means an expert at PvP).  I know the gear these players are using, I know the combination of skills they are using and in what order, and I know why most players are following the same setup:  if you stray too far from the Best setup (the \"meta\"), you simply cannot compete at a level where you can stand toe-to-toe with your opponent.  That being said, I enjoy trying different setups and avoiding the \"meta\" that so many are comfortable relying upon.  I seems lazy and unfulfilling to copy some influencer's recommendations after playing so long.  For a new player, however, I highly suggest following their recommendations.  Remember, even with sub-standard gear and a unique setup you can find a style of play that is enjoyable and you can contribute to the success of your team as you wage battle against other players.\r\n\r\nTo players who have many hours of gameplay and are thinking about revisiting the game, the development of sub-classing and the adoption of the scribing system into base game make the time spent back in the game worthwhile.  I do not recommend the yearly pass.  The Monomyth Reforged mythic is strong, but it's no better than Oakensoul for more casual play and it's no better than Markyn's or Death Dealer's Fete - you simply save a skill slot on your bar.  I have Monomyth on two character builds and it is powerful, but not worth the money and the changes coming up might nerf the benefits seen.  The amount of unkillable players in PvP is very high and many players seem to not understand they should be ignored and weaker more threatening players should be targeted.  It is frustrating.\r\n\r\nAll in all, I still love the game.  I 100% recommend exploring purchasing ESO and exploring Tamriel !  Thanks for reading!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very casual MMO, you can basically just play this like Skyrim if you want to have a relaxed solo game. Grouping up for harder content is easy and the rewards are better for the more difficult content too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with a confusing funding model. If you subscribe and buy the deluxe edition with all the DLC, you will have the best time. However, there is a ton to do in the base game as well. I'm loving it so far and even with 1000+ hours played, I have an overwhelming amount of content left to play through. I fully recommend  the game if you enjoy the Elder Scrolls lore, RPG's or MMO's in general.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely my favorite MMO currently.  They've put 10 years of work in and it shows.  The VIP incentives feel rewarding but not too overbearingly necessary. Great customization in visuals, variety and now with cross-class play? Super fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Free Game.\r\nDespite some issues with the multiplayer, which they are aware of and working on, this is a pretty cool top tier gorgeous game. Always finding new stuff to do. The UI menu system is a bench to get the hang of but even so, it is pretty comprehensive when you do.\r\nTo use a technical term, this game is the dogsbollox.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game! I switched from Xbox to PC, and my Xbox file has more than I care to admit on it. I chose to play on PC because it is a great game with an even greater community. I've got thousands of hours between the two.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game provides a great experience for pvp and pve, it mixes classes and skills perfectly highlighting the strenghts and weaknesses of them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like the Elderscrolls then this game is worth it. Base game will give less than 50% of the content and the rest isn't cheap. Houses can cost up to 200 NZD for example..\r\n\r\nGameplay is statmashy, just hit and hit until the enemy dies. The quests are ok but there's a lot of going over there and back with a lot of enemies in the way.\r\n\r\nIf you played Skyrim, Morrowind and Oblivion and you really like the lore then this game is great and worth it if you're willing to loose a lot of money for DLC's and cosmetics.\r\n\r\nMusic is perfect I love the vibe that the soundtracks brings. And the community that plays PS4 version is very friendly and will vibe together haha. While PC is just active and focused on getting good. Data doesn't transfer from PS4 to PC neither does it in servers from North America to Europe. So gotta make sure you like the console and server.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for either fighting enemies or completing story quests",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is an Elder Scrolls game with some multiplayer aspects",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still trying it out its fun mostly. Played the base game before i tried the other parts. Give it a try if you like this sort of game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game for years and returning after years, still a fantastic MMO.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love Elder Scrolls, you'll adore ESO. It perfectly captures the magic of the single-player games—rich lore, incredible landscapes, and deep, flexible combat—but wraps it in a massive, vibrant multiplayer world.\r\nThe stories are fantastic and fully voiced, making every quest feel important. Whether you play entirely solo or team up with friends for epic dungeons and large-scale PvP battles in Cyrodiil, the game just works. The 'play your way' character customization is brilliant.\r\nIt’s an enormous, beautiful adventure that constantly evolves. Dive in; it’s easily one of the best MMOs experience out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is alot of fun, great for solo players or those who can't dedicate tons of play time daily",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is NOT for players who are used to Generic MMOs. \n\nThis game is NOT for people who suck at group play, following instructions and learning mechanics.\n\nThis game is no intended for casual hippity hoppity around gameplay,  if you really want to enjoy this game as intended,  don't be a casual and find seek end game progression and achievement seeking guilds. PUG gameplay is as wild as any other MMO. \n\nThis game is  NOT pay to win like many people try to claim, it has an optional plus subscription  that you don't really need if you learn how to maximize your inventory capacity. It is not a mindless loot hoarding game. Buy The Elder Scrolls Online: 2025 Premium Edition when is on sale and you will have access to a lot of content for a good price, you dont need to buy the in game DLC dungeons unless you are really interested in clearing the content. If you spend a single dime after purchasing the premium edition, that is your decision, this game does not obligate you to have DLC dungeon content to progress or be effective in any other content or Patch updates if you really know how to play this game and build your character.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most in-depth MMORPG games I've ever played. I have spent hours on this game on playstation, just exploring the deep world building that Bethasda is known for. Couldn't recommend this game enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome at the start. Mid once you get into it. 2k lvl and I'm tired, boss.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A solid MMO otherwise while it has some flaws, the combat feels fluid and satisfying. And the art style of the world with it's realistic touch feels nice compared to Guild Wars 2 or WoW.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I find the questing enjoyable, the visuals and music astounding.   Don't get the content event pass for 2025, unless it is on sale, FYI",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really liked this game because it has a lot of content and how big the map is using locations from previous games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have always liked games like this and its very easy to play and have fun with friends or by yourself",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game for a while now, I absolutely love it! I just can't wait until the whole map of Tamriel is available to explore :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only done about 470 hours and I love all the questing. There is so much of it. Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic MMO with that Elder Scrolls  vibe we all love. Voice acting is great along with the detailed and articulated quests that alone can keep you busy for hours on end. Group content is also super fun if you can find a guild to tag along with. Super noob friendly community. Combat is engaging enough to keep things interesting. My only complaint is that I cant transfer my collections from console to PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall enjoyed the entire game that I have seen. I of course am annoyed by the paywall, as I imagine anyone would be. The pacing on earned rewards is a bit slow, but I suppose that's to drive people toward purchasing the content pass and/or a monthly membership. There is not a great deal of clarity around things like where you can go and what's available: I have many times gotten treasure maps for areas that I can't yet access because I haven't purchased anything yet. Still fun, but limited, which I think is the point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played for 2206 hours. The game should be Steam Deck verified as three quarters of my play time is on the platform. I highly recommend the title.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly better than skyrim at this point. Voice acting is done masterfully, not a single npc I've met is silent. Combat is smooth, and the community is some of the friendliest I've seen. You might have overly long queue times as a DPS, as with many MMOs, but the stuff you can do in between fills those times. Still haven't made it to endgame, but its worth it, esp since its free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve put thousands of hours into ESO — everything from PvE content like dungeons and trials to PvP like battlegrounds, Imperial City, the sewers, and Greyhost Cyrodiil. I honestly think it’s one of the best MMORPGs ever made. The graphics are a bit dated, but the world still looks great. There are tons of sets, skills, and classes to choose from, letting you build some awesome PvE or PvP setups.\n\nWhat I don’t like is the craft bag situation. The game becomes basically unplayable due to storage issues unless you pay $15 a month for the craft bag. I’m also not a fan of subclassing — it takes away class identity. And even though it seems like there should be a lot of build variety, most players end up using the same few skill lines in almost every build.\n\nThe trading system is another problem. Guild traders feel outdated and clunky. ESO really needs a modern trading system, something more like the Grand Exchange in RuneScape.\n\nOverall, the game is definitely fun and worth playing, but it does have some drawbacks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great lore and great visuals! Highly recommended MMO for real adventurers.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Starting out at release, the game had some hiccups and was a little on the slow side of progression. Now, in 2025 the game has come a LONG way. Practically every week there is an event of some kind running. There are a ton of Delves (small solo dungeons with 1 boss), Public Dungeons (Larger delves with multiple Bosses and a Group Boss (this boss gives a skill point), Group Dungeons (4-man Group/Party) and Trials (12-man Group Raids) to explore and conquer. The Group Dungeons and Trials also have an increased difficulty choice when running them, some even have a Hard mode (HM) for the final boss. Plenty of crafting to keep some busy with collections and learning. Guilds of plenty to join and interact with. You can join up to 5 different guilds that is automatically shared with all characters you create. Quests galore to keep those who are into lore and history of Tamriel. And to keep those who are collectors busy, achievements to match zones, quests, dungeons, trials and practically anything else ESO has to offer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just getting back into ESO after stepping away for many years. Really enjoying  my time with it. The crafting and skill upgrades seem a little clunky at first, but If you push through the learning curve, the world really opens up and its a lot of fun exploring and questing. I picked this up on sale for $5, I more than got my monies worth already, and the base game has hundreds of hours of content available. There is the ever so subtle push towards the ESO plus subscription, but if you don't mind the inventory management \"mini game,\" you really can get but without it for a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For me it's the best fix for that fantasy MMO Itch. WoW stopped being fun years ago. I played Destiny Until they leveraged too far into the season format making you grind more power over and over and over. this has the balance for new content without requiring you grind more power over and over again. you feel rewarded for the time and work you put into the game. That said if you plan to craft you had better get you ESO plus subscription. it' not perfect but it's the best out there right now in my opinion. a few new game have potential but the time and money invested in this game is still worth me staying hear for my main entertainment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of good content only down fall is without being a monthly member your loot bad is limited.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as intuitive as I'd like. And not as Free-to-play as I'd like.  Always a need for more Crowns, and when I try to buy more (not that I can afford it) there's never the option to buy.\r\n\r\nBut graphics leave nothing to be critical about, voices are great.  If it were as intuitive as I need it to be (may well be a Me problem) it'd likely be on my top 3 list of favorite franchises.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "graphics are lovely, gameplay is straightforward, stats easily comprehensible",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really love seeing merchants on the roads. that is super helpful. the game is awesome, would you gift me the four updates bundle? i really want to add thieves guild, but i cant afford it anytime soon. thieves troves drive me crazy because i want to open them, but am not allowed until i have thieves guild dlc, here with three other dlc in a  bundle. i would like that, and be grateful. but in any case, i love exploring. the houses are mostly out of my price range. the free room is enough for me now. thank you for this wonderful game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A must have if you're into MMO's, and even better if you also enjoy the Elder Scrolls franchise as a whole. Without this game i would have already forgotten about the whole franchise since ES6 still seems so distant. There is a lot of content you can play based on your preferences and the exploration is MASSIVE, sometimes even overwhelming, especially the first time playing. But it feels really rewarding whenever i hit milestones on the map/quests etc. Only downside to this game is that there is stuff locked behind a paywall, even the event currently going on, i can't visit the main area (Solstice). Regardless there is plenty content for people who don't want to spend money (in game that is).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes great mmo rpg , its huge and lot of dlcs ! combat is nice skills system is nice crafting is nice all good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is catered to new players, with that being said its worth a play if you enjoy mmos without it feeling like a chore. I recently lost my Playstation account and my champion rank 1200 characters. Sucks but its very fun playing the game as a new player again. Its bringing back memories from 2017-2019 likes crazy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Infuriating robot responses from \"customer service\". As well as some cave boss bugs. Other than those, relatively smooth game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ESO is okay imo.  I've always felt the combat was a little floaty and didn't seem to have much impact.  The story and wordbuilding, though, are topnotch!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It takes a bit to get into. But as someone with a social and working life. This is by far for me the best MMORPG. All zones feel lively compared to WoW because of the level scaling. All zones are relevant for everyone. You will never feel alone in any zone. The crafting and guild systems are good and engaging. By far the best quests in MMORPG's. The game doesn't punish you when you take a break from it.\n\nThe game can be as social as you want it to be. Long day at work and just want to do some solo questing? no problem. Bad weather outside and have time to spare? Join a guild from questing guilds to RP to competitive guilds and play with others. You can join up to 5 guilds so you can mix playstyles depending on your mood. So far a very welcoming and social community. Don't engage in the microtransactions though. Get the basegame first and consider the sub if you enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still my favourite MMORPG to this day. Sure there is paid content but at least it doesn't require any subscription to be merely able to play it. This game shines thanks to its vast amount of \"single-player\" content (every single quest is voice-acted and a majority of them have an interesting setting), and multi-player content is plentiful (dungeons, trials, overworld bosses, real-time world events, PVP arenas, PVP battlefield (namely, Cyrodiil), ...).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got this game only for the Clockwork City quest line, only to find out it is not included with the Morrowind DLC, and it is a seperate DLC that you can kindly get via a montly subscription. Bethesdas greed is the one they talk about in the bible, 400 dollars to Howard, it just works.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The start of the game, ESO with the subscription, has been relatively easy and fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if your a big MMO fan like me this game and its add-ons and DLC is amazing and good story Driven i love it and its open world you'll thx me later try it your self",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I looove this game but idk if its windows 11 i get insane stutters, fps dropping like crazy, not consistent\nSoo i moved on to guild wars 2\nTried everything running i7-8700 with 3050 not the best i know\nBut i want having these issues in the past (anyone know a fix lmk)\nStill recommend but yeeaah or gw2\n\nHope it gets fixed..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having lots of fun. Wide open world, familiar yet totally new. Do wish they would have kept the Khajit as regular cats instead of lions, but they're still my favorite race to play. Awesome overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fairly old school but there is a LOT to do. Returning player, even bought sub again. Don't expect New World and you won't be disappointed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are a fan of the Elder Scrolls this game does a really good job of expanding on the lore and world of Tamriel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the other elder scrolls games so I tried this when it came out and it's pretty fun. You get to visit a lot of places in the elder scrolls world that don't have their own game set in those locations yet, and I think it's fun to see other people running around since the other games are all singleplayer. It's different. Having one elder scrolls game be multiplayer is a fun experiment. Also, after quitting WoW some years ago, this and swtor are nice to fill the mmo desire.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quest design is sometimes better than in Skyrim! Superior writing and storytelling!\nMMO aspects are so-so though...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Didn't like the constant downloading of gigs. However, this is one great game. Graphics are good and the game play is solid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am a huge cozy/open world gamer and love having a main quest and side quests. I also really love getting to do the quests with my friends. I bought a gaming laptop just for this game, and I have zero regrets. Getting to do the group dungeons and side quests with my friends but also having the option to do the main quest on my own when they aren't available is fantastic. This may be my favorite game, though I am newer to gaming so my word may not be much. I am used to playing Zelda BOTW and TOTK, which I loved, but could not play with my friends, so I love this aspect!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable stories, music and it runs smooth! Don't forget to get Minion for addons as they can give more UI interfaces",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun and challenging game with tons to do. Guilds, crafting, quests, PVP, dungeons and more. The game is free to play but I highly recommend getting a paid sub to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played on console, now on pc, even with its age this game still holds up as a great fantasy adventure game for both people who like Single player or multiplayer, it has flaws but still succeeds in feeling like a living breathing world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best MMORPGs of all time. Don't listen to the haters, hating is the number one trait of MMO players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Elder Scrolls® Online (ESO), developed by ZeniMax Online Studios and published by Bethesda Softworks, is a massively multiplayer online role-playing game set in the Elder Scrolls universe. It transforms the single-player experience of Skyrim and Oblivion into a shared world spanning nearly all of Tamriel. Over the years, it has evolved into one of the most complete and accessible MMOs available.\n\nGameplay combines traditional Elder Scrolls exploration with MMO structure. Players create a character from multiple races and factions, then explore the world completing quests, dungeons, and world events. The combat system is action-oriented—aiming, blocking, dodging, and timing attacks matter more than statistics alone, keeping it closer to the single-player series than most MMOs.\n\nThe game’s structure supports both solo and cooperative play. Story quests are fully voiced, offering depth and player choice, while group content such as dungeons, trials, and world bosses provides long-term challenges. The balance between narrative immersion and multiplayer systems is one of ESO’s strongest features.\n\nVisually, ESO captures the variety of Tamriel with large, detailed zones ranging from volcanic islands to snowy peaks and ancient cities. The art direction emphasizes consistency with Elder Scrolls lore, while lighting and weather systems give each region distinct atmosphere. Performance remains stable even in large-scale PvP battles.\n\nThe soundtrack and sound design uphold the series’ reputation for quality. Jeremy Soule’s early contributions and later expansions’ music maintain the epic tone. Ambient effects—wind, wildlife, city chatter—add authenticity. Full voice acting for every quest NPC strengthens immersion.\n\nRegular expansions and updates continue to expand content and refine mechanics. Chapters like Morrowind, Summerset, and High Isle each introduce new regions, systems, and stories without fragmenting the community. The flexible leveling system allows new players to explore any zone regardless of progression, making ESO remarkably beginner-friendly.\n\nOverall, The Elder Scrolls® Online stands as one of the most refined and content-rich MMORPGs today. It offers a deep narrative, strong combat, and constant updates within a cohesive world. For both longtime Elder Scrolls fans and MMO players seeking an immersive, story-driven experience, ESO delivers lasting value and consistent evolution.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "🎭 Story & Quests\r\n\r\nESO’s quests are genuinely impressive. Every single one is fully voice acted, and the writing has real depth. Characters have personality, regional accents, and moral complexity, it feels like you’re playing a single-player Elder Scrolls story inside an MMO world. Each zone tells its own tale, and exploring them is consistently rewarding rather than repetitive.\r\n\r\n⚔️ Combat\r\n\r\nCombat is responsive but not for everyone. It uses an action-based system where you manually aim attacks rather than using tab-targeting. Personally, I find this frustrating, I prefer being able to lock onto targets. Still, once you get used to it, it’s fluid and skill-based, and the healing built into some abilities (like the Templar’s Puncturing Sweep) makes it surprisingly tactical.\r\n\r\n🛠️ Progression & Builds\r\n\r\nCharacter progression is incredibly deep. You can mix weapon, class, guild, and crafting skills to create almost any build imaginable. The downside is that it’s overwhelming at first. The Champion Point system extends progression far beyond level 50, but figuring out what’s worth investing in takes patience and research. Once it clicks, though, it’s very satisfying, there’s always a new layer to refine.\r\n\r\n⚒️ Crafting, Gathering & Economy\r\n\r\nI love ESO’s crafting system. Every resource you gather has a purpose, even “junk” can be deconstructed for materials to craft or sell. It makes looting feel meaningful.\r\nTrading, however, is divisive. You can’t simply open a global market; you have to join trading guilds and travel to their vendors to buy or sell. It’s immersive and realistic, but inconvenient if you prefer quick, centralised trading.\r\n\r\nInventory management can also be rough. Some useful consumables you receive can’t be stored in your bank, so storage fills quickly. Players like me who hoard everything will find this especially frustrating.\r\n\r\n🏰 Dungeons & Group Content\r\n\r\nDungeons are atmospheric and well-designed, but can be confusing when you’re new. Experienced players often sprint through, leaving you struggling to keep up or understand the mechanics. Despite that, bosses are creative, and the combat flow in group play is smooth once you learn the ropes.\r\n\r\n⏳ Time-Gated Systems\r\n\r\nResearching traits for crafting takes real-world hours, and upgrading your mount’s speed, stamina, or capacity is limited to one upgrade per day. These systems give a sense of long-term progress, but they can feel punishing when you’re just starting out.\r\n\r\n🌍 World, Visuals & Performance\r\n\r\nThe world is beautiful, sprawling landscapes, detailed cities, and excellent lighting even on older hardware. The music is wonderful and fits each region perfectly. The game runs smoothly now; I used to have issues with NPCs not spawning properly, but switching to fibre broadband fixed that completely.\r\n\r\n🧑🤝🧑 Community & Social Experience\r\n\r\nESO has a huge community, but how social your experience is depends on you. I rarely interact in guilds, so most of my communication happens in dungeons, usually when someone asks for a specific drop or when things go wrong mid-fight. The community in general seems friendly and mature, but it’s easy to play almost entirely solo if you prefer. Maybe there's a very social side I'm missing.\r\n\r\n💬 Overall Impression\r\n\r\nEven with its flaws, ESO is a fantastic MMO. It’s easy to sink hundreds of hours into exploring, crafting, and questing. The amount of content is staggering, and the storytelling easily surpasses most online games. I'd consider myself a newbie, yet I have over 400 hours.\r\n\r\nThe game can feel overwhelming at first, and a few systems are unnecessarily restrictive, but once you take the time to understand how everything fits together, it becomes one of the most rewarding experiences in the genre.\r\n\r\n⭐ Verdict\r\n\r\n9 / 10 — Deep, story-rich, and endlessly explorable.\r\nIf you love RPGs and can handle a bit of complexity, ESO is absolutely worth your time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is good, ignore bad reviews. SOOO much content, game can be challenging if you make it, seems easy at first but with things like solo dungeons and world bosses there is def challenge if ur looking for it. also pvp more. The game needs a bigger pvp player base and obviously the hardest content. (my hours seem low but I have played a lot on console and different accounts like on epic launcher) The combat seems mid at first but once you get both weapons and have a decent build it becomes alot more fun. I would recommend watch a YT tutorial on the combat so u can learn what u could easily overlook without even knowing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recomend game as its full of lore and details, but be carefull not doing daily stuff and avoid getting burnout of game. Its important to have fun :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly amazing, probably the best MMORPG there is and no forced subscription. If you subscribe you get endless crafting bags, start collecting currency that buys you DLC for free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The \"Play Your Way\" Promise Delivered\r\n\r\nAfter spending over 1000 hours in Tamriel, the singular thing that keeps me coming back to The Elder Scrolls Online (ESO) is freedom. Most MMORPGs lock you into a rigid box, you are a Healer, or you are a Tank, and that is all you will ever be.\r\n\r\nESO destroys that box.\r\n\r\nI play a High Elf Warden who functions as a thief, an assassin, and a mage all at once. The \"Armory\" system and the sheer number of skill lines, from Guilds like the Dark Brotherhood and Thieves Guild to weapon skills like Dual Wield and Destruction Staff, allow for a level of customization that is staggering. You want to be a nature-magic wielding assassin who heals? You can do that. You want to be a heavy-armored tank who uses lightning magic? You can do that too.\r\n\r\nA Thief's Paradise\r\n\r\nOne of the most underrated aspects of ESO is the Justice System. Unlike other MMOs where NPCs are just static quest givers, in ESO, almost every NPC has pockets to pick and a house to rob.\r\n\r\nThe Thieves Guild and Dark Brotherhood DLCs are standout experiences. Sneaking through heavily guarded manors, managing your \"Heat\" and \"Bounty,\" and executing perfect heists offers a stealth game experience that rivals single-player titles like Thief or Dishonored, all within an MMO environment.\r\n\r\nLore that Matters\r\n\r\nFor those who love story, this game is a bottomless well. The quests aren't just \"kill 10 rats.\" They are fully voiced, complex narratives involving political intrigue, Daedric Princes, and ancient history.\r\n\r\nAs a High Elf player, exploring the pristine, slightly xenophobic beauty of Summerset Isle feels vastly different than crawling through the swamps of Black Marsh. The game respects the player's intelligence and rewards you for paying attention to the history and culture of the races.\r\n\r\nThe \"Grandpa\" Factor (Accessibility)\r\n\r\nAs an older gamer with a busy life, ESO respects my time.\r\n\r\nSolo Friendly: You can play 90% of the content (overland quests, delves, public dungeons) entirely solo.\r\n\r\nHorizontal Progression: The gear cap hasn't increased in years. If you take a six-month break to be with family, your gear is still relevant when you come back. You don't get punished for having a life outside the game.\r\n\r\nThe Verdict\r\n\r\nElder Scrolls Online isn't just a game you play to beat; it's a world you live in. Whether you are min-maxing a DPS build for trials or spending your Friday night picking pockets in Abah's Landing, the game offers a richness that few others can match.\r\n\r\nPros:\r\n\r\nIncredible build variety and freedom.\r\n\r\nFully voiced, immersive quests.\r\n\r\nBest-in-class stealth and justice system.\r\n\r\nRespects player time (no gear treadmill).\r\n\r\nCons:\r\n\r\nCombat animation cancelling (weaving) can be tricky for new players to master.\r\n\r\nThe sheer amount of content can be overwhelming at first.\r\n\r\nFinal Thought: If you love fantasy worlds where your character's backstory is just as important as their stats, play this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "With over 538 hours in Elder Scrolls Online, I can confidently say this MMO stands out from the crowd.\r\n\r\nOne of the biggest strengths of ESO is its voice acting. Every quest is fully voiced, which makes the world feel alive and immersive. Combined with many great storylines. \r\n\r\nThe graphics and atmosphere are beautiful, with diverse zones that each have their own culture, music, and mood. Exploring Tamriel never feels repetitive – from snowy Skyrim to the deserts of Alik’r.\r\n\r\nESO offers both PvE and PvP content. PvE is rich with dungeons, trials, and story quests that can be played solo or in groups. PvP is centered around Cyrodiil and Battlegrounds, offering large-scale battles. Even if you’re not into PvP, there’s plenty of PvE content to keep you busy for hundreds of hours.\r\n\r\nThe community is one of the most helpful I’ve experienced in an MMO. New players often find others willing to answer questions, share builds, or guide them through dungeons. It’s a welcoming environment that makes the game easier to enjoy long-term.\r\n\r\nAs for monetization, ESO Plus is a huge quality-of-life improvement, especially the crafting bag. Once you’ve had it, it’s hard to imagine playing without it. However, you don’t need ESO Plus right away – I recommend trying the base game first to see if you enjoy it, then subscribing later if you want the convenience and access to all DLC.\r\n\r\nConclusion: ESO is one of the few MMOs where story and immersion matter as much as combat. With full voice acting, a strong narrative, beautiful graphics, and a helpful community, it’s worth investing time in. Whether you prefer PvE adventures or PvP battles, there’s something here for everyone. Try it first without ESO Plus, and if you find yourself hooked, the subscription is a natural next step.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Laid back, pretty, and lots of quests!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing for a few years now - so many play styles. So much exploring to do. So many houses to decorate. Super fun if u like Elder Scrolls lore and worlds!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just love the elder scrolls,online options are great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Haven't played it, but heard about this player that slept on a bridge for 5 years as a social experiment. Would've loved to be part of that era",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so old and yet it is always adding new things! Other mmos need to follow eso's example.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A solid MMO that supports playstyles ranging from solo to large raids and PVP.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love Skyrim but wish it had more people and chaos, this is it. The world’s massive, the stories are deep, and you can easily lose hours just exploring. I really like how flexible the builds are too, you can mix magic and melee however you want. Questing feels cozy one minute, then you’re in a full-scale war the next. Perfect for anyone who wants that Elder Scrolls vibe but with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coming from FFXI and FFXIV... I really like what I am seeing as a noob in ESO. Here's hoping it turns out to be as fun as I progress as the initial startup.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ignore the time played, I have almost a year of playtime on one single toon on playstation, I probably have two years of total playtime. Yes, in a game that boots after a few minutes of inactivity. I had a pretty depressing period of my life when this game was at it's peak.. \r\n\r\nAnyways, this is by far the best online game I have played. It takes the best aspects of MMOs, crafting, PVP, solo PVE, economy, raiding, etc, and changes the worst aspect of MMOs, the combat, to make it as good as it can really be. There is no global cooldown, there arent 50 abilities to track cooldowns, you simply have two ability bars, resource management, and rotation. \r\n\r\nGathering and crafting is as well implemented and addictive as any game. The way it is executed adds to the experience as well. Take for example the placement of crafting nodes. The beginner zones and the end zones have the highest concentration of crafting nodes. This gives experienced players reason to hang out in the beginner zones which gives newer players and new characters a better experience. It also helps players focus on the main story in the middle zones, which believe it or not the zone quests or story quests are effing amazing if you are into Elder Scrolls lore. This game takes place before all of the single player games, and gives a back story to every corner of the game's planet. Seriously, I challenge you to find a fan of the actual lore who doesn't like how this game's story fills in the gaps. Once you get a hang of combat the zone quests or \"overland\" content can feel really easy and you find yourself rushing through it to get the skill points rewarded for completing main stories, but this isn't even the focus of the game. The story is simply something to do while waiting for friends or if you want to take a break from anything else, or progress your character by gaining easy experience and skill points, or if you just want to be forced to explore corners of the map. \r\n\r\nThe maps are absolutely incredible. Even the base game maps. If you pay attention and read the notes and books scattered about you realize how much love the developers put into these 100% handcrafted zones. One of my greatest experiences in this game was playing some random quest in Deshaan (Morrowind mainland) and finding a bunch of pieces of paper scattered around to read. It turned out to be some story that was obviously a serious real life thing from one of the dev's lives they put into the game. It made sense for where I was and what i was doing, but it was so real at the same time I connected with some tech nerd i have never met. \r\n\r\nThe group PVE is the best part of this game, unless you prefer PVP which is also fantastic. There are tons of dungeons, each from recognizable places from the single player games, places you have read about in random books, or places you have heard about from NPC dialogue. They always have their own story and fun bits of lore. I played WOW for a bit and the dungeons are, kill these guys, collect these items. ESO takes them to another planet compared to other MMOs. The normal difficulty is easy enough, challenging enough for newer players. The \"veteran\" difficulty makes them an actual challenge to complete normally forcing you to follow mechanics for boss fights, then the \"hard mode\" makes it actually hard. The greatest experiences you can have in this game is finding a group to tackle the hard mode challenges together. I am not joking when you are newer to the game you think it is absolutely impossible to complete dungeons on just plain veteran mode, but then you progress and learn mechanics as a group with each player being responsible for something so important you feel like you are the reason you completed the challenge. Seriously some of the fights are so hard you will spend years trying to complete them on the hardest difficulty, and when you finally complete it you win a title and wear it proudly for months. I still remember random players in voice chat saying \"dope Alpha Predator title\". It sounds really cool and was proof to everybody on the server I completed something that was very difficult to do at the time. There are also 12 player raids which take the 4 man dungeon idea and takes it to a higher level, where on the higher difficulties it requires every participant to be on point 100% of the time with the mechanics. Personally I have more fun with the 4 man dungeons, being more personal and the fact that most people who are attracted to MMOs don't like me personally, making it tougher to be a part of the \"cool\" crowd and get the hard mode raids. It is not difficult to find guilds and groups that will bring you on to their teams. \r\n\r\nThe PVP is also fantastic. I mean every aspect of this game is great. You can queue for smaller group deathmatch and other CTF type games, which are great and require specific builds just for these games, or you can travel into the center of the map where there are server wide faction wars with epic battles of hundreds of players happening 24/7. I have spent 20+ hours straight in Cyrodil because it is just that fun! There is a ton of PVE things to do here as well, but it is constant PVP with three warring factions fighting for control of the map. Overtaking castles and outposts changes fast travel dynamics and supply lines. The thing about PVP is that it allows for completely different builds and strategies. The set bonuses from gear required to do the hardest veteran hard mode raids in the game will leave you to be absolutely destroyed by one single player in PVP. That being said, the builds required to excel in PVP will make you borderline useless in end game PVE. It is so well implemented as it allows you to completely rethink the entire game when exploring different aspects of gameplay. Most people play through a ton of PVE content and know what works and what is useless against the mobs. But when you start to dabble in PVP after getting burned out on PVE you realize every one of those \"useless\" skills works exactly as described against players and makes every single build viable, especially when you are in a group of 50+ players and you can add something special to the group. Also worth mentioning that the \"meta\" builds for PVP are often acquired by completing challenging PVE content, and visa versa. I cannot express enough how well the different game modes coinside with each other. \r\n\r\nYou can even skip combat completely and spend countless hours gathering, crafting, and helping people build houses. The wealthiest players in the game are those who specialized certain crafting skills and can build and sell extremely rare and valuable furnishings. I cannot touch too much on this because I spent my time doing combat and exploration, but there is a TON of content for crafters, fashion and housing enthusiasts.\r\n\r\nI will cut this rambling review short because I have to go into job on short notice, but if you are looking for an extremely deep elder scrolls experience you can share with hundreds of friends, you must give this a try. If you are bored, try different playstyles. If you just want to be a jerk go to Valkel Guard and run your mouth in area chat and fight other players. I promise there is something for every player in this game. If not there is always Call of Duty i guess.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "used to play on xbox with a buddy who is now retired, i regret i didnt play more with him because those memories were more important than i thought, depsite my bitching at times to play it was something we both had liked and i took it for granted low key. so now i play on here trying to do everything, whether thats solo or if i find a guild to add to my memories. thank you elder scrolls thank you bro.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has been great on  Steam it is my go to game of all times that's why I have 800 hrs. play time. and ever since the other some thing called __box now charges a membership just to play. Steam is the only place I play this great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoyed Morrowind, Oblivion, Skyrim, or any other Elder Scrolls title, but had wished you could play it with your friends cooperatively. Now you can.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I mean its just an online mmorpg with TES Flavor. Why not play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the Game but need to have more magic to play around with and don`t have to lose you`re other magic to get better magic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its hard to go back to Skyrim after experiencing ESO.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite mmos ever\r\nall the dlc stuff sucks though",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I quit because of how my account ban was handled, and because the game simply isn’t the same anymore.\n\nI played ESO for years. I supported it financially, recommended it, and genuinely enjoyed what it used to be. But after the major layoffs, the decline became impossible to ignore.\nContent turned repetitive, updates felt rushed, events became filler, and communication dropped to almost nothing. The passion that once defined ESO is gone.\n\nAnd then came my ban — which was, frankly, unbelievable.\n\nIn a private conversation within my guild (not in zone chat, not in general chat, not directed at any player), I expressed frustration and referred to ESO as a “retarded game.”\nIt was blunt criticism aimed purely at the game itself — not at a person, not at a group, not at anything protected.\nJust criticism of the product.\n\nYet the ban stated it was for targeting a protected category, which was simply not true.\nIt happened because a single word was pulled out of context and treated as something it wasn’t.\n\nTo put it plainly:\nI was banned for criticizing the game.\nNot for harassing anyone.\nNot for insulting players.\nNot for public misconduct.\nJust for an offhand remark about the game in a private setting.\n\nWhen the support team can’t distinguish legitimate criticism of a product from an actual violation, something is deeply wrong. And when your explanation is ignored in favor of a template, trust disappears instantly.\n\nAfter that, quitting wasn’t even a question.\nESO today feels like a project on autopilot — the quality has dropped, the updates lack direction, and the support structure no longer understands context or fairness.\n\nWould I recommend it?\nNot anymore. The creativity is gone, the fun is gone, and the support system can punish you for a private, harmless criticism of the game itself.",
      "voted_up": false,
      "votes_helpful": 366
    },
    {
      "review": "I am 2.1k level and the game is unplayable beyond a certain level without paying for PLUS+. \nplaying without paying is spending half the time playing storage simulator and playing the game. Paying is no longer about gaining things, it is about avoiding annoying sorting chores. I used to love this game with all my heart but it has become pay or pain. this game is losing player base with all the roadblocks to enjoyment in the pursuit of money. becoming a microtransaction game has ruined what it once was. We won't return to what is was but I hope there may be a revival of what it once was.\n\nreturning to the game is painful. I don't want to have to pay to return to game I have spent countless hours in just to come play for a bit. this is the way to lose players.  I am honestly getting close to done with this game altogether. bad updates, worse pay to play restrictions. I earned my way to the top, im not paying to keep it. I will spend my money elsewhere. its literally a chore to log back in and try to play again. I just wont comeback.\n\n\nMay you walk on warm sands traveller...peace be found in the shade...may your sword stay sharp.",
      "voted_up": false,
      "votes_helpful": 91
    },
    {
      "review": "Just another fomo exploatation grinding mmo, 10 years of development still beta, bugged quests, shited servers maintenanced half day every week, crashes, network drops, you can run trial for half hour then get disconnected, reload in 1 minute and have no completion reward, legendary quality events. If there was no such IP no one take look on this crap. Dont look my played time, launcher make fake stats for game, real play time about 1000hrs mb, not so much for mmo. And most important - you cant play full game untill purchase it 3 times. Base game itself, actual chapter for full price, and to access chapters that came earlier you should buy collector's edition and mini-dlcs for crowns, dozens of them, or eso+ subscription. Better play Skyrim another time.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Old. Abandoned. Mass layoffs of developers. AI-based GMs that get things VERY wrong. Offshore CS humans (i.e. Rajesh). Gluck old game!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Was a good game and stable years back.. now it is a money grabber and after every update, game crashes.\nI uninstalled this game and will never look back.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Yes, and it pains me to say this, but the game is over for me now. The reason is that every new update not only embraces new players for their money, but also feels like a slap in the face to all the veteran players. I don’t think they even have a clear idea of what they want to build or transform in the long run — it feels like they themselves don’t know what they’re doing. It’s completely a waste of time anymore. :/",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I'm not sure what happened to this game or to me.  Tbh, I really love the game, love the lore, love character design, love game map/monster, love most of stuffs that game provided...but I stopped logging in for a while and uninstalled it.\nI can only list out 2 things right now in my mind that I don't like from the game:\n1. Horse mount is mandatory for me in any games, but the horse mounts in this game look stupid especially the rear legs, and I don't want them.\n2. Most of the time I spent in game was in battleground but the battleground is not fun anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "(Played mostly not through Steam)\n\nWent from best MMO, to worst MMO in a span of a few years.\n\nArrogant, untrustworthy and lying devs with messiah complex, promising things while doing the exact opposite. And silence or ban anyone with opinions that don't align with theirs. Even going as far as banning people in-game, when they gave the game a negative review on Steam. \n\nThe game also includes IRL politics, even weaving it into the \"lore\" of the game. And you know what happens when you disagree with their stance. You will get banned!\n\nLiterally has more micro transactions and paywalls then the Sims 4. You'll get bombarded with ads for their in-game store the moment you log in with a character. Lots of mechanics and features are also behind paywalls.\n\nSelling unfinished and/or broken DLC for the price of a triple A game, which also ruin the game's stability everytime they release one. This even happens with minor updates...\n\nGame is still riddled with bugs that are present since day one. And missing lots of important QoL features. They even kept a bug in the game, and called it a feature. Multiple times!\n\nYou don't get any interesting rewards from playing the game. Because all the good looking equipment, mounts, pets etc, are only obtainable by paying. The only things you can obtain by playing is numbers.\n\nLots of downtime, frequent disconnections, insane lag and permanent high latency. Even when the servers are literally next to your city and you have amazing internet...\n\nThe inability to hire appropriate people to fill roles within the company. A good example is the Head-Dev of Combat, who doesn't even know all the combat mechanics.\n\nThe world feels barren and empty. because the only people who play currently; Are new players who do not yet know what an absolute mess this game is. And people with severe sunken cost falacy.\n\nEDIT: Forgot to mention that they recycle stuff a lot. And call it \"new content\".\n\nEDIT 2: It states in the EULA that they actively sell your data (address, name, email) to 3rd party companies. Even if you pay them, they screw you over. And you have to agree with this insidious practice to play the game...",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Love the game but everything is so p2w and you cant even do that much because of it, pls make it less p2w",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "been an elder scrolls fan for over 16 years and eso has been by far the worst gameplay wise but the coolest space wise and lore wise so far!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The world, lore, graphics, story content, and music are really good.  The combat, dungeons, skill system, progression, inventory system, shop, PvP, class balance and endgame content are deeply unsatisfying.\r\n\r\nIt's a shame that after 600+ hours, the only thing I feel about this game is that it's just really boring to play.  It's a game that excels when played slowly, but everything about it encourages you to play it fast.  Classes are basically the same thing with different animations, balance doesn't exist anymore thanks to Arcanist, and the group content is nowhere near engaging enough to justify the grind and min/maxing at end game.  I don't mind daily dungeons being stupidly easy as long as the combat is fun.  But combat just...isn't fun.\r\n\r\nRIP to the MMO era.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have mixed feelings about ESO, but I ultimately must advise against getting this game. TLDR: It feels shallow, pay-to-win, and repetitive.\n\n\n I've had this game few a few years now and have returned to it on and off. You pay for the base game, DLCs (Which include skill points), ESO+ membership (almost needed for the crafting bag alone), classes (including the undisputed PVE meta, the arcanist) optional fast mount leveling, housing, and cosmetics. I've spent hundreds of dollars and put hundreds of hours into this game, yet I feel that I've barely progressed. Expect to spend at least ~120hrs getting your first character leveled to the character cap (lvl 50) and into 160 Champion Points (the level cap for gear).\n\n Gameplay is sluggish and repetitive. Quests and world-building are really fun at first, until you notice all of the world's zone story's are basically a copy-paste, including newer DLC zones like Necrom. You have to repeat these stories when you level and get skill points for a new character. The game is not very forgiving for new users and there are so many different systems and gameplay styles to learn. Every single class has a healing, tanking, and dps skill lines. With the new subclassing system most builds forgo the other two unwanted lines and make a pure dps, healer, or tank. Their skills are not normally thematically cohesive or fun together, but its the PVP meta and you suffer as a pure class build. \n\nIMO If you are an Elder Scrolls fan stick to single-player titles; If you are an MMO fan, find an entirely different game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is in a really bad state if you like pvp. Players can barely  stand the game. Videos are overwhelmingly negative. Everyone in pvp is complain complain complain - and the developers are some of the most inept I've ever seen.  I'm going back to Gw2 because WvW is everything Cyrodiil wishes it was.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "crap grind, crap game play, crap servers...",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The Good:\n-Massive world full of lore, stories, and quests.\n-Voice acting (supports the industry!).\n-There's always a lot to do and immerse yourself in ...so long as you don't run out of inventory or storage space.\n\nThe Bad: (Like, it's really bad):\n-Never enough storage unless you pay hefty subscription fees.\n-Subscription fees\n-Season passes now, too???\n-Crown Store (Pay, pay more, pay some more too. Boosters, upgrades, cosmetics, gachas, scams, loot boxes, blehcetera. Oh, and of course its all overpriced :).\n-Any and all methods are used to add more fees/costs/expenses to the game. There's probably even more shakedown methods planned to come...\n-It feels like a free-to-play with biggest focus on pressuring to constantly spend more, more, more.\n-Awful corporate practices for staff (search it up). Very unethical employer.\n\nIf you enjoy the game, play it to use up server resources.\nDon't pay into any of the marketing junk.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Mixed recommendation..\n\nIt's an enjoyable game with a lot of effort put in trying to keep the lore consistent with other The Elder Scrolls games. For players who want to focus on the Story, the Enemy level scaling is great but aside from High level dungeons, the game can feel very easy; though there is a big spike in difficulty in DLC dungeons and raids. The combat ranges from brain-dead to engaging depending on the class since the balance really benefits certain Class combinations.\n\nThe monetization strategy seems to have changed so it's a great deal when massively discounted but the recent event featuring the Content Pass area shows it wasn't really worth the full price. Purchasing a Subscription also MASSIVELY helps when crafting as there's too much crafting junk and it comes with some Premium currency.\nThe prices of the in-game store (Crown Store) are also very high but occasional sales and the monthly Subscription help out there.\n\nGood for players who want more of The Elder Scrolls world.\nDecent for anyone who wants an action online game with a lot to do.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TL;DR: a fun game for Elder Scrolls lore and casual play\n\nVery inconvenient and confusing business model, to gain full access to all areas that even the Expansion bundles don't grant access to you can purchase the DLC areas (DLC are group dungeons with most including a DLC overland area) through the mostly overpriced store or subscribe for access along with other convenience benefits. There is also the option of trading in-game gold to others that have access to gifting but at your own risk.\n\nMonetization aside...\nCons:\nOverland and Normal difficulty for low man content is very easy\nQuite a few invisible walls\nThe jumping physics are worse than Skyrim's\nGraphics are dated for old content\nDLSS and FSR implementations are outdated\nTerrible combat balance (PvE)\n\nPros:\nHDR\nsmol Alfiq cat NPCs",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "players voice seems to be ignored, weeks of testing goes live with all the bugs and and issues we reported on the PTS, current state of the game has no vision at this moment, its about the bottom line and milking that, the game has its older base content to carry its story and lore for years to come, new players will extend into the land of elder scrolls further and enjoy it,lore, stories and characters are for the most part, flushed out and well written and have solid voice acting, older players will feel lost in the state of the modern game, \r\n\r\nchange needs to happen to be fresh and extend the years, but when endless systems are added, NEVER finished and more added again YEARS later, knowing too well it will not be finished or tied up, we know what we are in for, \r\n\r\nrecent update changed things we didnt need or ask for, with the promise it wont impact combat, weeks of feedback stating it is impacting more then combat during testing, it still went live and things are a mess, no need to spend countless hours anymore in this game, loved this game, i hope ZOS at the top of the food chain can get there fill and give the people who worked hard on this game over the years the chance to do the job, \r\n\r\nhope to eat crow reading this back in a year or two and eso is in a good place again, but right now, this game is a hot mess, other things worth my time",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I originally owned this game on Xbox One. I witnessed countless casual to roleplay events throughout the 10 years whenever Dark Brotherhood, Thieves Guild, Wrothgar, and etc were released and now? Now we're faced with Content passes for the \"entire year\" because Zenimax has run out of ideas. \"We want more players engaged.\" Subclassing definitely made people more engaged but engaged in the wrong ways. You made a game about CLASSES, You gave them identities of their own and tried to balance them. You gave up halfway through and said, \"Yeah let's just give everyone the ability to pick 2 skill lines from each, that'll definitely balance the game :3\" I petition the developers at Zenimax to play the Gray Host Campaign and tell me what's NOT wrong with it? PVP back then especially after the Imperial City free update, was thriving. It was hecka fun and i had so much fun. Now because of sublcassing I'd be lucky not to encounter 30 tanks that emote during combat. The Developers don't even play PVP at all. \n\nThe point is, Zenimax has destroyed many people's fun in the game, you can tell me \"There's more fun than just PVP.\" Sure housing is great, doing all the questlines, and roleplaying i guess. What comes after though? The true endgame for a lot of players was PVP, which is now ruined due to subclassing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’ve spent over 10 years in ESO across PS4, Xbox One X, Series X, and now PC.\r\nOn Xbox, I’ve racked up 1,000+ hours, and on PC I’m close to 700. That’s 1,700 hours of questing, fighting, crafting, lagging, and occasionally wondering why I’m still here. So yes — I’m definitely qualified to say this: ESO in 2025 is the worst state I’ve ever seen it in.\r\n\r\nLet’s start with the subclassing system, which was meant to “add depth.” Instead, it removed what little class identity we had left. Playing a pure Templar or Warden now feels like turning up to a war armed with a butter knife. You’re underpowered unless you build some Frankenstein subclass monstrosity that barely resembles the class you actually wanted to play.\r\n\r\nThen there’s the whole spell crafting and skill customisation fiasco. What could’ve been a groundbreaking system got turned into a flashy cash shop parade. Instead of meaningful customisation, they shoved in paid skill skins. Not stronger skills. Not improved gameplay. Just overpriced glitter for your abilities. Superb priorities.\r\n\r\nContent? ESO doesn’t do content anymore — it does snacks.\r\nThink Orsinium, think Skyrim… now think Solstice, a tiny island with the depth of a puddle and exactly one life event. Blink and you’ve finished it. Honestly, I’ve seen mobile games put out bigger updates.\r\n\r\nPerformance? Completely tanked since the Writhing Wall event. Lag everywhere. Delays. Rubberbanding. Combat feeling like turn-based gameplay but without the charm.\r\nAnd before anyone dares blame my setup:\r\n\r\nRTX 4060 8GB\r\n\r\n32GB RAM\r\n\r\nVirgin Media 400+ Mbps down / 200 Mbps up\r\n\r\nMy PC is fine. My internet is fine. ESO’s servers? Absolutely not fine. They feel like they’re held together with chewing gum and wishful thinking.\r\n\r\nAnd then we have PvP — or what’s left of it.\r\nBattlegrounds are so dead I waited over three hours just to complete a daily. Three hours. I’ve had NHS GP appointments faster than that.\r\nCyrodiil is just as tragic. If you try to capture a fort solo, NPCs respawn faster than you can blink, your faction has one lonely player online, and the enemy rolls in with a group of 10 like they’re on a team-building retreat.\r\n\r\nSo after a decade, four platforms, and nearly 1,600 hours of loyalty… this is what ESO 2025 has become: laggy, empty, monetised, and held together by duct tape.\r\n\r\nAnd honestly? After all this?\r\nFor the first time in 10 years… I think I’m finally going to touch grass. Actual grass. In the real world. Because at this point, even nature has better performance than ESO.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i *used* to like this game a lot......\r\n\r\nMajor changes in the past year, and in the past few months in particular, have drastically altered my thoughts about it.\r\n\r\nPvP has been homogenized into boring slop\r\nSubclasses ended class identity\r\nand now....\r\n\r\nCONTENT PASSES\r\n\r\nthink of all the worst ways you have been made to buy DLC and they did not fail to put their best foot forward to contend. \r\n\r\n High price tag? got it\r\nConfusing language about whats included? yessssum\r\nRemoval of access to content with ESO Plus like we used to get? 100%\r\n\r\nthey combined EA methods of DLC delivery with Apple innovation (removing features on phones).\r\n\r\nThis is depressing....",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’ve played ESO for a long time (account from 2014, re-bought it on Steam), but the game has headed in a direction that’s hard to support. The new subclass system was supposed to add depth, but instead it made every class feel the same. Unique playstyles, identities, and strengths got flattened into a single, shared template. When every class can do everything, nothing feels or looks special anymore.\n\nAnd honestly, the lack of proper price regionalization is rough. ESO Plus and cosmetics are priced as if global buying power doesn’t exist, which makes staying subscribed hard to justify.\n\nGreat world, great quests, but between the homogenized classes and the wallet-unfriendly pricing, it’s a tough sell.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "latest content pass is buggy and boring, i found the final boss fight tedious and annoying, im pissed at myself for spending 60 CND on this shit.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Subclasses are the worst thing the developers could have added to the game...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "just can not get this game to run at all\nit crashes at start of loading screen \nand nothing i seem to do works\nwould i recommend this game NO not at the moment\ni`ve repaired game\nuninstalled and re-installed\nand nothing works",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "With nearly 1k hours on steam and over 1k hours on xbox I feel pretty qualified to give a review. I LOVED this game but with all the changes that have happened this year I can't recommend it anymore. I quit.\n\nTL;DR - Recent updates have ruined the game, content pass seems scummy, ESO+ is okay in my eyes, player base is/has declined dramtically, AI ban waves are falsely banning accounts new and old. \n\nFor the casual/new players this game is great. There's a lot to learn but it isn't as technical or difficult as other MMOs. However for long time players it's become a joke - the last few updates especially. Crazy changes to the skill/bar system leave you running back and forth between skills and set ups while wondering if the build you're using will even be valid next month, it just doesn't seem to respect your time anymore. \n\nNext biggest issue is the AI ban waves - so many people have been banned unjustly due to the AI moderation system they seem to be using. Trying to appeal it is a joke and some players with hundreds of dollars spent and thousands of hours invested have permanently lost their accounts for no real reason. Even fresh level 10-20 players have been banned out of no where for no reason..\n\nThen there's the content pass, up until this year (2025) ESO released 1 main expansion you could purchase and you'd get a complete expansion pack for the game. New zone, new zone quests, new items, furnishings etc etc. Now they've decided to make you pay extra to drip feed you 1 expansion throughout the whole year, essentially making you pay full price for something you won't have access to for months, half a year even.\n\nThe ESO+ system is subjective - I felt the pricing is fair enough considering what you gain from it (all expansions except the very newest one, unlimited crafting mat storage, 10% xp bonus and 1650 crowns per month). I stayed subbed for pretty much every month of the 3 years total that I played so I can't speak on the ESO experience without it. \n\nThe player base - the people are amazing here, you can make real and long term friendships with the people you meet. That's not exclusive to ESO though. The real issue with player base is the declining numbers, you can find rough numbers by googling but keep in mind those numbers are divided between US and EU servers. From personal experience I can tell you that people are quitting or taking long breaks (myself included), dungeon and battleground queues have never been so long..",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Putting this review as negative for the moment. The game as a whole is still enjoyable and I've put in a lot of hours, however the reason for the negative review is their most recent content release being season of the worm cult. Specifically the writhing fortress event. I was skeptical in the beginning because this event is supposed to be a time limited event and quite frankly I feel they dropped the ball hard on this event. In phase one you basically just did some daily quests and farmed what i call glorified dolmens, basically there are these camps that will occasionally spawn enemies and when you fight them off you get a chest. One of the daily quest npcs has you complete these for their quest objectives, the rest send you after various enemies around the world for the most part. This isnt really much different from what other activities in the game already offer, and in phase two the only thing you get is an increase in how often these camps spawn enemies to fight off and a world boss and only a few more rewards all with horrible drop rates. Phase 3 you only get a public dungeon which likely doesn't add any new rewards other than a title you get for completing it. Worst part about most of this is this writhing fortress as its called in the game is only available for 7 days, likely not a huge issue since all you get is a title but it feels like they wanted to create FOMO and screwed it up because even the dungeon in question is super buggy and they are taking a while to fix it all while the clock for how long its active continues to tick down. Least they could do is pause the timer until they fix it. If this is the direction they choose to go in from this point forward its unimpressive and worse than what they were already doing in my opinion, which is why for now this is a negative review. I may update this in the future if they show any changes to indicate course correction. For now I guess I will enjoy the other parts of the game that are working correctly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For awhile I loved this game. I despise subclassing. The chapters for the past few years have been boring, repetitive and stale. Even the voice actors sound bord. PVP Cyrodile has become a joke. The only time you have enough players is at night. Sorry, but I have to work for a living and can't stay up until midnight. Most of the time it's two faction against one. I'm canceling the subscription. I don't see this game lasting much longer.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game downloads over 100gbs of data from steam just for the laucher, when you start the game through steam,laucher pops up and it wants to download another 100gb. Yeah  no",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Took a break and came back to a mess, Subclassing is horrible, No one does PvP anymore, this wall event is long and boring. What happened to this game? \r\n\r\nI no longer recommend this game, crafting bag paywall bs, loot boxes, they ruined classes, pvp is dead, and uninspired design since I last played.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "launcher and steam version are not on par! you will need to download 300gb of the same shit over again!",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "After 10k+ Hours spent in ESO and at least 5k hours spent in pvp. This game has plummeted, The Devs Literally hate the veteran community. There is No more classes in this Class Based MMO. 10 years into the games life cycle and Zenimax has a brilliant idea to just nullify all classes and homogenize everything. 3 skill Lines now dominate the entire meta in both pve and pvp. Over the years Zenimax has done nothing to fix any bugs, Many since launch 10 years ago still remain. THE ITEMIZATION IS SO TERRIBLE. REWARDS HAVE NOT BEEN UPDATED IN YEARS. There is no sense of wonder in the world, no extremely rare, low drop rate, unique items in the game. No monsters or bosses have Rare loot, nothing. The rewards are so lack luster in makes me scared for the future of MMO's. The item sets that are in game out of the 500 of them, 5 are usable. The games CASH SHOP MOUNTS / SKINS/ are far superior looking then anything earned in the hardest content of the game. You have to gamble what could be $1000+USD to even have a remote chance at getting an apex rewards mount\n\nTHIS IS BY FAR THE MOST PREDATORY CASH SHOP I HAVE EVER SEEN IN A MMO. BE WARNED. THEY MAKE YOU GAMBLE FOR EVERYTHING.\nTHEY MAKE YOU PAY $15/month for a craft bag that should have been in the game from the beginning no payment required.\nSO MUCH ABONDONED CONTENT.\nThey add full game systems such as the justice system for it to never be touched or updated. This is one of many.\nI could keep going on things such as how bad of a community team they have is and how there community managers hate the player base. cough cough Gina cough cough Jess. There are countless issues I could talk about but the point is:\nDon't waste your time with this game. You will thank me later.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "\"3 hours\"  is just for updating game and still updating...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've played ESO in 2014, 2017 and now for a few months from september. Raised a few lvl50's. It was just too easy with almost no deaths. And extremely repeititive even questlines are filled with different lora and graphics. They follow the same type scnario all the time. But worst is the milestone system. Enter a dungeon, play but NO progress is saved. Exit the game and come back to the entrance. Exp or items aren't lost but all the TIME you put into it is GONE. Very tiresome.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game sucks. 10k+ hours on console plus 1.7k on here. Played since release. Since IC dropped the devs made questionable decisions but everyone just kinda let it slide. TG dropped making PVP ranks easier (sure) but didnt nerf proxy and with original VD dropping at the same time it ruined the game until fixed. Morrowind was completely non functional. If you died and couldn't get a res, you'd have to restart the game. Warden was beyond stupid on release it makes absolutely 0 sense how that abomination got through. Then it got gutted after sales. One tamriel killed the game by universally making all PVE zones toddler difficulty and introducing proc sets. \n\nSpeaking of sets, the devs proclaim how great build diversity because of all the different sets but 90% of them are useless. They've been eclipsed and powercrept. Some newer sets have MULTIPLE older set bonuses in them combined. \n\nWhen necro dropped it was broken too, then they gutted it after sales. Now that cycle was in arc until literally EVERYONE SAID \"dont do hybridization, it will not create build diversity like you think, itll just lead to one meta everyone follows\". Of course they don't listen and the meta is just the exact same on every class. There is 0 class identity, the whole deception of telling you to pick your class means nothing, just take skills from other classes (yes thats a thing). Oh PVPS unplayable levels of laggy, PVE is a forced pipeline of the same boring builds.\n\nIf you wanna run around questing in windhelm, explore cyrodiil in a dead pvp campaign or morrowind due to being a fan of older TES games, then get it on sale, go quest until your hearts content then uninstall.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Constantly freezing and dropping me. I have been an ESO+ member for the entire time I have played this game. The benefits are lessening and the gameplay is stagnant. I didn't bother investing into the latest chapter and from the disappointment I hear in zone chat I'm glad I didn't. Something needs to change or I am about to find something else to play.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "since I purchased this game I'm trying to play it on mac and simply couldnt. The game crashed, authorization bugs and now a mouse bug. let's see if I can make it work or if not I'll get a reinbursement.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the crown crates and pay to play in this game are very predatory. there should be a pity system for the crates because they are not worth it as they are. the pay to play would only make sense if the game was free but you have to spend $20 just to get the game. also all new dlc's should be available when you have eso plus. it doesn't make any sense for them to not be. \r\n\r\napart from all of these things, the game is so fun and there is plenty to do base game. i love doing dungeons and quests for certain items. overall they just need to get a grip and make the game free to play bc as is its very unappealing when you get in the game and realize how pricey everything is.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ">Bought the maximum edition of the game\n>Waited 5 hours for it to install \n>Took 5 minutes to load on an NVME SSD\n>Character creation menu\n>Trying to choose an Imperial\n>Paywalled race\n>The game looks like it was made in 2007\n>5 minutes of gameplay\n>Disconnected \n\n0/10, instant refund. Go eat a pile of shit ZOS and Bethesda.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "update your steam page, its a 150gb download then after that you have to do another 100gb download. if you play on a hot spot like me dont install from steam, download from there own launcher since they dont update it on steam",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Lack of progression makes the game super boring. Levels are useless, since all enemies etc scale with you apparently. There is no difference between being level 1 or 10 basically, you don't deal more damages or anything.\n\nEnemies deal no damages to you, so you can steamroll on pretty much everything. \n\nI know there is some end-game and PVP stuff, but I have no interest in those, I should not have to play hundreds of hours just to unlock the fun part of a game...\n\nEnvironments and crafting system. are nice tho.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Don't bother joining in late to the party, its expensive. Own most of the content on another platform, always wanted it on PC, so i pickup this bundled with the content pass 2025 with the previous chapters thinking it was a great deal. BUYER BEWARE every other piece of content released during those chapters are locked behind their overpriced in-game store, wanna join the thieves guild? that'll be 20$, when was that content released buddy? wanna play as an imperial? that'll be 20$. NO Cross platform progress what-so-ever so start from scratch with even less. Main story and chapter stories are just boring to boot. i also have the PC Tamriel unlimited edition with imperial and play any race unlocked but IT DOES NOT CARRY OVER TO STEAM.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nice game but quite scummy to force players to buy more parts of the map\ni know this is something that happens in a lotta MMOs but still quite messed up",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I will tell you how the game is - after I downloaded the other half of this fuck over their genius second launcher.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's hollow.\nThat's a constant feeling throughout the game.\n\nBig maps, copy and pasted decorations and voice acted scarecrows to shoot at.\nTo enjoy anything good you must pay. \nWant a cool pet, companion, house, mount, armour? \nPay. There is no way to earn crowns in game unless you trade with a player with may be unreliable. \n\nThere is no sense of the world. \n\nPlenty of quests which are:\nFind, Kill, Craft.\n\nThere is no tangible immersion. No result from your efforts. \n\nI like to see:\nA grand exchange - allow players to farm and sell to others - mining is tedious reward the labour. \nA way to convert gold to crowns.\nPlayers can trade time or real money for exclusive rewards. \n\nA means by which player activity matters. \n\nScaled enemies.\nI'm lv26.\nThere are no enemies that require a tactic beyond dps stack and heal. \nThe 'hard' fights are damage sponges. \n\nI understand it's their first mmo, but they need to place people before profit or they will go the way of EA.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you're trying to play this on a Mac - Don't bother. It just keeps crashing. The official ESO website says I should try lowering the graphics but trying to do that also just crashes the game. \r\nI'm hoping to get a refund because just downloading and installing the game via the ESO launcher for 3 hours counts as Play Time in Steam...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is too easy and I really, really don't like that the enemies get stronger as you get stronger. It breaks immersion and feeling of progress. \n\nSorry.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "For begginers the game is fun, the world is big and the quests are intertening, the system of getting gold with pvp is awesome and love it, but to get better and become stronger you must pay, the pvp is unbalanced and most of open pvp (cyrodiil no champion points or imperial city) don't have players and cyrodiil with champion points the pvp is unbalanced.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "great game and its very addictive but honestly the pc community for the game is horrific. some very self entitled people on this game.\n\nfor one guild i was asked to complete a application form",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "HOW MUCH DO I HAVE TO DOWNLOAD!!!!???? 120gb from Steam and 110gb from within the launcher itself... At this point I might as well just give my PC to the Daedra as a sacrifice.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Warning for returning players: If you are returning to the game after a period of inactivity, be aware that the user experience could be currently hampered by non-transparent account restrictions.\n\nPersonally I faced a block on in-game gifting, despite being a recurringly paying and playing customer since 2021. I have not played during a recent year, then got back a couple of days ago to make a gift to my peer because he loved the mount and I was really hoping to make him a nice surprise for the occasion we had. Apparently, I cannot do this even though I resubscribed and purchased crowns specifically for the case. Moreover I am  short in time, because the offer is time-bound on top of all.\n\nConditions enlisted as such:\n\n1) Account in good standing (no Safety/ToS violations in the last six months) -- this is clear and reasonable. My account meets this condition.\n2) Account must be 90+ days old. -- Also clear and reasonable. My account meets this requirement as well.\n3) Account must show consistent game play activity and/or be active in an in-game ESO community **prior to submitting your application**. -- This is where clarification is needed as I think.\nWhile I may not have been active very recently, I have a history of regular gameplay (at least 380+ hours in Steam). The policy does not explicitly indicate when such activity must have occurred prior to the request, how much is required, or how the threshold is determined.\n\nAll support gave me is that:\n1) \"Your account must show consistent game play activity and/or be active in an in-game ESO community prior to submitting your application to be considered for eligibility to participate in the ESO gifting program.\"\n2) \"Gifting Access was removed from all accounts and has only been re-added to those that have met all the necessary qualifications. The eligibility criteria are based on a dynamic set of factors, and to maintain the integrity of the program, we are unable to disclose the specific requirements needed to unlock gifting on accounts.\"\n 3) \"While we cannot provide details on the specific criteria, we assure you that if you continue to play normally and reapply later, your account will be reviewed for gifting eligibility. As we do not have any further information on this topic, we will be closing this ticket.\"\n\nThey ignored the previous history of my account and the circumstances of my situation even though I described everything to the support guys: the item I want to gift, to whom this gift is going, etc.\n\nI am deeply frustrated. I do understand the situation with a black market of the crowns, but current approach punishes highly motivated, returning, and paying players with arbitrary restrictions and zero transparency.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Jesus Christ, I downloaded 120 Gb for your god damn game, and when I launch the launcher, you're still trying to make me download another 100 Gb? Wtf is this shit? I remember now why I uninstalled this crap without even playing it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is too boring and easy. It seems fun at first until you get into it then you realize its made for babies. too casual for the DrDaddyJalapeno.\n\nCHRONO ODYSSEY WILL KILL THIS GAME> GET IT WHEN IT COMES OUT!!!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crashes every 10 min. 250 Gb size. Can't even finish a quest without getting booted from server.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My main with hundreds of hours logged can't use potions, and hasn't been able to for months on end.\r\n\r\nI built the entire character around doing casual PvE with sets that buff potion use.\r\n\r\nIf anyone reading this was thinking about using the Seeker Synthesis crafted set from the Necrom DLC I paid good money for... don't.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "terrible developers, even worse community",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why do all MMOs feel like someone's final project in a freshman game dev class?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i have crazy hours in this game. i'm a roleplayer, have been for years. i'm talking proper roleplayer, as in, pretend to be my character in setting, have a guild, a concept, etc, respond accordingly, use setting appropriate language. well guess what? i got BANNED for 72 hours for something i said in character. what did I say? a slur? did I insult someone? did someone report me? nope. someone's character said they liked abusive women, so i jokingly told them to kill themself and blew a kiss. automated chat system banned me. i contacted support and got unbanned after 2 days but it ruined my weekend and i couldn't RP with my pals. the game is completely controlled by LGBT DEI politics and it shows. let me remind you - this game has quests where NPCs ask you to kill yourself, several of them - the one in coldharbour's lost town being the most memorable. this game has a god of RAPE who is the main antagonist of the base game story, molag bal. also a god of sex, mephala. TES is a dark setting with foul gods and fouler people. yet i got banned for that in the confidence of only friends. you can't even talk to your friends anymore because you constantly have to tiptoe around chat automaton that is aggressive and not monitored by real people.\n\ngameplay wise, subclassing ruined the game. no debate about that. everyone uses arcanist fatecarver and if you don't you're massively disadvantaged. every dps build looks the same unless you want to settle for low numbers just for the sake of your sanity. pvp is ruined, battlegrounds used to be 4v4v4 which was chaotic and massively fun, i LOVED bgs but they changed them to 4v4 and now they suck. one side will crush the other completely and that's that. there's no nuance anymore, no third partying fights to secure victory or distracting the enemy team or anything. cyrodiil is dead, performance they cant seem to fix even though gw2's WvW system is identical and completely fine with hundreds of players.\n\ngame will go into maintenance mode by 2027 is my prediction. don't bother getting into it or buying anything, solstice was crap and everyone i know who bought it complained (i didnt cuz im smart). every single DLC since summerset has been full of DEI characters and trans ideology in the side stories and even the main stories in some smaller part. the whole TES setting we fell in love with that was about daedric intrigue is dead.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Fked up scribs \nNo longer cute buggies that thump they buts\n\n\nThats gore of my comfort bug",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What the actual fuck is this content pass shit Bethesda? How broke did starfield leave you? This game is 11 years old, are you charging 50 bucks a pop for a content pass because you know only 5 people will buy it?\n\nNot a single fucking person named Telvanni in all of Sadrith Mora.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Terrible Gameplay, pay to win, not fun",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If only we had two decades of presidence set by MMOs prior that have introduced \"multiclassing\" into their game... Oh if only we knew that it would completely destroy class-identity and make the gameplay boring as shit, because everyone is copying the exact same homogenized build.  if only we could have seen this coming with numerous failed MMOs to prove that this strategy almost never works, and requires lifelong balancing and tweaking... Oh but they'll just slap this shit in without thought, like Scribing and then forget about it like it was just some seasonal gimmick and not a massive overhaul to the gameplay",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This awful scaling system and absurdly low difficulty level completely kill any fun from the game.The game is so easy anyone with one working finger and one brain cell can beat it without dying and putting any efford. I am so angry becouse otherwise this game could be so good, it has a lot of potential, but lack of any challenge makes it boring as hell. Game gives you everything for free and all enemies are being killed in 2 hits. There is no reason to play this. Total garbage. But just a good balance and removing scalling could fix all of that...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "good game but too many things that make playing a chore rather than fun times. like others have said, if you try to come back to playing but can no longer afford or want a Plus subscription, you are doomed to playing storage organiser forever. sucks all the fun and life out. \nalso furniture limits are balls. heres a big giant mansion with 3 side houses attached - 350 items max. no decorative clutter for you! \neverything in the game is made to irritate you into spending money on it, it would be nice if there was a bit of focus instead on making the game worthwhile for free players too",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's just too damn easy.\n\nWhat is the POINT of levelling when nothing gives you a challenge.\n\nSuch a waste.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you're looking of PvP don't play this game. 2 of the 3 factions work together consistently and bully the 3rd faction (AD). When all factions are at pop lock the 2 factions sit at gates of 3rd and refuse to fight each other. It's nothing but toxic gameplay and devs say it's not against their \"terms of service.\" As a 5 year player I canceled my subscription after being bullied so hard as our faction when pop locked is outnumbered 2 to 1. The enemy factions also send in AFKers into the 3rd faction to lower our numbers. You can tell because when you look up their account its someone with 1 AD character while they have multiple characters for the other factions. These players sit at the gates AFKing to give their other factions a number advantage.\n\nIf you're looking for PvE again don't play. Their last PvE content got MASSIVE negative reviews as well. They made it so the gear that you get you had to GRIND heavily for and it wasn't even good gear, and people only wanted it for their collections and were disappointed in how long it took to grind just for a collection piece. The game is also unbalanced as for as PvE and PvP as they only buff tank and heal sets. DPS are a dying species as people are super tanky, heal like beasts, are CC immune and run around the map at lightning speeds.\n\nLastly their latest update allowed for subclassing which also has MASSIVLY been reviewed negatively. There is no such thing as being a pure class anymore. Subclassing is so broken that you're forced into it as ALL of the best builds for PvE AND PvP require you to subclass.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "had disconnection every 5-10 minutes in game..out of 4 hours i spent 2 hours waiting to log back in because it keeps showing error while logging in. also paid for ESO plus and cant even play due to getting kicked out of game all the time..",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just a cash grab tries to get you to buy expansions using in game currency all the time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I just can't bring myself to give a toss about anything happening in this game.  It's uninteresting in the extreme.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bots everywhere, can't transfer xbox account to this one in the year 2025, terrible UI for the store, base game only gives you three races for each faction in the year 2025?????",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've adored this game for over 1k hours. But the \"subclassing'' (multiclassing) update completely ruined the game for me. There is no class identity anymore and everyone runs the same exact build.\r\n\r\nThings feel incredibly stale and the game is simply not in a good spot atm.\r\n\r\nRIP eso, thank you for the many hours of fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to enjoy this game, but it crashes constantly. I can play for maybe a few minutes at most before it freezes and closes on its own. Every time I try to open the chat to type, it crashes instantly. I’ve verified files, reinstalled, and tried every fix I could find  nothing works. At this point it’s basically unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "inventory system is specifically designed in a way that means you have to drop hundreds of dollars on the game subscriptions just to be able to carry things or use your bank and not clog everything up with your crafting ingredients OR avoid crafting all together. if i have to buy the game itself then i shouldn't have to waste money on some dumb subscription just to be able to use my inventory. not to mention how they keep shoving loot boxes and other irl money things down our throats constantly. and they don't even let you kiss the vampires. 0/10 they never should have released that stupid horse armor dlc for oblivion.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The character action animations they updated don't seem like something that normal humans could achieve.\nI suspect they hired Zeta people to make human action animations.\nIn the game, there are always inexplicable freezes, even if your computer configuration is good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Set the damn servers under control so that people are not hitting 999+ ping during special events",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First off, dear devs: change the Test Server from being the default server for new players logging into the game. I spent like 5 hours roaming an empty world wondering where the hell everybody was, confused about if it just happened to be some kind of beginner area or if the player base was just dead. When I finally found out, I was already quite disillusioned with the empty shell of a world around me only to discover that nothing I had accomplished on my prior playthrough carried over to the new and 'real' server so I had to start over from scratch. A complete waste of time to say the least. \n\nRan into problems again on day 2 as I couldn't log in for some unknown reason... No explanation or message other than \"contact the developers.\" I didn't and the problem had solved itself one hour later. Wouldn't be surprised if this was a recurring problem.\n\nAs of the gameplay, the whole elder scrolls theme doesn't seem like anything but a nice filter. You start off very overpowered and it gets very boring, very fast. The gameplay doesn't help either, it's nothing like the elder scrolls but in the name, instead you get what's little more than an idle clicker game with some lore around it. \n\nWhen it comes to the game world itself, anything that suggests any kind of freedom or exploration is nothing but flavor, you can't actually do much than go there fetch, go back deliver... Even traps that are placed all over the dungeons offer no danger as you can easily run through or jump over them like an over-protected child. \n\nAs a whole, a big letdown. Wasn't expecting skyrim but not something that feels like a 2017 mobile game either. Would only recommend for someone looking for a companion app to compliment their brainrot while doomscrolling... If that's your jam, make sure you hit your head at least three times with something hard before going through with the purchase as it's proven to enhance the overall experience of Elder Scrolls Online.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "literally the worst gaming company around. somehow the account ive had for 10 years is canadian region. im in US. Cant use my card to purchase game time, expansions or anything. tried to buy another account and start over. apparently the bs is permalocked to ur steam account. so im stuck with an account i cant use and cant even use the new account i bought. even though locked, steam allowed me to buy another copy that i cant even use. F this company.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shamelles cashgrab that looks like a 2010 game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "they Forcing you on and on to subscribe to make it easy for you while play  !! Awful Game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dont make the mistake of purchasing anything from this company.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "this game is good but its wayyy too pay to win",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "they ruined pvp with the battleground update that removed the three teams gametype",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Deceptive and unacceptable in 2025.\nSteam lists ESO as a 125–150 GB download. What they don’t tell you - the second that finishes, ZeniMax’s own launcher forces another 100 GB “update” that feels exactly like a full reinstall. This has been broken since 2014  over ten years of the exact same complaints, thousands of negative reviews, and endless refund requests  and they still refuse to fix it or even warn buyers.\nThey knowingly sell a product that does not work as advertised on Steam, pocket the money instantly, and leave customers to waste hours and hundreds of gigabytes of drive space. This isn’t a bug; it’s deliberate. Predatory, lazy, and borderline fraudulent.\nDo not buy the Steam version. Refund immediately if you already did.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "legit cant even open the game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They decided that the game will no longer play from a mac",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring, too easy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game developers who don't listen to their playerbase, don't deserve to have one.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "3 Maximum Character Deletions at a time?",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "it was mid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game has many quests fuck that",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What is even happening to Zenimax and Bethesda",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am refuse to play it again what a waste time I might just play wow is better then this not the best game too but at least then this garbage game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"Hey you know that 150GB you just downloaded? Yeah were gonna need another 30GB Thanks\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "300 gb dowload",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After the 1000th crash i'm out",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "SHIT GAME",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pay to win",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too expensive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "OH HELL NAH",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}