{
  "positive": [
    {
      "review": "As most Persona fans know, the global launch of this game did have a shaky start with unbalanced rewards, scheduling, communication, etc. However, there's been slight improvements all around the board and it does enough to make the game feel fun and rewarding even for F2P! I've never been tempted to spend money and it's completely unnecessary unless you are chasing the top of the ranked leaderboards. An engaging story, frequent new events/characters, unique gameplay, an S tier soundtrack, strong community presence, and more, brings just the right balance of grinding and relaxing with what you already have. The only times the game has ever felt a little too pressured for grinding is certain story events that have 10-20 chapters and can be a slog, otherwise this is the best gacha I've seen to make grinding very rewarding and not frustrating. You can play for 5 minutes a day to get literally all the rewards aside from occasionally spending a few more minutes to do a limited time event. While I enjoy Persona games, it's difficult to find the right balance between daily life, story, and grinding. In P5X you have more freedom to choose to pay more attention to any 1 mechanic and you don't feel punished or that you've 'ruined' a run because there's no time limit. While I'm not a fan of turn based combat, it is very easy to get into with this game and then there's plenty of room to improve and expand your knowledge of the in game systems at your own pace. \r\nThere's a few problems mentioning unfortunately. The only gripe I have with mastering the combat system, would be that a lot of keywords and values are sometimes used in multiple ways and trying to find info on a wiki is extremely difficult. These especially happens with the Metro of Desire (rouguelite?) gamemode that I find very fun, but there are so many specific interactions that are hard to figure out without a better wiki online or in game. Also, the multiplayer features are very fun but I feel they should be expanded on, as this game is a unique opportunity to have a more social gameplay side to Persona. As always, games like this can have strange quirks that are morally gray because it's standard for anime. It's not that bad in this game compared to most forms of similar media, but it is a set back and needs to be worked on in the future. This includes the ages of certain characters being strange for how they are presented. They act as an adult, look the same or older than most college students, sometimes have options for very adult outfits, but they are 16 in the story instead of 18+. You can 'date' most female characters but not any male characters. Very weird...\r\nI will probably always be F2P in this game unless it gets a lot better, but I easily would've preferred a $20-30 price tag and then to have the game be more modeled around no microtransactions. I know this would change how content would be released and it might be difficult to keep going after a couple years, but I think it's worth looking into compromises when developing these types of games.\r\n\r\nOverall, the game is a 7/10. If you really like Persona, you should at least try it since it's free. I recommend this game to anyone who enjoys turn-based combat, a fun story with likable characters, JRPGs, Gacha, Persona, amazing soundtracks, and maybe even MMO if it's for the community aspect rather than combat. With some improvements to the clarity of certain math and interactions in the game, more gamemodes/features to use with friends, less crunch/frustration from occasional story events (the smallest issue), and moving away from some of the strange tropes in most anime media, the game seems to have the potential to be a 9/10.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fantastic gameplay and story, really like how much time and effort was invested into this spin off. I am a huge fan of the artstyle and music and often play this to chill out and relax.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Wish I could make this review as mixed as Steam says the reviews are, cause it really is mixed. They fixed 75% of the things they should've fixed a while ago. Decent gacha game, middling Persona game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "More than a Spin Off...\r\nA Gacha game that perfectly captures the style of the Original Persona 5~ \r\nBut has the potential to be more than that, Brand new characters with new story, Lovely Character Design and addictive Gameplay~\r\n\r\nSadly... the Global release came out with less rewards and the content is being rushed, Global Players are not being able to enjoy the content how Asia Servers do...\r\nThe Gacha system has room for improvement,  since there is not Softpity/Hardpity~\r\nBesides that... I Really enjoy grinding and playing this game everyday~",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great gacha for Persona fans and F2P players.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really good, For a free game a full persona game what else you want?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "lowk, its persona so its fire\r\nbut its also a gacha game so like",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "P5X is a gatcha game, but you do not need to spend money on it. If you want, look up a guide on how to do multiple guest accounts on your phone to do the first 50 or more pulls. Once you have a 5 star or two you want, \"lock in\" the guest account by linking it to your google account or similar. afterward, login here and play as you like.\r\n\r\nBeyond that strategy, the game is fairly generous with meta jewels (the primary resource for gatcha pulls). With a tiny bit of luck and using your stamina every day, its not hard to get a team together that can handle all of the story content and even most of the level 80 challenges. \r\n\r\nAs for the story, the first palace kinda sucks. It has a stupid story that is basically a weak version of P5's first palace. Atlus copied their own homework but worse on this one. After that, the second and third palaces (the only two out at time of review) are great. In my opinion, the story and puzzles of the third P5X palace rivals some of the P5 palaces. If they continue like this, the rest of them should be fire.\r\n\r\nFinally, the soundtrack is amazing...I know. Shocking coming from an Atlus game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "For a mobile Persona game, this is actually pretty solid.  They are doing a better job of listening to feedback from the players as well and not being absolutely stingy.  But as with any mobile/gacha game, they want your money. You CAN play this as F2P  just fine honestly.  It just might take some time to get to the levels you need to be at for the later palaces.  Also the highlight mechanic in battles is a very welcome addition to the turn based combat.  Just don't go in expecting Persona 5 Royal from a free game and you'll be fine.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Once you get past Subway J Slammer, it's actually pretty good (because it only went downhill from there)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing sound track, didnt play much of it myself but what i did play had awesome combat and really good music, the story did kinda lose me though",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Literally the only gacha game in existence where you shouldn't skip the cutscenes because it's actually worth playing for the story. It's a freakin' miracle.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After you get past the first 20 minutes it takes in game to download 4-5 more things to get to actual content, itt is indeed persona. I thought for a while that 3reload was the best, i think i bight have to change mi mind. Will update either way",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More persona is more. Honestly its okay nothing special.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good now, ignore all the boycott negative reviews.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and cool. Especially if you have played Persona 5 :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're expecting a £50-60 Persona game but priced as free to play with gacha, you're obviously going to be disappointed. Why would you think that?\n\nIt's best described as a mobile/FTP Persona 5 spin-off. Writing has actually been better than expected, although I had been expecting minimal. Gripping moments and pretty laugh out loud bits keep me coming back. Sure, similar set ups and characters as base P5/P5R but anyone can tell that's going to lead to something.\n\nGimmicky bosses can and have been cool, but not when it's blocked off by levelling up. \n\nYou can play the main story & side stuff (that isn't end-game type stuff) without putting even mainline Persona playtime. I dunno, I really like this game. I haven't paid any micro-transactions but I would have still paid money to play this. How much? No idea, but still would have.\n\n(btw, any time Joker shows up, he's a bit of a toolbag)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, a lot of micro transactions though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is decent.\n\nThe story is good, unlike most gatcha types is does take a little to get into it.\n\nIt doesnt have the best value for the paid content, but isnt to bad for a free to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very friendly p2w game. Can get through the story with no paywall. First 2 arcs were ight, 3rd arc is when it really gets good. Play if you love to chill and enjoy story type games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll be honest, P5X really surprised me. The gameplay is fun and smooth, almost identical to the main Persona titles but with a few extra touches that fit perfectly, the soundtrack lives up to the franchise name, the artstyle stays true to Persona with character designs that look fantastic and stand out in a great way, and somehow it manages to be both a gacha game and a Persona game at the same time, appealing to fans of both. The story starts off pretty weak, but it’s improving a lot over time and is actually getting interesting now, and even as F2P the game treats you fairly with generous rewards and no forced spending to progress. There’s already plenty of content available to play, and at this rate even more will come. If you're a Persona fan, this is worth trying, not perfect, but absolutely heading in the right direction, if they listen to the community of course.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It started off tough, but as I've played the game it's gotten better and better... I believe it will continue like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the game mainly because its infinite, gatcha games were never my thing and this isnt any different. however i never get bothered by bad story so i genually dont mind. this game is nice to play on a phone but not on pc most of the time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun to play, though I wish there were male romance options. Also, the global is naturally behind other versions, so it can be frustrating to see updates that will take a long time to reach this version. The only good part of this is that it lets players plan their savings better for future character pulls.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not bad at first I did not like it because \"ha ha gatcha money\" but I gave it a try and it gets better when update comes. like the new story and future story coming. 1st palace is so bad for hilarious reasons and second palace is not for me. also they should add where you can invite your friends in Tycoon cause it's pretty fun. so far you can play without spending anything but you'll have to grind. It won't hurt you to try the game for the story. I just hope the game gets better. I really want this game to succeed since I really like p5royal and it's a good IP for the game. hoping just HOPING it gets more better and we don't get treated like trash. Maybe I'm just coping because I'm loving this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Based off some of the comments I really thought this game would suck, but it really isn't bad. Sure, at times it feels like it was made for a mobile device and not for a PC or laptop, but the story is interesting, the gameplay is nice and while there's a few annoying microstransactions, it really doesn't ruin the game for anyone who isn't a complete collector and MUST have every  skin for every character.\nThese games take time OR money. So if you wanna experience it for what it is, I really recommend holding your wallet closed for a bit. Maybe some skins are worth it, but they're purely cosmetic. The game isn't pay to win at all in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While this game definitely has its limitations from being a gacha game in a series that isn't known for having a gacha game beforehand, there is still a lot of work that has been done with the game to make it new with a different take on the original Persona 5 & Royal game's story as well as something familiar.\nIt isn't for everyone, but it is one of the mote notable gaha like games out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game! Persona vibes which takes me back to the OG persona 5 when I first played it. Love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ignore the bad reviews, this game is fun even for ftp players!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great characters, rich gameplay, materfully crafted story 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tycoon is finally in the game, game is finally playable and also runayaka 4ever, i heart lesbians!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a bit confusing for someone like me but a fun game once given a chance and played for awhile",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you understand that gacha games are not going to stand up to the same level of quality as a traditional entry in the series, and you love the persona series, this game is great. Its fun, the gameplay loop is engaging, the story is entertaining as hell, and very kusoge esque (dont know why anyone would expect good writing in a gacha game), and the new palaces are awesome. \n\nOne thing that is holding thig game back however, is that we are stuck catching up to the chinese servers, which means the updates and characters are being added at a breakneck speed, meaning its basically impossible to f2p, so if you don't want to spend money but care about getting all the characters, i'd stay away.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love persona 5 and you don't want to replay the game again, Phantom X is a nice alternative.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Say what you will about the gacha mechanics, but it definitely is a Persona game. The game is much more challenging than previous titles to entice you to spend money on potentially getting better gear. That being said, you can play an insane amount of content without spending a single penny, so I can confidently say that you're going to have a great time before you even consider the investment.\n\nFor free-to-play games, this is a winner. The combat is what you would expect from an SMT title, while adding a few neat mechanics. The dungeons are well designed but perhaps overloaded. The story is meh; you can skip most of the dialogue and still have a good idea of what is going on. The challenges become unfair after you get so far in, but they are not required for story progression. However, to center it all back, The Phantom X still has phenomenal turn-based JRPG gameplay.\n\nPer usual Atlus nailed it on the soundtrack, nominate for Soundtrack of the Year!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the game , gacha is not too pay to win and you get a lot of free resources",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Disturbing the peace\nLook into my eyes\nNow tell me the things\nYou blabbing about behind my back\nThe tenacity\nI hold it's hard to break down\nIt's too late for apologies\nIt's going down now.\n\nThis game and franchise is so good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you bear trough the first two chapters, it gets really good. Without that it is still a great gacha game that is f2p friendly(got everyone I wanted without spending) and it get's updated very often so you fon't have to wait.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a pretty tough thing, reviewing this game. I've sat on it for quite a while, and as many others have already said, if you take it for what it is, a CN mobile gacha game with a PC port, it's pretty good. \r\n\r\nIf that's the kind of thing you're into, then you will definitely find something for you here, and maybe even have a good time. Otherwise, sit tight, and patiently wait for Persona 6.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a fan of the persona series and gacha games, i really enjoy this game. For a gacha game it has a good story and a fun gameplay loop, however it may not be for you if you dislike the gacha system. The story is no where near as good as a mainline persona game, so if you are a persona fan who doesnt play gacha games youre not missing much. However, if you dont mind the gacha aspect, I would reccomend giving it a shot - if you have the storage for it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game for Persona fans that only want to play something different but also Persona game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its basically Persona game first, Gacha game second, and i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it, though not really a fan of gacha games so that lessens my enjoyment at times. Overall, good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Starting with what everyone would complain about or have trouble getting into- it being a gacha, for one, it's extremely generous, you get so many characters for free you really don't need to spend anything at all to clear all the content in the game, the story is amazing, just like you'd expect from any persona, it's not lacking in any of those aspects, it's definitely more of a daily grind than your typical persona but even then it's an amazing game by all means, ignoring the gacha this is easily the best persona 5 spin off ever, and there's a lot of them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a “gacha” game, which is free to play but charges real money to get in game items.  The things to buy are shortcuts for advancing your character’s many statistics, such as weapon strength, character level, persona level, revelation card level, etc.   There are also shortcuts to buy things that increase your odds of getting a character you want.   You’re guaranteed to get a “5-star” item within 80 pulls, but often you end up with a character you already have, and not the character you really want.\r\n\r\nI’ve resisted the siren call of these shortcuts and despite this, I’ve made it pretty far in the game.  In fact, I’m all caught up on the story and am just waiting for the publisher to release the next chapter.  My main party is leveled up, but the more ancillary characters are not.  It would be nice to upgrade everyone and everything quickly, but I’m content with proceeding at a slower pace without spending any money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First things first, yes the first Palace/Dungeon is pretty mediocre story wise because it tries to be P5 way too much but later on the story really picks up and (kind of) sets itself apart from P5, but at the end of the day it's pretty much more Persona but on your phone, it's pretty f2p friendly imho, I have yet to spend money on the game and have a pretty good amount of 5 star characters and I haven't played the game all that much compared to other gacha games.\n\nOverall, it's really fun and I even dare say, it's pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lufel shut up.\nNot the best game but it's not the worst too.\nWish the cutscenes looked more better and some animations\nWould I say play this game? do whatever you want.\nGIVE ME MORE TIME TO SPEND WITH CONFIDANTS 5 ISN'T ENOUGH",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is fun, challenging and requires strategy. Story has gotten much better now since third palace. Almost every content can be cleared without having to pull the newest limited characters. This game has no PvP, just leaderboards with slightly better rewards if you rank higher. Dupes and weapons are generally not required, just pulling a single copy of a character is enough. Guaranteed banner was implemented a few patch earlier than in CN servers. In terms of artstyle, music and vibes, this game is a faithful adaptation of the original Persona 5 game. Recommended for any Persona 5 fan who wants more Persona 5 content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm giving a thumbs up only because of the legacy of persona 5 royal, otherwise this game is a dogshit waste of time except for its soundtrack",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "3/5 (Good if you like the genre)\nOther comments are true.\n5 star characters can be obtained without paying, but time investment is required.\nFOMO is pretty bad for events, even if 5 star characters do return in 6 months.\nAt time of review, 1st palace does suck, 2nd is OK, 3rd is pretty good.\nUltimately, it's a good complement to Persona 5 (Royal).\n\nDO NOT PLAY WITHOUT PLAYING PERSONA 5 FIRST. It can (and will) give you a bad expectation of the masterpiece that Persona 5 actually is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game for what it is, a free to play gacha game. The original music is fantastic, the story gets a lot better after the first palace, the gameplay loop is fun and the devs are some of the most generous gacha game devs i can think of. It's n ot perfect, in particular the 6 month wait for standard banner units, and it had a pretty bad launch, but i would say they turned it around for the most part.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As long as you don't go in expecting the amazing story quality of a mainline Persona game, you are in for a good time imo, the gacha elements are there and unfortunately get harder to ignore with some pretty blatant brick walls of difficulty, but I have managed to stay (mostly) ftp and have fun, I did open my wallet to get Futaba since she is by far the best support in the game (and will be for awhile), but I felt like the game had earned it since I enjoyed it so much so frequently.\nOverall I would say that it's a fun and mostly casual Persona experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun visual delight great soundtrack, a game any persona 5/R players can easily get into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it deserves best soundtrack award for the steam 2025 awards, theres no competition",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game introduced the best written villain in the entirety of the franchise that is known as the \"Subway Slammer\" so credit where credit is due.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] Good game that has improved significantly since launch. If you played it at launch I would recommend you maybe give it a second chance. [/h1]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first I saw this as another spinoff to eat up time until P6 came out. Although now it is P4R. \r\n\r\nGame is pretty fun, took me a few days to figure everything out though when I installed it when it shortly came out to global. If you've played P5R the first two palaces and their stories might seem alright. But now, things are actually kicking off in the 3rd one even though as of writing this, we're waiting for part 3 to release so we can actually finish it. The game is generous compared to other Gasha games (at least from what I have heard from others when they started to give out more stuff from feedback when they launched it) \r\n\r\nOnly things I don't like is there being a turn limit. So even if I am facing a tough enemy and prepared and they are just getting lucky or something I cannot just try and outlast the fight like in other Persona games. \r\n\r\nSo if I take too long in a fight I automatically lose and the party retreats. That is the only thing I don't like. It isn't an issue most of the time, it really only is for bosses. Especially in the 3rd palace's fight where, despite everyone in my party at max level I still lost. So I had to swap them out for more damage and pray I didn't get caught near the limit again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like that it really feels like a full fledged persona game and the story is getting better and better. New PT are also good. And it actually made me care about velvet trials....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game has done alot to change my opinion on it and i feel it is a game worth playing now. more f2p friendly than alot of gachas after the changes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is it a good Persona game? No. Is it a decent free game you can use as a gateway drug to actual good Persona games? Absolutely.\n\nStill needs polishing in terms of animations. LIke a lot of it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First and foremost, you need to know what you're getting into. This is a gacha game full of all of the normal gacha tropes. It also does not have the story quality of Persona 5 or Persona 5: Royal. However, if you're a casual fan of Persona 5 and you manage to get a bit lucky, this can be a very fun game.\n\nI am completely Free-to-play and have gotten every single thing I've wanted with very little trouble. The pace is accelerated and the monetization is more aggressive in the global version, but it is very possible to go fully free-to-play.\n\nThere's just about everything that you'd expect from Persona 5 available here. Confidants, relationships, social activities, plenty of persona for the MC to use, palaces, dungeons, etc.\n\nI've had a lot of fun with this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Persona5 The Phantom X is a fun gacha game that's very F2P friendly that's fun to play. it captures the feel of a modern persona game for mobile well it does have some issues here and there(which probably is worse due to my very outdated pc) it's nothing that ruins the enjoyment of the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game feels very much so like a proper addition to the series' mainline games. It has good original characters, a solid story (even though it feels a bit lackluster compared to other mainline titles) and could serve as a decent free-to-play introduction for people who are curious about the series but not to the point of spending money to find out; that is if the person has a good tolerance for gacha and microtransactions, but if they are like me who like their gachas, they (maybe) won't be disappointed since the game is generous enough with multiple character selectors and a pity system just like other gachas and all Hoyoverse games to the point that it's perfectly feasible to be free-to-play and still consistenly getting almost every featured new character from the banners.\r\nAs I said, it feels like a proper addition to the series, but it does utilize a lot (and I mean a LOT) of aspects and gameplay mechanics from the original Persona 5. It literally features the same in-game locations, with the exception being the main characters' school and maybe a few new locations like the beach (which was only available during the summer event). Aside from that, if you're a fan of Persona 5, it is neat to see that world and familiar locations through the eyes of an entirely new cast of main characters.\r\nThat being said, I am very biased due to Persona being my favorite video game series by far; so take my review with maybe a few pounds of salt.\r\n\r\nTL;DR: Too much Persona 5 is pretty much welcome in my book; good characters and story; generous enough rewards and gacha mechanics so you can pretty much ignore it and focus on the main story if you like; a great free way to try the series if you're new to it and finding out if you want to play the other games or not.\r\n\r\nAlso, good waifus if you're into that and Yumi is best girl",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a Persona fan it is certainly enjoyable but there is a lot of frustrating things as well, for starters id say play through the actual launcher as steam randomly decides to not open the launcher which then breaks the game, Audio/Music can vanish randomly as well. Honestly id probably keep a negative review if I didn't love persona.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Persona 5 Royal is a finished artistic masterpiece.\nPersona 5 The Phantom X is Persona 5 Royal's free demo with optional donations to devs:\n- Quick daily missions\n- Stamina system for short auto battle sessions\n- Touchscreen-friendly UI (30GB for phone)\n\nMany people criticize it as a monetization engine, similar to Genshin Impact and Infinity Nikki.\n\nAccording to Reddit, it costs $1k-$2k to get 7 copies of a 5★ character.\nThe Platinum Pass is $14.99, giving you 10 Platinum Tickets + other goodies.\nThe Monthly Platinum Set (for more Platinum Tickets) is $32.99.\n\nThe game can be played free, if you do 15-30 minutes daily missions and endless grinding, while ignoring all the in-game pressure systems push players toward spending (or gambling).\n\nThe real product for sale is not the actual game, but to fulfill your desire, completionism, fear of missing out, attachment to characters and nostalgia for Persona 5. \n\nIt gives Persona fans the “taste” of Persona 5 Royal:\nSame visual style / aesthetic (UI, animations, background music, the vibe)\nSame combat feel (turn-based, weakness-exploiting, 1-more style combat)\nSame Metaverse concept (general tone, structure and feel)\nSame story structure (metaverse corruption → target → dungeon → change of heart loop)\nSame Phantom Thief fantasy (a small group of friends' school life, social interactions and bonding)\n\nYet it's nothing compared to Persona 5 Royal:\nNarrative - weaker depth\nStory and characters - less emotional and storytelling\nWeekly events with rotating FOMO banners\nDaily mission meaning more grinding\nPaid bundles with regional reward differences\n\nFrom business perspective, this makes perfect sense.\nFans love the Art style, Character, Story, Combat system of the Persona 3 → 5 Royal. \nWith 27 million+ copies sold, tht's a ready-made audience that is highly likely to engage with anything Persona-related. \nPlus Persona 5 is a strong brand, so even casual players or mobile players who never played it before can quickly recognize the title - additional potential player base - the leverage is massive. \nSo why not pouring money into a cash cow like this one, dear investors?\nThis game can reach millions of phone users, and those who never tried Persona PC games but interested to get a feel of it for free.\nPay as you wish later on...slowly drain your wallets. \nWhat a brilliant idea!\n\np.s. no achievements, no trading cards, no point shop items. \nmain story 15 hours\nmain + extra 90+ hours",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game keeps getting better and better after each update",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "amazing free Persona game as a fan of P5 and P5R highly reccomend if you like persona or turn based RPG.\nStarted on P5 so other than the gaacha i have no issues",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The story is interesting so far, hate the fact all the characters are locked behind gacha, grinding materials and pulls aren’t that bad though",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Persona 5 X is a game that leaves me hesitant to say anything good or bad about it. Everything I dislike is undercut by a concept I'm genuinely compelled by. I really wish it wasn't a gacha game, as it kills a lot of my motivation--which sucks, because this story does seem like its building to something fascinating.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can’t go wrong with this game! F2P games usually have some gimmick that practically forces players to spend $$$ with a small chance of satisfaction. ie) 9 out of 10 times results will lead to utter frustration! P5: Phantom X actually caught me by surprise!\nAs a longtime Persona activist I didn’t expect the amount of work the story makers invested into this title. Rather than a rehash of P5 (Royal), they (re)placed new characters into a similar universe; or perhaps replaced them? The original P5 characters are available, but are mainly used in one of the side stories; an actual rehash of P5. \nThe main story can be its own title if it wasn’t for the F2P limitations (like requiring monthly updates for an ongoing storyline). This is only a slight downside as continuous changes are applied in an ever-evolving landscape.\nComparing this title to other F2P games wouldn’t be fair, but if we can make P5X the benchmark for similar games, the world would be a better place! There aren’t limitations or other gimmicks that will ‘force’ users to spend cash to get a leg-up on others. No real time-limits preventing users from progressing further, without spending more money. As a first, spending money in a F2P game has actually been enjoyable. Not having the immediate regret-post-transaction feelings still feels odd!?! Good, but odd!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They... kinda turned it around?\n\nDon't get me wrong, this game was a laughing stock on release. The story was mindboggingly stupid, with both villains and the cast showing some insane stupidity (especially the second chapter), the gacha was kind of subpar and risky and the events... uh, madarame palace platforming i'd rather forget was ever a thing.\nHowever, for chapter 3 onwards they replaced the writer with one from one small title called Persona 5 Royal and the quality and depth are a lot better. They've introduced a guaranteed banner option for 110 pulls (a lot, but also a lot safer than the 80) and there's actually some reason to stick to it for longer than <1h to do daily stuff, multiplayer Tycoon with ranked ladder is such a blast (and i will [insert some bad word here] whoever uses 3 of spades without any jokers played personally).\n\nIt's not perfect by any means. there's still a lot missing for me to call this a good game, and even more to call it a great one, there are some odd loading issues sometimes and there's 1 track in the music club minigame that is chopped so attrociously it literally skips a beat (maybe it was fixed idk) which is kind of inexcusable, but it has severely improved and i have to respect that part at least.\n\nIf nothing else, we got Last Strike out of this game. That's a net positive for the entire world. Listen to this track, it's wonderful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i think the first palace couldve been better, its decent for being a free gacha game i think",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "as a persona fan. this has been a lot of fun. ftp friendly. great cast of characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Persona5: The Phantom X is what happens when Atlus looked at Persona 5 and said:\n“Yup, we can absolutely turn this into a mobile game that devours your free time *and* your willpower.”\n\nYou’re a new Phantom Thief (canon name Nagisa / Wonder) with a talking owl roommate, still going to school by day and committing stylish metaphysical crimes by night… except now your greatest enemy isn’t a god, it’s the **energy system**.\n\n---\n\n### Pros:\n\n* It’s literally Persona 5 again, but on PC & mobile and somehow still stupidly stylish: bold UI, banger music, turn-based combat with “1 More” and All-Out Attacks.\n* Full social-sim + dungeon crawl combo: hang out in Tokyo, raise stats, bond with people, then dive into Mementos and Palaces in the Metaverse to beat up their trauma.\n* Gacha lets you pull cognitive versions of confidants as units. Truly the most efficient way to turn friendship into DPS.\n* Wonder + Lufel (owl buddy) are actually likable, and the new cast feels like someone asked, “What if we made another Phantom Thieves but with extra drip?”\n* It’s free-to-play, and early on the game yeets so many rewards at you that you start thinking, “Maybe gacha isn’t so bad actually” (this is a trap).\n\n---\n\n### Cons:\n\n* No calendar system—your life is now ruled by **stamina bars**. Want to study OR grind a dungeon? Pick one, line up behind the energy timer like it’s a grocery store.\n* Party is strong, story is solid, but you will occasionally remember this is technically a phone game when 17 menus pop up asking you to collect mail, rewards, points, and your dignity.\n* Some bosses are emotionally impactful, others are “Subway Slammer” levels of meme villainy, making it hard to stay serious when a guy basically yells “The whole train is mine for slammin’!”\n* Auto-battle exists, so you’ll catch yourself letting the game play itself while you just sit there like a manager on salary.\n\n---\n\n### Peak Phantom X Moments:\n\n* Boot game “just to grab login rewards,” emerge 2 hours later having cleared 3 floors of Mementos, 10 side quests, and exactly 0 real-life responsibilities.\n* Burning through all your stamina on grinding, then realizing you still haven’t progressed the actual story and Wonder is still failing school.\n* Landing your 10-pull: nine dudes you don’t care about and one insanely cracked unit that now defines your whole personality.\n* Reading a long, emotional Velvet Room monologue… while also mentally calculating if you’ll have enough energy left to farm materials after.\n\n---\n\n9/10\nIt’s genuinely a fun, full-fat Persona spin-off hiding inside a gacha wrapper.\nSold my free time to an owl and a stamina bar—would log in for “just the dailies” and accidentally no-life it again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's very fun to play, I enjoy the grinding because it makes you interact with the features of the game to get more experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I HAVE SPENT 300 HOURS IN THIS DOGSHIT GAME SO FAR AND I FUCKING LOVE IT. \n\nThough, my one criticism: Please change the the pull rates for 5* weapons and make it 80 pulls. Please. 40 should be 50/50 and 80 is guaranteed. We don't get enough platinum coins to justify the pulls and I am not using my gems for my weapons when I need so many of them to guarantee pull for characters, too.\n\nThank you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Waifus,gacha and its persona not that bad except when you pull all your luck and you dont get what you want",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a pretty big fan of Persona I have been enjoying my time with this game a lot. Probably have an extra 40 hours on my phone too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is funny owl in here, you can also have a harem without any consequences.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Why is one of the enemies a giant d*ck, not figuravely, a literal d*ck, he is so large he has chariot to hold his shaft up.  Still peak tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you like Persona 5?  Then you will like this.  If it does not hook you right away try to give it till the third palace.  Story improves so much over the first palace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "please stop bringing back queen and yui i am an og haver it isnt fair",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its like Persona 5, but you can choose to spend money on it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than i thought it'd be tbh, graphics are pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly not bad, but indeed a grindy gacha.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game gave me aids and a meth addiction, pls send help",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it is fun and a persona game for free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They did it, they made a good gacha game out of Persona.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend it if you're up to giving gacha games a chance to prove they can be good. Otherwise don't bother \"\"\"\"wasting your time\"\"\"\". (Coming from a person that still hate most gacha games nowadays)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peek game W Sega W Atlus (I hope I`ll play this game on my computer outside of phone)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Uma experiência boa para um jogo como serviço.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better and more addictive than fentanyl.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good game yes but gacha sucks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really similar to p5 so its kinda boring but still persona",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good gacha game for spinoff of Persona 5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They added Tycoon with online multiplayer, its so peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun story set in an adjacent? timeline to Persona 5, even if you have to wait a while between each new story chunk. It's definitely built more for people who either invest a lot of time and/or money into it, but I can imagine someone playing casually can experience the main story at their own pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't played this that much since juggling around 4 different gacha games is time-consuming. However, I still believe this is a good game. If you enjoyed the persona games and want to explore more of the persona world while meeting characters from previous titles, this game is just for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak! i love the characters and everything about this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chapter 3 will get you invested if the first two didn't, it definitely did for me. Generous gacha system in my opinion even before the backlash and changes, though yes the rewards compared to the Chinese version at the time were subpar, to me it seems we've gotten to the point that we may have it better than them, with character outfits purchasable with free gems as an example. The story can be played without any gacha system required anyways. I play on mobile as my PC isn't the best for running these games and I have unlocked every character. \n\nI actually hope Persona 6 takes some inspiration from P5X's combat, the weakness shields on tougher enemies are great and ailments aren't annoying, busted, or useless. Characters and music are all great (though most music is just from P5), main cast is especially likable so far. Though i'm really hoping for perhaps a female protagonist option and/or dateable males, having dateable characters may actually attract new people to the franchise with other popular gachas not really having full on relationships, but limiting it to the female confidants could also turn them away (but this is persona so i wouldn't be surprised if this doesn't happen). As of now this game is hard to recommend to non persona fans but if you are, this game really can be your PQ3, and potentially one of the best Persona games ever. Its free so just give it a try. \n\nConsole version and SMT/Metaphor collab PLEASE!",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "I fully completed the first 2 arcs, 100%'d them and almost all side content released alongside them, in effect, having played more P5X than most P5X fans, I can tell you, without a doubt, this game is fucking terrible and by far the worst writing in an Atlus game, maybe the worst written game by a major developer I've ever played. Fuck this shit, but I guess gambling can be kind of fun and they give you 1 fun boss fight every 5 so that's gotta be worth something. Just don't expect to be playing a videogame that was made for anything other than stealing your time so you can get epic waifu #67. Every bit of gameplay is built around the gem economy so they can sell gambling to teenagers.",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "First, I've played this game much more than the 51 hours on record because I played on both Steam and my phone. The game isn't bad, but it is pretty mindless which is what some people look for anyways. I would dutifully do my dailies each day and had a pretty stacked account for a FTP. The game gave a lot of gems without purchase if you had time to do all the events. I had just gotten my first top 20% in the companio boss battles while FTP.\n\nMy issue and why I positively cannot recommend this game is: all my data was lost. I linked my account to Steam and thought it would stay linked. I didn't always play on Steam, mainly doing the dailies on my phone. While I had my phone I never had an issue logging into Steam and never had to re-type my linked account ID. Of course, this is the part of the story where my phone gets stolen. Miraculously, the same day I am now unable to log in through Steam after an update. The saved linked account ID is now missing and I cannot get it back. So much of my time was completely wasted and I would never be able to get back to where I was with my units even if I restarted.\n\nI decided to abandon the game because it abandoned me. Not a real problem for ATLUS because I was FTP anyways, but still was a real kick in the balls.\n\n*edit* A friend helped me find the user ID if you have logged on through Steam successfully. In file explorer search %localappdata%low\\SEGA\\p5x_en\\\nOpen the log from your last successful log in and search for userId: which will show you the linked account ID you need to log back in.\n\nI am still leaving my review as negative since it is ridiculous and broken that Steam will \"forget\" the ID and SEGA is no help to retrieve it.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "It´s actually a pretty fun Persona game, but unfortunatelly suffers from the usual f2p time gate or pay jank plus gacha.\nStory is pretty fun and the gameplay is good, but i just can ´t be bothered to play a few minutes for over a month just to outgacha the current boss im forced to be stuck at. (and they are pretty broken to be honest)",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Persona 5 for poor people. Or rich people? I don't know, game's story feels like bootleg persona 5, game's gameplay feels like bootleg persona 5. Pay 60$ for a real persona game and you will have to spend less money for a way better experience. This being on steam is pathetic. On your phone, sure have fun gambling on a bootleg persona game. It's not even a good gacha game. The gameplay feels pretty mid. And the characters never feel unique. Just don't play this game. It's literally like a different company wanted to make a persona game, so they basically recreated persona 5 with different offbrand characters and then atlus actually decided they could milk it so they made it official and put real persona 5 characters in as gacha.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Persona 5 X is a game I was looking forward to since it's original announcement. I've been holding my tongue waiting to see how the game would pan out before giving my thoughts positive or negative, but I think I'm ready now after this third palace has been completed.\r\n\r\nFor context, I'm a huge fan of ATLUS titles like SMT, Metaphor and of course Persona. I've played several titles across their catalog and always look forward to the next. \r\n\r\nStory - The first palace of the game while poorly written I had no issues excusing because it was so bad I ended up laughing and enjoying myself the entire way through. The villain is ridiculous both in and outside of the metaverse which is different to the original P5 as the metaverse was where their worst traits would go out of control. The second palace unfortunately has no redeeming qualities and I felt quite bored going through it. The third palace was a triumphant comeback with a new writer who I believe wrote the third semester of P5R. If that's true you can tell in how that palace was structured. I loved the narrative and ended up really getting into the focal character of the arc. However, while this third palace was enjoyable, it's not worth going through the first 2 palaces. It's a slog to read and even worse to play.\r\n\r\nGameplay - I was constantly told this game is \"just like Persona\", but I fail to see the similarities outside of name and presentation. To me, the core beauty of Persona is that things end. You're not going to get all your social links maxed or social stats maxed. Everyone's calendar year is different sparking awesome conversations with different people to see who did what or what you missed out on. I'm probably just naive in thinking that a gacha live service game could adapt this concept. The calendar system in P5X is irrelevant as you will max everything out in time therefore there is no sense of preparation and planning your days or weeks. 99% of game time is just burning your stamina for resources in hopes of better stats or character level up materials. The actual turn based combat itself is fine, but feels like a chore to go through as the majority of fights are brain dead mobs and then bosses with a gimmick built to stall time instead of feeling like a real puzzle to solve. The palaces themselves are incredibly long and arduous constantly testing your patience with uninteresting puzzle design, weak mobs and the aforementioned gimmick bosses. \r\n\r\nOverall - It doesn't feel good to leave a negative review especially for a franchise I love so near and dear to my heart, but Persona 5 The Phantom X is a poor representation of what this series is. Yes, it's free, but you'd be doing yourself a favor and just saving $20 to buy Persona 5 Royal on a sale instead.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "it feels insulting with how little the game wants you to use your brain. every mission is incessant with not letting you make decisions or do anything. every 5 meters is a giant quest marker showing where you need to go. you are not allowed to think. you are not allowed to make decisions. you are not allowed to use your brain whatsoever. it is nicely stylized but jesus let me do things on my own without holding my hand through the entire thing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is gacha slop. ITS NOT EVEN A GOOD TURN BASED GAME???? i used to enjoy it a whole bunch the first week or so since it came out, then it started getting boring. i love gacha games wholeheartedly, thats why i play so many, but p5x just ruins the genre of it for me?? maybe it's because i feel like a gacha game ruins persona and is completely unnecessary, i don't know. all i know is that is game sucks ASS and doesn't deserve to be nominated for the best mobile game BECAUSE ITS SO FUCKING DOGSHIT ITS UNBELIEVABLE HOW DID THIS BUTTASS GAME GET NOMINATED FOR BEST MOBILE GAME???????",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Been enjoying the game & all it's content thus far. It's a fairly fun time. Although, something that's not fun is the higher-ups decision not to reduce the jail time of standard characters down from 6 months.\n\nThis game does have a standard banner, although any new characters released that are planned for standard must first go through a few weeks where you can pull for premium currency only. Then (unless there's a random re-run) you have to wait 6 months to be able to pull with standard currency. \n\nThis is a bad thing for everyone:\nWhales: Will spend all their life savings on all characters regardless, so it doesn't matter for SEGA.\nSpenders: Might choose to pull in the first week, but not go for awareness. They now must wait 6 months to pull. They won't bother with awarenesses while premium currency is involved.\nF2P: Just won't pull at all for 6 months at all. \n\nLiterally nothing would change here, even if the time period was reduced to 2 months or something. Anyone who really needs the character so bad will have spent... So why annoy the entire playerbase for a supposed monetary gain that's never going to come? Reduce the prison time and make everyone happy. \n\nI won't be changing this review score until this issue is actually properly addressed by the team.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Most items in the shop are not very good value for their cost. The gameplay is okay; it's turn-based and very P5. So if you like P5, then it's definitely worth playing; however, it will take months to get through the whole game, as main story progress is locked behind account level. with large multi-week gaps. until you get to the max account level, in which case you can rush all the remaining palaces after 3, which sucks because you have to grind for a long time very slowly before all the content opens up, which makes the game feel not worth playing unless you're already committed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is trying too hard to make you purchase to make any significant progress in the game, the gatcha elements are hampering the game.\r\nThe standard 4* characters you unlock are mostly underwhelming, while the 5 stars are purposely going to be the hardest to gather to max level.      The actual Palaces in this game are not designed well.   They're level cap controlled to advance half of the time, and they focus far too much on their gimmicks.    The 2nd palace got old in a hurry with all the cameras you needed to activate a door, or resize a block to progress.  They're not so much puzzles, as they are busy work.   And for as large as the palaces are, it's not like you can actually level up in them like you could in P5 as you survived encounters.\r\nThere are times some of the story writing brings back elements of a Persona game, but most of them are alternate universe clones to the original P5 cast, and usually not for the better.\r\nIf you do the daily quests, you are only really going to be able to focus on getting one thing leveled for one of your thieves daily.   Due to limited stamina,  the stats leveling also goes at a painfully slow crawl since you only get 5 city life points per day.  Want to level up your social links?  Hope you have the patience to level your charm, intelligence, guts, and the others to level 17 so your social links can hit 20 and finish collecting their treasures.   The design is clearly trying to make you  buy progress and spend as much money as possible.   \r\nThe release of content is SLOW,  you'll hit the cut off point for the main story, and then wait months before they release a new segment, so there's lots of times you log in and have nothing to do, unless you're slowly trying to level your thieves, weapons, tarot cards, skills ect.  It feels like they tried putting the FU in fun, but not in a witty way.  And a bored player that has nothing to do after checking in will want to leave the game quicker and not return.\r\n\r\nAlso, the leveling system doesn't feel balanced.   You cap out at level 80, before gaining bonus levels for stat points.   But even by the 3rd palace, you're already required to have your team be close to level 80 across the board if you want to take on the boss.   Even in the first palace when you're low level, you'd be exploring at level 10.  and then a door you need to open to go further has a level 22 guarding it.    Guess how you'll be spending the next week playing?  Grinding just so you can take on that boss.  \r\nThis game had a lot of potential to be great, it plays very closely to P5 other than the limited weakness baton pass,  the maps of the towns, the soundtrack were positives.    It looks great on PC, and you can log in from a mobile phone if you link your email account.   But you'll find yourself annoyed and hamstrung regularly because the game is just trying to see how fast you can part with your money.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Utter doo doo. As someone who is a huge fan of Atlas games with the Persona series being one of my top 10 of all time, I could not be more disappointed in what this company has sunken to. I'm not someone who is against the freemium model however the content in this game is so weak that I would completely believe that a new amateur company made it and stamped Atlus' name on it. Weak story, typical battle mechanics but nothing exciting there, the simulator part (like the school sims in P3, 4 and 5) of it just feels removed from the game entirely even though they made a poor attempt at doing it. I was really looking forward to the next Persona game but this just isn't it. I have such a bad taste in my mouth that I'm not sure I trust them in the future with new games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its not that good, i expected it to be like a persona game\r\nthey take a dump on joker in the first minutes of the game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "As a F2P player, I've been enjoying the story but the gameplay is a bit lackluster. You definitely reach a point where you're walled off and encouraged to spend money. I personally think that the pricing in this game is egregious, and that's why I will no longer be playing this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A gacha game filled with greed and bad decisions not worth investing time in to.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its just kinda persona 5 if it was mediocre, i dont really enjoy the gameplay. i think the gacha part of the game is fine, but the gameplay just feels like really clunky persona 5 gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is a persona game with gacha built into it. It's fully possible to play it FTP, you'll never be the top of the leaderboards. It's more a play a little bit every day with a bigger content drop every couple weeks.\n\nThe main complaint with it that I and many others have is the 6 month jail that standard characters are place in after their initial banner. This is not present in the Asian versions that released before the global version did and becomes more rediculous seeing as they going at a faster pacing to close the gap between the versions which means at some point it becomes just an inferior game. This is what earns it a negative rating from me until they reverse course on this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think this game is very nice in terms of vibe, quality and story. Captures the p5 vibe but feels a lil more clean and sophisticated, which i like. The story so far is also really good and in true persona fashion, you bond with the characters and are immersed into the world / dialogue / sound. \r\n\r\nHowever, The gacha and boss system are really bad. The gacha has no soft pity and low drop rates. I could live with that as i play more for the story, but the boss fights are truly impossible and you neeeeeeeeed to get meta characters to progress. I was already struggling with the 2nd palace boss but somehow beat it after many tries (and getting a full five star team). With the 3rd palace boss now, i am just stuck again and there is no easy mode like in other games. I read somewhere that on the asia server, the battle automatically lowers difficulty when you loose, but for global that is not the case. This is really frustrating and i basically stuck. I try to grind and beat the boss but it just does not work. I use Joker(with his sig weapon), Marian and Chord. I still can't beat the palace boss since i keep running out of moves. \r\n\r\nIf you are able to spend the cash on it, i think ypu can check out the game, but if you are a regular mortal being like me with bills and stuff to pay, then its a nono. If you cant spend the money dont even start because you'll get invested in the story and then are basically soft locked because you cant make it past bosses. I really wanna know how it continues and i hope they will add the easy mode for boss fights when you loose, but until then, don't get this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you go into this game thinking it's similar to P5 or P5R it is not. It's honestly a little choppy with the gameplay and the story doesn't make up for it. I gave it a good try but I couldn't get into whatever was happening. It's more like a short side story that maybe shouldn't have happened because it doesn't make sense really. The graphics are of course amazing, and the story is really trying but it isn't enough for me personally. It just seems like a cash grab at this point.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only play this game if you have no regards for your own time, and if you really like persona 5, but not enough to hate what this game is",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Classic gacha issue of being fun to get started with but immediately becomes a chore once you need to farm gear, unfortunately good designs and narrative cannot make it for that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately a very fun game PLAGUED by greed when compared to the other locations versions. Their refusal to try and adjust anything make this whole \"best mobile game of 2025\" kind of a joke. Not spending another cent on this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is god awful. I'm sure it gets better later on but the first palace is just okay. The gacha elements ruin all fun or reason you would like this as a persona game. The gacha stuff ruins all sense of acomplhishment, impact and fun that a persona game usually gives you, the only reason you would like this if you're so brainrotted you just want a better Honkai Starrail which is god awful in its own right. I really wanted to enjoy this game but I have no motivation it is just so annoying to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Decent game but Sega is still nickel and diming global players. Remove 6 month standard banner jail.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's not too terrible. However, it feels very lackluster. Like I get why some people like it, but it's not for me. The story feels kind of bland, the gameplay isn't my favorite, there's a lot of gacha mechanics, not really enjoyable for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Huge fan of persona 3 reload, 4, 5, and metaphor. I've been following this game since before release and was super psyched to play. What a shame. This game has nostalgia, beautiful character models, phenomenal music, and the fighting feels like a persona game. However, the story feels like a copy-paste of persona 5, the UI is filled with insane spam of gatcha ads, and theres no English voice acting. I even pushed passed all of this to enjoy the game but the part that I can't bring myself to ignore any longer is optimization. The loading times are insanely slow, the game lags at every turn, and the leveling just doesn't feel satisfying. Whatever, its a free mobile game so I can't complain too much, but I refuse to play it in its current state.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's more Persona, which I am all for. But the story is nothing to phone home about. The combat is the usual persona gameplay. But they added way too many mechanics in both combat and turning characters while adding in redundant mechanics and taking out other things that make persona building worthwhile in favor of gacha mechanics. \nI will say that the average day-to-day gameplay (talking with companions, etc.) is a much better improvement as I prefer not having a time limit to get things done. \nBut the biggest issue I have with this game is the levelling system. If you aren't at least at the recommended level for a dungeon, and more specifically a boss, you are not winning and are hard-locked until you level up and then some. I'm currently on the second dungeon's boss and he is pretty much unbeatable until I can find some way to make my team stronger.\nAll in all, if you're a Persona fan, I recommend trying it out and see if it's something you like. But understand that the game will hard-lock you until you put in the time to level up your characters. If you're not a Persona fan, there's probably something to play... Like an actual Persona game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Obligatory thumbs down. Decent gacha game, terrible Persona game.\nI enjoy the game on autoplay on the side but felt like writing this because I read a lot of positive reviews saying that if you disregard the gacha, this is essentially a Persona game.\nThey're right it is. It is the absolut worst possible instance of a Persona game imaginable.\nComparing this to the OG Persona 5 is like 2 instances of a really good meal like Lasagna, but one was made by grandma with love and is so good it makes you flashback into your childhood reliving the sweet colorful taste of a better time like that one ratatouille scene or some shit.\nThe other is a half rotten left over found in a dumpster in someones back yard that someone would only ever resort to, when despite not actually needing sustenance, they're just addicted to the idea of the taste and drop to the lowest lows to receive some tiny amounts of the funny brain chemicals.\nKnowing the gacha audience you probably know which one of these 2 this game is.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "predatory pricing\r\n\r\ngood gacha games to play:\r\n- Nikke Goddess of Victory\r\n- Azur Lane \r\n- Arknights",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Constantly given less rewards on the Global server, unacceptable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I wasn't thinking about writing a review for this game, but (for the sake of this year's Nomination Awards) here we go.\n\nLong story short (mini-review):\nA cash grab second Persona 5 with multiple beautiful Shigenori Soejima character designs but it all falls flat because it is just another Persona 5 that is never finished (since it’s a gacha).\n\nI am embarrassed on their behalf. Atlus was not the company to do something like this. \nReally, I feel bad for the character designs that have to be used for something like this.\nI mean, look at all that style being wasted! But this is the first time they all feel so lifeless thanks to this game being a gacha game and almost an exact copy of an already existing full fledged game. It's a Temu Persona 5.\n\nNow I just made myself sad (also no wonder the overall opinions on this game are so mixed). It would be cool if it was not an exact copy of an already existing game. And this one. Never. Ends!\n*raqe quits from review* *stealthily like a Phantom Thief*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I spent hoursssssss downloading and installing stuff and this is what i imagine Persona 5 Lite would be if Persona 5 came out on the app store in like 2012. grinds to a halt every three minutes to beg you for money. the characters r cool i guess but this is a waste of your time and probably money if you've already played persona 5. unless youre one of those SICKOS...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lazy sloppy cheap gameplay with brainless palaces and stupid level requirements",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "GOTY nomination?... what a joke! - Grindy time gated progression ruins the story flow!\nI came back for chapter 2 and was time-gated to put another 15 hours into the game to \"level up\" my account before I could even start it. Got one-shot with my dolphin account, so decided to put another 5 hours into it and level everyone 10 more levels with their best-in-slot weapons along with them. Still get one-shot. The game wants me to put another 20 hours into it because it's the only way they can keep you logging in since there's not much outside of the story... it's just not worth it!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have more play time on the phone, the game is worse in every way compared to the chinese version(they changed a few things for the worse), the banners are happening way too quickly which is very unfriendly to f2p.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Entire game is just a cash grab literally avoid this shit like the plague plain and simple",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I played with one hand for 20 minutes, fell asleep for nearly 8 hours, played another hour or so with the other hand and honestly, I want to sleep again.\nAnimation is great, pity it's not actually a game, it's a bad anime with the illusion of choice.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its been a two months of free playing, first palace, I got through 100% in about a week.  I have now been stuck at the 2nd palace boss for 5 weeks because despite how much effort Ive placed into the advancement of personas, schema, etc he is far too difficult for a free player. It honestly appears to be a /frustrate you/ to buy things gateway battle",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Doesn't really feel like a persona game, just a cheap chinese knock-off with 500 pop-ups and screen pollution like hell, MC is bland and a complete twink/dork, he saw Ren and wanted to be like him and ended up being the Temu version but worse.\n\n3/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It was once easy to get into. But now? I wouldn´t recommend this to anyone. I´ll change it once the gacha rates for 5*s are better (Although much more would be required).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Totel fail for the global launch, but the music is atleast good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You get soft locked in the tutorial. It is impossible to progress past the tutorial. \nStill no soft pity after waiting since global launch. Even newer members have no idea that there is no soft pity.\nThe censorship is horrific in this game. I cannot even form a sentence in this game without told \"Inappropriate message\".\n\nI would highly recommend NEVER spending a single penny/cent in this game. Do not encourage the behaviour of these developers. If they want profit then they need to earn it with effort and a bit of love. They have shown nothing but greed and hate towards their player base within the global server",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just a lazy cash grab, don't bother, just play Persona 5 Royal. I was stuck downloading for hours. Every time i think it's done, it just goes to a new screen just to download MORE and MORE (happened more than once), honestly i was getting impatient but maybe that's just a me issue. (90% of my play time is downloading files) Once I finally got to the game, i was utterly disappointed. This game felt like a bootleg of Persona 5 royal. I do love the character designs, however the gameplay feels clunky and has slow inputs compared to other Persona games, it takes too long to click through dialogue. The Devs Reused cutscenes, assets and sounds/music from P5, makes it feel like the game was lazily made, just copied and pasted. I am aware it is a spin off of P5 and takes place in a AU, however the reused assets with no edits/barely ANY EDITS to it threw me off completely. At least P5 Strikers made an effort to make a small yet noticeable change in the music to make it feel different. As much as i loved the music from the OG P5, this game didn't feel original. And the lack of an English dub is insane to me when other games had one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "was peak at first... peaksona until the f2p grind wasn't enough, peak music tho...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Story is bad. Main character has no stake in what's going on.  The \"Subway Slammer\" is a nothing villain who would simply die with no friends and fade into obscurity without the party's intervention. It's weird having gacha-pulled characters with no story presence in your party. It's even more confusing when these gacha characters have a real name, phantom thief name, and a persona name bundled into one. \n\nMenus are confusing. I don't understand why gacha games need to have five different menus for free shit and eight for   missions to go on. This doesn't take into account of the real-world mechanics which don't make any sense to me in the gameplay loop. Considering the game is based of Persona which is known for it's stylish and efficient RPG menus it feels bad.\n\nGameplay and movement feels stiff. I understand it's a mobile game but when the feet of the character don't match the speed of which they are moving I feel like that is a huge oversight on a game series that is supposed to be known for it's presentation.\n\nUnfortunately the music bops and the visual art direction looks great. But everything else in P5X is in antithesis to the core themes of P5.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Story is so bad, combat in persona is just a mid stylized turn based RPG, story is supposed to be the focus, completely missed the point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "PLEASE ATLUS I NEED THIS, my game is kinda trash...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pulled futaba and uninstalled, worth",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, it’s just disappointing.\nThe story is a mess (at least for the first two palaces, I can’t say how it develops later, though I’ve heard a different writer takes over afterward).\nCombat feels off, the camera movements are strange, and after every action you have to wait for something to happen.\n\nMost of the characters feel like random creations with no real depth.\nIt is cool that you can still play as all the Persona 3 characters, I’ll give them that. It doesn’t make any sense from a story perspective, but I’ll let that slide.\n\nThe new songs are genuinely great, that’s one area they really nailed.\n\nThe game has a lot of potential, but I just can’t recommend it. You’re honestly better off playing any of the mainline entries, especially if you’re new to the series.\nThis one is at best for hardcore fans only.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this feels like an off brand persona game the combat don't even give player xp like every other persona game you get it through side quest and the game feels slow or just straight bs at times and i feel the story is kinda cool but like if im not doing anything else while playing it i feel ill",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this game at launch, but the optimization was so bad I couldn't continue playing. I uninstalled it to free up some space. Just reinstalled it to give it another chance, hoping that a few updates fixed the optimization. I had to go through what felt like 10 different updates before I could get back into the game, which took more than hour to get all the way through. All of that just to find out my progress was gone, not that I made much since my last session but it was still annoying.\n\nI played until I got a bit further than where I last left off, and even then the game still had multiple optimization issues at the lowest settings. Loading screens take a long while, game randomly freezes during cutscenes and battles, I feel like I'm playing at 10 frames a second, characters run up but then stop and stand still for a while before doing an attack, among the typical gacha / mobile predatory stuff. I'm sure I'd play this on a casual basis if it was somewhat enjoyable but because of all the issues I can't even enjoy it on a surface level.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am mixed about giving the game a good review due to many problems the steam version has. And well, some gameplay things.\n\nThe game itself...well, its P5 and Gacha. If you are well versed in those games, I dont have to tell what you will get.\nIts grind, its building characters and having the best team to beat shadows with sometimes weird obstacles in the fight. \nLike I am not a fan of the limited turns in the game. I would understand it if it were for difficult foes. But when the limitations are even in story boss fights, it just creates pressure. \nAnd that might be my opinion but I get pretty pissed after some tries and lose the motivation to play. And a Gacha Game, especially with intention the player hopefully invest into it, cannot really earn money if the players leave due to the lack of motivation. But that is a general point for gacha games, not limited on P5X.\n\nIf you ever have the chance to play - just dont play it over Steam. At least not the PC Version. For unknown reasons, I cannot login since the 13.11.25. I tried backing up the game, verifiying and updating...with the result that it doesnt do it really. From other comments I already know that SEGA gives a shit and will not help you getting back your account.\nMaybe for the better. The game runs poorly, already needs a lot of time to load all assets, even during gameplay.\nIt sometimes didnt recognize my controller, even changing inputs after cutscences...the list is long.\n\nI managed to get back into my account using my steamdeck, even when logging in was kind of an adventure.\nJust tried putting my account into the windows version over google play, but of course I cannot link my account.\nSo yeah, lets see how long I can play the game. If it even block me out there, then that was my time.\nAt least I cannot get mad if it happen again, havent invested any money yet.\n\nOn steamdeck, it runs so smooth. Fast download, fast installing, and gameplay itself runs faster and smoother than ever. \n\nEven if some gameplay things annoy me, the general gameplay is fun and I found the story pretty interesting.\n\n15 hours later, I couldnt even start the game on steamdeck. I could \"solve\" the problem with installing the game anew. Because repairing and anything else doesnt work. If I did understand it right, the cause might be the new update launcher. Nevertheless, I wasnt really thrilled about it.\nA friend of mine had a similar problem and it got \"solved\" by installing the game new.\nThe game runs again now smoothly. Lets see for how long now.\n\nAs much as the game started to make fun again on steamdeck - How aweful is the global version made that such minor things let people not log in, nor even starting the game? There might be solutions by motivated users in the discussions of the community. However, I dont really have the time, or the brain, to   whatever rearrangements I should need to do to my computer (or steamdeck) for letting a game run what should be the job from the ones publishing the game. \n\nThe Game can be fun if the game let you have it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Decade-old wisdom still applies: Go play a real Shin Megoomi Tensay game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Who ever made this greedy game needs their heart to be stolen by the Phantom Thieves!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just play Persona 5 instead. This is a gacha game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As much as I love Persona I couldn't get into this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good enough for a free Persona 5 with gambling In It.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Had the potential to be a great game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2 hours of download screens just to get to the start sceen",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Gacha slop, not worth your time or money, wait for Persona 4 Remake.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst mistake of my life, soft locked within 5 seconds of playing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Awful. It is a gacha game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disappointing to wait 4 years for this to come out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ill just go play real persona again this game aint it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Persona 5 but if i liked it even less",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Play my gacha game\" \"Ok Joker persona 5\" \"75gb and deletes your account after inactive for two months\" NO joker persona 5",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "This game is bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so pants",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sensory Overload: The Game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i wish this game was better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Awful money grab. Do not play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's so kino",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "subway slammer :(",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Waste of time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Doo Doo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont waste your timer",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "persona 5 star rail",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "music cool",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Give me more things to do for meta jewels",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yeah screw this I'm going back to the Taiwan version",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gatcha money HAHAHAHA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "malardo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kinda sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hot Ass",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "помойка",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gachaslop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gacha slop but p5 so m9eh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "don't",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "slop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "eh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cd'dd'd'.ff..df.f.f.f.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong, this is a fun game!\n\nBut the Steam version has a critical bug where your account can just suddenly cease to exist at complete random no matter what third-party accounts it was bound to. And support won't help you unless you have the most hidden piece of information - the Account ID. You can find it on the title screen in the \"user\" option and it's the 8-digit number.\n\nDon't be like me.\nScreenshot that number and keep it safe if you want a chance to get your account back.\n\nEdit: I did get a comment telling me to try logging in on mobile. To clarify, I tried to do so when the incident happened (in fact I actually STARTED the game on mobile and switched to Steam after the game damaged my phone screen, moving my data over) and the bound accounts still only linked to the new individual accounts.",
      "voted_up": false,
      "votes_helpful": 86
    },
    {
      "review": "It pains me to write this, but the game is just not good.\n\nI was really excited for this game, I had been following it since the early CN betas, and it looked pretty promising to me. The concept of a live service Persona game really excited me, but lately I'm realizing that it doesn't work.\n\nJust to clarify, this review is about the game itself, not the gacha system.\nI really don't care that much about the rewards, characters, rates, 110 banner or whatever; give me all the free gems/characters/weapons you want, but my opinion about the game won't change.\n\nSo I started playing the game when it came out, and at first I really liked it. Sure, the story was not very good and the combat system is a bit different than the usual Persona, but I found it fun. My first major problem with the game was that there were only two chapters of the main story, but the devs said they would release it faster in order to catch up with CN/KR. Also, since updates are every two weeks, I didn't give it much importance.\n\nThe second big issue is with the events, which are either\na) Revisiting P5 palaces (but worse because they're divided in stages)\nb) Doing your dailies and getting more rewards than the usual (but no gameplay)\nc) Repeating THE SAME battle like 8 times but with different conditions (that change close to nothing)\nSo the game started to get a bit boring after completing the palaces and mementos, there wasn't much to do apart from these sloppy events and the daily/weekly tasks, which feel too repetitive. There's also the city life part, which includes:\n- Social links that require you to grind comically large amounts of social stats xp to continue them.\n- Soccer minigame/rhythm minigame (which are absolute slop IMO)\n- Not much more... part-time jobs I guess?\n\nAnd you also have the permanent end-game content...\n- Velvet trials... Unfair battle challenges that completely break the usual Persona battle system (by giving the enemies a ton of shields that deny their weaknesses) and require specific characters/elements to complete.\n- Metro of desire (roguelike mode): This isn't that bad, but it gets repetitive and feels kinda useless to play when you unlocked everything.\n\nAt this point all I did was log in daily for the daily missions and weekly challenges and wait for the story to continue.\n\nAnd then the moment eventually came. In the 2.0 stream, the devs announced they were going to release the third chapter of the story, which was divided in... 4 stages? Seriously? And they release only the first stage in 2.0?\nWell, I guess they'll release the second stage in 2.1... Or at least that's what I thought, but then the 2.1 stream came, and they're releasing the second stage in... 2.3. All that's coming in 2.1 and 2.2 is a summer event. Yes, a summer event. In big September 22nd. \nI've been playing the summer event for a while, and it's the biggest slop I've seen in a very long time. A target shooting minigame, a battle challenge (which is, again, repeating the same battle a bunch of times) and some hangout-like conversations with the characters. Overall, the event feels very unpolished and unnecessary. I kind of feel insulted by this content.\n\nJust when the story was about to get good (or at least that's what everyone who has played in CN/KR says), we're told that we have to wait a month for the second of FOUR stages of one chapter, and all we have until then is a sloppy summer event. But hey, look, characters in swimsuits!\nWhat happened to the \"release the story faster to keep up with CN\" thing?\nSo I guess I'll come back when chapter 3 is fully released (which seems is going to be in like 3 months), because I don't really see a reason to keep playing besides the main story.\n\nI know this is a gacha game, and that they usually take some time to release story content (I've played Genshin before), but this is exactly why I think it doesn't suit a Persona game at all. After all, persona games are about making good use of time because it's limited. \nA gacha game where you have unlimited time and you go forever from yesterday to today to tomorrow doesn't follow the franchise's philosophy.",
      "voted_up": false,
      "votes_helpful": 108
    },
    {
      "review": "Even In game purchase doesnt work. I bought a monthly pass. Took my 5$ but didnt get it. Steam say they don't have permission to do anything so, ask the Devs but  the game's CS tells you to ask Steam.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "I went in as a huge fan of Persona 5, hoping this spin-off would capture at least a fraction of the magic. Unfortunately, it doesn’t.\r\n\r\nThe characters feel flat, the story is uninspired, and the gameplay is a watered-down imitation of the original. Instead of being a true continuation or a fresh take, it comes across as a mobile-style cash grab wearing the Persona skin.\r\n\r\nMenus are clunky, the flow of combat lacks impact, and the pacing is all over the place. It feels like the heart and soul of Persona 5 were stripped out, leaving only a shallow shadow behind.\r\n\r\nIf you loved Persona 5, this will just remind you how much better the original was. For me, it was a waste of time.\r\n\r\n⭐ 3/10 – A disappointing spin-off with none of the charm of the real thing.",
      "voted_up": false,
      "votes_helpful": 99
    },
    {
      "review": "I fully completed the first 2 arcs, 100%'d them and almost all side content released alongside them, in effect, having played more P5X than most P5X fans, I can tell you, without a doubt, this game is fucking terrible and by far the worst writing in an Atlus game, maybe the worst written game by a major developer I've ever played. Fuck this shit, but I guess gambling can be kind of fun and they give you 1 fun boss fight every 5 so that's gotta be worth something. Just don't expect to be playing a videogame that was made for anything other than stealing your time so you can get epic waifu #67. Every bit of gameplay is built around the gem economy so they can sell gambling to teenagers.",
      "voted_up": false,
      "votes_helpful": 69
    },
    {
      "review": "came back to the game after an extended absence just to find my account had been reset, do not play",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "It´s actually a pretty fun Persona game, but unfortunatelly suffers from the usual f2p time gate or pay jank plus gacha.\nStory is pretty fun and the gameplay is good, but i just can ´t be bothered to play a few minutes for over a month just to outgacha the current boss im forced to be stuck at. (and they are pretty broken to be honest)",
      "voted_up": false,
      "votes_helpful": 26
    }
  ]
}