{
  "positive": [
    {
      "review": "Weirdly addictive, very fun. If they allow modding and workshop on this game it's going to be even more popular than it already is.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "this game may not be real but my chronic gambling addiction is...",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "I play this game with my son every week. We take turns doing days and looking after the shop. Its a great game with a great loop, always things to unlock and sell. The constant updates from the devs have made this a continuous enjoyment to play. Keep up the good work delivering on those milestones! :)",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Obsessed with this game haha want to open cards, but they're all to expensive or impossible to find in your area? This game perfectly scratches the itch. It's difficult to avoid opening cards to bankruptcy (but at least it saves me from opening cards to bankruptcy in real life). The management part of it is a lot of fun, and decorating/organizing my shop brings me endless satisfaction. I look forward to future updates that expand upon the game and flesh out the gameplay loop.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great game for passing the time. Monotony can be great sometimes.\n\nIt would be much better if there could be a multiplayer aspect and a degree of interactivity with the NPCs (such as being able to play with them).\n\nOtherwise, I destroyed a $4000 card which returned a 1 and smashed, so winning :)",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Relaxing and addictive, pretty polished and still getting content and QoL updates. Alongside Supermarket Simulator it's one of the progenitors of the various store simulator games, if you're not into TCG stuff it probably spawned another store game with a theme more up your alley.\n\nIt does get a bit repetative after you've unlocked everything and you're just trying to complete the card collection, but by then you'll likely have gotten your money's worth out of the game and if you're the sort to keep trying to optimize your store it'll keep you going a while longer. Plus since scalpers have ruined collecting anything in real life these days it's a cheaper, less frustrating alternative to filling out your binders.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Scalpers ruined IRL Pokemon cards for me, so this game scratches that card-collecting dopamine itch with an added bonus of being cozy and casual to get into for hours!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i really enjoy the back and forth with this game. stocking shelves, running the register, etc. it all feels well done and continues to be updated and made to be better. The new scanner is an awesome addition and has helped out a lot. the only thing i cant seem to get on board with so far is the auto scent machine that sprays the stinky customers. it only works about 30 percent of the time. most of the time, i have to grab a can of spray myself and go spray them off, personally. not a huge issue but I just wish it worked better.  def cant wait for the game pass release. going to start it all over again, happily lol. if you like simulator games, this is one of the most well done ones, in my opinion.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "---{Graphics}---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{Gameplay}---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{Audio}---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{Audience}---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{PC Requirements}---\r\n☐ Check if you can run paint\r\n☑ Potato\r\n☐ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{Game Size}---\r\n☐ Floppy Disk\r\n☑ Old Fashioned\r\n☐ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{Difficulty}---\r\n☑ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{Story}---\r\n☐ No Story\r\n☑ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{Game Time}---\r\n☐ Long enough for a cup of coffee\r\n☑ Short\r\n☐ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{Price}---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{Bugs}---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{1/10}---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10\r\n\r\n---{Author}---\r\n☑ Mr. Wulf",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "TCG Card Shop Simulator is a surprisingly relaxing and satisfying game, especially if you enjoy card collecting or shop-management sims. Opening booster packs, organizing your collection, and selling cards to customers feels great, and the game nails that “card shop owner” vibe. The atmosphere is cozy, and early–mid progression feels rewarding.\r\n\r\nHowever, the game can become repetitive as you get further in. The variety of cards and items is somewhat limited, and some of the economic balance (upgrade prices, profit margins, etc.) can feel grindy. In the end game, the pace slows down a lot — XP becomes harder and harder to earn, which makes leveling feel sluggish and less satisfying. It’s still enjoyable, just noticeably slower.\r\n\r\nOverall:\r\nIf you enjoy card opening, running a small shop, and playing something chill without stress, this game is worth trying. Just don’t expect huge complexity or fast late-game progression.\r\n\r\nFinal Rating: In my opinion, the game is a solid 7.5/10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very fun game it is helping me feed my addiction of opening pokemon without going broke on pokemon cards it helps me cope",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I didn’t expect running a virtual trading card shop to be this weirdly addictive, but here we are. TCG Card Shop Simulator takes something as simple as stocking shelves, ripping packs, and dealing with quirky customers, and turns it into a gameplay loop that’s hard to put down. Watching your shop grow, unlocking new products, and chasing that next big pull scratches the same itch as real-life collecting—without draining your wallet. It’s cozy, satisfying, and surprisingly strategic for a simulator game. If you enjoy management sims or just love the thrill of trading cards, this one will hook you faster than you think.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A lifelong pokemon card collector, but somewhat new to shop sims, I was like \"yeah let me check this out\" and then I played for six hours straight and my eyes hurt I forgot to eat and my back hurts god I'm so old. \n\nThis game rocks. 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Enjoyed the game. Ripped a bunch of packs. Wish there was more autimation for individual card selling.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Sweat Shop is THE most successful start up in Little-Bigington, closely followed by Kazir's Barbershop and the Lucky Sarah Supermart. You too can be a successful business owner if you play this sim.\n\n*update*\nPulled a pack of ghost foils worth £71,000. Best game ever.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is the best Simulator in my honest opinion! The game is a lot of fun! Dev is doing a great job creating QOL updates, listens extremely well to the community and adding stuff to keep the game interesting! Big fat recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of the most satifying and addicting games Ive ever played. Love everything about it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well its definitely a card shop sim. still in early access but they have a roadmap filled with updates that they have been following. im taking a break on it now until it gets fully released!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive gameplay. I love the artwork on the trading cards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun if you like games its fun if you like cards and if you like both this is the game for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really entertaining and stressful at times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a good and fun card collecting game, actively gets updated!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best shop simulators. Very fun and the regular updates give something new to try out and see every now and then. Can't wait to see what else is coming before the full release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is fun, but it's easy to lose track of time while playing, you should add terrible customers. imagine a karen wanting a refund in the middle of a rush, it would be hilarious",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is addicting and enjoyable to play for a casual gamer like me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll be honest it's fun for a bit then you get the idea I like the game and gleefully wait for and enjoy updates. Once the playable card game updates come out and they release a second major card game (Hopefully one that's more like MTG) I am gonna be glued to the game. All in all though it's a simulator so you get it. But it's a good one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so much better than it has any right to be. the attention to detail is off the rails. 100% recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun and relaxng game, not terribly challenging. To me it is perfect when I want a game I can just turn my brain off to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun game that shows the reality of us nerds and the struggle to buy overpriced cards to add to our collection (Please shower no one likes a stinker). In this Sim you get to be either a kind-hearted lovable card shop owner that everyone loves to buy from or, a chasing for pennies low income streamer that eats everything in sight. If anyone needs anything please come to my store (scalperRus) as I have all the pokemon , Yugioh, and digimon cards for the cheap.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, if your into Card Hunting (and dont have a bagillion dollars) this is the game for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Come to the OPNEon Discord channel.  I'm usually there learning more about this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It can be grindy at first, but it was fun when my workers restock and man the cashier while i gacha the card packs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing, fun, addicting. Great game 9.3/10 recomended to all simulator lovers and tcg lovers. 10/10 graphics. 9/10 versitality. 8/10 cozy. 9/10 fun. 10/10 addicting. over all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is really fun and I appreciate the inclusion of quality of life feature that are designed into the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its exactly what it says it is, every update is adding great play features. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always new updates to look forward to which is admirable from an indie dev. Can't wait to see how tournaments are implemented and possibly multi-player/co-op in the far future?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. Very addicting. Once you start digging in and figuring things out, you want to do more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I know this game is still in early access but it still has a lot of content at this stage and is a lot of fun! I've gotten to the level where you can unlock Destiny packs and I'm still having a lot of fun. It runs well and has so much potential! I also like how the developer is actively working on this game and listens to the community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While it may be in early development, this game is very unique and spectacular. Makes me want to open my own trading card shop XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive, Fun and chill.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crazy game, i never imagined myself playing 16 hours. Good game, good time playing, so perfect with just you know after a long day then playing this game, kinda nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For simulator games this is by far the most addictive I have played. The joy of opening packs, unlocking new shop space, products, new cards at different rarities, all great. I've even ordered a plushie Nanomite as I love it so much!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have always been a TCG fan reguardless of it being Pokemon or Yugioh. I saw this game on Youtube from looking up videos of Yugioh. And it happened to be a recamended vid so I looked at it fell inlove with the game. bought it instantly and have barely put the game down since. I have only had the game for a little under 3 weeks and have 316 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, but grinding for the endgame achievements kind of sucks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TCG card shop simulator is a cool game. \r\nYou can do a lot of different things in this game including running your shop, changing prices of items, opening packs of cards, decorating, organizing, hiring help.\r\nThis game is currently in early access and I have been playing off and on for a while now and experienced several updates. Each update has seemed to make a lot of impact on the game at least for me. \r\nFavorite features so far: \r\nOrganizing and setting up my shop\r\nSetting up helpful employees\r\nOpening card packs/collecting cards/ selling duplicates\r\nThe new scanner feature is fantastic!! (best new feature in the game)\r\nThe auto card opener is awesome\r\n\r\nI anticipate a lot of new fun features to come in the future. Everything I have experienced so far has been pretty fantastic. I will continue playing off and on pretty regularly, as I always enjoy coming back to play when I am in a store sim mood.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good for like a week once every 6 months, and that is as far as i go.\nbut it is actually a well made and polished game.\nit just dosent quite hit the same as the ai for the customers sucks, \npeople be coming in with a card thats garbage tryna get more than its worth from me and they get angry and leave a bad review if try and haggle.\n6 / 10 but not bad,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game's awesome, looking forward to seeing the rest of the updates while in early access.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy this game! I know they are still adding and improving so many things and I just can't wait to see how far the game goes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sick Game, a real TCG Card Shop Simulator and it is really a good Early Access it dont feel like beta, its like a full game and get many Future Features, the Developer really cares and the Roadmap is really crazy.\n\nIn my Eyes the Game could easily cost 20-25€, the Roadmap ends with a playable TCG system, the last Update gave us Grading Cards.\n\nIam really suprised there are some decent Developers still, i first thought it will be again a game that is just cash grab, now i feel bad that i only paid 12,79€ for such a good Game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have had so much fun with this game.  Lots of things to do including decorating your store.  I love it.  Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "brilliant fun game especially for tcg fanatics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i thought i'd pick this up as a laugh and then didnt set it down for 10 hours straight. seems simplistic but is oddly addicting. if you told me the dev had created a pack ripping sim and then just build a game around it i would believe you but it works. 8/10 excited to see where this goes next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game and defs respond quick.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great base gameplay, fun to just chill with a movie or a podcast. It is Zen.\nDeveloper has been nailing great quality of life improvements lately, the scanner is wonderful.\nMy only real gripe is that the late game achievements are steep. Getting from level 80 to 100 is a huge slowdown from the rest of progression and obtaining 500 perfect graded cards is just nutty. I wouldn't be surprised if I need to double my total playtime if I decide to 100% this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and enjoyable card collecting and trading simulator. Would definitely recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun \"manager/simulator\" type of game. As someone that spent years working in retail, it's kind of nice to have a game that I can just disassociate and throwing myself into mindless repetitive tasks. Development has been ongoing and seems to get updated pretty regularly. Looking forward to swinging back to this game once it goes 1.0.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. Super simple and very easy to mindlessly play for hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Satisfying card collector and shop simulator rolled into one. Regularly updates and listens to suggestions from their community. Pack opening machines and scanner helped get rid of two of my biggest grievances from initial release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thoroughly enjoy this game, it’s nice to sit back and just run a card shop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An excellent game for just relaxing and living out your whale fantasy without spending thousands of real life money. \nThere is also the weirdly addicting activity of Optimizing the layout of your store, Decorating and recently receiving TCG 10 grading on a Full Art Foil Ghost card and selling it for $100k ╰(*°▽°*)╯",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addicting game. I've been able to channel my addiction of ripping packs into this and its great. Does feel alittle repetitive in the higher lvls with loading machines for ripping packs. I do like designing the layout of the shop and shooting the smelling customers. Its nice to come home and unwind, open packs grade cards and watch the money come in. Highly recommend if youre into ripping and dream of starting a shop!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good simulator game, even after many hours of playtime, it is still interesting to improve as a store manager and also as a card collector.\nTotally recommendable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stupidly addictive, busy work meets working a virtual job",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super chill game. Really fun and satisfying for all of your cardboard crack needs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, fun to open packs, love all the new stuff they add",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty neat game if you like the simulator games. I have been playing a few ways and seen youtubers play it. I recommend playing it if you like to just crack packs and not have to pay half your paycheck on MTG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game, good for any tcg collector.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game with a passion. It is such a nice way to waste a bit of time... a lot of time. pretty much all my time not spent at work or with family come to think of it.\n\nits nice to see it still being worked on too, with community suggestions really making their mark on the game. fantastic develpoment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love selling cards at Da hood first 10 min of the game got a 2100$ card sent it to tsa 14 day later it was 11k",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're a gamer that enjoys the repetitive nature of a game and find it relaxing or enjoyable then TCG Card Shop is for you. I love having the freedom to set up the products on the shelves just the way I like them as well as setting up the layout and decorations of the shop. I also recommend playing TCG Card Shop even if you're not someone that can sit in a game like this for hours because popping in and doing a day or two in your shop here or there can be a nice change of pace a reset you to go back to your other games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With almost every update, the game reaches another level. Very promising.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so fun for any TCG fan especially if you like the thrill of opening packs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly addictive gameplay loop. Some great mods available worth checking out too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, fills the desperate urge to work retail.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game captures exactly what you would hope for. \n\nAddicting gameplay, tons of products and upgrades to store, the dopamine hit of opening boosters. \n\nPlus, the creator has done kept a good steady stream of new content and fixes throughout.\n\nLooking forward to what the final release looks like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun indie game that let's you run a card store. If you want a chill relaxing game this is for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "adddicting game and constantly updated with new material. keeps me from real tcg so worth all the money in the world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game and the game isn't even fully out yet. Most developers would have just release the game unfinished and called it a day. This guys have been working not stop making this game better and better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game for filling my free time, yet it's feeding my ego for card gatcha. Idk, I feel like it's an addiction for some reason, ahahaha XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good game, hours of enjoyment opening packs is really good and mod support",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, perfect amount to grind for if you want to have all the achievements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "when your gen in card game flow state and miss 10 assignments",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly really fun and only a little stressful, and the only reason I don't have much playtime in it is because I burnt myself out since its so much fun. (free gambling = good game)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever although I would love to see the ability to set staff to refill the machines for the smell and also a new card machine that you can just put the boxes in highest tier takes say 3 boxes but you don't need to open and unload boxes you can just chuck them in closed and it dose from there also would love to see the ability to give staff more jobs like filling card tables and setting game events and maby the ability to change whare staff stand or abke to have them waunder when not busy or a staff room and maby ai conversation with staff / customers with all that being said the game is amazing and would highly recomend to anyone and love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and addictive game, can end up spending hours on this without paying attention.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, and I look forward to every update. Can really tell the dev cares about their game, and it's extra nice to see that they intend to donate their makeship drop profit share to charity. Big W!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game to lean back and relax too while watching youtube on my second monitor <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, Relaxing and very addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great trading card game, I would how ever like some more additions along the line of like some sweets coffee or drink machine. but other wise I highly suggest it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just takes me back to the end of the 90's/start 2000 when i was collecting Pokemon. Game is relaxing, fun and still being updated by this guy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun to just sit and mindlessly play for hours!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game writing this as im late to work lol as to show its easy to lose track of time playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a nice game. Especially after you can hire some workers, you can have it play in the background while doing other things if you do not wish to passively watch. It does show that it is still in development though. As good as it is right now, it can do with some further quality of life tools and implementations. The things you can do are a bit limited, but there is a lot of promise for future developments.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty addicting game. I use a yugioh tcg mod. Theres basically two ways you can play this. Make your dream shop that has a wide variety of items, which will almost always leave you short on cash, or only sell the items that give a high profit. I prefer the 1st option as the 2nd isn't much fun to me. This would probably not be an issue, but everytime you unlock a new item to sell. You must purchase a one time license fee which is usually sort of high. It's an unnecessary way to make you play longer i suppose. However I would recommend just using we mod to give yourself enough to purchase the licenses, negating yourself that headache. Otherwise i enjoy this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like irl TCGs, ripping packs, organization, and growing an empire...this is the game for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is sooo good. Personally, Ive never been a fan of sim games, but this one is great. I have learned something about myself playing this game, i have a gambling addiction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite games, and I know nothing about cards or anything. it's just an amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty chill game, but also fun to keep up with a shop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really addicting game!!! Lots of fun running your own card shop and selling things! Even pulled a $525 card on my first day playing!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game love to play it and relax. play while you watch Caseoh play its really fun then; playing at same time with him.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "[b]Too much of a time sink for me...[/b]\n\n+ Definitely gives a somewhat accurate impression of what I see in reality with card shops. \n+ Its enjoyable to rip packs and hope for a good pull to turn around and sell\n\n- The pacing is far too slow...  ~30mins to unlock a small upgrade\n- The logic doesn't make sense. You have to purchase a license for each and every product in order to purchase that product? That's not how licensing works in reality.  \n- Sometimes a customer will come in and want to sell you a card, but its ridiculously random... like at the start of the game offering to sell you something $5000+\n- Mods are almost a must have to Speed up the amount of time it takes to open a packs\n\n~ I think the game would be more enjoyable if people came in offering to sell you larger collections, and then maybe having to sort through it. Generally card stores in reality make a large amount of their profit by buying collections from customers including bulk. \n\nSide Note: I have absolutely no idea how this game got so popular, I feel like it was a weird time in history where there was nothing new releasing and pokemon was at a all time high in popularity.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I do enjoy this game HOWEVER and thats a huge HOWEVER. my save files have been lost to the shelf error twice and the last time was my 250+ hour save after getting a new computer and trying to boot it up to continue getting all the achievements. it is very frustrating and has left a sour taste in my mouth about this game as a whole",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has two main problems. The first and biggest problem is that the in game economy is broken. If you don't sell the most expensive item you unlocked and only that item, you are shooting yourself in the foot. Your daily profits will tank if you try to have an actual tcg store instead of this soulless min max machine with a bunch of counters with warehouse racks next to them to restock as quickly as possible, all located next to the entrance.\n\nThe second biggest issue is that opening card packs is boring. Why should I care about cool or rare cards when all they give me is some money. Would be way more fun if I could actually use them in a playable card game and I imagine the dopamine people get from obtaining these rare cards would be way higher.\n\nInstead the developer chooses to distract themselves with adding minor functionalities that don't really add any meat on the bone or fix the broken economy. Feels like they are hiding from the actual problems and don't have the talent to implement what this game actually needs to improve.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "unable to organize an event, stuck at that part of the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my stupid game wont fix itself, when i open a card pack my screen freezes and i am unable to do anything but restart my pc to leave the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is broken cannot play it anymore loading game nothing works starting new game nothing works devs have killed this game with bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The latest update has made the game terrible, cant move anything that you place down, cant change flooring walls ceiling, just not enjoyable at all now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lost multiple save files, files got corrupted cause of this game, pc randomly shuts off and no one can help.\r\nthis is the only game in all 100+ games ive played, and keeps giving issues. would not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game after 15-20 hours repetitive. Developer has road if that plan completede there could be less repetitiveness. I have hopes for this game but For now it is negative to me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i love simulator games, but this one is only designed to be successful at the start. the RNG economy which is designed to overall go down while costs go up, mean that eventually its impossible to progress. FIX THE ECONOMY in your game. As is now, this game is technically \"unwinable\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was a lot of fun and did a lot of work to get to lvl 115 but now the game is unplayable. Several items have been added creating issues with lag. Loading takes forever now, crashes to desktop and lag makes it a nightmare to try and run the store.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "basic game that cant get the basics right. you send cards out to get \"graded\", DO NOT EVER SEND CARDS FOR GRADE, 6/10 contracts just get removed.. I guess my cards got trumped!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no major updates but dont worry the $40 plushies are coming out!\n\nabandonware, avoid.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "in the current state of the game its trash. \ncant open a single card pack. \nthis bug was present in 2024 and its still here today",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is another one of those asset-flip slop games that a bunch of youtubers played for like a week and then moved on from, and is EXTREMELY similar to grocery store simulator, which was much of the same. Though the gimmick of opening card packs is pretty cool, pretty much all of the game's artwork is AI generated, which is deeply disappointing. The game is really only playable long term with mods and the game is constantly recieving tiny updates that break said mods, and the community is not active enough to update them in time, so most of the best mods for this game are now unusable and may never be updated. Without mods, it is an UNBEARABLE grind. The character models are ugly and the customer's ai is horrible and they get stuck constantly, everything is way too expensive and profit scaling is janky so you make almost nothing, and most items are locked behind a level system that takes literally like several hundred hours of going AFK to max out. You'll play this game for an hour and not play it for six months. Not worth the money and painfully low effort. Save your money and don't support AI art.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An insane waste of time.  This is a simulated minimum wage job.  You could be leveling up your life, fam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why the hell their so many stanky ahh ppl",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i dont like the game any more",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So I am having to regrettably give this game a negative recommendation, as it is a different game from what it's title would lean many to think it was.  I held back on giving this review as I was hoping some things would change (as many things tend to improve through an EA), but it's direction has completely leaned away from what I was looking for\n\nTCG Card Shop Simulator is a \"pack opening\" simulator, NOT a simulation of running a card shop.  It's systems are hyper exploitable once you understand what those are, and there is a portion of players on its discord that shout down anyone thinking it should be less so.  If you tried to run your shop with any sort of legitimate business acumen (things like diversifying your products and offerings, or trying to offer deep selections of similar products) the game actively punishes you for it.\n\nMuch of this comes from the fact that it's designer is bringing a game concept over from the mobile side of gaming.  This game's predecessor was just a \"big number go up\" style shop simulator, where you are always just better off offering large amounts of the most expensive products, and ignore everything else.  As one could imagine, if this was always the best thing to do, no one would sell anything other then Lamborghinis anywhere in the world.\n\nSo if you just want to collect fake cards and have a game built to where you can easily exploit it and open up thousands of packs of cards, then this game will suit your needs.  If you were hoping for a game that felt like you were running a card shop from the 90s or 00s, this is not going to sufficiently simulate that.  The sad part is, it could have easily moved closer to a center point, with the pack rippers loosing very little, but having to actually manage a card shop was not something some of the early adopters wanted to do.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "came out over a year ago. promised an actual game to add to match just collecting cards. They added a bunch of decorations and card grading instead. If you want a pack opening simulator go for it. Its a mid simulator game with minimal options",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "To me, I feel like this is the PERFECT game if:\n\nA) You're just a stoner who's stoned all day every day, and never leave the house.\nB)  You're going through a tough time, you're depressed, and you just want something to keep your mind off whatever is bothering you. \nC) You're the type to have an idle game playing in the background while you work and like to alternate between work and gaming.\n\nIf that's the case, you can do no wrong getting this game at a discount. It is absolutely perfect for you if that is the case. \n\nTo anyone else, avoid this game like a plague (unless it is on a deep sale and you're a game hoarder who wants to add more backlog of games you don't play).\n\nDon't get me wrong, I very much enjoyed the game. But halfway through, it really does become a wait and wait type of game as the things you can do become very limited, repetitive, and just plain old boring - and worse, frustrating.\n\nTo add to it, i don't really see why this game is considered early access? Like, seriously. Where else can you take this game beyond what is already given? Yes, you can add QOL mechanics and whatnot, but there is little room for a major expansion or a marked improvement in gameplay systems that will make this ten times better than it is.\n\nThis feels like the full release, and any updates is just that. Minor improvements and fixes to improve the games QOL. But I doubt it will go beyond what is already here. \n\nAnyway, I can't recommend this because there is no \"neutral\" or \"mixed\" option and I truly believe that the gameplay loop is not for a lot of people once you hit x certain amount of hours. You literally have to be a person with nothing going on his life to enjoy this game as half the game is waiting, and waiting, and waiting.\n\nNow, I might change the rating down the line, but as I looked at my shop at Day 190 with this amount of hours of playtime, I decided that was it. So I had my employees restock the store, placed all my ten graded rare cards in a large wall displays and lower tiers on shelves, and essentially \"completed\" the store with everything fully stocked and placed accordingly.\n\nBy the end of all that, however, I find myself saying:\n\n\"Well, this game felt like a waste of time.\" \n\nSo I promptly fired all my employees and turned off the lights. The store is now a museum with prices jacked up to 2,000% above market price, forever left in its pristine and restocked condition, likely never to be opened again until I reinstall the game.\n\nMaybe one day I'll feel differently, but after all that, I just didn't feel satisfied. I just felt like I wasted my time.\n\nDoes it means its a bad game? No. Not at all. This is a good game. But it just doesn't feel satisfying. Maybe that's fine for a lot of you, but I'm pretty damn old now with fortunately time to kill during my time with this game, and I definitely felt like that time wasn't spent well.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "[b]Too much of a time sink for me...[/b]\n\n+ Definitely gives a somewhat accurate impression of what I see in reality with card shops. \n+ Its enjoyable to rip packs and hope for a good pull to turn around and sell\n\n- The pacing is far too slow...  ~30mins to unlock a small upgrade\n- The logic doesn't make sense. You have to purchase a license for each and every product in order to purchase that product? That's not how licensing works in reality.  \n- Sometimes a customer will come in and want to sell you a card, but its ridiculously random... like at the start of the game offering to sell you something $5000+\n- Mods are almost a must have to Speed up the amount of time it takes to open a packs\n\n~ I think the game would be more enjoyable if people came in offering to sell you larger collections, and then maybe having to sort through it. Generally card stores in reality make a large amount of their profit by buying collections from customers including bulk. \n\nSide Note: I have absolutely no idea how this game got so popular, I feel like it was a weird time in history where there was nothing new releasing and pokemon was at a all time high in popularity.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Decided it was necessary to update the review after new findings.\n\nThe early to mid game is great and addictive however there are 2 major issues with the design of this game and I'll get to both of them now and why I don't believe this game deserves a positive recommendation. \n\nLeveling:\nEverything in the game is unlocked by level 80 and getting there is a slog but doable, shop products are unlocked at a steady pace always keeping you busy. The real issue is what happens after level 80. After level 80 all there is to unlock is warehouse space, space that is valuable so that you can add more card opening machine that open card packs for you while you're doing other tasks. The final warehouse space upgrade is unlocked at level 115. Getting from level 80 to 115 to unlock the final few warehouse space upgrades is INSANE, to the point that it's the most extreme case of game padding I have ever seen. XP required per level needs a huge reduction as the amount of hours  required for a single level up is beyond crazy and it only gets worse requiring more XP the higher your level.\n\nCollecting All Cards:\nIn order to complete the game you have to collect one of every unique card in the game, this starts off as a fun task that is ongoing since day 1 and is mostly just at the back of your mind while you develop your shop and grow your business. However, you eventually get to the point where everything is unlocked, your shop is fully developed and you focus on the final task in the game - finishing your card collection. You will quickly come to the realisation that the system is horribly designed. Collecting cards needs a huge overhaul or fix. To put into perspective exactly how bad the grind to collect all cards is I'll give you my stats. I've spent the last 6 hours straight just opening card packs and I'm still missing 1 card from a common pack, still haven't pulled it. I've opened 390,000 card packs in total throughout my playthrough!!!...and still missing 80 cards to complete the collection and this is with mods that allow me to open hundreds of packs a minute. What an absolute joke this is! Just imagine if I wasn't using mods to speed this up if even with the mods I'm still nowhere close after opening 390,000 packs! Card drop rates either need to be dynamic in the sense that the odds increase as the number of missing cards decreases or another method of obtaining cards should be introduced. \n\nThe hard truth is that this game doesn't respect your time and expects you to slave away in a mindless grind to complete it.\n\nIf these two huge issues are fixed I will change my review to a positive one because on the surface there is a great game here, it is insanely satisfying and addicting, the hours just fly by playing this game - it just doesn't respect your free time in any way unfortunately.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Despite being loaded with assets, the game is still empty. Unlocking new tiers of items is lackluster and doesn't change the gameplay loop at all. Customers have zero personality or options for interaction. The inflating cost of each tier felt like an idle game (with commensurate minimal ROI). I just didn't find it fun; less so as the game went on.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Wait for the full release. The grind is terrible. I understand rare cards but I've been playing for 78 hours and have not seen one super rare card. Nothing close to what I've seen in YouTube videos. So if you do play this game it needs to be modded.\r\nCustomers will get stuck in walls and reloading the game doesn't fix it. Workers are slow even the ones that are labeled \"Very Fast\". Workers also don't have set stocking jobs so they will all go to the same box. Some popular items only come 2 in per box which makes stocking and storing difficult.\r\nStinky customers will chase away your other customers before going into the store. The card trading with customers needs a huge overhaul.\r\nI guess I could keep going on, but I guess it's safe to say it's a grindy mess right now. Buy at your own risk.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "meh... repetitive and almost no decisions. Maybe tolerable if there was a 5x speed button.\n\nI liked ripping packs like a gremlin tho.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I personally found the game extremely boring and repetitive, although it seems I am in the minority in this case. After a couple of hours you have experienced everything the game has to offer. The game feature very few and monotonous actions; restock the shelves, change prices, checkout, open packs. Even these mechanics are mostly eliminated after hiring workers, leaving only opening packs, which is incredibly slow and tedious without modding the game. The cards themselves feature no gameplay benefit or mechanics outside its financial value, making them more so glorified stocks or assets than unique cards. you'll spend most of your time opening packs staring at the corner to see how much they are worth, as its the only thing that even matters. \n\nAnother issue is how bland most of the games merchandise is, as in, items you sell in the game for profit (not irl merch). Most are simply reskins of already existing products in the game, such as different coloured deck boxes, different art on playmats, books with different covers, etc. as such, they only have value as much as they are valued.\n\nFrom what I understand, a lot of the appeal of the game is opening the packs, which I struggle to see how that can be enjoyable. The cards in the game are essentially knockoff pokemon, with none of the chase cards being very interesting. All the cards have full-art or foil variants, but the thing they lack is any form of alternative art or design to chase. This issue is only more noticeable when unlocking destiny packs, which are identical to the base version, the only difference being the background of the card, and its value. Besides those, the cards are visually identical to the base set, even have the same cards at the same rarity. The only chase cards are \"ghost\" cards, which happen to be the only alternative art in the game. \n\nUltimately, the game is lacking in meaningful progression, which is an issue in \"number-go-up\" type games. Numbers getting bigger is not engaging if there isn't a purpose or benefit to increasing those numbers, which results in a game of mindless and repetitive progression, for no other incentive than to maybe look at some pokemon card knockoffs. If you are still interested in the game, I recommend purchasing the game on sale, and keep in mind that if you don't like the game within the first hour, you won't like it 50 hours in either, it is the same game, and nothing really changes between these timeframes. I would also recommend modding the game with fast pack opening, ArtExpander and a reskin of the existing cards, as seemingly the modders have more interest in designing a visually appealing game. Retexture mods exist for all of the big three card games (Pokemon TCG, MTG, YGO) and others, such as Dragon ball, hololive, and... gooners apparently (don't turn adult content on in nexus, I'm warning you). Some improvements to the game is having more varied card art, more purpose in collecting or displaying cards outside your own enjoyment, such as improving popularity by displaying cards, or maybe having ranking that compete against other stores? \n\nObviously, if you are reading this, don't take my words as gospel, as this my opinion and analysis of the game. Buy the game and try it yourself. If you don't like it, refund it within the first 2 hours, otherwise you might find a game you really enjoy, but alas, as a connoiseur of simulator slop games, I cannot recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I do enjoy this game HOWEVER and thats a huge HOWEVER. my save files have been lost to the shelf error twice and the last time was my 250+ hour save after getting a new computer and trying to boot it up to continue getting all the achievements. it is very frustrating and has left a sour taste in my mouth about this game as a whole",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its just meaningless busywork with no payoff. when a game makes common cards rarer than ghost cards just to prevent you from completing the set in order to keep you playing longer... thats bad game design. I shouldnt have to open 5000 cases of basic packs to get a couple of common cards (which i STILL havent gotten after weeks of play.)  I give up and uninstalling. too bad i cant refund",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "On the surface it's a really interesting concept. And the first few hours got me hooked, not gonna lie. However, once you reach a certain point - and for me, that point came rather quickly, it gets frustrating and uninteresting. It simply lacks the depth to warrant and longer-time-play because the basic game loop at this point is simple and shallow. It turns into a really grindy slog.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is a tad bit buggy, it is really fun i will admit but i was at day 36 yesterday and when i cam on to play today exited to upgrade my store and grade my good cards it put me back to day 24 and im really upset by this because it takes quite a while to get through in this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is too far removed from reality to have \"simulator\" in its title. It's an idle game with a trading-card-shop theme. I put a lot of time in looking for a game that just isn't here.\r\n\r\nCustomers come in who stink, and this upsets your other customers. As a shopkeeper, you're expected to install a machine that detects odorous guests and hoses them down with deodorant. Just like in real life.\r\n\r\nWhen you go to buy products, first you have to buy a license for them. The license gets more expensive as the items go up in level. This means that you'll pay a few hundred bucks for the right to sell Adventure Comic 1, but tens of thousands if you want to stock Adventure Comic 12. \r\n\r\nOnce you've bought the license, you can buy the product at wholesale prices. Sometimes, you can buy products in two lot sizes (pack of 32 or pack of 64), they're always exactly the same per-unit price so you don't actually get a bulk discount. Also, if you buy a pack of 8 red deck boxes and a pack of 16 red deck boxes, you're not allowed to store them on the same shelf. Just like in real life.\r\n\r\nYou can hold up to 8 packs in your hand, but only 1 of anything else. You also can't do anything with anything in your hand except put it back on a shelf. You can only get boxes from emptying out product orders (if you buy a 32-pack of cards, and put them on a shelf, now you have an empty box you can work with). But despite the necessity of having a box to do any kind of inventory rearranging, you can't just produce a box. Fortunately, you can't store empty boxes in your warehouse. Did I say fortunately? I meant \"for some insane reason.\"\r\n\r\nI was hoping to glean some insight about how card shops work, how prices are set, how demand is calculated, maybe get a sense of how many boxes of cards a real shop has to sell in a day. Instead, I get a game centered around what feels like a child's guess at how a retail operation works.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Played for 30 mins and its quite buggy, sometimes customers just walk around indefinitely doing nothing, also when I sprayed a smelly guy with air freshener it wouldn't let me put the can down afterwards",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game has two main problems. The first and biggest problem is that the in game economy is broken. If you don't sell the most expensive item you unlocked and only that item, you are shooting yourself in the foot. Your daily profits will tank if you try to have an actual tcg store instead of this soulless min max machine with a bunch of counters with warehouse racks next to them to restock as quickly as possible, all located next to the entrance.\n\nThe second biggest issue is that opening card packs is boring. Why should I care about cool or rare cards when all they give me is some money. Would be way more fun if I could actually use them in a playable card game and I imagine the dopamine people get from obtaining these rare cards would be way higher.\n\nInstead the developer chooses to distract themselves with adding minor functionalities that don't really add any meat on the bone or fix the broken economy. Feels like they are hiding from the actual problems and don't have the talent to implement what this game actually needs to improve.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This review is from a standpoint of an achievement hunter. As a casual gamer its probably fun to a degree. Building your own shop. Spraying your customers with deadorant cuz all tcg gamers are stinky. If you wanna chill this game is probably good. As an Achievement hunter its very tedious. I already finished it at 100%. The only thing keeping me for like 50h was getting my shop to LVL 100. It took such a long time, doing nothing, waiting for the day to end. Recently new Achivements got released. After reviewing them i started crying. 500 Mint Graded Cards??? Just another ,,DO this for 10 years\" achievement. \r\nCasual Review 6/10\r\nAchievement Review 4/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unable to organize an event, stuck at that part of the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my stupid game wont fix itself, when i open a card pack my screen freezes and i am unable to do anything but restart my pc to leave the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is broken cannot play it anymore loading game nothing works starting new game nothing works devs have killed this game with bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The latest update has made the game terrible, cant move anything that you place down, cant change flooring walls ceiling, just not enjoyable at all now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lost multiple save files, files got corrupted cause of this game, pc randomly shuts off and no one can help.\r\nthis is the only game in all 100+ games ive played, and keeps giving issues. would not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game after 15-20 hours repetitive. Developer has road if that plan completede there could be less repetitiveness. I have hopes for this game but For now it is negative to me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i love simulator games, but this one is only designed to be successful at the start. the RNG economy which is designed to overall go down while costs go up, mean that eventually its impossible to progress. FIX THE ECONOMY in your game. As is now, this game is technically \"unwinable\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was a lot of fun and did a lot of work to get to lvl 115 but now the game is unplayable. Several items have been added creating issues with lag. Loading takes forever now, crashes to desktop and lag makes it a nightmare to try and run the store.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "basic game that cant get the basics right. you send cards out to get \"graded\", DO NOT EVER SEND CARDS FOR GRADE, 6/10 contracts just get removed.. I guess my cards got trumped!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no major updates but dont worry the $40 plushies are coming out!\n\nabandonware, avoid.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "in the current state of the game its trash. \ncant open a single card pack. \nthis bug was present in 2024 and its still here today",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is another one of those asset-flip slop games that a bunch of youtubers played for like a week and then moved on from, and is EXTREMELY similar to grocery store simulator, which was much of the same. Though the gimmick of opening card packs is pretty cool, pretty much all of the game's artwork is AI generated, which is deeply disappointing. The game is really only playable long term with mods and the game is constantly recieving tiny updates that break said mods, and the community is not active enough to update them in time, so most of the best mods for this game are now unusable and may never be updated. Without mods, it is an UNBEARABLE grind. The character models are ugly and the customer's ai is horrible and they get stuck constantly, everything is way too expensive and profit scaling is janky so you make almost nothing, and most items are locked behind a level system that takes literally like several hundred hours of going AFK to max out. You'll play this game for an hour and not play it for six months. Not worth the money and painfully low effort. Save your money and don't support AI art.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An insane waste of time.  This is a simulated minimum wage job.  You could be leveling up your life, fam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why the hell their so many stanky ahh ppl",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i dont like the game any more",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So I am having to regrettably give this game a negative recommendation, as it is a different game from what it's title would lean many to think it was.  I held back on giving this review as I was hoping some things would change (as many things tend to improve through an EA), but it's direction has completely leaned away from what I was looking for\n\nTCG Card Shop Simulator is a \"pack opening\" simulator, NOT a simulation of running a card shop.  It's systems are hyper exploitable once you understand what those are, and there is a portion of players on its discord that shout down anyone thinking it should be less so.  If you tried to run your shop with any sort of legitimate business acumen (things like diversifying your products and offerings, or trying to offer deep selections of similar products) the game actively punishes you for it.\n\nMuch of this comes from the fact that it's designer is bringing a game concept over from the mobile side of gaming.  This game's predecessor was just a \"big number go up\" style shop simulator, where you are always just better off offering large amounts of the most expensive products, and ignore everything else.  As one could imagine, if this was always the best thing to do, no one would sell anything other then Lamborghinis anywhere in the world.\n\nSo if you just want to collect fake cards and have a game built to where you can easily exploit it and open up thousands of packs of cards, then this game will suit your needs.  If you were hoping for a game that felt like you were running a card shop from the 90s or 00s, this is not going to sufficiently simulate that.  The sad part is, it could have easily moved closer to a center point, with the pack rippers loosing very little, but having to actually manage a card shop was not something some of the early adopters wanted to do.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "came out over a year ago. promised an actual game to add to match just collecting cards. They added a bunch of decorations and card grading instead. If you want a pack opening simulator go for it. Its a mid simulator game with minimal options",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "To me, I feel like this is the PERFECT game if:\n\nA) You're just a stoner who's stoned all day every day, and never leave the house.\nB)  You're going through a tough time, you're depressed, and you just want something to keep your mind off whatever is bothering you. \nC) You're the type to have an idle game playing in the background while you work and like to alternate between work and gaming.\n\nIf that's the case, you can do no wrong getting this game at a discount. It is absolutely perfect for you if that is the case. \n\nTo anyone else, avoid this game like a plague (unless it is on a deep sale and you're a game hoarder who wants to add more backlog of games you don't play).\n\nDon't get me wrong, I very much enjoyed the game. But halfway through, it really does become a wait and wait type of game as the things you can do become very limited, repetitive, and just plain old boring - and worse, frustrating.\n\nTo add to it, i don't really see why this game is considered early access? Like, seriously. Where else can you take this game beyond what is already given? Yes, you can add QOL mechanics and whatnot, but there is little room for a major expansion or a marked improvement in gameplay systems that will make this ten times better than it is.\n\nThis feels like the full release, and any updates is just that. Minor improvements and fixes to improve the games QOL. But I doubt it will go beyond what is already here. \n\nAnyway, I can't recommend this because there is no \"neutral\" or \"mixed\" option and I truly believe that the gameplay loop is not for a lot of people once you hit x certain amount of hours. You literally have to be a person with nothing going on his life to enjoy this game as half the game is waiting, and waiting, and waiting.\n\nNow, I might change the rating down the line, but as I looked at my shop at Day 190 with this amount of hours of playtime, I decided that was it. So I had my employees restock the store, placed all my ten graded rare cards in a large wall displays and lower tiers on shelves, and essentially \"completed\" the store with everything fully stocked and placed accordingly.\n\nBy the end of all that, however, I find myself saying:\n\n\"Well, this game felt like a waste of time.\" \n\nSo I promptly fired all my employees and turned off the lights. The store is now a museum with prices jacked up to 2,000% above market price, forever left in its pristine and restocked condition, likely never to be opened again until I reinstall the game.\n\nMaybe one day I'll feel differently, but after all that, I just didn't feel satisfied. I just felt like I wasted my time.\n\nDoes it means its a bad game? No. Not at all. This is a good game. But it just doesn't feel satisfying. Maybe that's fine for a lot of you, but I'm pretty damn old now with fortunately time to kill during my time with this game, and I definitely felt like that time wasn't spent well.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "[b]Too much of a time sink for me...[/b]\n\n+ Definitely gives a somewhat accurate impression of what I see in reality with card shops. \n+ Its enjoyable to rip packs and hope for a good pull to turn around and sell\n\n- The pacing is far too slow...  ~30mins to unlock a small upgrade\n- The logic doesn't make sense. You have to purchase a license for each and every product in order to purchase that product? That's not how licensing works in reality.  \n- Sometimes a customer will come in and want to sell you a card, but its ridiculously random... like at the start of the game offering to sell you something $5000+\n- Mods are almost a must have to Speed up the amount of time it takes to open a packs\n\n~ I think the game would be more enjoyable if people came in offering to sell you larger collections, and then maybe having to sort through it. Generally card stores in reality make a large amount of their profit by buying collections from customers including bulk. \n\nSide Note: I have absolutely no idea how this game got so popular, I feel like it was a weird time in history where there was nothing new releasing and pokemon was at a all time high in popularity.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Decided it was necessary to update the review after new findings.\n\nThe early to mid game is great and addictive however there are 2 major issues with the design of this game and I'll get to both of them now and why I don't believe this game deserves a positive recommendation. \n\nLeveling:\nEverything in the game is unlocked by level 80 and getting there is a slog but doable, shop products are unlocked at a steady pace always keeping you busy. The real issue is what happens after level 80. After level 80 all there is to unlock is warehouse space, space that is valuable so that you can add more card opening machine that open card packs for you while you're doing other tasks. The final warehouse space upgrade is unlocked at level 115. Getting from level 80 to 115 to unlock the final few warehouse space upgrades is INSANE, to the point that it's the most extreme case of game padding I have ever seen. XP required per level needs a huge reduction as the amount of hours  required for a single level up is beyond crazy and it only gets worse requiring more XP the higher your level.\n\nCollecting All Cards:\nIn order to complete the game you have to collect one of every unique card in the game, this starts off as a fun task that is ongoing since day 1 and is mostly just at the back of your mind while you develop your shop and grow your business. However, you eventually get to the point where everything is unlocked, your shop is fully developed and you focus on the final task in the game - finishing your card collection. You will quickly come to the realisation that the system is horribly designed. Collecting cards needs a huge overhaul or fix. To put into perspective exactly how bad the grind to collect all cards is I'll give you my stats. I've spent the last 6 hours straight just opening card packs and I'm still missing 1 card from a common pack, still haven't pulled it. I've opened 390,000 card packs in total throughout my playthrough!!!...and still missing 80 cards to complete the collection and this is with mods that allow me to open hundreds of packs a minute. What an absolute joke this is! Just imagine if I wasn't using mods to speed this up if even with the mods I'm still nowhere close after opening 390,000 packs! Card drop rates either need to be dynamic in the sense that the odds increase as the number of missing cards decreases or another method of obtaining cards should be introduced. \n\nThe hard truth is that this game doesn't respect your time and expects you to slave away in a mindless grind to complete it.\n\nIf these two huge issues are fixed I will change my review to a positive one because on the surface there is a great game here, it is insanely satisfying and addicting, the hours just fly by playing this game - it just doesn't respect your free time in any way unfortunately.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Despite being loaded with assets, the game is still empty. Unlocking new tiers of items is lackluster and doesn't change the gameplay loop at all. Customers have zero personality or options for interaction. The inflating cost of each tier felt like an idle game (with commensurate minimal ROI). I just didn't find it fun; less so as the game went on.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Wait for the full release. The grind is terrible. I understand rare cards but I've been playing for 78 hours and have not seen one super rare card. Nothing close to what I've seen in YouTube videos. So if you do play this game it needs to be modded.\r\nCustomers will get stuck in walls and reloading the game doesn't fix it. Workers are slow even the ones that are labeled \"Very Fast\". Workers also don't have set stocking jobs so they will all go to the same box. Some popular items only come 2 in per box which makes stocking and storing difficult.\r\nStinky customers will chase away your other customers before going into the store. The card trading with customers needs a huge overhaul.\r\nI guess I could keep going on, but I guess it's safe to say it's a grindy mess right now. Buy at your own risk.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "meh... repetitive and almost no decisions. Maybe tolerable if there was a 5x speed button.\n\nI liked ripping packs like a gremlin tho.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I personally found the game extremely boring and repetitive, although it seems I am in the minority in this case. After a couple of hours you have experienced everything the game has to offer. The game feature very few and monotonous actions; restock the shelves, change prices, checkout, open packs. Even these mechanics are mostly eliminated after hiring workers, leaving only opening packs, which is incredibly slow and tedious without modding the game. The cards themselves feature no gameplay benefit or mechanics outside its financial value, making them more so glorified stocks or assets than unique cards. you'll spend most of your time opening packs staring at the corner to see how much they are worth, as its the only thing that even matters. \n\nAnother issue is how bland most of the games merchandise is, as in, items you sell in the game for profit (not irl merch). Most are simply reskins of already existing products in the game, such as different coloured deck boxes, different art on playmats, books with different covers, etc. as such, they only have value as much as they are valued.\n\nFrom what I understand, a lot of the appeal of the game is opening the packs, which I struggle to see how that can be enjoyable. The cards in the game are essentially knockoff pokemon, with none of the chase cards being very interesting. All the cards have full-art or foil variants, but the thing they lack is any form of alternative art or design to chase. This issue is only more noticeable when unlocking destiny packs, which are identical to the base version, the only difference being the background of the card, and its value. Besides those, the cards are visually identical to the base set, even have the same cards at the same rarity. The only chase cards are \"ghost\" cards, which happen to be the only alternative art in the game. \n\nUltimately, the game is lacking in meaningful progression, which is an issue in \"number-go-up\" type games. Numbers getting bigger is not engaging if there isn't a purpose or benefit to increasing those numbers, which results in a game of mindless and repetitive progression, for no other incentive than to maybe look at some pokemon card knockoffs. If you are still interested in the game, I recommend purchasing the game on sale, and keep in mind that if you don't like the game within the first hour, you won't like it 50 hours in either, it is the same game, and nothing really changes between these timeframes. I would also recommend modding the game with fast pack opening, ArtExpander and a reskin of the existing cards, as seemingly the modders have more interest in designing a visually appealing game. Retexture mods exist for all of the big three card games (Pokemon TCG, MTG, YGO) and others, such as Dragon ball, hololive, and... gooners apparently (don't turn adult content on in nexus, I'm warning you). Some improvements to the game is having more varied card art, more purpose in collecting or displaying cards outside your own enjoyment, such as improving popularity by displaying cards, or maybe having ranking that compete against other stores? \n\nObviously, if you are reading this, don't take my words as gospel, as this my opinion and analysis of the game. Buy the game and try it yourself. If you don't like it, refund it within the first 2 hours, otherwise you might find a game you really enjoy, but alas, as a connoiseur of simulator slop games, I cannot recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I do enjoy this game HOWEVER and thats a huge HOWEVER. my save files have been lost to the shelf error twice and the last time was my 250+ hour save after getting a new computer and trying to boot it up to continue getting all the achievements. it is very frustrating and has left a sour taste in my mouth about this game as a whole",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its just meaningless busywork with no payoff. when a game makes common cards rarer than ghost cards just to prevent you from completing the set in order to keep you playing longer... thats bad game design. I shouldnt have to open 5000 cases of basic packs to get a couple of common cards (which i STILL havent gotten after weeks of play.)  I give up and uninstalling. too bad i cant refund",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "On the surface it's a really interesting concept. And the first few hours got me hooked, not gonna lie. However, once you reach a certain point - and for me, that point came rather quickly, it gets frustrating and uninteresting. It simply lacks the depth to warrant and longer-time-play because the basic game loop at this point is simple and shallow. It turns into a really grindy slog.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is a tad bit buggy, it is really fun i will admit but i was at day 36 yesterday and when i cam on to play today exited to upgrade my store and grade my good cards it put me back to day 24 and im really upset by this because it takes quite a while to get through in this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is too far removed from reality to have \"simulator\" in its title. It's an idle game with a trading-card-shop theme. I put a lot of time in looking for a game that just isn't here.\r\n\r\nCustomers come in who stink, and this upsets your other customers. As a shopkeeper, you're expected to install a machine that detects odorous guests and hoses them down with deodorant. Just like in real life.\r\n\r\nWhen you go to buy products, first you have to buy a license for them. The license gets more expensive as the items go up in level. This means that you'll pay a few hundred bucks for the right to sell Adventure Comic 1, but tens of thousands if you want to stock Adventure Comic 12. \r\n\r\nOnce you've bought the license, you can buy the product at wholesale prices. Sometimes, you can buy products in two lot sizes (pack of 32 or pack of 64), they're always exactly the same per-unit price so you don't actually get a bulk discount. Also, if you buy a pack of 8 red deck boxes and a pack of 16 red deck boxes, you're not allowed to store them on the same shelf. Just like in real life.\r\n\r\nYou can hold up to 8 packs in your hand, but only 1 of anything else. You also can't do anything with anything in your hand except put it back on a shelf. You can only get boxes from emptying out product orders (if you buy a 32-pack of cards, and put them on a shelf, now you have an empty box you can work with). But despite the necessity of having a box to do any kind of inventory rearranging, you can't just produce a box. Fortunately, you can't store empty boxes in your warehouse. Did I say fortunately? I meant \"for some insane reason.\"\r\n\r\nI was hoping to glean some insight about how card shops work, how prices are set, how demand is calculated, maybe get a sense of how many boxes of cards a real shop has to sell in a day. Instead, I get a game centered around what feels like a child's guess at how a retail operation works.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Played for 30 mins and its quite buggy, sometimes customers just walk around indefinitely doing nothing, also when I sprayed a smelly guy with air freshener it wouldn't let me put the can down afterwards",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game has two main problems. The first and biggest problem is that the in game economy is broken. If you don't sell the most expensive item you unlocked and only that item, you are shooting yourself in the foot. Your daily profits will tank if you try to have an actual tcg store instead of this soulless min max machine with a bunch of counters with warehouse racks next to them to restock as quickly as possible, all located next to the entrance.\n\nThe second biggest issue is that opening card packs is boring. Why should I care about cool or rare cards when all they give me is some money. Would be way more fun if I could actually use them in a playable card game and I imagine the dopamine people get from obtaining these rare cards would be way higher.\n\nInstead the developer chooses to distract themselves with adding minor functionalities that don't really add any meat on the bone or fix the broken economy. Feels like they are hiding from the actual problems and don't have the talent to implement what this game actually needs to improve.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This review is from a standpoint of an achievement hunter. As a casual gamer its probably fun to a degree. Building your own shop. Spraying your customers with deadorant cuz all tcg gamers are stinky. If you wanna chill this game is probably good. As an Achievement hunter its very tedious. I already finished it at 100%. The only thing keeping me for like 50h was getting my shop to LVL 100. It took such a long time, doing nothing, waiting for the day to end. Recently new Achivements got released. After reviewing them i started crying. 500 Mint Graded Cards??? Just another ,,DO this for 10 years\" achievement. \r\nCasual Review 6/10\r\nAchievement Review 4/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unable to organize an event, stuck at that part of the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my stupid game wont fix itself, when i open a card pack my screen freezes and i am unable to do anything but restart my pc to leave the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is broken cannot play it anymore loading game nothing works starting new game nothing works devs have killed this game with bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The latest update has made the game terrible, cant move anything that you place down, cant change flooring walls ceiling, just not enjoyable at all now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lost multiple save files, files got corrupted cause of this game, pc randomly shuts off and no one can help.\r\nthis is the only game in all 100+ games ive played, and keeps giving issues. would not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game after 15-20 hours repetitive. Developer has road if that plan completede there could be less repetitiveness. I have hopes for this game but For now it is negative to me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i love simulator games, but this one is only designed to be successful at the start. the RNG economy which is designed to overall go down while costs go up, mean that eventually its impossible to progress. FIX THE ECONOMY in your game. As is now, this game is technically \"unwinable\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was a lot of fun and did a lot of work to get to lvl 115 but now the game is unplayable. Several items have been added creating issues with lag. Loading takes forever now, crashes to desktop and lag makes it a nightmare to try and run the store.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "basic game that cant get the basics right. you send cards out to get \"graded\", DO NOT EVER SEND CARDS FOR GRADE, 6/10 contracts just get removed.. I guess my cards got trumped!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no major updates but dont worry the $40 plushies are coming out!\n\nabandonware, avoid.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "in the current state of the game its trash. \ncant open a single card pack. \nthis bug was present in 2024 and its still here today",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is another one of those asset-flip slop games that a bunch of youtubers played for like a week and then moved on from, and is EXTREMELY similar to grocery store simulator, which was much of the same. Though the gimmick of opening card packs is pretty cool, pretty much all of the game's artwork is AI generated, which is deeply disappointing. The game is really only playable long term with mods and the game is constantly recieving tiny updates that break said mods, and the community is not active enough to update them in time, so most of the best mods for this game are now unusable and may never be updated. Without mods, it is an UNBEARABLE grind. The character models are ugly and the customer's ai is horrible and they get stuck constantly, everything is way too expensive and profit scaling is janky so you make almost nothing, and most items are locked behind a level system that takes literally like several hundred hours of going AFK to max out. You'll play this game for an hour and not play it for six months. Not worth the money and painfully low effort. Save your money and don't support AI art.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An insane waste of time.  This is a simulated minimum wage job.  You could be leveling up your life, fam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why the hell their so many stanky ahh ppl",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i dont like the game any more",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So I am having to regrettably give this game a negative recommendation, as it is a different game from what it's title would lean many to think it was.  I held back on giving this review as I was hoping some things would change (as many things tend to improve through an EA), but it's direction has completely leaned away from what I was looking for\n\nTCG Card Shop Simulator is a \"pack opening\" simulator, NOT a simulation of running a card shop.  It's systems are hyper exploitable once you understand what those are, and there is a portion of players on its discord that shout down anyone thinking it should be less so.  If you tried to run your shop with any sort of legitimate business acumen (things like diversifying your products and offerings, or trying to offer deep selections of similar products) the game actively punishes you for it.\n\nMuch of this comes from the fact that it's designer is bringing a game concept over from the mobile side of gaming.  This game's predecessor was just a \"big number go up\" style shop simulator, where you are always just better off offering large amounts of the most expensive products, and ignore everything else.  As one could imagine, if this was always the best thing to do, no one would sell anything other then Lamborghinis anywhere in the world.\n\nSo if you just want to collect fake cards and have a game built to where you can easily exploit it and open up thousands of packs of cards, then this game will suit your needs.  If you were hoping for a game that felt like you were running a card shop from the 90s or 00s, this is not going to sufficiently simulate that.  The sad part is, it could have easily moved closer to a center point, with the pack rippers loosing very little, but having to actually manage a card shop was not something some of the early adopters wanted to do.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "came out over a year ago. promised an actual game to add to match just collecting cards. They added a bunch of decorations and card grading instead. If you want a pack opening simulator go for it. Its a mid simulator game with minimal options",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "To me, I feel like this is the PERFECT game if:\n\nA) You're just a stoner who's stoned all day every day, and never leave the house.\nB)  You're going through a tough time, you're depressed, and you just want something to keep your mind off whatever is bothering you. \nC) You're the type to have an idle game playing in the background while you work and like to alternate between work and gaming.\n\nIf that's the case, you can do no wrong getting this game at a discount. It is absolutely perfect for you if that is the case. \n\nTo anyone else, avoid this game like a plague (unless it is on a deep sale and you're a game hoarder who wants to add more backlog of games you don't play).\n\nDon't get me wrong, I very much enjoyed the game. But halfway through, it really does become a wait and wait type of game as the things you can do become very limited, repetitive, and just plain old boring - and worse, frustrating.\n\nTo add to it, i don't really see why this game is considered early access? Like, seriously. Where else can you take this game beyond what is already given? Yes, you can add QOL mechanics and whatnot, but there is little room for a major expansion or a marked improvement in gameplay systems that will make this ten times better than it is.\n\nThis feels like the full release, and any updates is just that. Minor improvements and fixes to improve the games QOL. But I doubt it will go beyond what is already here. \n\nAnyway, I can't recommend this because there is no \"neutral\" or \"mixed\" option and I truly believe that the gameplay loop is not for a lot of people once you hit x certain amount of hours. You literally have to be a person with nothing going on his life to enjoy this game as half the game is waiting, and waiting, and waiting.\n\nNow, I might change the rating down the line, but as I looked at my shop at Day 190 with this amount of hours of playtime, I decided that was it. So I had my employees restock the store, placed all my ten graded rare cards in a large wall displays and lower tiers on shelves, and essentially \"completed\" the store with everything fully stocked and placed accordingly.\n\nBy the end of all that, however, I find myself saying:\n\n\"Well, this game felt like a waste of time.\" \n\nSo I promptly fired all my employees and turned off the lights. The store is now a museum with prices jacked up to 2,000% above market price, forever left in its pristine and restocked condition, likely never to be opened again until I reinstall the game.\n\nMaybe one day I'll feel differently, but after all that, I just didn't feel satisfied. I just felt like I wasted my time.\n\nDoes it means its a bad game? No. Not at all. This is a good game. But it just doesn't feel satisfying. Maybe that's fine for a lot of you, but I'm pretty damn old now with fortunately time to kill during my time with this game, and I definitely felt like that time wasn't spent well.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "[b]Too much of a time sink for me...[/b]\n\n+ Definitely gives a somewhat accurate impression of what I see in reality with card shops. \n+ Its enjoyable to rip packs and hope for a good pull to turn around and sell\n\n- The pacing is far too slow...  ~30mins to unlock a small upgrade\n- The logic doesn't make sense. You have to purchase a license for each and every product in order to purchase that product? That's not how licensing works in reality.  \n- Sometimes a customer will come in and want to sell you a card, but its ridiculously random... like at the start of the game offering to sell you something $5000+\n- Mods are almost a must have to Speed up the amount of time it takes to open a packs\n\n~ I think the game would be more enjoyable if people came in offering to sell you larger collections, and then maybe having to sort through it. Generally card stores in reality make a large amount of their profit by buying collections from customers including bulk. \n\nSide Note: I have absolutely no idea how this game got so popular, I feel like it was a weird time in history where there was nothing new releasing and pokemon was at a all time high in popularity.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Decided it was necessary to update the review after new findings.\n\nThe early to mid game is great and addictive however there are 2 major issues with the design of this game and I'll get to both of them now and why I don't believe this game deserves a positive recommendation. \n\nLeveling:\nEverything in the game is unlocked by level 80 and getting there is a slog but doable, shop products are unlocked at a steady pace always keeping you busy. The real issue is what happens after level 80. After level 80 all there is to unlock is warehouse space, space that is valuable so that you can add more card opening machine that open card packs for you while you're doing other tasks. The final warehouse space upgrade is unlocked at level 115. Getting from level 80 to 115 to unlock the final few warehouse space upgrades is INSANE, to the point that it's the most extreme case of game padding I have ever seen. XP required per level needs a huge reduction as the amount of hours  required for a single level up is beyond crazy and it only gets worse requiring more XP the higher your level.\n\nCollecting All Cards:\nIn order to complete the game you have to collect one of every unique card in the game, this starts off as a fun task that is ongoing since day 1 and is mostly just at the back of your mind while you develop your shop and grow your business. However, you eventually get to the point where everything is unlocked, your shop is fully developed and you focus on the final task in the game - finishing your card collection. You will quickly come to the realisation that the system is horribly designed. Collecting cards needs a huge overhaul or fix. To put into perspective exactly how bad the grind to collect all cards is I'll give you my stats. I've spent the last 6 hours straight just opening card packs and I'm still missing 1 card from a common pack, still haven't pulled it. I've opened 390,000 card packs in total throughout my playthrough!!!...and still missing 80 cards to complete the collection and this is with mods that allow me to open hundreds of packs a minute. What an absolute joke this is! Just imagine if I wasn't using mods to speed this up if even with the mods I'm still nowhere close after opening 390,000 packs! Card drop rates either need to be dynamic in the sense that the odds increase as the number of missing cards decreases or another method of obtaining cards should be introduced. \n\nThe hard truth is that this game doesn't respect your time and expects you to slave away in a mindless grind to complete it.\n\nIf these two huge issues are fixed I will change my review to a positive one because on the surface there is a great game here, it is insanely satisfying and addicting, the hours just fly by playing this game - it just doesn't respect your free time in any way unfortunately.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Despite being loaded with assets, the game is still empty. Unlocking new tiers of items is lackluster and doesn't change the gameplay loop at all. Customers have zero personality or options for interaction. The inflating cost of each tier felt like an idle game (with commensurate minimal ROI). I just didn't find it fun; less so as the game went on.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Wait for the full release. The grind is terrible. I understand rare cards but I've been playing for 78 hours and have not seen one super rare card. Nothing close to what I've seen in YouTube videos. So if you do play this game it needs to be modded.\r\nCustomers will get stuck in walls and reloading the game doesn't fix it. Workers are slow even the ones that are labeled \"Very Fast\". Workers also don't have set stocking jobs so they will all go to the same box. Some popular items only come 2 in per box which makes stocking and storing difficult.\r\nStinky customers will chase away your other customers before going into the store. The card trading with customers needs a huge overhaul.\r\nI guess I could keep going on, but I guess it's safe to say it's a grindy mess right now. Buy at your own risk.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "meh... repetitive and almost no decisions. Maybe tolerable if there was a 5x speed button.\n\nI liked ripping packs like a gremlin tho.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I personally found the game extremely boring and repetitive, although it seems I am in the minority in this case. After a couple of hours you have experienced everything the game has to offer. The game feature very few and monotonous actions; restock the shelves, change prices, checkout, open packs. Even these mechanics are mostly eliminated after hiring workers, leaving only opening packs, which is incredibly slow and tedious without modding the game. The cards themselves feature no gameplay benefit or mechanics outside its financial value, making them more so glorified stocks or assets than unique cards. you'll spend most of your time opening packs staring at the corner to see how much they are worth, as its the only thing that even matters. \n\nAnother issue is how bland most of the games merchandise is, as in, items you sell in the game for profit (not irl merch). Most are simply reskins of already existing products in the game, such as different coloured deck boxes, different art on playmats, books with different covers, etc. as such, they only have value as much as they are valued.\n\nFrom what I understand, a lot of the appeal of the game is opening the packs, which I struggle to see how that can be enjoyable. The cards in the game are essentially knockoff pokemon, with none of the chase cards being very interesting. All the cards have full-art or foil variants, but the thing they lack is any form of alternative art or design to chase. This issue is only more noticeable when unlocking destiny packs, which are identical to the base version, the only difference being the background of the card, and its value. Besides those, the cards are visually identical to the base set, even have the same cards at the same rarity. The only chase cards are \"ghost\" cards, which happen to be the only alternative art in the game. \n\nUltimately, the game is lacking in meaningful progression, which is an issue in \"number-go-up\" type games. Numbers getting bigger is not engaging if there isn't a purpose or benefit to increasing those numbers, which results in a game of mindless and repetitive progression, for no other incentive than to maybe look at some pokemon card knockoffs. If you are still interested in the game, I recommend purchasing the game on sale, and keep in mind that if you don't like the game within the first hour, you won't like it 50 hours in either, it is the same game, and nothing really changes between these timeframes. I would also recommend modding the game with fast pack opening, ArtExpander and a reskin of the existing cards, as seemingly the modders have more interest in designing a visually appealing game. Retexture mods exist for all of the big three card games (Pokemon TCG, MTG, YGO) and others, such as Dragon ball, hololive, and... gooners apparently (don't turn adult content on in nexus, I'm warning you). Some improvements to the game is having more varied card art, more purpose in collecting or displaying cards outside your own enjoyment, such as improving popularity by displaying cards, or maybe having ranking that compete against other stores? \n\nObviously, if you are reading this, don't take my words as gospel, as this my opinion and analysis of the game. Buy the game and try it yourself. If you don't like it, refund it within the first 2 hours, otherwise you might find a game you really enjoy, but alas, as a connoiseur of simulator slop games, I cannot recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I do enjoy this game HOWEVER and thats a huge HOWEVER. my save files have been lost to the shelf error twice and the last time was my 250+ hour save after getting a new computer and trying to boot it up to continue getting all the achievements. it is very frustrating and has left a sour taste in my mouth about this game as a whole",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its just meaningless busywork with no payoff. when a game makes common cards rarer than ghost cards just to prevent you from completing the set in order to keep you playing longer... thats bad game design. I shouldnt have to open 5000 cases of basic packs to get a couple of common cards (which i STILL havent gotten after weeks of play.)  I give up and uninstalling. too bad i cant refund",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "On the surface it's a really interesting concept. And the first few hours got me hooked, not gonna lie. However, once you reach a certain point - and for me, that point came rather quickly, it gets frustrating and uninteresting. It simply lacks the depth to warrant and longer-time-play because the basic game loop at this point is simple and shallow. It turns into a really grindy slog.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is a tad bit buggy, it is really fun i will admit but i was at day 36 yesterday and when i cam on to play today exited to upgrade my store and grade my good cards it put me back to day 24 and im really upset by this because it takes quite a while to get through in this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is too far removed from reality to have \"simulator\" in its title. It's an idle game with a trading-card-shop theme. I put a lot of time in looking for a game that just isn't here.\r\n\r\nCustomers come in who stink, and this upsets your other customers. As a shopkeeper, you're expected to install a machine that detects odorous guests and hoses them down with deodorant. Just like in real life.\r\n\r\nWhen you go to buy products, first you have to buy a license for them. The license gets more expensive as the items go up in level. This means that you'll pay a few hundred bucks for the right to sell Adventure Comic 1, but tens of thousands if you want to stock Adventure Comic 12. \r\n\r\nOnce you've bought the license, you can buy the product at wholesale prices. Sometimes, you can buy products in two lot sizes (pack of 32 or pack of 64), they're always exactly the same per-unit price so you don't actually get a bulk discount. Also, if you buy a pack of 8 red deck boxes and a pack of 16 red deck boxes, you're not allowed to store them on the same shelf. Just like in real life.\r\n\r\nYou can hold up to 8 packs in your hand, but only 1 of anything else. You also can't do anything with anything in your hand except put it back on a shelf. You can only get boxes from emptying out product orders (if you buy a 32-pack of cards, and put them on a shelf, now you have an empty box you can work with). But despite the necessity of having a box to do any kind of inventory rearranging, you can't just produce a box. Fortunately, you can't store empty boxes in your warehouse. Did I say fortunately? I meant \"for some insane reason.\"\r\n\r\nI was hoping to glean some insight about how card shops work, how prices are set, how demand is calculated, maybe get a sense of how many boxes of cards a real shop has to sell in a day. Instead, I get a game centered around what feels like a child's guess at how a retail operation works.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Played for 30 mins and its quite buggy, sometimes customers just walk around indefinitely doing nothing, also when I sprayed a smelly guy with air freshener it wouldn't let me put the can down afterwards",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game has two main problems. The first and biggest problem is that the in game economy is broken. If you don't sell the most expensive item you unlocked and only that item, you are shooting yourself in the foot. Your daily profits will tank if you try to have an actual tcg store instead of this soulless min max machine with a bunch of counters with warehouse racks next to them to restock as quickly as possible, all located next to the entrance.\n\nThe second biggest issue is that opening card packs is boring. Why should I care about cool or rare cards when all they give me is some money. Would be way more fun if I could actually use them in a playable card game and I imagine the dopamine people get from obtaining these rare cards would be way higher.\n\nInstead the developer chooses to distract themselves with adding minor functionalities that don't really add any meat on the bone or fix the broken economy. Feels like they are hiding from the actual problems and don't have the talent to implement what this game actually needs to improve.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This review is from a standpoint of an achievement hunter. As a casual gamer its probably fun to a degree. Building your own shop. Spraying your customers with deadorant cuz all tcg gamers are stinky. If you wanna chill this game is probably good. As an Achievement hunter its very tedious. I already finished it at 100%. The only thing keeping me for like 50h was getting my shop to LVL 100. It took such a long time, doing nothing, waiting for the day to end. Recently new Achivements got released. After reviewing them i started crying. 500 Mint Graded Cards??? Just another ,,DO this for 10 years\" achievement. \r\nCasual Review 6/10\r\nAchievement Review 4/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unable to organize an event, stuck at that part of the game",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}