{
  "positive": [
    {
      "review": "Alright, I've put in 250 hours at the time of this review, and still I have not lost my love for this game. In fact my love for this beautiful creation has only grown 100x stronger. The time is now before we all reverse.\n\nIt's already the most hours I have put into a steam game in easily the last ten years or more so that's saying something. (yes it's a big part of my life)\n\nI've played a few different gacha games, and I do enjoy the whole aspect of buying things and leveling characters, and getting cosmetics etc. I'm a sucker for that kind of stuff and love to get sucked in cause it's just a lot of fun, but this one is so much different than any of the others I've played.\n\nThe thing that first caught my eye was the style of the art. It's so unique compared to anything else I've played. It's like a really dope anime series. You can tell the creators really put some care into this. \n\nThe story and the characters have so much depth and everything connects so perfectly. The whole theme is very interesting to me. I really love how they use real life timelines in human history, and add in so many cool events and people and information throughout our existence. It even led me to google certain things just to learn more to have a better understanding of significance in the story. I did not expect this type of game to be this well done. It is now my most favorite game. For that I absolutely feel that spending some money is more than reasonable. I also feel that the game makers are more generous and fair in comparison to others in my experience.\n\nI really love the whole reading a book feel of the game. I can play this far longer than any other game. It's like reading an amazing book with sick artwork high quality voice acting and cinematic music. I've gone 14 hours straight some days, and I feel compelled to keep going because I want to see what happens next. Not like other games where I get worn out after a couple hours and have to get up and move around. Some of the chapters really got to me emotionally as I really felt a deep connection to characters and empathized for the pain or trials they were going though. Being able to go through specific characters side stories really strengthened my connection with them as you get to see why they are who they are based on where they have come from and trials they have been through. I believe the real difference (for me at least) is how it feels like you are reading a book, and not playing a game. I think that visuals only offer so much where as you get far more when you read something. It's just something else entirely.\n\nI feel like even if you don't spend money you can still enjoy the entire story which is kind of rare for a gacha game. Usually you hit paywalls so hard that you have to spend early to just be able to continue the story.\n\nNow if we touch on the fighting battles RPG aspect of it The system is very Intricately designed. It requires a lot of strategy and planning to form effective victorious strategies. The correct combination of characters will cause them to feed off each other and make you even more powerful. It requires much learning and reading. I think it's brilliantly done, and It doesn't feel like it gets stagnant or old where you find yourself just becoming numb and wanting to rush through as fast as possible becoming a robotic chore.\n\nIf you are into a slower paced visual novel with in-depth story telling, and unique characters, cool artwork, music, excellent RPG battle system, and great voice acting. I would 100% recommend this. You will be happy you became a part of this unique world.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Aside from Arknights and maybe Genshin Impact, this was by far one of THE BEST gacha games with the most compelling stories and world building i've ever had the pleasure of reading, give it a shot if you enjoy literary references, characters speaking their native language and accents, an oil painting aesthetic, and a cast of characters that AREN'T falling over for the MC and declaring their undying love for her (nothing wrong with those games, but sometimes it can be a BIT too much, looking at you Cyrene HSR).\r\n\r\nIt also helps that its a very casual experience, dailies are done in 1-3 minutes, and you only really need 1 solid team to clear everything the main story has to offer.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "This game is so good words cant even describe how this is so good. The story,the characters are extremely good. The game is so unique and even tho i recently started playing it. I really don't regret playing this game!! I recommend trying this game out once.\n\n\n\"Don't forget my heart..beats...on..the right\"",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Came for the \"haha bri'ish gacha\" memes.\nStayed for the great story and amazing visuals.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The first time my eyes laid upon this game on Qooapp, I fell in love with it. For its artwork, music, but most importantly, for its story plot. I like history and games with theme similar to Assassins' Creed when characters can travel between eras, reminiscing important aspects that became the pinnacle of those eras. Reverse 1999 has been doing a great job in that, esp as a gachage that commonly known as a game that doesnt really have a good story or even a story to begin with. (I mostly play on mobile and only use steam for the HD home screen wallpaper only WWWW)\n\nIt's a perfect game for casual because unlike any other gachage that emphasized meta or specific gacha characters just to clear main story without malding, you can clear basically almost any content (not all) in auto (yes, auto battle) not just with S rarity characters, but you can even clear it with only lower rarity characters as long as they have synergy and your characters already strong enough. That's what I really like from Reverse 1999 because it didnt emphasize character monetization that much (e.g. to clear part X, u need to use specific x tactic or use x characters with certain dupes, etc).\n\nThe only regret that I have is that I personally dont know where to spend my money because I dont like the skins (or how Bluepoch implemented skin system in the game). Let say, I buy a skin, it came out with a good background art but it will never projected into your home screen because your home screen always projected the suitcase living room (or, gathering room, u name it) which make it a waste. Only the character's costume that get displayed in the home screen. It's not a big deal ofc, but it's just personally I like the skin background also projected or changed the home screen background, too, alonside with the character's skin. \n\nOverall, It's really a good game, hasnt disappointed me yet, and the story is getting stronger and gripping. I cant wait for the next chapter update. Even if the gameplay kinda boring for some, you wont get bored with the story and you wont' be sorry for trying or giving this game a chance. For me, It's one of a kind gachage for now.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "BRO THIS GAME IS SO GOOD ??? i prob have more then 100 hours of playtime but thats because i used to play on phone but the characters are amazing you get so much things for free i have always been f2p excluding 2 garments i paid for but thats ok this game is so good i could talk about it for so long best part of the game is medicine pocket just existing please more medpoc content and also did i mention the story and voice acting its so fucking good it makes me foam at the mouth and jump up and down and frolick in fields omga this game cures my sickness and makes me smile i log on everyday because i love this game so much pleasepleaseplease play it PLEASEE i beg you wont regret it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "truly one of my all time fav game ever and dont get me started w the art style oh yummmm\nand the whole vibe and good lore that it had is genuinely beautiful\nif anyone still thought abt playing it this is ur chance.. give in,, yes.....",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's really vcery beautiful and contains loads of story, but I found it too time consuming so I had to stop to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i played for schneider but this game is really good, the story is something that i look forward every update and all the lovable characters. i do find myself looking forward to seeing a character's story due to how the game makes them feel entertaining. playing this gacha game doesnt make me feel like im in an abusive house hold where i come back every day just to get my dailies. the rewards are plenty and the pace is also really good for any casual players and im glad i dont feel forced to play every day in FOMO. anyways i love schneider greco from r1999 and BLUEPOCH BRING HER BACK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gacha but make it fun. Good story, fun turn based combat, in comparison fairly f2p friendly.\nMost banners offer guarantees early on top of better base chances so even if you're starting out, it doesn't take to long to get something going.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love th art style, its a turn base game so you can just leave it on and relax, good for spending time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games i've ever played. the visuals are beautiful, the voice actors did their thing, and gameplay is challenging, detailed, but still fun. Even though it's a gacha game, any character in the game is promising. the rates are fair and it's easy to collect, level up, and draw. the storyline is AMAZING. I love everything about this game, seriously. It deserves to be even more popular than it already is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really good game -been playing since global launch and l like it a lot. The graphics, voiceover and storylines are all high quality. You get frequent updates with new or rerun of old characters. The game is free to play, although there is a gacha system, though the resources you get is quite generous and can easily save 40-50 pulls per version by simply logging on for 15 mins a day. The storyline is very rich, and I find the frequent philosophy references really appealing. Absolutely will recommend this - there is almost certainly character that you like in the suitcase.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really relaxed turn-based gacha which has the best feel to it and is generally pretty great with representation and doing in game collabs(the storyline around Brazil is an exception to the rule.\r\n\r\nI'm a day 1 player of the game and can say its worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 game! My friends and i have been playing for a little over a year. It has a perfect mix of heavy topics and comedy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely a great gacha game, focuses on the story and characters.\n\nLore, characters and the overall world feel, just hits you with a \"God I wish I was there.\" feeling.\n\nGameplay a simple card system where what you can use is base on the characters in your team, with the right team build. You can abuse the, often times, broken combos it has.\n\nAlso, every major events or normal event, there's always a minigame that comes with it. It's gotten to a point where I wonder if they'll add a UI in the menu where you can access all the past minigames released so far.\n\nGacha rate, so far, grinding for the currency to pull a character is very fair. Bever had to use money to buy any pulls and the banners eventually rotates back to characters you may have missed. Overall, pretty good.\n\nCostume/outfits for the character, actually great. The alt character outfits in store was made with care, I actually DID ended up buying some of it.\n\nOverall, Reverse;1999 was a game I thought would be a basic gacha game, What made me stay with this game since launch, was just the world and characters that Bluepoch has created.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best gacha game I have ever played. The writing and character design is top notch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it, simple as that.\n\nUnique characters, beautiful story, wonderful ost and voice acting, an actual mc with personality. The gameplay can be kind of a hit or miss, it's a card game. Very f2p friendly, the events often rerun and are added permanently to everybody play afterwards.\n\nIt's the only gacha that I committed, started for Isolde, stayed for everything else.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I literally love this game so much. It has one of my favorite art styles and a very intriguing story. I love you Eternity :heart:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has excellent art, voices and a good f2p economy, totally recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing art, great story, great music, and overall pretty free-to-play friendly. Devs seem to care, and it shows in the game. Been playing it for over a year, and don't think I'll stop anytime soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game for quite a while now... Gotta say, it's one of the best gacha games out there. You can tell the developers love it by the amount of work they put into the story, characters, voices and character buffs. My only complaint is that there are never gonna be enough resourses to level up a character, but other than that, it's super awesome. Go, Bluepoch!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dont look at this game as your usual gacha.\nThis is a game crafted with love and passion.\nIt has beautiful OST, a touching story and interesting world. Also beautiful visuals and characters.\nYou get all of this for free, there is 0 pressure to spend at all, only if you want to support the developers.\nSure there is a gameplay but auto-battle got you covered, so you can go back to enjoying visual novel.\nWould recommend everyone who likes to read.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came for girls kissing, stayed for the philosphical statements about conflicts between rational humanity and an irrational universe (Laplace); intention and outcome (Vienna) and; subjective assessment and objective worth (Aperion).\n\n[i] Please, enjoy. Even if the world ends tomorrow, we still have a show to watch. [/i]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting stories and beautiful illustrations. Unfortunately the localization is bad in the first chapter, not great in the second, but after that it's fine and the most recent side content doesn't have any translation issues. The combat/teambuilding is kinda complicated, but the MSQ content isn't too difficult. The gacha feels reasonably fair. There is a TON of content which is a little overwhelming as a newer player, but it's not a bad thing at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h3]Recommended 👍[/h3]\nReverse: 1999 is a really fun and beautiful game. The art looks amazing, and the characters are very well made. The story is interesting and easy to follow — time is going backwards, and you try to figure out why.\n\nThe battles use a card system that is simple to learn but still enjoyable. The game also gives a lot of free rewards, so you can play without spending money.\nAll previous events are later added pernamently to game in sort of archive, so new player can still experience all story.\n\nIf you like good stories, great visuals, and relaxing turn-based gameplay, this game is worth trying.\n\nI play mostly on my phone, but I usually do story on steam to better see",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best Gacha games out there\nFully voiced \nCharacters are all interesting and fun\nStory is great ALSO FULLY VOICED\nThe music is dramatic and epic\n\nJust all in all 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Reverse:1999 good game. I play, I enjoy, I question my sanity sometimes. Game let you collect characters by… putting them in a tiny suitcase?? Very normal behavior. Totally healthy. They just sit there smiling like ‘yes thank you for storing me like a travel accessory.’ Story fancy, visuals pretty, combat clean. Gacha sometimes punch my soul but I forgive. Overall? Good game. I like. 9/10 magical suitcase inhabitants. (Love nautika so much)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have very little time in it yet, but I'm already captivated by this game.\n\nExpect more as I sink more into it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best gacha game ive ever played.\n\nGameplay looks simple but is actually complicated.\nStory and characters is one of the strongest aspect in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed this game and the story thus far! (even if for some it's not their cup of tea) My favourite characters are X, Marcus, and Voyager (my \"children\" lmao) and I REALLY like the designs and the concept of time and eras and such for the story. Despite not being an originally English game, it's still really good for translation as far as I'd see. idk what to say i'll be fr, i love the story plot, characters, and the good ol' gacha gambling",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of the most artistically beautiful gacha games I've ever played. The vibes, the music, the setting, and the characters are, indeed, truly immaculate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I know this game is gacha but the story has moved me and I can't stop thinking about it. How did this happen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, interesting story, but misses the opportunity to insert more artwork.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im not that far into the game to give a really detailed review but what i can say its that its a different experience for me. I was really confused at first but continued on, im starting to grasp the idea of how the game is layed out. I really enjoy the art! the sound track is one where it will not get annoying to where you end up turning it off in the settings lol Im starting to enjoy the story and the turn based battles.\r\nif you are looking for something that has a backstory and grabs your attention that way, please do not hit skip lol not recommended ;) but this game as far as i can say, i do recommended you give it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll eventually take the time to make a full review, because with the ever changing content of this game, dear lord will it be something to fully dive into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The female characters are lesbian.\nThe male characters are mentally ill.\nHey, it's pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Visual and narrative masterpiece. The game's voice acting/direction and translation improves so much after the first few chapters, which shifted my at first negative impression of it. \r\n\r\nThere's amazing quality of life features and quick daily logins. Power creep is a bit of a problem + the global region is behind China, so you'll experience everything later and can get spoiled easily. Important main story details are locked behind past events (you are able to unlock and view them in-game), which I don't like. \r\n\r\nToo much stuff going on in the menus, entire aspects of the game that become useless once you progress. Gameplay wise, all of these different modes need to be cut down and only the best ones should stay. The way many gameplay things are called is confusing and unclear, they went for a more artistic approach when naming them, which is fine, but even after playing for so long I can't remember what's what.\r\n\r\nDespite its issues, it remains one of the best gacha games, practically unrivaled in art and design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A gacha game with a surprisingly strong story, beautiful art, and a truly welcoming free-to-play experience. Even without spending, you can advance smoothly and enjoy the full content. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best story and world building\nEnd game content is not that difficult\nBut, the rerun schedule is like a shit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "words cant express how much i love this game! it's literally one of the few gacha and turn-based games i can actually tolerate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best gacha games i've played (top 3 favorite behind limbus and arknights)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game im addicted to gambling but my friends refuse to get this because of storage issues whicxh is pissing me off someone get them new phones or pcs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good gacha game with good design on the characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The translation in the first two or three chapters is quite rough but gets better quickly! The story is great and the game is very very f2p friendly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want to play a gacha with great art, character design and story, this is a game for you. As far as the gacha system goes, this is one of the better games I've played. It has a \"good\" pity system and gives the player a decent amount of currency. Of course, this is a gacha game, so as a f2p player, you do have to think carefully about what you want to pull and plan ahead.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A gatcha game that respects your time and does not require you to whale on characters to progress or complete challenges like other gatchas.\n\nThe stories and art grown on you but may not be for everyone.\n\nOnly complaint is reused assets in stories. They seem to have assets in promo videos that never make it in game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Started playing on mobile around release and if my hours were transferred I'd be scared to look.\nHas a very unique and pleasing style that sometimes all I do is look at character outfits lolol.  Story starts of smooth then sucker punches you in the gut, skull and tear ducts.  Also one of the nicest gacha systems I've experienced.  \nWish I could experience Chap 2-3 for the first time again. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing design and story. Yes, the gatcha is a pain at times, but Reverse 1999 is actually very generous for free players. Been playing since it went global in 2023 and still loving the story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game caught me by surprise, it requires you to pay attention and the music, the style and story are captivating.\n\nStarted because of a collab,  staying for the story Mostly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "during the 2nd aniv i tried very hard to get lucy on the rerun as i couldnt when she first dropped (didnt get her) but the game its great the turn based card battle mechanics feel much better than most games and the artstyle is one of the best in any gacchas out there. def play it here on ur phone it runs great on phone too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive been playing this game since it came out and I love it so much I love the character design and game play!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played through the first 5 chapters. Writing and Presentation is pretty compelling, but it gave me a feeling that the writers had to hold back on darker themes in the story. Atleast characters aren't solely \"good\", but some can be assholes. Game's MC Vertin has [i] some [/i] personality, but it slowly moves into a boring trope in the middle of chapter 5. \r\n\r\nI think the gacha elements are whatever. Gacha is gacha, and I have nothing good or bad to say about this aspect. I just wish the UI was simpler with less overall moving images, cuz it feels like a visual overload at times. Art is gorgeous tho!\r\n\r\nI'd recommend checking out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games ever. The characters are so good-looking and the story's very interesting ! I fell in love with Aleph <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game, the only gacha I can recommend because it's first and foremost a visual novel, so, if you like reading and diverse stories that includes references to actual art, music, culture and science, then, this is a perfect game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can't recommend playing enough\r\nI have played since global launch, with over 200 hours on the mobile version; so while I have never left reviews before, I feel qualified to inform.\r\n+ Great gameplay, not too hard to get into but even I have yet to master it. the rules are simple, choose 4 characters, play some cards, deal damage to win. In story stages that is enough to get by. The complexity comes with the harder, but optional, stages where difficulty purposefully spikes. There is where you see how one character may be useless alone but synergies so well with a few others that it breaks the meta. Or one character may be busted in damage alone, but lacks the synergies to keep up. \r\n+ Great story, I hear that some people find themselves confused at times, which is likely due to most background not being explicitly stated most times. Trust me though, if you just flow with it everything will either make sense, or the part you were hung up on will stop mattering.\r\n+ Gacha is pretty fair. 70 to soft pity, 140 for guarantee rateup. About 20 flat is supplied a month, with another 20 over the course of a version update plus however many from the new story section. It is admittably far from guarantees every version but as a F2P (unless you include cosmetics, which I have bought quite alot) I have managed to get most characters I wanted as they rolled out.\r\n Reverse is far from perfect, I still feel uncertain about Nautika's story, but I would still recommend this to anyone looking for a good gacha.\r\n Oh, and theres almost no sexualization of any of the characters, if that matters to you. Closest that I can think to that is that 3 (of the over 100) characters have what I would consider disproportionately large breasts. They aren't even main story characters though, and they aren't ultra sized or anything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good game, loads of content and awesome character designs/scenery. An interesting story that is filled with voice acting out of a closet. Still I think it adds to the charm more :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While I like the game and the story is top tier, I think this game having a stamina system is holding it back TREMENDOUSLY. You run into walls where you just spend days spending your energy doing nothing else but replays of episodes for a sliver of resources for your characters. I don't mind it being a gacha, but the energy system is horrid if you want to spend time actually playing the game and the game basically tells you to stop and come tomorrow.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like voice acting and character design, I recommend this game to play casually. i personally spent $30 for limited skins or the second award which does help for pulls. i didn't spend a single dollar just for more pulls outside it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, relatively easy game to play. doesn't really need you to spend money to pull for characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love it so far, the story is amazing the characters are very good, the combat can get a bit repetitive, especially if you fall into gacha pitfall and get the same character, unlucky, I guess. Can't bush the gacha too hard, almost all in standart and faraly generouse, so it doesn't determ me from playing too much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ignore the community. Play the game and enjoy the story at your own pace. The game itself is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best voice acting I ever herd and the story is real good better than some of the single player game is have a longer wait time then other gacha game but the the story is really that good so I'll wait. I love the art style is like watching a good old painting + anime girl face. the game play is not bad. I just wish I can learn and talk to the character more for example nikke have a bond story for individual character but that's a lot of work I understand. the gacha rate is good I got the character is pritty easy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "visually stunning, the story is engaging and i love the music. i cannot recommend this game enough. the only game i would put above this is morimens otherwise this would take my top place in this genre. also one of the few games ive actually made in game purchases for, not because i needed to but because i wanted to support it. \r\n\r\n\r\n\r\n\r\nI LOVE LUCY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story, great characters, a lot of yuri and pretty fun but simple gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(note: i have played since it released on mobile)\r\n\r\nVery F2P gacha, good amount of content, lore and storytelling are GREAT...\r\nMostly casual, with some challenging optional gamemodes to torture yourself with.\r\nGreat character design and its gameplay is simple but fun.\r\nOne of the few gachas worth spending time on currently, honestly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great for history and fantasy aspects. Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gacha game, that to me doesn't feel like any money grab or P2W. Perfectly do-able F2P. Cool story and interesting characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game and great story for gacha game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game just keep getting better and better. Absolutely love the story, the design of the characters, also the musics as well. I hope that the global can catch up with the CN version :}. Overall great game imo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think it has some rough spots that I didn't personally like and I really didn't enjoy the story that much until the island part of the story. Despite that, there is a lot of passion put into this game and it shows. Wish Non-6 Stars were a lot more viable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ignoring the strange translations in the earlier chapters, the story of this game is fantastic, and the art is amazing. I would recommend you play Reverse 1999 even if you aren't a fan of gacha games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "17 hours-in short impressions game review--\n\n>Eccentric and varied cast of characters (10/10)\n>A character progression system reminiscent of Genshin or Honkai (5/10)\n>Beautiful art style and animations (13/10)\n>Story so far (Dark and Depressing/10)\n>Murderous Prohibition-Era Chopin wannabe (10/10)\n\nTotal 8/10 Definitely try it out~",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played for the gacha, stayed for the lesbian visual novel.\n\n11/10 would read again\n\n\n\n\n\nSeriously though, the gameplay is like fgo? but overall it's pretty mid. The grinding and gacha is like arknights. The story and art design carries this game. The \"English\" voice acting is questionnable at times, and is not even english sometimes, but it's good enough to not make me change to japanese dub. Give it a try if you are into reading hours upon hours of words, but if you are just going to skip, then skip the whole game.\n\nBiggest  negative is the stamina gating, you will be farming for a while when you exhaust the events. It's like arknights in that, it takes a long time to get a few characters to max insight (ascend/promote), and even more to max their skills. Unlike arknights, the dupes in this game also adds quite a lot of power.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the less boring gotcha games because. No copy/paste formula here, so this game feels like a fresh-er breath of air. The story is meh, but the game doesn't take itself too seriously and luckily you can simply skip all cutscenes. The art style is very good. The user interface is intuitive enough to get a hang around after hour or so spent in game. No annoying \"infinite amount\" pop-ups cancer like it is in some other f2p games.\nThis game has such a good quality that I wish the writers took it a little more seriously, \"borrowing ideas\" from Evangelion or whatever other awesome older visual novels, and using that to write a little more serious story as well as using that type character visual designs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A gacha game that has a very positive rating on Steam where the only people complaining are the ones who are mad the gacha game they downloaded is in fact a gacha game, bitching about staples of the genre. What else do you need to know? I've been playing this for a year on my phone and just downloaded on here so ignore the playtime. If you have any interest in gacha games this is one of the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing story and beautiful character designs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i gotta say reverse:1999 is a blast the art and voices are top-notch plus the story hits deep it has a unique charm that keeps me hooked so glad i tried it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "4.5 hours in not that bad  — gorgeous visuals, clever combat, and amazing story pacing. One of the best gacha experiences I’ve had so far.\nThanks Reverse: 1999",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mainly play on mobile so this is not my actual playtime and I am a day 1 player, regardless, its so effin peak, the story makes me cri, pain peko",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pro:\r\n\r\n- great intriguing story\r\n- good card based system\r\n\r\nneutral:\r\n\r\n- it's a gacha, but the developers are rather generous.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "works on the steamdeck, use proton hotfix compatibility mode to get cutscenes working",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Loooooovee the story so so much, the character designs are sooo pretty and I adore the fact they add different cultures and ACTUALLY represent them! <33",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this satisfies my craving for story. i dont usually play gacha games this one is fair.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice story, voice acting and art. I enjoyed playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the character designs in this game are spectacular",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really nice for if you want to have a turn based story game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best gacha game I've played. This is very much a game first, gacha second. Don't even worry about the monetization. Don't need to spend a penny to enjoy the entire story, art and music. \n\n(my Steam playtime doesn't reflect how much I've played it as I play it on mobile primarily)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Peak gacha game with great overall designs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Edit: Found the difficulty wall. End of 6th Chapter has a boss with a recommended level of Insight III, Level 1. Only 5-6 star characters can even reach Insight III, so you'd either need luck of pulling enough 5-6 stars to form a team that can get past that and overpower it, or enough luck to put together a strongly-coherent team to clear it under-par. I haven't had luck with good 4-stars that can be put together well enough, so my only \"strong\" team just consists of a ton of damage rather than being able to utilise something like Bloodtithe or Dynamo. This isn't good enough to clear it at-level, however, so I'd need to overpower my team to get past it in my case, which I can only do because I've had the fortune of actually getting 5/6-star characters to do so with.\n\nThe start of 7th chapter has a recommended Insight II, Level 50 level which is arguably the same thing, since Insight III is almost an expensive \"Level 51\" upgrade of sorts until you start investing past that lock. Theoretically, it should be easier, as it should be roughly the same minus the previous level being a boss. Instead, the Ch7 level was marginally harder owing to the enemies apparently being able to kill an I-III, L-16 character in a single turn from full health, and punish you for using one of the two readily-available damage types. If you lack four members that do non-Mental damage you're going to have a rougher time, and you need to hope they're not also weak-afflatus or they're probably going to get casually one-tapped, given my own team members who has the same afflatus type as the enemy one-tapping her. It's also really, really reluctant to give me any cards of the character with the most investment, making it impossible to get her ultimate off before the enemies shoot off a daze debuff which hit her in all 15 attempts.\n\nEven so this really isn't much of a problem at all because I can just turn the difficulty down. The \"starting\" difficulty of the game is the middle tier, with a harder mode unlocked later on, but you also unlock an easier difficulty shortly after, so I can keep going through the story anyway. The second \"book\" drops difficulty back down because you unlock it much earlier too, so this isn't even a later concern.\n\nSo, eh? Still enjoying it, still a positive review.\n\n--\n\nGacha games tend to sell themselves on two major factors: 1) The initial storytelling to hook the player, then 2) The character designs individually being strong enough to make people want to fork out money for them. It's for reason 1 that I chose to pick up this game just to spend some time- even if I only got a chapter or 2 into it before hitting a paywall, It'd be a good read.\n\nIn the prologue cutscenes before you get access to the game's lobby area, the game did an excellent job establishing most of the plotline and the general atmosphere: It presents itself as focusing on victorian-era london splashed with 'arcanist' magic including a natural magical \"Storm\" that causes reality to outright collapse in on itself and reverse the flow of time in all but specific areas that are exempt for reasons that even the game's characters are attempting to figure out, and it features a tinge of racism between the non-magic folk, the magic-but-sympathetic folk, and the storm-is-ours-to-purge-mortals folk in a three-way argument, rather than trying to pretend there'd be no divisive difference between magic and non-magic folk, or that the division created should be considered acceptable. It's not mincing words or dressing things up- things suck for everyone, and suck for a variety of reasons each. Gripping. Also Regulus- one of the first characters you meet- reminds me a lot of Rin Penrose despite their apparent differences and that's never going to stop amusing me when she speaks up.\n\nWhat I then immediately discovered was lesbians. The game does not have an exclusively female cast, and neither does it throw you a cast consisting half of pretty women and half of extremely strange men- no, there are pretty women and bizarre women, and there are handsome men and bizarre men. Still, the majority of the game's cast is women, and this includes the protagonist. There's some flowery-sweet romance, some butterflies-in-the-stomach romance, and some more direct romance with characters that altogether toy with the concept. Never does it outright state any of this, if you really wish to believe otherwise, but it's still implied heavily enough to be pretty clear. Seriously, at one point you have a cutscene image that's just one of the girl's face filling your screen with a gentle smile as she stares directly into the protag's eyes and asks \"Hold me.\"\n\nI will say the writing is not of the best quality. It's not bad, but it does like to wax poetic and dance around loose ideas at times instead of getting to the point, while other times it seriously grabs you by the shoulders and straps you in. The writing involving the male narrator is, I find, the most enjoyable, with the main story following a close second. Character stories- at least those that aren't tied to the main story outright- fall behind that, then finally the female narrator that takes over for some chapters is probably the weakest link. It does all vary a little bit though, and you may disagree on the order.\n\nOn that note: the narrator. Because the game throws you into the shoes of the self-established character Vertin, who has their own personality, their own moral compass, even their lines are voice acted, the game takes a side-step around exposition. It doesn't give you the oh-so convenient excuse of amnesia or world-hopping that other gachas do to find a reason to have characters temporarily treat you like a child to explain the basics in the middle of every other cutscene. Vertin knows what's going on, even if you don't, so instead there are conversations you can have 1-to-1 with a narrator-like person on the level select screen (some of them are even mandatory), who speaks to Vertin, but seemingly knowingly is speaking directly at you too. They take full advantage of this- Vertin is quite kind-hearted, and as you know nothing of this world yet, you by extension do not know how deep or how cruel this reality can get. They tell you about it sure- the panic of the Storm being at the wrong time, or the sensation of pale horror of someone being oh-so-slightly too far away from a safe zone when the Storm hits and suddenly there's nothing left of them but a dismembered hand, and not to mention how bad humans can get with one-another amid gang wars and the like even before the two magical factions butting heads with mortals stuck in the middle all hating each others' guts.\nSo, you almost represent an optimism point. You're reading the story that, potentially can have a happy ending. You're following the all-mighty protagonist of the story around who will presumably pull superpowers out of their ass if necessary to save the day eventually, right? That's how most stories work. But you're talking to someone who is implied to have survived the Storm many, many times. Someone who has seen and even been in the middle of country-wide wars, or gang wars, of outright torture and has seen enough to take an aggressively cynical state. The conversations you have with them balance the two viewpoints to reach a happy middle, acknowledging that things suck, but things can get better. He will, nevertheless, call you stupid several times when doing so, but he's not unwilling to come around to how Vertin feels- and, in the meantime, drop some convenient exposition in the form of revisiting memories or directly asking questions about a topic ongoing in the main story.\n\nI can't say I'm sure of the financial \"worth\" of the game, but it's been very enjoyable with no colossal roadblocks in the story or events, even as a free-to-play player, which is unlike almost every other gacha I've ever touched.\n\nAlso eating beans is apparently a sin worthy of eternal punishment. As you do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I lovee this game so much, literally the peakest of peak media out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 game from a studio that only makes one game (this one)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "call me a windsong lover cause i love windsong",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, great story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Characters: 10/10. Story: 10/10. My wallet: screaming in 4K.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best Gacha Game I have ever played. F2P Friendly and much better than gens*** or honkers pookie rail (HOT TAKE???).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Joined for 2nd year, game has been a good free to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its basically cookie run kingdom if it was good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When it comes to story i think it's the best gatcha game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good story, love the female prog..",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Unplayable on Steamdeck\n\nBefore I downloaded the game, I looked into the game and its reviews. I heard good things about the game, so I decided to give it a try. My Wi-Fi isn’t the best, so it took a little over an hour to complete the download. Once downloaded, it did its in-game download, then went to the Home Screen after finishing. \n\nThe cons:\nThe game has minimum customization optimizations in the settings, which is really no big deal for me. \nBut the biggest issue I have is once I was ready to enter into the game from the home menu, I would encounter issues with screen blackout and the next 15 seconds of in-game audio.\nI’m not sure if this happened to anyone else using the Steam Deck, but the screen would be black, and I could hear the audio for at least 15 seconds before it goes quiet!\nI was able to move the cursor around, but the game doesn’t respond, even though it does acknowledge my cursor existence.\nI tried resetting the game, uninstalling, and reinstalling the game. I even checked to see if everything was properly installed and not missing. Nothing works, and I’m very disappointed! \n\nThe Pros: \nSo far from my POV, the music is very harmonious, while the art style and scenes are very beautiful.\nFrom the description, the game really has me intrigued, from the characters to the jaw-dropping scenes and story it has to tell! I really do want to play this game on the deck, but for some unknown reason, it just won’t play.\n\nUntil the game can be playable, I will change my review from a thumbs down!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gacha bad.\n\nSo 65 hours played and i've reached annoyance stage. Can't progress in most game modes because they need mostly, if not fully upgraded characters to stand a chance of winning. So now i gotta wait around for months at a time, slowly farm dozens or hundreds of materials and millions of currency until the next roadblock hits or i can just pony up hundreds or thousands of $$ to do shit now, when i want to play.\nSo all that's left now is frustration waiting for me in the game because i know there's nothing i can do but wait. \n\nFrom my experience, you can get about 50 hours of pleasant gameplay time, which can be multiplied extensively by how much time you're willing to spend reading or listening to the many, many stories in the game.\nThe other 15 hours were spent allowing frustration taking over until it just isn't worth the pain anymore.\n\nSo yeah, gacha bad.\n\nMaybe i'll get back to it from time to time and renew my frustration, but right now this is it for me.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "the tutorials in this game are torture and the UI is a mess",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game doesn't work for me. It starts kind of interesting, but the writing and the voice acting murdered it in it's crib. I didn't even really get out of the tutorial because they keep talking and talking and talking about nothing with voices that don't match the situation.  I have played Arkknights. I have played Morimens (and that one is a machine translated mess, as far as grammar is concerned). I know this stuff can be done without me wanting to go do something else while the dialog plays.\nThe translation is actually pretty good, but the content just made me want to not play at all.\n\nThe game system itself seems to have potential - it's an interesting spin on slay the spire-esque card battling where you can combine your cards during the battle to get stronger effects.\n\nFrom other comments I deduce that if you can stand the story you may have fun with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most annoying community out there.\nthe game have so much to offer but the only thing that people talk to you is lesbian character.\n\nWhen it is the weakest part of the game. \nI will let you know that most of the characters are just trauma personified and somehow trapped in some sort of Twilight-esque situationship with their female best friend or step sister.\n\nAnd somehow that is the best part when they can read novel for young adult written by run of the mill authors such as John Green or Cassandra Claire.\n\nWhat about the research that writers done to bring us tiny refrences to literary world. What about the gameplay and rotation pf each team. The fact that some unit designed to fill in a role specifically for certain line up.\n\nI also think the \"drama\" between two characters is the weakest part. Since they read like something that comes put of YA novels. It made the dystopian background take backrow seat even when it is the more interesting part of the narrative.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly just wasnt for me. The gacha is pitiful to like nothing in the beginning and I need to be able to jump into the game, do some pulls, and than go through all the content.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s a decent gacha. The mechanics remind me of Fate GGO but better as a system. The combat gets old though and it’s not even that good to look at.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretentious nonsense, on top of greedy monetization (the battle pass is offering crumbs) . Story is a salad of philosophy from around the world, by the time I reached the \"good part\", played a bit more and I decided to uninstall and forget I even played it to cleanse my mind of nonsense. I do not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish the characters would rerun more often but I really like the mood with the artstyle.\nEnglish voice is better on Sonetto because she stays monotone so I wanted to use that, but english is dog water on pretty much everyone else, kekw. I wish Sonetto's voice would be monotone in english too but they do not keep consitency in the personality of their way of talking as it seems.\n\nCard system seems similar to Catfantasy, enjoyable but nothing crazy.\nI wish you could have a select banner when you start out, like I really don't feel like waiting 10+ month to see a char i like.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful artwork. However, the story and battle are boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too little pulls for f2p players",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somehow both boring and confusing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I do like this game and do recommend, but on mobile. PC gives me issues with the cinematics where I can hear the audio but just see a black screen; the summons are also a black screen; and so are the insight upgrades. It just makes for a tedious experience with missed content, especially in the later story chapters. The game is pretty good for a gacha and actually has a good story. The combat gets a little repetitive but its no big deal.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Unplayable on Steamdeck\n\nBefore I downloaded the game, I looked into the game and its reviews. I heard good things about the game, so I decided to give it a try. My Wi-Fi isn’t the best, so it took a little over an hour to complete the download. Once downloaded, it did its in-game download, then went to the Home Screen after finishing. \n\nThe cons:\nThe game has minimum customization optimizations in the settings, which is really no big deal for me. \nBut the biggest issue I have is once I was ready to enter into the game from the home menu, I would encounter issues with screen blackout and the next 15 seconds of in-game audio.\nI’m not sure if this happened to anyone else using the Steam Deck, but the screen would be black, and I could hear the audio for at least 15 seconds before it goes quiet!\nI was able to move the cursor around, but the game doesn’t respond, even though it does acknowledge my cursor existence.\nI tried resetting the game, uninstalling, and reinstalling the game. I even checked to see if everything was properly installed and not missing. Nothing works, and I’m very disappointed! \n\nThe Pros: \nSo far from my POV, the music is very harmonious, while the art style and scenes are very beautiful.\nFrom the description, the game really has me intrigued, from the characters to the jaw-dropping scenes and story it has to tell! I really do want to play this game on the deck, but for some unknown reason, it just won’t play.\n\nUntil the game can be playable, I will change my review from a thumbs down!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After wasting almost $4,500 in this game, I decided to quit and take a break for a while. Is this a bad game? Certainly not. But a mixed cash grab and gacha game with gl-bait.\nI love reading visual novels, and the first four chapters of the story are quite decent. Then, suddenly, after being trapped by the amazing story of the first four chapters. Reverse 1999 showed its true form. A gacha game with decent arts, voice actings, and characters designs as its pros. But nothing more. The time-limited event is quite boring and left unfinished most of the time. You have to log in every day, grid(watch relay) countless time to earn your rewards. The packs in-store can only be purchased with real money or top-up currency. Otherwise, you have to log in and wait for its return, then buy it with real money lol.\nTake this collab as an example, they introduce some new characters and new ways to play the game, also give you a chance to earn the character you like through 100 pulls, etc. Pity pulls imo, considering the devs already know how many players will suffer from the pull rate.\nThey also made some changes to old characters during this update as well, but after a few days, the new changes, in order to help old characters to catch up with the ridiculous damage requirements in the new events, are considered as bugs and fixed without any inform in advance(Vila). And after receiving a large number of complaints from the community, they decided to remain silent and do NOTHING about it. So players who got Vila in full and bought the new skin at the very first day have to surrfer from it. Wow, truly amazing.\nSo I personally recommend thinking twice before playing or spending real money on this game. Yes, it has its pros. But in the end, it's still a gacha game, developed by a CN company that treats its players as nothing but ATMs. And to think that their Twitter account is called 'reverse 1999_GL', lmao.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "This video game is a photosensitive seizure waiting to happen to the untrained gamer at this magnitude of a 50 inch television. I am not saying that this videogame is horrible. I am addressing the safe gaming issue with epilepsy susceptible people I give this video game a 2.5 out of 5 broken controllers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gacha bad.\n\nSo 65 hours played and i've reached annoyance stage. Can't progress in most game modes because they need mostly, if not fully upgraded characters to stand a chance of winning. So now i gotta wait around for months at a time, slowly farm dozens or hundreds of materials and millions of currency until the next roadblock hits or i can just pony up hundreds or thousands of $$ to do shit now, when i want to play.\nSo all that's left now is frustration waiting for me in the game because i know there's nothing i can do but wait. \n\nFrom my experience, you can get about 50 hours of pleasant gameplay time, which can be multiplied extensively by how much time you're willing to spend reading or listening to the many, many stories in the game.\nThe other 15 hours were spent allowing frustration taking over until it just isn't worth the pain anymore.\n\nSo yeah, gacha bad.\n\nMaybe i'll get back to it from time to time and renew my frustration, but right now this is it for me.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "the tutorials in this game are torture and the UI is a mess",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game doesn't work for me. It starts kind of interesting, but the writing and the voice acting murdered it in it's crib. I didn't even really get out of the tutorial because they keep talking and talking and talking about nothing with voices that don't match the situation.  I have played Arkknights. I have played Morimens (and that one is a machine translated mess, as far as grammar is concerned). I know this stuff can be done without me wanting to go do something else while the dialog plays.\nThe translation is actually pretty good, but the content just made me want to not play at all.\n\nThe game system itself seems to have potential - it's an interesting spin on slay the spire-esque card battling where you can combine your cards during the battle to get stronger effects.\n\nFrom other comments I deduce that if you can stand the story you may have fun with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most annoying community out there.\nthe game have so much to offer but the only thing that people talk to you is lesbian character.\n\nWhen it is the weakest part of the game. \nI will let you know that most of the characters are just trauma personified and somehow trapped in some sort of Twilight-esque situationship with their female best friend or step sister.\n\nAnd somehow that is the best part when they can read novel for young adult written by run of the mill authors such as John Green or Cassandra Claire.\n\nWhat about the research that writers done to bring us tiny refrences to literary world. What about the gameplay and rotation pf each team. The fact that some unit designed to fill in a role specifically for certain line up.\n\nI also think the \"drama\" between two characters is the weakest part. Since they read like something that comes put of YA novels. It made the dystopian background take backrow seat even when it is the more interesting part of the narrative.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly just wasnt for me. The gacha is pitiful to like nothing in the beginning and I need to be able to jump into the game, do some pulls, and than go through all the content.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s a decent gacha. The mechanics remind me of Fate GGO but better as a system. The combat gets old though and it’s not even that good to look at.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretentious nonsense, on top of greedy monetization (the battle pass is offering crumbs) . Story is a salad of philosophy from around the world, by the time I reached the \"good part\", played a bit more and I decided to uninstall and forget I even played it to cleanse my mind of nonsense. I do not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish the characters would rerun more often but I really like the mood with the artstyle.\nEnglish voice is better on Sonetto because she stays monotone so I wanted to use that, but english is dog water on pretty much everyone else, kekw. I wish Sonetto's voice would be monotone in english too but they do not keep consitency in the personality of their way of talking as it seems.\n\nCard system seems similar to Catfantasy, enjoyable but nothing crazy.\nI wish you could have a select banner when you start out, like I really don't feel like waiting 10+ month to see a char i like.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful artwork. However, the story and battle are boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too little pulls for f2p players",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somehow both boring and confusing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I do like this game and do recommend, but on mobile. PC gives me issues with the cinematics where I can hear the audio but just see a black screen; the summons are also a black screen; and so are the insight upgrades. It just makes for a tedious experience with missed content, especially in the later story chapters. The game is pretty good for a gacha and actually has a good story. The combat gets a little repetitive but its no big deal.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Unplayable on Steamdeck\n\nBefore I downloaded the game, I looked into the game and its reviews. I heard good things about the game, so I decided to give it a try. My Wi-Fi isn’t the best, so it took a little over an hour to complete the download. Once downloaded, it did its in-game download, then went to the Home Screen after finishing. \n\nThe cons:\nThe game has minimum customization optimizations in the settings, which is really no big deal for me. \nBut the biggest issue I have is once I was ready to enter into the game from the home menu, I would encounter issues with screen blackout and the next 15 seconds of in-game audio.\nI’m not sure if this happened to anyone else using the Steam Deck, but the screen would be black, and I could hear the audio for at least 15 seconds before it goes quiet!\nI was able to move the cursor around, but the game doesn’t respond, even though it does acknowledge my cursor existence.\nI tried resetting the game, uninstalling, and reinstalling the game. I even checked to see if everything was properly installed and not missing. Nothing works, and I’m very disappointed! \n\nThe Pros: \nSo far from my POV, the music is very harmonious, while the art style and scenes are very beautiful.\nFrom the description, the game really has me intrigued, from the characters to the jaw-dropping scenes and story it has to tell! I really do want to play this game on the deck, but for some unknown reason, it just won’t play.\n\nUntil the game can be playable, I will change my review from a thumbs down!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After wasting almost $4,500 in this game, I decided to quit and take a break for a while. Is this a bad game? Certainly not. But a mixed cash grab and gacha game with gl-bait.\nI love reading visual novels, and the first four chapters of the story are quite decent. Then, suddenly, after being trapped by the amazing story of the first four chapters. Reverse 1999 showed its true form. A gacha game with decent arts, voice actings, and characters designs as its pros. But nothing more. The time-limited event is quite boring and left unfinished most of the time. You have to log in every day, grid(watch relay) countless time to earn your rewards. The packs in-store can only be purchased with real money or top-up currency. Otherwise, you have to log in and wait for its return, then buy it with real money lol.\nTake this collab as an example, they introduce some new characters and new ways to play the game, also give you a chance to earn the character you like through 100 pulls, etc. Pity pulls imo, considering the devs already know how many players will suffer from the pull rate.\nThey also made some changes to old characters during this update as well, but after a few days, the new changes, in order to help old characters to catch up with the ridiculous damage requirements in the new events, are considered as bugs and fixed without any inform in advance(Vila). And after receiving a large number of complaints from the community, they decided to remain silent and do NOTHING about it. So players who got Vila in full and bought the new skin at the very first day have to surrfer from it. Wow, truly amazing.\nSo I personally recommend thinking twice before playing or spending real money on this game. Yes, it has its pros. But in the end, it's still a gacha game, developed by a CN company that treats its players as nothing but ATMs. And to think that their Twitter account is called 'reverse 1999_GL', lmao.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "This video game is a photosensitive seizure waiting to happen to the untrained gamer at this magnitude of a 50 inch television. I am not saying that this videogame is horrible. I am addressing the safe gaming issue with epilepsy susceptible people I give this video game a 2.5 out of 5 broken controllers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gacha bad.\n\nSo 65 hours played and i've reached annoyance stage. Can't progress in most game modes because they need mostly, if not fully upgraded characters to stand a chance of winning. So now i gotta wait around for months at a time, slowly farm dozens or hundreds of materials and millions of currency until the next roadblock hits or i can just pony up hundreds or thousands of $$ to do shit now, when i want to play.\nSo all that's left now is frustration waiting for me in the game because i know there's nothing i can do but wait. \n\nFrom my experience, you can get about 50 hours of pleasant gameplay time, which can be multiplied extensively by how much time you're willing to spend reading or listening to the many, many stories in the game.\nThe other 15 hours were spent allowing frustration taking over until it just isn't worth the pain anymore.\n\nSo yeah, gacha bad.\n\nMaybe i'll get back to it from time to time and renew my frustration, but right now this is it for me.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "the tutorials in this game are torture and the UI is a mess",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game doesn't work for me. It starts kind of interesting, but the writing and the voice acting murdered it in it's crib. I didn't even really get out of the tutorial because they keep talking and talking and talking about nothing with voices that don't match the situation.  I have played Arkknights. I have played Morimens (and that one is a machine translated mess, as far as grammar is concerned). I know this stuff can be done without me wanting to go do something else while the dialog plays.\nThe translation is actually pretty good, but the content just made me want to not play at all.\n\nThe game system itself seems to have potential - it's an interesting spin on slay the spire-esque card battling where you can combine your cards during the battle to get stronger effects.\n\nFrom other comments I deduce that if you can stand the story you may have fun with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most annoying community out there.\nthe game have so much to offer but the only thing that people talk to you is lesbian character.\n\nWhen it is the weakest part of the game. \nI will let you know that most of the characters are just trauma personified and somehow trapped in some sort of Twilight-esque situationship with their female best friend or step sister.\n\nAnd somehow that is the best part when they can read novel for young adult written by run of the mill authors such as John Green or Cassandra Claire.\n\nWhat about the research that writers done to bring us tiny refrences to literary world. What about the gameplay and rotation pf each team. The fact that some unit designed to fill in a role specifically for certain line up.\n\nI also think the \"drama\" between two characters is the weakest part. Since they read like something that comes put of YA novels. It made the dystopian background take backrow seat even when it is the more interesting part of the narrative.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly just wasnt for me. The gacha is pitiful to like nothing in the beginning and I need to be able to jump into the game, do some pulls, and than go through all the content.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s a decent gacha. The mechanics remind me of Fate GGO but better as a system. The combat gets old though and it’s not even that good to look at.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretentious nonsense, on top of greedy monetization (the battle pass is offering crumbs) . Story is a salad of philosophy from around the world, by the time I reached the \"good part\", played a bit more and I decided to uninstall and forget I even played it to cleanse my mind of nonsense. I do not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish the characters would rerun more often but I really like the mood with the artstyle.\nEnglish voice is better on Sonetto because she stays monotone so I wanted to use that, but english is dog water on pretty much everyone else, kekw. I wish Sonetto's voice would be monotone in english too but they do not keep consitency in the personality of their way of talking as it seems.\n\nCard system seems similar to Catfantasy, enjoyable but nothing crazy.\nI wish you could have a select banner when you start out, like I really don't feel like waiting 10+ month to see a char i like.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful artwork. However, the story and battle are boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too little pulls for f2p players",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somehow both boring and confusing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I do like this game and do recommend, but on mobile. PC gives me issues with the cinematics where I can hear the audio but just see a black screen; the summons are also a black screen; and so are the insight upgrades. It just makes for a tedious experience with missed content, especially in the later story chapters. The game is pretty good for a gacha and actually has a good story. The combat gets a little repetitive but its no big deal.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Unplayable on Steamdeck\n\nBefore I downloaded the game, I looked into the game and its reviews. I heard good things about the game, so I decided to give it a try. My Wi-Fi isn’t the best, so it took a little over an hour to complete the download. Once downloaded, it did its in-game download, then went to the Home Screen after finishing. \n\nThe cons:\nThe game has minimum customization optimizations in the settings, which is really no big deal for me. \nBut the biggest issue I have is once I was ready to enter into the game from the home menu, I would encounter issues with screen blackout and the next 15 seconds of in-game audio.\nI’m not sure if this happened to anyone else using the Steam Deck, but the screen would be black, and I could hear the audio for at least 15 seconds before it goes quiet!\nI was able to move the cursor around, but the game doesn’t respond, even though it does acknowledge my cursor existence.\nI tried resetting the game, uninstalling, and reinstalling the game. I even checked to see if everything was properly installed and not missing. Nothing works, and I’m very disappointed! \n\nThe Pros: \nSo far from my POV, the music is very harmonious, while the art style and scenes are very beautiful.\nFrom the description, the game really has me intrigued, from the characters to the jaw-dropping scenes and story it has to tell! I really do want to play this game on the deck, but for some unknown reason, it just won’t play.\n\nUntil the game can be playable, I will change my review from a thumbs down!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After wasting almost $4,500 in this game, I decided to quit and take a break for a while. Is this a bad game? Certainly not. But a mixed cash grab and gacha game with gl-bait.\nI love reading visual novels, and the first four chapters of the story are quite decent. Then, suddenly, after being trapped by the amazing story of the first four chapters. Reverse 1999 showed its true form. A gacha game with decent arts, voice actings, and characters designs as its pros. But nothing more. The time-limited event is quite boring and left unfinished most of the time. You have to log in every day, grid(watch relay) countless time to earn your rewards. The packs in-store can only be purchased with real money or top-up currency. Otherwise, you have to log in and wait for its return, then buy it with real money lol.\nTake this collab as an example, they introduce some new characters and new ways to play the game, also give you a chance to earn the character you like through 100 pulls, etc. Pity pulls imo, considering the devs already know how many players will suffer from the pull rate.\nThey also made some changes to old characters during this update as well, but after a few days, the new changes, in order to help old characters to catch up with the ridiculous damage requirements in the new events, are considered as bugs and fixed without any inform in advance(Vila). And after receiving a large number of complaints from the community, they decided to remain silent and do NOTHING about it. So players who got Vila in full and bought the new skin at the very first day have to surrfer from it. Wow, truly amazing.\nSo I personally recommend thinking twice before playing or spending real money on this game. Yes, it has its pros. But in the end, it's still a gacha game, developed by a CN company that treats its players as nothing but ATMs. And to think that their Twitter account is called 'reverse 1999_GL', lmao.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "This video game is a photosensitive seizure waiting to happen to the untrained gamer at this magnitude of a 50 inch television. I am not saying that this videogame is horrible. I am addressing the safe gaming issue with epilepsy susceptible people I give this video game a 2.5 out of 5 broken controllers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gacha bad.\n\nSo 65 hours played and i've reached annoyance stage. Can't progress in most game modes because they need mostly, if not fully upgraded characters to stand a chance of winning. So now i gotta wait around for months at a time, slowly farm dozens or hundreds of materials and millions of currency until the next roadblock hits or i can just pony up hundreds or thousands of $$ to do shit now, when i want to play.\nSo all that's left now is frustration waiting for me in the game because i know there's nothing i can do but wait. \n\nFrom my experience, you can get about 50 hours of pleasant gameplay time, which can be multiplied extensively by how much time you're willing to spend reading or listening to the many, many stories in the game.\nThe other 15 hours were spent allowing frustration taking over until it just isn't worth the pain anymore.\n\nSo yeah, gacha bad.\n\nMaybe i'll get back to it from time to time and renew my frustration, but right now this is it for me.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "the tutorials in this game are torture and the UI is a mess",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game doesn't work for me. It starts kind of interesting, but the writing and the voice acting murdered it in it's crib. I didn't even really get out of the tutorial because they keep talking and talking and talking about nothing with voices that don't match the situation.  I have played Arkknights. I have played Morimens (and that one is a machine translated mess, as far as grammar is concerned). I know this stuff can be done without me wanting to go do something else while the dialog plays.\nThe translation is actually pretty good, but the content just made me want to not play at all.\n\nThe game system itself seems to have potential - it's an interesting spin on slay the spire-esque card battling where you can combine your cards during the battle to get stronger effects.\n\nFrom other comments I deduce that if you can stand the story you may have fun with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most annoying community out there.\nthe game have so much to offer but the only thing that people talk to you is lesbian character.\n\nWhen it is the weakest part of the game. \nI will let you know that most of the characters are just trauma personified and somehow trapped in some sort of Twilight-esque situationship with their female best friend or step sister.\n\nAnd somehow that is the best part when they can read novel for young adult written by run of the mill authors such as John Green or Cassandra Claire.\n\nWhat about the research that writers done to bring us tiny refrences to literary world. What about the gameplay and rotation pf each team. The fact that some unit designed to fill in a role specifically for certain line up.\n\nI also think the \"drama\" between two characters is the weakest part. Since they read like something that comes put of YA novels. It made the dystopian background take backrow seat even when it is the more interesting part of the narrative.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly just wasnt for me. The gacha is pitiful to like nothing in the beginning and I need to be able to jump into the game, do some pulls, and than go through all the content.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s a decent gacha. The mechanics remind me of Fate GGO but better as a system. The combat gets old though and it’s not even that good to look at.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretentious nonsense, on top of greedy monetization (the battle pass is offering crumbs) . Story is a salad of philosophy from around the world, by the time I reached the \"good part\", played a bit more and I decided to uninstall and forget I even played it to cleanse my mind of nonsense. I do not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish the characters would rerun more often but I really like the mood with the artstyle.\nEnglish voice is better on Sonetto because she stays monotone so I wanted to use that, but english is dog water on pretty much everyone else, kekw. I wish Sonetto's voice would be monotone in english too but they do not keep consitency in the personality of their way of talking as it seems.\n\nCard system seems similar to Catfantasy, enjoyable but nothing crazy.\nI wish you could have a select banner when you start out, like I really don't feel like waiting 10+ month to see a char i like.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful artwork. However, the story and battle are boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too little pulls for f2p players",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somehow both boring and confusing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I do like this game and do recommend, but on mobile. PC gives me issues with the cinematics where I can hear the audio but just see a black screen; the summons are also a black screen; and so are the insight upgrades. It just makes for a tedious experience with missed content, especially in the later story chapters. The game is pretty good for a gacha and actually has a good story. The combat gets a little repetitive but its no big deal.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Unplayable on Steamdeck\n\nBefore I downloaded the game, I looked into the game and its reviews. I heard good things about the game, so I decided to give it a try. My Wi-Fi isn’t the best, so it took a little over an hour to complete the download. Once downloaded, it did its in-game download, then went to the Home Screen after finishing. \n\nThe cons:\nThe game has minimum customization optimizations in the settings, which is really no big deal for me. \nBut the biggest issue I have is once I was ready to enter into the game from the home menu, I would encounter issues with screen blackout and the next 15 seconds of in-game audio.\nI’m not sure if this happened to anyone else using the Steam Deck, but the screen would be black, and I could hear the audio for at least 15 seconds before it goes quiet!\nI was able to move the cursor around, but the game doesn’t respond, even though it does acknowledge my cursor existence.\nI tried resetting the game, uninstalling, and reinstalling the game. I even checked to see if everything was properly installed and not missing. Nothing works, and I’m very disappointed! \n\nThe Pros: \nSo far from my POV, the music is very harmonious, while the art style and scenes are very beautiful.\nFrom the description, the game really has me intrigued, from the characters to the jaw-dropping scenes and story it has to tell! I really do want to play this game on the deck, but for some unknown reason, it just won’t play.\n\nUntil the game can be playable, I will change my review from a thumbs down!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After wasting almost $4,500 in this game, I decided to quit and take a break for a while. Is this a bad game? Certainly not. But a mixed cash grab and gacha game with gl-bait.\nI love reading visual novels, and the first four chapters of the story are quite decent. Then, suddenly, after being trapped by the amazing story of the first four chapters. Reverse 1999 showed its true form. A gacha game with decent arts, voice actings, and characters designs as its pros. But nothing more. The time-limited event is quite boring and left unfinished most of the time. You have to log in every day, grid(watch relay) countless time to earn your rewards. The packs in-store can only be purchased with real money or top-up currency. Otherwise, you have to log in and wait for its return, then buy it with real money lol.\nTake this collab as an example, they introduce some new characters and new ways to play the game, also give you a chance to earn the character you like through 100 pulls, etc. Pity pulls imo, considering the devs already know how many players will suffer from the pull rate.\nThey also made some changes to old characters during this update as well, but after a few days, the new changes, in order to help old characters to catch up with the ridiculous damage requirements in the new events, are considered as bugs and fixed without any inform in advance(Vila). And after receiving a large number of complaints from the community, they decided to remain silent and do NOTHING about it. So players who got Vila in full and bought the new skin at the very first day have to surrfer from it. Wow, truly amazing.\nSo I personally recommend thinking twice before playing or spending real money on this game. Yes, it has its pros. But in the end, it's still a gacha game, developed by a CN company that treats its players as nothing but ATMs. And to think that their Twitter account is called 'reverse 1999_GL', lmao.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "This video game is a photosensitive seizure waiting to happen to the untrained gamer at this magnitude of a 50 inch television. I am not saying that this videogame is horrible. I am addressing the safe gaming issue with epilepsy susceptible people I give this video game a 2.5 out of 5 broken controllers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gacha bad.\n\nSo 65 hours played and i've reached annoyance stage. Can't progress in most game modes because they need mostly, if not fully upgraded characters to stand a chance of winning. So now i gotta wait around for months at a time, slowly farm dozens or hundreds of materials and millions of currency until the next roadblock hits or i can just pony up hundreds or thousands of $$ to do shit now, when i want to play.\nSo all that's left now is frustration waiting for me in the game because i know there's nothing i can do but wait. \n\nFrom my experience, you can get about 50 hours of pleasant gameplay time, which can be multiplied extensively by how much time you're willing to spend reading or listening to the many, many stories in the game.\nThe other 15 hours were spent allowing frustration taking over until it just isn't worth the pain anymore.\n\nSo yeah, gacha bad.\n\nMaybe i'll get back to it from time to time and renew my frustration, but right now this is it for me.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "the tutorials in this game are torture and the UI is a mess",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game doesn't work for me. It starts kind of interesting, but the writing and the voice acting murdered it in it's crib. I didn't even really get out of the tutorial because they keep talking and talking and talking about nothing with voices that don't match the situation.  I have played Arkknights. I have played Morimens (and that one is a machine translated mess, as far as grammar is concerned). I know this stuff can be done without me wanting to go do something else while the dialog plays.\nThe translation is actually pretty good, but the content just made me want to not play at all.\n\nThe game system itself seems to have potential - it's an interesting spin on slay the spire-esque card battling where you can combine your cards during the battle to get stronger effects.\n\nFrom other comments I deduce that if you can stand the story you may have fun with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most annoying community out there.\nthe game have so much to offer but the only thing that people talk to you is lesbian character.\n\nWhen it is the weakest part of the game. \nI will let you know that most of the characters are just trauma personified and somehow trapped in some sort of Twilight-esque situationship with their female best friend or step sister.\n\nAnd somehow that is the best part when they can read novel for young adult written by run of the mill authors such as John Green or Cassandra Claire.\n\nWhat about the research that writers done to bring us tiny refrences to literary world. What about the gameplay and rotation pf each team. The fact that some unit designed to fill in a role specifically for certain line up.\n\nI also think the \"drama\" between two characters is the weakest part. Since they read like something that comes put of YA novels. It made the dystopian background take backrow seat even when it is the more interesting part of the narrative.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly just wasnt for me. The gacha is pitiful to like nothing in the beginning and I need to be able to jump into the game, do some pulls, and than go through all the content.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s a decent gacha. The mechanics remind me of Fate GGO but better as a system. The combat gets old though and it’s not even that good to look at.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretentious nonsense, on top of greedy monetization (the battle pass is offering crumbs) . Story is a salad of philosophy from around the world, by the time I reached the \"good part\", played a bit more and I decided to uninstall and forget I even played it to cleanse my mind of nonsense. I do not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish the characters would rerun more often but I really like the mood with the artstyle.\nEnglish voice is better on Sonetto because she stays monotone so I wanted to use that, but english is dog water on pretty much everyone else, kekw. I wish Sonetto's voice would be monotone in english too but they do not keep consitency in the personality of their way of talking as it seems.\n\nCard system seems similar to Catfantasy, enjoyable but nothing crazy.\nI wish you could have a select banner when you start out, like I really don't feel like waiting 10+ month to see a char i like.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful artwork. However, the story and battle are boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too little pulls for f2p players",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somehow both boring and confusing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I do like this game and do recommend, but on mobile. PC gives me issues with the cinematics where I can hear the audio but just see a black screen; the summons are also a black screen; and so are the insight upgrades. It just makes for a tedious experience with missed content, especially in the later story chapters. The game is pretty good for a gacha and actually has a good story. The combat gets a little repetitive but its no big deal.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Unplayable on Steamdeck\n\nBefore I downloaded the game, I looked into the game and its reviews. I heard good things about the game, so I decided to give it a try. My Wi-Fi isn’t the best, so it took a little over an hour to complete the download. Once downloaded, it did its in-game download, then went to the Home Screen after finishing. \n\nThe cons:\nThe game has minimum customization optimizations in the settings, which is really no big deal for me. \nBut the biggest issue I have is once I was ready to enter into the game from the home menu, I would encounter issues with screen blackout and the next 15 seconds of in-game audio.\nI’m not sure if this happened to anyone else using the Steam Deck, but the screen would be black, and I could hear the audio for at least 15 seconds before it goes quiet!\nI was able to move the cursor around, but the game doesn’t respond, even though it does acknowledge my cursor existence.\nI tried resetting the game, uninstalling, and reinstalling the game. I even checked to see if everything was properly installed and not missing. Nothing works, and I’m very disappointed! \n\nThe Pros: \nSo far from my POV, the music is very harmonious, while the art style and scenes are very beautiful.\nFrom the description, the game really has me intrigued, from the characters to the jaw-dropping scenes and story it has to tell! I really do want to play this game on the deck, but for some unknown reason, it just won’t play.\n\nUntil the game can be playable, I will change my review from a thumbs down!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After wasting almost $4,500 in this game, I decided to quit and take a break for a while. Is this a bad game? Certainly not. But a mixed cash grab and gacha game with gl-bait.\nI love reading visual novels, and the first four chapters of the story are quite decent. Then, suddenly, after being trapped by the amazing story of the first four chapters. Reverse 1999 showed its true form. A gacha game with decent arts, voice actings, and characters designs as its pros. But nothing more. The time-limited event is quite boring and left unfinished most of the time. You have to log in every day, grid(watch relay) countless time to earn your rewards. The packs in-store can only be purchased with real money or top-up currency. Otherwise, you have to log in and wait for its return, then buy it with real money lol.\nTake this collab as an example, they introduce some new characters and new ways to play the game, also give you a chance to earn the character you like through 100 pulls, etc. Pity pulls imo, considering the devs already know how many players will suffer from the pull rate.\nThey also made some changes to old characters during this update as well, but after a few days, the new changes, in order to help old characters to catch up with the ridiculous damage requirements in the new events, are considered as bugs and fixed without any inform in advance(Vila). And after receiving a large number of complaints from the community, they decided to remain silent and do NOTHING about it. So players who got Vila in full and bought the new skin at the very first day have to surrfer from it. Wow, truly amazing.\nSo I personally recommend thinking twice before playing or spending real money on this game. Yes, it has its pros. But in the end, it's still a gacha game, developed by a CN company that treats its players as nothing but ATMs. And to think that their Twitter account is called 'reverse 1999_GL', lmao.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "This video game is a photosensitive seizure waiting to happen to the untrained gamer at this magnitude of a 50 inch television. I am not saying that this videogame is horrible. I am addressing the safe gaming issue with epilepsy susceptible people I give this video game a 2.5 out of 5 broken controllers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gacha bad.\n\nSo 65 hours played and i've reached annoyance stage. Can't progress in most game modes because they need mostly, if not fully upgraded characters to stand a chance of winning. So now i gotta wait around for months at a time, slowly farm dozens or hundreds of materials and millions of currency until the next roadblock hits or i can just pony up hundreds or thousands of $$ to do shit now, when i want to play.\nSo all that's left now is frustration waiting for me in the game because i know there's nothing i can do but wait. \n\nFrom my experience, you can get about 50 hours of pleasant gameplay time, which can be multiplied extensively by how much time you're willing to spend reading or listening to the many, many stories in the game.\nThe other 15 hours were spent allowing frustration taking over until it just isn't worth the pain anymore.\n\nSo yeah, gacha bad.\n\nMaybe i'll get back to it from time to time and renew my frustration, but right now this is it for me.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "the tutorials in this game are torture and the UI is a mess",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game doesn't work for me. It starts kind of interesting, but the writing and the voice acting murdered it in it's crib. I didn't even really get out of the tutorial because they keep talking and talking and talking about nothing with voices that don't match the situation.  I have played Arkknights. I have played Morimens (and that one is a machine translated mess, as far as grammar is concerned). I know this stuff can be done without me wanting to go do something else while the dialog plays.\nThe translation is actually pretty good, but the content just made me want to not play at all.\n\nThe game system itself seems to have potential - it's an interesting spin on slay the spire-esque card battling where you can combine your cards during the battle to get stronger effects.\n\nFrom other comments I deduce that if you can stand the story you may have fun with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most annoying community out there.\nthe game have so much to offer but the only thing that people talk to you is lesbian character.\n\nWhen it is the weakest part of the game. \nI will let you know that most of the characters are just trauma personified and somehow trapped in some sort of Twilight-esque situationship with their female best friend or step sister.\n\nAnd somehow that is the best part when they can read novel for young adult written by run of the mill authors such as John Green or Cassandra Claire.\n\nWhat about the research that writers done to bring us tiny refrences to literary world. What about the gameplay and rotation pf each team. The fact that some unit designed to fill in a role specifically for certain line up.\n\nI also think the \"drama\" between two characters is the weakest part. Since they read like something that comes put of YA novels. It made the dystopian background take backrow seat even when it is the more interesting part of the narrative.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly just wasnt for me. The gacha is pitiful to like nothing in the beginning and I need to be able to jump into the game, do some pulls, and than go through all the content.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s a decent gacha. The mechanics remind me of Fate GGO but better as a system. The combat gets old though and it’s not even that good to look at.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretentious nonsense, on top of greedy monetization (the battle pass is offering crumbs) . Story is a salad of philosophy from around the world, by the time I reached the \"good part\", played a bit more and I decided to uninstall and forget I even played it to cleanse my mind of nonsense. I do not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish the characters would rerun more often but I really like the mood with the artstyle.\nEnglish voice is better on Sonetto because she stays monotone so I wanted to use that, but english is dog water on pretty much everyone else, kekw. I wish Sonetto's voice would be monotone in english too but they do not keep consitency in the personality of their way of talking as it seems.\n\nCard system seems similar to Catfantasy, enjoyable but nothing crazy.\nI wish you could have a select banner when you start out, like I really don't feel like waiting 10+ month to see a char i like.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful artwork. However, the story and battle are boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too little pulls for f2p players",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somehow both boring and confusing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I do like this game and do recommend, but on mobile. PC gives me issues with the cinematics where I can hear the audio but just see a black screen; the summons are also a black screen; and so are the insight upgrades. It just makes for a tedious experience with missed content, especially in the later story chapters. The game is pretty good for a gacha and actually has a good story. The combat gets a little repetitive but its no big deal.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Unplayable on Steamdeck\n\nBefore I downloaded the game, I looked into the game and its reviews. I heard good things about the game, so I decided to give it a try. My Wi-Fi isn’t the best, so it took a little over an hour to complete the download. Once downloaded, it did its in-game download, then went to the Home Screen after finishing. \n\nThe cons:\nThe game has minimum customization optimizations in the settings, which is really no big deal for me. \nBut the biggest issue I have is once I was ready to enter into the game from the home menu, I would encounter issues with screen blackout and the next 15 seconds of in-game audio.\nI’m not sure if this happened to anyone else using the Steam Deck, but the screen would be black, and I could hear the audio for at least 15 seconds before it goes quiet!\nI was able to move the cursor around, but the game doesn’t respond, even though it does acknowledge my cursor existence.\nI tried resetting the game, uninstalling, and reinstalling the game. I even checked to see if everything was properly installed and not missing. Nothing works, and I’m very disappointed! \n\nThe Pros: \nSo far from my POV, the music is very harmonious, while the art style and scenes are very beautiful.\nFrom the description, the game really has me intrigued, from the characters to the jaw-dropping scenes and story it has to tell! I really do want to play this game on the deck, but for some unknown reason, it just won’t play.\n\nUntil the game can be playable, I will change my review from a thumbs down!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After wasting almost $4,500 in this game, I decided to quit and take a break for a while. Is this a bad game? Certainly not. But a mixed cash grab and gacha game with gl-bait.\nI love reading visual novels, and the first four chapters of the story are quite decent. Then, suddenly, after being trapped by the amazing story of the first four chapters. Reverse 1999 showed its true form. A gacha game with decent arts, voice actings, and characters designs as its pros. But nothing more. The time-limited event is quite boring and left unfinished most of the time. You have to log in every day, grid(watch relay) countless time to earn your rewards. The packs in-store can only be purchased with real money or top-up currency. Otherwise, you have to log in and wait for its return, then buy it with real money lol.\nTake this collab as an example, they introduce some new characters and new ways to play the game, also give you a chance to earn the character you like through 100 pulls, etc. Pity pulls imo, considering the devs already know how many players will suffer from the pull rate.\nThey also made some changes to old characters during this update as well, but after a few days, the new changes, in order to help old characters to catch up with the ridiculous damage requirements in the new events, are considered as bugs and fixed without any inform in advance(Vila). And after receiving a large number of complaints from the community, they decided to remain silent and do NOTHING about it. So players who got Vila in full and bought the new skin at the very first day have to surrfer from it. Wow, truly amazing.\nSo I personally recommend thinking twice before playing or spending real money on this game. Yes, it has its pros. But in the end, it's still a gacha game, developed by a CN company that treats its players as nothing but ATMs. And to think that their Twitter account is called 'reverse 1999_GL', lmao.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "This video game is a photosensitive seizure waiting to happen to the untrained gamer at this magnitude of a 50 inch television. I am not saying that this videogame is horrible. I am addressing the safe gaming issue with epilepsy susceptible people I give this video game a 2.5 out of 5 broken controllers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gacha bad.\n\nSo 65 hours played and i've reached annoyance stage. Can't progress in most game modes because they need mostly, if not fully upgraded characters to stand a chance of winning. So now i gotta wait around for months at a time, slowly farm dozens or hundreds of materials and millions of currency until the next roadblock hits or i can just pony up hundreds or thousands of $$ to do shit now, when i want to play.\nSo all that's left now is frustration waiting for me in the game because i know there's nothing i can do but wait. \n\nFrom my experience, you can get about 50 hours of pleasant gameplay time, which can be multiplied extensively by how much time you're willing to spend reading or listening to the many, many stories in the game.\nThe other 15 hours were spent allowing frustration taking over until it just isn't worth the pain anymore.\n\nSo yeah, gacha bad.\n\nMaybe i'll get back to it from time to time and renew my frustration, but right now this is it for me.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "the tutorials in this game are torture and the UI is a mess",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game doesn't work for me. It starts kind of interesting, but the writing and the voice acting murdered it in it's crib. I didn't even really get out of the tutorial because they keep talking and talking and talking about nothing with voices that don't match the situation.  I have played Arkknights. I have played Morimens (and that one is a machine translated mess, as far as grammar is concerned). I know this stuff can be done without me wanting to go do something else while the dialog plays.\nThe translation is actually pretty good, but the content just made me want to not play at all.\n\nThe game system itself seems to have potential - it's an interesting spin on slay the spire-esque card battling where you can combine your cards during the battle to get stronger effects.\n\nFrom other comments I deduce that if you can stand the story you may have fun with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most annoying community out there.\nthe game have so much to offer but the only thing that people talk to you is lesbian character.\n\nWhen it is the weakest part of the game. \nI will let you know that most of the characters are just trauma personified and somehow trapped in some sort of Twilight-esque situationship with their female best friend or step sister.\n\nAnd somehow that is the best part when they can read novel for young adult written by run of the mill authors such as John Green or Cassandra Claire.\n\nWhat about the research that writers done to bring us tiny refrences to literary world. What about the gameplay and rotation pf each team. The fact that some unit designed to fill in a role specifically for certain line up.\n\nI also think the \"drama\" between two characters is the weakest part. Since they read like something that comes put of YA novels. It made the dystopian background take backrow seat even when it is the more interesting part of the narrative.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly just wasnt for me. The gacha is pitiful to like nothing in the beginning and I need to be able to jump into the game, do some pulls, and than go through all the content.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s a decent gacha. The mechanics remind me of Fate GGO but better as a system. The combat gets old though and it’s not even that good to look at.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretentious nonsense, on top of greedy monetization (the battle pass is offering crumbs) . Story is a salad of philosophy from around the world, by the time I reached the \"good part\", played a bit more and I decided to uninstall and forget I even played it to cleanse my mind of nonsense. I do not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish the characters would rerun more often but I really like the mood with the artstyle.\nEnglish voice is better on Sonetto because she stays monotone so I wanted to use that, but english is dog water on pretty much everyone else, kekw. I wish Sonetto's voice would be monotone in english too but they do not keep consitency in the personality of their way of talking as it seems.\n\nCard system seems similar to Catfantasy, enjoyable but nothing crazy.\nI wish you could have a select banner when you start out, like I really don't feel like waiting 10+ month to see a char i like.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful artwork. However, the story and battle are boring.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}