{
  "positive": [
    {
      "review": "Ill make it quick:\n\nIf you only care about playing Zombies then BO3 is the ONLY best option to buy, Why? because its the best optimizated and also has the workshop for a infinity of maps.\n\nOnly buy it when its on sale or get a CDKey tho. Thats all i have to say.",
      "voted_up": true,
      "votes_helpful": 81
    },
    {
      "review": "This game is absolutely worth it and might be the best workshop map game on Steam ever!\r\n\r\nThe amount of custom content and creativity from the community is insane.\r\nYou can play for years and still find new stuff, like for real I've got almost 5000 hours in this game and I’m still finding awesome maps from creators like IceGrenade and many others.\r\n\r\nIf you’re into CoD Zombies, you’ll fall in love with the custom maps instantly.\r\nI’m not even joking, this might be one of the best purchases you’ll ever make on Steam.\r\n\r\nThere’s just endless gameplay value, because there won’t ever be another CoD with this level of workshop freedom again, since newer titles focus more on monetization...",
      "voted_up": true,
      "votes_helpful": 95
    },
    {
      "review": "All these years later it is still an amazing game for custom zombies. Very worth buying if it is on sale",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Probably the best game I've ever played. So many fond memories playing late nights zombies with the boys. 100% recommend this game to anyone who wants to stay up late and have a great time figuring out the puzzles of zombies easter-eggs, high round attempts, and sniper 1v1s in a custom game on multiplayer.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Had to re-buy this game because playstation servers have been dead for years.\n\nHad it day one on my ps4, bought the season pass and chronicles year 1, and logged over 800 hours on this game. In my opinion, it is the most feature/content dense COD we ever received, and i was more than happy to buy it all again. Yes the story in campaign is kinda weak and they do a horrible job of explaining. Yes liquid divinium is a slot machine in zombies. Yes theres way to many dlc weapons only available through supply drops. But its the greatest love letter to zombies we'll ever get, the best of the advanced movement games, and they blessed PC with mod tools to keep this game alive. Its riddled with passion, from the diverse multiplayer maps to the extra modes like free run all the way to the paintshop feature. Treyarch really loved this game and it shows.\n\nThis is without a doubt my favourite call of duty of all time. Yea maybe im a bit nostalgic, but ive bought every COD since MW3 (the original not the new crappy one), and i really don't think a single one since Black ops 3 lives up to the level of polish this game has. All around an amazing package. Maybe the last great COD game we ever got. I cant wait to dive back in.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Classic zombie on pc but sad theres not more consistent players these days/",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Best Game of all time. Steam workshop is goated. ive spent more hours than i know playing custom zombies!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Get it on sale when possible, absolutely worth it for Steam Workshop alone. Bring your friends too for maximum enjoyment. :D",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "fun was the best cod ever i love this game even now grew up playing on a ps3 then ps4 came out then this cod title came out with it and was the best memory i ever had i now play on pc and still love it.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "i only play zombies, but once i figured everything out i loved it, i downloaded smth i think was aee or eaa but it made the game much better",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Train go boom.\nBlack Ops III is often acclaimed the “best zombies” in the Call of Duty franchise. And I give it that credit. The workshop support and DLC maps, Zombie Chronicles, really makes for a great bundle. On the workshop you will find a variety of different maps far varying in quality. I do have one particular gripe with this game’s zombies and it is the weapons. This can be fixed with mods, but I believe that the weapon selection, especially in zombie chronicles is cool, yet out of place in most of the settings provided, having a cyberpunk feeling in mostly Cold-War and WW2 era maps. But moving on from Zombies, the multiplayer is really not worth going at in 2025. The crate system is in full blast on this game and it is absolutely an insufferable cash grab. \nFor the campaign, I personally viewed it as confusing, cringe at times, yet some parts were entertaining. The campaign does feel like a huge downgrade from Black Ops 1, and Black Ops 2.\nFor the most part, I do recommend this game, but really only for the zombies. I also recommend the map “Black Mesa: Biodome” on the workshop.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easy access to community made maps, very fun tons of options well worth time and money.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Came for Zombies.\nStayed for Zombies.\nStill here for Zombies.\n\nPS: Great on Deck.\nInstall T7Patch + Ultimate Experience Mod for the best version.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "love the niche community this game still holds. I wish Activision could give it some love back. Best COD Zombies ever, and it won't be beat",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great cod game. Good to buy for PC if you want modded zombies and try cool maps",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "BEHOLD\nour beloved black ops 3 with, undeniably, the best zombies experience. Why? well, take a look at the workshop yourself and feast your eyes upon the thousands of mods available whenever you feel like it; World at War, Black ops 1, Black ops 2 or any call of duty map that you enjoy you will very likely find in this game's workshop and often times it will have even MORE content that the original one does such as weapons from other call of duty games making the experience just that little bit more fun. This doesn't just mean that you will only find maps from other call of duty games as there is a vast selection of maps created from fantasy or based off other things that you may enjoy such as TV shows or other games. As somebody who has played this game for years, I can tell you that this game has done more for the community than just be a game... the late night conversations while playing this, the hang outs with friends while playing this, all the fun memories while playing THIS. Overall the game itself without mods feels great too and there is lots of fun to be had with the DLC maps and with the DLC weapons you can get and with the bubblegums in this game. At first, we may not have been as happy with black ops 3 as we are now because it brought many new things that we took some time getting used to but now looking back at those times, this is another one of those games that I wish I could experience all over again. To be honest, this whole review may be a bit of a nostalgia trip however I'd like to put this out there anyway as I'm sure that a lot of people can relate to chasing the feelings that games like this gave us. Black ops 3 is worthy of all nighters, hundreds of hours of game time and definitely more fun with friends. As a fellow gamer, I do recommend that you wait until it is on sale and that you have a decent computer so that you can experience this game as intended which in my opinion transcends the newer call of duties. Is it worth it? yes. You may want to stay away from multiplayer with random people though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Basically exists to play custom zombies\r\nonline is dead due hackers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a great game considering its age and with workshop mods is a great option for people looking for a viable Black Ops zombies experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this for the Zombies mode. Worth it for just that to be able to play the COD Zombies I would play as a kid. 10/10 nostalgia with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you are looking for a fun zombies game this is it the mods on the workshop really help this game too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Campaign is lwk ass, but the multiplayer and zombies is really good imo. ESPECIALLY THE ZOMBIES, also custom zombies is peak. Just please use a client before playing this game unless you want to suffer. Also buy ts only on sales or on some key site.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Call of Duty game in 10 years, you do need a third party patch for it to be playable however it's still extremely fun to play compared to Black Ops 6 and Warzone which are full of little kids or full grown adults in their parents basements, and Black Ops 3 isn't filled with Micro Transactions (Third party patches let you unlock all the guns and camos and operator skins for free). And it's still fairly active in those third party patches which is pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, it is very fun to play, and to mod it is very easy to mod Just click a few buttons, and you can mod There is a Steam workshop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Base game is solid, but the modded zombies is really where it's at. I really enjoy seeing the creativity from the community and seeing people come together to make fun and interesting projects for everyone to enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best call of duty zombies experience, that is all I play it for and I never get bored. Got it on steam for custom maps and have no regrets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game has some things I LIked about it like uhhh gunns, some zombies, pwnerz, lemme think.\r\n\r\n\r\n\r\n\r\n\r\n\r\nCall of Duty: Black Ops III",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you can get it on sale, go for it.  Playing slowly on campaign took me only 11 hours, so this is a pretty short game.  I think most people get it for PvP.  Story was weird, acting was pretty bad.  Frame rates were pretty decent in-game but for some reason the video transitions kicked it in the face (down to 4fps!) on my 3060TI.  Both CPU and GPU were under 10% pretty much the whole time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Black Ops 3 zombies the way it comes.. the mods are just a HUGE plus. Get this game if you want endless zombie mods or just to go back to the good days and play the zombies it comes with because they came out with a HUGE library of zombie maps, I know this is one of the older zombie games but it is a G(oldie)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Black Ops 3 Zombies is still one of the most enjoyable and addictive modes I have ever played in a shooter. Even after all these years, the gameplay feels smooth, fast, and incredibly satisfying. Every map has its own atmosphere and personality, and the variety keeps the game exciting every time you load it up.\r\n\r\nThe highlight for me is how well the maps mix challenge and fun. You are constantly moving, training zombies, completing steps, and trying to survive one more round. The mechanics feel tight and responsive, and the weapons are extremely fun to use. The Pack a Punch upgrades, the GobbleGum system, and the different strategies all make each run feel different.\r\n\r\nWhat I love the most is the replay value. You can spend hours and never feel bored. Whether you are trying to hit a high round, complete an Easter egg, or just play with friends, the mode always delivers. It is also surprisingly rewarding to learn the layout of the maps and figure out the fastest paths, the safest spots, and the little tricks that help you survive longer.\r\n\r\nThe atmosphere is another strong point. The soundtrack, the sound effects, and the map designs create a tense but exciting vibe. Some maps feel dark and intense, while others feel more adventurous or mysterious. It keeps the experience fresh even after countless matches.\r\n\r\nOverall, Black Ops 3 Zombies is the peak of the series for many players, and I completely agree. It is fun, deep, challenging, and incredibly replayable. If you enjoy zombies mode in any Call of Duty game, this one absolutely deserves a perfect score.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game, especially the mods that are easy and fun to use.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean its no black ops 1 or 2 but its split screen so its pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Games Decent But 14.5 Turkish Men Asked For My Ip and Booted Me Offline. ATleast They Were Nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing a totally customizable and flexible to fit your needs. Lots of content, fun, and mystery.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best COD zombies experiences with solid multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only play the game for the zombies. the rest of the game is ass. this was the last good COD in my humble opinion. enjoy the old zombies maps. dont look too much further.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic game, never fails to give you a good time. Each run can be different, even if the goal remains the same.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When i go to boot up the game it gives an error didnt take the time to look at it but it gives me an error everytime i try to boot it up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing besides all of the multiplayer modders but fun as always. would recommend getting it in the sales though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like this game i dont think ive played it enough though to actually know but so far its been really fun. every ounce in a while though you'll run into a hacker that crashes the server most for the hackers have very sexual names i ran across his name was \"i diddle dog dicks\" most of these hackers will have colored name tags and wont have a level. so if you're getting this and you come across these cheaters please report them even though it wont do much its worth a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "zombies is a lot of fun 3am with the homies running up some custom maps is fun. but the price if you dont get it on sale is very very very greedy and lame",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun was the best cod ever i love this game even now grew up playing on a ps3 then ps4 came out then this cod title came out with it and was the best memory i ever had i now play on pc and still love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has the BEST COD ZOMBIES OF ALL TIME. BO2 is good of course but BO3 easily takes 1st place when it comes to zombies. I played and BEAT the zombies maps for the 1st time on PS4 with my boys and then got it on PC since it's even better on PC of course. The workshop is super good as well, there's thousands of mods and maps that are still being made by the community TO THIS DAY and the zombies storyline, maps, and game mechanics with the gobblegums are the best that COD Zombies has ever had. BO3 is simply peak, so go ahead and buy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is vary cool from shooting to getting screamed at and called a monkey and the n word the game makes fell vary at home and vary happy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i recomend this game its very good but the match making is bad but atleast you can mod so yeah its a very fun \ngame",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story ain't the worst, and zombies is pretty fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great original zombie maps from treyarch and thousands of community maps. definitely pick this game up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just recently picked up this game for $20 because my friends really enjoy playing cod zombies. I’ve played a bit of the zombies and multiplayer and I can already say that this is so much more fun than the trash that is put out today. First off, the pick ten system is so cool and I really wish we had it in modern games. Secondly, the movement is smooth. The jetpacks and wall running are so much fun and incredibly balanced. The zombies is also so much fun especially since I can replay classics like kino der toten and ascension. The weapons feel nice, the movement feels good, and the knifing isn’t bad either. I’ve yet to play with mods but I’ve seen some insane videos of people playing as Kermit the frog and stuff. Overall, this game is 100% worth buying.\n\nP.S. Multiplayer is still very alive 10 years later and we don’t mention supply drops (my cs hobby addicted mind is too tempted by them)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Legitimately has *the* best cod zombies experience out of any of them purely because of the workshop!\n\nThis game also runs nigh perfect in Proton!\n\nJust make sure to grab t7 patch before playing (also works with proton)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Widely considered the best call of duty I suggest  it over all modern cods and will probably do all the easter eggs again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Get it for the Zombies, Multiplier isn't active anymore. The game has been out long enough to where you can play almost any map you can think of through the workshop. Maps that weren't added in Chronicles like Mob of the Dead, Maps that take the best from other maps and makes something new like The Iron Dragon. Then if you want to play a Minecraft map with BO1 Weapons, you can do that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the goat. Don't buy the newer games for rebranded, regraphic'ed slop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is really fun with zombies and if you get mods its just way better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game brings back memorys when me and my brother used to be hopping on xbox 360 everyday and play split screen on this  game    and yes it is my first time playing this on pc\n\nbut the loading screens the lobbys the everything is just perfect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Zombies in BO3?\r\nPeak.\r\nShadows of Evil, Der Eisendrache, Origins Remaster – alles Meisterwerke.\r\nDas war nicht nur zocken, das war eine richtige Reise.\r\nRätsel lösen, Perks sammeln, fünfmal sterben und trotzdem sagen:\r\n„Eine Runde geht noch.“\r\nManche Abende sind da einfach verschwunden, ohne dass man’s gemerkt hat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't believe that a game that is 10 years old, still holds up better than the slop that COD released this year.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "greatest cod oat\r\ncustom maps are the greatest",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Goes on sale often, worth the $20.\nMost bang for your buck Cod to date due to the mod support.\nOnly Cod zombies I'd deem a 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of the best Cod out there to this day.\nIts a shame activision greedy ass keeps selling the 10+ years games full price (outside of rare sales).\nGreedy fucks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a great game but with shit ton of buts. İt sad how Activision still charges people 60 dollars for this game.\n\nGame may not even run at all on your system even if everthing is fine. Everthing is hold on with a invisible tread which you cant even touch. One day it plays on it doesnt. And this game is a serious security risk without community patches dont play on normal vanilla server if the game runs use T7 patch. Only buy this game during sales or just pirate it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not as good as the original black ops and black ops 2 first time playing it through fully on ps3 couldnt get fully into it or the zombies which is my favorite mode giving it a fair shot again now though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game just too many bugs for it to be a comfortable experience in 2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This campaign gave me multiple stds that slowly withered away my sanity till I enjoyed what little the campaign had.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty cool, but my friend Shishkablob won't by this game because he's stupid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game, if you want a black ops game that feels better and has better story, pick this one, W game for sure",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The absolute best zombies experience in all of call of duty! Get the \"All Around Enhancment\" mod and download all the zombies maps that you can think of. Its all there right in the workshop. Game needed a restart when first launching and a restart when i downloaded the mods. After a restart the game works amazin,\n\nEdit dont forget to load AAE in mods when you start the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's my own game, and I don't need the internet or an overly secure platform to use it. Rather than needing constant company approval to breathe while playing BO3, I just play it, and it's mine, and there are no subscriptions or special abilities that \"totally don't privilege the other player\" when they spend $200 on a skin and then magically get 50 wins in a row because that win streak is definitely their luck and not anything else. BO3 is KING, and BO6 is just horrible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, love the zombies add on to breathe life back into the old call of duty black ops 1 maps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "get this game if you want to install it just to uninstall it 4 hours later and repeat the process over and over",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This community is amazing. Black ops 7 made me buy black ops 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "zombies, very fun, already beat the game got everything im better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nacht der untoten. 10/10 but cheaters are a big issue in multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you think activision can replicate this legendary experience, it can’t. \n\nThe gameplay.\nThe Zombies.\nThe multiplayer. (when it was in its prime)\n\nEverything of this game can’t be replicated. It’s just pure fun. Real and good fun.\n\nI would rather see you spending 80 dollars on this game than wasting 90 dollars of your hard working money on their “new” shitty 500gb Hulu ass menu with ai cards called BO7. It’s not worth it.\n\nWe miss the old times, but we have to admit it. It’s over. The last thing we can do, is just enjoy the good games that they created for us. \n\nSo if you want to just have REAL fun, get this game. \n\nBlack Ops 3 Forever ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grew up on it on console, just repurchased on pc and love modding the zombies, favorite COD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game but with problems 2.5 days i have full screen now i dont and in the private servers the bots are standing still",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game to play with friends! zombies are great and his workshop maps and mods ensures the game never dies! (the only cod that has workshop). Similar to l4d2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Graphics hold up well, and the campaign story is one of my favourites. Only issue is that multiplayer on mac no longer works ):",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shouldn't be as expensive, considering how old it is.. should consider permanent sale on these older titles. However, solid game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly...\nIf you are looking for more content - this is the game.\nIf you are looking a hidden gem - this is the game. \nAnd if you are looking for something different than what's popular now - this is the game.\n\nI'd give it 10/10 for graphics, controls, content, how well it aged and the campaign itself!\n\nHave in mind that it can be frustrating when playing multiplayer, cuz it got two main problems. First is the community plays only team deathmatch. This is in Q4 of 2025 so far. And the second problem is that you might occur some cheaters. Which for me it happens rarely!\n\nIt makes it 6 or 7 out of ten!\n(i personally think if the other mods were active the same way it is the team deathmatch, the game would skyrocket in terms of popularity, but its lil bit death...)\n\n\nWhen it comes to the price, it's totally worth if its on sale!\n\nIf it didn't have these problems, the game could be worth the full price!\n(It might be still worth for black ops fans!)\nAfter all it's alright for me. I mean, I played the BO2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, best cod game to ever exist, the peak of absolute peak.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Overpriced unless unless discounted, runs like sh*t because of their constantly checking for DLC thingy they implemented, zombies is fun if you pay 30 bucks for the maps. The Giant sucks WaW Der Riese is better. At least you don't need to sign in like new CoD titles or have to have multiplayer installed to play zombies online like Bo6. Plug and play as it should be. Well, after the minimum like 55 gigs. Overall you should probably only buy this on PC for the workshop stuff. Otherwise just get a physical copy for the xbox one as god intended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still 100% worth playing in 2025 mainly for the zombies. Ive played countless hours of bo3 zombies on playstation, and it never gets boring because of maps like shadows, DE, Origins, and Gorod. I also loved the campaign. You shouldn't buy it if you mainly want to replay the multiplayer, becuase the multiplayer is pretty much irrelevant now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but... the modded maps are better than the in-game maps. Sorry devs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love playing zombies, the campaign isnt too great. but all in all great game. awesome zombie dlc maps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still great and it brings back memories from OG Xbox and PS times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "luv zomb custom maps, crazy this game is still full price considering all the \"haackers\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Goated game. Too bad multiplayer is only team deathmatch nowadays.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best cod oat idc what u say even the campaign is really weird but the multiplayer is a 10/10 and same with zombies I genuinely love this game so much we need jet pack movement back",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after peeping the horror of bo7 this campaign actually isn't that bad\r\nzombies mode is awesome and still has an active playerbase\r\nmultiplayer mode is different but very fun\r\nit has splitscreen for people who like doing that\r\nif you want to buy an older cod title that feels just as good on steam as it does on console, definitely get this one on sale. (it's not too bad at full price either but it goes on sale very often)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah… I guess this was around the time they started making strange decisions and mistakes with this franchise, I would argue the newer games are significantly better than this, but… who am I, right?\n\nThe campaign is whatever, you get to create your character out of 20 same looking white guy presets. Then Christopher Meloni shows up? And he’s a bad guy? What the fuck.\n\nThe multiplayer is fine, I wanted to play bot mode offline but even if the game includes an option to play offline in the main menu, it locks you out of playing bots offline for reasons… you need a separate “non official” mod for that, and I’m not doing that for numerous reasons frankly… I ended up trying bots on the easiest setting while online and they were still a pain in the ass!\n\nZombies is where this game is at, heck, you even get remastered maps by simply getting the base version, and most of the DLC content advertises the zombie mode of the game rather than the multiplayer maps for example. There’s even mod support in the form of steam workshop and there are some awesome maps people have made… but this mode has never really been that interesting for me, so… I still didn’t find the pull here for me personally.\n\nSo yeah… this was just a big disappointment for me, only people who I would recommend this game to is Zombie COD fans, so if you love that mode, you’ll love this game because is the only real functional part of it frankly, and it's not even because of the mode itself but because of how freaking well the community has supported it, they even added offline bots to the mode... something that I guess Activision with its billions of dollars couldn't be bothered to do.\n\nEDIT: +set fs_game usermaps\n\nPutting that command right there starts the game in \"mod\" mode and lets you play offline with bots, fantastic, fantastic news.\n\nZombies with mods is insane so I'm changing my review to a positive as well, thanks to the community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The last great black ops game. end of an era.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W game all around the best cod to ever be released, gave me huge amounts of nostalgia",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All in all, I probably have well over 1,000 hours on this game between consoles. This is by far, without a doubt, my favorite game due to the zombies mode ONLY. The campaign is ok, the multiplayer is ass, but the zombies game mode is so good that it makes up for all of the shortcomings.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don’t waste your money on the new CoD games. Just get this one and be happy with the best choice of your life.\n\nZombies: ✅ (You can workshop and get modern maps most likely)\nCampaign: Train go boom\nMultiplayer: ❌\n\nQuite literally the last good Call of Duty Game next to Infinite Warfare (zombies, fellas. The game sucked).\n\nWith the release of the NEWEST and SEVERLY DETERIORATED CALL OF DUTY: BLACK OPS 7, it really shows how far downhill the CoD franchise has gone downhill. Riddled with microtransactions and the worst AI slop you can ever get from a CoD calling card, it is pathetic how far they’ve gone downhill. Don’t waste your money on the new CoD games. Just get this one and be happy with the best choice of your life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game campaign was very forgettable multiplayer very fun (not anymore cuz its dead) but mod support in zombies is a huge HUGE plus 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game when it comes to playing custom zombie maps. Still holds up to todays standers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Call of Duty: Black Ops III\r\n★ ★ ★ ★ ★\r\n\r\n22 hours in and somehow I’m still getting flashbanged by the sun, punched by robots, and bullied by Zombies that apparently trained with Usain Bolt.\r\n\r\nCampaign is… something. Don’t ask me to explain the story — I think I’m still downloading the plot. But the gunplay? Clean. Smooth. Addicting. Multiplayer is chaos, wall-running is still fun, and Zombies is basically where 90% of my hours disappeared.\r\n\r\nPros:\r\n\r\nGunplay still feels great\r\n\r\nZombies mode is peak CoD\r\n\r\nTons of weapons, maps, and mods on PC\r\n\r\nMovement system is fun once you get used to it\r\n\r\nCons:\r\n– Campaign feels like a fever dream\r\n– Multiplayer can be sweaty\r\n– Servers sometimes act like they’re on life support",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitive COD Zombies experience, all of the best map from world at war to black ops 2 are in here in zombie chronicles, amazing custom content as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To start my review this is one of the best cod game oat mostly because of zombies the remastered maps the new maps like shadows of evil just perfect who would'nt like it though it does take some time to progress through the map it is still really fun to play and they remastered kino which was my favorite map of all time i have mastered it in every way possible and i just love playing the story is mid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100% worth it if you buy it on sale. All the hours that I have in this game are from custom workshop zombie maps. ENDLESS FREE CONTENT :D no but seriously its truly amazing how fun modded zombies is. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i dont know why it took me so long to right a review for this game but this game is way more worth your money and time than black ops 7 by a land slide. i might be more of a black ops 2 guy but thanks to the work shop mods on this game and the goofy ah stuff you can do in zombies makes this one of the best black ops games i have ever played. this game is not worth it at full price and should drop its price for how old it is now but id rather you buy this at full price and black ops 2 at full price instead of black ops 7\n\nblack ops 2 campaign - 8 out of 10\nblack ops 2 online - 8 out of 10\nblack ops 2 zombies - 7.5 out of 10\nfinal score 23.5 points\n\nblack ops 3 campaign - 4 out of 10\nblack ops 3 online - 9 out of 10\nblack ops 3 zombies - 10 out of 10\nfinal score 23 points\n\nblack ops 7 campaign - what the fuck is this (skull emoji) out of 10\nblack ops 7 online - hit me with a car right after a beer out of 10\nblack ops 7 zombies - wipe my ass with 1000 grit sand paper than slap my ass and call me Golando the 3ed out of 10\nfinal score ai sloppy toppy",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "How can you sell this game full price when you cant play multiplayer without being hacked, and half the time you cant play zombies with your friends because the game won't let you join them for no reason (i've literally had this problem since the game came out 10 years ago). Fix your shit ass games Activision.",
      "voted_up": false,
      "votes_helpful": 215
    },
    {
      "review": "One of my favorite games ever, even after all these years. I spent basically my whole middle school playing this nonstop, and Zombies still has endless replay value today.\n\nBut in 2025 there are two things that are just unbelievable:\n\n1. Playing BO3 online still means risking your PC. You have to install community protection patches or some random person in a lobby can mess with your system. How this is still a thing in a paid game is beyond me.\n\n2. And then there’s Activision, proudly selling a 10-year-old game at FULL price like nothing happened. No fixes, no support, nothing. Just a price tag stuck in 2015.\n\nAmazing game trapped under one of the worst companies in the industry.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "I mean its ok.... Zombies is ok, full of cheaters but its whatever. But FULL price after however many years? thats ridiculous. Classic activision, and for that the negative review. Scumy.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "played a custom map and got stuck on a pole and died it was my fault I'm just upset",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Overpriced, even on sale costs too much for a game this old. Game no longer receives updates so there are many old bugs that will never be fixed. Price might be worth it if these bugs were addressed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Good game but the multiplayer has a good amount of hackers, zombies is still good and modding really helps the game but i'd reccomend getting it on console because people cant hack on there, campaign is pretty bad which most of us know so overall just dont buy unless you cant get it on console.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please explain to me how and why a game nearing a decade old is STILL full price, this game is [b]ONLY[/b] worth getting for the zombies gamemode, Activision has fully given up on this game and is only still held together by it's community. [u]This game has had MAJOR issues in the past with hackers being able to remotely execute code on random peoples PCs.[/u] Yeah the game is fun but at this point it's insane it's still sold at full price still being riddled with issues that have plagued the game for years.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I only care about the multiplayer mode, and it doesn't seem to work at all. For three and a half hours, I've just sat here waiting for a lobby to form. It never does, and I'm left to assume the game is either not working or completely abandoned by the fanbase. Either way I'm a little pissed off and I think I'll be refunding it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game but it's 10 year old and still cost 40 bucks on sale with all dlc, and the dlc is basically required if you want to enjoy the zombies in this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why does the NAT type change every 5 seconds so I cannot join my friends lobby. This is what makes the game unenjoyable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've put a lot of time into BO3 on console and got it on PC for custom Zombies. As a product overall, I do not recommend this game. If we're talking Zombies in particular. I absolutely get it. Just try to pick it up on sale for like $20. \r\n\r\nThe campaign is bad. The story and writing is it's main issue. While it was fun for a bit. At a certain point I just lost all interest due to the story, characters, and plot. The only redeeming aspect of it is Co-Op. Despite this, I would not recommend you play this Co-Op as you could do it in CoD WaW (through Plutonium preferably) or go to a different game series entirely like Halo (I highly recommend a Bungie Halo).  \r\n\r\nI really do not like BO3's MP. It seemed like Treyarch really wanted to make an advanced movement CoD without embracing advanced movement. At it's best, it's painfully mediocre with simple and uninteresting maps. At it's worst this is one of the most awful online FPS experiences I have ever played. All of the new and interesting DLC guns are locked behind loot boxes. Specialist abilities do not belong in a CoD game. CoD is not Overwatch. CoD is not a hero shooter. If you want to know what CoD is. Look at games like CoD4, WaW, MW2, BO1, and MW3. \r\n\r\nZombies is the one part of this game that, despite not being a fan, I highly respect. It's got a lot of content, remade classics, and custom zombies. There's a lot going for this mode in particular.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "playing campaign mode. utter crap. completely incoherent. I know its old but there's actually no point to any of the battles because your friends turn up to fight and never die anyway so what's the point in you being there? I don't know maybe its me? Some woman keeps jabbering instructions which don't mean a thing because you die anyway and you can't properly hear what she's saying because of the combat. The story seemed to build up ok in the beginning but by the time you get to some \"Asian dome\" the whole thing falls apart. not really any story and therefore not really any game as such. unless you like collecting weapons and upgrades, collectables etc. I can't understand how it became so popular.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My big issue with this game is its vulnerability to exploits, it bugged me so much just to know I was potentially at risk just for trying to enjoy a game as advertised.\n\nThe zombies mode is really awesome but I was never a huge zombie player myself add to that the fact I don't feel safe trying to join lobbies because of said hacking issues mentioned earlier which just further degraded my experience.\n\nI also tried one mission of the campaign but felt unwell doing so, I believe I forgot this is probably the only call of duty campaign I never finished due to how it just does not sit well with me...\n\nPerformance was also a bit iffy, from what I gather owning the season pass can potentially drop your frames alongside other issues, I found the game to run fair enough as is even if I was submitted to stuttering at times.\n\nOverall I did not enjoy my time with the game, I think if you don't mind spending time patching the game and using third pary tools to create a safer and more stable environment or if you are way less sensitive to all this catastrophising this might be totally it for you but sadly it is a hard pass for me in such a state !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you are planning on playing this game solo or locally, Black Ops 3 is quite possibly the best zombies game out there. Other modes like multiplayer is alright, and the campaign is sub-par compared to previous titles in the series (i.e. black ops 1 & 2).\n\nHowever, if you decide to play this game with any form of human interaction, look elsewhere. To play Zombies or any other mode without the looming threat of having your PC compromised, you will have to acquire third party programs that fix what Treyarch/Activision should have ages ago (and still haven't to this day). If you play without those programs, anyone can boot you from the game, steal vital information, and ruin the experience entirely- this is all to say even if you try playing in a \"private\" lobby. Others can randomly join simply by clicking a button in a list.\n\nThis is my favorite game for its workshop within zombies. It has always stuck with me but I cannot recommend this game, even now, as Treyarch have dropped the ball on programs that help players who simply don't want to be hacked while trying to enjoy the game they bought for 60 dollars (mind you this game came out 10 years ago).\n\nId say get it while it is on sale and be careful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have tried to play this game, however I constantly experienced rubber banding in all of the game modes even known I had a stable connection in Battlefield games and Call of Duty World At War. \r\nMultiplayer is littered with hackers to a point where you have to download a file to ensure safety but even that has its flaws. Even if you do the multiplayer is dead.\r\nThe zombies can be fun and a timeless classic where the custom maps come in, but when playing with friends, it feels like torture even by yourself. With constant disconnections and lag or even the game refusing to close or open on steam taking forever. I get the game is old by 2015. But for its current price which is way too expensive now, It deserves to be marked down. I implore you to get this on discount. - Angry ranter...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After some research the game doesn't seem to work on Nvidia 50 series GPU's. Game will randomly turn dark/blurry and NVIDIA nor Activision seem to be willing to fix it. Wish I could get a refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Resolution is messed up - cannot change settings - tried multiple things from google with no avail. cannot play. Refunded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "have to download third party addon to not get hacked in the online multiplayer. only good part is the zombies",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "They should stop[ selling multiplayer online games if NO ONE is playing them  This is an example of that kind of ripoff.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "$20 for this 10-year-old game when it's not on sale. I know that's the same for most COD games regardless of age, but it's still stupid. Haven't come across many hackers on multiplayer so that's good. As far as zombies goes, you better get used to Shadows of Evil if you don't feel like spending more money on this game. The vanilla experience gets repetitive after a while. Campaign is quite boring but that's quite subjective I suppose. It's fine but $20 for this game doesn't feel justified anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought it to play zombies because of nostalgia, it doesn't work properly on Macbook Pro M3 Sequoia, crashes all the time and is full of bugs and can't find online games... I thought I got a bargain but threw away money instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "https://youtu.be/PggHRL8t1gg\n\nAfter a decade post release the multiplayer base is either die hard fans or people exploring free options that when combined make for unbalanced team makeup.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "got it for modded zombies. Not worth the price. Activision sucks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I bought this for Mac OS. Doesn't work at all, complete waste of money, no recourse at all. Don't bother.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought it on sale. Expected jank. Jank ended up being jankier than anticipated.\n\n\nPer the devs, \"An unknown issue prevents MacOS users from accessing the online servers. We are working on a fix and will update players as soon as it is ready.\"\n\nOf course I figured that out AFTER making an account with these sketchballs so yeah I feel kind of gross about that.\n\nThe announcement from the devs (not even an announcement, it was buried deep in the discussion page) was *years* ago. There's supposedly a fix on GitHub but it fails Gatekeeper, and frankly, I don't think it's worth the trouble to pick apart the code and override it, and why the fck am I having to get GPTK-tier deep into my terminal to play a meh shooter from 2015?\n\nYeah, it's $20 right now, but frankly I think i'll be better off putting my money to better use on RoR2 DLC or somethings similar, and just playing Easy Red 2 when I need a shooter fix.\n\nValve, if you're going to sell something for Mac, make sure it actually runs on Mac. Dying Light is listed as Mac but was never even ported. This bait-and-switch is somehow worse.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's aaaaaaaaaaaaaaaaalright for a bit until your friend tilts at you because he has 500 hours playing zombies and looping and you don't",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst game i have ever played zombies take 30 shots to the head on the lowest of rounds yet they dont die!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is my game and only mine. Nobody else can have it. If anyone buys this game they will get slimed out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "full price for a 10 year old game where you can get hacked for playing online",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "black nigger zombies killed me then hit a kirk twerk on my derk while stealing my femboy shirt because hes a nigger",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i am using a macbook air intel and i payed 90 dollars and now black ops 3 doesn't work online. Come on people this is a freaking joke. I cannot play online zombies or multiplayer how ridiculous is this???????",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "they broke the multiplayer, can't recommend",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game sucks do not buy activison are terrorists",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the screen resolution is completely wrong 1 star",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont remember ever playing this so prob not worth it everyone.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate black people less than activision which is saying something",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Multiplayer wont work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DUMB GAME THIS SUCKS. I DIDN NOT RECIEVE THIS FOR FREE",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "zombies split screen fundementally broken on PC",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "call of duty sucks but zombies are cool",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "zombies in spaceland was better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "idk i only play it for the zombies. COD really fell off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For all of the hype this is absolute Garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "completely unsafe to play",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Never had a harder rage moment until i played this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "servers suck balls",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Zombies is the only reason you should buy this (at sale).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "multiplayer doesn't work",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game stink like shmegma",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesnt open, shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Slop, only here for the zombies </3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "multiplayer doesnt work btw",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Doesnt even bother to open",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can’t play multiplayer on steam deck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fk this game gta is batter",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not enough weapon skins based on 2016 Roblox Avatars",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesnt even open",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck this game broken af",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dog shit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overrated garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's so expensive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "won't launch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "doesnt have a fortnite collab yet",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "idrk its alr i guess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't like it...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fix your fucking game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "zombie hurt",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pig eating slop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "peepee poopoo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit gamw",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad host",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SNORE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "poche",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wak e up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i fucking hate my life. i dont get any money and i live less then 4 minutes away from Bo. im going to kill myself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1] *** CRITICAL VULNERABILITY *** [/h1]\r\nSimply having this game [b]open to the main menu[/b] while connected to online services renders you [b]vulnerable to remote code execution (RCE)[/b] by an attacker! Launching into a [u]private[/u] match increases your risk. Launching into a [u]public[/u] match massively increases your risk.\r\n\r\nSee: CVE-2018-20817 (among others).\r\nA 2023 patch from the developers narrowly addressed some specific vulnerabilities as initially reported, but systemic flaws remained, leading to additional methods of attack being found that currently remain unpatched by the developers and known to be in use.\r\n\r\nThere is a community patch that MUST be used to avoid this!\r\nSee: T7 Patch on GitHub (do not trust alternate sources, fake versions exist in circulation)\r\nFull disclosure: I have no idea if this patch is itself safe, or 100% effective, but it is widely recommended and considered essential before even considering launching the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "سئشءسؤء",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5/5\n\nGreat game but paying $60 for a game thats 10 years old is crazy. In 10 years you cant drop the price at all?\n\nI'm not going to recommend a game that you have to wait to go on sale or acquire through different means.",
      "voted_up": false,
      "votes_helpful": 283
    },
    {
      "review": "How can you sell this game full price when you cant play multiplayer without being hacked, and half the time you cant play zombies with your friends because the game won't let you join them for no reason (i've literally had this problem since the game came out 10 years ago). Fix your shit ass games Activision.",
      "voted_up": false,
      "votes_helpful": 285
    },
    {
      "review": "10+ year old game long abandoned still at full price should be illegal. Zombies is one of the best in the series since it includes almost everything that came before. Please don't spend over $100 on this. Get it for sale or yar har it.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "One of my favorite games ever, even after all these years. I spent basically my whole middle school playing this nonstop, and Zombies still has endless replay value today.\n\nBut in 2025 there are two things that are just unbelievable:\n\n1. Playing BO3 online still means risking your PC. You have to install community protection patches or some random person in a lobby can mess with your system. How this is still a thing in a paid game is beyond me.\n\n2. And then there’s Activision, proudly selling a 10-year-old game at FULL price like nothing happened. No fixes, no support, nothing. Just a price tag stuck in 2015.\n\nAmazing game trapped under one of the worst companies in the industry.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Completely unsafe to play multiplayer due to pier to pier hosting that can let other people access control to you PC. do not play any cod before 2019 online. Zombies with friends is fine. your PC has a very security risk playing these older games",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Zombies are great and the custom maps that the community are developing for this game, are just perfect.\n\nBut I just cannot recommend this game for several reasons:\n\n - There are security problems, you are completely exposed to cyber-criminals when looking for a public match, either in zombie mode or multiplayer mode. There are methods to circumvent this, such as the BO3Enhanced, but relies on community efforts and so it's not included in the base game, nor the price.\n\n - Stuttering issues, specially while navigating the menus. Again BO3Enhanced solves this. \n\n - Dead multiplayer. Depending where you live, there is a small chance that you will find a lobby with player, but they are usually half full and there is a high chance that you find hackers on it. This also makes it really hard, if not impossible, to complete all the achievements in the game.\n\n - Campaign feels poorly developed.\n\n - Microsoft/Activision didn't give a **** to update and fix the game on the rest of platforms, they only fixed it on microsoft store, and only because they are including it now with gamepass.\n\nAnd any of these arguments wouldn't be a reason to not recommend this game, if it wasn't for the price. Paying 59,99 for the Zombies Chronicles Edition, for a 10y old game that has this many problems... is just a joke to me. You can get it for 19,79 on discount, but still feels like too much to me.\n\nIt's like Activision either cares too much about money, or doesn't care about their fans and COD franchise at all.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If you are going to play this game you will HAVE to download t7 patch by Shiversoftdev on GitHub. With this you or a party of friends can safely play private Zombies lobbies. Without the mod your computer is at risk at being hacked and your information stolen!!!! Cod WW2 has similar issues and why it was taken off Xbox's Game Pass. I know that they recently added it back to the service. I just wish Activision would properly fixed this exploit but it seems like an engine ingrained issue that is probably a nightmare to fully patch.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I mean its ok.... Zombies is ok, full of cheaters but its whatever. But FULL price after however many years? thats ridiculous. Classic activision, and for that the negative review. Scumy.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "60 bucks for a 10 year old mid cod game, activision can eat shit and die",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "played a custom map and got stuck on a pole and died it was my fault I'm just upset",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Good game but the multiplayer has a good amount of hackers, zombies is still good and modding really helps the game but i'd reccomend getting it on console because people cant hack on there, campaign is pretty bad which most of us know so overall just dont buy unless you cant get it on console.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Zombie veteran from the good ol' days here. \n\nIn my \"getting older years\" I've developed a stupid condition where flashing lights give me instant migraines. I hoped I could get this on PC and there would be in game options or even a mod to remove things like muzzle flash so I could enjoy zombies again cause I kinda hate all the new zombies.\n\nBut unfortunately there isn't anything like that in the options and it seems the modding community didn't put out a mod for it either. I love BO3 and all the COD Zombies but unfortunately it looks like BO3 is something I can't play ever again.\n\nJust wanted to put this review up in case anyone else has a light sensitivity issue, BO3 doesn't have any options available for removing flashing lights or muzzle flash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You are here for the Zombies, which in this game brings with it by far the best offering out of the whole of the COD series. There's even mod support, making it a unicorn of modern AAA gaming. \n\nThe campaign is shit and the multiplayer is mired in cheaters these days.\n\nDo not even consider adding this to your cart if it's not on sale. Why is this game that's a decade old still up for full price?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love this game but STEAM DONE FUCKED UP!! WHY DO I HAVE TO BUY A separate bundle for the campaign when I already bought the fucking game!!! LIKE WHAT!!?? AND ITS 40 Fucking BUCKS!!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "FUϹΚ you Activision. Someone should Luigi some board of directors just off the price tag alone.\n\nYou have to install a whole separate program to make sure hackers don't join your lobby and RAT your computer. Don't worry, you have to pay $60 for this insanely huge security flaw. The game is only 10 years old ya know. Some jerk off sitting at home needs to see green lines go up, so the price tag is actually very reasonable. Steam workshop is awesome for zombies maps <- This is the only reason to purchase the game currently. The game opened in fullscreen in a resolution larger than what my monitor can display. Does the game stretch to fit your monitor's resolution? No, you just have to guess where all the settings are. In World at War the game starts at a LOWER resolution, so this issue is easier to fix. Why is motion blur enabled by default?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Please explain to me how and why a game nearing a decade old is STILL full price, this game is [b]ONLY[/b] worth getting for the zombies gamemode, Activision has fully given up on this game and is only still held together by it's community. [u]This game has had MAJOR issues in the past with hackers being able to remotely execute code on random peoples PCs.[/u] Yeah the game is fun but at this point it's insane it's still sold at full price still being riddled with issues that have plagued the game for years.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the game wont even load up. iv been trying and trying to the point of pulling my bloody hair out over this ridiculous problem. god knows how iv racked up nearly 50 hours of \"play time\", unless it accounts for the time that iv been trouble shooting it. i havent gotten past the dreaded black box that pops up, despite trying literally everything. i even wiped my entire computer, deleted steam and reinstalled it, followed every online guide and still nothing. \n\niv given up, and i hate admitting defeat. My old mans a programmer and even he couldnt get it working.\n\nMy pc is high spec and runs bo6 in ultra on every setting at 400fps so it is more than powerful enough to play a 10 year old game. \n\ndont even bother buying this unless youre on a console.\n\nSTEAM DENIED ME A REFUND BECAUSE I HAVE TOO MUCH PLAYTIME EVEN THOUGH IV NEVER MANAGED TO OPEN THE FUCKING GAME",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "your nattype system sucks anytime i remotely think about playing multiplayer it goes from moderate to strict",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Overpriced, even on sale costs too much for a game this old. Game no longer receives updates so there are many old bugs that will never be fixed. Price might be worth it if these bugs were addressed.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}