{
  "positive": [
    {
      "review": "This game was the only thing I'm able to do on the computer after a very bad burnout at work. I couldn't open my computer for months, but I was watching some playing on yt and I decided to give a try. It's literally helping me to heal.",
      "voted_up": true,
      "votes_helpful": 337
    },
    {
      "review": "I don’t know about you, but I’m tired of games marketing as cosy when they’re not, just another ploy to get attention from cosy gamer. So, is this game one of those quick cash grabs with little to no love put into it that’s be the norm recently. \n\nNo, it’s not. In fact, it’s the exact opposite. \n\nThis game is beautiful, charming with easy to learn mechanics, and oozes with creativity with no stressful elements with wonderful soundtrack; the true definition of cosy gaming. Even the NPCs are delightful and have their own little quests on they’d like to see to improve the neighbourhood. I’ve only had this game for two days and i’ve already clocked 10+ hours into it. One major feature enjoy about this game compared to other city builders is the money aspect, I always end up running out of money then have to resort to taking out loans with an impending timer looming over me, this game doesn’t have that (thank god!) so I can take my time and really enjoy designing my city.  \n\nMy only gripe is there’s no Steam Deck or controller support and I do hope that is added eventually. Regardless of that, I’m having a wonderful time with Town to City, and I’m thoroughly looking forward to all the upcoming updates as it heads towards full release. ⸜(｡˃ ᵕ ˂ )⸝♡",
      "voted_up": true,
      "votes_helpful": 101
    },
    {
      "review": "I rarely leave reviews for games (or anythings at all, honestly), only when something truly captivates me or really disappoints. Town to City is the first case.\nThis is one of the simplest, coziest, and surprisingly well-crafted city builders I've encountered. You don't need to be an economics genius to keep your city profitable. Citizens won't hate you for every wrong decision and won't flee in droves at your first mistake. You don't need to be an architect or designer for your city to look genuinely beautiful.\nThat's the main charm of this game. You don't need to try too hard to simply enjoy the process. You build, watch your city grow, and have fun. No stress, no endless micromanagement, no feeling that you're doing something wrong.\nTown to City is a game that lets you relax and create at your own pace. If you're tired of complex simulators where every action can lead to collapse, or you just want to spend an evening on something pleasant and meditative - this is your choice.\nWholeheartedly recommended.",
      "voted_up": true,
      "votes_helpful": 48
    },
    {
      "review": "awesome! its awesome! so much so i bought this game twice! both of the purchases were for the deluxe edition. \n\nFirst off: Cozy.\nthis game is super cozy! non of the missions are forced. You can take your time with each quests. All the villagers are \"super patient\" and will allow you to take as much time as you need to keep everyone happy. so no pressure!\n\nsecond: Mechanics\nbro! aside from some changes that i thought would be more fluid to move around/ zoom. the hyper detail is just wicke! if theres space to add some decoration, you can add it.  It's not just one or two options, many options are available. \n\nthird: Potential\nthis is still in the early access game? Id never known. The first town is just awesome to work throught. But there are three other areas! town builder check, farm builder, check! I havent even discovered the last one and I already have my hands full on the first town! \n\nfourth: Super Fun\nI've clocked in four hours and got passed by my wife in terms of townpeople. in less time she has 620 townies while i have half that! How did she do that!? idk but ima find out and play some more! \n\nfifth: SteamDeck \nits super legit on the deck as well! its fluid and honestly i kinda prefer it over mouse and keyboard. However the minute details is something that im into so ill stick to the computer for now. \n\nsixth: Scale\nyou can zoom out into a birds eye-view or down to the gravel level! you can see your townies move around and live their lives! Or, and here heres the big one for me. you can zoom into the shops or houses! like the barbershop. you can zoom in and see the inside. Dope. \n\nfuture Recommendations: \nIt would be awesome, as the mayor, to be able to walk your town! if the devs can make it first person THIS WOULD BE THE BEST! i mean we put so much effort into the details its would just elevate this game.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "I haven't felt this excited to play a game since forever. If this game wasn't labelled as early access I would never know coz of how stable and fleshed out it feels. The design of everything is incredible, the gameplay is perfection and the decorating and assets make me believe there is a god out there, but its the devs of this game. I could not recommend this game enough.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "So many games claiming to be cozy but in reality the're either stressfull or straight up boring. Town to City really fits all the boxes to be a cozy game:\n\n- Stakes are there but not to high: Quests to keep you going but there is enough freedom to be creative\n- Micromanagement without stress: you don't need to set road traffic rules but you can give each house a little flower pot. Or a bench. Or a poster. Or a parasol. Or a flag (flying or hanging)\n- easy to get in: good tutorial and mechanics \n- Great visuals: Cute pixel style with such good lighting to set the vibe\n- Calming score to relaxe to\n- Active devs: game gets reguarly updates with: needed but also with seasonal stuff\n- Good amount of content for an EA game\n\nThere are some things that I wish would get an upgrade, like the road tool or increasing the villager amount without frame rate problems but overall I really recommend the game if you like city builders, and cute and relaxing cozy games.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "When I first saw Town to City, I didn't think I'd be that obsessed but maybe I was lying to myself because I abolutely love these sort of simulation games - and on top of that I enjoy how forgiving this game is, making it super cozy. First saw a streamer play it then immediately checked out the demo.\n\nI really enjoy the older aesthetics of the game and how customizable your city can be. I would recommend this game for any creatives who enjoy management sims, but don't want to be stressed out by it lol. Personally, this doesn't feel like an early access game to me because of the lack of bugs I've experienced and also how much content there is. Super excited to see what else is to come!\n\n[b]Current Recommendations for Game Changes:[/b]\n- i love the mechanics and all but i do wish the upgraded road tool was more of an overlay. something that wouldn't have to go over your existing roads. those upgraded roads were a game changer for transportation but then my roads looked so ugly LOL",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Cute, relaxing city builder that you sink hours into without realizing it. The game is easy to understand and lets you decorate the map down to placing individual houses and flowers. If you like city builders but are sick of micromanaging things like traffic and sewage then this is the game for you.\nLooking forward to seeing where the developers go with it.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Town to City is a cozy voxel-based city builder that offers relaxed, creative gameplay. I've had plenty of fun decorating my towns and managing resident needs such as food, leisure, clothing, and services. Supply chains matter here, as shops must be stocked via runners connected to warehouses through well-planned roads. Maintaining resident happiness above 60% ensures new workers arrive by train. Anything less and you might find yourself in some serious trouble! \n\nAs you progress, you unlock more decor and entire new industries through research, which allow you to meet the demands of higher-class citizens. The game also includes story-driven requests from residents, adding charm and personality to your town.\n\nYou begin in Belvau and eventually unlock new maps like Fontebrac, each with unique challenges such as farm production. Since the game is still in early access, some areas and features, like pets and farm animals, are not yet available but are listed on the developers’ roadmap.\n\nA major strength of the game I'd say is its combination of cozy aesthetics with meaningful progression. Players can follow objectives at their own pace or switch to sandbox mode for freeform building. Compared to complex city builders, Town to City keeps management simple: there’s no deep economic micromanagement or the risk of going into debt.\n\nFor me at least, the free-range road-building tool is definitely a standout feature, offering flexible, organic layout options and adjustable road widths. However, buildings sometimes require manual adjustments when placed, even with the “snap to road” tool.\n\nOverall, I'd say that the game is a charming, low-pressure city builder with satisfying progression and thoughtful design. Though it's still growing as an early access title, I'd highly recommend the game to any cozy game or (casual) city-builder fan!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I love simple, cosy games and that is what this game is. So I give it 25/10. Not been able to bring myself to actually complete the game yet as I love it too much. That doesn't matter in this game though as there's no pressure, no constant pop ups to complete tasks.\r\nMy one issue is sandbox mode well it just isn't. Still have to progress to unlock items but the extra worlds included are as beautifully designed as the rest so more than make up for that.\r\nWith a free demo too what more can you ask for. \r\nLooking forward to see what's next as what we have now is top notch",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is THE aesthetic city builder for me! The game balances perfectly between being relatively easy but also keeping things interesting. It has just enough challenge in how you upgrade the cities, satisfy the needs of the citizens and the specific quest goals to keep things interesting. Meanwhile things never really get so dire that if you want to just take a while to decorate with the game unpaused the whole world isn't going to go up in flames- everything will be fine. And that's why this qualifies inherently as a chill game, in the best way possible. \r\nThe art style is absolutely gorgeous and importantly for the game it really works at both a micro and macro level. It's fun to see your bustling town either from a far distance or really up close as you add individual details to the buildings. Also there's something extremely fun and innovative about how they've handled the decoration assets. The fact that assets change whether you're adding them to a building or on ground or on the water not only keeps the decoration menu smaller, since they don't have to add every single iteration of an asset, but it also adds this wonderful sense of discovery. You unlocked something new? Time to see what it's going to look like in the possible different states! I kept discovering new things I could do with the decorations and it really added a lot of joy to the game. \r\nOverall this game is really a 10/10, I haven't tried the sandbox stage yet but I'm mostly just looking forward to new expansions and updates and seeing where this game will go. I would highly recommend it to anyone who enjoys building and decoration in games, city planning, or just a chill experience in general!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is a lovely game and with the new first person mode, it fulfills a long term city builder wishlist. Make no mistake, this isn't a city sim, it's a decorating game and at that it excels. There is a part of me that wishes there was more of a city sim here, but that's not what they've made or advertised. For what it is and what they've said it should be, it's spot on. If I could give any feedback it would be that I'd like to see far more skins for the various buildings as cities can seem to all look the same after a bit and if you're going to let us explore the city on foot, let us visit and decorate the exteriors and interiors in that mode. Maybe even add a little Sim like gentle life simulator down the road. Overall, already worth it at it's price if you know what you're in for. Well done.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just an amazing cozy time. The city building mechanics are easy and money is not really much of a problem. It is all about the detailing! I am not usually into that much detailing but this game just makes it so easy and fun. As they add more and more detailing options and buildings it will only get better and better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Please add to mac systems! I tried playing on my Microsoft surface, but it was slow and kept crashing so I had to request a refund. The few minutes I was able to play, it was such a fun and relaxing game! Truly a game that I would love to play, if available on Mac/more PC systems. Definitely would buy again if it worked on my system.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Playing this game is definitely a cozy experience, even tho your citizens might be unhappy, or you might not have open housing slots, there's no rush. You can design your city the way you want, you can zoom in to see what the people do, or watch your brand new park from a closer perspective, it doesn't matter, take your time and enjoy !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Suuuper cute game!! It’s one of those titles that immediately hits the cozy itch. I’ve been having so much fun decorating everything—houses, patios, little storefronts—and nothing ever feels tedious. The quests are actually enjoyable too, which is rare for a building game. Each villager wants something different, like “well-lit” homes where you get to play with lanterns, or someone asking for a house surrounded by trees. It keeps things fresh without ever feeling stressful.\n\nOne of my favorite parts is how clever the decoration system is. You can click a single item type, like flowers, and it cycles through different styles—window flower boxes, garden beds, little planters. Umbrellas turn into cute awnings, potted plants automatically switch between porch plants, street plants, or hanging baskets depending on where you place them. It feels super intuitive and lets you get creative fast.\n\nIf you love games like Tiny Glade, or just want something relaxing to sink into after a long day, Town to City is a perfect cozy pick. I’ve been decorating non-stop and don’t see myself slowing down anytime soon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i will start by saying that this game does not feel like an early access game at all.\nit has so much depth beauty and things going for it that i would gladly play double for the game just as it is.\nThis game is Great!  the graphic style is beautifully stunning, the lighting is incredibly cozy. and there is so much in the game already to build with.. just the fact that i spent the first 2 hours putting street lights all round the roads untill i by mistake sneezed and the mouse flew over a house, and the street light turned into a hanging light above the door of a resident housing.  almost everything changes to something good when you try to place it in areas where you dont think they can be. there is so much to unlock, so much to play round with, and the fact that you can freely change the road sizes, types, and flow like the wind to paint to your hearts content through a self made park for your little people to walk round in.. There is enough to do and keep you engaged when it comes to micro manage your town Yet it never feels stressfull, it never feels like you are about to lose your save game by bankrupsy or stuff like that.. you take a deep breath relax and just do it in your own time and phase..\n\nthis game is seriously the best city building game ive played.  cant wait to see what the developers have in mind for the upcoming updates.. they should be proud of this game that they have created.\n\nDefinitly Worth A Buy ! <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I adore this game. It's easy to learn, cozy, charming and super relaxing. Everything fits perfectly, from the style down to the music. \r\nDefinitely a little gem worth trying.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I first discovered this game by watching lilsimsie play it on twitch one day. I absolutely love town builders but always get so overwhelmed and bored easily when certain aspects make it hard to progress the city further, but with Town to City, the money aspect is so easy to where you can really pay attention to details and not have to worry about \"suffering the repercussions\". It's easily one of the games i gravitate towards at the end of the day, or if i'm just not in a good headspace and want a distraction. For a game that is in early access, the devs have taken their time with what is released so far and it shows ten fold. A beautiful game graphically and gameplay wise. The tiny side quests from the townsfolks also help with not focusing on one area and really utilizing the space they give you. If you've been wanting to check it out, i'd no doubt recommend it. I look forwards to future updates as the game progresses to full release! :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super fun and cozy game! I compare it to a slower paced Anno 1800 gameplay without all the fuss. While the graphics are not what I prefer, it isn't too bad during actual play. I am quite enjoying it so far!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm really enjoying this game so far.\nI want to thank the developers for putting out a demo. I was initially unsure if I would like the game, downloaded and played over an hour of the demo, then decided I definitely wanted the game and purchased it.\n\nThis game cares so much about small details and you can really get creative. Unlike other city building games I've played recently, it gives you so much more freedom. I love how the effort you put into decorating is rewarded as well, it's not just for show.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has such a cozy and wholesome vibe. The art style is so unique and beautiful. The menu and UI sounds are satisfying, just what you want in a cozy game. The gameplay is as you might expect from a city builder but on another level where you get to decorate individual homes and add unique charm to every building and landscape. This game came to Early Access as complete as some of the AAA games that have released lately. The Devs keep the community up to date on their progress and have a clear roadmap of their plans ensuring people can expect great things. I could (and have) spent hours just enjoying the simple things like adding flower pots to balconies. 10/10 would recommend if you enjoy cozy, bright, wholesome games and/or city builders",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely love the style of this game!!! Took me a bit to realize that the distance a house can be to a shop is pretty far and I have been loving figuring out different ways to organize the town!! 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely beautiful game, an absolute unit. Fun to come home and play after a relaxing day of setting people in bondage. Playing Town to City just turns off my brain, its a break from the non stop blood gurgling screaming that plays in my mind on repeat. Past events of carnage cease to exist in my brain housing group while eloping with this game. This game cured my depression, and my erectile disfunction. 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I can't believe how much I adore this game, so cute and so addictive. Can't wait to see how the game expands with further updates :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is SPECTACULAR. It's safe to say that I'm obsessed. \r\n\r\nI do have a few suggestions, mostly quality of life and aesthetic stuff. \r\n- Undo and redo buttons\r\n- More house colors\r\n   + ability to change the color of a house after it is placed, probably using c/v (this could fit in as a new mayors request, where someone wants their house painted)\r\n- more flower colors, I've noticed that we are specifically lacking blue\r\n- Ability to place decorations closer to buildings\r\n- A large granary, similar to the large warehouse. I find myself having to place way too many granary's (about 1 per 4 farms).\r\n- Several people have talked about not liking the look of the upgraded roads, I'd suggest that each road type have it's own style of upgrade (packed dirt road upgraded from dirt road, etc.) This is the type of game where I don't think beauty should be sacrificed in the name of efficiency.\r\n- The ability to change the game settings once a game has been started (would still disable achievements, this is mostly for sandbox)\r\nLastly,\r\n- For the sandbox map that's an island it doesn't make sense for there to be a train, I think it would be really great if a ship brought the townsfolk instead. It would pull up to a little harbor and doc, that grows just like the train station, maybe the ship grows over time as well.\r\n\r\nI love this Town to City and I can't wait to see where you take this game to next!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I adore this game. It is quite literally, addictive. The art style is so cute and the ability to create towns and cities, neighborhoods and shopping districts with free creativity is just perfection. It's a laid back town management game as well with the townsfolk being very patient with no repercussions. I 100% recommend this to any cozy gamer in search of a cute and laid back city builder without the stresses of extreme management. :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is, in a word, delightful. It has some challenge, some planning, but no pressure. Everything that happens is on your schedule, and there's no emergencies, disasters, or real problems to manage. It's just a charming little game that lets up develop, organize, and build a city. \r\n\r\nThe 'tism approves. It's got some challenges in the organization and logistics end of things, but there's no real push to solve them in any kind of immediate manner, so you can really take your time and consider how you want to do things. It makes it so much more pleasant. The music is great, and the art style is charming. Overall? Absolute win.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cosy little city builder with lovely music. Prepare to lose hours calmly decorating your village.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cozy fun game to sit back and relax to, the music is really nice the graphics are quaint and charming lots of details and the decorating is very satisfying. Addicting time sink. I'm excited for future updates and more content. So far this is all I want to play at the moment.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great balance of management and creativity. Story events help guide expansion without feeling oppressive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Commenting after 47 hours of game time.  \n\nThe game is in Early access, and has only been out for a couple of months.  You will recognise the gameplay loop from similar games in the past (and currently), but this one does have some differences - especially with its decorations and ways of keeping your citizens happy.\n\nAs for the amount of content, it has a few sandbox maps and a campaign that allows you to link up 2 maps to 'feed' each other with resources.  There is a third map planned, and once you hit 40 hours or so, you will want that map to materialise fairly soon.\n\nOne thing I would really like is the ability to link up multiple maps in sandbox mode, but you can't.  Therefore you end up hitting the 1000 citizen cap really fast.  It does let you go further but it warns you that the game isn't optimised for it.  So far, I've made a city with about 1300 citizens, and I still have room  for more.  If you linked up the maps, you could have 1000 in each of those maps, link up resources, and then you wouldn't have an issue with optimisation.\n\nAnyway, this isn't a review as such, but just some comments about the game as it is should you be researching it and considering buying it.  Well, in a world where there are now dozens of choices in this genre - and I have most of them, Town to City does stand out in it's own way, it just needs a bit more content and maybe punch up a bit when it comes to difficulty.\n\nFor an early access game, in its current state, I'd give it 8/10.  I'm sure there is a lot more to come, but I might give it a break for a month or so when the pets and animals update is well bedded in.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a game that lets you strive towards concrete in-game goals but also lets you just slow down. A practice in mindfulness for my depressed self honestly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the detail oriented nature of the game. I find the voxel actually very cute. The game also has an unhurrried nature to it. Lots of room for creativity.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Lovely cosy game with very nice decorating mechanics. I have recommended this game to several of my friends, which also started playing and we've all enjoyed it thoroughly. \r\n\r\nThe music in this game is very relaxing and enhances the gaming experiences.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Super cute. The music lives rent free in my head. It's hard enough to keep you interested but easy enough that it never feels stressful. Literally the only bad thing about this game is that it devours hours at a time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is so crazy adorable. I haven't played many city builder type games before and I'm not familiar with voxel, so I went into this blind and scrutinous. Happy to say that I've fallen in love immediately. I love that it's so accessible and \"easy,\" no stressful time constraints or ways to \"fail,\" so you can just relax and have fun with it. The look of the game is honestly gorgeous too; the lighting and colors are vibrant and lively. The ambient sounds and French-esque soundtrack are subtle but pleasing. I played for a couple hours and was shocked to discover I'd made a whole-ass town when I'd started off not really sure where to place the first house. I love it, will definitely be diving in when 1.0 drops as well, but it's worth a purchase as-is. There's nothing unpolished or unfinished feeling about it. Give it a go :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Thoroughly impressed with this game. The attention to detail is amazing. If you zoom in on your town it feels so alive. The decorations are nice. You can spend a lot of time making things looks great. Finished both maps that are out so far, max people, max happiness. If you're looking for a nice relaxing game this is the one. \n\n1 wish is that there was a mode where you could go walk around the town. \n\n10/10 \nLooking forward to future updates.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly one of the most fun and pretty games that I have played in a long time. Highly recommend to those who love city builders.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "LOVE THIS GAME! I just don't like how it glitches so much... it has gotten where things I have unlocked are no longer there, and occasionally i get stuck trying to move around the map but other than that I LOVE IT! Would love to see new features such as editing a house once you have placed it (such as changing the colors), would love to be able to see different 'themes' for the items such as changing a color scheme of a commerce building, and would love to see a mod or something where there are no placing restrictions! Also would love to see added being able to upgrade roads but make them still look the same, I love the dirt roads but they aren't very efficient. LOVE THIS GAME!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got my first recommendation for this game on Youtube, a video where the person was playing without commentary, just sit back, relax and go to sleep. That was what I did, I enjoyed the feeling of the game, the sounds and the music... the music is perfect.\n\nI bought the game thinking that it would make me sleepy but no, it has the perfect balance of relaxation and small challenges.\n\nPROS:\n- THE MUSIC!!!\n- The art\n- It is a full fledge city builder, where you can modify many things\n- Money management is not something you to worry about, but without giving you to much to make it feel like a sandbox\n- Different interconnected cities \n\nCONS:\n- Some small bugs\n- It is not super realistic city builder (for me this was a con at the start but later on it felt more a pro for tthe type of game)\n\nTLDR:\nCozy city builder, with great voxel graphics and perfect music, it is made for you to relax, don't expect it to be a super complex management city builder.\n\nRecommended 9.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is probably the best \"calm and cozy\" game on Steam right now. You owe it to yourself to grab a big mug of cocoa, tilt your seat back, grab a warm fuzzy robe, and watch you little voxel town take whatever shape you wish and expand and grow. There is little to no learning curve and you can just get super creative and the game and your little peeps stay chill. The music is so perfect and relaxing. If I could have nominated this for every category of the Steam Awards I would have, as it is, I nominated it for 3. It's that good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I find the game to be quite relaxing and cool. I think there are some points where it may need a bit of improvement, like with how some systems don't quite tie in together like they should (requirements not showing up properly or the path of evolutions not being quite clear to plan ahead) but it's pretty much a chill city builder game where you play whack-a-mole with the citizen's needs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game, never felt more relax in any other simulator",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An incredibly cozy, no pressure city builder with voxel graphics and heavy emphasis on decorating the town. My grandmother passed a few days ago, and this game has been helpful in keeping my mind off things. \r\n\r\nHighly recommend. Not the grandmother dying, but the playing this game. Been worth every penny.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game COOKED, I've played my fair share of city builders, after a certain point they tend to get overwhelming with everything you have to come to manage. I have yet to feel strained by progress in this game. \n\nIt is so gentle and kind to the user and all the best parts are so easy to understand. \n\nThe UI is fantastic and the vibes and DOWN RIGHT IMMACULATE! \n\nI'm a dude that gets bored of games like this kinda quickly but this has a GRRRIPP ON MY THROAT!!!\n\n100% percent worth buying. They deserve it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Insanely good game but the maps are a little small . i hope i dont get bored 9/10      edit: im so bored now 6/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I highly recommend this game to anyone that enjoys building a world in a nice and cozy town. It is a game you can relax and be creative with, offering so much possibility of not endless idea, thanks to the creative people that made this game. You can play this game at your own pace and witness what you built over time, realizing that what you build is beautiful and breathtaking from above or in frist person.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really a great game for those of us that like city builders but want to have a no pressure experience where you can really focus on doing nothing in particular if you want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely gorgeous game. Hooked me in the first hour. Amazing soundtrack, audio and visuals. Devs are communicative and have put out some good updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game learns from a lot of the cozy city builders and knocks it out of the park! It's an excellent outlet for creativity while still having a sense of progression. It's a game you can take at your own pace without any pressure to progress if you want to get lost in the details and creativity!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a really cute game that allows for some intimacy with your residents. You get to watch families move in, and go about their lives. It's a simple and freeing type of city builder.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's truley a beautifully done game, and i consistently cannot wait to play some more. i literally bought a pc after watching streamers play this game for countless hours. well worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow, what a great game.  Very shiny even though it's in EA. Cozy City Builder - delivered very well.  I'm super excited about this and will be following this game closely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is genuenly such a fun game, would recommend to anyone who seems interested in city games, Just wait for it to go on sale please",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a beautiful and relaxing experience, complemented by truly great music. I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful and relaxing game. Can't wait to see what the future brings!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really relaxing and fun. The art style is unique and fresh. The music is relaxing and joyful. And their new 1rst person view allow me so much perspective on my city it’s crazy.\nIt’s so chill, really recommend 👌",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super cute, low stakes city management game. I love that it's not on a grid!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super relaxing city building game, with nice and cozy visuals.\r\nWith a focus on decor and the small details, which I really like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill building and simulation with tons of creativity outlet. If your in to city builders this is a fantastic experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game, you can be creative as you like.\nIt can be tricky sometimes by placing stuff around but overall great to relax and just enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At 12 hours in I feel like I've done *most* of what there is to do currently in the game, but I'm recommending it because a) 12 hours of content in a 2 month old early access game is actually quite promising, and b) I really enjoyed those hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was very much worth the price. I tried the demo first and enjoyed that a good amount. The game itself is more complex then the demo in very positive ways. I like the concept of having multiple maps that feed resources and objects to each other. It is a bit like a much simpler and easier version of Anno, without the fear of war or critical shortages that ruin your empire. The decoration mechanism is especially interesting with a large number of items that can be placed on the ground or on a building to make each space truly unique. Some holiday decorations would be nice!\r\n\r\nI can see the devs are making good progress with new additions. I highly recommend this game for at least two dozen hours of super relaxing fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this is my first review, but I truly felt like this game deserves it! I have tried a handful of city builders in the past that market themselves as cozy and low-stress. Yet, as a stressed person, I always end up returning them as they fall short of my expectations or become too complicated. \nThis brings me to Town to City, my boyfriend convinced me to get it on sale, and I am so happy I took the chance. I have been utterly obsessed with this game. I even took to playing it in the car whenever I have a long enough ride. The mechanics are very easy to learn and this game does not punish you for having a slow pace, if anything, they encourage it. I enjoy that this game has a decorating aspect that is VERY tapped into. The NPCs have their own wants and needs, some even asking you for specific areas, like parks or romantic areas. As someone who struggles with creativity, I have been decorating my town to my hearts content. One of the mechanics I enjoy the most is the happiness meter, I love making my citizens happy and trying to figure out the root of the problem. I have even taken to looking at real towns to beautify my own. \nI always struggle with using too much money or feeling like i need to tear down places to replace them when playing other games, but I have not ran into this issue. Town to City offers multiple buildings under the same category with varying prices and range, if you're running low on money (which rarely happens) its easy to work around and you can very quickly make your money back. Other city builders tend to lack depth and personality for me, but this game has it all. Every citizen has their own preferences and it makes me happy to make them happy! I would recommend this game to anyone, especially considering it has a sandbox mode where you can tweak money, research points, what you have unlocked, etc. I have been using the sandbox to take a break from my main city and it has been amazing to take the time and fully decorate my town. I also very much enjoy the feature where you can walk through your town in first person and even see your citizens walking amongst you!\nAll in all, if you're even considering getting this game... DO IT! but only if you have the time to get utterly absorbed into it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love games where you can decorate to your heart's content, and Town to City is exactly that! It has a super cute and relaxing soundtrack and the Twitch integration works great!! <333",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best first person walk around mode ive ever seen in a game. can literally walk into some shops if you catch a resident opening the door",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am really enjoying this casual game. While it isn't very demanding, it is a lot of fun to meet the requirements for happy citizens and you are always unlocking new ways to decorate and populate the town.  I am having a lot of fun with the campaign and look forward to starting a sandbox once I finish it using the little touches I learn about as I go through it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pros: Relaxing, calm and chill vibes.\n\nCons: There is none.\n\nIts a good game to make you unwind and just build the way you want to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cute city builder, which has a surprising amount of depth of gameplay to it once you get into it! The ability to design your own quaint little city, whilst still having to maintain citizen happiness and industry/consumer links is quite refreshing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible balance between managing a town and enjoying a relaxed, creative experience. It's far more beautiful than other voxel styles in my opinion, which makes the fairly robust decorating element of the game even more enjoyable. Highly recommended to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You won't believe this game is in Early Access! It's so full of life. I love the no pressure aspect - you don't get penalised for not doing things, so you can go at your own pace. The decorations are !! phenominal!! It absolutely tickles me when you find that oh this lamp can also go on the wall! And the table! Such fun!! Get this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cozy game which also requires some strategic thinking. I really enjoy playing because it calms me down a lot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this city builder game. Its so cute and i love all the details you can add to things.\nI also love the graphic style and the french looking style. Game play itself is fun as well.\nIf you love a chill relaxing cute city builder games, would defiantly recommend this one! :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and relaxing. Perfect after a long day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the art style of this game and the ability to get creative in building your town! The quests are unique and make this game more than a sandbox builder for me, but rather a dynamic game that allows me to use both my creative and logic brain!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game! Got sucked into it right away and spent all night up playing it haha",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super chill and satisfying. Watching your small town grow to a metropolis is addictive. If you just wanna relax with zero stress management, this is the perfect game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I get the least amount of city builder anxiety from this game, but it's still there! Great relaxing cozy game. Excited to see where it goes. I would love to see bridges in an update!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't think I would enjoy a city builder as much as I enjoy Town to City. I love how simple its art style is, and I really like that you can decorate literally anything. Definitely recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent sit back and relax game art style is amazing and decorating is very in depth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who has played 13 hours of this game in the past day: this game is 110% worth it. SO calming and very low stress. Very easy to grasp. A game you can honestly get lost in. There's constant opportunities for leveling up and there's always a goal to work towards: slowly upgrading your city and making it beautiful. The villagers aren't annoying with their requests and it's fairly easy to make them happy. Plus, they have little family traits that make them different and not all the same boring villagers (for example, a villager family really loves flowers, so you have to decorate their home with a lot of florals.)\r\n\r\nAnd my absolute favorite part of it all has to be the sheer level of customization. This game pays attention to the tiny details and lets you place decorations almost anywhere. None of my villager homes or shops look the same because I can decorate them all sorts of different ways. There's different roads and terrains and even different kinds of trees and flowers. You have to unlock certain decorations which I love because as I said before, it keep me engaged to the game while also being able to relax and just decorate. Plus, the graphics are beautiful and so aesthetic. \r\n\r\nOverall, I'd easily give this game a 10/10, and I can't wait to see where it goes in the future. I'll be hanging on the edge of my seat waiting for the next update!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cute, and I hope they keep adding more! It would be nice to be able to edit terrain, so placing adjacent houses on a hill doesn't cut the land into odd shapes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game that i will choose if i just want to chill. I play quite some city builder games but this game game more on a relax side. The music is cozy as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not the biggest gamer all round but I play a couple of \"cozy games\". This has been one of my favourite finds of the year.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unlike other city builders, I like that resource buildings are not strictly ranged with circles - there's an element of both range and capacity that is nice - similar to cities skylines. Cute game. Definitely cozy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. The style is cozy with chill music and no time limits and very few restrictions. The way you progress by gaining more citizens and adding more buildings in unique and encourages growth instead of just rushing through it. The decorations are so cute and i'm glad its a part of the happiness system. If you like cozy city building games with lots of creative freedom you'll love this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a cozy city planning game that doesn't have the same level of micromanaging that gets tedious in other games you could compare to Town to City. However, it's still an enjoyable way to lose track of time with plenty to do.\r\n\r\nAlso, my cat likes watching the residents walking around the zoomed out map. That's been good for a few giggles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game and cant wait for future updates. it pays great on the deck too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ever since I bought this game, I’ve been playing it non stop. It’s so much fun and addictive! If you like city builders, then this is for you. I can’t wait to see it evolve and have them add cars and more stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "easy to get the hang of with a really cute art style and awesome soundtrack 10/10 game to chill with",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like Dorfromantik and Cities Skylines had a child, great city builder style game. Artstyle is super cool and the music in game is awesome. Not as difficult or complex as something like Cities Skylines but it has just enough to keep you engaged and moving forward. Definitely looking forward to more content in the future!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, and excited to see where it goes from here!\nIf you like city builders, creating, and planning, definitely check this out.\n\nThe good;\nAnimals <3\nThe people walking around, especially when in first person mode are adorable\nPlanning your city, and farm town, working around the landscape\nThere are hours to be spent designing one area\nThe art style <3\n\nThe bad;\nminor glitches, but with patches coming regularly I havent experienced anything game breaking\nUnsure if feature or bug, but shop connections dont save upon exiting\nSome stuttering issues\n\nIf you have a low tolerance for small issues, it may be best to wait for the full release. If, like myself, you are just excited to get in, give it a go!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the perfect cozy game to play when you are bored of the hustle and bustle of other games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's truly a peaceful city building game. Main mechanics are about making things look pretty and adding enough stuff to make your citizens be happy, which becomes \"harder\" as you go from Town... to City!\n\nNow, when I say \"hard\", what I mean is it takes time and lots of adding decorations and ammenities everywhere. You can play sandbox and tweak enough settings to your liking, but even campaign or regular sandbox modes are relaxing and easy to get through. Game isn't meant to be challenging, it's actually meant to push you into making everything look good.\n\nA nice change from all traffic, economy and industry simulators out there disguised as city builders.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This wonderful little game is so comforting and calm, any time I felt like I made a mistake it was so easy to just readjust and re place buildings, move families, anything that I wanted to do was made accessible and it took away so much of the pressure that some city builders have in their gameplay. And I’m not saying that’s bad at all! I love games with high stakes but this one just takes the core of the genre in a much more relaxed and comforting direction that has helped me decompress from weird days and I’ve loved ever minute of it. The post launch support has been great too with wonderful additions like the Halloween and autumn decorations and now the animals update! The thing that I love most (that was only just added a few days ago) is the ability to walk around my little town from one of the citizens perspectives (it’s a setting in photo mode or through the mayor house if you missed it!) and it has been so fun to explore my own little creation from the view of the little digital guys who live in it. Vibes wise it’s a 10/10, I know there are some things that frustrate people or are less than convenient (no bridges, roads are weird occasionally, etc) but it’s still early access and they devs have already responded to so much community feedback that I believe in this little game more than I’ve believed in a games development since Hollow Knight. Keep it up devs, and if you’re on the fence try out the free demo to see if you’ll like it, but I promise it’s worth it if you enjoy the decoration gameplay from things like stardew or even animal crossing, there are some people who wish this game had more in depth “city management” type gameplay but I don’t think that hard actions to consequences type of thing was the intention here so I’m not at all upset by it’s more loose style of governance! And who knows maybe they will add some sort of increased difficulty game mode once they finish working through their current timeline of updates! All in all I love it, I’d say it’s a 10/10 as it is now, but even then I’m excited to see the quality of life improvements they continue to add and where the game will go from here!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good Game overall, love the story mode and sandbox mode. Super cute and cozy vibes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a TRUE COZY GAME! The art style is adorable and the gameplay is very relaxing. One of my favorite parts is just watching the little townsfolk walk around and enjoy the cute areas I spent time building for them. Very customizable experience and I love all the decor items :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so cozy and fun! I love the flexibility and ease with which you can move items, decorate, draw in roads, etc. it's very polished and intuitive. I also love the variety of decorations, the detail, and the scaling as your city grows. Its very forgiving and open in terms of economy and management so you can do a lot or a little depending on your vibe, while still getting your town profitable. I also love that you don't have to spend too much time worrying about budgeting or micromanaging things, or making one mistake which could lead to the end of your city. Its very forgiving on that front which makes it a nice alternative to other more intensive city builders (like CIty Skylines which I love!) I was wanting something more laid back that still felt full of life, creativity, and options and this is amazing! Can't recommend it enough! Literally haven't stopped thinking about it since I bought it the other day!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much. Its an easy little city sim where if you want to expand, you have to actually think about how your little guys are gonna get there. The style is both cute and pleasing to the eye while still being pixels, the screenshots you can get are breathtaking.\n\ntired of mf telling me 'wah wah my work place isnt pretty enough :(' ive placed enough flowers to give voldemort an asthma attack genuinely what are you smoking? my flowers?",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Very beautiful city-builder, nicely using voxel graphics to allow micro-beautification of every building. \n\nThat being said, at this point it has a terrible economy. Basically the more you grow, the more your pops demand. However, this game also uses workplace mechanics, so every building needs pops to function. In turn, the growth of your city is steadily decreasing in time, as for every new utility you need more pops to work in them, which requires you to employ more pops for previous needs. When games like Anno grants you more pops for satisfying more needs, this game punishes you for expanding. I would say it takes twice as much time to reach each next city update. It makes the campaign a tedious experience, opposite to snowballing.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "A huge part of the game seems to be towns/citys integrated with each others, but be aware there is bugs with save files. You may spend several hours in one town, just to lose the town if you start the next town.\r\n\r\nThe bug has been reported several times. Game braking to me at least. Can't recommend until they find a solution.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I thought this game was just about cozy town building with less limitations than other games in this genre but actually this game currently having more limitation than production games. I tried to build my cozy town but i couldnt as you can understand earlier that what i said. Because houses needs stalls really really near them. Maybe it is only a problem for me but if i wanted to build a practical town instead of an cozy one, ı would just play another game instead.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "this game is incredible, i recommend when bugs are fixed. despite saving several times in new slots, hours of work are gone after 'fatal error' pops up. $25 is a lot for not even getting to save your progress post confirmation you saved your progress.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really really love this game, I played the demo a bunch with no problems at all but for whatever reason in the early access release the game consistently crashes my pc after 20 minutes of playing. The only reason I don't recommend it is because of stability issues.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a nice game, until it starts crashing, over and over again. Lowest graphics settings help slightly, still crashes. Got up to 500 residents, now it won't even load all the way before crashing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to play this game as just a casual time killer, but you get a few minutes in and it crashes every single time.  I left and came back after a few months to see if some updates fixed it, but no luck.  Still crashes after a few minutes of gameplay.  Wish I could just get my money back but I played for 2 hours too many...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great bones. Problem is I want to spend my time making ALL my townfolk happy, not just the rich townfolk. The concept of the Bourgeoisie being a special class I have to change all my design plans around to be happy stinks. I don't want to spend my free time playing a game where I have constantly be a yes man in service of rich people, I already have a real life. It evokes real emotional disdain in the game for me. Give me a power fantasy where I can treat all my citizens by their needs and desires instead of their financial power. Encourage me to build neighborhoods for nature folks, and city folks, and sunflower folks, and blue house folks, and ponds folks, and beach folks, etc. \"I have more money so I matter more and now your town planning is screwed up\" is such a lame way to throw a cozy city builder off a cliff. (Devs, this is a chill game. Maybe think, \"what will the player be excited to do\" instead of \"what annoyances can we force onto the player\" when it comes to the research tree and this \"Bourgeoisie\" theme/mechanic.)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much micromanagement. \n\nGraphics are cute but actually just lazy.\n\nPlayed for under 2 hours. Got bored. Turned it off and refunded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes constantly, freezes, and makes my GPU do weird things. (like black screen or complete computer freeze), and no, it's not a hardware issue considering this is the only game or program I own that does this. The bug report forum is full of similar issues since the game got released, but I guess fixing those is not important enough for the devs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lets start by saying Game looks gorgeous but far too fiddly for me. AI isnt great and the shop system needs a bit of work.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "People really seem to love this game, and honestly I'm torn because at its core, I also love this game.  I think it has a beautiful artistic style, I think its approach to the genre is interesting and fun.  But I also really found it pretty boring after a short while, and it became obvious that the \"progression\" was just going to be a lot of rinse and repeat without much in the way of advancement or real achievement.  People want things, you give them those things, over and over and over.  Is this a core mechanic of this genre?  Sure.  But the way this game goes about it is just... dull.\n\nI know it's meant to be relaxing, and a lot of the reviews emphasize how chill it is, but honestly I found it rather directionless.  This family needs a house with trees?  Plop down some trees.  Hooray, now they're happy.  This family wants water nearby?  Plop a house next to some water.  Hooray, they're happy now.  And while this is all simple and well and good for it, it just gets... boring.  And tedious.  And repetitive.  And not in the fun way a lot of games in this bracket can make it.  Again, I know this is meant to be a \"relaxing\" approach to a \"city building\" game, and it is definitely that.  And if you're someone who just wants to have a pretty game to look at on the side with no real investment in the development of your town beyond \"I planted some flowers and now they're happier\", then by all means, this is the game for you.\n\nHonestly, judging by the reviews, this is obviously the game for a vast majority of the people playing this.  Which is honestly a bit confusing and maybe a little concerning, to consider the bar is apparently so low for thousands of people.  But, I grasp that I'm in the minority here, and very probably not the intended audience for this game.  And again, I don't think this is a \"bad\" game, it's just nothing impressive, especially not for $25 in Early Access.  There are plenty of other games in this genre that are in the same state of completion, if not further (or even released) for the same price or a few dollars more.  They'll give you 10x the content, engagement, and sense of accomplishment that this game will.  But if you don't want those things, and you instead just want to plop a few things down and feel like you've \"built a town\" then by all means, buy this and never look back.\n\nMaybe I'll come back to this someday when there's more content.  I picked it up as soon as it came out because I loved the concept and the look of it, and I'm all for supporting smaller devs, but it just felt shallow, hollow, lackluster.  Pretty to look at, ugly to play.  And I returned it almost instantly, because the mundane nature of the whole thing was quickly apparent, and I didn't want to miss that 2 hour window.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "most basic. magic train brings in all the supplies, you just have to build distribution buildings and houses. yikes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was so disappointed in this game. I didn't like how  it felt like I was playing with bricks.  And it was hard to  evenly line up the buildings.  The game got boring quickly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "relxing but boring",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "extremely slow and crashes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A huge part of the game seems to be towns/citys integrated with each others, but be aware there is bugs with save files. You may spend several hours in one town, just to lose the town if you start the next town.\r\n\r\nThe bug has been reported several times. Game braking to me at least. Can't recommend until they find a solution.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I wanted to like this game, I genuinly enjoyed the demo and thought the game would be incredible once it releases, but what I expected from a full release didn't materialise, not even close.\n\nWhat I want to make clear here is that this is not a game for me, not that it is a bad game. \n\nI expected this game to be a city builder, but it is closer to a diorama builder. The maps are tiny, cramped, even the full flat map feels too small. I absolutely love beautybuilding in city builders, but for some reason developers of all city builders besides Cities Skylines (and technically them too) have this urge to limit the size of their map. Why? What compells all developers to make maps so small? It's not performance I tell you, because all they'd need to do is limit the size and allow you to build over the limit by ticking some box in options, Rimworld does this perfectly for instance. They even warn you there about increasing size having big impact on performance, but they give you a choice. The implications are massive. Everything you can build will feel like a miniature city. I don't want miniature, I want full scale. I want to build whole countryside, not a fraction of it. Give me kilometers of farmlands, woodlands, I love scale.\n\nIt's not about the urban target of the game's theme that has to limit the size. In fact the game isn't much of a town to city as it is village to town, so it should feel much larger than it is. While detailing is awesome and I absolutely love it, the building selection further proves that the game is meant to look good as a miniature. Signature buildings look too distinct to blend well, at least some of them and their inclusion also makes little sense since the map is so small and you really aren't going to find most towns of such size to have as huge buildings. Just look at the fountain and this little castle/masnion/chateau thing among some others. Or how large the train station gets by the end. There are exceptions of course, but most towns of such size should feel less grandeur. To me city building is about trying to build something both unique and realistic. For that you need huge building variety, detailing, and scale. This game to me offers the best detailing experience I have ever seen, but not the other two things. In fact scale is probably among the worst and building variety is fair for an indie title at this price, fair doesn't mean good, it means, acceptable.\n\nAnother thing that bothers me to no end and that wasn't fixed since demo, the clothing store, and likely many other buildings, still enforce a partial perimeter of grass around them, meaning even if you want to have it near a plaza, you will have to suffer a patch of grass that looks totally out of place. You can't build over it either. For some reason only Cities Skylines allows anarchy. I don't care about overlap, let me overlap, let me clip. But no, I will have to be forbidden from doing this rather than given a choice. Just highlight it in yellow to indicate clipping. So if this bug wasn't fixed for a couple of months, it's not a good sign, what else will I find broken while playing naturally? Such things are my pet peeve, if you give me a game about detailing and make it impossible and glaring, I will suffer.\n\nTo me this is a real shame, because this game put tons of love and care into detailing, the models look great, the atmosphere is amazing, you can really feel the heart was poured into this, but what good is that when it's so small. I'd rather play Anno or Cities Skylines. Not because of the simulation or theme or other mechanics, purely from the perspective of building something nice. Scale matters in city builders, correct distance between certain areas does matter. Even the rular areas need correct size, bigger is better always.\n\nThe game is going to be updated over time, but I doubt my concerns are going to get any attention from the looks of the roadmap, and that's fine, the game is simply meant for a different audience than me. And that's why I in particular can't recommend this in good faith despite game likely ending with 95%+ positive reviews. That's the core audience, not me. It is an early access title, but it's not going to go in a direction I need, and that's fine again, just not for me in particular.\n\nWhat I can tell you is that if you are okay with this scale, if you like the particular style they went for, go for it, it's an amazing game for you. But if like me, you feel like all city builders lack something important, this game lacks it more than others, despite appearing at first like it holds some hidden potential.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "It’s a cute game with lots of potential, however, at the moment it’s spoiled for me by pathing bugs and a tedious amount of micromanagement. The game needs better indicators for whether or not a building has proper street connectivity. I didn’t realize that a bunch of buildings weren’t connected until I was moving them around and suddenly they started working.\n\nMy main gripe, however, is that the people assignment mechanic, very quickly becomes super tedious. If people want to min/max control their citizens with an authoritarian level of precision, more power to them. However, there should be an auto assignment option for both housing and workplaces for those of us who would rather focus on building and beautifying the town, and let the citizens do their own thing. It should be relatively straightforward to program villagers to automatically find their optimally preferred house and workplace. While the current process is not so bad for the first 15 minutes or so, after that it starts to feel like pointless busy work.\n\nAs it stands, I will probably keep an eye out for future updates and come back and play it later once fixes have been made.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I give this game a Negative, altough I would rather like to rate it Neutral. When will Steam ever include this option?\n\nThe game leaves a great first impression. It feels great, cozy, cute, colorful.\nBut the longer I played, the more I asked myself \"Why am I playing this?\" It is wash, rinse, and repeat. And more than in any other city sim I played, in all my starts I came very quickly to a point where I started again because something didn't work out.\n\nYou won't do anything wrong buying it. It is relaxing to some degree. But if the demo is still online, try that first.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Very beautiful city-builder, nicely using voxel graphics to allow micro-beautification of every building. \n\nThat being said, at this point it has a terrible economy. Basically the more you grow, the more your pops demand. However, this game also uses workplace mechanics, so every building needs pops to function. In turn, the growth of your city is steadily decreasing in time, as for every new utility you need more pops to work in them, which requires you to employ more pops for previous needs. When games like Anno grants you more pops for satisfying more needs, this game punishes you for expanding. I would say it takes twice as much time to reach each next city update. It makes the campaign a tedious experience, opposite to snowballing.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really like this game. But considering what you actually get for its price and the current content? I sadly can't recommend it. I would give it a neutral rating, because if you are VERY into creative sandboxing and like the graphics of this game, you might get more value out of it.\n\nThat being said: I played ~12 hours and I am completely done with this game. Did the campaign, 100% achievments and there's nothing left for me that would keep me engaged with the game.\n\nLuckily, this game is in Early Access and I hope the upcoming content will get me back to launching this game. but 25,- (Euro) is not justified (yet?!)\n\nI really liked the campaign and the performance was great too, until - well, it gives you a warning that with a population bigger than 1000 it might get laggy. And it did. That was another disappointment because my computer shouldn't struggle with that type of game but it happened and I had to adjust some settings to keep on playing. Which was needed because I wanted to complete the quests and achievments!\n\nI love the genre of City Builders and Town to City DID scratch some itches there, I really liked that part of the gameplay, although the (re)quests have been too easy and repetitive. The little stories that came along with them were cute though. I wish there was more encouragement to get creative / decorative because most values that you have to hit are about efficiency and that makes a very...generic city layout.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Map size is extremely limited.. takes the fun out late game",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I think it's important to be honest and up front with Town to City.\n\nWhile the pixel art aesthetic and the lego-style snap on decorations can feel refreshing, it masks what is essentially a very, very small and very simplified version of Anno 1800.  From your commerce buildings needing to be within a certain proximity of a warehouse to your citizens needing to be within a certain proximity of your commerce, anyone looking to advance their village in size will eventually abandon their plans for one or two optimal layouts.  This approach bars any future inclusion of strategic infrastructure (utilities, transportation, etc), so fans of builders like Surviving Mars or City Skylines will come away empty handed.\n\nAdd to this the fact that almost half of the families moving into your little hamlet will have their own esoteric needs on top of the ones shared by all citizens.  Some will need to live by the water, while others need to live near trees.  The maps are so small however that your only recourse is to add more stories to your homes to fit more families.  This in turn means that you'll need more commerce buildings in order to keep your new citizens happy.  You won't have enough workers though, so you'll need more families to work those jobs.  More workers means more houses which means more space between homes and commerce which means you'll need more commerce buildings, and so on and so on.  The end result is a game of whack-a-mole to get rid of the overly large, frowny face icons littering your view.\n\nThat's not to say that the game is difficult, quite the opposite.  By the time your town reaches the third level you'll have more money than you'll ever need with nothing to counteract it.  This results in an extremely restrictive experience with very little challenge.\n\nI think the vast majority of players who give this a shot will consider it a nice aside and never play it again.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "this game is incredible, i recommend when bugs are fixed. despite saving several times in new slots, hours of work are gone after 'fatal error' pops up. $25 is a lot for not even getting to save your progress post confirmation you saved your progress.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A \"cozy\" town building game. The theming is sweet and on point, but having to square the circle of freeform, painted roads with prefab, \"square\" buildings leads to all of my cities looking like spaghetti. Adding in the requirements of certain families agitates this quite a bit. It would probably have been a better idea for buildings to have a shapable footprint bounded by the road on all applicable sides and some maximum distance at the back, such that there is a minimum area for the building to generate in.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a cute game and would likely appeal to someone who likes just plopping things down and then making them pretty, but it is too easy to really hold my attention. I hope they release a challenge mode or difficulty settings going forward in the Early Access process. If you just want to kill time and zone out, then it's a good game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I thought this game was just about cozy town building with less limitations than other games in this genre but actually this game currently having more limitation than production games. I tried to build my cozy town but i couldnt as you can understand earlier that what i said. Because houses needs stalls really really near them. Maybe it is only a problem for me but if i wanted to build a practical town instead of an cozy one, ı would just play another game instead.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really really love this game, I played the demo a bunch with no problems at all but for whatever reason in the early access release the game consistently crashes my pc after 20 minutes of playing. The only reason I don't recommend it is because of stability issues.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a nice game, until it starts crashing, over and over again. Lowest graphics settings help slightly, still crashes. Got up to 500 residents, now it won't even load all the way before crashing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to play this game as just a casual time killer, but you get a few minutes in and it crashes every single time.  I left and came back after a few months to see if some updates fixed it, but no luck.  Still crashes after a few minutes of gameplay.  Wish I could just get my money back but I played for 2 hours too many...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great bones. Problem is I want to spend my time making ALL my townfolk happy, not just the rich townfolk. The concept of the Bourgeoisie being a special class I have to change all my design plans around to be happy stinks. I don't want to spend my free time playing a game where I have constantly be a yes man in service of rich people, I already have a real life. It evokes real emotional disdain in the game for me. Give me a power fantasy where I can treat all my citizens by their needs and desires instead of their financial power. Encourage me to build neighborhoods for nature folks, and city folks, and sunflower folks, and blue house folks, and ponds folks, and beach folks, etc. \"I have more money so I matter more and now your town planning is screwed up\" is such a lame way to throw a cozy city builder off a cliff. (Devs, this is a chill game. Maybe think, \"what will the player be excited to do\" instead of \"what annoyances can we force onto the player\" when it comes to the research tree and this \"Bourgeoisie\" theme/mechanic.)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much micromanagement. \n\nGraphics are cute but actually just lazy.\n\nPlayed for under 2 hours. Got bored. Turned it off and refunded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes constantly, freezes, and makes my GPU do weird things. (like black screen or complete computer freeze), and no, it's not a hardware issue considering this is the only game or program I own that does this. The bug report forum is full of similar issues since the game got released, but I guess fixing those is not important enough for the devs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lets start by saying Game looks gorgeous but far too fiddly for me. AI isnt great and the shop system needs a bit of work.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "People really seem to love this game, and honestly I'm torn because at its core, I also love this game.  I think it has a beautiful artistic style, I think its approach to the genre is interesting and fun.  But I also really found it pretty boring after a short while, and it became obvious that the \"progression\" was just going to be a lot of rinse and repeat without much in the way of advancement or real achievement.  People want things, you give them those things, over and over and over.  Is this a core mechanic of this genre?  Sure.  But the way this game goes about it is just... dull.\n\nI know it's meant to be relaxing, and a lot of the reviews emphasize how chill it is, but honestly I found it rather directionless.  This family needs a house with trees?  Plop down some trees.  Hooray, now they're happy.  This family wants water nearby?  Plop a house next to some water.  Hooray, they're happy now.  And while this is all simple and well and good for it, it just gets... boring.  And tedious.  And repetitive.  And not in the fun way a lot of games in this bracket can make it.  Again, I know this is meant to be a \"relaxing\" approach to a \"city building\" game, and it is definitely that.  And if you're someone who just wants to have a pretty game to look at on the side with no real investment in the development of your town beyond \"I planted some flowers and now they're happier\", then by all means, this is the game for you.\n\nHonestly, judging by the reviews, this is obviously the game for a vast majority of the people playing this.  Which is honestly a bit confusing and maybe a little concerning, to consider the bar is apparently so low for thousands of people.  But, I grasp that I'm in the minority here, and very probably not the intended audience for this game.  And again, I don't think this is a \"bad\" game, it's just nothing impressive, especially not for $25 in Early Access.  There are plenty of other games in this genre that are in the same state of completion, if not further (or even released) for the same price or a few dollars more.  They'll give you 10x the content, engagement, and sense of accomplishment that this game will.  But if you don't want those things, and you instead just want to plop a few things down and feel like you've \"built a town\" then by all means, buy this and never look back.\n\nMaybe I'll come back to this someday when there's more content.  I picked it up as soon as it came out because I loved the concept and the look of it, and I'm all for supporting smaller devs, but it just felt shallow, hollow, lackluster.  Pretty to look at, ugly to play.  And I returned it almost instantly, because the mundane nature of the whole thing was quickly apparent, and I didn't want to miss that 2 hour window.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "most basic. magic train brings in all the supplies, you just have to build distribution buildings and houses. yikes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was so disappointed in this game. I didn't like how  it felt like I was playing with bricks.  And it was hard to  evenly line up the buildings.  The game got boring quickly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "relxing but boring",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "extremely slow and crashes",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}