{
  "positive": [
    {
      "review": "perfect game to return to every few months after forgetting it for like half a year",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "not sure how i never reviewed this game considering i literally consider it a perfect game. seriously, i have 1k+ hours in the Switch version. looking forward to the sequel.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A game so good I continued playing it after Silksong",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Enter the Gungeon is an absolute triumph of a game and a must-play for anyone who enjoys challenging, rewarding action. From the moment you pick it up, it’s clear that this is a game crafted with a profound love for its genre and a meticulous attention to detail.\n\nThe core gameplay loop is incredibly addictive. It's a top-down, bullet-hell rogue-lite that perfectly blends precise shooting mechanics with the thrill of randomized dungeon crawling. Each run feels fresh and exciting, thanks to the vast array of weapons and items you can discover. And \"vast\" is an understatement—the sheer creativity on display is staggering. You’ll find everything from a gun that shoots bees to one that fires t-shirts, all contributing to a uniquely chaotic and charming experience.\n\nDodge Roll, the developers, have infused the game with a personality that shines through every pixelated corner. The art style is gorgeous, the humor is spot-on (the \"Gundead\" enemies are a particular highlight), and the subtle references hidden throughout the Gungeon are a joy to uncover.\n\nYes, the game is difficult. It’s a bullet-hell, after all. You will die. A lot. But the beauty of Enter the Gungeon lies in its progression system. You constantly unlock new weapons, items, and characters, ensuring that every failure feels like a step toward a deeper understanding of the game’s mechanics. The learning curve is steep but incredibly satisfying to master. Executing a perfect dodge roll through a storm of bullets and clearing a room of enemies feels incredibly rewarding.\n\nUltimately, Enter the Gungeon is a masterclass in game design. It's challenging, charming, replayable, and a genuinely joyous experience. It's a game that respects your time and rewards your skill, making it an easy recommendation for anyone looking for a new obsession. Lock and load; you won't regret entering this Gungeon!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Best roguelike I've ever played. The gameplay is so slick I could probably play it forever.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The quintessential rogue-lite\r\n\r\nThat said a very sober take on the genre, where you don't end up with modifiers up the butt until you fill the room with bullets, [i]frequently[/i], instead most runs will prove a real challenge, one which I think always feels very fair.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enter the Gungeon is a fantastic bullet hell indie game that's very well made, but make no mistake, this is a very challenging and difficult game.  That being said, anyone can get used to the game very easily, and you don't have to put lots of effort in learning all of the rules, tricks and quirks of the game (unlike some other roguelikes).  Don't be discouraged if you have never played a game from this genre before.\n\nThe game is simple: you are in a dungeon, where everything is against you (well, except for the friendly NPCs), and your task is to defeat them with any of the weapons you find during your journey.  One thing to keep in mind is that you'll lose many, many times (at the time of writing this review, after having played the game for a total of 72 hours, I have just recently completed a run).  Even then, I have always found myself wanting to play more, again and again.\n\nBeing lightweight, just about any computer made in the past 16 years should be able to handle it just fine, but this doesn't mean that the game's visuals are poor, in fact, the art, special effects and sound effects all look fantastic.  The soundtrack is fine, and the game has a great sense of humor.\n\nThis game is perfect for playing all by yourself, but it's even better if you have a friend to play cooperatively.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not bad, fun to zone out on. doesn't hurt too much when you die, but sadly it gets increasingly hard as you play because as you unlock items, you stop getting the \"Good\" ones as often, but i do belive you can narrow the item spawn to just what you like",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "genuinely quite a fun and underrated game, half the time down to luck though not unplayable without good luck or unlocking progression based items",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The quintessential roguelike game that IMO defined the genre. Big guns, gun enemies and even bigger guns.\n\n\nGun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good, the closest game to Isaac that I have seen. Although it can feel boring and overtly hard at the beginning. If you are able to power through the first past killing, you'll prolly have whatever you need to make the rest of the runs really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its just one of them fun bullet hell games that are so hard you cant defeat the first boss... i recommend playing solo or with friends! both are fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Why can't I beat this stupid fucking game! Great mechanics though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game as a whole is fantastic and very fun and it only really has 2 issues.\n\n1. the game expecting you to remember every single item function and combo is a bit absurd, you basically have to keep the wiki open as some combos can straight up sabotage you by doing things like dropping ice or oil/fire on the ground without giving you immunity. (this doesn't happen often and is therefore a rather minor issue but one i still wanted to mention)\n\n2. the bullet hell is straight up bs. while the boss of the area is great, he is in my opinion, the hardest boss in the game and the fact that you have to do a run lasting 30+ mins just to get to practice on him is absurd, especially considering that most of the time due to how spammy the enemies in the bullet hell are and how many rooms there are on the floor you  will often end up getting to the boss with next to no hp left, meaning you prob won't get to practice on him too long before you end up having to restart and waste another 30+ minutes just getting to him (obv you can somewhat ignore this point if you are the type of person to just look up a guide on how to beat a boss, since that will give you enough knowledge to beat him 2nd tor 3rd try probably)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For some reason, every run of gungeon feels, ultimately, doable. I never really get upset at the game for losing.\n\nYes there are ways to break the game and make it trivial, but at the foreground of this game is a test of skill. How well you can adjust to the attack patterns, how to make best use of your weapons. Its' not as strategic as other rougelikes, but that missing aspect is made up for by how fun the base game mechanics are.\n\nIf you aren't accustomed to the genre, this is a great entry-point. It will fuck you up, but you will like it and go back for seconds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No engine simulation to speak of but I think that since this game is about an entirely different topic its acceptable, ergo its still good nonetheless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game will totally piss you off! However, super fun and very rewarding! Just need a lot of patience and a lot of focus!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best roguelite I have ever played, this is what got me into the genre and I still love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "312 hours on Xbox. Breathtakingly beautiful game, breathtakingly beautiful soundtrack, breathtakingly rage inducing. 10/10 no notes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best bullet hell game I have ever played, lots of fun little gaming pop-culture references and tons of replayability, try Mods like \"Expand The Gungeon\" if it starts getting stale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Замечательный рогалик с кучей необычного оружия, разнообразными боссами и забавными режимами. При полном прохождении игра дает уйму испытаний разной сложности, которые позволяют пересмотреть стратегии прохождения и улучшить навыки. Не обошлось и без чудо-Фрайфла с его заданиями на износ, но за это время можно накопить денег, купить и попробовать намного больше оружия, чем без этого длительного испытания. Отдельно хочется выделить крысу, как самого интересного босса, начиная от получения доступа к ее этажу до опциональной последней стадии, которая является уникальной для всей игры.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bullet hell is exactly what this is.  Phenomenal game but not an easy one.  Be ready to sink countless hours.  Each minuscule upgrade item unlocked goes miles in this game.  I put in about 70 hours, and though sometimes I figured no way I can beat it… bam I go on an epic run.  Gameplay loop is excellent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, even though I'm not good at the game right now. The game is pretty difficult, and unlike other  game like it like the binding of issac, items won't carry you all the way to the end easily. Overall, good game to sink hours into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's okay.\r\n\r\nHonestly it felt pretty repetitive with basically only one kind of projectile to dodge (red ball).\r\nImo needs more variety, but then again - what more can you do with guns?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have about 430 hours played on Xbox, this was mine and a friends couch co op of choice. I remember fighting myself to try to play anything else except Gungeon, because it was so good. We kept discovering secrets and combos, the hidden floors, and that damn crest, I still freak whenever I break a water barrel. Finally seeing the one gun and laughing out loud.  I still dont think I ever saw the entirety of the endgame. I know theres been a floor added since i've played as well. Me and a friend of mine recently had a game night and the first think I thought of was gungeon. Played a few runs and kept dying to the bullet twins and laughed every time. I love this game more than most I've ever played, and I really do find myself still chasing the high that this game first gave me. Of course you always move on and find the next one, nevertheless Gungeon holds a huge spot in my heart, and always will.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "enter the gungeon is an action open world rpg game where ytou fight games in teh wenimesn and you have fingt and you have fun while fghtihjng and ytou open games\r\n\r\nin the gmae you fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Attempting to beat the game was frustrating at first and seemed like a far off dream, but as I got better at dodging bullets and reading the enemies, it became a possibility on each run. I really do like the fact that with skill, the game becomes increasingly rewarding and fun to play. To all the other struggling players out there, keep at it! Watch YouTube to learn the bosses and you'll have a much better time beating the game. GL HF!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very satisfying and challenging gameplay with good progression built in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You haven't Entered the Gungeon yet? Homeslice, its 2025, ya gotta Enter the Gungeon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool roguelike where you shoot bullets with guns, or shoot guns with bullets in some cases",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it took me 11 runs to kill every main past + get all 5 master rounds in one run so i love this game i think",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loads of content. Loads of secrets. And DEFINITELY loads of guns! An amazing game for any gun-nut maniac, skill-mastering perfectionist, or chaos-favouring psycho.\r\n\r\nPersonally, a crap-ton variety of tools and weapons you can find, and mastery of the Dodge Roll made all the hours then, now, and after so worth it for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a perfect and GUNderful game, hands down to Dodge Roll !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you want a endlessly fun rougelike  pick this one there is so much to do and you can really feel yourself getting better at it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The soundtrack is amazing. rest of the game is good too i guess.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sometimes i wish i was a bulletkin and you shoved me into a pit of spikes, or dropped a chandelier on my head, or you just shot me to death",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "unreasonably hard but have great mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With how much I got fucked in this game, I think the gungeon entered me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "te gustan las armas? , te gustan las dungeons? , pues enter the gungeon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Flipping tables, rolling on tables, bullying bullets with bullets, burning them, freezing them, poisoning them... That’s a full load, bro!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "пуля стреляет дробовиком который летит и стреляет пистолетами которые стреляют пулями 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I rage quit every time I die\n\ncan't even pass the tutorial\n\nI love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a nice distraction is short bursts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's prolly quite good, i'm just so so bad :( it's a classic so i had to know what it's all about.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i got a air compressor (gun) that shot out freaking Jaws to chomp my enemy to death, IGN 10 out of 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't like some bosses and for me it can get kind of boring but you should try it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "divertido, repetitivo\r\narmas\r\nenemigos q son balas\r\nq mas quieres?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for as long as ive been playing this game i cannot help myself but to say something that i think is absolutely stupid ill keep this short...\nmobile phone have online multiplayer oonga boonga\npc no have online multiplayer this bad me no like boonga boonga \ndafuq oonga boonga",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best Rouglikes i've ever played. The mechanics are cool, a lot of secrets to uncover and the Synergies that are unlockable by progression are super fun. Great buy!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First game to buy on steam, worth every pennies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Utter peak and hours of just fun and exploration.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "man this game is AWESOME!!\r\na tad bit hard though but deff recommend! :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Eeeeeeeeeeeeenter the Gungeon. Enter the Gungeon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nobody reads my reviews anyway.\nI'll throw in a recipe for Varenyky.\n\nRecipe for Potato Dumplings (Varenyky)\nIngredients:\nFor the dough:\nWheat flour – 500 g\nWater – 200 ml\nEgg – 1\nSalt – 1 tsp\nFor the filling:\nPotatoes – 1 kg\nOnions – 2\nLard or butter – 50 g\nSalt – to taste\nGround black pepper – to taste\nPreparation steps:\nMaking the dough:\nSifting the flour: Sift the flour into a large bowl.\nMaking the dough: Add salt and the egg to the flour. Gradually pour in the water, constantly stirring. Knead the dough until it becomes smooth and elastic.\nResting the dough: Wrap the dough in plastic wrap or cover it with a towel and let it rest for 30 minutes.\nPreparing the filling:\nBoiling the potatoes: Peel the potatoes, cut them into large pieces, and boil until tender in salted water.\nPreparing the onions: While the potatoes are boiling, finely chop the onions. Sauté the onions in lard or butter until golden brown.\nMaking the potato puree: Drain the potatoes and mash them. Add the sautéed onions, salt, and pepper to taste, and mix well.\nForming the dumplings:\nRolling out the dough: Roll out the dough into a thin sheet about 2-3 mm thick. Use a glass or cutter to cut out circles approximately 7-8 cm in diameter.\nForming the dumplings: Place a spoonful of potato filling on each circle of dough. Fold the dough in half and pinch the edges tightly to seal the dumplings.\nCooking the dumplings:\nBoiling water: Bring a large pot of water to a boil, add salt.\nCooking the dumplings: Gently drop the dumplings into the boiling water, stirring carefully to prevent sticking. Cook until done (approximately 5-7 minutes after they float to the surface).\nServing:\nRemoving the dumplings: Remove the dumplings with a slotted spoon and place them on a plate.\nServing: Serve the dumplings hot, optionally drizzling with melted butter, sour cream, or sautéed onions.\nEnjoy your meal!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "bullet shoot gun gun shoot gullet yipeeeee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lot of guns lot of bullets me like",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As an american, I approve.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun bullet hell very creative",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool! i love when a random bullet comes out of nowhere and kills me!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game with amazing pixel art",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you get to have a punchout fight with a rat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so many guns!!!!! And that is a good thing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love bullet hell, I love bullets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it. A quinessential of the rogue-likes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "probably one of the best couch co-op games. actual hours of fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "oer0ijeoijfewu9few89EDFhou0efoijafdu0iojefau0ioi 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty decent fast paced roguelite.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its sooooo fucking haaaaaarddddd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "shoot tings \r\n\r\n\r\nI uh shoot tings",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I feel like King Von when I play this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome shooter looter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "And then I started blasting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's good, but I have never beat it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a really fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not my type of game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best to ever do it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love love love gungeon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than meth i guess",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "w game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very giod",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mention dark souls and you will die",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "blessing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like gun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "We have Returnal at home.\n\nReturnal at Home:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am gun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes i like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This shit really good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game is 100% style over substance. It's neither a good roguelite nor a good bullet hell, yet somehow the worst of both worlds combined. \n\nIt's an completely unbalanced mess with extremely slow and tedious meta progression, no character building whatsoever and 99% of all items/guns are trash. The dodge roll mechanic goes against everything any real bullet hell shoot em up teaches you and does ultimately more harm than good. Bosses are ridiculous bullet sponges and mid bosses are even worse.\n\nIt does look nice, I give it that. But so does The Binding of Isaac and that game plays really well and is a lot of fun.\n\nGo buy The Binding of Isaac.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game misuses the \"Bullet Hell\" tag, as not only game's \"dodging\" focuses primarily on bullet cancels/dodge roll abusing/macrododging (macrododging - going around bullets), but also character hitboxes are too big, disrespecting the deep and dead subgenre that it's using as an aesthetic/marketing choice to appeal to mainsteam audience.\r\n\r\nIf anything, Enter the Gungeon is more of a cover shooter rather than an actual bullet hell.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Roguelike isn't my favorite genre, but some have hit for me. I found the gameplay of this one boring despite usually loving twin-stick shooters.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great game, love it with all my heart, the lost adventurer achievement can go blow its brains out in an alleyway.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The \"bullet hell\" half of this game is great. Amazing bosses, gunplay, cool guns.\n\nBut the \"roguelike\" sucks:\n- Runs blend together.\n- No time-limit means I'm incentivized to clear every room, which is boring.\n- Replaying early chambers every run is boring as fuck. (you're incentivized to not skip)\n- OP guns completely break the balance of certain runs. Makes wins feel undeserved.\n\nI beat the normal ending on some characters but couldn't bother with anything else.\nWish I had bought hades instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I know it's part of the rougelike to have good and bad runs, strong and weak weapons, and easy and hard enemies, but it doesn't matter that \"rougelikes are just like that\" when the aim of a game is to be fun. No, I'm not saying Enter the Gungeon is not fun, it is overall pretty fun to me. But there are parts about this game that are very VERY not fun that I wish didn't effect my playing experience. Look, I know rouguelikes are inherently unfair at times, I know EtG is a rougelike, I know not every run is supposed to finish, but sometimes I end a run cursing the game itself more often than its enemies, and I don't think that's intended. \r\nHere's the thing, EtG is HARD. I know that, I know it's supposed to be, and I like the difficulty. My favorite bosses are the Treadnaught and the Kill Pillars. They are both VERY bullet hellish bosses, on par with the Lich and Dragon boss. What sets them apart from those others though, is their consistent, hard but fair difficulty. The tank boss will always shoot small bullets at you from behind, clamping you in with a main caliber round. Very hard to dodge, but I can see it from a mile away, and the columns in the boss room help as, though temporary, good cover. The lich also has this at parts, but the 3rd stage's lack of telegraphing of where the chain thingies go have sniped me out of a run more times than I'd like. The dragon has this spray attack that spits bullets fast enough that I can't weave through them, but slow enough that a dodge roll is ended with a stray bullet. \r\nThis is my biggest grope with this game. Stray bullets, wiggly bullets, those offscreen guns during the high priest boss. They come out of nowhere. Now, I understand it's just the nature of a procedural generated game to have random elements and that these random elements will eventually end with a stray bullet ending a run or two, but wiggly bullets? offscreen bullets? Those were intentional and have caused me to say \"WHY DO THOSE EXIST\" and whatnot.\r\nI will say this though, occasional vietkong or worm bullets is not bad design. In fact, I am a firm believer that impending damage can add a lot to a game, but in this game, the damage these bullets do is enormous in a given run. Only 1 stray bullet a floor will result in half health by Bullet Hell, that's not including general damage from bosses or enemies, and assuming two heart upgrades are found. Seriously, the chip damage the Gungeon will do kills more than the Lich. So what's the point then? What am I trying to get across now?\r\n\r\nLet me be clear, Enter the Gungeon is a fun game overall, but I would not recommend this game for one simple reason: You don't control your health. I can accept wiggly bullets, I can accept a lead maiden in a room with no cover, but only in a game where I have a chance to heal up after such scenarios. In later floors, health is scarce, and you cant even use an Item to regain any health or convert your Gungeoneering skill to a health reward because health and armour related items are either super rare, or single use and super rare. Additionally, saved health doesn't travel across floors, which if it did, I would maybe think differently about this game.\r\nAgain, EtG is fun, but I can't recommend subjecting yourself to a slow hellish forthcoming burn. you know what, maybe that's the point. Maybe the Gungeon is SUPPOSED to be hell. Maybe that was the idea, to make the experience of crawling deeper and deeper and having every run ended with an unfair pitfall. But  this isn't hell, it's a game, and the aim of a game is to be fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feels more like a shoot em up than a rouge like and im surprised this is as popular as it is. None of the characters or items feel really unique to me. The unlock system feels poor to me. Visuals also can get crazy in a rouge like bullet hell but sometimes it seems like poor design to me. Red bullets in a room with red carpet with red indicators for enemy spawns that can spawn red enemies. Speaking of visuals for how underwhelming most guns are they make a lot of visual clutter.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Floor two Bulletkin (veteran Shotgun kin...) were showing up on floor 1. Any fun I was having evaporated. Checked the wiki, and it's a feature. Cmon. The skill floor isn't even high, it's just entirely random based on whether or not the game likes you. Play another bullet hell that's cheaper and actually relies on skill to unlock secrets.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks and everyone who ever tried to convince me that its good is evil\r\nwhat if nuclear throne was really slow and felt terrible to play and had items that didnt do anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant get to work with 2 controllers which was the main motivation for buying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ridiculously hard. There's no sense of achievement or feeling of advancement. You have to try like 500 times to get a good run. There are many other bullet hell games that are much more fun and enjoyable than this. Don't recommend. Trust",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "getting 100% in this game is absolutely miserable",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "grindy and no meta progression. just not fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hate this game!\r\nI am too old for this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Felt too repetitive too fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont like this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can’t quite see the appeal of this game. As a roguelike, its RNG design feels off. There’s a large pool of weapons, but in practice they barely differ beyond DPS. Meanwhile, the maps, enemy encounters, and bosses vary so little that runs feel like pre-designed stages rather than true roguelike experiences. Character building also feels shallow: you rarely get meaningful choices at chests or shops—most of the time you’re stuck with a simple take-it-or-leave-it decision.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Unfortunately I didn't like this game and I played for 30 hours trying to like it. I'm definitely the problem lol.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is 100% style over substance. It's neither a good roguelite nor a good bullet hell, yet somehow the worst of both worlds combined. \n\nIt's an completely unbalanced mess with extremely slow and tedious meta progression, no character building whatsoever and 99% of all items/guns are trash. The dodge roll mechanic goes against everything any real bullet hell shoot em up teaches you and does ultimately more harm than good. Bosses are ridiculous bullet sponges and mid bosses are even worse.\n\nIt does look nice, I give it that. But so does The Binding of Isaac and that game plays really well and is a lot of fun.\n\nGo buy The Binding of Isaac.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This might be my least favorite roguelike yet. It missed the mark so hard. \n\nIt feels like they collected a big pile of assets and then put them into an RNG. \n\nThey could have used these resources to actually make an awesome game.\n\nTo me, that's not really a 'game'. It feels really lazy. Like I'm just gambling with my time at their unfinished casino. \n\nThe progression is very unrewarding. The entire challenge of the game feels like I'm suffering through the developers laziness instead of enjoying their vision.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The \"bullet hell\" half of this game is great. Amazing bosses, gunplay, cool guns.\n\nBut the \"roguelike\" sucks:\n- Runs blend together.\n- No time-limit means I'm incentivized to clear every room, which is boring.\n- Replaying early chambers every run is boring as fuck. (you're incentivized to not skip)\n- OP guns completely break the balance of certain runs. Makes wins feel undeserved.\n\nI beat the normal ending on some characters but couldn't bother with anything else.\nWish I had bought hades instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Roguelike isn't my favorite genre, but some have hit for me. I found the gameplay of this one boring despite usually loving twin-stick shooters.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a big fan of the pseudo ice skating esque movement. The game as a whole is beautiful, but the arcade version is more fun tbh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "incredible game, but there are to much crashes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great game, love it with all my heart, the lost adventurer achievement can go blow its brains out in an alleyway.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels more like a shoot em up than a rouge like and im surprised this is as popular as it is. None of the characters or items feel really unique to me. The unlock system feels poor to me. Visuals also can get crazy in a rouge like bullet hell but sometimes it seems like poor design to me. Red bullets in a room with red carpet with red indicators for enemy spawns that can spawn red enemies. Speaking of visuals for how underwhelming most guns are they make a lot of visual clutter.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Roguelike y Bullet Hell con 3 vidas no es de las mejores combinaciones para un juego. Cada partida tenes que jugar al no-hit practicamente y aburre tryhardear un juego de pixeles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks and everyone who ever tried to convince me that its good is evil\r\nwhat if nuclear throne was really slow and felt terrible to play and had items that didnt do anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant get to work with 2 controllers which was the main motivation for buying",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ridiculously hard. There's no sense of achievement or feeling of advancement. You have to try like 500 times to get a good run. There are many other bullet hell games that are much more fun and enjoyable than this. Don't recommend. Trust",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "getting 100% in this game is absolutely miserable",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "grindy and no meta progression. just not fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hate this game!\r\nI am too old for this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Felt too repetitive too fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this ones not for me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can’t quite see the appeal of this game. As a roguelike, its RNG design feels off. There’s a large pool of weapons, but in practice they barely differ beyond DPS. Meanwhile, the maps, enemy encounters, and bosses vary so little that runs feel like pre-designed stages rather than true roguelike experiences. Character building also feels shallow: you rarely get meaningful choices at chests or shops—most of the time you’re stuck with a simple take-it-or-leave-it decision.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is 100% style over substance. It's neither a good roguelite nor a good bullet hell, yet somehow the worst of both worlds combined. \n\nIt's an completely unbalanced mess with extremely slow and tedious meta progression, no character building whatsoever and 99% of all items/guns are trash. The dodge roll mechanic goes against everything any real bullet hell shoot em up teaches you and does ultimately more harm than good. Bosses are ridiculous bullet sponges and mid bosses are even worse.\n\nIt does look nice, I give it that. But so does The Binding of Isaac and that game plays really well and is a lot of fun.\n\nGo buy The Binding of Isaac.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This might be my least favorite roguelike yet. It missed the mark so hard. \n\nIt feels like they collected a big pile of assets and then put them into an RNG. \n\nThey could have used these resources to actually make an awesome game.\n\nTo me, that's not really a 'game'. It feels really lazy. Like I'm just gambling with my time at their unfinished casino. \n\nThe progression is very unrewarding. The entire challenge of the game feels like I'm suffering through the developers laziness instead of enjoying their vision.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Roguelike isn't my favorite genre, but some have hit for me. I found the gameplay of this one boring despite usually loving twin-stick shooters.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a big fan of the pseudo ice skating esque movement. The game as a whole is beautiful, but the arcade version is more fun tbh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "incredible game, but there are to much crashes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The \"bullet hell\" half of this game is great. Amazing bosses, gunplay, cool guns.\n\nBut the \"roguelike\" sucks:\n- Runs blend together.\n- No time-limit means I'm incentivized to clear every room, which is boring.\n- Replaying early chambers every run is boring as fuck. (you're incentivized to not skip)\n- OP guns completely break the balance of certain runs. Makes wins feel undeserved.\n\nI beat the normal ending on some characters but couldn't bother with anything else.\nWish I had bought hades instead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I know it's part of the rougelike to have good and bad runs, strong and weak weapons, and easy and hard enemies, but it doesn't matter that \"rougelikes are just like that\" when the aim of a game is to be fun. No, I'm not saying Enter the Gungeon is not fun, it is overall pretty fun to me. But there are parts about this game that are very VERY not fun that I wish didn't effect my playing experience. Look, I know rouguelikes are inherently unfair at times, I know EtG is a rougelike, I know not every run is supposed to finish, but sometimes I end a run cursing the game itself more often than its enemies, and I don't think that's intended. \r\nHere's the thing, EtG is HARD. I know that, I know it's supposed to be, and I like the difficulty. My favorite bosses are the Treadnaught and the Kill Pillars. They are both VERY bullet hellish bosses, on par with the Lich and Dragon boss. What sets them apart from those others though, is their consistent, hard but fair difficulty. The tank boss will always shoot small bullets at you from behind, clamping you in with a main caliber round. Very hard to dodge, but I can see it from a mile away, and the columns in the boss room help as, though temporary, good cover. The lich also has this at parts, but the 3rd stage's lack of telegraphing of where the chain thingies go have sniped me out of a run more times than I'd like. The dragon has this spray attack that spits bullets fast enough that I can't weave through them, but slow enough that a dodge roll is ended with a stray bullet. \r\nThis is my biggest grope with this game. Stray bullets, wiggly bullets, those offscreen guns during the high priest boss. They come out of nowhere. Now, I understand it's just the nature of a procedural generated game to have random elements and that these random elements will eventually end with a stray bullet ending a run or two, but wiggly bullets? offscreen bullets? Those were intentional and have caused me to say \"WHY DO THOSE EXIST\" and whatnot.\r\nI will say this though, occasional vietkong or worm bullets is not bad design. In fact, I am a firm believer that impending damage can add a lot to a game, but in this game, the damage these bullets do is enormous in a given run. Only 1 stray bullet a floor will result in half health by Bullet Hell, that's not including general damage from bosses or enemies, and assuming two heart upgrades are found. Seriously, the chip damage the Gungeon will do kills more than the Lich. So what's the point then? What am I trying to get across now?\r\n\r\nLet me be clear, Enter the Gungeon is a fun game overall, but I would not recommend this game for one simple reason: You don't control your health. I can accept wiggly bullets, I can accept a lead maiden in a room with no cover, but only in a game where I have a chance to heal up after such scenarios. In later floors, health is scarce, and you cant even use an Item to regain any health or convert your Gungeoneering skill to a health reward because health and armour related items are either super rare, or single use and super rare. Additionally, saved health doesn't travel across floors, which if it did, I would maybe think differently about this game.\r\nAgain, EtG is fun, but I can't recommend subjecting yourself to a slow hellish forthcoming burn. you know what, maybe that's the point. Maybe the Gungeon is SUPPOSED to be hell. Maybe that was the idea, to make the experience of crawling deeper and deeper and having every run ended with an unfair pitfall. But  this isn't hell, it's a game, and the aim of a game is to be fun.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "great game, love it with all my heart, the lost adventurer achievement can go blow its brains out in an alleyway.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game misuses the \"Bullet Hell\" tag, as not only game's \"dodging\" focuses primarily on bullet cancels/dodge roll abusing/macrododging (macrododging - going around bullets), but also character hitboxes are too big, disrespecting the deep and dead subgenre that it's using as an aesthetic/marketing choice to appeal to mainsteam audience.\r\n\r\nIf anything, Enter the Gungeon is more of a cover shooter rather than an actual bullet hell.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Feels more like a shoot em up than a rouge like and im surprised this is as popular as it is. None of the characters or items feel really unique to me. The unlock system feels poor to me. Visuals also can get crazy in a rouge like bullet hell but sometimes it seems like poor design to me. Red bullets in a room with red carpet with red indicators for enemy spawns that can spawn red enemies. Speaking of visuals for how underwhelming most guns are they make a lot of visual clutter.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Floor two Bulletkin (veteran Shotgun kin...) were showing up on floor 1. Any fun I was having evaporated. Checked the wiki, and it's a feature. Cmon. The skill floor isn't even high, it's just entirely random based on whether or not the game likes you. Play another bullet hell that's cheaper and actually relies on skill to unlock secrets.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks and everyone who ever tried to convince me that its good is evil\r\nwhat if nuclear throne was really slow and felt terrible to play and had items that didnt do anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ridiculously hard. There's no sense of achievement or feeling of advancement. You have to try like 500 times to get a good run. There are many other bullet hell games that are much more fun and enjoyable than this. Don't recommend. Trust",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "getting 100% in this game is absolutely miserable",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "grindy and no meta progression. just not fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Felt too repetitive too fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont like this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can’t quite see the appeal of this game. As a roguelike, its RNG design feels off. There’s a large pool of weapons, but in practice they barely differ beyond DPS. Meanwhile, the maps, enemy encounters, and bosses vary so little that runs feel like pre-designed stages rather than true roguelike experiences. Character building also feels shallow: you rarely get meaningful choices at chests or shops—most of the time you’re stuck with a simple take-it-or-leave-it decision.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is 100% style over substance. It's neither a good roguelite nor a good bullet hell, yet somehow the worst of both worlds combined. \n\nIt's an completely unbalanced mess with extremely slow and tedious meta progression, no character building whatsoever and 99% of all items/guns are trash. The dodge roll mechanic goes against everything any real bullet hell shoot em up teaches you and does ultimately more harm than good. Bosses are ridiculous bullet sponges and mid bosses are even worse.\n\nIt does look nice, I give it that. But so does The Binding of Isaac and that game plays really well and is a lot of fun.\n\nGo buy The Binding of Isaac.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This might be my least favorite roguelike yet. It missed the mark so hard. \n\nIt feels like they collected a big pile of assets and then put them into an RNG. \n\nThey could have used these resources to actually make an awesome game.\n\nTo me, that's not really a 'game'. It feels really lazy. Like I'm just gambling with my time at their unfinished casino. \n\nThe progression is very unrewarding. The entire challenge of the game feels like I'm suffering through the developers laziness instead of enjoying their vision.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Roguelike isn't my favorite genre, but some have hit for me. I found the gameplay of this one boring despite usually loving twin-stick shooters.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a big fan of the pseudo ice skating esque movement. The game as a whole is beautiful, but the arcade version is more fun tbh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "incredible game, but there are to much crashes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The \"bullet hell\" half of this game is great. Amazing bosses, gunplay, cool guns.\n\nBut the \"roguelike\" sucks:\n- Runs blend together.\n- No time-limit means I'm incentivized to clear every room, which is boring.\n- Replaying early chambers every run is boring as fuck. (you're incentivized to not skip)\n- OP guns completely break the balance of certain runs. Makes wins feel undeserved.\n\nI beat the normal ending on some characters but couldn't bother with anything else.\nWish I had bought hades instead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I know it's part of the rougelike to have good and bad runs, strong and weak weapons, and easy and hard enemies, but it doesn't matter that \"rougelikes are just like that\" when the aim of a game is to be fun. No, I'm not saying Enter the Gungeon is not fun, it is overall pretty fun to me. But there are parts about this game that are very VERY not fun that I wish didn't effect my playing experience. Look, I know rouguelikes are inherently unfair at times, I know EtG is a rougelike, I know not every run is supposed to finish, but sometimes I end a run cursing the game itself more often than its enemies, and I don't think that's intended. \r\nHere's the thing, EtG is HARD. I know that, I know it's supposed to be, and I like the difficulty. My favorite bosses are the Treadnaught and the Kill Pillars. They are both VERY bullet hellish bosses, on par with the Lich and Dragon boss. What sets them apart from those others though, is their consistent, hard but fair difficulty. The tank boss will always shoot small bullets at you from behind, clamping you in with a main caliber round. Very hard to dodge, but I can see it from a mile away, and the columns in the boss room help as, though temporary, good cover. The lich also has this at parts, but the 3rd stage's lack of telegraphing of where the chain thingies go have sniped me out of a run more times than I'd like. The dragon has this spray attack that spits bullets fast enough that I can't weave through them, but slow enough that a dodge roll is ended with a stray bullet. \r\nThis is my biggest grope with this game. Stray bullets, wiggly bullets, those offscreen guns during the high priest boss. They come out of nowhere. Now, I understand it's just the nature of a procedural generated game to have random elements and that these random elements will eventually end with a stray bullet ending a run or two, but wiggly bullets? offscreen bullets? Those were intentional and have caused me to say \"WHY DO THOSE EXIST\" and whatnot.\r\nI will say this though, occasional vietkong or worm bullets is not bad design. In fact, I am a firm believer that impending damage can add a lot to a game, but in this game, the damage these bullets do is enormous in a given run. Only 1 stray bullet a floor will result in half health by Bullet Hell, that's not including general damage from bosses or enemies, and assuming two heart upgrades are found. Seriously, the chip damage the Gungeon will do kills more than the Lich. So what's the point then? What am I trying to get across now?\r\n\r\nLet me be clear, Enter the Gungeon is a fun game overall, but I would not recommend this game for one simple reason: You don't control your health. I can accept wiggly bullets, I can accept a lead maiden in a room with no cover, but only in a game where I have a chance to heal up after such scenarios. In later floors, health is scarce, and you cant even use an Item to regain any health or convert your Gungeoneering skill to a health reward because health and armour related items are either super rare, or single use and super rare. Additionally, saved health doesn't travel across floors, which if it did, I would maybe think differently about this game.\r\nAgain, EtG is fun, but I can't recommend subjecting yourself to a slow hellish forthcoming burn. you know what, maybe that's the point. Maybe the Gungeon is SUPPOSED to be hell. Maybe that was the idea, to make the experience of crawling deeper and deeper and having every run ended with an unfair pitfall. But  this isn't hell, it's a game, and the aim of a game is to be fun.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "great game, love it with all my heart, the lost adventurer achievement can go blow its brains out in an alleyway.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game misuses the \"Bullet Hell\" tag, as not only game's \"dodging\" focuses primarily on bullet cancels/dodge roll abusing/macrododging (macrododging - going around bullets), but also character hitboxes are too big, disrespecting the deep and dead subgenre that it's using as an aesthetic/marketing choice to appeal to mainsteam audience.\r\n\r\nIf anything, Enter the Gungeon is more of a cover shooter rather than an actual bullet hell.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Feels more like a shoot em up than a rouge like and im surprised this is as popular as it is. None of the characters or items feel really unique to me. The unlock system feels poor to me. Visuals also can get crazy in a rouge like bullet hell but sometimes it seems like poor design to me. Red bullets in a room with red carpet with red indicators for enemy spawns that can spawn red enemies. Speaking of visuals for how underwhelming most guns are they make a lot of visual clutter.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Floor two Bulletkin (veteran Shotgun kin...) were showing up on floor 1. Any fun I was having evaporated. Checked the wiki, and it's a feature. Cmon. The skill floor isn't even high, it's just entirely random based on whether or not the game likes you. Play another bullet hell that's cheaper and actually relies on skill to unlock secrets.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks and everyone who ever tried to convince me that its good is evil\r\nwhat if nuclear throne was really slow and felt terrible to play and had items that didnt do anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ridiculously hard. There's no sense of achievement or feeling of advancement. You have to try like 500 times to get a good run. There are many other bullet hell games that are much more fun and enjoyable than this. Don't recommend. Trust",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "getting 100% in this game is absolutely miserable",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "grindy and no meta progression. just not fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Felt too repetitive too fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont like this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can’t quite see the appeal of this game. As a roguelike, its RNG design feels off. There’s a large pool of weapons, but in practice they barely differ beyond DPS. Meanwhile, the maps, enemy encounters, and bosses vary so little that runs feel like pre-designed stages rather than true roguelike experiences. Character building also feels shallow: you rarely get meaningful choices at chests or shops—most of the time you’re stuck with a simple take-it-or-leave-it decision.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is 100% style over substance. It's neither a good roguelite nor a good bullet hell, yet somehow the worst of both worlds combined. \n\nIt's an completely unbalanced mess with extremely slow and tedious meta progression, no character building whatsoever and 99% of all items/guns are trash. The dodge roll mechanic goes against everything any real bullet hell shoot em up teaches you and does ultimately more harm than good. Bosses are ridiculous bullet sponges and mid bosses are even worse.\n\nIt does look nice, I give it that. But so does The Binding of Isaac and that game plays really well and is a lot of fun.\n\nGo buy The Binding of Isaac.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This might be my least favorite roguelike yet. It missed the mark so hard. \n\nIt feels like they collected a big pile of assets and then put them into an RNG. \n\nThey could have used these resources to actually make an awesome game.\n\nTo me, that's not really a 'game'. It feels really lazy. Like I'm just gambling with my time at their unfinished casino. \n\nThe progression is very unrewarding. The entire challenge of the game feels like I'm suffering through the developers laziness instead of enjoying their vision.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Roguelike isn't my favorite genre, but some have hit for me. I found the gameplay of this one boring despite usually loving twin-stick shooters.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a big fan of the pseudo ice skating esque movement. The game as a whole is beautiful, but the arcade version is more fun tbh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "incredible game, but there are to much crashes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The \"bullet hell\" half of this game is great. Amazing bosses, gunplay, cool guns.\n\nBut the \"roguelike\" sucks:\n- Runs blend together.\n- No time-limit means I'm incentivized to clear every room, which is boring.\n- Replaying early chambers every run is boring as fuck. (you're incentivized to not skip)\n- OP guns completely break the balance of certain runs. Makes wins feel undeserved.\n\nI beat the normal ending on some characters but couldn't bother with anything else.\nWish I had bought hades instead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I know it's part of the rougelike to have good and bad runs, strong and weak weapons, and easy and hard enemies, but it doesn't matter that \"rougelikes are just like that\" when the aim of a game is to be fun. No, I'm not saying Enter the Gungeon is not fun, it is overall pretty fun to me. But there are parts about this game that are very VERY not fun that I wish didn't effect my playing experience. Look, I know rouguelikes are inherently unfair at times, I know EtG is a rougelike, I know not every run is supposed to finish, but sometimes I end a run cursing the game itself more often than its enemies, and I don't think that's intended. \r\nHere's the thing, EtG is HARD. I know that, I know it's supposed to be, and I like the difficulty. My favorite bosses are the Treadnaught and the Kill Pillars. They are both VERY bullet hellish bosses, on par with the Lich and Dragon boss. What sets them apart from those others though, is their consistent, hard but fair difficulty. The tank boss will always shoot small bullets at you from behind, clamping you in with a main caliber round. Very hard to dodge, but I can see it from a mile away, and the columns in the boss room help as, though temporary, good cover. The lich also has this at parts, but the 3rd stage's lack of telegraphing of where the chain thingies go have sniped me out of a run more times than I'd like. The dragon has this spray attack that spits bullets fast enough that I can't weave through them, but slow enough that a dodge roll is ended with a stray bullet. \r\nThis is my biggest grope with this game. Stray bullets, wiggly bullets, those offscreen guns during the high priest boss. They come out of nowhere. Now, I understand it's just the nature of a procedural generated game to have random elements and that these random elements will eventually end with a stray bullet ending a run or two, but wiggly bullets? offscreen bullets? Those were intentional and have caused me to say \"WHY DO THOSE EXIST\" and whatnot.\r\nI will say this though, occasional vietkong or worm bullets is not bad design. In fact, I am a firm believer that impending damage can add a lot to a game, but in this game, the damage these bullets do is enormous in a given run. Only 1 stray bullet a floor will result in half health by Bullet Hell, that's not including general damage from bosses or enemies, and assuming two heart upgrades are found. Seriously, the chip damage the Gungeon will do kills more than the Lich. So what's the point then? What am I trying to get across now?\r\n\r\nLet me be clear, Enter the Gungeon is a fun game overall, but I would not recommend this game for one simple reason: You don't control your health. I can accept wiggly bullets, I can accept a lead maiden in a room with no cover, but only in a game where I have a chance to heal up after such scenarios. In later floors, health is scarce, and you cant even use an Item to regain any health or convert your Gungeoneering skill to a health reward because health and armour related items are either super rare, or single use and super rare. Additionally, saved health doesn't travel across floors, which if it did, I would maybe think differently about this game.\r\nAgain, EtG is fun, but I can't recommend subjecting yourself to a slow hellish forthcoming burn. you know what, maybe that's the point. Maybe the Gungeon is SUPPOSED to be hell. Maybe that was the idea, to make the experience of crawling deeper and deeper and having every run ended with an unfair pitfall. But  this isn't hell, it's a game, and the aim of a game is to be fun.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "great game, love it with all my heart, the lost adventurer achievement can go blow its brains out in an alleyway.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game misuses the \"Bullet Hell\" tag, as not only game's \"dodging\" focuses primarily on bullet cancels/dodge roll abusing/macrododging (macrododging - going around bullets), but also character hitboxes are too big, disrespecting the deep and dead subgenre that it's using as an aesthetic/marketing choice to appeal to mainsteam audience.\r\n\r\nIf anything, Enter the Gungeon is more of a cover shooter rather than an actual bullet hell.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Feels more like a shoot em up than a rouge like and im surprised this is as popular as it is. None of the characters or items feel really unique to me. The unlock system feels poor to me. Visuals also can get crazy in a rouge like bullet hell but sometimes it seems like poor design to me. Red bullets in a room with red carpet with red indicators for enemy spawns that can spawn red enemies. Speaking of visuals for how underwhelming most guns are they make a lot of visual clutter.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Floor two Bulletkin (veteran Shotgun kin...) were showing up on floor 1. Any fun I was having evaporated. Checked the wiki, and it's a feature. Cmon. The skill floor isn't even high, it's just entirely random based on whether or not the game likes you. Play another bullet hell that's cheaper and actually relies on skill to unlock secrets.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks and everyone who ever tried to convince me that its good is evil\r\nwhat if nuclear throne was really slow and felt terrible to play and had items that didnt do anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ridiculously hard. There's no sense of achievement or feeling of advancement. You have to try like 500 times to get a good run. There are many other bullet hell games that are much more fun and enjoyable than this. Don't recommend. Trust",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "getting 100% in this game is absolutely miserable",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "grindy and no meta progression. just not fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Felt too repetitive too fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont like this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can’t quite see the appeal of this game. As a roguelike, its RNG design feels off. There’s a large pool of weapons, but in practice they barely differ beyond DPS. Meanwhile, the maps, enemy encounters, and bosses vary so little that runs feel like pre-designed stages rather than true roguelike experiences. Character building also feels shallow: you rarely get meaningful choices at chests or shops—most of the time you’re stuck with a simple take-it-or-leave-it decision.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is 100% style over substance. It's neither a good roguelite nor a good bullet hell, yet somehow the worst of both worlds combined. \n\nIt's an completely unbalanced mess with extremely slow and tedious meta progression, no character building whatsoever and 99% of all items/guns are trash. The dodge roll mechanic goes against everything any real bullet hell shoot em up teaches you and does ultimately more harm than good. Bosses are ridiculous bullet sponges and mid bosses are even worse.\n\nIt does look nice, I give it that. But so does The Binding of Isaac and that game plays really well and is a lot of fun.\n\nGo buy The Binding of Isaac.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This might be my least favorite roguelike yet. It missed the mark so hard. \n\nIt feels like they collected a big pile of assets and then put them into an RNG. \n\nThey could have used these resources to actually make an awesome game.\n\nTo me, that's not really a 'game'. It feels really lazy. Like I'm just gambling with my time at their unfinished casino. \n\nThe progression is very unrewarding. The entire challenge of the game feels like I'm suffering through the developers laziness instead of enjoying their vision.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Roguelike isn't my favorite genre, but some have hit for me. I found the gameplay of this one boring despite usually loving twin-stick shooters.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a big fan of the pseudo ice skating esque movement. The game as a whole is beautiful, but the arcade version is more fun tbh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "incredible game, but there are to much crashes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The \"bullet hell\" half of this game is great. Amazing bosses, gunplay, cool guns.\n\nBut the \"roguelike\" sucks:\n- Runs blend together.\n- No time-limit means I'm incentivized to clear every room, which is boring.\n- Replaying early chambers every run is boring as fuck. (you're incentivized to not skip)\n- OP guns completely break the balance of certain runs. Makes wins feel undeserved.\n\nI beat the normal ending on some characters but couldn't bother with anything else.\nWish I had bought hades instead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I know it's part of the rougelike to have good and bad runs, strong and weak weapons, and easy and hard enemies, but it doesn't matter that \"rougelikes are just like that\" when the aim of a game is to be fun. No, I'm not saying Enter the Gungeon is not fun, it is overall pretty fun to me. But there are parts about this game that are very VERY not fun that I wish didn't effect my playing experience. Look, I know rouguelikes are inherently unfair at times, I know EtG is a rougelike, I know not every run is supposed to finish, but sometimes I end a run cursing the game itself more often than its enemies, and I don't think that's intended. \r\nHere's the thing, EtG is HARD. I know that, I know it's supposed to be, and I like the difficulty. My favorite bosses are the Treadnaught and the Kill Pillars. They are both VERY bullet hellish bosses, on par with the Lich and Dragon boss. What sets them apart from those others though, is their consistent, hard but fair difficulty. The tank boss will always shoot small bullets at you from behind, clamping you in with a main caliber round. Very hard to dodge, but I can see it from a mile away, and the columns in the boss room help as, though temporary, good cover. The lich also has this at parts, but the 3rd stage's lack of telegraphing of where the chain thingies go have sniped me out of a run more times than I'd like. The dragon has this spray attack that spits bullets fast enough that I can't weave through them, but slow enough that a dodge roll is ended with a stray bullet. \r\nThis is my biggest grope with this game. Stray bullets, wiggly bullets, those offscreen guns during the high priest boss. They come out of nowhere. Now, I understand it's just the nature of a procedural generated game to have random elements and that these random elements will eventually end with a stray bullet ending a run or two, but wiggly bullets? offscreen bullets? Those were intentional and have caused me to say \"WHY DO THOSE EXIST\" and whatnot.\r\nI will say this though, occasional vietkong or worm bullets is not bad design. In fact, I am a firm believer that impending damage can add a lot to a game, but in this game, the damage these bullets do is enormous in a given run. Only 1 stray bullet a floor will result in half health by Bullet Hell, that's not including general damage from bosses or enemies, and assuming two heart upgrades are found. Seriously, the chip damage the Gungeon will do kills more than the Lich. So what's the point then? What am I trying to get across now?\r\n\r\nLet me be clear, Enter the Gungeon is a fun game overall, but I would not recommend this game for one simple reason: You don't control your health. I can accept wiggly bullets, I can accept a lead maiden in a room with no cover, but only in a game where I have a chance to heal up after such scenarios. In later floors, health is scarce, and you cant even use an Item to regain any health or convert your Gungeoneering skill to a health reward because health and armour related items are either super rare, or single use and super rare. Additionally, saved health doesn't travel across floors, which if it did, I would maybe think differently about this game.\r\nAgain, EtG is fun, but I can't recommend subjecting yourself to a slow hellish forthcoming burn. you know what, maybe that's the point. Maybe the Gungeon is SUPPOSED to be hell. Maybe that was the idea, to make the experience of crawling deeper and deeper and having every run ended with an unfair pitfall. But  this isn't hell, it's a game, and the aim of a game is to be fun.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "great game, love it with all my heart, the lost adventurer achievement can go blow its brains out in an alleyway.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game misuses the \"Bullet Hell\" tag, as not only game's \"dodging\" focuses primarily on bullet cancels/dodge roll abusing/macrododging (macrododging - going around bullets), but also character hitboxes are too big, disrespecting the deep and dead subgenre that it's using as an aesthetic/marketing choice to appeal to mainsteam audience.\r\n\r\nIf anything, Enter the Gungeon is more of a cover shooter rather than an actual bullet hell.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Feels more like a shoot em up than a rouge like and im surprised this is as popular as it is. None of the characters or items feel really unique to me. The unlock system feels poor to me. Visuals also can get crazy in a rouge like bullet hell but sometimes it seems like poor design to me. Red bullets in a room with red carpet with red indicators for enemy spawns that can spawn red enemies. Speaking of visuals for how underwhelming most guns are they make a lot of visual clutter.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}