{
  "positive": [
    {
      "review": "[h1] This game is amazing. But it's not for everyone. [/h1]\r\n[h2]This is not a review, this is a warning.[/h2]\r\n\r\nIf you are looking for a fun game that is easy to pick up, don't play this game.\r\nThis game is meant for people who have patience and are willing to put up with esoteric controls and vague goals.\r\n\r\nBut if you put up with it and wade through all the obtuse controls and vagueness, you will find that this game is a gem not usually talked about. The story is incredible and the environments look amazing.\r\nThe ecology is incredible as well and the world feels alive.\r\n\r\nAnd after some more time, the controls will feel buttery smooth and everything will be clear in hindsight. You'll be able to understand how the game works through careful observation and experimentation.\r\n\r\nIf you need help, there's wonderful people over in the Rain World discord that are willing to help and guide you through the game.",
      "voted_up": true,
      "votes_helpful": 86
    },
    {
      "review": "Rain World is simply one of the best games of 2017, atleast the most innovative, like what do you mean theres advanced AI, and Perpetual Animation in a single game? I mean Rain World is basically a playground for computer nerds.\n\nThe story of Rain World is one of the best parts, the slugcat is insignificant compared to what's actaully happening, I wont spoil anything, but this game has environmental story telling, so pay attention to everything if it looks detailed enough, someone also made a lore breakdown which is outdated now but its one of the most cinematic lore breakdowns of Rain World, its called The Affairs of Passing Gods.\n\nAs for the gameplay, it is very difficult at first, which is why critics hated it, alot of people spend 5 minutes in the first area and leave a bad review because they didnt THINK and PAY ATTENTION to their surroundings, they always expect games to take their hand and help them every step of the way, not Rain World, in this game youll be fully immersed in the world, you and slugcat at the start of the game are already very similar, waking up in an unfamiliar environment and seeing wierd creatures, the only tutorial the game gives is what the slugcat knows, the game will still occasionally give hints, but its only mechanics you need to know in order to progress the game.\n\nAnyways to summarize this, Rain World has alot of advanced computer stuff, is very difficult at first, and has great story, my only problem is room CC_C08 (only rw vets will know)",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "I am incapable of playing this game without the \"Push to Meow\" mod. I do not know why this is the case.\n\nAlso the game is wonderful on every level.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "Words can't describe the impact this game had on me. It's a beautiful experience, really, and one I'm very glad to have had. Rain World means a lot to me.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": ">be me\n>buy some random game w/ a silly cat-like protagonist\n>mfw rain world reveals itself to be one of the most beautiful games ive ever played\n\nif youre struggling w/ its difficulty trust me youll get better eventually & receive one of the most unique & unforgettable playthroughs. have fun",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "This game is very thought provoking. I really like the fat one because jester is fat in real life and it reminds me of her",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This game is AWESOME! although a bit difficult for some, if you like some kind of challenge, I'd definitely recommend it, the modding scene is also pretty good for this! it's also very pretty..\nIf you want to play with friends I do recommend picking up the Downpour DLC, or let one of your other friends who has it host, as it has co-op for story mode, otherwise you'd be fighting to the death in Arena, and only that.\n(I do recommend playing it vanilla first though.)\nOverall, I give this a cyan lizard out of ten. (Cyans are my favorite, but I love all lizards.)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Rain World is a very well made game with it's eco system, making the player seem like they're apart of it whilst not running it which is a very impressive feat to pull off and I like it that way. Although it doesn't hold your hand most of the time and does require a lot of trial and error to actually survive through the eco system with your only help being a short tutorial on very basic movement and a guide what can be killed leading you to your way. \n[b] If trial and error, non hand holding gameplay isn't your thing I wouldn't suggest picking it up though. [/b]\n\nThe story hidden within the world is also very interesting, but I wouldn't want to spoil it. But if you do want to uncover some information about this world, try bringing a coloured pearl found within The Survivor's campaign to an NPC what can be found later on within the story. Hint: Go to the Blue one after receiving something from the pink and orange one.\n\nDespite what people tell you, I would suggest going through The Monk's campaign for a much easier first time then going for The Survivor's campaign next for the more difficult experience but The Survivor is a very good start too if you're wanting the more intended experience.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Before you decide to buy this game, just remember this game will make you mad. Especially if you're playing with friends, and you will still continue playing it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "When I first got this game, I actually refunded it. I was annoyed at a lot of things--the initial lack of direction, how everything was out to get you, and what felt like too little time to explore the world.\n\nI purchased it again and I can tell you that this is exactly what makes the game charming. You'll absolutely get mad if you play this game--I don't know how many times I rage quit myself--but the enjoyment comes from learning the nature of the game, understanding your role as your character, and going where you want while the world moves around you. The scenery and music are also a great bonus!\n\nIt's a great game. I've only played it for around 100 hours, but I've continued to think about it for much longer. Definitely try it out!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "As alien and unique as this game appears on the surface, its world is strangely familiar to the mysterious magic of our own lives.\n\n- Awakening in an ancient world of mystery. \n- Guided by a seemingly higher intelligence through symbols & intuition.\n- Exploring liminal underground spaces, to the most cosmic voids of heights.\n- Slowly gaining wisdom of the numinous ecosystem woven into the ghost of a forgotten time.\n\nAll lived through a small, squishy slugcat.\n\nIt's lonely. It's alien. It's a labyrinth. It's dangerous. It's difficult...\nAnd yet it's somehow so hopeful, inspiring, and filled with joy.\n\nA loving, higher awareness seems to haunt your path as you quietly (or not) move through its realms. The ecosystem breaths with the ancient hum of sacred machinery as its vessel.\n\nThere's this comfort in Rain World that reflects the magic of the human experience:\nThe intuition, the trial & errors, the unknown, the meaning-making, the hope.\n\nThere's a pure soul-acknowledgment in this game that left me bittersweet, just like life.\nIts beautiful how the most niche of games can be the most impactful... and cute.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I can't really say much that hasn't been said before. Rain World is a frustratingly difficult survival-platforming game that rewards the process of trial and error in terms of learning. Sometimes, you'll get bs'd. And that's the point. If you pick up this game and give it a try, play the Survivor campaign first and always remember that it's okay to die.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "most perfect game ever in my whole life. this game changed my perspective on life, for the animals ive eaten must relate to the slug cat. i love the slug cat.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "very very good and also very very hard. shoutouts to my coop buddy for gifting me this and also for carrying me",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game thrusts you into the shoes of an animal thats prey to half of the world\nfinally a gender affirming game,,",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Rain World can be praised for a lot of things, but i think the most deserving part is how heavily this game utilizes movement tech. ain't never seen a game give so much attention to inputs... it's one of the most under-utilized parts of games since they often start and stop with pressing a button.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game chemically changed my mind and body. When i bought rainworld i was a straight cis male I played football and first person shooters after 9 hours of rainworld I am a trans bisexual woman that spends all day making things in unity and playing indie games. 10/10 would recomend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "OMG play this game NOW. It is THE BEST platformer on steam, 100s (maybe even ~1000s) of hours of content and story. Ik it probebly isn't needed at all but a competitive mulitplayer mode would be awsome (Ik there's a couch play thing, just wish I didn't have to stream it or have people over IRL)\r\n\r\njust please play this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game changed how I think about videogames. The AI of the creatures, the music and the background. Nothing moves or stops because of you, the game is as beautiful as you let it be. Let your self stop and observe, eventually it will click.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you want to:\n\nA)  go on a beautiful, lonely, challenging adventure across a truly alien landscape,\nB)  feel like you are surviving at the bottom of the food chain in a punishingly organic, lifelike ecosystem,\nC)  gradually piece together an incredible, climactic, transcendant story with cryptic puzzle-like world details,\n\nthen this is the game for you. And you should get it without reading anything else, and play it until it clicks. No walkthroughs, no reddit, just struggle and learn and adapt. There is nothing else even remotely like it.\n\nHighest recommendation. In my top-3 gaming experiences I've ever had. Might get a tattoo of slugcat sleeping.\n\nDLC is fun post-game content, but vanilla is where it's at.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got this game because my partner loves it\r\n\r\nfuck now i like it too.\r\n10x better with mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I first played this game it really felt boring at first but after went through some regions It became the most played game in my library",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lifechanging game, saved my marriage and my dog.\n\nA difficult but very rewarding survival game.\nBoth DLCs are terrific:\nDownpour is a character pack with added regions,\nWhile The Watcher is Rain world+, which is Rain World, but +.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that is endlessly beautiful and brutal at the same time. Absolutely gorgeous! Would 100% recommend and play again!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, great challanges, and I would recommend to freinds.\nAlso squiggly scugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest games I've ever played. It's extremely challenging and I've rage quit more times than I'm willing to admit, but theres so much content and I think everyone should check it out atleast once. Not for everyone, but defintely for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "List of a few reasons you should play rain world\r\n 1. The ecosystem, feels more alive than in any other game you´ll ever play. Each creature has its own behavior pattern and coding, which makes it seem like each one has some semblance of 'sentience' and instinct\r\n 2. Rain World is very rich in story and full of suprises mechanics and lore bits to uncover.\r\n 3. Difficulty, This game makes you feel as if you are truly an animal in a hostile ecosystem where nearly everything wants to kill you. It is a very chalenging game, that might not be for everyone but for people who enjoy, the 2d survival genre rain world is near perfect\r\n 4. Science fiction. I shouldn't need to say more on this one, given that sci-fi is already an amazing thing by itself \r\nThank you for reading another average rain world glaze review, i get these topics are already well repeated in the fandom/reviews, but for a good reason they are.\r\nWawa(goodbye) ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Local slugcat learns things no one is able to comprehend, commits suicide",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this game should win the Labour of love award, it was the first game to ever change my perspective on the way I see life in such a significant way",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game good, hard as fuck tho. Been playing for 17 hours and i just keep diying. I have no idea how this game ends. Be prepared to git gud.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLDR: This is a VERY good game that ISN'T necessarily challenging mechanics or reactions-wise, but really tests your patience. Lots of things are vague in this game and you WILL be dying, doing plenty of runbacks, and backtracking a lot because of the learn-things-yourself mentality of this game. \n\nAnyways, here is my specific contribution to the reviews.\nI played and beat the game completely blind. \nDo not do that!!! \n\nThis game doesn't always do a great job of telling you where to go, so there will be a lot of backtracking to be had. Sure, a lot of the fun in this game is finding things out, which is definitely what the developers intended, but not all players would be quick to pick up on subtle hints, if any, that the game hands out. And as such, there will be times of frustration and annoyance. If you have been stuck exploring around a shelter/location for a few deaths or cycles with no idea where to go or just don't want to spend time slugging your way towards unexplored parts of the map again and again, don't be afraid to consult a guide. It doesn't mean you're bad at the game or are \"ruining\" it. This game just does that good of a job of making you feel like a scared little animal. And that isn't for everyone, especially those who (understandably) want to chuck a controller at wall due to dying over and over and over again.\n\nDon't get me wrong, I believe this game is both artistically and technically impressive. Rain World isn't even mechanically hard in the way that games like the Soulsbornes or Elden Ring are hard, since I believe anyone of any skill level can beat this game. It's more of a question of how pissed off you get at dying again... and again... to the stupidest reasons imaginable. Or how many times you'll inevitably retrace your steps through areas you've seen before due to the rain limiting the time you have for foraging and finding paths that *might* lead you forwards, all the while dealing with particularly hungry lizards and other beasts.\n\nBut if you have a decent tolerance for struggling like I do, I can guarantee this is an experience you won't want to miss.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Changed my life permanently:\nRealized I was autistic\nBroke my egg\nMade my family grow a distinct resentment when I played it on the family playstation\nGave me thigh highs??/???//????///???????//?/\n10/10, youtube made a society worse by in every way by informing me of the existence of this absolute masterpiece of computer engineering, game design, and environmental storytelling",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game pretty much made a whole ecosystem while you traverse it, not to mention you can tame some of them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What can I say that hasn't already been said! This game is brilliant, and I really can't think of anything that's given me reason for dislike, complaint, or dissatisfaction. I will note that I found mods to be necessary (so I’d stay away from console versions, at least for now), both for new Slugcats and online multiplayer (which I’m still figuring out). Other than that, I’d say it’s a steal for around twenty bucks. \r\n\r\nThere’s a lot to enjoy in this game. Every environment, enemy, and song feels like it fits perfectly (if you ever want to fall down a rabbit hole, do some research into how the pathfinding works—I guarantee you won’t regret it!). So, what are you waiting for?\r\n\r\nOf course, my review would probably hold more weight if I’d actually finished the game before writing it… but just give me a minute! I’m taking it at a reasonably slow pace! Also, I've yet to try the DLC—I'll get back to you on that one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok, I'm gonna have to think for this one..\nNot because it's mediocre, but because it's so good I have to write a review able to do it justice.\n\nThis game.. is probably the best game I've ever played. I'm not joking.\n\nPlaying as each individual slugcat gave me so much gameplay to play through that I was thinking about this game every moment of every day. From the very beginning when you just view it as another survival game to playing as the last downpour campaign and watching the whole overarching storyline come to a close. despite the fact that most of the slugcats live in completely different time periods, never even meeting each other, seeing characters, wildlife, and the world as a whole evolve from the scattered perspective of each individual campaign gives each and every one a sense of importance. Every character is there for a reason, and sometimes getting specific endings as some unlock new endings for others set afterwards in the timeline, even if you're supposed to play through them before it. \n\nWhich is another thing; the order in which you play the campaigns isn't in the chronological one, meaning that in some campaigns you already know what happens afterwards, or what effect your actions have, which isn't necessarily bad, as in some cases it gives your actions more importance. In one campaign specifically you help a certain character in a dire situation [spoiler]deliver a message[/spoiler] , and what you comes afterwards makes the ending of that campaign all the more emotional (I won't elaborate more to avoid giving major spoilers). \n\nThe OST is really good as well; when a predator comes onto the room or you anger a reputation-based creature, hearing the threat music immediately rise is an incredibly used tool for showing a creature's relationship with you in a 2D game with a pixelly animation style, where body language isn't as obvious. Also the songs are good. including the songs that sometimes just play if there's no music or if you're in a specific room, and in certain lore related songs there's a motif that plays throughout them all (it's the same one as in the main menu for reference). When playing this game enough all the songs create an atmosphere as complex as the games ecosystem. Also when he rain comes everything goes quiet even if there are predators, which is very ambient\n\nAlso every creature has certain relationships with other creatures, from wanting to eat, to considering a part of its pack, to fighting for territory with, to ignoring completely. and when you start a cycle or enter a new region, it loads every room in the region, as well as the positions and desires of every. single. creature. meaning you can enter a room and witness a fight between two creatures already in action.\n\nAs my final point the symbolism used in this game is crazy. While at the beginning of the game to karma symbols (the things in the bottom left of your screen when you open the map) seem like just random symbols they each have their own lore-related meaning. There's also another, even more lore-related symbol that is used a lot more heavily throughout the game, but even mentioning any of it would spoil a lot, and I mean a lot.\n\nTL;DR Everything about this game is good. Just play it, and keep playing even when you die at every possible point because you get better and it gets a lot more interesting than just a survival game trust me.\n\nok hyperfixation rant over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing, i will never get over this game no matter how much i continue to suck at it.. there is no game like rainworld besides rainworld itself",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This does \"survival\" part better than many other survival games.\nGame is very atmospheric and world is immersive. Learning curve is quite steep, but figuring out the ecosystem is very satisfying. Devs don't seem to stop fleshing the game out, which is always a huge plus in my book.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite game of all time.\r\n\r\nThe characters, the physics, the ecosystem and its food chain, the art style and setting, the music, the beauty and threat of the rain, the vague but mystical story, the diverse and wonderful regions, the difficulty and skill ceiling, the journeying gameplay, the fantastic DLCs, the true, unfiltered VIBE of what it means to be Rain World; all culminating together into something I can proudly state as my favorite game of all time. I love looking back and reminiscing on the memories that have been made, and how this game has changed my life. Yes, it has its flaws, but it is beautifully flawed, making its imprint on me all the richer.\r\n\r\nThank you, Rain World, for existing, and being a good part of so many people's lives.\r\n\r\n\r\n\r\nAlso Slugcat for Smash!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, i recommend not looking up any info about the gameplay or story, at least not in the beginning. experiencing it pure like that is in my opinion the best way to play. I still havent looked up anything about it, and i honestly cant imagine that it would be nearly as fun as if you had a walktrough and the lore handed to you on a silver plate. I think youd get quickly tired of it and give up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing but its a nightmare as its like putting a fork in a toaster it is fun before it explodes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game so much with all it's cute little Slug-cats and their horrific backstories and campains :D This game is not for the weak hearted but once you get the groove it's amazing to kill anything and everything that once killed you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome, you should play it, from storytelling to the gameplay, this game is perfection for people who like survival games and for people who like storys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game. It’s so much fun to run around and discover things you can even tame some of the lizards, which is pretty cool. I would recommend this for people who love adventure, and sometimes like to battle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is really well made! It shows you what it's truly like to be an animal in an ecosystem. While there is a general tutorial where it holds your hand before throwing you into the real deal, you generally learn through either trial and error or the help of a friend or tutorial online. You learn what can do things, and what can't. How many hits it could take to kill one thing, if somethings safe. I recommend playing survivor or monk for your first playthrough, even though with the DLCS the general play type with each slugcat (or just hunter aka hard mode) changes. If you need any cheats, don't use them to skip forward to get more slugcats. It'll result in you dying too much because you never learned the general basics. Overall? In my opinion, a wonderfully crafted game! Everything feels natural to me. Apart from the occasional bug though, lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so frustrating at points, but its incredibly fun. It makes you feel like a part of the ecosystem, not just an outsider. The music is so atmospheric and the creatures have amazing a.i. Also scug go zoop. 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game constantly flip-flops between the best game of all time and the worst \r\nFUCK CYAN LIZARDS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing and overall one of the most fun games I have ever had ever. I had seen this game in passing around maybe when Markiplier had first played it which was around I think 2016-17. I'm not 100% sure but I got into this game, thanks to a friend who got me addicted to the world, lore and just the design of everything. I in turn got more of my friends into this game, 10/10 love the atmosphere, music and AI in game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games i ever played, is challenging and you learn by doing and observing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not for everyone, but if your a fan of rouguelikes or Dark souls 1 you might be able to get into it. I know my comparsion's to rouguelikes and DS1 are slightly schizophrenic for people that have already played reading this, forgive me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rain world is an amazing game, I have never played anything else quite like it. The story, art (pixelated or otherwise) and creatures, are beautiful. It is truly a game that immerses you into your role of a small animal at the whims of the world, and if you are resilient enough to search, you are rewarded with an interesting, unique story that is captivating.\r\n\r\n5 out of 5 pebbles. Would ascend again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "delicious game, theres a known fact in the rainworld community abt reviewers playing the game for 1 hour and writing multiparagraph bad reviews. yes, the game is horrifically punishing and difficult to play, but i swear if you beat your first campaign, the game will be easier and more fun to play afterwards. if you really need it, you can even look up a map of the region you're in to help you find where you want to go. great game if you give it the time of day it needs, favorite game of all time, 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "idgaf what anyone else thinks of this game it is CRACK to my brain this game has been my hyperfixation for almost 4 years now\n\nthis is the least i can say about. I've written essays praising this game, both the good and bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "buy it, and the downpour DLC with the rain meadow mod. It's worth it. Trust me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have initially heard about this game as being one of the niche, life changing, type of indie game.\nI can definitely say it is true now! XD\nThis game is hard, it's unforgiving, but at the same time, it's so beautiful. The community is such a big part, and the main reason I kept pushing and continued playing. All the amazing people I've met, all the animations, memes, and mods are so wonderful, and definitely make this game be one of a kind.\nIf you do wish to try Rain World, I'll tell you, you do need a lot of patience and determination, but if you choose to stay, it'll change your perspective forever, and personally, it will always remaind special in my heart.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So I 100% the base game of Rain-World, and I’ve yet to buy any DLC. I have a bit of a mixed review, so while I will recommend it, there are some issues that I think, if sorted out, could make it a really good game, but first the positives. The art style, the world, the music, and the playing of the game felt great, and all of the unique areas that you can go to are really awe-inspiring and just plain cool. I thought the story was really good too, though hampered by a few things that I will talk about in the negatives. I really like that sense that there’s no dialogue; it adds to that fear of being a small thing in a big world, and that really drew me in. The mods for this game were really cool! There was a nice mix of cosmetic and balancing changes that you could find, and overall the community seems pretty cool and helpful.\n\n     Now for the negatives. I feel like many people would disagree with this, but I find the (guide, the little yellow one) quite incompetent, and I think that was because of how his AI was set up. I typically would go around in circles in the first area, and he wouldn't lead me to the right areas or the path forward. It was also hard because he kept popping in and out of different areas before he would show me what he wanted me to do. Before I looked at the wiki and did a deep dive into everything about the game, I was very frustrated by this and confused about why he wouldn’t take me in the right direction. In fact, I had to go to the wiki to figure out where to go and how the karma system works so that I could progress the game. In this way, having no dialogue for the tutorial aside from what you need to survive hampered my gameplay, and for years kept me from playing this game. Eventually, though, I found the drive to finish it, and it was great, so this is what I would suggest to fix this problem.\n\n     While I think the Karma system is a good system that makes you have to survive for several days. I wasn't able to see all of the symbols for each Karma level, which meant that when I went to a door I wasn't sure at first if that meant it was Karma or if it was just some artistic decision. I think showing the player in the intro cutscene gaining Karma, or letting us see all of the Karma symbols when we die or sleep, would help to inform how the Gates work without saying anything. I also would like the guide to direct me in the correct direction (Sorry for being vague but I don't want to spoil where to go as that's part of the adventure). I know its AI keeps it from putting itself into danger, but that really causes me to get lost, so I think that maybe him showing you the direction to go toward the gates and then secondary resources like food would help. That way you could reach a door, realize you don't have the ‘key,’ and then progress your Karma tracker until you can open that door to progress. Aside from that, I'd like more of a reason to go to each of the zones during the main story instead of to a particular location high up and then a particular location low down. Like gaining items and bringing them somewhere, or changing the state of the world in some way, such as opening a dam to let water through into an area or something.”\n\n     Overall, I do recommend the game. I just think that with some small tweaks, you could still keep the difficulty this game is known for without losing the player along the way. Thank you, btw, V, for helping get me into the game again. I couldn't have done it without you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a hard game with a confusing story at first but later it starts to make sense and is very rewarding. also you get to play as a cute slug cat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I missed playing this game for so long, one of the best exploring/survival games I have ever played. The plot and the characters a.k.a slugcats are just cute and overpowered. I recommend this game heavy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game will forever hold a special place in my heart as one of my favorites; as a somewhat niche indie that I discovered and went through mostly blind, a proper experience of discovery, experimentation, and the marvelous cruelty of nature, it captivates me in a way very few others have. \r\nThe atmosphere alone is a key component to my enjoyment of it; the pixel graphics have such a natural element to them with how much is interactable in subtle ways and how all the creatures move based off of their AI. It all feels natural and ties together to simulate a proper ecosystem both in visuals, audio, and gameplay.\r\nOn topic of gameplay, while it is very freeform with minimal explanation, I find that to be a beautiful aspect of the game in its own right. It lets you draw your own conclusions and forces you to experiment with the mechanics, rewarding your natural curiosity if you're not afraid of failure. It can feel unfair (especially at first) because you're a small piece of a greater ecosystem, but you can even flip that dynamic on its head with enough caution, patience, and knowledge. Once you've accustomed yourself to the controls, the game is only as difficult as you make it for yourself.  The information is there for you, the solution is there for you.\r\nYou'll need to embrace a little bit of failure, but you'll eventually be met with success and progress on the journey.\r\nIt is up to you to adapt.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No amount of words written in a Steam review are ever going to do this fathomless masterpiece the justice it deserves, but I [i]can[/i] confidently say that this game and its DLCs have [i][b]the absolute best art direction of all time[/b][/i], without a [b]shred[/b] of doubt.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is challenging, but in a good way! there's no upgrades, just you and the ecosystem. you need to learn and get wiser at the game. this game is really fun and if i could play it for the first time again, i would :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very, VERY challenging game, but with a great story and it makes me keep coming back for more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great and unique game that will not hesitate to pull the rug from under you when you feel too confident. \nPerfect if you like a challenge that feels unfair 9/10 times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really hard campaign, but I play in modded arena mode. All around good game. WARNING : Train lizards can crash your game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game I've ever played! Great world, music, and creature behavior.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably my favorite game ever, so unique and it still doesn't feel like it gets boring or repetitive even after playing it for over 600 hours. Really can't put into words just how good it actually is, all I can say is you should play and see for yourself! :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of the best games I have ever played and even though you die a lot, you will want to come back and keep trying to survive and complete your journey.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very very tricky at first your gonna die and just roll with it but after you get the hang on this little slug creature who is mostly an idiot it has a very satisfying story and gameplay giving options to just explore and get lore or going straight to the directive (unless your hunter if your him screw it all and run)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's just something special about the way it feels to play this game. Slowly over time you learn more and more about the game, you get used to how the movement feels, and how the AI react.\r\n\r\nThe Hunter is my favorite of them all, the only things I worry about now are the creatures [i] designed [/i] to be feared. (and even then at least one can be beaten if you use your resources well enough)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my personal favorite indie game of all time. offers a very vast world filled with it's own ecosystem and food chain. felt very immersed in the world the entire time. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The overall game is very fun, and i would recommend getting the downpour expansion if you want more to do in game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything from the environments, enemy designs and story was absolutely amazing. Some unfortunate rng in gameplay sometimes, but nothing major. Has to be my favourite game ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Steep learning curve, but if you don't give up and take the time to actually play through it is extremely rewarding. also; DO NOT READ THE WIKI ON YOUR FIRST PLAYTHROUGH! it will ruin the experience of figuring things out and discovering new things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game if you like smashing your head against the desk after you die to rot for the 150th time :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the most beautiful game I have played thus far. How much I wish I could forget about it all and replay it! Its a must try really, even if a little hard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Struggles a bit as a video game, but as a concept; it's truly THE most elaborate and fascinating procedural ecological simulation conceived digitally. Most certainly worth a play simply for the experience alone, if you can get over the initial hurdles of the game's awkward controls and (intentional) unfairness. It's a beautiful game, visually and narrative-wise, and means a ton to me personally.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rain world is one of the best game I ever play. It is unfairly hard at the begining but its because you are a prey. When you understand how to avoid creature, the movement mechanic, and how enemies work its A LOT more fun.\nThe game is also beautiful, the story (despite being cryptic and sometime difficult to understand) is facinating.\nBut do not forget that its a very difficult game (and not made for the people that want to be the main character)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like the freedom this game makes me feel, even with the dlc content being more main character-esk storylines, this game just really is a freeing experience. And the amazing comunity surrounding it truly makes it a positive experience. :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game, a lot of cute little things. would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 the peakest game I have ever played\nIt's very good and incredibly impressive when you know how the game works and how to play it.\nWhen playing it for the first time, the experience is just incredible, unlike anything else.\nThe ecosystem simulation is really sick and the art is very good. All the animals ingame interact with each other - hunting, being preyed upon, fighting for territory and food. There's (almost) always a bigger fish.\nUnless you get severely stumped, don't spoil anything for yourself, the first time experience is the best gaming experience I have ever had. If you don't know what to do, just keep exploring until you make progress. If it feels too painful and slow, looking up a map is probably fine, but don't do that too much.\nKeep in mind that this game is not for the weak or lighthearted. The cute little wawa creature WILL die over and over again until you git gud (or get lucky) and progress.\nIf you, just like me, like small features, QoL fixes and modding in general, the game's workshop will make you happy. It's basically 100% integrated and requires little-to-no skill or modding knowledge to use. It's so peak.\n(By default the camera is static and kinda bad, but SBCameraScroll from the workshop fixes the issue completely!)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The atmosphere and story that is experienced in this game is incredible. Also its pretty tuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game, hard in the start but the longer you play the easier it gets, I personally recommend looking at others play a little to figure out some tricks, but a blind playthrough is totally possible, just take some time to practice a little in the starting area",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You'll never believe it...\nIT RAINS IN THIS WORLD\n\n\nOkay but on a serious note, this game is amazing. It looks amazing, the story is amazing, and it is super fun to explore and learn about the world while avoiding death. Also just look at these little scugcats!!!! You can't tell me you don't want to play this game after you see these silly little guys.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is genuinely one of the best games I've ever played.\r\n\r\nAmazing soundtrack, graphics, gameplay, etc. But the thing that mostly brings down the experience its the sheer difficulty of the game. This game is not for everybody, as its not something that you can just pick up and get good at it inmediately. You will die, and that is part of the way that the game makes you learn in order to progress through it. If you willingly have the patience and perseverance to play this game, then you will find an amazing, story-rich, gem of a videogame. Do not let the critics change your perspective on this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah its pretty good i think theres a lot of platforming and its kind of hard but its rewarding to learn i think",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was something special in my heart, I absolutely recommend this game if you want a relaxing experience and hate yourself at the same time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game on my own, was confused all the time. Got on the wiki, had the most fun following clear objectives (but sometime the wiki isnt that clear).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not for the faint of heart, but amazing game.\r\n(If my playtime is low, I got way more playtime on one of my friend's account)\r\n\r\nI've played countless hours already and there's still a lot of content to complete. All the ways from its simple look to its insane difficulty at some points, this game is worth playing if and only if you're ready for something hard as hell.\r\n\r\nTo everyone embarking on these journeys, Good Luck!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the amount of rain within this game is nowhere near the amount of tears that ive shed by playing it...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play this if you like feeling like a small helpless cat... tiny and insignificant in the big picture... a small drop in the passage of time (and or also like environmental storytelling and learning about the ruins of an ancient world) :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its decent, but its really good multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I actually played this on console before I finally got my hands on it for pc. Altogether plus console I'd have about 500 Hours. I'd say I can recommend it and that it is truly an experience to get lost in, if you wanna get lost and perish over and over again until you learn of the world and it's inhabitants and how to combat the horrors of the dilapidated world. But if you wanna get it for the title alone, can confirm it does in fact rain in this world. 10/10 Would get rained on again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favourite games OAT, and that will never change\n\nthe most visually stunning game i've ever seen, some of the best story i've experienced, and one of the most heartwrenching games i've ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a beautiful game. Such a lovely game. Such an intriguing game. Golly, this game is so mysterious, it makes me shivers me timbers. Such a profound message this game has. It makes me rub my belly and laugh like a king entertained by his jester and kick my feet like a high school girl thinking about her crush. I give this game a 1/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Do you hate yourself? Do you not value your own time? Do you suffer from depression? Then this is the game for you.\n\nSlugcat :p",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Come to Rain World, we've got: Slugcats. Cool lizards. Flower. Awesome tunes. Wait what is that. Inclement weather. Beautiful scenery. No seriously what is that. Uh oh. Horrific thing. Taxes. Parkour. Sadness. More awesome tunes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rain world is an EXTREMELY hard game to play for beginners but if you get good at it then it will become one of you favorite games ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The first ever slug type game.\n\nYou take the role of a stupid fucking idiot who is only able to eat sleep jump and throw things. Barely balacing on its tiny little legs having to survive the most brutal ecosystem ever, simulating how it's like to live in northern europe during winter.\n\nEach creature has its own routine, just like Skyrim.\n\nBut contrarily to Skyrim, everything wants to eat you. As soon as you get out of your shelter you are charged by 15 different lizards, creating a beatiful rainbow of pain and suffering. Only the smartest slugcat will survive. The smartest being the one who can do a 360 backflip over the lizards impaling them to death with a tetanus shot.\n\nControlling the slugcat really makes you feel like you have never hold a controller in your hands. Each action plays like a game of chess, but you are only controlling pawns and the opponent has 15 queens.\n\nThe most peculiar aspect of the game is the fact that the entire ecosystem is simulated. So, each time you spawn so all the others creatures do. Leading to funny situations where you never know what you're gonna find in the next room (usually lizards, sometimes vultures, mostly both).\n\nBut venturing through this dense and intricate ecosystem is really a once in a lifetime experience. The feelings you will get from Rain World's main campaign are truly unique and special. In a market where AAA studios only chase trends and add fucking genAI to their slop, seeing real artificial intelligence on par with beasts like F.E.A.R. and Alien Isolation is really refreshing. I highly recommend the base game!\n\nNow let's get to REAL DEAL.\n\nThe main dish, for the community, is Downpour. I disagree. Downpour is a nice addition you shouldn't take too seriously.\n\nIts core design idea completely contrasts with the main game's concept.\n\nNow slugcats can become AC130s, fart out spears, eat THE WORLD, and many other things that really makes them feel like they have superpowers. Which is fun, sometimes, but really should be treated as a fun bonus thingy in my opinion.\n\nI did have some fun with Downpour, but its absolutely all over the place balacing often undermined my experience, making way more evident how sometimes if you make it to the next shelter, it's just because you had RNG luck.\n\nfrom most fun to snoooore:\n\nArteficer\nRivulet\nSaint\nSpearmaster\nGourmand\n\nThe top and bottom positions are perfect examples of Downpour's issues:\n\nIn both campaigns you literally get fucked by enemies. They are really not sugarcoating it.\n\nWith the key difference being that in Arteficer's campaign, the campaign structure and level designs perfectly aids the main mechanics: the abilty to create explosives and double jumps.\n\nThe game constantly throws at you hordes of scavengers, whch, don't get me wrong, kill you many many many times. But each time you feel like it was your fault. Because you have all the tools to fight them, you just need to get good at using them.\n\nIn Spearmaster's campaign, you have the ability to infinitely generate spears and hold two at a time, but you can't eat. Instead, you have to stab enemies and suck the life out of them. The bigger the enemy the more food you get out of it.\n\nMain problem is, the entire campaign plays like a fetch quest. So you spend most of the time carrying something around. Removing one of the slots you would use for your second spear, making encounters a drag.\n\nIn this campaign, the design actively goes against the character's mechanics, and I think that's wasted potential.\n\nDoes this make it not worth playing? That's on you and how much you like to tryhard (I really like tryharding)\n\nIf you read all the way through here just buy the game already have fun cheers\n\nfuck gourmand fuck that piece of shit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. I would recommend it one hundred times over - its soundtrack, its art, its gameplay... I adore it. What I love most of all is its atmosphere. Rainworld pulls absolutely no punches, it is unfair, and it is hard - but it is winnable. The best part of the game is trying over and over to win and finally building the knowledge and skills you need to progress.\n\nThe creature design itself is delightful, the Iterators are intensely loveable despite their flawed personalities, and the critters are so memorable. I don't think theres a single creature in this game that isnt recognizable - them AND their movement.\n\nMy number one recommendation is that if you are someone who loses motivation upon losing over and over - play it with a friend! (Or don't be afraid to use some cheats if you are the type of person who doesn't mind that). Despite the games difficulty, there are options for managing struggle (I know I appreciated this as someone with a limited amount of time to play games). \n\n10/10 - One of my favorite games of all time. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite part of this game is where you bully the glorified pepto bismol colored calculator by saying wawa over and over",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is super fun but hard to learn perfect if u got lotsa time on your hands",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "this game is an interesting case. i love wandering and feeling like a Smol Fren in a Very Big World, and the challenge in the game is, at least most of the time, perfectly tuned. \r\n\r\nhowever, in a game so focused on exploration i never really feel... rewarded for exploring? like what do i get? food? i never feel like im making progress towards \"beating the game\" and it's just frustrating exploring around not finding anything but predators that kill me and food that sustains me. in my 15 hours i found nothing at all that indicated i was \"making progress\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is an interesting case. i love wandering and feeling like a Smol Fren in a Very Big World, and the challenge in the game is, at least most of the time, perfectly tuned. \r\n\r\nhowever, in a game so focused on exploration i never really feel... rewarded for exploring? like what do i get? food? i never feel like im making progress towards \"beating the game\" and it's just frustrating exploring around not finding anything but predators that kill me and food that sustains me. in my 15 hours i found nothing at all that indicated i was \"making progress\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game just isn’t for me, don’t have the patience, it feels very aimless, and I would like a more interactive combat system.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Really fun game but I just honestly have no clue what I'm supposed to be doing. Without given instructions and just aimless wandering and constant death it easily gets boring. A good challenge but if you want to just play a game its not that great.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can we all just agree that the watch DLC was the worst thing to happen to this game? Im so tired of just wanting to play with friends only for some bitchless ass update to ruin it all. each time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played just long enough to get the 'Cannot remap key controls or use mouse', and 'Game is immediately annoying' achievements, and then uninstalled.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm sorry, but I don't see hype or the \"overwhelmingly positive\" about this game. It's slow, sluggish and pretty boring. Probably the first \"overwhelmingly positive\" game I've ever bought and not liked. It as also pretty ugly, but that's just a personal taste thing I guess.\n\nThis game is on the opposite end of what I usually like in my side scrollers, which is speed, responsive controls, action and beautiful environments. This game has none of that. Not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Es un juego de mierda proquei qlos vibocs enegros de la eoscurida dme terminan matando todo el rato y me da bvrona porq rtietn necesito los bichos pperors ayuzles",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game thinks it needs to use my driving wheel for movement, which is insanely bad programming, but whatever.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Genuinely one of the worst games ever, I will beat Silksong without issue, all the Terraria mods in the world and all kinds of difficult games without difficulty but this game is so horrible like no other. The progression make me want to die because there isn't any, I have spent 6 hours in the industrial complex because every room I go into has 2 vultures, a white lizard and 2 green lizards. There is no progression so there is no good feeling after accomplishing anything because the only thing you do in this game is die. Call me terrible at video games all you want I don't care, this game is horrendous.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is bad \ndon't waste your money or time\nwith hard game like the souls games  you become stronger as you play the game\nin this game stronger you will always run from point A to point B \nthis game is zero fun to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rainworld is not a platformer nor a metroidvania nor well designed nor a game.\n\nImagine that you play as a weak critter in a living world.\nWhat I mean is that creatures are \"living\" and moving around. They do their thing, hunt and fight with each-other. Some are also stand immobile, mimicking something harmless like the pole you'd use to escape a monster chasing you.\n\nEvery single thing in that world wants you dead and will one-shot you.\n\nPredators are faster than you and can track you over several screens so don't be seen.\n\nOne big design problem is that, since they \"live\" they may appear right next to your spawn point, preventing you from moving at all.\nI've played a bit more than one hour and the last thirty minutes have been me waiting at the top of a pole for the room to clear.\nAnd what usually happens is that a monster that can climb the pole finally enters the room, get me and I have to try again: waiting for the room to clear, dying, and loop again.\n\nTo make things even worse, if by miracle the path clears, the rain may fall.\nLike the hanging sword of Damocles, that thing will come at the worst time and kill you.\nWhy? Because fuck you, that's why.\n\nThe application has one thing going for it: it's gorgeous.\n\nAnd it [i]is[/i] an application. It's not a game. At best it's a simulation of being a worthless chew-toy in a horrible world. A game don't pit you randomly in a no-win state and hope you'll stay along long enough to progress.\n\nIf your idea of fun is to wait for minutes at a time for the chance to move one screen and die again and again and again without making progress, this is a perfect fit.\n\nFuck that app.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whenever I log into Rain World all of my progress and all of my backups are gone and I don't know why.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of those games I try getting into every year, and just bounce off of it every time. I dont know what I'm doing and I dont know whats happening. Maybe one of these days I'll begin enjoying it suddenly but I am... not at that point yet.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too jank.\nBeautiful pixel work at times though",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "may the artist that worked on this be hired to work on a better damn game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Extremely boring. \nRain World 2/10\nHeisen",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "gourmand made me discover my obesity fetish :(",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "THE GAME SUCKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bugs just so much bugs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ruined my life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "😡",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't say the game lived up to all the hype they gave it on YouTube, although the graphics, animation, ecosystems, environment, and music are all amazing.  The problem I have with the game play.  It can be frustrating to play due to the ease at which the Slugcat can be killed, and the \"Karma system\" makes it all the worse.  Not to count that there are next to no in-game instructions, and the guide robot in the game is next to useless.\r\n\r\nThis game takes way too much patience for many people to master.  However, it does help if you start the game at \"Monk\" level difficulty (with the yellow colored Slugcat).  Note that you can learn how the game is played by looking through the guides that come on Steam associated with the game.  Make sure you read through them or the play will be way to hard!",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "honestly ? i really wanted to try it out because i've heard so many good things about it. i can agree that the art, music, and any of the artistic parts of the game, even in the limited parts ive seen, are very nice. however, even after going through reviews and basic guides for beginners, the overall consensus is \"the only way to get good or make any sort of progress is to sink even more hours into the game and not get demotivated by how unfair it is\" which. (in my opinion) is really annoying by design. its like being promised a dessert at the end of a path, but the path is made of hot coals and glass shards, and the only  thing people ever talk about is how good the dessert is, and not how the hell anybody's supposed to WANT it enough to go through the journey.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Rain World is gorgeous. Absolutely stunning. It plays smoothly, the unique art style really is something to gaze at, and it makes for an excellent backdrop to it's setting.\n\nHowever, this game hates you. You're trying to survive in a horribly hostile world where you're prey to everything except bugs (and sometimes even then, you never know). The game is very challenging. There's little incentive to explore the game save for \"find a better spot to harvest food\". Occasionally you'll come across something neat, like a gate that opens if you have hibernated enough times. Problem is, you'll likely die before you can get to the next shelter inside the new area, which then sets your 'symbol'(?) down a notch, forcing you to play another cycle in the boring old area you've already explored.\n\nThis game has what might very well be the absolute worst new player experience I've ever encountered. I went in blind, and after my two hours of repeated deaths, I know basically two things. 1), purple and red enemies are more dangerous than green ones, and 2) you don't know what an enemy is. I understand the \"die and try again\" mentality, however these deaths are not only very punishing to deal with (setting you back a symbol notch), but they also are extremely random. You'll die to something that looks like climbable object, something that looks like grass, a green lizard hidden in the smallest, most extraordinarily hidden cranny, a bug that you thought was friendly but decides to shove you to your death, a purple lizard that (with no warning and to your complete horror) can climb the same objects you could, etc. There is literally no warning, nay, no whisper of a hint that something will kill you. You die in one hit (two if you're extremely lucky), so there isn't even any reaction you can make except \"oh, that's another notch back.\". \n\nAlso, you're told nothing. The tutorial tells you that you need a certain amount of food points to sleep in a shelter, that you have limited time during a cycle, and the basic controls. That's it. Nothing else is told. There is no in game guide like Terraria, no journal like Minecraft, not even any written text on ANYTHING. You get radio silence on everything you find and you're expected to be content with being in the dark the whole game.\n\nThe unforgiving nature of the game, the complete lack of direction for the player, the utter confusion you'll feel playing this; it all lends itself to a pretty frustrating game experience. If you're looking for a game that forces you to have to figure it out at every step and punishes you for being new (and not telling you anything), Rain World will be a hit for you. If you want a relaxing game (in which this game presents itself as at first glance), you're in the wrong place. I'm certain this game is great, amazing even, in it's own niche community, I just couldn't bring myself to fight through the annoyance to find out if anything good is buried underneath.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i beat the entire game. the game sucks\nthe lore is great, the worldbuilding is great, the music and art are great\nthe gameplay however is straight ass from the beginning to the very end. it is tedious and heavily rng based. the movement also really does feel like youre controlling a marshmallow slug (in a bad way)\nif you are interested in this game, just watch a playthrough or lore summary on youtube. going through this slog of gameplay yourself is not worth the effort\n\nthe lore IS cool though",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Beautiful art drowned out by bad design decisions.\n\nIt's intentionally hostile to the player for lore and immersion reasons, but it has the exact opposite effect it's trying to achieve. Frustration is a huge immersion killer. So is having to get external help to progress. Having hours wasted being lost or repeating sections I've been through countless times isn't going to make me feel like an animal in the ecosystem. It's going to make me criticize why the developers would just allow the game to have such anti fun aspects. I just didn't care about the world or story if the journey to discover it felt like a chore.\n\nThe project lead was an artist, not a game designer. This shows for every aspect about the game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i respect this game, but it is straight up unenjoyable for me. sorry not sorry",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "this game is an interesting case. i love wandering and feeling like a Smol Fren in a Very Big World, and the challenge in the game is, at least most of the time, perfectly tuned. \r\n\r\nhowever, in a game so focused on exploration i never really feel... rewarded for exploring? like what do i get? food? i never feel like im making progress towards \"beating the game\" and it's just frustrating exploring around not finding anything but predators that kill me and food that sustains me. in my 15 hours i found nothing at all that indicated i was \"making progress\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game just isn’t for me, don’t have the patience, it feels very aimless, and I would like a more interactive combat system.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Really fun game but I just honestly have no clue what I'm supposed to be doing. Without given instructions and just aimless wandering and constant death it easily gets boring. A good challenge but if you want to just play a game its not that great.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can we all just agree that the watch DLC was the worst thing to happen to this game? Im so tired of just wanting to play with friends only for some bitchless ass update to ruin it all. each time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played just long enough to get the 'Cannot remap key controls or use mouse', and 'Game is immediately annoying' achievements, and then uninstalled.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm sorry, but I don't see hype or the \"overwhelmingly positive\" about this game. It's slow, sluggish and pretty boring. Probably the first \"overwhelmingly positive\" game I've ever bought and not liked. It as also pretty ugly, but that's just a personal taste thing I guess.\n\nThis game is on the opposite end of what I usually like in my side scrollers, which is speed, responsive controls, action and beautiful environments. This game has none of that. Not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Es un juego de mierda proquei qlos vibocs enegros de la eoscurida dme terminan matando todo el rato y me da bvrona porq rtietn necesito los bichos pperors ayuzles",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game thinks it needs to use my driving wheel for movement, which is insanely bad programming, but whatever.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Genuinely one of the worst games ever, I will beat Silksong without issue, all the Terraria mods in the world and all kinds of difficult games without difficulty but this game is so horrible like no other. The progression make me want to die because there isn't any, I have spent 6 hours in the industrial complex because every room I go into has 2 vultures, a white lizard and 2 green lizards. There is no progression so there is no good feeling after accomplishing anything because the only thing you do in this game is die. Call me terrible at video games all you want I don't care, this game is horrendous.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is bad \ndon't waste your money or time\nwith hard game like the souls games  you become stronger as you play the game\nin this game stronger you will always run from point A to point B \nthis game is zero fun to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rainworld is not a platformer nor a metroidvania nor well designed nor a game.\n\nImagine that you play as a weak critter in a living world.\nWhat I mean is that creatures are \"living\" and moving around. They do their thing, hunt and fight with each-other. Some are also stand immobile, mimicking something harmless like the pole you'd use to escape a monster chasing you.\n\nEvery single thing in that world wants you dead and will one-shot you.\n\nPredators are faster than you and can track you over several screens so don't be seen.\n\nOne big design problem is that, since they \"live\" they may appear right next to your spawn point, preventing you from moving at all.\nI've played a bit more than one hour and the last thirty minutes have been me waiting at the top of a pole for the room to clear.\nAnd what usually happens is that a monster that can climb the pole finally enters the room, get me and I have to try again: waiting for the room to clear, dying, and loop again.\n\nTo make things even worse, if by miracle the path clears, the rain may fall.\nLike the hanging sword of Damocles, that thing will come at the worst time and kill you.\nWhy? Because fuck you, that's why.\n\nThe application has one thing going for it: it's gorgeous.\n\nAnd it [i]is[/i] an application. It's not a game. At best it's a simulation of being a worthless chew-toy in a horrible world. A game don't pit you randomly in a no-win state and hope you'll stay along long enough to progress.\n\nIf your idea of fun is to wait for minutes at a time for the chance to move one screen and die again and again and again without making progress, this is a perfect fit.\n\nFuck that app.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whenever I log into Rain World all of my progress and all of my backups are gone and I don't know why.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of those games I try getting into every year, and just bounce off of it every time. I dont know what I'm doing and I dont know whats happening. Maybe one of these days I'll begin enjoying it suddenly but I am... not at that point yet.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too jank.\nBeautiful pixel work at times though",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "may the artist that worked on this be hired to work on a better damn game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Extremely boring. \nRain World 2/10\nHeisen",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "gourmand made me discover my obesity fetish :(",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "THE GAME SUCKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bugs just so much bugs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ruined my life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "😡",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't say the game lived up to all the hype they gave it on YouTube, although the graphics, animation, ecosystems, environment, and music are all amazing.  The problem I have with the game play.  It can be frustrating to play due to the ease at which the Slugcat can be killed, and the \"Karma system\" makes it all the worse.  Not to count that there are next to no in-game instructions, and the guide robot in the game is next to useless.\r\n\r\nThis game takes way too much patience for many people to master.  However, it does help if you start the game at \"Monk\" level difficulty (with the yellow colored Slugcat).  Note that you can learn how the game is played by looking through the guides that come on Steam associated with the game.  Make sure you read through them or the play will be way to hard!",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "honestly ? i really wanted to try it out because i've heard so many good things about it. i can agree that the art, music, and any of the artistic parts of the game, even in the limited parts ive seen, are very nice. however, even after going through reviews and basic guides for beginners, the overall consensus is \"the only way to get good or make any sort of progress is to sink even more hours into the game and not get demotivated by how unfair it is\" which. (in my opinion) is really annoying by design. its like being promised a dessert at the end of a path, but the path is made of hot coals and glass shards, and the only  thing people ever talk about is how good the dessert is, and not how the hell anybody's supposed to WANT it enough to go through the journey.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Rain World is gorgeous. Absolutely stunning. It plays smoothly, the unique art style really is something to gaze at, and it makes for an excellent backdrop to it's setting.\n\nHowever, this game hates you. You're trying to survive in a horribly hostile world where you're prey to everything except bugs (and sometimes even then, you never know). The game is very challenging. There's little incentive to explore the game save for \"find a better spot to harvest food\". Occasionally you'll come across something neat, like a gate that opens if you have hibernated enough times. Problem is, you'll likely die before you can get to the next shelter inside the new area, which then sets your 'symbol'(?) down a notch, forcing you to play another cycle in the boring old area you've already explored.\n\nThis game has what might very well be the absolute worst new player experience I've ever encountered. I went in blind, and after my two hours of repeated deaths, I know basically two things. 1), purple and red enemies are more dangerous than green ones, and 2) you don't know what an enemy is. I understand the \"die and try again\" mentality, however these deaths are not only very punishing to deal with (setting you back a symbol notch), but they also are extremely random. You'll die to something that looks like climbable object, something that looks like grass, a green lizard hidden in the smallest, most extraordinarily hidden cranny, a bug that you thought was friendly but decides to shove you to your death, a purple lizard that (with no warning and to your complete horror) can climb the same objects you could, etc. There is literally no warning, nay, no whisper of a hint that something will kill you. You die in one hit (two if you're extremely lucky), so there isn't even any reaction you can make except \"oh, that's another notch back.\". \n\nAlso, you're told nothing. The tutorial tells you that you need a certain amount of food points to sleep in a shelter, that you have limited time during a cycle, and the basic controls. That's it. Nothing else is told. There is no in game guide like Terraria, no journal like Minecraft, not even any written text on ANYTHING. You get radio silence on everything you find and you're expected to be content with being in the dark the whole game.\n\nThe unforgiving nature of the game, the complete lack of direction for the player, the utter confusion you'll feel playing this; it all lends itself to a pretty frustrating game experience. If you're looking for a game that forces you to have to figure it out at every step and punishes you for being new (and not telling you anything), Rain World will be a hit for you. If you want a relaxing game (in which this game presents itself as at first glance), you're in the wrong place. I'm certain this game is great, amazing even, in it's own niche community, I just couldn't bring myself to fight through the annoyance to find out if anything good is buried underneath.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i beat the entire game. the game sucks\nthe lore is great, the worldbuilding is great, the music and art are great\nthe gameplay however is straight ass from the beginning to the very end. it is tedious and heavily rng based. the movement also really does feel like youre controlling a marshmallow slug (in a bad way)\nif you are interested in this game, just watch a playthrough or lore summary on youtube. going through this slog of gameplay yourself is not worth the effort\n\nthe lore IS cool though",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Beautiful art drowned out by bad design decisions.\n\nIt's intentionally hostile to the player for lore and immersion reasons, but it has the exact opposite effect it's trying to achieve. Frustration is a huge immersion killer. So is having to get external help to progress. Having hours wasted being lost or repeating sections I've been through countless times isn't going to make me feel like an animal in the ecosystem. It's going to make me criticize why the developers would just allow the game to have such anti fun aspects. I just didn't care about the world or story if the journey to discover it felt like a chore.\n\nThe project lead was an artist, not a game designer. This shows for every aspect about the game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i respect this game, but it is straight up unenjoyable for me. sorry not sorry",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "this game is an interesting case. i love wandering and feeling like a Smol Fren in a Very Big World, and the challenge in the game is, at least most of the time, perfectly tuned. \r\n\r\nhowever, in a game so focused on exploration i never really feel... rewarded for exploring? like what do i get? food? i never feel like im making progress towards \"beating the game\" and it's just frustrating exploring around not finding anything but predators that kill me and food that sustains me. in my 15 hours i found nothing at all that indicated i was \"making progress\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game just isn’t for me, don’t have the patience, it feels very aimless, and I would like a more interactive combat system.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Really fun game but I just honestly have no clue what I'm supposed to be doing. Without given instructions and just aimless wandering and constant death it easily gets boring. A good challenge but if you want to just play a game its not that great.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can we all just agree that the watch DLC was the worst thing to happen to this game? Im so tired of just wanting to play with friends only for some bitchless ass update to ruin it all. each time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played just long enough to get the 'Cannot remap key controls or use mouse', and 'Game is immediately annoying' achievements, and then uninstalled.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm sorry, but I don't see hype or the \"overwhelmingly positive\" about this game. It's slow, sluggish and pretty boring. Probably the first \"overwhelmingly positive\" game I've ever bought and not liked. It as also pretty ugly, but that's just a personal taste thing I guess.\n\nThis game is on the opposite end of what I usually like in my side scrollers, which is speed, responsive controls, action and beautiful environments. This game has none of that. Not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Es un juego de mierda proquei qlos vibocs enegros de la eoscurida dme terminan matando todo el rato y me da bvrona porq rtietn necesito los bichos pperors ayuzles",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game thinks it needs to use my driving wheel for movement, which is insanely bad programming, but whatever.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Genuinely one of the worst games ever, I will beat Silksong without issue, all the Terraria mods in the world and all kinds of difficult games without difficulty but this game is so horrible like no other. The progression make me want to die because there isn't any, I have spent 6 hours in the industrial complex because every room I go into has 2 vultures, a white lizard and 2 green lizards. There is no progression so there is no good feeling after accomplishing anything because the only thing you do in this game is die. Call me terrible at video games all you want I don't care, this game is horrendous.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is bad \ndon't waste your money or time\nwith hard game like the souls games  you become stronger as you play the game\nin this game stronger you will always run from point A to point B \nthis game is zero fun to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rainworld is not a platformer nor a metroidvania nor well designed nor a game.\n\nImagine that you play as a weak critter in a living world.\nWhat I mean is that creatures are \"living\" and moving around. They do their thing, hunt and fight with each-other. Some are also stand immobile, mimicking something harmless like the pole you'd use to escape a monster chasing you.\n\nEvery single thing in that world wants you dead and will one-shot you.\n\nPredators are faster than you and can track you over several screens so don't be seen.\n\nOne big design problem is that, since they \"live\" they may appear right next to your spawn point, preventing you from moving at all.\nI've played a bit more than one hour and the last thirty minutes have been me waiting at the top of a pole for the room to clear.\nAnd what usually happens is that a monster that can climb the pole finally enters the room, get me and I have to try again: waiting for the room to clear, dying, and loop again.\n\nTo make things even worse, if by miracle the path clears, the rain may fall.\nLike the hanging sword of Damocles, that thing will come at the worst time and kill you.\nWhy? Because fuck you, that's why.\n\nThe application has one thing going for it: it's gorgeous.\n\nAnd it [i]is[/i] an application. It's not a game. At best it's a simulation of being a worthless chew-toy in a horrible world. A game don't pit you randomly in a no-win state and hope you'll stay along long enough to progress.\n\nIf your idea of fun is to wait for minutes at a time for the chance to move one screen and die again and again and again without making progress, this is a perfect fit.\n\nFuck that app.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whenever I log into Rain World all of my progress and all of my backups are gone and I don't know why.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of those games I try getting into every year, and just bounce off of it every time. I dont know what I'm doing and I dont know whats happening. Maybe one of these days I'll begin enjoying it suddenly but I am... not at that point yet.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too jank.\nBeautiful pixel work at times though",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "may the artist that worked on this be hired to work on a better damn game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Extremely boring. \nRain World 2/10\nHeisen",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "gourmand made me discover my obesity fetish :(",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "THE GAME SUCKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bugs just so much bugs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ruined my life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "😡",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't say the game lived up to all the hype they gave it on YouTube, although the graphics, animation, ecosystems, environment, and music are all amazing.  The problem I have with the game play.  It can be frustrating to play due to the ease at which the Slugcat can be killed, and the \"Karma system\" makes it all the worse.  Not to count that there are next to no in-game instructions, and the guide robot in the game is next to useless.\r\n\r\nThis game takes way too much patience for many people to master.  However, it does help if you start the game at \"Monk\" level difficulty (with the yellow colored Slugcat).  Note that you can learn how the game is played by looking through the guides that come on Steam associated with the game.  Make sure you read through them or the play will be way to hard!",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "honestly ? i really wanted to try it out because i've heard so many good things about it. i can agree that the art, music, and any of the artistic parts of the game, even in the limited parts ive seen, are very nice. however, even after going through reviews and basic guides for beginners, the overall consensus is \"the only way to get good or make any sort of progress is to sink even more hours into the game and not get demotivated by how unfair it is\" which. (in my opinion) is really annoying by design. its like being promised a dessert at the end of a path, but the path is made of hot coals and glass shards, and the only  thing people ever talk about is how good the dessert is, and not how the hell anybody's supposed to WANT it enough to go through the journey.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Rain World is gorgeous. Absolutely stunning. It plays smoothly, the unique art style really is something to gaze at, and it makes for an excellent backdrop to it's setting.\n\nHowever, this game hates you. You're trying to survive in a horribly hostile world where you're prey to everything except bugs (and sometimes even then, you never know). The game is very challenging. There's little incentive to explore the game save for \"find a better spot to harvest food\". Occasionally you'll come across something neat, like a gate that opens if you have hibernated enough times. Problem is, you'll likely die before you can get to the next shelter inside the new area, which then sets your 'symbol'(?) down a notch, forcing you to play another cycle in the boring old area you've already explored.\n\nThis game has what might very well be the absolute worst new player experience I've ever encountered. I went in blind, and after my two hours of repeated deaths, I know basically two things. 1), purple and red enemies are more dangerous than green ones, and 2) you don't know what an enemy is. I understand the \"die and try again\" mentality, however these deaths are not only very punishing to deal with (setting you back a symbol notch), but they also are extremely random. You'll die to something that looks like climbable object, something that looks like grass, a green lizard hidden in the smallest, most extraordinarily hidden cranny, a bug that you thought was friendly but decides to shove you to your death, a purple lizard that (with no warning and to your complete horror) can climb the same objects you could, etc. There is literally no warning, nay, no whisper of a hint that something will kill you. You die in one hit (two if you're extremely lucky), so there isn't even any reaction you can make except \"oh, that's another notch back.\". \n\nAlso, you're told nothing. The tutorial tells you that you need a certain amount of food points to sleep in a shelter, that you have limited time during a cycle, and the basic controls. That's it. Nothing else is told. There is no in game guide like Terraria, no journal like Minecraft, not even any written text on ANYTHING. You get radio silence on everything you find and you're expected to be content with being in the dark the whole game.\n\nThe unforgiving nature of the game, the complete lack of direction for the player, the utter confusion you'll feel playing this; it all lends itself to a pretty frustrating game experience. If you're looking for a game that forces you to have to figure it out at every step and punishes you for being new (and not telling you anything), Rain World will be a hit for you. If you want a relaxing game (in which this game presents itself as at first glance), you're in the wrong place. I'm certain this game is great, amazing even, in it's own niche community, I just couldn't bring myself to fight through the annoyance to find out if anything good is buried underneath.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i beat the entire game. the game sucks\nthe lore is great, the worldbuilding is great, the music and art are great\nthe gameplay however is straight ass from the beginning to the very end. it is tedious and heavily rng based. the movement also really does feel like youre controlling a marshmallow slug (in a bad way)\nif you are interested in this game, just watch a playthrough or lore summary on youtube. going through this slog of gameplay yourself is not worth the effort\n\nthe lore IS cool though",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Beautiful art drowned out by bad design decisions.\n\nIt's intentionally hostile to the player for lore and immersion reasons, but it has the exact opposite effect it's trying to achieve. Frustration is a huge immersion killer. So is having to get external help to progress. Having hours wasted being lost or repeating sections I've been through countless times isn't going to make me feel like an animal in the ecosystem. It's going to make me criticize why the developers would just allow the game to have such anti fun aspects. I just didn't care about the world or story if the journey to discover it felt like a chore.\n\nThe project lead was an artist, not a game designer. This shows for every aspect about the game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i respect this game, but it is straight up unenjoyable for me. sorry not sorry",
      "voted_up": false,
      "votes_helpful": 8
    }
  ]
}