{
  "positive": [
    {
      "review": "I have a lot of fun playing Warborrne. Small scalle and ZvZ can be very fun. Don't let these pay 2 win naysayers steer you away. We clap +12 +12 people easy on the regular, just have to find the right builds and team comps and you will win easy. Look at getting into an active warband to have fun with people. The game is definitely not geared towards solo play.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Оригинальная mmo, духовный продолжатель Albion Online с открытым PVP и крафтом. \r\nПорог вхождения невысок, для ветеранов MMO будет легко.\r\nДавно не видел что-то подобное.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I find some MOBA aspects in it, and the PVP oriented system looks very apealing to me and my friends!\r\nCurrently still in the early phase in terms of experience with the game but it offered me a nice starting experience.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Game was fun when I tried the second playtest.  Got me hooked right off the bat.  I suggest trying to find a good active warband (guild) and participating during wartimes.  Those huge 100 vs 100 battles are pretty intense and addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "People compare this game to Albion but THIS IS NOT Albion-like game!\n\n=== How it's different from Albion:\n- There is pretty much no way to become the harvester type player where you train your harvesting skills and then sell to other players what you collected. There's very few things to harvest and you can't sell most of it to other players like in Albion.\n\n- It's not really a sandbox MMORPG. You can't just be whoever you want and do whatever you want. All you can do here is to gear up (by PVE or Credit Card) and fight. All the rest has no point and is limited by the system.\n\n- It's purely focused on PVP and it's a strong Pay to Win game. Credit Card players can gear up within one day to the level you would have to farm for months, so keep in mind that you either gonna leave your paycheck here or become a little supportive character.\n\n- It's a game with seasons where most of your progress will be reset with each season start.\n\n- You can't immersly dive into the game for long hours, there's a lvl cap of the characters and gear that they unlock by 2 levels every day, so you can grind a bit and then you're locked.\n\n\n=== What's similar to Albion:\n- Graphics/camera view.\n\n- Some PVE instances (Underground similar to Mists) and game mechanics (each gear has it's own skills).\n\n- Not a game for solo players, Credit Card gankers everywhere.\n\n\n=== SUMMARY:\nThis is a very well technically made game, If you're a P2W player and love to play assasins to feel strong and important in this world by killing lowbies - it's a perfect game for you. It's really the assasins' heaven. Just roam around and kill lowbies with 3 hits and you're a pro and everybody admires you - GJ.\n\nHowever if you hope for merchanting/trading/harvesting and all that economy part then - no no.\nWant to play any non-meta builds? Also - nope.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Warborne is very stable and performs well. It can handle extremely large battles and small fights can be fun. There is tremendous variety in how you want to play and the game has a lot of future potential.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "600 hours in and all play tests game is basically open world league with 100s of people on a single map fighting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is sick. Fresh to the genre. Developers are total dum dums. It's like they are asking ChatGPT on how to do things. Management will kill the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "BEST UNIQUE and SOLID GAMEPLAY of any game in years!!!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun in the 1st 5 minutes already. Can't wait to see what it offers in the next 10000 hours!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"This game is shit and I don;t recommend it at ALL\"\n\n*sees at minimum 200 hours playtime*\n\nu sure about that?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great team game and or solo. A lot of content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Suprisingly addictive, and I dont even like these kind of games normally.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very fun and has a great progress system and war system, with only 48hours gameplay i got enough premium currency to buy a season pass as a free to play,  i admit a got bit lucky with my drops but even w/o it, is achivable just by playing, you do need to join an active Warband because war is very important and you will no get a good expirience w/o. Obviously, since it's a war game, being ganked while doing pve i'ts going to happen so if you can not handdle that better stay far away from this kind of games, i would say though, this game have much less toxicity in world chat compared to similar games if almost none at all. Lastly, i'm playing on the second strongest warband on the weakest faction and i'm still having a blast just because doing activities with your warbandmates is really rewarding not only because it raises the moral but because the actual rewards are great.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Games super fun but, I chose an NA server and its just filled with BR which ya they are NA but, there's literally not a single English speaking warband that is recruiting players that is doing endgame. \n\nWhile there is a translate button at the end of each message it's outright absurd for me to open chat and translate every single time. Why wouldn't it just auto translate?\n\nI've seen my fair share of QC and BR in games and it always comes with massive toxicity and negativity. \n\nI'll probably move on and find something else where I can at least communicate with players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of PvP very good MMO. it is not like Albion so punishing very satisfied with this game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fantasic game I'd recommend everyone to play!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's fine! It's rough if you're alone but it's fun with friends :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well made futuristic Albion like MMO...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is a prettty good game. fun, but basic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "finaly a mmorpg where pvp is the main focus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game - nonstop PVP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game on this month",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PVP wargame casual time",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "albion post apocalypse",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good enough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "enjoy the pvp",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "top",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "eh no thanks e-e",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Think DOTA mixed with Albion Online.\n\nOverall, it's a mid game but an interesting niche...moba combat on a mass faction warfare scale.\n\n\nPositives:\n\n+PvP is very accessible...Killed someone within 5 minutes of start.. after about an hour got into my first zerg.  Both scales were enjoyable. \n\n+Significantly less material grind than Albion Online. Re-gearing after death is very easy.\n\n+Netcode is good, feels very responsive even with hundreds of people on screen.\n\n+Giant robots and fun siege mechanics\n\n\nNegatives:\n\n-Looks like a mobile game\n\n-Plays like a mobile game\n\n-Monetised like a mobile game... Pay2win is present but not extreme, perhaps a 20% statistical bonus at most for whales vs a the average free players and it is largely unnoticeable in team fights where numbers of players matter more. Paid players have easier access to more characters too. You CAN sell ingame loot for cash-store currency.\n\nNote for Aus/NZ players: No servers for us, but it's playable with ~200 ping on the Asia server",
      "voted_up": true,
      "votes_helpful": 35
    },
    {
      "review": "Solid game despite the reviews, especially considering it's free. Big focus on large scale PvP and large communities working together, but small scale PvP is still prevalent. Not without its flaws, but overall pretty happy with it for an early access free to play game.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "68h in the playtests. Would have spent more if I didn't have to earn a living. Game is fun. 8/10. -2 for Monitization.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "This game is League of Legends meets Albion, Battlefield / Planetside. It's a faction vs faction (100v100 player wars) and guild (warband) oriented game so it's recommended you find a guild/warband to play with. Doing so helps you progress your characters (drifters) through group objectives and earning currency. If you prefer to play solo, you can still have your 'solo'-ish experience even in a warband by farming, ganking other factions, while still be able to partake in faction wars by being part of a guild. The game can definitely use more solo friendly things to do.\n\nOtherwise, besides a couple balancing changes, the game is flawless in terms of execution with hitbox registry and fairly optimized fps (120fps on a 2070), the weapon/armor systems, which are great since each piece has its own skill abilities which can be build defining to your character skills, and the ZvZ wars are just so so F'ing tight and requires extreme coordination.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Rule of thumb readers - when people are having fun, they dont usually run to write a review about it. I will disclose by saying I have been sponsored multiple times to play this game, but I and my community love it and played it through every iteration.\n\nThe game has plenty of issues, what game doesn't. It is p2w. It's a PvP focused MMO. But most importantly, its a lot of fun.\n\nThey added mechanics to gate the p2w and force people into grinding the world. I have been pleasantly surprised with most of their changes with release and my thoughts on the future of it doing well have increased substantially. \n\nEnd of the day, its Free, its PvP focused, and its just flat out more enjoyable than Albion if you don't enjoy Albion anymore. So give it a look, you may love it like we do.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Yes, it’s technically pay-to-win… but not in the soul-crushing, wallet-emptying, uninstall-after-5-minutes way. Everything is obtainable with time and effort, nothing feels locked behind a paywall.\n\nIf you’ve played Albion and want something similar but fresh, this is a solid alternative. There are tons of builds to mess around with, enough content to stay entertained without needing a wiki to survive, and ZvZ battles are surprisingly fun (and not just chaos with extra steps).\n\nFree-to-play is totally viable, you just won’t sit on the throne of the leaderboards, since whales can gear up instantly through the auction house. But the game even has a mode where everyone’s power is capped, so you can actually fight on equal footing. Big thumbs up for that.\n\nPremium currency? You can earn it in-game. Subscriptions and passes are also pretty easy to buy just by playing. With a good build and some skill, you can even solo a lot of group PvE stuff\n\nWould I like more capped-content modes? Absolutely. Do I think the pay-to-win matters much? Honestly, not really. With just two decent players you can take down a whale on the map. \n\nOverall: fun, grindy in a good way, and pay-to-win in the “meh, whatever” sense rather than the “why am I even here” sense.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "I have a lot of fun playing Warborrne. Small scalle and ZvZ can be very fun. Don't let these pay 2 win naysayers steer you away. We clap +12 +12 people easy on the regular, just have to find the right builds and team comps and you will win easy. Look at getting into an active warband to have fun with people. The game is definitely not geared towards solo play.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "There was a beta in may where i spent over 450 hours playing this game non-stop.\n\nMassive PVP, you can either chose to play during wartimes with your guild in 100 vs 100 battles, full of adrenaline, with multiple fights around the map, or play in small scale with different fights, gank players, do 15v15, 10v15, 20v30 or just keep gathering people around to fight in enemies territories.\n\nThe game has pve farm, but why would you farm chest while you can farm the people that are taking the chest.\n\nIt has a loot system where if you die, you lose part of your loot, which also feels rewarding when you kill a guy who didnt recall with his full badges.\n\nThere is also a crafting system, an upgrade system, and a tech system. So even if you join the game late, you'll be able to catch up people limited by server cap limit, which increases daily.\n\n\nAbout the people pay to win, it doesn't work like that. You can't upgrade your weapons or drifters to +3, +6, +9, +12 without a specific item that has a rare spawn and needs to be farmed. You can do some pay to fast, but nothing else. In big scale the upgrades doesn't make much difference.\n\nIt is a game worth trying, but always join the main server. Otherwise you will lose the fights and the main fun about the game, which is fighting other players and taking their loot.\n\nHave fun playing the game. See you in Starmarrow\n\nEdit: I bough the 50€ pack to support the game. Keep up the good work\n\nEdit 2: For some freebies use my invitation code 6pwx8t",
      "voted_up": true,
      "votes_helpful": 43
    },
    {
      "review": "The game is actually fun, I know some people are complaining about Pay to win aspect, which is present I guess, but is not that bad, is very similar to Albion but with better mechanics, so if you don't like farming for resources and PVP, maybe skip it but if you like Albion or PVP, give it a try, the game is also well optimized.\n\nUpdate; The more I play, the more I like this game and the less I understand the bad reviews, the game is far from perfect of course, there are some balance issues and other stuff that I think are addressed by devs, but still, the game is very fun, consider I'm playing in the weakest faction and Im still having a lot of fun. The problem is, this kind of games make people mad, and then they come and rage in here with a bad review, I get it, but if you want to win everytime and never die, never get destroyed, it's ok, just skip this kind of games, but if you can manage occasional bad times, you will have a lot of fun here. This game is way better than Albion in my humble opinion.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "The games pretty fun, there is time gating so you can't just wallet warrior to max level and gear on day one. Making a really good balance for free to play and pay to win. You can sell items on the auction house for the cash shop points allowing everyone to get what they need.\n\nI see mad skill issue among a lot of players that try this and start screaming hacks/cheater. This game does not hold your hand so soiboi gamers will be farmed 24/7. The game does help you catch up if you start late in the season but if your timing in skill use is trash you will lose 99% of encounters. The game runs pretty smooth during 100+ vs 100+ fights, haven't had any lag or crashes. There is a bit of a learning curve as there is a lot of information to take in and no wiki or guides just yet. So if you are a brain-dead follow the meta never think for yourself player you are SoL xD \n\nBest game to flex get good scrubs!",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "A bunch of bad reviews were written by idiots who couldn't read the news about the server opening time and couldn't log in. The game itself is excellent; we played four betas:\n- The game doesn't lag in large battles.\n- Dynamic combat system.\n- Lots of PvP content.\n\nAnd a lot of other really cool stuff, just try it!",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "SSS+ tier game that will get minimal exposure \nHard barrier to entry and minimal hand holding that requires you to read and critically think for yourself\nRelatively no guides available and the meta is developed internally by the top players\nRequires a general understanding of mmo/moba pvp and large scale teamfighting and zone control \nExtraordinarily fun when you are in a small hardcore guild with hands and able to farm groups double your size \nI doubt much will compare to the launch experience i've had with this game\nWill be really sad when its gone after a season or two, if it makes it that far\nBig ups to Singapore devs on this one",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Enjoyed it more than I thought I would. Day 1 thumbs up, but not sure how the rest of the game will be.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Оригинальная mmo, духовный продолжатель Albion Online с открытым PVP и крафтом. \r\nПорог вхождения невысок, для ветеранов MMO будет легко.\r\nДавно не видел что-то подобное.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I find some MOBA aspects in it, and the PVP oriented system looks very apealing to me and my friends!\r\nCurrently still in the early phase in terms of experience with the game but it offered me a nice starting experience.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is absolutely worth grinding, fighting, and even dying endlessly in ZvZ. The new season kicks off in about 9 days, so it’s the perfect time to jump in.\n\nWhy you should play \n\nBig open world, vast land, plenty of enemies.\n\nNo chat filter = real banter, real community.\n\nLose your gear when you die (risk makes it fun).\n\nMassive ZvZ battles – strategy, chaos, and hype.\n\nEvery faction brings its own style of warfare (some zerg harder than others 👀).\n\nI joined late last season, but things are looking solid for this one. If you’re looking for a group that doesn’t take itself too seriously but still brings the fight, come run with the Stags.\n\nSee you in the pit.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "It has potential - both good and bad. Good potential for big pvp fights with dozens of people doing Faction stuff, but bad potential for getting bored if there's no PvP going on and you're stuck wandering around for the different PvE locations to get relatively subpar loot.\r\n\r\nI'd say it gets a 6/10 from me for now. It's not great, but it's not bad either and has the potential to get better.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Game is great with friends, I wouldnt try to play Solo.  \n\nthere are some pay to win aspects, but Ive been keeping up by just spending my time efficiently.  \n\nThere is very little PVE to be excited about.  Most all of the stuff you do is either a group guild boss, or pvp in he open world.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "los eventos de inicio de temporada estan buenos y  nose cuanta plata se nesceita para poder jugar el endgame pero las remcompensas estas  bajas  loot",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Very fun game. If you hate P2W or any systems like it, probably isn't for you, though. I highly recommend at least trying the game, as even beyond the monetization, the game itself is actually very fun to play in large scale combat - which the game is based around.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Its a faction pvp focused fantasy mmo whit month long seasons\n\nSome ppl claim its 2pw but in game you dont realy feel the differences (though some stats are buyable its more a time saver (either farm or buy the stuff))\n\nIn total the game is nice if you enjoy pvp even as solo its playable",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "For all the people moaning there stuck on maintenance, when you log on there is an announcement window that explains when the servers in other regions unlock/open.\nYou can also click on the announcement Icon on the left side of the screen to get this info.\nI have been playing on the asia servers until EU open up. The game runs well and is nice to play, no issue's with crashes or anything so far!\n\nHere's the beta server schedule (all times in UTC 0):\nAsia: SEC APAC (Recommended: UTC+5 to UTC+10)\nServer 1: Wrath's Nest\nSever 2: Eclipsis\nServer 3: Blazion\nLaunch: September 19 02:00\n\nEurope: SEC EMEA (Recommended: UTC-1 to UTC+5)\nServer 1: Starmarrow\nSever 2: Silentium\nServer 3: Cindervale\nLaunch: September 19 09:00\n\nAmericas: SEC AMER (Recommended: UTC-10 to UTC-4)\nServer 1: Ashvara\nSever 2: Chronos Sca\nServer 3: Umbracore\nLaunch: September 19 15:00",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Has a good potential if devs listen to the community and don’t abandon it. There’s no pay to win , it’s optional like Albion’s subscription model.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Game was fun when I tried the second playtest.  Got me hooked right off the bat.  I suggest trying to find a good active warband (guild) and participating during wartimes.  Those huge 100 vs 100 battles are pretty intense and addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "People compare this game to Albion but THIS IS NOT Albion-like game!\n\n=== How it's different from Albion:\n- There is pretty much no way to become the harvester type player where you train your harvesting skills and then sell to other players what you collected. There's very few things to harvest and you can't sell most of it to other players like in Albion.\n\n- It's not really a sandbox MMORPG. You can't just be whoever you want and do whatever you want. All you can do here is to gear up (by PVE or Credit Card) and fight. All the rest has no point and is limited by the system.\n\n- It's purely focused on PVP and it's a strong Pay to Win game. Credit Card players can gear up within one day to the level you would have to farm for months, so keep in mind that you either gonna leave your paycheck here or become a little supportive character.\n\n- It's a game with seasons where most of your progress will be reset with each season start.\n\n- You can't immersly dive into the game for long hours, there's a lvl cap of the characters and gear that they unlock by 2 levels every day, so you can grind a bit and then you're locked.\n\n\n=== What's similar to Albion:\n- Graphics/camera view.\n\n- Some PVE instances (Underground similar to Mists) and game mechanics (each gear has it's own skills).\n\n- Not a game for solo players, Credit Card gankers everywhere.\n\n\n=== SUMMARY:\nThis is a very well technically made game, If you're a P2W player and love to play assasins to feel strong and important in this world by killing lowbies - it's a perfect game for you. It's really the assasins' heaven. Just roam around and kill lowbies with 3 hits and you're a pro and everybody admires you - GJ.\n\nHowever if you hope for merchanting/trading/harvesting and all that economy part then - no no.\nWant to play any non-meta builds? Also - nope.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Warborne is very stable and performs well. It can handle extremely large battles and small fights can be fun. There is tremendous variety in how you want to play and the game has a lot of future potential.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "600 hours in and all play tests game is basically open world league with 100s of people on a single map fighting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is sick. Fresh to the genre. Developers are total dum dums. It's like they are asking ChatGPT on how to do things. Management will kill the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "BEST UNIQUE and SOLID GAMEPLAY of any game in years!!!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun in the 1st 5 minutes already. Can't wait to see what it offers in the next 10000 hours!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"This game is shit and I don;t recommend it at ALL\"\n\n*sees at minimum 200 hours playtime*\n\nu sure about that?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great team game and or solo. A lot of content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Suprisingly addictive, and I dont even like these kind of games normally.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very fun and has a great progress system and war system, with only 48hours gameplay i got enough premium currency to buy a season pass as a free to play,  i admit a got bit lucky with my drops but even w/o it, is achivable just by playing, you do need to join an active Warband because war is very important and you will no get a good expirience w/o. Obviously, since it's a war game, being ganked while doing pve i'ts going to happen so if you can not handdle that better stay far away from this kind of games, i would say though, this game have much less toxicity in world chat compared to similar games if almost none at all. Lastly, i'm playing on the second strongest warband on the weakest faction and i'm still having a blast just because doing activities with your warbandmates is really rewarding not only because it raises the moral but because the actual rewards are great.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Games super fun but, I chose an NA server and its just filled with BR which ya they are NA but, there's literally not a single English speaking warband that is recruiting players that is doing endgame. \n\nWhile there is a translate button at the end of each message it's outright absurd for me to open chat and translate every single time. Why wouldn't it just auto translate?\n\nI've seen my fair share of QC and BR in games and it always comes with massive toxicity and negativity. \n\nI'll probably move on and find something else where I can at least communicate with players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of PvP very good MMO. it is not like Albion so punishing very satisfied with this game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fantasic game I'd recommend everyone to play!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's fine! It's rough if you're alone but it's fun with friends :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well made futuristic Albion like MMO...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is a prettty good game. fun, but basic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "finaly a mmorpg where pvp is the main focus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game - nonstop PVP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game on this month",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PVP wargame casual time",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "albion post apocalypse",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good enough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "enjoy the pvp",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "top",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "eh no thanks e-e",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Think DOTA mixed with Albion Online.\n\nOverall, it's a mid game but an interesting niche...moba combat on a mass faction warfare scale.\n\n\nPositives:\n\n+PvP is very accessible...Killed someone within 5 minutes of start.. after about an hour got into my first zerg.  Both scales were enjoyable. \n\n+Significantly less material grind than Albion Online. Re-gearing after death is very easy.\n\n+Netcode is good, feels very responsive even with hundreds of people on screen.\n\n+Giant robots and fun siege mechanics\n\n\nNegatives:\n\n-Looks like a mobile game\n\n-Plays like a mobile game\n\n-Monetised like a mobile game... Pay2win is present but not extreme, perhaps a 20% statistical bonus at most for whales vs a the average free players and it is largely unnoticeable in team fights where numbers of players matter more. Paid players have easier access to more characters too. You CAN sell ingame loot for cash-store currency.\n\nNote for Aus/NZ players: No servers for us, but it's playable with ~200 ping on the Asia server",
      "voted_up": true,
      "votes_helpful": 35
    },
    {
      "review": "Solid game despite the reviews, especially considering it's free. Big focus on large scale PvP and large communities working together, but small scale PvP is still prevalent. Not without its flaws, but overall pretty happy with it for an early access free to play game.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "68h in the playtests. Would have spent more if I didn't have to earn a living. Game is fun. 8/10. -2 for Monitization.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "This game is League of Legends meets Albion, Battlefield / Planetside. It's a faction vs faction (100v100 player wars) and guild (warband) oriented game so it's recommended you find a guild/warband to play with. Doing so helps you progress your characters (drifters) through group objectives and earning currency. If you prefer to play solo, you can still have your 'solo'-ish experience even in a warband by farming, ganking other factions, while still be able to partake in faction wars by being part of a guild. The game can definitely use more solo friendly things to do.\n\nOtherwise, besides a couple balancing changes, the game is flawless in terms of execution with hitbox registry and fairly optimized fps (120fps on a 2070), the weapon/armor systems, which are great since each piece has its own skill abilities which can be build defining to your character skills, and the ZvZ wars are just so so F'ing tight and requires extreme coordination.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Rule of thumb readers - when people are having fun, they dont usually run to write a review about it. I will disclose by saying I have been sponsored multiple times to play this game, but I and my community love it and played it through every iteration.\n\nThe game has plenty of issues, what game doesn't. It is p2w. It's a PvP focused MMO. But most importantly, its a lot of fun.\n\nThey added mechanics to gate the p2w and force people into grinding the world. I have been pleasantly surprised with most of their changes with release and my thoughts on the future of it doing well have increased substantially. \n\nEnd of the day, its Free, its PvP focused, and its just flat out more enjoyable than Albion if you don't enjoy Albion anymore. So give it a look, you may love it like we do.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Yes, it’s technically pay-to-win… but not in the soul-crushing, wallet-emptying, uninstall-after-5-minutes way. Everything is obtainable with time and effort, nothing feels locked behind a paywall.\n\nIf you’ve played Albion and want something similar but fresh, this is a solid alternative. There are tons of builds to mess around with, enough content to stay entertained without needing a wiki to survive, and ZvZ battles are surprisingly fun (and not just chaos with extra steps).\n\nFree-to-play is totally viable, you just won’t sit on the throne of the leaderboards, since whales can gear up instantly through the auction house. But the game even has a mode where everyone’s power is capped, so you can actually fight on equal footing. Big thumbs up for that.\n\nPremium currency? You can earn it in-game. Subscriptions and passes are also pretty easy to buy just by playing. With a good build and some skill, you can even solo a lot of group PvE stuff\n\nWould I like more capped-content modes? Absolutely. Do I think the pay-to-win matters much? Honestly, not really. With just two decent players you can take down a whale on the map. \n\nOverall: fun, grindy in a good way, and pay-to-win in the “meh, whatever” sense rather than the “why am I even here” sense.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "I have a lot of fun playing Warborrne. Small scalle and ZvZ can be very fun. Don't let these pay 2 win naysayers steer you away. We clap +12 +12 people easy on the regular, just have to find the right builds and team comps and you will win easy. Look at getting into an active warband to have fun with people. The game is definitely not geared towards solo play.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "There was a beta in may where i spent over 450 hours playing this game non-stop.\n\nMassive PVP, you can either chose to play during wartimes with your guild in 100 vs 100 battles, full of adrenaline, with multiple fights around the map, or play in small scale with different fights, gank players, do 15v15, 10v15, 20v30 or just keep gathering people around to fight in enemies territories.\n\nThe game has pve farm, but why would you farm chest while you can farm the people that are taking the chest.\n\nIt has a loot system where if you die, you lose part of your loot, which also feels rewarding when you kill a guy who didnt recall with his full badges.\n\nThere is also a crafting system, an upgrade system, and a tech system. So even if you join the game late, you'll be able to catch up people limited by server cap limit, which increases daily.\n\n\nAbout the people pay to win, it doesn't work like that. You can't upgrade your weapons or drifters to +3, +6, +9, +12 without a specific item that has a rare spawn and needs to be farmed. You can do some pay to fast, but nothing else. In big scale the upgrades doesn't make much difference.\n\nIt is a game worth trying, but always join the main server. Otherwise you will lose the fights and the main fun about the game, which is fighting other players and taking their loot.\n\nHave fun playing the game. See you in Starmarrow\n\nEdit: I bough the 50€ pack to support the game. Keep up the good work\n\nEdit 2: For some freebies use my invitation code 6pwx8t",
      "voted_up": true,
      "votes_helpful": 43
    },
    {
      "review": "The game is actually fun, I know some people are complaining about Pay to win aspect, which is present I guess, but is not that bad, is very similar to Albion but with better mechanics, so if you don't like farming for resources and PVP, maybe skip it but if you like Albion or PVP, give it a try, the game is also well optimized.\n\nUpdate; The more I play, the more I like this game and the less I understand the bad reviews, the game is far from perfect of course, there are some balance issues and other stuff that I think are addressed by devs, but still, the game is very fun, consider I'm playing in the weakest faction and Im still having a lot of fun. The problem is, this kind of games make people mad, and then they come and rage in here with a bad review, I get it, but if you want to win everytime and never die, never get destroyed, it's ok, just skip this kind of games, but if you can manage occasional bad times, you will have a lot of fun here. This game is way better than Albion in my humble opinion.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "The games pretty fun, there is time gating so you can't just wallet warrior to max level and gear on day one. Making a really good balance for free to play and pay to win. You can sell items on the auction house for the cash shop points allowing everyone to get what they need.\n\nI see mad skill issue among a lot of players that try this and start screaming hacks/cheater. This game does not hold your hand so soiboi gamers will be farmed 24/7. The game does help you catch up if you start late in the season but if your timing in skill use is trash you will lose 99% of encounters. The game runs pretty smooth during 100+ vs 100+ fights, haven't had any lag or crashes. There is a bit of a learning curve as there is a lot of information to take in and no wiki or guides just yet. So if you are a brain-dead follow the meta never think for yourself player you are SoL xD \n\nBest game to flex get good scrubs!",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "A bunch of bad reviews were written by idiots who couldn't read the news about the server opening time and couldn't log in. The game itself is excellent; we played four betas:\n- The game doesn't lag in large battles.\n- Dynamic combat system.\n- Lots of PvP content.\n\nAnd a lot of other really cool stuff, just try it!",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "SSS+ tier game that will get minimal exposure \nHard barrier to entry and minimal hand holding that requires you to read and critically think for yourself\nRelatively no guides available and the meta is developed internally by the top players\nRequires a general understanding of mmo/moba pvp and large scale teamfighting and zone control \nExtraordinarily fun when you are in a small hardcore guild with hands and able to farm groups double your size \nI doubt much will compare to the launch experience i've had with this game\nWill be really sad when its gone after a season or two, if it makes it that far\nBig ups to Singapore devs on this one",
      "voted_up": true,
      "votes_helpful": 14
    }
  ],
  "negative": [
    {
      "review": "its an albion online clone, but worse, because there are even more factions to splinter the playerbase and the playerbase is full of Timmy's that flock to the faction with the most people, and the game is trash without balanced world pvp, and you're either on the side that snowballs everyone else (which is not competitive, therefore not fun), or you're on the side getting trainwrecked by the faction that vastly outnumbers you, which is probably also not fun. The way the game is made, there is not much that can be done about it either, so its basically shit.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "extremely unbalanced. halfway in the game, everyone will just switch to the faction that is winning, and that winning faction get even more unbalanced. Other faction player will just abandon the game or stop playing entirely, resulting in a faction population ratio of 10:2:2:2:2. \n\nto make matter worst, with the over powered faction getting high player population, all the high level map is controlled by the winning faction. there is literally nothing to play if you are not in the winning faction.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "1. Season 1.0 Rewards Feel Undervalued\nSupporting your game and winning during the Season 1.0 where everything is raw and confusing felt like a joke because the reward system offers nothing exclusive or meaning. It also shows that devs lacks care for player efforts. I personally felt that my title is a joke with the rewards they made. \n\n2. Persistent Bugs With No Clear Fix Timeline\nThe development team is still struggling to resolve long-standing bugs, exploits, bots, multiboxers and players feel there’s no visible progress or communication. Reporting alone is a struggle where you cannot have a formal platform with ticket number and timeline to resolve issue. This creates frustration, especially when the same issues affect gameplay every day.\n\n3. Time-Consuming Map Travel\nMoving from one map to another takes around 2 minutes, which slows down gameplay, especially for players involved in large-scale fights or map-to-map content. It breaks momentum and reduces overall enjoyment.\n\n4. No Proper Platform for Raising Issues\nThere’s no official place to properly report problems, ask questions, or escalate concerns. Players end up feeling ignored or forced to rely on unofficial channels. All they do is have it posted on the discord channel where no reference and timeline how long will it take to investigate or take a look into an issue. \n\nReporting players in game, does not even get a confirmation or a reference number that it will be taken a look into. \n\nResponse time of community leads takes 2 to 5 days. Personally, communication from the dev team is too vague and slow. Updates feel unclear, and players are often left guessing about how certain mechanics actually work. \n\nLack of community management, this also needs a lot of improvement. No consistent presence, no clear announcements, and no transparency about problems or decisions. \n\n5. Poor English Translation and Communication \nPersonally, I don't feel the game is friendly for English Speaking Players. Translations are confusing, inconsistent and sometimes does not match the developer's real intention. Update Notes often cause confusion and misunderstanding because of the unclear wording. \n\n6. Poor In-Game Rewards \nPurchasing subscription is not rewarding, even the Battle Pass and Daily Login Rewards are things you won't even use on the 2nd and 3rd Month because its very common you will definitely get more playing everyday. Progression is not rewarding in this game, and the effort-to-reward ratio is really low for the time invested. \n\nOverall, from my experience, the game still needs a lot of optimization. There are constant FPS Drops during large scale fights, multiple game freezes at the worst possible moments specially when clashing making you disconnect. \n\nClass balance is not consistent, some classes feel over-tuned while others barely feel relevant, this also applies to the equipment and potions. \n\nContent becomes repetitive after a while, loop feels the same and not much variety to keep long term players excited.  Events feels underdeveloped, not even an exciting reward for people to look after. Halloween Event, absolutely a failure. No initiative to keep the players engaged.\n\nUI still feels outdated and clunky. Important information isn't shown clearly, and some features requires too much clicks to access and its buggy. Some important details are covered and can barely see and no option to customize it. \n\nServer Stability is very unreliable, it crashes and consumes too much memory that it needs to be restarted every now and then. Specially during the peak hours. \n\nDevs are interviewing people who long left the game, rather than communicating to players actively on what can make them keep playing the game. When the people who knows the current issues are the ones that kept playing. \n\nI feel like the game has a lot of potential, but the current directions makes it seem like the devs are overwhelmed or unsure how to move forward on this game. \n\nI can go on and on about this, will update my review when I see things improve.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game was decent but with every addition the game gets more bugs and when you try to report them with proof you get told hey thanks for informing us and we're sorry but screw off. This game is also very time sensitive in the beginning, so assume a bug cost you 15 hours of time, you are now behind the power curve and will be repeatedly attack for having lower level of gear, also when you are able to upgrade, all weapons and armor are now x30 more in cost and again that's only for small delays. Now imagine running into multiple bugs that delay you longer, you are effectively out of the season.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Toxic sludge of a game.\n\nGameplay: Was alright, and reminded me of Albion Online but future with how your equipment gave abilities. Camera position was a little to close, as a few skills went off screen and triggered more fighting (You can change it to let mouse expand sight in a direction). You pick a champion (many reference League of Legends), with 1 active and 1 passive. You need to go to high level zones to get resources and death costs are by design expensive. PvE losses can take anywhere from 15 minutes of work to an hour to fund the repair cost. PvP focus, and if you lose to a player you drop half your inventory and 25% of your in-use equipment + same repair cost as PvE.\n\nSocial: a LOT of trolling was done in chat. the chat also by default had 2 total slots, and besides chat had recaps of any PvP events going on and a loot log.\n\nMonetary: Loot Boxes were created to exploit gambling addiction. I do not like to play any game that promotes them. I spent $100 for a mount, only to realize the name of the loot box was the exact same as the mount. what did the expensive loot box have? I don't know, I stopped caring.\n\nSummery: game was good but punishing, and I cannot in sound mind ever play this game again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was beatifule game, but then P2W come and scewed everyone, they dont wona put new fresh server (so you can escape p2w)\nLove the game, imposible to play",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bug/Exploit Reporting is biased for Dev Responses.\n\nEnjoyment for game play is primarily focused towards people who modify their game to track player movement (to see through stealth) and intentional exploitation of mechanics. These have been reported to the development team along with chat logs of admission by players who exploit the system, but no response or punishment. Instead, they focus on people who are using a macro or an \"auto-click\" to play over actual cheaters.\n\nI suppose it's fun to PvE and ZvZ, but advantage goes to those who effectively cheat with no repercussions.\n\nUpdate 11/29\nSeason 2.2: Game is still buggy, with Devs claiming they know about issues though there's no formal post about it in Discord; just another way to not pay out for reporting issues.\n\nFurthermore, Drifter and equipment balancing issues being the primary concern. Warbands literally use  2-3 builds and that's it. For a bunch of Diversity, they've absolutely flopped by making other builds useless.  \n\nFinally, Faction Balancing issues are still trash. Not only do they allow voting for the timer to be single-sided by the faction with more players dictate what time wars will be. You also have 100 v 100 groups, where the enemy has double or triple numbers waiting on the back line to jump right in. Doesn't make sense to allow for a faction to have 300 v 100 without forcing balances.\n\nIMO, this is just another cash grab game and will more than likely die out by the next season.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game could be great but there are so many gaps in the overall design. Everything seems like it was made for a short term cash grab. Stay away, unless big changes happen for 2.2.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Faction swapping mid game honestly ruins the game as it is currently.  That and it's sold as a faction based game but rewards are all guild based.  Maybe one day someone will create a full/partial loot pvp game that does it right.  Hopefully I can revisit and update this review after some good patches.  I think they have already missed the mark at this point though as most of the playbase has given up hope.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was bad at the beginning and is worse now.\r\nI could type all the things that I see as bad features but just notice that I would be describing almost the entire game. So I'll instead say this: Try it out and if you feel like something is stopping you from having fun, know that there definitely is because the game was made to feel this way. So don't feel bad/uncertain about uninstalling.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has weapon balancing issues. Severe Pay to Win issues. Hardly any GOOD online guides to better learn the game. So very little in fact not even Grok can provide reliable information. \r\n\r\nBows have extremely short range paired with how atrouciously close the camera is zoomed into your player character you end up getting dived by another player  from the edge of your screen and die in 2 hits. \r\n\r\nSad because the games design is one of a kind. I just dont think large scale battles can ever be good in this format.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has some interesting things, but loads of problems as well.\n\nThe good:\n+ playing with friends can be cool, I came from a discord community from other games, we often had like 20 people on discord and it was a lot of fun;\n\n\nThe bad:\n- the community is generally a total cesspool of human filth. I have played on and off for 3 seasons and there hasn't been a season WITHOUT some kind of drama that ends up with endless insults, people make alts just to come and fuck with you, abandoning their faction etc.. Be ready to be called all your favourite homosexual, mentally challenged slurs daily;\n- the game overall is a total p2w game. You can see a lot of credit card warriors who was way beyond others.\n- the game has a totally weird setting - from one point the game world is that you travel to different worlds (game servers) and you descend from the space station to fight over territories. Sounds pretty futuristic, but then the actual game play is a total mix from all over from your classic fantasy rpg stuff (melee, magic and spells, bows and arrows) mixed in with guns, robots, artillery, turrets and what not. Makes no sense.\n- the game mechanics of having daily wars (wars are needed for conquering territories) set at specific times can be pretty tricky. If you don't have time to login daily, you get left behind and you are not very useful for the group. Not the game for casual playing once or twice per week. The devs changing up war times regularly doesn't help either.\n- the pve part gets pretty meh in this game and the pvp mechanics are also pretty basic (tanks and initiators stunning and group enemy players together, and aoe damage dealers kill the blob).\n- the UI is a total mess. You have like 5 different missions scattered all over on 5 different places, you just mash buttons to find all of them.\n- way too many types of ingame currencies (both free and premium with IRL money).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Started with new season but after 40 hrs i didn't like it enough.\nInteresting concept and decent potential but it's not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I honestly cannot recommend this game. No, seriously... I can't. The level of frustration of being the guy on the receiving end of pummeling after pummeling after pummeling is so outrageous, that the thought of balance does not occur in-game nor in the development studio. Like countless other games, I find myself faced with the all-too-common dilemma of either \"playing the meta\" or simply uninstalling the game. When game devs are ready to actually make a game that has ZERO meta to it, I'll be ready to try it out. Until then, this is just another sad excuse of a game meant for people who have no creativity whatsoever. If other people enjoy games like this, fine. But I, in good faith-conscience, cannot say that I enjoy being the guy who gets stuck at a heavy disadvantage constantly for not playing the game a very specific way, as decided upon by the development team. Whatever happened to videogames that were enjoyable; actually, sincerely, truly, genuinely enjoyable? It seems like everything, not just videogames, are turning into money grabs more than anything, thus the quality and shelf life of a game has drastically diminished. It's a tragedy. Play at your own risk, but don't be surprised and don't say I didn't warn you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "garbage game you lose everything you grind for at the end of the season and the prices of the weapons can be extremely expensive and more if they are popular, shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Super game, really a lot of fun — when the developers don’t completely mess up the faction game with too many servers and stuff. Most of the time we didn’t even have enough players to stand a chance against one of the factions. In the end it was kind of okay, but since the green faction couldn’t handle their ego when we finally managed to pull together as a faction, they had to make alts and use another faction to steal a building zone from us.\n\nGreat game concept, but at the end of the season you make a second character and boom, it’s instantly level 42 — and because of that crap you lose your rank 2 spot since you drop from 1600 points, not expecting that in a 100% dead guild there’d still be people showing up...\n\nOtherwise, Season 1 was okay. Season 2 was complete garbage. If you’re thinking of playing it, don’t spend any money on it — the game probably won’t last more than 1–3 more seasons anyway, it’s slowly dying out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun fights but the negatives are pretty extreme.\n\ntoo big of a map for the small population\nbalance for most weapons is bad - healer builds do more damage than most melee builds\nNAP fest so the wars become extremely one sided every season\nThe new underground area they added was a massive mistake\n\ncan't recommend unless you like these kinds of games and know what you're getting into.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Would love to leave a positive review, because I honestly enjoy the game and it's easier to get into than Albion which I enjoyed. However, the lazy design, P2W, Faction Stacking just makes the game boring after the first week of a season. The servers just become a Faction Swap with hand-holding between the top 2-3 Factions and the rest become fodder. The game needs to go down to 3 Factions and prevent Swaps so there is actual ZvZ going on and not 200+ vs 30-50. \n\nIf you enjoy these styles of game I'd loop back around in 6 months and see what updates have landed before taking a swing at this. Albion for all it flaws has way more going for it still sadly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pros: Some QoL systems over Albion Online\ncons: P2W as fk, 1000 menus and menu notifications, 50 different currencies etc etc",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Donating isn't particularly important; there's no real P2W in the game. Yes, donating allows you to be above average players, but you can't buy arms with it.\nThe developers simplified gear drops as much as possible in Season 2, aiming to emphasize small scales, but in doing so, they completely destroyed the game's core value: mass battles are extremely taxing on your wallet, and it's practically impossible to make money from capturing hubs, regardless of your role: healer, damage dealer, or tank.\nThe only thing that will save the game in Season 3 is the return of the old item drop model, so that mass battles become the game's main feature once again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One thing is obvious within 5 min from starting the game - it's a mobile style PayToWin :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is dying because of all the problems and wrong decisions.\n- you take a lot of time running from a map to another, there is no teleport. This just makes you do not want to move to another map sometimes. Also all mobs are aggresive slowing you down even more. SLOW IT NOT FUN.\n- too little content, if you want to farm money there is only two options: scrap posts and rifts. Both have cooldowns, you need to be lucky and find one that is ready for you to loot.\n- queues on maps, you want to participate the wartime? Too bad. You will lose half of the fun waiting in a queue to join the map, and some times you will be removed from the map for someone else to take place. NOT FUN.\n- TIME GATE EVERYWHERE. Every season starts with a time gate, you can just level up until lvl 22, the next day only to lvl 25 etc. And there is almost no reason to play the game until it removes the time gate!\n- sometimes you feel there is no balance between weapons and drifters, and there is also the p2w.\n- killing mobs in the map gives you NOTHING. Why they even exist in the map then?\n- drop rates sucks. They're not even shown in the game.\n- game heavily requires you to play in groups and THERE IS NO PARTY MATCHING.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a game with a 24 hour downtime for a patch and new season!!! 24 hour downtime that's unacceptable by any standard",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "p2w & complete zerg fest of joining the snowballing faction",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Depends server.. not much players, there is only 1 or 2 dominant faction, and not really solo friendly game.. Needs to be in group war times.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is just greatly unbalanced and broken right now. Instead of fixing issues dev release halloween skins. Im not sure how you can call this a pvp game when you can 100% to 0 someone in less than a second..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's basically \"we have Albion Online\" back at home. The parts that make Albion a good game that are similar here, are worse and it's missing the good parts altogether.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hack, cheat, trash game of china",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "P2W Deád game! Player base 95% bot",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant transfer my earned items from beta plytest. Scam.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Devs have 0 interest in keeping this game alive.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is dying.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trash. dead game. boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lowk mid but idk someone played it for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a joke. It was released with the exact same exploits that were already present during beta, and nothing has been done to address them. Duplication glitches and other issues make the game completely unplayable and destroy any sense of fairness.\n\nTo make matters worse, the developers launched a predatory cash shop with €250 packs right from the start. In their own comments, they try to defend these packs as “mainly cosmetic,” but that’s simply false. They include 30k solarbites, which after level 20 can be turned into Starfall Token chests, giving massive gameplay advantages and making the game blatantly p2w.\n\nIts crystal clear the priority here isnt the players or the quality of the game. Its squeezing as much money as possible. Until the rampant exploits, lack of security, and shameless monetization are addressed, this game doesnt deserve anyones trust, time, or money.",
      "voted_up": false,
      "votes_helpful": 313
    },
    {
      "review": "Pay-to-win. +12 Equipment(golden is highest), +12 Drifters(hero characters). 200 maximum players per map, lower powered players gets kicked out so +12 goldens can stay on map and f2p waits on queue. Obvious Multi-boxing even during war-times. Too many factions, then players switch to high-numbered faction. Unbalanced heroes. \nPlenty of grind:\n1) Level of your equipment and heroes\n2) Runes\n3) Regears on item loss\n4) Rewards on post area, Rifts, chests are lacking.\n5) Resets every season\n\nCensorship:\n1) Taiwan.\n2) Tibet\n\nCheats: Radar hack, speedhack. Treated like it's the norm.\n\nI will stay and see how this game dies.",
      "voted_up": false,
      "votes_helpful": 79
    },
    {
      "review": "This game is a joke. It was released with the exact same exploits that were already present during beta, and nothing has been done to address them. Duplication glitches and other issues make the game completely unplayable and destroy any sense of fairness.\nTo make matters worse, the developers launched a predatory cash shop with €250 packs right from the start. In their own comments, they try to defend these packs as “mainly cosmetic,” but that’s simply false. They include 30k solarbites, which after level 20 can be turned into Starfall Token chests, giving massive gameplay advantages and making the game blatantly p2w.\n\nIts crystal clear the priority here isnt the players or the quality of the game. Its squeezing as much money as possible. Until the rampant exploits, lack of security, and shameless monetization are addressed, this game doesnt deserve anyones trust, time, or money.\n>I am an idiot for playing this instead of DOTA.\nVery easy to cheat your way in this.\nCountless bugs need to be fixed.\nAnd the shop... oh boy, it’s so predatory it makes EA look like a saint doing community service.\n\nDON'T WASTE YOUR TIME ON THIS!\n\n개병신겜 맵은 더럽게 넓고 이동속도는 존나게 느리고 이 광활한 필드에 유저 하나 만나기 힘들어서 서로 쌈질하기도 힘들고, PVE는 존나게 재미가 없다\n\n장점\n\n1. 같은 장르의 게임들에 비해서 라이트한 게임\n2. 전투가 매우 훌륭함\n3. 번역이 나쁘지 않은 수준임\n4. 매시즌 초기화되는 시즌제 게임\n\n단점\n\n1. 캐릭터 성장에 영향을 주는 BM이 있음\n2. PVP 그중에서도 대규모 교전에 집중된 컨텐츠",
      "voted_up": false,
      "votes_helpful": 97
    },
    {
      "review": "This game is a joke. It was released with the exact same exploits that were already present during beta, and nothing has been done to address them. Duplication glitches and other issues make the game completely unplayable and destroy any sense of fairness.\n\nTo make matters worse, the developers launched a predatory cash shop with €250 packs right from the start. In their own comments, they try to defend these packs as “mainly cosmetic,” but that’s simply false. They include 30k solarbites, which after level 20 can be turned into Starfall Token chests, giving massive gameplay advantages and making the game blatantly p2w.\n\nIts crystal clear the priority here isnt the players or the quality of the game. Its squeezing as much money as possible. Until the rampant exploits, lack of security, and shameless monetization are addressed, this game doesnt deserve anyones trust, time, or money.",
      "voted_up": false,
      "votes_helpful": 141
    },
    {
      "review": "P2W Slop game bundled with malicious malware apparently lmao.\n\nDevs ban people for pointing out on their discord that the game is scanning your ports for vulnerabilities while playing. The game has no ToS or EULA that you need to accept that points out what the port scanning is for and the devs make no mention of it in any way or ask you to consent to it. \n\nIt's just silently and maliciously scanning the ports on your pc for unknown reasons.\n\n$40 minimum for early access to 1 character that isn't fully released yet unless you pay up.\n\nWhales can yoink their mother's credit card to instantly +12 all their gear and go around ball crushing beginners that are still trying to learn the game. Yes you can \"farm everything without paying\" but good luck farming anything meaningful when the 7 man Brazilian gank squad full of whales with +12'd legendary gear immediately pop heartbeat sensors to locate you on the map you're on and lynch you mid activity and swipe your loot putting it back on a long cooldown on the map lmao\n\nGame will use immense amounts of memory out of nowhere and spike your memory usage up to like 90+% for having the audacity to zoom out too far on the map screen.\n\nStay FAR FAR away from this dogsh-it there's far better games to play on steam that aren't this slop lmao.",
      "voted_up": false,
      "votes_helpful": 141
    },
    {
      "review": "Unfinished game, no anticheat system, cheaters can use Cheat Engine from the very first test server, and nothing has been fixed for the beta release. The same item duplication exploits that existed before are still fully functional. The developers have clearly only focused on a P2W system, with founder packs up to €250, instead of actually making the game playable. They have mocked the players, failed at everything, and the game is a total disaster — broken mechanics, no security, and the only goal seems to be squeezing money from the community.\nA complete joke.\n\nOn top of that, the developer is lying. Anyone can check that there is no anticheat running at all. They claim the founder packs are “cosmetics only,” but the Emperor Tier clearly gives you:\n\n30,000 Solarbite — with that, starting from level 20, you can buy Starfall Token chests at the auction house, and with those Starfall Tokens you can purchase actual gear, just like you can directly with the Solarbite. This is straight P2W, no matter how much they try to disguise it.\n\nDon’t be fooled. Even essential things like proper sound effects are missing — for example, riding a mount has no sound at all, you only hear background music and little else.\n\nIn short: dont believe what the developer says. The game is unfinished, unprotected, and built around pay-to-win packs instead of real gameplay.",
      "voted_up": false,
      "votes_helpful": 143
    },
    {
      "review": "I am an idiot for playing this instead of DOTA.\nVery easy to cheat your way in this.\nCountless bugs need to be fixed.\nAnd the shop... oh boy, it’s so predatory it makes EA look like a saint doing community service.\n\nDON'T WASTE YOUR TIME ON THIS!",
      "voted_up": false,
      "votes_helpful": 116
    },
    {
      "review": "I am an idiot for playing this instead of DOTA.\nVery easy to cheat your way in this.\nCountless bugs need to be fixed.\nAnd the shop... oh boy, it’s so predatory it makes EA look like a saint doing community service.\n\nDON'T WASTE YOUR TIME ON THIS!",
      "voted_up": false,
      "votes_helpful": 93
    },
    {
      "review": "Unfortunately this game will not survive for much longer. Game definitely had potential but some Guilds ruined this game and experience for everyone.\n\nFundamental of the game is supposed to be 6 factions versing each other fighting for the center of the map. Where the issues lie is when one guild wants to be #1 in their faction and if any other guild thats in the same faction even resembles a threat they then go out of their way to befriend a wholeeee different faction (who technically we should be playing against...an enemy) to aid them by giving them freedom to take out the guild who they see as competition.\n\nSo not only are we to now defend against the enemies but we also have to defend against our own allies? \n\nThis is when the experience was pretty much ruined for me. This caused multiple factions and guilds to quit due to the stupidity and greed of one guild and now the server is basically a ghost town because of this mechanic that should not even be allowed in a game. I encourage the developers to enact some type of punishment by banning a warband (not the players) who seek  for this type of aid because the core of your game is now ruined causing people to leave your game. Find a way to fix it now before it's too late, unless you are just truly here for the money grabs then respect to you because you'll at least get it for another 2 weeks-month. This game will sadly be dead by end of year if no rules are implemented.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "Feels Like a Mobile Game – And Not in a Good Way\n\nThis game is a grind-fest, plain and simple. It doesn’t respect your time and offers little to no real gameplay variety. You repeat the same boring tasks endlessly, just to make minimal progress. It honestly feels like a mobile game stretched into a full release — repetitive, shallow, and designed to waste your time. Avoid it unless you enjoy playing the same thing over and over for no real reward.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Enjoyed S1 despite the semi-p2w cash shop bundles. Missed the Vanguard sign-up windows (48 hours) and got sent to a random server apart from every other friend I played with in S1, with no option to migrate. I can't recommend an MMO that purposefully fragments its own player base like that.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "If you like games that timegate everything, here you go.  Played with friends in a big guild.  It is just timegated blob PvP.  You will max out what you can in less than an hour, then be waiting on timers to do stuff.  Just a terrible game",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "Pros\nMOBA like combat.\nZvZ PvP during prime time hours for 45 mins 2x.\nUnlimited grinding.\n\nCons\nPay to win\nGreedy gacha boxes for all cosmetics\nGacha MOD system (Can buy some mods at end of season 1 time)\nWalking simulator to find pvp\nPvE is boring, especially tedious if solo during non prime time.\nDevs don't know how to balance the game and are actively making it worse.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "Friend pulled a rare mount from referral link chests and sold it on the ingame market for max price (100k). A day after it sold he was hit with an rmt (real money trading) punishment because he sold an item for too much. After a week of talking to their community managers theres still no progress on restoring his currency, the mount, or removing the -10k deficit on his account.\n\nThe game has been fun and shows promise if they dedicate themselves too improving small scale content and removing p2w aspects. But knowing regular players can be hit with massive account hindrances/punishments for just selling something too high is quite concerning, Especially when theres no effort from their part to fix the issue or compensate.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "its an albion online clone, but worse, because there are even more factions to splinter the playerbase and the playerbase is full of Timmy's that flock to the faction with the most people, and the game is trash without balanced world pvp, and you're either on the side that snowballs everyone else (which is not competitive, therefore not fun), or you're on the side getting trainwrecked by the faction that vastly outnumbers you, which is probably also not fun. The way the game is made, there is not much that can be done about it either, so its basically shit.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "This game is straight buns. Total pay-to-win with zero anti-cheat. You can speedhack, spawn in items, and nothing gets done about it. The devs only care about whatever cuts into their money (like RMT) instead of actually fixing the game.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "The game seems fun at first but it gets boring fast. For some reason they soft lock you into a single drifter/armor set (you get to pick one drifter and one weapon/armor progression route, then you are soft locked unto those, with a very tedious grind behind unlocking additional options). I can understand that the publisher is money hungry, but I doubt many would spend on unlocking those alternatives if they don't even know if they will enjoy them or not.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "The game play is okay, it's not a game where you can shine and all the team fights turn into giant blobs so if that's your thing then go for it. The community is toxic as hell and any twitch drops that you get run the chance of not working and the customer support is all AI so you can't get any help unless your issue falls under the predesignated issues that are programmed into it. I personally find the game to be boring and impossible to play or enjoy with a group smaller than 30 people. There is a limit to how may people and houses can be in one zone at a time and will kick you out if your not a high enough level so if you are playing and not grinding daily to get the absolute most out of every minuet of your playtime you run the risk of being kicked out MID fight for the people who have no lives and play this all day every day or the people who just drop a tone of money on the game to get ahead.  This game has the mentality of a Planetside like game but in practice it's just a phone game on PC.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "total pay to win bit of rubbish ruined by gready people and over the top in game guilds.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "TLDR: Slow, grindy, p2w, boring b/w fights. Fights are fun though.\r\n\r\nPreface: We were skeptically-hopeful\r\n\r\nMade a guild with about 10 friends to roam and do small skirmishes like we did in GW2 and NW. we all realized the P2W was strong and after still giving it a fair try more or less decided it would not be worth the time and effort to keep up with the exponential grind needed to progress. I take one day away to go to a festival (about 27hrs from last login) to come back to being demoted from guild leader due to inactivity and my guildmate(wife) having her driftmark/house removed. Not a week, not 72hrs, but barely more than a day and you lose your leader status (wouldn't have mattered for us since it was all friends) and you house removed. \r\n\r\nB/W the slow repetitive grind of a gameplay loop while waiting for fights, the constant reminder that paying will speed EVERYTHING up, to the unforgiving punishment of having anything to do that would stop you from playing for a day, I can't in good faith recommend.",
      "voted_up": false,
      "votes_helpful": 73
    },
    {
      "review": "So this is an extremely painful review write, I started playing this game early in the play tests back in May-June. I fell in love with the gameplay and community. I found a small guild full of wonderful people and had an absolute blast - Aside from all the political turmoil and backstabbing that happens throughout and into late game - I had a blast during playtest.\n\nFast forward to launch, I start a day late with my old guild, that's when my problem and many others arise. We joined the same named server as before, but this time one of the biggest, if not the biggest guilds is on here with us. From the start they are pushing people around, telling randoms/guildless where they can and can't go, harassing them on the map, and blocking them from team/faction combat. This wouldn't be a problem if it was only 1 guild....but the problem is this guild is actually 2 guilds with similar names of 200 people each. They easily make up a massive portion of our servers active playerbase and thus do all the activities themselves and block out those who are not in their guilds.\n\nI tried to do the whole \"if you can't beat them join them\", I requested to join the guild with a vouch, but they took over a day to respond and in that time I experienced multiple instances of the above behavior from members of the guild I was trying to join, so I just pulled my application and left. This is also where I find I can't swap factions (not a bad thing tbh) and now have to create a new character......I've played about 19 hours now and so far none of them have been fun.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Played since season one this game keeps getting worse over time, there is 0 balancing in the game, queue simulator, pay to win, credit card players one shot you with +12 character +12 dagger. Overall, don't waste your time on this garbage.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "extremely unbalanced. halfway in the game, everyone will just switch to the faction that is winning, and that winning faction get even more unbalanced. Other faction player will just abandon the game or stop playing entirely, resulting in a faction population ratio of 10:2:2:2:2. \n\nto make matter worst, with the over powered faction getting high player population, all the high level map is controlled by the winning faction. there is literally nothing to play if you are not in the winning faction.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "after almost 100 hours.\n\nHere some point\n• The PvE content is super boring \n• Pay to Win.\n• No normal currency trade market.\nOnly premium \n• The game is basically 99% PvP but it's not balanced at All. \n• items can cost 300% the value \"because it's the only skill oriented PvP \"\n•Map are Huge for nothing. you gonna walk 90% of the time.\n\nthis game its just a quick cash grab .",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "unless they do something to balance populations going forward, whoever gets a lead is going to get more members and it's going to always end the season with 10-1 numbers.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "So, theres lots of people saying oh its grindy rah rah rah. Theyre full of crap. This is the arcade version of Albion Online. Its basically a copy and paste down to the very skills just renamed from Albion Online.\n\nThe game is meant to be fast, you can be ZvZ ready in less than a day or two. When you die you dont lose anything because its so painfully easy to get starfall tokens (in game currency). Unfortunately the biggest issue is the P2W aspect of the game. There are guilds dropping $300+ per player on this game and right away become the most powerful players in the game. They can buy the strongest weapons and strongest armor right off the rip. While those who only want to spend maybe $100 or less will require months or more to get to the same combat readiness these players are at. If the meta suddenly changes? They're combat ready overnight again while you the $100 or less player, adds another month or 2 on your sentence. Make no mistake, at this point in the game, unless you're willing to drop at least $200 on this game, or grind day and night with a group of 7+ people you will end up no where and just get clip farmed by players who actually have great gear you have little hope of obtaining in less than a month.\n\nThis might be confusing with my previous statement \"this game is meant to be fast\" it is. You are ready to fight in a zerg v zerg in a day or 2. But youre cannon fodder youre not a major player. Youre meant to be content for the people who spend lots of money on this game.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "All the data from the tests and the first season of this game should have shown the devs that 6 factions and 3 servers per region are too much for a niche game like this. In season 2 however, they added more servers and kept the same number of factions\r\n\r\nLarge parts of the map are empty on most servers and there are factions with no players at all. The game seems to be designed with warbands inside factions collaborating with each other but in most cases, that can't happen because of how they are handling the servers.\r\n\r\nThey've successfully copied mechanics from other games (Albion and Foxhole mostly) and made it a bit more accessible than those games, but they really don't seem to be able to come up with their own ideas. Everything they designed around the factions, warband and how seasons work is conflicting with each other and the actual player count for a game like this.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "For a game that advertises less BS and More PVP,  PVP is nowhere to be found.   You cant find it on the maps, you aren't told by the UI where its at.  I was sold on a game that doesn't exist here.    It wants to be Albion with 10x the PVP but falls on its face.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Good intentions bad execution. Allow server transfers mid season which kills competition and encourages dodging to punch down. Chinese Albion with Ubers across the map for no PvP.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Just wanted to know if it was pay to win and it is. Might be a good game, but this kind of monetization is predatory and ruins any kind of fun that could have been had",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Game breaks around level 45. As a free-to-play player, the bow I use costs 24,000,000 coins. At the current rate, it takes 1-2 weeks to earn that much coin. If I even attempt to PvP, and I end up dying/losing my bow (which happen OFTEN) - it takes another 1-2 weeks to afford another bow. I've tried other weapons, buying cheaper tier weapons, etc. But then I'm not competitive in PvP, I die, and I lose even more gear.\n\nSo, as it stands - as a free-to-play player - I can only afford to PvP once every week or two. In other words, I've hit level 45, and the game is dead. It doesn't matter how hard or long I grind, I simply can't earn coin fast enough to support baseline PvP participation. It's a huge oversight by the developers, and it's why this game is hemorrhaging players. It doesn't matter that it's fun and the core concept is solid. The economy doesn't work, and they're burning through their goodwill in less than a month.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Game has a lot of potential to overthrow Albion but the game needs more time to workout its issues.\n - Guild-Faction relationship is counter-intuitive\n - Needs faction population regulation\n - Most faction traits are useless at how the game is right now\n - P2W schemes like early access characters, currency bundles\n - Bugs/exploits",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Complete garbage, I usually like large scale ZVZ MMOs but the design of this is so fundamentally flawed that it's not worth playing, steam description says 24/7 PVP BATTLES!!!!!!! But in reality there's only really big fights during two 30 minute wartime periods per day, outside of that the game feels dead and you're left with the following questions 1: Why am I playing a game that consists of 95% running around on a mount and moving my base around with 5% combat? 2: Why am I waiting around so long for PVP when I could just play a MOBA and 3: If there's supposedly \"thousands of players online and 24/7 battles\" as Steam claims, WHERE THE HELL IS THE ACTION?\n- Game is also p2w, can't think of a single good thing to say about it",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Season 1 Pretty fun game, until -- the losers from the first server come to flood the server you been progressing on.\n\nSeason 2 dead within 2 weeks? 3 factions team up on 1 faction killing the game. Quit for Arc Raiders :)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Waiting room for a good game, hard p2W policy, the choices to build your character roaster or character it's really short, everybody runs the same 3-4 things",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is a scam. The actual game play is fine, it can be fun, but around 10 hours in, you see it for what it is. The numbers keep getting bigger and bigger for the amount of resources you need to progress. The little trickle of currency you get early on makes it feel like progression, but its really not. You're just going through the same motions as everyone else.  The real problem is the level caps, time locks, time gates and the need to PAY 2 WIN in some form, or you constantly get robbed by the game systems.  Taxes, Fees, Surcharges on all kinds of items make it punishing for people NOT swiping the credit card to keep up.  \r\n\r\nNOW onto the real problem. It's free 2 play, and the game has no anti-cheat.  There are already cheats/hackers abusing this fact, speedhacking, ESP, Radar to find you... and not only that, these 3rd worlders run around in large zergs for solo and small team combat.  These bottom feeders don't want a fair fight, they want to run around and gank in teams of 10-20 players finding 1-2 players and trying to \"WIN BIG\" on the loot that may drop.  Just a stupid game in the end.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The game itself is not that bad. nice graphics, nice mechanics and fun to play, the first days.  But at the is just pay to win game. The in game economy is dead AF. maybe whe they twek stuff i give ia another try",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "So I loved the game at first, it was fresh and new. But the bad thing about this game is lack of content and the overall hierarchy of the warbands. I was in at least 5 warbands between season 1 into 2. And it is always a power hungry person who brings people in uses them and then after they are done the other person uninstalls and quits because they got thrown away and got no rewards they spent whole seasons grinding for their teams. It’s a sad game. And honestly if you are reading this, don’t play. There are tons of free to play games with better combat and less hassle. As a guy who spent thousands of dollars and plenty of hours in. It just  another gatcha game. Don't knwo fi the devs listen or not. If so they would ban some guys I got a list of. Either way. This is my last time playing Warborne: Above Ashes.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "1. Season 1.0 Rewards Feel Undervalued\nSupporting your game and winning during the Season 1.0 where everything is raw and confusing felt like a joke because the reward system offers nothing exclusive or meaning. It also shows that devs lacks care for player efforts. I personally felt that my title is a joke with the rewards they made. \n\n2. Persistent Bugs With No Clear Fix Timeline\nThe development team is still struggling to resolve long-standing bugs, exploits, bots, multiboxers and players feel there’s no visible progress or communication. Reporting alone is a struggle where you cannot have a formal platform with ticket number and timeline to resolve issue. This creates frustration, especially when the same issues affect gameplay every day.\n\n3. Time-Consuming Map Travel\nMoving from one map to another takes around 2 minutes, which slows down gameplay, especially for players involved in large-scale fights or map-to-map content. It breaks momentum and reduces overall enjoyment.\n\n4. No Proper Platform for Raising Issues\nThere’s no official place to properly report problems, ask questions, or escalate concerns. Players end up feeling ignored or forced to rely on unofficial channels. All they do is have it posted on the discord channel where no reference and timeline how long will it take to investigate or take a look into an issue. \n\nReporting players in game, does not even get a confirmation or a reference number that it will be taken a look into. \n\nResponse time of community leads takes 2 to 5 days. Personally, communication from the dev team is too vague and slow. Updates feel unclear, and players are often left guessing about how certain mechanics actually work. \n\nLack of community management, this also needs a lot of improvement. No consistent presence, no clear announcements, and no transparency about problems or decisions. \n\n5. Poor English Translation and Communication \nPersonally, I don't feel the game is friendly for English Speaking Players. Translations are confusing, inconsistent and sometimes does not match the developer's real intention. Update Notes often cause confusion and misunderstanding because of the unclear wording. \n\n6. Poor In-Game Rewards \nPurchasing subscription is not rewarding, even the Battle Pass and Daily Login Rewards are things you won't even use on the 2nd and 3rd Month because its very common you will definitely get more playing everyday. Progression is not rewarding in this game, and the effort-to-reward ratio is really low for the time invested. \n\nOverall, from my experience, the game still needs a lot of optimization. There are constant FPS Drops during large scale fights, multiple game freezes at the worst possible moments specially when clashing making you disconnect. \n\nClass balance is not consistent, some classes feel over-tuned while others barely feel relevant, this also applies to the equipment and potions. \n\nContent becomes repetitive after a while, loop feels the same and not much variety to keep long term players excited.  Events feels underdeveloped, not even an exciting reward for people to look after. Halloween Event, absolutely a failure. No initiative to keep the players engaged.\n\nUI still feels outdated and clunky. Important information isn't shown clearly, and some features requires too much clicks to access and its buggy. Some important details are covered and can barely see and no option to customize it. \n\nServer Stability is very unreliable, it crashes and consumes too much memory that it needs to be restarted every now and then. Specially during the peak hours. \n\nDevs are interviewing people who long left the game, rather than communicating to players actively on what can make them keep playing the game. When the people who knows the current issues are the ones that kept playing. \n\nI feel like the game has a lot of potential, but the current directions makes it seem like the devs are overwhelmed or unsure how to move forward on this game. \n\nI can go on and on about this, will update my review when I see things improve.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "\"Build freedom\" but nothing is anywhere close to balanced, so you have 2-3 real choices to make.\n\nI like the portions playing with friends, the larger content size is fun, but at the same time faction balance is currently atrocious. The 'swarm' attempt at fixing it is really nothing either, just doesn't do the job.\n\nI would love to recommend the game for those interested in PvP and who can play pretty constantly to earn more to stay competitive (again, the 'jump in at any time' thing is another failure, the power difference will be huge and you will feel it very fast!) with some of those things fixed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Devs are pushing ingame market prices up and forcing players to swipe for enjoyment. stay away from this.\nPay to Play, Market manipulation. best weapons cost 100$+ just to unlock.\nGame only has a few days on content in the first week of season, devs do nothing to stop factions from teaming up and abusing que systems. so the same \"team\" of players will always \"win\".",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "The reason for the downvote is for the toxic community  that's starting out during the beta. If you enjoy pouring bleach and amonia in a glass and drinking it and enjoying the vapors, this might be the game for you. You should enjoy the toxicity in dota , lol, and of course albion to enjoy this game.\r\n\r\nThe game itself is fun and well executed. I pity the devs and customer support for what they're going to have to deal with in the community.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game was really good. Really Really OBNOXIOUS part about the game is having to wait over a week for a Drifter (Hero W/e you wanna call it.) to show up to play the game how you want to play the game. Not all weapons are equal resulting in Mandatory Meta weapons to use or you won't get invited into a war group or you'll be forced to change your setup to participate. 120v60 matches are quite annoying. Gameplay is fun if you can find people to actually do the content with. 7 Man rifts result in being left out of Warband (Guild) Groups. Politics is annoying af.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game has hilarious monetization.\n\nIt is interesting game, but getting reward on day one for buying 50x $120 US package.\n\nAs they declared, it is Free To Fight game. But hey, real money are transferred to game currency...\nand everything you want, you can buy on day one.\n\nGame did not hear about \"moral monetization\" even at times it was on drawing board.\n= = = =\nFaction Balance? 6 Factions. One 2,500. 2nd 1,500. 3rd 500. If you are in remaining three. You are food.\nAnd you are dropping expensive gear. (Or you do reasonable thing and enter battlefields in much cheaper, lower tier gear.)\n\nOr you do even more reasonable thing. Learn your lesson and quit before you waste a lot of money.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "You cannot have multiple characters over different servers.\n\nI started on the Chinese sever on game launch to test things out and learn how the game works before my main server comes online, which will be NA.\n\nWhen the EU server launched, I figured I'd test if you can play on multiple servers.\n\nYou cannot.\n\nThis means I will have to delete my character on the Chinese server to play on the NA server, but I wanted to keep it for experimentation. I've already put like 7 hours into it, so it's ridiculous that I have to delete it.\n\nAllowing only one character in the whole game anywhere is lame.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "A lot of promises but sadly developers decided to split playerbase between servers for no reason. Players tried to warn that it'll kill whole idea about endless pvp and now all the eu servers feels almost dead. Out of 6 factions 2 or 3 at best have some players.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Warborne has potential, but it’s just not there yet.\n\n- It has a basic foundation, but if your server isn’t populated, there’s basically no PvP—and the PvE is repetitive and boring. It doesn’t come close to what Albion Online offered at launch, let alone now.\n\n- The pay-to-win is extreme. If you think Albion is bad, Warborne is easily ten times worse.\n\n- The world feels empty, and the lack of sound makes it worse. There’s combat audio, but no ambient noise—no mount footsteps, no environmental sounds. It’s so quiet it feels like your headset’s broken, but it’s just the game.\n \n- Cheating still seems to be a problem based on other reviews. Same issues from beta, and while my server’s too dead to confirm, it’s not a good sign.\n\n- There’s no real crafting or life skills either. The game feels bare bones, and with the constant resets, I don’t see how it’ll hold a player base long-term. Time will tell.\n\nOverall I hope the game gets better and less pay to win but for now its not looking too promising.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game seems to be great, but devs are the issue here... gonna be dead title before month after launch, and only speedhackers will have fun",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Killed the game after 1 month, too many servers per region so no population on each server. Game requires healthy population to function as a mass PvP based MMO.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "season 1 - was great mass pvp \nseason 2 - less mass pvp, strange lvling 45-50\nseason 2.1 - 60% running around / taxi from one side map to another, 30% PvE trash farming and 10% PvP\nwake up guys ... u killing game\n\nmerge servers ffs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The decision to add more servers and split the community in season 2 made the game feel completely empty.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was okay for the first season: a lot of p2w and questionable mechanics but enjoyable nevertheless.\nUPD: on top of comment below the game sadly is just dying... too few people are playing all these artificial limitations of 200 houses (driftmarks) per zone do not allow to merge all servers together (yet lol) while not enough players to populate individual servers\n\nNew season which allowed pvp within friendly faction is just full on re**rded move and bad game design. Now while doing any kinda of activity I need to be on alert not only for enemy factions but if some \"friendly\" faction member won't go off screen flag up and kill me. What's the purpose of friendly faction remove them make it FFA.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The further the season progresses the more you can tell that is a straight up buy to win game\nDo not recommend it and will go back to albion",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This one is super boring.\r\nYou buy a subscription for $10 to progress and +$10 for the battle path. Otherwise, you miss all the fun stuff and just grind.\r\n\r\nFun stuff:\r\n- you join a guild\r\n- you travel for 30-40 minutes across maps to kill a couple of mobs/players \r\n- you die if unlucky and travel 15 minutes more to join the fun part\r\n\r\nSounds dull? You are right",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too many factions, underpopulated, and level cap rising every day is beyond lame. \n\nHalf our faction quit after a only a couple days.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is fun for 3-6days. Then its boring. You get to exp cup in 30 mins couse of catchup mechanics(i like that) but then you are left with not much to do other than wait for boss areas to respawn, or get farmed by bots..mass PVP on  the other hand feels amazing. I hate 0 character customisation, you pick your character and thats it...no cosmetic changes, no endgame, just grind and wait for war all day long. Nah, smooth gameplay, but, gets boring realy fast.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is fun to play but really questionable design descisions mean that it will not have a long life. It aims at people who have no life and little money, which will mean that in Europe for example it will be dominated by Russians.\n\nA few points:\n- Real money Auction House is a big no no, that alone should tell you to avoid this like a plague.\n- No Solo play possible, you must join a Clan or you will achieve nothing. This alone means that you will turn away a large portion of players for FTP games.\n- \"War\" where you can conquer territory is twice a day is insane and means you have to commit an insane amount of time. A season takes barley a month and leveling, which is necessary to keep up, becomes an insane chore in the higher levels, even if you pay the 10 bucks for the pass which speeds it up.\nSo not only do you have to invest an insane amount of time, all that time becomes meaningless in just a few weeks. This will turn away most players after a short amount of time.\nSeasons should probably take 3 or so months to make it remotley worth it and wars should be twice a week max but the issue is:\n- Outside of War there is little fun to be had. The content repeats instantly, the NPC enemy variety is non existent, so is there AI and you will do any PVE content only to level up and gather recources. Which means:\n- Bored no-life Clan members will constantly ambush you, it isn't as punishing as Albion Online, so it's not a big issue, but there time is 100% wasted with this effort and it's just an annoyance.\n- Stuns, slow downs, stuns and more slowdowns, immunieties and more stuns. Stuns and immunieties should always be treated carefully, because they take away player agency 100%. This game doesn't care, you will get stunned and if there is no immediate counter by the group you are with, in a large scale PvP battle it means you are 100% dead. You can do nothing about it. It's just not a fun mechianic and the game relies heavily on that.\n- So many pointless mechianics, that are only annoying and make zero sense. If you get killed in PvE and other allies are around and enemies overrun your group, will will get killed since there is a 3:00 long cooldown for you to stand up. Why can't you teleport out, why 3:00 minutes? The enemy gets a present without doing anything.\nHealing without an item takes forever. Why do this in PvE? It's only annoying and serves no purpose.\nStuns + bombs can instantly kill you. Again why? It's just a no skill mechianic which is 99% of the time used against small unorganized groups that farm together. There is so much more, it's just sad.\n\nAgain, I don't understand who they aimed this game at? Any amount of market research should have told them that there isn't a large audience for that and especially not a large paying audience.\n\nIt's sad, because the gameplay itself can be fun and it could have been a great game if they had better Designers. Instead they just tired to please no-life beta players which will leave for other games soon anyway.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game was almost too good to be true, it had all the elements of a successful PVP MMORPG. \n\nUnfortunately, the developers have gone for the quick cash grab approach and the game is riddled with bugs, imbalance, and poor game design mechanics that have hindered it since the early tests. \n\nThe game released way too early, and thus is riddled with problems including one of the most aggressive P2W models in gaming. With a combination of paying for driftmaster boosts, gear boosts, support station power level boosts, and more, you can easily achieve a large gap between F2P players.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is like 5-10% p2w and has it's pros and cons. Generally a not bad ZvZ oriented game.\n\nBut there is one thing that can ruin your experience called:\n\"You are about to be removed from the this Zone in X seconds\"\n\nYou're about to loot big chest along with everyone? Get kicked from the zone.\nYou're in the middle of Zerg vs Zerg pvp? You can randomly get kicked from the zone.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i am currently ranked #1 in PvP contribution & normal contribution for my faction, i have the highest tier available to the server in terms of equipment and i will still get teleported out of the map while actively engaging enemies (literally getting kills and assists) by their broken, poorly coded queue system. \r\n\r\nMy 2 cents as someone who played this game's playtest and launch? stay away until they fix the queue system.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fun game wih some good parts ... but its locked behind a HUGE wall of grind , in a hope you trow money at the game to skip the boring grind and  can actually just play the fun parts of it , and with more money more power to stomp others players ....\n\n... just stay away from this garbage if you value your sanity.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great game, similar to Albion but with 100x more PvP\n\nEDIT: Devs dont give a shit about the community, they want a pvp game with 6 factions but only 2 are alive in every server after the first season due to poor dev decisions. Cashgrab, run away from this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to love this game but its just p2w garbage unfortunately, the gameplay is amazing, the performance is amazing, no lag in huge fights, but man that p2w is the \"skill\" difference in the game.  \n\n\nTheres also trash guilds that are 3 sister guilds deep with 200 players each, just zerging the entire map basically and work with opposing factions to take over our own  nodes to then go and retake them and claim it back as their own. its very badly designed, 6 factions is too many and not enough moderation is even worse when map control is clearly being exploited",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Long story short - it's Chinese Albion Online with smartphone/tablet user's interface. Period.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "They should change the name of this game to Whaleborne Above The Poors. It is full pay to win. If you like spending $$ to get the advantage, this is the game for you.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}