{
  "positive": [
    {
      "review": "8.5/10\n\nWhat an indie gem this is. I am not typically into point and click narrative games, but this game does a lot with a little.\n\n\n[b]Pros:[/b]\n\nAmazingly written with unique characters\nAmazing vibe\nCool gameplay loop that keeps you wondering who is a visitor and who is not\nDeep lore and great commentary on society/humanity/government\nGreat soundtrack which fits and immerses you in, I am particularly fond of the End Credits theme, gives me goosebumps every time\nSave on quit option is a good addition, relying on Kombucha only was a bit tedious\nFun achievements\nLack of jumpscares, just tension, paranoia and dread\nMultiple endings (10)\n\n\n[b]Cons:[/b]\n\nA bit buggy, your run could be ruined forcing a restart\nSome interactions on days that could be more random, not so scripted\nMissed opportunities and more NPC interactions between each other",
      "voted_up": true,
      "votes_helpful": 43
    },
    {
      "review": "\"No, I'm not a human\" is one of the most interesting games I have ever played in my life. I've never watched so many YouTube videos about a game's lore. I want to know everything about it.\nThe first playthrough is an experience everyone should have. You learn about people's stories, you are scared of the half naked visitor, you question whether or not you can trust FEMA and you don't know what the cat is for and what’s going on. Eventually, you achieve one of the game's many endings, each of which requires different approaches and choices which I love.\n\nHowever the main problem of this game is the gameplay.\nDon't get me wrong: I love this game. As I mentioned, I love its lore and story, I want to discover the truth about the visitors and I've followed the game since the demo came out and I still watch videos nowadays. I still recommend that everyone buy and play it at least once.\nBut after the first playthrough the game loses all of its mystery and horror. You can speedrun every dialogue interaction because guests repeat the same text regardless of whether they are human or a visitor. You end up rushing or avoiding the game mechanics because you know how the game works. I want to offer few suggestions to the developers, hoping they read my useless review xD.\n\n1) While adding more guests for the upcoming update is fine, all guests should have more dialogue options depending on their true identity. It would be more interesting if another game challenge was figuring out who is who based on contradictions and lies in their conversation. Imagine realizing a guest is a visitor because they accidentally contradict something they said, allowing us to not be forced to physically check them for signs and use more our head. This could be maybe the game hard difficulty if it will ever be done.\n\n2) To increase replayability and make the game interesting again, the game needs two new gamemodes. The first one is a fully randomised run. Imagine if FEMA, the half naked visitor and the vigilante come to the house randomly. This would create a constant sense of worry for the amount of guests you have and you have to make sure you don’t have any signs either. Also any guest could be a visitor, forcing us to engage with the game mechanics every time unlike in the main story where we all know now who is always a human or a visitor. Another gamemode could be an endless / survival one. It would work similarly to the Randomizer one but would simply not end and we could have leaderboards for people surviving most days. While the current game is random in few aspects, these modes would fix the main problem of knowing what happens every time after the first playthrough.\n\n3) If a sequel is made, or in a major future update, please consider adding a guest conflict mechanic. Right now, guests only have problems with others only if another guest is in their designated spot. But what if they start fighting each other over food / resources or for any other reason? What if even the human guests begin killing each other due to their conflict or because they think someone is a visitor? This would make the player worry more about who they are housing and turn the atmosphere of the game even more tense.\n\n4) There are many videos of people who have found all the ways to identify a visitor (it works 100%). While this is amazing for achievement hunters like me, for a better gameplay for everyone, which I care about, I suggest adding more randomized elements that complicate the identification process and make it truly random each time. This would prevent players from being able to \"cheat\", forcing us to use our head and guts rather than outside knowledge even though we could simply ignore these videos and play the game normally unless you have an amazing memory.\n\n5) The cat feeding mechanic is too strong. Being able to get two cans of food and being able to order more every three days means you can’t \"protect\" your guests from any visitor for just 1 day. We should get only one can of food or be unable to order the same thing twice in a row. Or maybe introduce a currency system which does not allow us to buy whatever we want everytime?\n\nIn conclusion, the first playthrough is amazing and a must experience, but that's where the enjoyment ended for me and many other players. Once you play the game once, the next playthroughs become repetitive. I can see many players dropping the game unless they are aiming for achievements or all endings. I probably forgot some suggestions, but the five listed earlier are the most important for improving the gameplay in my opinion.\nCan't wait to see what comes next. Good job, developers!\n\n**Please add the steam cloud functionality in this game. I am now forced to get all endings again just because I played the game on my steamdeck.**",
      "voted_up": true,
      "votes_helpful": 33
    },
    {
      "review": "this game is easily one of my favorites from the year, it's insane, stuff can just occur and the game refuses to elaborate in the most unapologetically dismissive way",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "Writing this review after 100%ing the game, I think I have seen everything the game has to offer.\nThis is my favourite indie game of the year without a doubt, it's absolutely worth your time and money.\n\nThe game really plays with your sense of trust, and having a limited amount of energy each day really puts pressure on what you're gonna spend that energy checking, each decision matters if you want to survive.\n\nThe music sets the tone right from the start and as the story progresses in a way that can only be described as a blanket of melancholy comfort, it's calm but then tense when it truly needs to be, and it hits good.\n\nThe characters feel genuinely interesting to learn about, real thought is put into each dialog tree so that even in the brief time you spend with them, you learn a lot about who they are as a person during and sometimes before the end times\n\nThe art is fantastic and dripping with charm, everything is well designed and fits into the universe and nothing feels truly out of place.\n\nThere's easily 10 hours of content (even playing it rather fast) that will keep each run feeling fresh and interesting, and as you play you'll learn exactly how the game ticks and work out your strategies for getting every ending, which feels really rewarding.\n\nGive this game a try, you won't regret it.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "[h1]When will the pale man come to visit me? [/h1]\r\n\r\n[b] I love this game. Thank you so much, I didn't expect this game to touch my heart. \r\nIt was also very funny, with such interesting characters. Looking forward to an update with new people or non-people?? [/b]",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "this game was way more enjoyable than i expected!! i tried to stay away from the game since i hate horror, its never really been my thing, but i finally decided to play it, and it did NOT disappoint whatsoever - i havent seen anyone talk about how fun the gameplay actually is? its a very simple plotline yet so interesting, i love how you can make your own theories up as you go along , and how theres a few easter eggs \r\n\r\nID 100% RECOMMEND THIS GAME TO ANYONE PLANNING ON BUYING IT!!",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Oh my god don't get me STARTED!!! I LOVE THIS GAME SO MUCHHHUHHH!!!\r\n\r\nokay im gonna get started. so firstly, obviously, the art direction and detail in all the sprites, backgrounds, EVERYTHING! so gorgeous! it really inspires me a lot. the soundtrack is so beautiful too! i listen to it separately often! the aesthetic and vibes through the entire game are spot on.\r\n\r\nthe story has a ton of depth, so much to look into and explore. multiple endings, at least 50 or so characters?? it's wildly impressive to me. I love every gut wrenching second, you really empathize and care for the characters and their situations. the diversity is wide too! every character feels like a real person, which also makes killing them harder. ugh i just love it so much i shouldn't spoil too much but if you are on the fence about getting this game i HIGHLY RECOMMEND! <3 \r\n\r\nalso there's a cat you can pet so basically instant five stars from me B)\r\n\r\ntall man the GOAT! :D",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Love the art style, theme, story, and music.\n\nBest 2025 horror game",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "The game makes you discriminate and kill people based on physical features. \n\nJokes on the dev: [spoiler] I'm very good at discriminating people. [/spoiler]",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I liked this game because of its atmosphere, the music, and the questions it raised. It made me wonder whether each of these characters is a visitor and what kind of state the world is falling into through the dialogues of every person who knocks on the door.\r\n\r\nIf new visitors or new endings gets added in the future, I’ll definitely play the game again",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "atmospheric, interesting writing, very clearly has a lot to say about isolation and trauma, allusions to real world events as well as to other media, mechanically interesting as well. there's a bit of randomization (not a seed based game though so reloading to get the people you want for achievements isn't off the table) but it's consistent enough that you aren't just completely reliant on guesswork for how many people will show up, when certain events will happen, who's a visitor, and such. quite a few different endings as well. highly recommend if you like visual novels.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Bardzo fajna i prosta gierka, trochę w stylu Human or not, albo Papers, please. Ciekawy pomysł, grafika i wykonanie. Kilka zakończeń i nieskomplikowane achievementy. Żeby zrobić wszystko na 100% potrzeba kilku powtórzeń, ale gra jest w miarę krótka i nie nudzi się za szybko.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I was a really big fan of this game when I played the demo, and the full release didn't disappoint. Playing purely on your paranoia, with a really simple but fun gameplay mechanic, it had me hooked for ages. I love that this game does analog horror in a way that's not overdone, being what \"they\" masquarade as and how hard it would be to distinguish between real and fake.\r\n\r\nI really love it, I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very spooky, great atmosphere, also: cat.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A cool game concept with quite a lot of possible endings for it's price.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Besides a few bugs (especially the one with the hoodie guy softlocking your game) NINAH is a good game. I wish we had more depth to the character interactions and building relationships with them instead of a couple dialogues though",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game stays with you long after you've finished playing it and is more than just a narrative indie game about strange visitors and loneliness. \n\nThe gameplay alternates beautifully and confidently between alienation, control, and the quiet violence of normality. What struck me in particular in retrospect is the subtle but pervasive post-Soviet feeling that runs through the entire game. This oppressive feeling of surveillance, emptiness, and a society that has closed itself off. \n\nParticularly impressive are the dancing ballerinas at the beginning, who appear on television whenever the situation in the game becomes particularly unpleasant or threatening, which, as I learned in retrospect, was actually a tactic used at the time to gloss over social problems. This is more than just an aesthetic trick. These interludes almost act as a kind of cultural sedative. Memories of a controlled media landscape in which beauty and order are used as a cover for unrest and oppression. Television does not calm; it incapacitates.\n\nThe central message of the game seems to revolve around the exclusion of people who do not fit into a social norm. The “non-human” is a metaphor for otherness, be it psychological, cultural, physical, or emotional. The game mechanics and dialogues convey how subtly - and sometimes brutally - a society can reject someone simply because they do not fit into the mold. It's about conformity, control, and the fear of deviation.\n\n\nThe decisions you make carry weight, and the gameplay challenges you both emotionally and tactically. The soundtrack is particularly noteworthy, perfectly matching the surreal mood. A certain tragicomic element also emerges, depending on which guests you receive and their individual backstories. Some are a direct analogy to life itself. Isolation, loneliness, and borderline experiences are the order of the day. The monotonous atmosphere, which is only broken by observation and interaction, places a lot of emphasis on social interactions. Unfortunately, these can also be our undoing if we receive the “wrong” guests. The game deliberately drives a wedge between authentic empathy and mistrust. Who is a visitor, who is a human being? Is it even possible to distinguish between the two adequately? The characteristics that are supposed to lead us to a differentiated separation are themselves incredibly simplistic and are not concrete traits, but rather characteristics that humans can also possess; humans who fall outside the norm, humans like you and me.\n\n“No I'm Not a Human” is therefore not light fare, but a powerful piece of game art. It challenges, it irritates, and that is precisely why it remains so vividly in the memory. Those who immerse themselves in the atmosphere are presented not only with a dystopian narrative, but also a critical mirror of our own society.\n\nAnd not to be overlooked are the game's most important gimmicks: BOBER, a mushroom-obsessed dude who resembles Karl Marx for some reason and a cat that you can constantly pick up and cuddle, making this dystopian atmosphere a little more bearable <3",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Mind rot typa game, clinically obsessed",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i'm just as bad at reading people in this game than i am in real life\r\n\r\noverall, pretty solid autism simulator",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "this game completely took me by surprise with how rich the story is and all of the challenges, and THE MUSIC... the soundtrack is incredible. gimme. please. now.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game is good. But before its release, you said there would be Turkish language support, but I couldn't find a Turkish language option in the game settings. Disappointing...",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I want things to be beautiful\nI forgot things could be beautiful\nI forgot it was a option\nI had given up hope\n\nI want things to be beautiful\nI forgot that things were beautiful\nI forgot it was a option\nI had given up hope\nI'm giving up hope\n\nThat maybe it could change\nThat maybe there are options\nIt could take a different shape\nIt might not survive the change\n\nBut it could survive the change\nWill we survive to stay the same?\nOne thousandth prison in my eyes\nI've seen these lonely deaths be died\nI'm no stranger to the sight\n\nIt doesn't even move me\nI'm the type to keep it pushing\nI wouldn't be here if I wasn't\nI'll walk to work past wasted bodies\nI hardly even mind\n\nChange is in my hand\nMoney changes in my hand\nIs in my hand\nMoney, change is in my hand\nI want things to be beautiful\n\nhttps://youtu.be/gUPGLYYT4bc?si=CnwoBH2s4qgqu7t4",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Thematically great but could use a little more depth. Especially when comparing it to something like Papers, Please which is over 10 years old now. Still a fun time!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Playing this game while streaming it to a couple of friends makes for a really fun experience! I love the tension of letting someone into the house and bracing for the possibility of \"it smells like someone died tonight.\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best game ive bought u have already nomminated the game for game of the year i WILL buy lost in the roots when it comes out thanks for making me enjoy having games on my pc (pyrogaming was here)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Whery intresting game if you like to dive into the story and set the puzzles to see whole painting. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game is alright but a couple of complaints.\n\nfor one, putting \"amogus\" on a persons t-shirt was a good way to instantly break my immersion in the game, as well as a few other little things here and there. \n\ntwo, for what you get out of the game i think it's a little overpriced. i got it for idk 20 something canadian, and this really feels more like a 5 or 10 dollar game, especially with the amateurish writing (not bad writing, just amateurish, which is very excusable for an indie game.)\n\noverall a neat experience and premise so far, i only have 3 hours so maybe im missing something. however i do feel like ive already pretty much seen it all at only 3 hours, which again i could be very wrong about, i guess we'll see.\n\nTL;DR game is neat, but i would grab it on sale, not full price.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Soooo.... You alone :) ?\n\nVery nice horror game with many possible endings and choices that will decide your fate.\nLook for signs on your guests and make sure none of them are the Visitor.\nListen to various stories the guests tell you.\nAnd be prepared for the strange events that can transpire.\n\nFor me this was a very unique game experience. I can only recommend this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "bit repetitive if you're going for all endings, but cool concept and great ambient",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game. It has depth, visual delightful style and strategy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "storytelling and atmosphere are really creatively executed and chilling, have been waiting for the release of this game ever since the first demo and haven't been disappointed",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A Doomsday prepper's wet dream...\n\nJust kidding.\n\nThe game has an amazing tense atmosphere, great storytelling that's mixed with uncertainties that make you question everyone and everything.\n\nFirst playthrough should definitely be done blindly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Story is good and engaging, but mechanically it fells like tech-demo. But worth playing for the story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Outstanding game.\r\nFrom the visuals to the music, and especially the story and atmosphere, every aspect of this game is truly top-notch.\r\n\r\nIt’s rare for an indie project to fascinate me this much, but this one absolutely earns every bit of praise it receives, both from me and all the other people who have praised it.\r\nIt’s clear that a huge amount of passion and care went into creating this game, and the result is an experience that stays with you long after you’ve finished playing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is what horror should be: dread that build and builds until you’re uncomfortable in your own skin. No jumpscares. No cheap gimmicks. Just pure horror. It also leaves enough things a mystery to expand its life well beyond its initial release. Definitely one of the best horror games I’ve played all year.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably my new favourite game! i love the use of colour and how gritty it looks, the thought behind this game is unmatched by most indi games i've played to date. The replayability has me kind of hooked i really want to see everything the game has to offer, and often times even if i don't get the RNG i want, the playthrough still ends up showing me more and more of the story with new characters and dialogue I havent read before.\n\nIt's been my favourite game to livestream this year and make art for! \n\nIf you like horror but dont want to be horrifically jumpscared and just get lost in an unseasy world, this is PERFECT",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game genuinely impressed me — for a narrative point-and-click game, it’s a real hidden gem. Even though we know very little about the world and the entities within it, that mystery is exactly what makes you want to keep digging and uncover more.\n\nThe tension is always present, not through cheap scares but through an atmosphere that slowly gets under your skin. It’s one of those indie titles that proves you can create something deep and memorable with simplicity. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, atmosphere, the detailed characters, there stories, and the sense of uneasy you get from the tale figure",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pretty decent game, drawbacks are that some endings are very weird and its rather short",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its been a long time since I've felt this kind of uncomfortable fear. Not jumpscares, not screaming in your face. UNCOMFORTABLE fear. The fear that makes you sit on the edge of your seat, turn a light on when your laying in bed in the dark, or turn around when walking down a dark street alone. This game is phenomenal, from the art style to the story I am truly obsessed with this game. The hidden lore and things are just insane, and it just keeps me on the edge of my seat. Apart from all these phenomenal things, the replay ability is amazing each run through is different and keeps things interesting!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I needed a game like this one in my life for a LONG time. The gameplay is so simple, but the story is amazing imo. Sure it may not be something groundbreaking, but it definitely pulls you in and doesn't let go. It's a must play for anyone who's into psychological horror.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's the perfect amount of scary. No jumpscares, just vibes. Sadly the replayability is on the lower side, - [spoiler] though most visitor/human status is randomized and there are multiple endings, once you learn the visitor signs, the game becomes too easy. [/spoiler]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Все ачивки стоят того, чтобы проходить снова и снова (спасибо гайдам), игра супер-классная, теперь каждый день проверяю зубы, глаза и руки",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love critical Reflex games! from teleforum to their new unreleased project DROWNED LAKE to this one! This one has a unique story and aesthetic to it from the others, but its also chill and well paced! It has a warm, cozy feel to it but also a sense of mystery that keeps you immersed in the plot. I also love the small interaction with the food delivery and kitty.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I like this game, the art style and it's atmosphere. The gameplay is simple, somewhat repetitive. I feel like the demo contained the epidemic ingame a bit more and gave the impression that something was brewing underneath the surface, that there was more than met the eye. The base game feels more stressful as well, as opposed to the demo, and I know games are supposed to be like that but I feel like this game could've held that atmosphere and vibe for a little longer. Nevertheless, it's a good game and I commend the developers for making it. I would also like to thank my friend Mitchell for introducting me to this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I spent a lot of time in this game, and even after the hype died out i still like it, sure it can get boring at times (considering the amount of time i spent ingame) but i would definetely recommend playing!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Очень достойная и затягивающая игра!\r\nМожет быть недостаточно глубокая в плане геймплея или в плане мира, но все же с прекрасной стилизацией и атмосферой.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ахриненная игра с ахриненной идеей. Спасибо за такую работу!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am so glad that prior to playing this I only watched a handful of videos and avoided spoilers.\n\nThere were so many endings- and characters in game that I hadn't seen people go in depth on and I adored every minute of my initial runs. The endings are vague and eerie, and just the method of story telling that No, I'm not a Human uses in general is so captivating yet uncanny, (I mean the foreshadowing and easter eggs speak for themselves.) I also just love the guests and just how distinctive every single one of them is from another, it makes interactions extremely interesting especially when you compare the differences between the human and visitor counterparts of a particular character. And that's all without even mentioning the Protagonist and how intriguing he is based on dialogue, and environmental storytelling. \n\nI’ve 100% this game and it’s still all I can think about. Will definitely be replaying my favorite endings and interacting with my favorite guests, and ones I didn't see much in previous runs in the future. If you're planning on playing (which you should) do it with the soundtrack. And if you have the energy, in my completely biased opinion you should get all the endings and go for some / most of the achievements. They are worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think it’s enjoyable in the first few days, but after a while it becomes a little repetitive. Still, I haven’t seen this kind of design in any other game before. I still think it’s a special game and worth the money",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "9/10 horror game. enjoyed the playthrough and simple controls",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "oooohh this game fullfilled my choices matter itch and I'm glad I played, onto achieving every ending",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AMAZING STORY LINE WOULD RECOMMEND  but my favourite character did die but that was only the first play through so its good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Perfectly encapsulates the fear of people, outside, and the end of community",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game so much, the atmosphere and art style is thrilling. on a first play through it is very fun to play, but overall it feels unfinished…\n\nThe guests feel one dimensional, the options you choose in conversation don't really affect their outcome, and after you get through their dialogue, they have nothing left to offer. You get no rewards or extra dialogue for keeping them alive to the end. They also don’t interact with the other guests. Compare this to undertale (which the game lists as similar to) where your choices and decisions affect the characters in the end, making choices to characters can impact others. Heres a good example for an event that I heard: if you keep the neighbors daughter alive, your neighbor will eventually come back as a visitor, and you have to choose weather or not to let him in at the risk of his daughters life. That would be great as the daughter is a significant character but barely changes anything. Instead of adding more guests, add more to the guests. There is already well over enough in the game.\n\nAlso, the scripted events make each play through feel the same. There should be a few random events to  make the game fun to replay. And maybe more mechanics, this game could benefit from a harder mode where you have to assign tasks to your guests such as supplying food or fixing the ac which could affect your survival, as of right now the game is more of a visual novel. \n\nI am willing to wait years if this game could get the update it deserves. This is one of my favorite games, using skinwalkers and paranoia as an allegory for discrimination is such an amazing idea.\n \nAlso, if anyone working or contributing to the game is actually reading this, don't listen to the fans begging for the update to come out now, please take your time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Concept of the game is very good, really enjoyed the atmosphere and uncanny visuals to build a sense of unease\nSlightly disappointed by the lack of clear infos about the whole situation at the end of it, ended a bit too abruptly.\nI'm planning to get the other endings and achievements so mayhaps my comment will change\nI also find the price to be a bit high, so I'd give the game a 7/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Surprisingly deep—explores human psychology and nature. Very dark and depressing; have an upbeat game queued for after playing this emotional disaster.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game.  Great creep factor and each play through I find new little gems.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Loved the game,it was so much fun! I really love the aesthetic and I’m waiting impatiently for the next update.\nmassive banger",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a pretty eerie game, I like it. Doesn't rely on cheap jumpscares. Two arm, Two Leg, One Head.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very surreal and atmospheric game with an impressive soundtrack.\n\nWhat struck me most while playing was how oddly peaceful it felt. The protagonist builds a routine which is relatable to many, such as switching on the TV and going to sleep. This is where a sense of comfort is built, and it's easily one of the reasons why it works well as a horror game. It doesn't rely on jump scares; instead, the fear is built through the gradual realisation that comfort itself can become a trap. \n\nI quite enjoyed the philosophical aspects too, like when a character asks: 'Do we inhabit the dream of another, or are we the one who dreams?'. It captures the haunting, reflective tone well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game and I love feeding and petting my kitty. I'd die for him.\nI let the stoner and the widow with the corpse into the house and the vibes in the bathroom were immaculate. \nAlso got the bald guy ending on my first playthrough.\nAnyway 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What the actual f^ck is this game?? Just stolen the last two hours of my day.... And I love it. What a great concept",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall a great game and I would definitely recommend it to anyone seeking an interesting and grotesque experience. This game scratched an itch I've personally had in gaming for a while so I might be biased.\n\n10/10 art design\n10/10 soundrtack \ndecent gameplay although it gets repetetive once you complete on playthrough\ndecent story, nothing crazy but keeps you interested \ndecent replayability, enough endings and achievements to get to keep you playing a while however it is definitely going to be repetetive and grindy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game's fandom has proven that someone will find you attractive no matter what. Even if you having a raging fungal infection in your armpit, or a black hole in your chest.\n\nP.S if this game doesn't win any awards this year I will become a visitor and kill you all",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great atmosphere, intriguing story lines and good replay rate, definitely recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best fucking horror game with the most addictive gaming loop the paranoia in the roof i love this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First horror game in a while that got me interested in the lore and the world within the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It was something different. I love games that feel completely infused with the creator’s intent and thoughts. Here, behind the cozy, slightly stylized visuals, there’s a quiet whisper: “I know what it feels like - not to want to exist\".",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The environment & character designs are just weird but beautiful af, also, the music really matches the feeling the game gives you.\r\n\r\nCongratulations, Trioskaz, I hope you keep making good games like this.\r\n\r\nThis is one of the best indie games that I've played in my life.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely love this game :p\n\nIf you are a fan of Visual novels like 'Homicipher' or Otome Games like 'A Date with Death', I think that this game will be pretty fun for you. It has an awesome story, easy game mechanics and riddles that aren't too hard to solve, but need repetition and attention to notice and fully solve.\n\nThe Character designs are also godly with each Visitor (pun intended) having their own intriguing story and comedic relief. :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Frustrating in the best way. This game makes you work hard to figure out who to trust. And the randomness of the encounters makes for great replay value. Some of the characters are set in their paths, but even more are totally random. \n\nI still haven’t gotten an ending where I lived and I have been at it for hours.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My first achievement hunt! I loved the characters, stories, and general vibe of the game. The soundtrack pulls you into the dreaded, apocalyptic world the MC is living in. I love how you have to pay attention to the story to determine if they show visitor signs, how there are 10 different endings, and so many hidden scenes you’d probably only find if you aim to get the achievements. I come from the Mouthwashing community, and if you love that, you’ll love this too! I hope to see more games like this with such attention to art and mood.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best horror game I've played in 2025, genuinely a new outlook on the horror genre with all of the twists. Each individual character that is able to come into your home has a story, secrets and even more. It's a game with amazing world building and overall creates an atmosphere that locks you into the game. No, I'm not a human is an absolute fuckin' steal for the price of $15 and if you haven't played it yet, do it! You won't regret it, infinite replayability and devs who care about their project and update it consistently. Deadass a 10/10 I know I'm glazing but it's worth the glaze.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I really enjoy playing this game. One thing that could make this game better is the ending. There should been an end sequence where you see all the people in your house who you have saved. That way you can play the game over and over again to save your favorite characters and see them interact with each other. In the main game you spend a lot of time testing and getting to know everyone in your house so it would be more satisfying watch your crew make it over the finish line. Thank you! Love it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game, worth playing with a friend watching also, so together you can deduce who might not be who they say they are",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Every element of this game has impressed me, but above all the storytelling is what grabs me the most. The guests (humans & visitors alike) really do have such an impressive nuance to them that I didn't expect from the short interactions.\n\nI love the protagonist, he feels very \"real\". He is trying his best despite the fact he doesn't want to. It is really hard for me to like a rude or snarky protagonist, but the Homeowner is more than that. He shows compassion to others, he is resilient yet as scared and clueless as everyone else.\n\nBeautiful political messaging, I think more people should question the government & know that they will respond to a crisis in ways that best benefit them",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fear grows in the shadow of the choices we’re afraid to make , and the consequences we choose not to face. This game teaches us about the human condition and its dark sides like Autophobia, and macabre self imposed justice. You are the judge the jury and the executioner. I have never seen such a plot in a game and i have to say its refreshing to see a indie game dev doing something new. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What a beautifully simple premise, wrapped up and turned into a short narrative that keeps bringing you back, asking more questions, and wanting more. Storylines and endings are numerous, and the devs plan to add even more soon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the visuals and gameplay, still needs to have a little more content but it's pretty neat <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love how in the game the protagonist can pull out the shotgun on suggestive or creepy statements too, not just only after checking for visitor signs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I checked recommended because I do think people still need to play this in order to give a fair judgement. \n\nPersonally, it was just a mid game. Nothing mind blowing. I kinda hate how some of the signs of a Visitor and a Human are so random. The premise of the game encourages you to do multiple playthroughs, but I'm turned off how the dialogue/stories just stay the same. It feels like a chore going through this game again for the sake of other endings. \n\nPlay it still. You might like it better than I will or not.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game is okay. My only real complaint is that there is some cultists that get forced on you in the game. You can't decline them. And they automatically evict anyone that's occupying the spots that would also be assigned to them. So people you might be trying to keep? Gone. Replaced by people you didn't give permission to enter your house. And then they act like you're the asshole for getting rid of them by what ever means you have available. That aside, the game is as described. A horror game with choices to make that affect your odds of surviving. It's not bad. But it could use some tweaks. Like being able to turn the cultists away.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun little story about how not everything is as it meets the eye. You'll be shown people that are not as they seem, in good and bad ways",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Eu não tinha nenhum plano de jogar esse jogo. Abri a loja, vi o nome e pensei “tá, isso parece estranho o suficiente pra me convencer” Instalei sem nem ver trailer, achando que ia testar por cinco minutos… e foi aí que começou tudo\n\nLogo percebi que estar perdido era parte da experiência. O jogo não tenta te guiar como um herói... ele meio que te joga num universo onde ser humano é quase um detalhe irrelevante. E confesso, foi libertador. Senti que podia ser qualquer coisa. Um vilão. Um erro de código. Um glitch consciente. Eu comecei a fazer escolhas completamente diferentes, e, por algum motivo, isso fez sentido\n\nTeve um momento específico (não vou dar spoiler) em que eu parei e pensei:\n“Nossa… acho que tô mais conectado com esse jogo do que deveria.”\nFoi meio bizarro, meio engraçado, mas bem marcante\n\nA sensação geral é de estar jogando algo criado com muita personalidade, como se o jogo tivesse alma… só que uma alma esquisita, confusa, talvez não humana, e isso me deixou curioso o tempo todo. Não é polido, não é fofinho, e acho que é exatamente por isso que me pegou\n\nQuando fechei o jogo, fiquei com aquela sensação de “cara, acho que eu entrei por acidente… mas saí diferente.”\n\nNão sei se virei fã. Mas definitivamente virei cúmplice\n\nTalvez eu realmente não seja humano também KKKKKK",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This may be the most thematically perfect game I've ever played. my A.D.H.D. brain often wonders. i get bored and i take a break. sometimes never returning to these conceptually genius narrative driven games where choices matter. this game kept me locked in my entire first play-through. its art style is so unique and grotesque it haunts you from the start. like you still see it when you close your eyes. the paranoia sets in and you do what you gotta do....... at least that's the only explanation you can really come up with by the end of your first run.\n\ngame demands repeats and i'll surely give it some. i feel like despite all the gaming industries financial woes which will hopefully pass soon. Indie games are another golden era and i hope it never stops. this game, despite its bleak & morose tone and hopelessness...... shines bright for me as a beautiful example of how multifaceted \"videos games\" truly can be.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay-\n☐ Very good\n☑ Good\n☐ Nothing special\n☐ Okay\n☐ Bad\n\nGraphics-\n☑ Masterpiece\n☐ Beautiful\n☐ Good\n☐ Will do\n☐ Bad\n☐ Awful\n\nAudio\n☑ Amazing\n☐ Very good\n☐ Good\n☐ Decent\n☐ Not too bad\n☐ Bad\n\nAudience\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Everyone\n\nStory-\n☑ Lovely\n☐ Good\n☐ Average\n☐ Not great\n☐ None\n\nDifficult-\n☐ Just press a bunch of buttons\n☐ Easy\n☐ Significant brain usage\n☑ Easy to learn / Hard to master\n☐ Not so easy\n☐ Difficult\n☐ Dark Souls\n\nGrind-\n☑ Nothing\n☐ Only if you care about leaderboards/ranks\n☐ Isnt necessary to progress\n☐ A bit grindy sometimes\n☐ Average grind level\n☐ Too much grind\n☐ Insanity\n\nGame Time-\n☐ Short\n☐ Average\n☐ Long\n☑ Depends on you\n☐ Endless\n\nPrice\n☐ Just buy it\n☑ Worth the price\n☐ Wait for sale\n☐ Maybe if you have some spare money left\n☐ Not recommended",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game’s core theme revolves around the ambiguity between humans and “visitors,” building tension, fear, and paranoia in a remarkably effective way.\n\nThat moment when your doorbell rings and you’re forced to question whether the person outside is truly human or a visitor creates a unique kind of dread. Combined with the mystery inside the house, unsettling atmosphere, and well-crafted sound and visual effects, the game stands apart from the usual anomaly spotting titles.\n\nIt also features multiple endings, offering different experiences depending on the choices you make.\n\nDaytime energy management plays a crucial role examining visitors, running tests, or making them wait all cost energy. Because energy is limited, you can’t test everything, which adds a strategic layer to the game.\n\nI also think the price is fair. It’s definitely a standout title within its category.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game reminds me of a social game Mafia, where you have to determine Mafia before they kill civilians. Core difference I assume is that you don't have company and have to decide by yourself. Also you probably will be dissapointed if you are perfectionist, as the game is trying to not allow you to save all humans and instead forces you to maintain human balance. You let a stranger in and can not check him at night. If he or she is a visitor - you will learn that in the morning by finding trash bags. You wont let people in - still you'll be left alone in time. Nevertheless, its a fun game to run from time to time and play guessing roulette.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a must play for atmosphere, the music, writing, and visuals. Honestly a modern masterpiece. Thanks to the Developer for this amazing journey.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While not as replayable as one may initially think, I believe it's one of this year's gems.\n\nWith a good and thought provoking narrative there's not much I can say without spoiling the experience, but it does have good commentary on society and discriminatory systems in place. \n\nOne advice I can give, is play blind for as long as possible, the game turns into an achievement hunt (and an rng one at that) after that",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome horror game! Just know that is has cursing, some gore and some adult topics, as long as you are fine with these topics, def play the game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's good. The music bops, the visual style is pleasing, and the characterization and world-building are excellent.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You cannot even imagine how absurd the game gets as soon as you start hunting for achievements. \r\n[spoiler] ''I know that you are a visitor, you scare the shit out of me, but your achievement is given only after the fifth conversation, so just stay here and try not to kill anyone.'' [/spoiler]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i really loved this game! i love the artstyle and how realisticly the charcters are made lots of love to the maker of the game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very good because when i play it i think it is good. But if it is bad then i will th8ink that it is not good. This game is good and i like it because it is enjoyable to play. this game makes me have a good. This game is fun because when i play it it is fun but if i died while i played it i wouldnt be alive anymore. Twomad is alive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game! worth my money the graphics are good plus i like the story and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "NINAH is such a memorable game! Imo, NINAH's best qualities are the writing and soundtrack! I especially enjoy the dialogue, and as for the latter, I find it to be oddly relaxing! Also, the photobashed and partly painted character sprites are charming!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Straight up, you should try this game. If you're intrigued by creepy themes and want a sense of control, I think this is your ticket. It's got a solid \"choices matter\" format where you either get instant gratification or regret making your choice right then and there. Truly an addictive experience even just to watch gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is truly an amazing game. It's honestly impressive how much effort was put into this game. I am genuinely obsessed with this game and some of the characters if you can handle the constant talk about death you definitely should play this game.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I wish there was a middle button rating, but I'll have to go with negative for now atleast.\nTo me this game suffers from the same problems of This war of Mine: TERRIFIC atmosphere, soundtrack and setting, I absolutely adore the way the game looks, sounds and the whole premise is incredibly good.\n...But then after your first playthrough (which is less than two hours long even if you take it slow), you realize the game tries to be both a randomized sandbox-like gamemode AND a narrative focused game, but it kind of fails at both, feeling shallow in both aspects.\n\nIf you played the demo years ago, you will quickly realize that, well, not much has changed and the price is definitely way too high for what it offers.\n\nIt's a shame because, again, I love the OST, house design and the whole Visitor/sun apocalypse thing, but unfortunately there is not much past the premise. \n\nIf you enjoy Mandela Catalogue, liminal places playlists and stuff like that you'll probably adore the game at first and then feel a little disappointed by the game mechanics and story going nowhere (some endings are way better than others, but you won't miss much if you don't do all of them, some are quite disappointing, some are straight up RNG based).\n\nAgain, it's not a straight negative and if it (hopefully) get some updates, it might be worth the current price tag.\n\nMy final suggestion is that, if you like the vibes, grab it when it will go and sale and play it as a one shot with a few friends, when it costs like 5 euros or less.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "game has an interesting premise but but has little replay value",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Just not worth $15. feels like a 3-5 dollar game that you play twice and forget about. Barely enough content here to even review it. Idk why there's movement in the game either, can just be a point and click game. and maybe I'm being picky, but why is the cross-hair needed? I feel they may have wanted to add more interesting playability, and just decided to skip it. I was hoping to read about lore stuff online, but not much of that either.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "saw another review calling the game wasted potential, and it's a pretty fair assessment. too much of the game is left to RNG when it's supposed to be a \"choices matter\" sort of game. it feels like there's nothing you can really do to affect how the game plays out, you just have to let the RNG decide for you. at first it will seem like you can use your intuition to determine who is friend and who is enemy, but in the end it makes no difference. you terminate a suspicious person and whoops! they were human. you use your (extremely limited) tokens to check people for signs and end up with an enemy in your house for three nights in a row because you dont get enough time to identify who it is. then you have a nightmare that kills everyone in the house and whoops! the guy who ends your game if your house is empty shows up and ends your game because the house is empty. despite the fact that i had 5 people in it a minute ago. after that happened to me a second time i got tired of playing. the game is conceptually interesting but quickly turns into a boring slog because the RNG hasnt decided to let me have fun yet. who knows if it ever will, im probably not going to find out. 12 dollars was probably too much for this game. maybe they can fix it, but i wont hold my breath for it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Fun for an hour or so, but ultimately a very hollow and repetitive experience. \n\nAnalog horror has been a declining trend for a while and playing a game that relies so heavily on that aesthetic feels outdated already on release. \n\nThere's no way to determine who is a visitor and who isn't by dialogue alone or straight at the door so it really doesn't matter who you let in. Some characters will always be visitors, some will always be humans but for most it's RNG. Their dialogue and behavior is exactly the same whether they're human or not so talking to them and hearing their excuses feels pointless. There's no point in trying to find holes in their stories or figuring out if they're lying or not as the dialogue is completely hard wired. \n\nThere's barely any interactivity in the game, dialogue options basically don't matter and you're just standing there clicking through walls of text as the characters lore dump at you. The core concept of figuring out who's a visitor just boils down to repeatedly clicking through the same options to find signs and if you find more than 2 you can just execute them. They will make an excuse for their signs but it's pointless as the excuse will always be exactly the same whether they're human or not. It's just all really shallow. Again, there's no way to determine if someone is a visitor through dialogue so why even bother listening to them? \n\nRepeated playthroughs for a different ending feel pointless as you're stuck doing the same mindless stuff over and over again. While the atmosphere and setting are great, the game barely has any mechanics or depth. There really isn't anything to do other than the same mindless stuff over and over again.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game did not end up how I expected. I heavily dislike that you can't check strangers for symptoms before letting them in/until the next day. With this mechanic, a stranger can kill a human before you can even determine they're a threat. I felt like the game came up very short of my expectations for it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This is also a bit of a complaint with the steam review system - There should be more than just \"GOOD GAME\", \"BAD GAME\" because this is a case where the game is a \"ALMOST GOOD GAME, BUT\" we need a middle of the road sideways thumb option or a 5 star system...\n\nAnyways, No, I'm not a Human is quite a good game in terms of the lore and concept. The game's concept is great, the lore is good and fun to explore. The decisions feel pretty good like they really matter, well at least until you realize:\n\nI did 2 playthroughs and had quite a good time, until I started to notice some patterns in how the RNG works, which I do think truly detracts from the game's experience and reduces the replay value.\n\nEssentially there are 3 main categories of people who will come to your house (excluding the prophet or other lore only characters):\n1. Guaranteed Visitors\n2. Randomized Visitors\n3. Never Visitors\n\nThe issue I take is with the second category. While it should improve the replayability of the game that we have some people we do not know whether they are visitors or not, it in fact does not and I'll tell you why:\n\nYou're best off treating this second group as \"always visitors\", because their symptoms are not randomized along with their \"is a visitor\" or \"is not a visitor\" status, thus making those symptoms effectively meaningless in subsequent playthroughs, in terms of using those traits to identify this \"maybe\" group as visitor or not. So the only way you can truly know if they are visitors or not is to shoot them.\n\nPerhaps they made this decision for lore reasons (maybe because ultimately we realize the symptoms are quite absurd), or even to simplify the programming of the game. Either way, I think it's the wrong decision, because ultimately what makes the core game loop and experience more fun for the player is what should matter most. \n\nI think a better decision would have been to randomize the symptoms themselves in some logical fashion to correlate with their \"is a visitor\" status. \n\nPerhaps a system that has several outcomes, like:\n1. NPC not a visitor so you will be randomized to have either:\n   a. (75% chance) 0-1 symptoms\n   b. (25% chance) 0-2 symptoms\n2. NPC is a visitor, randomized to have:\n   a. (25% chance) 1-2 symptoms\n   b. (75% chance) 2-3 symptoms\n\nA system like this, I feel, would make the game more fun in subsequent playthroughs, as it'd force you to continually investigate the maybe NPCs for symptoms, and make your own calls based on the numbers of  symptoms you see and also whether or not people are getting killed (which is really the fun part of the game, having to make decisions like that). A system like this would keep you guessing, because when someone has only 1 symptom you can never be sure if they're a visitor or not, but if they have 2 or more symptoms they most likely are, but even then you don't know for sure unless they have 3 or more symptoms, and you never know a NPC is not a visitor for sure unless they have 0 symptoms\n\nOf course I don't know what exact math or numbers would produce the most fun, but what a system like this could do is force you to let the \"maybe\" characters in, which is what the system already appears to be trying to do (by simple virtue of there being more of them, but in most playthroughs you can ignore it unless RNG totally screws you, but honestly this is not nearly as fun as what seemed to be intended which was you checking the NPCs out yourself). I do realize that subsequent playthroughs will always become less fun no matter what the team does, but instead of the fun of the core gameplay loop degrading after a playthrough or two, this could keep it fun for maybe more like 8-10 playthroughs, which seems to be the number the developers intended (judging by the number of endings)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is enjoyable if you just want to play it several times. The idea behind this game is excellent and the graphics are well-suited for the atmosphere of the game.\n\nThe game is NOT enjoyable if you want to replay many times. The conversations of NPCs are not exciting, and they don't give you meaningful hints. For example, some NPCs will give you phone numbers. But after you talk to those numbers, there is no follow up conversation with the NPCs. As for achievements, most of them require luck and/or memorization, and are generally not exciting. The endings are confusing and presumably reflect certain ideologies, and should be made more accessible to players by giving more context.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "its really creative, has good art style and atmosphere, i really liked it BUT;\n\neven long after the release and several patches it has bugs makes the game unplayable\n\n-black hoodie guy appears at the door and ruins your late game and plus the save system is shitty you can't do anything about it but to break your keyboard in frustration.\n\n-even if you saved at some point and load it to make different choices, game glitches again and makes some stuff (like mirror) unclickable.\n\nplus: most endings are really unsatisfying",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the final version is worse than the demo.... I'm sorry,but there is too much flaws for me to enjoy it,starting from saves system making you cut out 3-4 hours  of your day solely for this game, ending at non-sensical endings and illusion of deep lore.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "You are a recluse loner and the world has suddenly changed. The sun now reaches lethal temperatures in the morning and there are unknown entitys called \"visitors\" that pretend to be your fellow man before they devour you.\n\nNaturally as a recluse, your first instinct is to not let anyone in. However, there is a sadistic visitor who toys with you, betray your nature and allow refugees into your home or else he will murder you. What you will come to realize is that some of these refugees are just wolves in a sheep's wool. \n\nThe government issues out public statements on how to identify a visitor. So naturally when night time rolls around and you hear knocking on your door, you steady yourself and pull out the detective notepad and begin listening to the refugee, vetting their story to see if their a danger or an ally...\n\nBut then before you realize it's over, you are given two choices.\n\nLet them in, or turn them away.\n\nThe government just told you that visitors have perfect white teeth. Wouldn't the paranoid recluse want to check the teeth this person he is letting into his home?\n\nThe entire atmosphere of this game completely shatters from this point. It is completely asinine that you basically are playing russian roulette with each character. It hit me like a bag of rocks. \"That's it? I can't ask more questions? How the hell am I supposed to determine if they are a visitor based on what they told me?\"\nYou cannot. And to make matters worse, the characters are randomly a visitor or a human and their story doesn't change. \n\nThe gameplay is rather shallow, as you basically let everyone in (since you cannot determine if they are a visitor at the door) and then do the government tests on everyone and shoot those who pass one or two of the tests (some pass but are still human). And you do this for 14 days.\n\nJust so you can understand this better, imagine if in \"Papers Please\" you had to let everyone in...then eat the punishment for letting in the wrong person and [i]then[/i] vetting them once they already crossed the border.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Will soon be requesting a refund on the game. This is, imo, barely a game and not even worth the $15 I spent on it. It had an interesting idea and start but that is where it ends. \nI give this like a 2.5/10 maybe? Just nothing to see here. It isn't scary, isn't fun to play, isn't interesting past the first 5 mins of game play. \n\nSo what is wrong in more detail? \nThe game itself caught my interest based on the art work as well as the idea of the game. You're a loner who is now forced, due to psycho human look alikes roaming the streets and murdering people, to interact with people and help/take in as many as possible real humans. Let in Visitors and they will kill people or you. Some people will be helpful, some people drain your own resources or cause you to be extra suspicious with them. Cool idea, right? Wrong. \n\nThe Visitors are all entirely RNG at the door and you're not able to ever tell, aside from the main one that is in the screenshots for the game, if they are humans or visitors at the door. So you gamble every single time on whether they are good or bad. Then when they are in the house you can \"test\" them but not every visitor has every sign and you have limited energy. So guess the wrong thing to check? Visitor will kill someone and you have to spend more energy checking the same person to decide whether they are legit or not. Dialogue plays literally ZERO role in this game in terms of determining whether someone is a person or a visitor. There is no way to check them at the door or determine they are a visitor via the dialogue at the door despite the dialogue seeming to push you in that direction. You can ask them questions sometimes, RNG based again, like \"How did you get here? Where are you from? What are you doing?\" etc. But regardless of the answers they could still be a visitor or not. \n\nSo the entire game play loop is essentially wake up, go to door, talk to 3-4 people, let them in or don't, go to sleep, wake up, talk to people (totally optional as it doesn't do anything to help you) and check for signs of visitors, either shoot or don't shoot people you suspect of being visitors, go to bed, repeat. \n\nThe most annoying part of the mechanics for me personally is that you can check someone for signs and if they show or don't show signs you can listen to what they have to say. Think this would be an extra way for someone to try and convince you they're human, right? Wrong. This dialogue is totally pointless and is the same regardless of whether or not they are human or visitor. Now you have WASTED AN ENERGY to hear this dialogue and you DO NOT GET THE CHANCE TO SHOOT AFTER WITHOUT USING ANOTHER ENERGY!!!!!!!!! \n\nThey story of the game is kind of everywhere too. The government shows up and steals people for some reason. The main visitor that shows up a few times taunts you but doesn't seem to do anything meaningful. The rest is spent RNG deciding whether to kill people or not basically. \n\nBasically once you play the first night of this game you've already experienced everything this game has to offer. I think it took me around 30 mins for my first play through of the game and then messed around a little after that to confirm everything was RNG. Then went on to research what others were saying and found the same answer. \n\nIn my personal opinion, stay away from this title. It just isn't worth the time. It could have been a decent game but even for $15 it just isn't worth the hour+ you will waste on it just to come to the same outcome I did. I wanted to like this game but... Just can't. I feel the popularity of the game comes from this weird thing that happens in the horror game genre where lots of people, especially content creators, brag up this very MEH game and it gets super popular. Everyone buys it and justifies their purchase when in reality they got scammed. Along with multiple groups of people basically seeing as something in the horror genre being weird as the same as being good. The stranger the game, the art style, the dialogue, the world surrounding the game, the better the game overall somehow? Doesn't make sense to me but I have seen it a lot. \n\n\nStory - 3/10\nGameplay - 1/10 \nAtmosphere - Solid 6/10 \nGraphics/Art style - 7/10 Very well done for the type of style they went with but not going to be everyone's taste.\nOverall - Like a 2-2.5/10",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was excited for the game, and found that the story was very superficial. Despite having a lot of very well thought out details, these details and story tidbits did not truly culminate into a strong over arching theme like it should have. The game came across as having something to say and then backed out last minute.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The first playthrough is captivating, reaching a good ending for the first time is nice and the overall concept is something special, I gotta give it that much.\r\n\r\nHowever, there's just too many flaws that ruined it for me:\r\n - there are random crashes when using the phone or on certain encounters, deleting progress\r\n - saving and loading removes phone numbers and causes a cursor glitch (especially after night 7)\r\n - the final day autosaves, overriding any previous save, locking you out of experimenting\r\n\r\nThe majority of players gets a bad ending and quits.\r\n100%ing this game boils down to getting lucky over and over again.\r\nMost of my playtime comes from waiting until specific people show up on specific days.\r\nAfter you've seen some of the endings, this game becomes a boring grind.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I genuinely love this game — the style, the gameplay, everything. But I can’t recommend it right now because of a bug.\r\n\r\nI keep getting the same issue over and over again: whenever I reload, all my phone numbers disappear (even when using only the Kambucha Jar reload), and the game becomes unplayable.  I’ve spent a lot of time on my playthrough, and every reload ends up ruining it.\r\n\r\nI’ve seen that this bug was reported a long time ago, so I’m surprised it’s still not fixed. I’d happily buy the game again once this is resolved, but at the moment it’s just too frustrating to continue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has an incredibly engaging atmosphere with a fun gameplay loop. The first two hours of playing this game are definetly the highlight. After a few runs you realise it needs way more updates, to the point where it feels somewhat unfinished, almost like a demo. What I mean is, you can experience most if not everything within a few hours, except getting all the different endings. Going for different endings usually consists of mostly the same gameplay as other runs anyway, up until the latter half of your run where you can make some key decisions.                       \n\nI think this game has insane potential as long as it receives more updates. Its not fair at the current price point. \n\nPlayed this offline so hrs on record is broken.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is boring and repetitive. The art style gives me a head ache. The soundtrack is too repetitive. I should have refunded when I had the chance.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not super engaging. Concept is very cool, my gameplay is a letdown.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great atmosphere, art, and sound but that's where it ends. There isn't much substance here and it's not well executed. The gameplay consists of listening to the radio, answering knocks at your door by potential new roommates, talking to your new roommates, spending very limited resources to \"test\" them for being a visitor by checking things like eyes, teeth and ears, and potentially killing them if you think they're not human. The test system is shockingly bad to the point where shooting someone with a red iris and nearly a goat-like pupil shape granted me the achievement for killing a human. That moment made it feel like there isn't any method to the madness and soured me on the rest of the game.\n\nAfter getting a trash ending when forced to literally guess out of the 5 remaining options I deduced could be a safe answer, the terrible save system made it so I lost several in game days of progress. I looked up the other endings and I really didn't miss much. I really would recommend skipping this one or just watching a playthrough of it if you're really that curious about it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Игра отличная и очень интересная первые два часа. Далее магия рушится. Понимаешь, что реиграбельности у игры нет, персонажи абсолютно не раскрываются, и нелинейность в игре крайне условная. Особенно позабавило, как всеми силами и сейф-скамами сейвил девочку для диалога с патлатым стрелком, а по итогу выяснилось, что это ни на что не влияет.\r\nК покупке не рекомендую, если вы планируете хоть как-то поковыряться в игре.\r\n\r\nАх, да, словил огромную дозу испанского стыда от огромного количества отсылок на Летова, причём в абсолютно неподходящих моментах. Впечатление, будто автор текста впервые послушал Гражданскую Оборону, и решил всем продемонстрировать, какой он прошаренный. Однако выглядит это невероятно глупо.\r\nЕсли, вдруг, автор читает эту рецензию, специально для него оставляю пояснение:\r\n\r\nПозаглядывал в чужие окна, попытал счастливые дома, уверовал, что будет новый, долгий, ясный день, потом понял, что вижу один и тот же сон, дропнул игру и, плюнув на ваши дела, сказал: \"Хуй на всё на это, и в небо по трубе\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall: Terrible Game (IMO)\n\nI just played 13 hours to learn there are literally no conclusive ends to any parts of the interesting narrative.\n\nPositive\n- great vibes\n- fun mechanics\n\nNegative\n- there are literally no explanations to anything in the story. Its so unsatisfying.\n- The game loop is cool at first and a hassle later because you have to replay so much content in order to get more endings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Le jeu est un bon exemple d'un potentiel gâché. Beaucoup de bonnes idées mais très mal implémentées  et exécutées.\nLe gameplay propose une formule simple : la nuit on fait rentrer des invités et la journée on les surveille pour dénicher les visiteurs. Et c’est tout.\nLes options de dialogues pour mieux les connaître ne servent absolument à rien, rares sont les visiteurs qui montrent clairement des signes dans leurs dialogues\nLe fusil à pompe est mal implémenté, en plus d’une endurance pour les discussions on aurait du avoir des munitions limités par jour afin de faire réfléchir plus sérieusement le joueur\nLes bières sont mal implémentées, à quoi ça sert de les avoir si chaque jour on peut dépenser notre endurance pour surveiller les signes sur notre corps ? C’est inutile.\nA  force de rejouer le jeu, il devient répétitif est prévisible. C’est trop proche d’un « guess who » pour mes gouts. Rares sont les pnj qui peuvent être humains une partie et visiteur la prochaine.\nAussi, les humains n’ont pour seule utilité d’être une réserve de PV. Si cette réserve tombe à 0, lors de la visite du grand visiteur. Game over. Et c’est super dommage je trouve, on ne fait pas rentrer des individus pour le bien commun mais pour notre propre survie",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it gets boring because i can only save 1 time. i would love it if i could save the game more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is an acquired taste for sure. I could see how some poeple would love it, but it's not for me. Love the artistic design but overall a pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great atmosphere, music, and art style, but shallow gameplay, very little content for the price, and mysterious just for sake of being mysterious without any greater story. Also making the status of characters randomized makes the whole point of the game where you are supposed to analyze behavior and dialogue of people at the door  pointless. It feels half-baked, but had some fun with my couple of playthrough. If you can pick up the game on sale for like 8 bucks or less I'd say it's worth it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really was looking forward to this game, the art style and atmosphere are amazing. The music is great, and the story line you get introduced to is really interesting and draws you in - but then the actual gameplay starts.\r\nThe replayability is garbage. I hate doing it, it genuinely makes me angry. Same exact dialogue for every interaction, the only difference is the RNG of if a guest is human or not. I wanted to replay it to get all the endings, but couldn't bring myself to replay the game enough times to. Its really sad, because the concept and visuals are so amazing for the gameplay to be so dull and boring. \r\nI would kill for a version of this game with more in depth in text clues and more consequences for if your guests get killed - as others have said, it feels more like a resource management game than a horror game. \r\nInsanely disappointed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ultimately a fairly shallow experience. It does an excellent job setting the mood but then doesn’t really go anywhere with it. None of the endings are very satisfying, and your questions about what is going on are never answered \n\nIt’s a bit like having a nightmare, unsettling in in the moment, but after you can’t really remember why and just sort of forget about it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Interesting concept. Seems to have the intention for people to replay it a lot, and I can't really see the appeal of that personally. The mechanics here aren't enough to support multiple playthroughs without a lot of skipping dialogue. \n\nBites off more than it can chew, in terms of narrative. The story is thin, but dressed up with a lot of ambiguity and very minor variation. A lot of very \"big\" concepts or philosophical claims that aren't explored in any meaningful way, nor is there enough here to merit analysis. Having seen all of the endings via youtube, none grab me or make me feel it was worth the time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Frequently crashes on my high end computer. When I could get it to run, I found that the graphics and gameplay were just low quality. Poor quality artwork. Poor framerates. Just poor quality slop all round, developer obviously just wants to make a quick buck. Refund requested.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too repetitive for my liking and the gameplay itself is quite shallow. Each playthrough pretty much feels exactly the same and the endings are pretty much always going to be the same unless you follow a guide.. \r\n\r\nMuch prefer games like Inscription, something that has some actual depth and skill is a factor..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fascinated by the breed of indie game dev who thinks they can just shove dozens of references to other, better media into their game and call it a night. if you tried that in any other artistic medium you would actually get killed i think. \n\nbut that's not really a dealbreaker. i love fear and hunger even though its worldbuilding is kind of a patchwork quilt. at least it has a consistent tone and compelling gameplay. i'm not sure what this has going for it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To the point\r\n=====================\r\nWhile striking visuals and atmosphere make for a creepy game, there's a bit too much repetition for me to recommend it.\r\n\r\nGood Stuff\r\n================\r\n- This game does and excellent job making you feel paranoid and alone, even in a house full of people, the palpable dread when making that life of death choice is very tense.\r\n\r\n- The visuals are very distinct and supports the games creepy atmospheric almost dream-like quality. It's eerie in a very compelling way\r\n\r\n- I think a few infamous internet celebrities ( if you want to call them that) survived the apocalypse and make cameos throughout.\r\n\r\nBad Stuff\r\n===================\r\n\r\n- Before getting into it, I just want to say I just think this game isn't a genre I particularly like, I took a chance due to the hype but it never really did it for me.\r\n\r\n- The game is very repetitive and I believe it's set who is a Visitor and who is Human. After my first play through I noticed the pool of people coming to my door seemed to be largely the same, with the same scripts and with the choices of those scripts not making a huge difference on what unfolds with lots of the same events (Crazy gunman, Cultists, FEMA) occurring over and over with no variance.\r\n\r\n- I'd often find myself interested to talk to the survivors only for them to be forcibly taken away or removed because of the request of another survivor. It happens a lot as you get further along in the game and removed my interest in trying to follow up with people.\r\n\r\n- Misdirection is the point of this game, I'm sure, but I disliked how the signs you are given to check seem somewhat random. For instance I chose to kill someone with an evil photo aura but they were a survivor\r\n\r\n- Everything felt kind of pointless and hopeless in the game and there really felt like there was no clear goal or progress, I didn't like it, but if it sounds appealing to you at least it's cheap!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has a cool story concept, a great art style and a really atmospheric setting. However, I feel as if the overall gameplay flow is a little bit too repetitive and while the characters I met with had great designs, their stories and personalities still felt really boring to me. I would say that it is quite overpriced, but it is worth checking out, if you do not mind playing through the game a multitude of times to get every ending, while REALLY liking the art style.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I thought this game was awesome when I first found it, me and my fiance played it together and it was a lot of fun, but learning that the ENTIRE point of the game, deducing whether people are visitors, is useless, or rather not present as a feature in the game after one playthrough honestly broke my heart a bit, whether someone is a visitor is either always the same every playthrough or completely random... :(\n\nThe premise of the game is SO amazing and I would love it if the game actually offered what it parades itself as, a social deduction game praying on your paranoia, but unfortunately with it being either guaranteed who is a visitor or random, all that means is SPEAKING WITH PEOPLE MEANS NOTHING, why offer me choices in what I ask if it is pointless? I am incentivized to skip all dialogue to just get through the night as none of it matters at all... The development of the game seems to have emphasized replayability without keeping the gameplay in mind, an insane decision but its not my game, so all I can do is whine online I guess haha.\n\nIn all honesty this game is such a great idea, and the developers should be celebrated for their creativity, but the direction of gameplay is so destructive to the game its disappointing. If they can make it so actually speaking with characters will help you see if they are visitors, something like minor changes in the story, changes in their demeanor, how casual or stressed or desperate or angry they are and whether that makes sense with what person they show themselves as and this game goes straight to the top.\n\nI know that this is asking for a lot, but seeing the game just add more people and not try to fix the largest most glaring flaw in their game makes me think this game wont ever become what it advertises, and if all the game is worth is one good playthrough, and plenty of mediocre playthroughs, I cant recommend you spend a dime on this game. I will keep an eye on this game, if it even offers a whiff of progress in the right direction I'm on board, if not, then I had fun while the facade lasted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is slow burn game and there is a boring game. This is the latter.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it's good but i wouldn't recommend it unfortunately until there is a few more updates😵💫",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spoilers \r\nBut some of the ending are just bs getting unlucky\r\ndidnt wash yoourself the day before the ak guy shows up you die\r\nkill 2 people one a vistor one not ig you have dark energy and you kill yourself \r\nlet in a hot women who isnt a vistor btw I check oh she gives birth to a evil baby then the cult kills you\r\nalso sometimes people will have traits of vistors but still a normal human \r\nthis game is fucking luck so much luck which isbad but would be okay if it had lots of save oh no only one fucking save every time you die which can be based off luck your set 30 minutes back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is just boring if you have already watched youtubers play it. And the price is WAY to high, should be like 6 dollars instead",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Incredibly boring trying to get through multiple endings is like pulling teeth amazing art style and unique atmosphere would work better in a visual novel style game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Thought this was an interesting concept and it seemed like a well-made game, too.\nBut I think this should have stayed a free demo. This game is not worth the price it's currently at.\n\nIt's pretty boring, even on the first playthrough. There is tons of dialogue to read (no voices), but it gets repetitive quickly, everyone is just moping about the state of the game's world. The dialogue is also seldom required to actually distinguish human from visitor, that mostly runs through the \"I need to check you\" system anyway.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played the demo and thought this game would be incredible. Maybe my standards were too high.\r\n\r\nI played and got to around day 10-11 and sort of managed to softlock myself. I ended up in this cycle where all my residents would be removed from some dream event and then the pale man would knock on my door next thing with no way to avoid it. I reloaded and tried cat food and it didn't save me. I tried cat food two nights in a row and it didn't save me.\r\n\r\nThe game doesn't hold your hand which is fine but there is no way to know for sure how the dream event is triggered yourself as far as I can tell. You can also only save with an item you have to wait to get. This softlock was intriguing at first and just irritating after a few attempts. Sadly this event wasn't my only issue.\r\n\r\nIn the demo and in the time I put into the full release, I believed that the unique characters were kind of something I could remember. Knowing who is a visitor and who is not as I fail more times. It turns out this is not how it works and the visitors are actually random, excluding a few characters, so their text and appearance and story they tell you if you host them is absolutely meaningless to whether or not they're a visitor. Apparently the characters just always have the same tell in the body checks.\r\n\r\nIn a game that feels immersive and creepy and story focused, it was kind of disappointing to learn this. I don't feel like I'm spending time with each character to figure out if they're a visitor based on the writing. It's just the checking \"minigame\" over and over. It almost makes me think they sacrificed a richer story and immersive experience for replayability but said replayability comes across as very dull. I didn't expect to play this game like a roguelike.\r\n\r\nAfter the softlock and confusion, I'm not sure I will even finish it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a good game dont get me wrong BUT for the price and playtime its not worth it.. 15 eur for 1 hour of gameplay.. and i know there are diffrent endings but its getting boring when you know the story.. i even refunded it on time.. so not worth it only IF it goes on sale..but idk if it will ever will",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "o oyunu bozan adamın amk kapşonlu olan oyunu ingilizce türkçe yamasız oynamama rağmen oyunu bozuyı",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is profoundly dull and drenched in a manufactured sense of Soviet ‘comfort’—the same sentimental fantasy adored by certain Reddit and Discord moderators who have never endured a single day under that brutal, oppressive regime. It displays no meaningful development whatsoever and serves largely as a vehicle for russian propaganda, shaped by a studio intent on promoting its ideological narrative. Avoid this title entirely. Glory to Ukraine.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Im a game developer from russia and this is my game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There are some major plot holes that need addressing:\n\nThe pale man - the main antagonist - doesn’t make any sense. He kills a whole armed FEMA patrol on his own, yet he absolutely refuses to kill you unless you \na) are alone in your house \nor\nb) tell him you are alone in your house even if you aren’t.\nHe clearly has some sort of power that we never see that allows him to kill many people with ease, he even threatens to break down your door with the right prompts the first time you meet him, yet he won’t kill you unless you’re alone? Why? He killed a whole armed patrol in full view of people. Lots of guests are aware of him. it makes no sense as to why he doesn’t kill you at any time. \n\nI am aware that during his last appearance he states he is \"under orders\", but again that is contradictory of everything because we\na) never find out anything about whose orders or what orders they are past this conversation\nand \nb) he kills both discriminately and indiscriminately, publicly and privately, which would mean he has his own agenda, not orders from a higher up.\n\nOverall, his apocryphal story is a buzzkill in what could be an interesting game\n\nThere is also the case of every playthrough having the same characters over and over again. it just gets boring. once you've done the Mushroom ending, the death ending etc, why cant they be replaced with another encounter?",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "mid pseudo intellectual derivative cliche slop its over",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it's good but way too short",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very clunky and boring",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Play Funeralopolis: Last Days instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game gets boring super fast",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unfortunately, no.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pale Visitor isn't romanceable. Horrible game for that and that only. Let me kiss him on his hot mouth.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Not that fun……… overrated",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "توجع البطن لحد يلعبها",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}