{
  "positive": [
    {
      "review": "its good if you enjoy fighting bots and general xing xiao",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "its cheap version of cod warzone and i like it the skins are also very cool and i would recomend atleast giving this game a chance",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Sometimes the devs make me question my sanity with the balancing but overall the movement and gameplay is pretty fun. Also feels great to have a movement battle royale game that isn't controller dominated. Yes the aim assist on mobile is practically aimbot, yes the game is gonna get aim assist for controller and ruin the game eventually, but hey, that isn't right now.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I’ve put around 10 hours into Blood Strike so far and I’ve had a ton of fun, especially running duos with my bro. The gameplay feels fast, responsive, and always exciting — every match has those intense moments that keep us coming back. The gunplay is satisfying, the map design is solid, and it nails that “one more round” feeling. Overall, Blood Strike has been a blast to play and is easy to recommend if you enjoy squad shooters and high-energy action.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "+ Great free FPS game\n+ regular content updates\n- a lot of cheaters when a season starts/ends\n- low player count, especially in the highest ranks",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Nice game is top in battle royale categories.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a fun change for cod players it improved aim i personally just dont like the ranked system but thats overall my only complaint",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Blood Strike: Bot-Royale\nThe Skins are nice and have some really nice models with a well made menu, then you load in... and everything feels like it should be running on a 2010 hardware, which isn't a deal breaker by any means just something to be aware of.\nThe guns feel pretty by the numbers and the drop in and gameplay loop is 1 for 1 a WarZone copy, which if that's your thing you can find some enjoyment there, my only complaint is the lack of real players and bot heavy matches, in my first game from drop in to victory I encountered ONE (maybe two) real players and 13 bots, and the bots aren't even convincing or a decent challenge\n\nI'm going to give it a positive because I feels there's some good potential here for a Free-to-Play WarZone Style BR, but at the moment with low player counts and large bot numbers it's hard to recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seems like it has not a big player base on PC, it would be a good game if there were not just bots in the matchmaking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game — it's pretty well optimized and is free. It feels like a mix of Warzone and Apex. The game is cross-platform, and I really love being able to play with my friends on PC using a keyboard and mouse, especially since I have a hard time playing with touch controls.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game its warzone wanna be and i want to be a tryhard warzone in potato graphics type shi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, Sadly bots are infesting the matches but still a good quality game and design!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Faster gameplay, smoother experience, and you can play it cross platforms with mobile users, and so far I haven't encountered any hackers which is a good sign for a healthy shooter game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good cross-platform game with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game with good gameplay and activities! +rep",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the best online game that i've ever had, this kind of game is what i wanted to play.\nNot everyone has a device powerful enough to play the games they dream of. Just like me, I can't play games like Call of Duty, Battlefield, and so on, but after seeing this game, which is lighter than those games, I'm happy to have this game as a substitute for my dream game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Invited by friends, stayed by gameplay and rewards",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. perfect game to veg and chill while doing pretty well. I know its a mobile game but the movement feels great! i love crushing bots and mobile players while pc players can keep up i dont find them a lot. games competitive in higher ranks which causes sweatier lobbies which is fun for people looking to play against movement gods.... 9/10 love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Esse jogo é bom, o chato são os Tryhard que deve comer, cagar e beber jogando está porra",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very funny game, Especially with friends. If you want to play a battle royale, it's perfect choice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not bad good for potato gamers,but sometimes feels lke pay to win",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good crossplatform battle royal games, the only thing is good about this game is pc players and mobile players can play together and gives better and diffrenet experence to low end users.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Gameplay, Easy to learn, Hard to master, the downside is to much eel like player, i hate that kind of player",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid gunplay and good level design. Some weapon balancing could be improved, but overall it’s a fun and engaging experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After nearly 300 hours of gameplay, I can confidently say I recommend Bloodstrike. The core gameplay is highly engaging, and I've thoroughly enjoyed my time with it. While I believe the game is best when played with a dedicated squad of friends (it definitely enhances the experience), the biggest highlight for me is the robust anti-cheat system and the commitment to fair play. Highly recommended for anyone looking for a fast-paced battle royale experience backed by a dedicated and respectful development team.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun game specialy  the battle royle and serch and destory Butt the prolbem is the game ques whants you hit a higher rank in the game the game ques are so bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is peak bro its almost the same as warzone its smooth and low end and good graphics!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good game its like codm but with less storage space",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what a wonderful game.. but only have 1 problem.. CHEATER. and u wanna know where they come from? THE MOBILE PLAYER. you dont believe? WATCH AT YOUTUBE OR CHECK TRAINING GROUND!.\n\n as always.. if they cant fix this problem.. then this game wont last long.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ragebait fucking game mfs will hunt you down for killing them once they will run across the map just to kill you and movement is also insane these kids shower once a season",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game but PLEASE  get rid of the Auto clip load when you switch guns . It stops you from doing any gun combo damage and pretty much locks you into using 1 gun or item and then having to wait that animation load time on the weapon . It's not cool at all . \nYou could also even  get rid of the different characters and  just have a character create screen where we then choose our loadout and ability or  added spec.  It could add to the flow of the game and loading ( even though  the loading time is quick ) \n\nIts a fun pvp shooter but seems to lack a bit of meat to its bones . Its still a great  game though w/ some awesome collabos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game but good teammates aren't common i legit solo squad to masters...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is great its one of the best free fps game such as combat master the finals its great.\r\n\r\nbut there are LOTS of bots and LOTS OF SWEATS.\r\n\r\nTHE GOLD IS CHEAP LIKE 75P BRO THATS CHEAP. Its fun you should play it because its FREE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would recommend this game as its truly amazing and well optimized which means it does great on low end PCs. If you think it will be too easy well you are in for a ride cause it becomes really sweaty in legend to mythic lobbies on BR and SF.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game with neat mechanics and graphics\r\ngood optimization",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would recommend this game because its fun and its a good game for people who want to start off easy but still want action.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing Bloodstrike for a long time, it's pretty fun, movement is pretty buggy but can be used for competitive advantage, graphics are pretty mid but it's the most optimized game I've ever played in my life!\r\neven on a toaster you could get stable 144 fps!\r\n\r\nWhat I loved:\r\n-Skins: They're pretty cheap and really good looking\r\n-Collabs: They often do many collabs, making the game feel refreshing every once in a while!\r\n-Optimization: Overall this game is super optimized and stable, even on low end hardware\r\n-Global chat: Really good if you need tips on how to get better (or ur mom insulted)\r\n-Guns customization: I liked the fact that I could add a better scope or a lighter magazine on my guns\r\n-Kill animations: pretty self explanatory\r\n\r\nWhat I didn't like:\r\n-Maps: they're limited, and very small and repetitive sometimes\r\n-Guns: they are the same repetitive guns but at least they have many skins and you can customize them!\r\n\r\nWhat should be added:\r\n-More guns: even useless ones would make the game slightly better\r\n-New movement animations: or at least make them smoother, do NOT change the speed or any function\r\n-Bigger and better maps: would make the game more enjoyable and not boring after playing for 2 hours\r\n-Ray Tracing: Would make it a better experience for high end users\r\n-Console Editions: I would love to see a console edition in the future (obviously with crossplay option)\r\n\r\nRates:\r\nFun: 9/10\r\nGameplay: 9.5/10\r\nGraphics: 7/10\r\nPerformance: 10/10\r\nOverall Rate: 9/10\r\n\r\nGive it a try, it's free! (and it works on proton too)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game lil sweaty in the mythic lobbies but whadda ya expect",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game but it has too many bots even at the last rank",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is pretty fun to play and grind although only one game mode is good which is battle royale. The only lacking feature in this game is the graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every single update is riddled with problems, but fun game when it actually works correctly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've got 360 hours on this game and here are my thoughts. the gameplay is fast and quick, they have a lot of guns and keep adding them. Now when it comes to ranked....they have a problem. I'm not a pro by any means but I'm not bad, they put me with absolute idiot's. If you do horrible* in ranked and get no kills you're rank should go down significantly, but it doesn't, but other than that is a W game and highly recommend 👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "basically warzone with apex movement but still fun other then those dam mobile players",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think its a nice game. But only beause Fortnite doesent work on my PC (Linux)\nI haven't experieced it yet but i haerd that it does sus stuff in your computer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun solo but better if you have friends that are not stupid as a wall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Truly, I love this game. HOWEVER, as someone who just got their first PC less than a year ago and grew up on controller, well, I obviously play controller. \n\nController support is horrid. I've messed around in shooting range playing M&K and the input delay for controller compared to M&K is SERIOUS, not to mention there is ZERO, and I mean ZERO aim assist for PC controller players. Shooting with the mouse is a beam, just a 0 recoil beam and that leads to native M&K players having 2+ advantages over PC controller. I need to specify PC controller players because those who play on Mobile, do get aim assist even when using a controller. \n\nThis creates an endless loop of M&K moving faster and aiming better, whereas Mobile can stick to anyone and be fine. This is NOT a problem until you play competitive. Once you hit Legend, now Mythic where all the sweats are ( me kinda being one ) you are at a severe disadvantage no matter who you come across. This becomes increasingly frustrating when there are entire clans who share hacks that never seem to be banned. Wanna see 1 person wipe 8 people in 10 seconds? it happens when they shoot bullets behind themselves without hardly looking at the target. I also have ample footage of people aiming 2-5 feet left, right, up, or straight at the ground and getting nothing but hits.  As good as this game is, seems the Devs do not care about the integrity of the game. That being said, it is fun, fast paced, and full of action. Better than any other game out currently with PC controller support and cheating holding it back.\n\nHope this helps!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve played Blood Strike for quite a while (91 hours and counting), and honestly, it’s a fun, fast-paced shooter with tons of potential… but it’s missing that complete game feeling that titles like Call of Duty Mobile or Fortnite have.\r\n\r\nThe movement is great — smooth slides, jumps, and fast action. The graphics are solid, and the gunplay feels satisfying most of the time. But after a while, you start noticing what’s missing. There’s no real variety in modes, and the revive system being the main focus kind of ruins the flow for me. I’d rather have it as a separate mode, not the default one.\r\n\r\nAnd let’s talk about luck — or better said, the total lack of it. The gacha system is just brutal. I’ve spent over 4,000 gold in this game and haven’t gotten a single Ultra, not even once. Not even asking for the highest rarity, just something. At this point, I don’t need luck — I need the game to stop acting like it hates me.\r\n\r\nBlood Strike could be amazing if it improved the rewards, added more modes, and gave players a bit more motivation to grind. Right now, it feels like a great shooter trapped behind bad luck and limited content.\r\n\r\n⭐ Verdict:\r\nFast, fun, and exciting — but frustrating when you realize how much it relies on luck and repetition.\r\nJust give me some luck already, and stop making me waste gold on nothing.\r\n\r\nScore: 7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun game and I would really recommend it if you're into shooting games since it's also like call of duty",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ótimo jogo , seria o combo perfeito de Battle Royal , junto tudo surgiu o Blood Strike , nada a reclamar",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game, warzone but 10x better and the animation is more suitable for a battle royale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "un battleroyale muy divertido para jugar solo o con amigos, tanked muy balanceado y muy buena diversidad de armas, lo unico que no me gusta es la progrecion de armas tan lento, pero lo compensa las fichas para subir de nivel el arma (se pueden comprar o conseguir jugando)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a very good shooter game i would say its better then other ones out there because you can easily run a 100 fps on it if you get you settings right but i would for sure recommend this game to others",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best low end battle-royale & cod like game for all devices! really fun with friends and maybe a break from everything. super rewarding game compared to cod.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "l’ve put around 10 hours into Blood Strike so far and I’ve had a ton of fun, especially running duos with my bro. The gameplay feels fast, responsive, and always exciting — every match has those intense moments that keep us coming back. The gunplay is satisfying, the map design is solid, and it nails that “one more round” feeling. Overall, Blood Strike has been a blast to play and is easy to recommend if you enjoy squad shooters and high-energy action.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "trash matchmaking system but fun , Stressful & Fun At the same Time....Money Drainer For netease for their copycat skins",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good if you enjoy fighting bots, and in general, it's not bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "blood strike is a good free to play game is funny,   relaxing thank you blood strike for funny and i cann rrecommended this game.👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Graphics and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game as far as i know, i recommend others to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MANY BELUTS, MANY SLIDING, AND AFK TEAM!\n\nMUST TRY... DONT FORGET TO CALM WHEN MEET ENEMY WITH ABSURD MOVE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game but gets bored asap.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PLEASE MAKE MORE KAR SKINS ALREADY SUPER DOPE ONES WE SPEND LOTS OF MONEY ON THIS WOULD LIKE MORE SKINS AND BETTER OPERATOR SKINS OTHER THAN THAT ITS SUPER FUN AND SWEATY!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing Blood Strike on PC via Steam for about half a year now, and the main strength of this game is that it “took all the best from the big titles, yet runs on a potato.”  \nEverything we love Apex and Call of Duty for — jumps, slides, characters with unique abilities, fast respawns, dynamic gunfights — is here, plus stable 220–240 FPS even on an old rig.\n\nYes, it’s a mobile port, so the graphics are simpler and there are some bugs.  \nPersonally I have zero complaints about the visuals — in fast shooters these little things barely register: most people drop everything to minimum for maximum FPS anyway, and here you get perfect smoothness and responsiveness straight out of the box.\n\nNoticeable bugs:  \n• sometimes the enemy model is looking the wrong way while already shooting at you;  \n• in respawn modes (especially deathmatch) you get a short invincibility shield on spawn, but you can still shoot others. It feels weird: you can’t kill the freshly spawned guy, but he can kill you instantly. It would be much more logical if neither side could shoot until the shield drops.\n\nStill, the PC port turned out great: mouse+keyboard feel excellent, crossplay and voice chat work without issues.  \nIf you’re looking for a lightweight, fast-paced shooter with BR, deathmatch and other modes for chill evening sessions, and your PC no longer handles modern AAA titles — Blood Strike is an excellent choice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly optimized and fun to play with friends love it <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game . its like warzon but for the poor system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buen juego, es entretenido y mas si juegas con amigos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good response in my movements but UI kinda mid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "нормальная игра, мне нравится(пишу для прокачки значка)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fast pace TPP BR game, good to play along with your friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very entertaining to bully kids in a mobile video game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, smooth gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "rip off fn but better (not bc its in first person)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "need to update the battle pass sistem fr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is cool, but its very laggy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jogo excelente com uma fluidez de jogabilidade inovadora!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after faceit u loss all of your elo \r\nyes\r\nthise game  can help u",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W GAME NEEDS LESS MONETISASION BUT LOVE THE FEEL OF THE GAME AND THE MODDELS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY VERY VERY VERY VERY VERY VERY VERY VERY FUN AND I COOK LIKE CRAZY REALLY GOOD GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "too much effects like valorant",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good game like call of duty",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun shooter game similar to warzone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after 300h of playing i can say that its an fps shooter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is awsome the only issue is like im too good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game not bad but not good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "games alright, full of turd burglars tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great Fast gunplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS FUN AND ITS movement system is fluid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mostly recommended for low-end PC players",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every Fun Game With a Lot Free Stuff.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is at least better than Warzone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "codm but on pc, love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good but a lot of bots lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "max rank within 50 hours, nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game , nice game play absolutely nice game 💯",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun. I like killing ppl in game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "battle royale para pobres con pc culeras",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game to play sometimes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "yes, fix the mobile version vro, i can't move anything",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than cod warzone",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very nice game you should try",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Deceiving your playerbase with a collab that is region locked with no mention of it anywhere in your Global/English social media accounts for the entire marketing period and no official statements or FAQ or really any info  at all is not cool\n\nThis is genuinely upsetting news for me and other people who were looking forward to this, I would've loved to support them and show interest in this kind of collabs or events due to personal and sentimental reasons of mine and since I like and enjoy to some extents this game, but they couldn't even bother to let us know that most of us won't even get to enjoy it AT ALL (except for some in-match elements)",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Don't even bother trying to play this game. I thought it was a good game at first. But, it has to be filled with cheaters. People can kill you in less than a second, but it will take you almost five seconds to kill them! I'm so over it! Just trying to find a good and decent alternative to COD that doesn't cost me an arm and a leg. But, I suppose poor people have no good options",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "In the mobile version, movement is easier and it even has more abilities and better skins. This game is very bad on PC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is a copy of Apex with copy and past attatchments from Tarkov (the whole Sig Sauer thing), copy and paste font and item boxes (and sfx) from Warzone. It is a bunch of copy and paste this and that from almost every well performing shooter game...To top it off one of the characters is a rip off the DJ Llama skin from Fortnite ( I believe his name is Frank). Gameplay is fine and shooting mechanincs and physics are direct copies from Warzone as well. If you have a low spec computer though, this is pretty good. But come on, copy and pasting everything into one game..really..at least be a little original. Heck the after game results has the same zoom in animation from R6.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "straight up a mobile game on pc, events just suck ass and lets not talk about how the eva event is region locked after hyping it and calling it the ultimate \"event\" even tho its just another gacha BS",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the servers are beyond shit, the monetization system is incredibly greedy and predatory for a mobile game ported to pc and the replay system feels so flaw at this point it should be taken out all together. On your end it seems like you just got obliterated in half a second but in replay the opponent seem to one not even be aiming at you half the time but also taking there sweet time to kill you. All  in all the game has potential but is so majorly flawed even for being out for over a year.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its hard with only a yes or no but i think this is like a 3/5 game. while the game play is fun and smooth, there is a tone of bots that aren't programed very well. i literally saw like 6 bots run together in singles because they were trying to make zone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BloodStrike had potential, but the game feels rushed and unpolished. The servers are unstable, the matchmaking takes forever, and the hit-registration is totally inconsistent. The game is full of bugs, crashes randomly, and the optimization is terrible even on good PCs. On top of that, the gameplay feels unbalanced and pay-to-win, making it frustrating instead of fun. Definitely not worth the time right now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not the best game, copies some features from other games like the flex feature from valorant or a hud very similar to pubg mobile, wouldn't recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My experience with this game was honestly disappointing. I’m not sure where to start—either the cluttered lobby screen, which bombards you with too many details and colors, or the in-game graphics and awkward movement It all felt a bit overwhelming and poorly designed.\n\nThe only positive is that the game is free, but I wouldn’t recommend it to anyone unless you’re desperate for something to do… like, really desperate",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game with good mechanics but u are not rewarded for outplaying opponents, just add siphon on kill on BR and its good lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck ass game is so pay to win and the matchmaking is so fucking rigged fuck this shit ass 5 layer rip off of a cash grab",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im too good for this game its fun game only give negative rating because they are so driven on microtransaction they shove it in your face and also dont have a duos mode so im stuck in a sqaud of 4 when its me and my boy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NOT WORTH IT!\n\nAnother lagin no skill crossplay crap shooter. only playable if you are ruski or console. if you to crap for fortnite maybe this is your game. for the rest... not worth it!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s frustrating to see the gameplay experience constantly undermined by users resorting to cheats and other forms of unfair play. This situation not only disrupts competitive balance but also devalues the efforts of players who try to improve legitimately. Even more concerning is the apparent inaction from the company responsible, which gives the impression that it isn’t taking the firm measures needed to curb these practices. In my view, the developer lacks a more rigorous and transparent stance, both in detecting offenders and enforcing proper penalties.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is like buying property in communist china and being held to their rules. Nothing but chink hackers and spics. 1 out of every 100 players might speak Engerish.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game all round jus the aimbot mobile players have is a bit crazy gotta fix that shi",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I do not recommend you to play this game as if u want to spend money its rng based you are not getting your money worth for items/cosmetics in this game. The game was pretty fun when i was with friends playing it till further in the game you can see the lack of the development put into this such as the kill cams. When you die it looks like you die in seconds but when your shooting them it takes like 5 to 10 seconds to be able to kill them. This game is also filled with cheaters even if you report them the devs dont do anything about it. I saw they had a collab with EVA which im a huge fan of but for the collab you gotta spend real money for the collab cosmetics which i was kinda find with till i found out one you make one purchase its RNG, it does not give you the item you wanna pay for you gotta be lucky to roll on it which is not even worth it. This is just a whale grabber game so just don't waste your time on this shitty game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I heard of Bloodstrike after seeing a promotional video featuring Evangelion in the gameplay. Decided to get the game as I'm a lifelong Evangelion fan. The game was okay then I realized there is no Evangelion event or any info pertaining to it or lack of it in the game. This game is just a rip off of apex, both trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "average battle  royale game, but your enemy jump and slide all over the map. bullet spray is good, hit damage is good. you can spray and pray, burst, or tapping but your target move like out of physic rules.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Shit game for PC. Shout out to the mobile players though. Crashing everytime I aim at an enemy, 13th gen PC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has all the abandoned cheaters from COD who can't afford to buy more COD accounts.... \nI did a 1v1 against cheater without his cheats, he aims worse than bots..... no fun game in blood strike",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "welcome to Bloodstrike (SourceEngine0.5), it is ugly and has to much hyperaktiv russian pay-to-win spastis",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dog sh*t game where people are free to cheat and exploit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was fun for 30 mins. then you realize its all bots. gets boring fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not worth playing controller support doesn't work. the devs lied. warzone is better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Graphics are absolute trash there are tons of bugs all the people are bots mechanics are trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bullshit fuckass event system. netease you should pack the fuck up and leave",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just a super low quality better royale. Feels like a mobile game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad game with sh*t teammates and weapon balancing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is such wow.\nI mean lit like the meme \"67\"\nWhat's 9+10?\n21 \nExactly!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "chinese mobile game on pc, waste of time, download warzone",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pls dont play this is so Bad for real is full of bots",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "budget cod, filled with cheaters",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bruh, i'm newbie and game matching me with high rank player :))))",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont waste your time on this bullshit game like i did",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is like playing a tiktok video",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HAVE PLAYED FOR 9 H AND IT SAYS IT WORKS FOR CONTROLER AND DONT BUT IS A OK GAME TO PLAY ON KEYBORD AND MOUSE JUST TAKE A BIT TO GET USED TO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME CAN CRASH THE COMPUTER DO NOT PLAY IT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it looks like a unfinished game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "why so much god in this game ?, aimbot, wall hack like free fire lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst game I have ever played.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very clunky",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this shit game is ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bot Lobbies\r\nMobile Game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not accurate",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "how did they get neon gen in this game?????",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "لعبة زبالة شايليها من الموبايل وحاطيها بستيم",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont waste ur time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "wtf is this?! LOL XD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "peruanos",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "freefire",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "(English Version)\r\nTitle: A PC Whale’s Warning: I Spent $200 (800 PLN) and Deeply Regret It.\r\n\r\nI wanted to love Bloodstrike. The first 20 hours were a fantastic, fast-paced FPS experience on PC. Believing in the game's potential, I invested heavily—over 800 PLN (roughly $200) on skins and battle passes to support its development.\r\n\r\nAnd then, the game \"thanked\" me.\r\n\r\nAfter approximately 20 hours of play and significant financial investment, a switch flipped. The matchmaking system \"promoted\" me. I am now exclusively placed in lobbies filled with other paying players—hardcore \"whales\" and \"sweats.\" The problem? The overwhelming majority of them are on mobile.\r\n\r\nThis is where the game completely breaks down for a PC player.\r\n\r\nI tested the game on my own iPhone to confirm my suspicions: the mobile aim assist is not a \"helper\"; it is a borderline lock-on aimbot. It is absurdly strong, requires minimal skill, and completely invalidates the challenge of aiming.\r\n\r\nAs an average PC player—someone who enjoys the game but doesn't possess professional-level mouse mechanics—I am now cannon fodder. My skill with a mouse and keyboard stands zero chance against a system that snaps and sticks to targets automatically. This isn't a \"skill gap\"; it's a \"platform gap\" that you have intentionally designed.\r\n\r\nThe PC port is clearly an unpolished afterthought. It lacks the most basic, fundamental feature for any cross-platform shooter: THE ABILITY TO DISABLE CROSS-PLAY.\r\n\r\nYou have created a toxic \"Pay-to-Suffer\" dynamic. I paid you to support your game, and in return, you \"punished\" me by throwing me into unplayable lobbies where I am farmed by mobile players with built-in aimbots. It is frustrating, demoralizing, and disrespectful to your paying customers on PC.\r\n\r\nTo the Developers (NetEase): You must understand that you cannot treat your PC player base as second-class citizens. We are not here simply to be \"content\" for your mobile audience. Address the extreme aim assist imbalance and give PC players the option to opt out of cross-play. If you don't, you will lose your most financially invested players. I deeply regret my purchase.\r\n\r\n(Polish Version)\r\nTytuł: Wydałem 800 zł i żałuję. Ostrzeżenie od gracza PC.\r\n\r\nPoczątkowo \"Bloodstrike\" wydawał się rewelacją. Dynamiczna, szybka strzelanka z ogromnym potencjałem. Chcąc w pełni cieszyć się grą i wspierać twórców, zainwestowałem w nią ponad 800 złotych na skórki i przepustki bitewne. Pierwsze 20 godzin było fantastyczne – czysta, zbalansowana rozgrywka.\r\n\r\nNiestety, po tym czasie coś pękło. Jak za dotknięciem magicznej różdżki, matchmaking gry \"awansował\" mnie do zupełnie innej ligi. Zostałem wrzucony do lobby, w którym każdy gracz, podobnie jak ja, ma kupione drogie skórki. Problem w tym, że 90% tych graczy to użytkownicy mobilni.\r\n\r\nI tu zaczyna się dramat gracza PC.\r\n\r\nJako osoba, która gra na komputerze, ale nie posiada umiejętności na poziomie e-sportowym, stałem się darmowym celem. Sprawdziłem to osobiście na moim iPhonie – asysta celowania (aim assist) w wersji mobilnej jest absolutnie absurdalna. To nie jest \"wspomaganie\", to jest w zasadzie legalny \"aimbot\", który przykleja celownik do przeciwnika.\r\n\r\nW rezultacie, moje starcia z \"profesjonalistami\" na telefonach są z góry przegrane. Moja mechaniczna precyzja na myszce nie ma żadnych szans w starciu z systemem, który wykonuje całą pracę za gracza mobilnego. Gra na PC jest ewidentnie niedopracowana i brakuje jej kluczowej, fundamentalnej opcji: możliwości wyłączenia cross-playu.\r\n\r\nStworzyliście toksyczny system \"Pay-to-Suffer\" (Zapłać, by Cierpieć). Zapłaciłem wam duże pieniądze, a wy w zamian \"ukaraliście\" mnie, wrzucając do lobby, w którym nie jestem w stanie konkurować. To jest nieuczciwe, frustrujące i sprawia, że głęboko żałuję każdej wydanej złotówki.\r\n\r\nDo deweloperów: Musicie zrozumieć, że nie możecie traktować graczy PC jak obywateli drugiej kategorii, którzy służą tylko jako mięso armatnie dla waszej bazy graczy mobilnych. Jeśli natychmiast nie zajmiecie się balansem asysty celowania i nie dacie nam możliwości wyboru, z kim gramy, stracicie najbardziej zaangażowanych (i płacących) klientów.",
      "voted_up": false,
      "votes_helpful": 104
    },
    {
      "review": "WARNING.\nAfter installing and starting the game, the games .exe will access and download private files from your Onedrive account.\nThis game is MALWARE. Avoid at all cost.",
      "voted_up": false,
      "votes_helpful": 195
    },
    {
      "review": "THIS IS A CHINESE MALWARE SPREADER STAY FAR AWAY !!! my anti virus picked up a torjan when i started the game never have i exited quicker",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "Deceiving your playerbase with a collab that is region locked with no mention of it anywhere in your Global/English social media accounts for the entire marketing period and no official statements or FAQ or really any info  at all is not cool\n\nThis is genuinely upsetting news for me and other people who were looking forward to this, I would've loved to support them and show interest in this kind of collabs or events due to personal and sentimental reasons of mine and since I like and enjoy to some extents this game, but they couldn't even bother to let us know that most of us won't even get to enjoy it AT ALL (except for some in-match elements)",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Don't even bother trying to play this game. I thought it was a good game at first. But, it has to be filled with cheaters. People can kill you in less than a second, but it will take you almost five seconds to kill them! I'm so over it! Just trying to find a good and decent alternative to COD that doesn't cost me an arm and a leg. But, I suppose poor people have no good options",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "I might still give this game a chance but I feel like this game wont be around in a year or two.It kinda reminds me of super mecha champs. Which died for the same reason.. Low player counts and the devs making bots act like players plus massive cash shop. It's also weird that like the bread and butter of cash shops are cosmetics and.. they all suck.\n\nThere's also this system of paying for their game to auto slot best in slot attachments you have unlocked for you... Like really? We're monetizing equipment optimization? A basic feature that like RPGMaker games have? lol wtf? Just wtf?\n\nedit: alright I gave it another go till i could enable global chat. As the community responded it's \"all bots until higher levels so you can level up guns..\" Ok how about we do away with gun leveling advancement and just let people customize out the gate and just limit it to heroes eh? Cause this false sense of skill trap that baits players into a sunk cost fallacy is predatory.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "pretty shit game full with micro transactions and has shit voice acting. \nit can be pretty fun tho cuz it is a really easy game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is a copy of Apex with copy and past attatchments from Tarkov (the whole Sig Sauer thing), copy and paste font and item boxes (and sfx) from Warzone. It is a bunch of copy and paste this and that from almost every well performing shooter game...To top it off one of the characters is a rip off the DJ Llama skin from Fortnite ( I believe his name is Frank). Gameplay is fine and shooting mechanincs and physics are direct copies from Warzone as well. If you have a low spec computer though, this is pretty good. But come on, copy and pasting everything into one game..really..at least be a little original. Heck the after game results has the same zoom in animation from R6.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "juego re muerto, tarda 10 horas en emparejarte una partida sin clasificatoria xd",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For the gameplay itself, it’s actually decent, but vehicles still feel very stiff and practically useless in matches — this area needs a lot of improvement.\n\nDuring my 0.6 hours of playtime, I also encountered a bug/unfinished feature: when using a macro auto-click, every weapon I used suddenly had zero recoil. I’ve seen the exact same issue in another legendary battle royale game, but their developers fixed it within less than a week after release. I was honestly surprised that despite this game being out for several months, such a fundamental exploit still hasn’t been fixed or even noticed by the developers.\n\nAt this point, I’m still hesitant about recommending the game. But based on my overall experience, for now, I’d lean towards not recommending it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My computer is  very strong, as in Running remastered crysis in Can you run Crysis mode , no problem.\r\nThis game is so poorly optimized , from times to times i have like 3 fps when other time 120. \r\nSometimes the aim moves stupidly fast, sometimes barely at all. Dont bother until they fix a lot of thing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Top comment says this i malware, and after mistakingly downloading it before reading the reviews, I can say that's very believable considering there way literally 0 real players, and everything just seemed designed to make you give them money. Hopefully it doesn't damage my computer too bad, uninstalled the moment I went back to the reviews and saw that people said it's basically just made to hack your computer.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The worst game of all time. Its not balanced. The bloodstrike team really doesn't care about adding a anti cheat into their game. Hackers are all around most likely in ranked! They let US do the job and catch them for some reason. And if you catch a cheater and gets banned, all they give you is 1 token for more xp. Like are we serious? And also the rank is not balanced at all, it just throws you random players that are 10x better than you, and they call this \"ranked\". Avoid this game at all costs. Its really not worth playing. The game still needs work, but as i see, they are way to lazy for this. All they want is your money. And also, let me not forget on how p2w this game really is. Skins costs way to much money, for example it can reach 1000$ just to obtain a skin for your favourite weapon. Just no. Way to much gatcha is around. Cash grab game...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "straight up a mobile game on pc, events just suck ass and lets not talk about how the eva event is region locked after hyping it and calling it the ultimate \"event\" even tho its just another gacha BS",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the servers are beyond shit, the monetization system is incredibly greedy and predatory for a mobile game ported to pc and the replay system feels so flaw at this point it should be taken out all together. On your end it seems like you just got obliterated in half a second but in replay the opponent seem to one not even be aiming at you half the time but also taking there sweet time to kill you. All  in all the game has potential but is so majorly flawed even for being out for over a year.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Literally a chinese ripoff of warzone. If you want a free shitty version of it go ahead I guess",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Full of bugs and cheater. Needs to be optimized more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its hard with only a yes or no but i think this is like a 3/5 game. while the game play is fun and smooth, there is a tone of bots that aren't programed very well. i literally saw like 6 bots run together in singles because they were trying to make zone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BloodStrike had potential, but the game feels rushed and unpolished. The servers are unstable, the matchmaking takes forever, and the hit-registration is totally inconsistent. The game is full of bugs, crashes randomly, and the optimization is terrible even on good PCs. On top of that, the gameplay feels unbalanced and pay-to-win, making it frustrating instead of fun. Definitely not worth the time right now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In the mobile version, movement is easier and it even has more abilities and better skins. This game is very bad on PC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not the best game, copies some features from other games like the flex feature from valorant or a hud very similar to pubg mobile, wouldn't recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My experience with this game was honestly disappointing. I’m not sure where to start—either the cluttered lobby screen, which bombards you with too many details and colors, or the in-game graphics and awkward movement It all felt a bit overwhelming and poorly designed.\n\nThe only positive is that the game is free, but I wouldn’t recommend it to anyone unless you’re desperate for something to do… like, really desperate",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game with good mechanics but u are not rewarded for outplaying opponents, just add siphon on kill on BR and its good lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck ass game is so pay to win and the matchmaking is so fucking rigged fuck this shit ass 5 layer rip off of a cash grab",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im too good for this game its fun game only give negative rating because they are so driven on microtransaction they shove it in your face and also dont have a duos mode so im stuck in a sqaud of 4 when its me and my boy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NOT WORTH IT!\n\nAnother lagin no skill crossplay crap shooter. only playable if you are ruski or console. if you to crap for fortnite maybe this is your game. for the rest... not worth it!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s frustrating to see the gameplay experience constantly undermined by users resorting to cheats and other forms of unfair play. This situation not only disrupts competitive balance but also devalues the efforts of players who try to improve legitimately. Even more concerning is the apparent inaction from the company responsible, which gives the impression that it isn’t taking the firm measures needed to curb these practices. In my view, the developer lacks a more rigorous and transparent stance, both in detecting offenders and enforcing proper penalties.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is like buying property in communist china and being held to their rules. Nothing but chink hackers and spics. 1 out of every 100 players might speak Engerish.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game all round jus the aimbot mobile players have is a bit crazy gotta fix that shi",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I do not recommend you to play this game as if u want to spend money its rng based you are not getting your money worth for items/cosmetics in this game. The game was pretty fun when i was with friends playing it till further in the game you can see the lack of the development put into this such as the kill cams. When you die it looks like you die in seconds but when your shooting them it takes like 5 to 10 seconds to be able to kill them. This game is also filled with cheaters even if you report them the devs dont do anything about it. I saw they had a collab with EVA which im a huge fan of but for the collab you gotta spend real money for the collab cosmetics which i was kinda find with till i found out one you make one purchase its RNG, it does not give you the item you wanna pay for you gotta be lucky to roll on it which is not even worth it. This is just a whale grabber game so just don't waste your time on this shitty game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I heard of Bloodstrike after seeing a promotional video featuring Evangelion in the gameplay. Decided to get the game as I'm a lifelong Evangelion fan. The game was okay then I realized there is no Evangelion event or any info pertaining to it or lack of it in the game. This game is just a rip off of apex, both trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game sucks. it FEELS like a cash grab (because it probably is) made for a mobile game ported to pc. and the characters say random nonsense every thing they do. walk, shoot, reload, you name it. and the first thing that caught my eye is that they LITREALLY stole the pistol animation from cod warzone or any new cod game.  so dont get this game. waste of storage. 2/10. 2 for effort.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Greed Ruined this game. Optimization is a**. This game worked fine before and after adding so many skins this is not playable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit game for PC. Shout out to the mobile players though. Crashing everytime I aim at an enemy, 13th gen PC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has all the abandoned cheaters from COD who can't afford to buy more COD accounts.... \nI did a 1v1 against cheater without his cheats, he aims worse than bots..... no fun game in blood strike",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "welcome to Bloodstrike (SourceEngine0.5), it is ugly and has to much hyperaktiv russian pay-to-win spastis",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dog sh*t game where people are free to cheat and exploit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was fun for 30 mins. then you realize its all bots. gets boring fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Graphics are absolute trash there are tons of bugs all the people are bots mechanics are trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just a super low quality better royale. Feels like a mobile game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad game with sh*t teammates and weapon balancing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is such wow.\nI mean lit like the meme \"67\"\nWhat's 9+10?\n21 \nExactly!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "chinese mobile game on pc, waste of time, download warzone",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pls dont play this is so Bad for real is full of bots",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "budget cod, filled with cheaters",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bruh, i'm newbie and game matching me with high rank player :))))",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}