{
  "positive": [
    {
      "review": "Okay, I’ll tell you about this Everlusting Life. The game is like... well, like, you live there, short. Not in the sense that you live, but in the game. And there you have to do everything, so as to prolong life. Well, like, eternal life, right?\n\nAt first everything seems normal, you can create a character, whatever you want, the appearance, everything. Then you’re thrown into the world, and you kind of have to develop. Collect things, crypt, well, like everywhere now. There are also relationships, like, with other characters. You can be friends, you can be, you know, romantic things. It’s cool that you don’t just run around and fuck everybody.\n\nBut what really bothers me is that you have to do things all the time. You can’t just relax. This is the end of your life, then you’re hungry or whatever. And this is \"eternal life\" that doesn’t feel very good when you are constantly under such stress. Although, maybe it’s a concept that even in eternal life there are problems.\n\nThe graphics are kind of normal, not top, but they don’t suck. The music is like that, background, it doesn’t hurt. But here’s the gameplay... it’s like, you know, uniform sometimes. You run, collect, do, run again. If you like this grind, then you will get it. And if you want something like that, just wow, probably not here.\n\nIn short, the game is about survival and development, with elements of relationships. If you like to dig into the game for a long time and are not afraid of routine, then try it. And I have not yet understood whether it is mine or not. But, like, not too bad. There is potential, but also enough weed. That’s how.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Love it. Clean graphics and good progress in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok ok ok good game 2 problems tho 1: no blu pyro from \nTF2 2:no giantess\nalso game dev if you see this make it free if you dont mind good game overall respect to the dev",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who spent hours and hours on this  spectacular game that I've been lucky to come across and experience. Not only is there massive anime biggly tigglies, but the strategic and puzzling tactics have increased my IQ and my sex drive. This game complements the contrast between hentai and actual game play as perfect as you can get it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Everyone that is complaining about the game being pay to win, I sort of agree. However, it is not impossible to rank up without spending money. You need to grind, keep the game open on a second monitor! I use this game as an \"AFK\" game and letting it run its course. Yes, it is annoying that you constantly die to people who may have a higher ranking than you, but that's just apart of the game. \r\n\r\nDon't spend money if you don't want to, however I would recommend against spending any money on this game at all due to the poor value of items given for the price rage they're asking for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The reviews for this game are HARSH.\nIt is a free game to begin with so there's little to no buy-in risk...\nThe art is great and the factions are cool. The gameplay can get repetitive but at that point I'll quit for the night and call it a day. \nThere are multiple \"game modes\" (still battles, rules change) including a dungeon mode that has rogue-like ability aspects, and tournaments that can be pretty fun.\nAs for \"pay-to-win\"... sure you can spend a hundred bucks on crap you could unlock over time, but don't most games do that these days anyway?\nI've never paid to play this game, and I've never NEEDED to... \nMy girls are well leveled up, and I have over a million gold (that's a LOT) so just play it already! \n\nTLDR\nIf you want a fun time waster with some erotic elements, check the game out.\nThere aren't ads per se, but feels like every time I navigate to a new menu it will try to sell me currency or some junk, but I got used to dismissing them 😬\nIf you want instant access to hardcore h-content then maybe look elsewhere?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, not pay to win you just have to play more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, lots of tactics and you don't have to pay to win.  Of course you can to advance faster, but you can grind it out and not spend a dollar.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good shit a little bit to much pay to win at the start but farming in auto is super op for catch up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun game, where you don't have to pay to play.  It is easier if you do though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not that bad at all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i lub it my favorite game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "better TFT that league",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So Fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More Balance than Riot's TFT",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best Game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's fun and easy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing tbh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wow!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tuff",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like how most of the reviewers pretend you aren't playing against bots. 100% of the time. well played steam reviewers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please reward this comment. I still have 3000 points left to buy those slut avatars and backgrounds. Give me thumbs up, and you will grow 3cm. Reward this and you will grow 30cm.\n.⠄⠄⣿⣿⣿⣿⠘⡿⢛⣿⣿⣿⣿⣿⣧⢻⣿⣿⠃⠸⣿⣿⣿⠄⠄⠄⠄⠄\n⠄⠄⣿⣿⣿⣿⢀⠼⣛⣛⣭⢭⣟⣛⣛⣛⠿⠿⢆⡠⢿⣿⣿⠄⠄⠄⠄⠄\n⠄⠄⠸⣿⣿⢣⢶⣟⣿⣖⣿⣷⣻⣮⡿⣽⣿⣻⣖⣶⣤⣭⡉⠄⠄⠄⠄⠄\n⠄⠄⠄⢹⠣⣛⣣⣭⣭⣭⣁⡛⠻⢽⣿⣿⣿⣿⢻⣿⣿⣿⣽⡧⡄⠄⠄⠄\n⠄⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣶⣌⡛⢿⣽⢘⣿⣷⣿⡻⠏⣛⣀⠄⠄\n⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠙⡅⣿⠚⣡⣴⣿⣿⣿⡆⠄\n⠄⠄⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠄⣱⣾⣿⣿⣿⣿⣿⣿⠄\n⠄⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⣿⠄\n⠄⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠣⣿⣿⣿⣿⣿⣿⣿⣿⣿⠄\n⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠑⣿⣮⣝⣛⠿⠿⣿⣿⣿⣿⠄\n⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠄",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "Okay, I’ll tell you about this Everlusting Life. The game is like... well, like, you live there, short. Not in the sense that you live, but in the game. And there you have to do everything, so as to prolong life. Well, like, eternal life, right?\n\nAt first everything seems normal, you can create a character, whatever you want, the appearance, everything. Then you’re thrown into the world, and you kind of have to develop. Collect things, crypt, well, like everywhere now. There are also relationships, like, with other characters. You can be friends, you can be, you know, romantic things. It’s cool that you don’t just run around and fuck everybody.\n\nBut what really bothers me is that you have to do things all the time. You can’t just relax. This is the end of your life, then you’re hungry or whatever. And this is \"eternal life\" that doesn’t feel very good when you are constantly under such stress. Although, maybe it’s a concept that even in eternal life there are problems.\n\nThe graphics are kind of normal, not top, but they don’t suck. The music is like that, background, it doesn’t hurt. But here’s the gameplay... it’s like, you know, uniform sometimes. You run, collect, do, run again. If you like this grind, then you will get it. And if you want something like that, just wow, probably not here.\n\nIn short, the game is about survival and development, with elements of relationships. If you like to dig into the game for a long time and are not afraid of routine, then try it. And I have not yet understood whether it is mine or not. But, like, not too bad. There is potential, but also enough weed. That’s how.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "I came for the porn. Stayed for the porn, and deliberately deprived myself of any and all dopamine I could have gained from the actual gameplay to ensure the highs from the porn are just that much better...\n\n\n\n\nI may or may not have a problem...",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This a fun game as long as you don't feel the need to complete it all in a week - else you will be spending a lot of money! Don't get too serious and it's good fun and enjoyable.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Was mining for coal and struck gold reminds me of the \"its a porn game\" when i was playing at my public university library and someone asked what I was playing i simply told him the greatest game of all time packed up my bags and left.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "As someone who spent hours and hours on this  spectacular game that I've been lucky to come across and experience. Not only is there massive anime biggly tigglies, but the strategic and puzzling tactics have increased my IQ and my sex drive. This game complements the contrast between hentai and actual game play as perfect as you can get it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ok ok ok good game 2 problems tho 1: no blu pyro from \nTF2 2:no giantess\nalso game dev if you see this make it free if you dont mind good game overall respect to the dev",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everyone that is complaining about the game being pay to win, I sort of agree. However, it is not impossible to rank up without spending money. You need to grind, keep the game open on a second monitor! I use this game as an \"AFK\" game and letting it run its course. Yes, it is annoying that you constantly die to people who may have a higher ranking than you, but that's just apart of the game. \r\n\r\nDon't spend money if you don't want to, however I would recommend against spending any money on this game at all due to the poor value of items given for the price rage they're asking for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "own the full achievements system, the CG would unlock when you got it from the box, you only need the energy points to unlock the CG, not the best and the play part are pretty standard  mobile game, the pvp content are laughable bad, in total this thing worth a few shot of you times after that and you watched done the you could move on into next game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is one of the best games I played - lots of creativity - lots of new girls all the time - no time to get bored - everything keeps sexy and fresh and you don't have to wait for ages before seeing new things - I didn't get bored even for 2 minutes - People who don't like the game, maybe this specific type is not for them - but this is an adult game - with most other games you have to wait for =ages= before you see anything new & sexy - but this... this is gold!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly i wasn’t sure what to expect, but Everlusting Life completely surprised me. The art style is gorgeous and the characters actually feel like they have depth. The story pulled me in more than I thought it would, and I found myself coming back just to see what happens next and to unlock more. Definitely worth checking out if you’re into narrative-driven games with horniness.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The reviews for this game are HARSH.\nIt is a free game to begin with so there's little to no buy-in risk...\nThe art is great and the factions are cool. The gameplay can get repetitive but at that point I'll quit for the night and call it a day. \nThere are multiple \"game modes\" (still battles, rules change) including a dungeon mode that has rogue-like ability aspects, and tournaments that can be pretty fun.\nAs for \"pay-to-win\"... sure you can spend a hundred bucks on crap you could unlock over time, but don't most games do that these days anyway?\nI've never paid to play this game, and I've never NEEDED to... \nMy girls are well leveled up, and I have over a million gold (that's a LOT) so just play it already! \n\nTLDR\nIf you want a fun time waster with some erotic elements, check the game out.\nThere aren't ads per se, but feels like every time I navigate to a new menu it will try to sell me currency or some junk, but I got used to dismissing them 😬\nIf you want instant access to hardcore h-content then maybe look elsewhere?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everlasting Life offers an exhilarating PvP experience that truly stands out. The combat mechanics are smooth and engaging, making every encounter feel intense and rewarding. The game’s PvP system is well-designed, providing players with a fair and competitive environment that keeps you coming back for more.\r\n\r\nOne of the highlights is how balanced the characters are. The developers have done an excellent job ensuring that no single character dominates the meta, allowing for a diverse range of strategies and playstyles. This balance makes every match unpredictable and exciting, catering to both casual players and hardcore strategists.\r\n\r\nThe rank system is another strong point. It’s thoughtfully implemented, giving players a clear sense of progression and achievement. Climbing the ranks feels rewarding, and the competitive ladder adds a layer of motivation to improve your skills and showcase your prowess.\r\n\r\nHowever, the story mode leaves much to be desired. Unfortunately, it’s pretty boring and lacks depth, primarily consisting of adult content that doesn’t offer much in terms of engaging narrative or meaningful gameplay. If you're looking for a compelling story or immersive lore, this aspect of Everlasting Life might disappoint.\r\n\r\nOverall, if you're after fantastic PvP battles, balanced characters, and a satisfying rank system, Everlasting Life delivers. But if you're seeking a captivating story mode, you might find it lacking.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I honestly love this game, coming from chick wars to this, now me and my wife both play this. Great Job devs!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First up: Is this a Gooner Game?\r\nYes. Everlusting Life proudly wears this fact on it's impossibly elastic bikini top.\r\n\r\nSecond: Is this a Good *Game*?\r\nYes. It actually is a well-designed and fun stack of mechanics and gameplay. \r\n\r\nHere's how it works. You go into battle, and you are given a couple coins and four cards. Each card is a character, and each has a cost in coins to place on the field. You can also pay coins to either redraw your hand or expand the number of characters you can have on the field at once. You can also have up to five characters on the sideline, waiting. Every round you get more coins (more if you win the round, but you still get some if you lose), and a new hand of cards (you can 'lock' your hand to retain some cards if you want). If you play the same card multiple times, the character goes up in 'stars', boosting their stats. 2 cards, 2 stars, 4 cards, 3 stars, etc. You don't directly command the characters while the round of fighting is happening, they are autonomous during the brawl. But you do decide who is on the field and where they stand when the fight starts. The winner of the round inflicts damage to the opposing player based on the survivors of the fight. Six players per match, rounds are 1v1 round-robin style, fight to last standing.\r\n\r\nBut the engaging part is that every character is unique. Each has a faction and a class, and multiple characters of the same faction or class can bring bonuses on the field. Each character also has a unique ability that only she has. More powerful characters cost more coins to play. Each character also has development, with experience levels (bought by 'souls', fragments you gain from the gatcha), arcane (bought by 'potions' made in your city), and relationship (bought with 'books' as gifts). So you end up wanting to work with characters you've spent a lot of resources in, but there's no guarantee that they'll show up in your hand so you tend to spread it around.\r\n\r\nAnd finally, while gamers will argue balance in every game with such complex systems until the heat death of the universe, the game is really well-balanced, even when subject to so much random. I've been steamrolled in matches, and I've been the one steamrolling. I've seen opponents go the entire match at full health and seen players in sixth place with 1hp and a dream win the whole match. I've seen rosters smash me into the dirt by vastly outleveling me, and I've seen high-level teams lose miserably. All of this does happen, and it's because the game is so well designed that it's all allowed to happen organically.\r\n\r\nAnd hey, if you don't want to engage, there's also an Auto function. It's not even close to perfect, but it is at least competent.\r\n\r\nTL;DR, An enjoyably fun auto-battler with a well-balanced game system that sadly is not as populated as it should be because \"Gooner Game\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game, most the ppl crying about pay to win literally dont know what pay to win even means... there is very little vs content in the game, its primarily pve so the entire wah wah wah more tears p2w whining is just a bunch of f-ing whining...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came for the boobs, stayed for the strategy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game, not pay to win you just have to play more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, lots of tactics and you don't have to pay to win.  Of course you can to advance faster, but you can grind it out and not spend a dollar.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i played even though a lot of people left bad feed.\r\ni'll admit it's a bit slow to start, but the art is nice and the gameplay not to boring after you unlock enough girls that actual tactics can be a thing.\r\nhungry for money as every other game of this type, but so long as you want to enjoy the slow growth it's a thumb up from me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "还不错，立绘做的是非常精致也非常漂亮，玩法有点单薄，特别是主要pvp，没有资源就卡住了，然后只能冲，这让游戏很受限，建议可以学习学习热门二次元网游，就是资源不卡人，卡的是更精致和更瑟瑟的剧情和立绘，不要太急于获利，可以发挥艺术优势来让小头玩家乖乖充钱。\n另外，好友邀请码可以用一个【GKZMSP】，能得到一些资源祝您一臂之力。\nGet some gifts，Code：GKZMSP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is good, but it is a gatcha game. so take that as you will. mainly PvP and unlocking more characters requires ranked pvp or gatcha pulls.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very fun, and the girls are all very hot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good shit a little bit to much pay to win at the start but farming in auto is super op for catch up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for goon but not game play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun game, where you don't have to pay to play.  It is easier if you do though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very family friendly pls play with kids",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you really like some 18+ games this is up your alley",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wish they would add a increased speed option when fighting",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "parents, check your kids computer.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "pretty fun once you get the hang of it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fajna gra zwalilem konika polecam",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "kind of whatever good pass time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its so goon\n- little diddy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not that bad at all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i lub it my favorite game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "чем чаще я в это играю тем дальше я от бога",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better TFT that league",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "excellent minge availability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So Fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More Balance than Riot's TFT",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "easy game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun and easy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it. Its fun to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing tbh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wow!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tuff",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like how most of the reviewers pretend you aren't playing against bots. 100% of the time. well played steam reviewers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please reward this comment. I still have 3000 points left to buy those slut avatars and backgrounds. Give me thumbs up, and you will grow 3cm. Reward this and you will grow 30cm.\n.⠄⠄⣿⣿⣿⣿⠘⡿⢛⣿⣿⣿⣿⣿⣧⢻⣿⣿⠃⠸⣿⣿⣿⠄⠄⠄⠄⠄\n⠄⠄⣿⣿⣿⣿⢀⠼⣛⣛⣭⢭⣟⣛⣛⣛⠿⠿⢆⡠⢿⣿⣿⠄⠄⠄⠄⠄\n⠄⠄⠸⣿⣿⢣⢶⣟⣿⣖⣿⣷⣻⣮⡿⣽⣿⣻⣖⣶⣤⣭⡉⠄⠄⠄⠄⠄\n⠄⠄⠄⢹⠣⣛⣣⣭⣭⣭⣁⡛⠻⢽⣿⣿⣿⣿⢻⣿⣿⣿⣽⡧⡄⠄⠄⠄\n⠄⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣶⣌⡛⢿⣽⢘⣿⣷⣿⡻⠏⣛⣀⠄⠄\n⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠙⡅⣿⠚⣡⣴⣿⣿⣿⡆⠄\n⠄⠄⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠄⣱⣾⣿⣿⣿⣿⣿⣿⠄\n⠄⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⣿⠄\n⠄⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠣⣿⣿⣿⣿⣿⣿⣿⣿⣿⠄\n⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠑⣿⣮⣝⣛⠿⠿⣿⣿⣿⣿⠄\n⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠄",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "I came for the porn. Stayed for the porn, and deliberately deprived myself of any and all dopamine I could have gained from the actual gameplay to ensure the highs from the porn are just that much better...\n\n\n\n\nI may or may not have a problem...",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Okay, I’ll tell you about this Everlusting Life. The game is like... well, like, you live there, short. Not in the sense that you live, but in the game. And there you have to do everything, so as to prolong life. Well, like, eternal life, right?\n\nAt first everything seems normal, you can create a character, whatever you want, the appearance, everything. Then you’re thrown into the world, and you kind of have to develop. Collect things, crypt, well, like everywhere now. There are also relationships, like, with other characters. You can be friends, you can be, you know, romantic things. It’s cool that you don’t just run around and fuck everybody.\n\nBut what really bothers me is that you have to do things all the time. You can’t just relax. This is the end of your life, then you’re hungry or whatever. And this is \"eternal life\" that doesn’t feel very good when you are constantly under such stress. Although, maybe it’s a concept that even in eternal life there are problems.\n\nThe graphics are kind of normal, not top, but they don’t suck. The music is like that, background, it doesn’t hurt. But here’s the gameplay... it’s like, you know, uniform sometimes. You run, collect, do, run again. If you like this grind, then you will get it. And if you want something like that, just wow, probably not here.\n\nIn short, the game is about survival and development, with elements of relationships. If you like to dig into the game for a long time and are not afraid of routine, then try it. And I have not yet understood whether it is mine or not. But, like, not too bad. There is potential, but also enough weed. That’s how.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "This a fun game as long as you don't feel the need to complete it all in a week - else you will be spending a lot of money! Don't get too serious and it's good fun and enjoyable.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Was mining for coal and struck gold reminds me of the \"its a porn game\" when i was playing at my public university library and someone asked what I was playing i simply told him the greatest game of all time packed up my bags and left.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Love it. Clean graphics and good progress in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok ok ok good game 2 problems tho 1: no blu pyro from \nTF2 2:no giantess\nalso game dev if you see this make it free if you dont mind good game overall respect to the dev",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who spent hours and hours on this  spectacular game that I've been lucky to come across and experience. Not only is there massive anime biggly tigglies, but the strategic and puzzling tactics have increased my IQ and my sex drive. This game complements the contrast between hentai and actual game play as perfect as you can get it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Everyone that is complaining about the game being pay to win, I sort of agree. However, it is not impossible to rank up without spending money. You need to grind, keep the game open on a second monitor! I use this game as an \"AFK\" game and letting it run its course. Yes, it is annoying that you constantly die to people who may have a higher ranking than you, but that's just apart of the game. \r\n\r\nDon't spend money if you don't want to, however I would recommend against spending any money on this game at all due to the poor value of items given for the price rage they're asking for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "own the full achievements system, the CG would unlock when you got it from the box, you only need the energy points to unlock the CG, not the best and the play part are pretty standard  mobile game, the pvp content are laughable bad, in total this thing worth a few shot of you times after that and you watched done the you could move on into next game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is one of the best games I played - lots of creativity - lots of new girls all the time - no time to get bored - everything keeps sexy and fresh and you don't have to wait for ages before seeing new things - I didn't get bored even for 2 minutes - People who don't like the game, maybe this specific type is not for them - but this is an adult game - with most other games you have to wait for =ages= before you see anything new & sexy - but this... this is gold!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The reviews for this game are HARSH.\nIt is a free game to begin with so there's little to no buy-in risk...\nThe art is great and the factions are cool. The gameplay can get repetitive but at that point I'll quit for the night and call it a day. \nThere are multiple \"game modes\" (still battles, rules change) including a dungeon mode that has rogue-like ability aspects, and tournaments that can be pretty fun.\nAs for \"pay-to-win\"... sure you can spend a hundred bucks on crap you could unlock over time, but don't most games do that these days anyway?\nI've never paid to play this game, and I've never NEEDED to... \nMy girls are well leveled up, and I have over a million gold (that's a LOT) so just play it already! \n\nTLDR\nIf you want a fun time waster with some erotic elements, check the game out.\nThere aren't ads per se, but feels like every time I navigate to a new menu it will try to sell me currency or some junk, but I got used to dismissing them 😬\nIf you want instant access to hardcore h-content then maybe look elsewhere?",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "positves\nadult game with beautiful anime girls\n\ncons\nthey used AI to help make game i think more then what they say as more characters are coming out so quickly\nwallet warrior\nmatches on higher level are rigged for the wallet warriors\ngrindy which can use money to speed up\nthe energy is used to help get people to pay since its so slow\nthe DLC price is insanely high for only gettings like 1$ or 2$ worth when over priced",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "You cannot go one page in this game without getting slapped in the face with a pop up or battle pass, or shop asking for 9.99 19.99 49.99 or more. It takes more than ten minutes just to go through every page to get rid of the annoying red marks. Every time you finish a match you're asked to spend money, every time you go to any menu, you're asked to spend money. Im done. Im so freaking tired of trying to play a game and being bombarded.\n\nNot even going into the bs \"players\" *cough* ai *cough* \n\nMassively pay to win, and when you pay, you just advance until you dont win again.\n\nIf you see this review, run. Leave this game to rot.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Highly predatory gacha game, that requires a lot of money to play with little reward.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "so the game is overrall pay-to-win. the artstyle is amazing and the character designs are awesome but it's just impossible to progress after you get Doe-X rank without paying money.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game suffers from the typical free to play gatcha curse of putting you on a power trip the first day and then MONTHS of losing to pay to win players.\n\nIf you're looking for a game to just log into once a day and upkeep some characters by VERY small increments then download this game. If not, avoid at all costs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I should not have to keep pumping money into your A.I. model just to progress. There is no actual effort put into development of this game, clearly A.I. is the main tool used. So the developer's are pocketing everything. I HATE GREED!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Progression in this game is non-existant. Fights feel the same on all levels.\r\n\r\nVisuals are good tho.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game and at first you can make steady progress, but they try to make you pay for about everything after that. Most add-ons are $50. I would rather buy a game in it's enterity and then be able to enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is clearly pay to win. If you got money go for it. But over all this is a shit game.  got keep buying stuff in order to win.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "waste of time, the game is rigged, pay-to-win",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just playing because of nice pics XD",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Badly designed. Money trap. Not sexy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst pay to win game I've seen so far.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Big boob but no money for big boob :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you're here just for some anime tiddies, I'm not going to stop you...but if you're here because you're desperate for a new autochess game, turn back now. I'm serious. Sure, you've probably seen all the negative reviews about the game being pay-to-win (and they're all true), but it's more than just that. This game is fundamentally broken.\n\nIn a \"normal\" autochess game, like Dota Underlords or Teamfight Tactics, it's very important that the roster of characters is fairly well balanced. It's not an exaggeration to say that these types of games can live or die based on balance, and the devs often make frequent small tweaks to keep everything in line. Even a slightly OP unit or faction can dominate a meta, while a slightly underpowered one might rarely get picked at all. These games are all about managing RNG and adapting to what the draft is giving you, and things need to be balanced well enough so that if the game seems to be steering you in a certain direction in any given match, you can roll with it and put together a viable strategy.\n\nNot here, though, because *these* devs did the totally cool and sensible thing of combining an autochess game with a gacha. How does that affect the gameplay? Well, let's say you're in a match and the RNG seems to be giving you tons of units from the demon faction. In a regular autochess game, that's great; looks like you're playing demons this game, and you can probably make it work. But here...oh...most of your demon units aren't a very high level, because you didn't happen to pull enough copies of them in the gacha. Or maybe you did, but you didn't have enough gold to level them, since you didn't spend any real money on it and you were stretched too thin. Or maybe there are certain key units that you don't even have at all, because you never pulled them...but there they are anyway in the draft pool, just \"locked\", clogging up a spot. You can see where I'm going with this.\n\nIf that weren't enough, this game does something else that's genuinely one of the scummiest things I've ever seen. If your units are at a certain level, they become \"empowered\" or some BS, and get a little flame effect on their icon...along with a fairly significant stat boost. Remember what I said about balance, and how important even small tweaks to the numbers can be? Yeah...it's pretty clear that here, the game is balanced around empowered units as the baseline for competitive play - meaning that if you've got units that aren't empowered, they probably aren't worth drafting and building around in a match, because they're just going to get crushed by your opponent's statistically superior empowered units.\n\nNow, you might be thinking \"well, I'll just grind enough and spend a little money until I get all the units, and get them all empowered, and then I can finally play the game as intended\". Ah, but I haven't even told you the worst part yet. Would you believe me if I said that the minimum level needed to become \"empowered\" continually increases as you rank up? Yep, that's right. This is clearly designed to be an endless treadmill of spending money on gold and on the gacha just to even maintain viability for your units as you progress. It's truly vile.\n\nAnd unless you're a mega-whale who spent enough money to have all the units and to keep them all empowered, this is going to have a significant impact on the gameplay, too. Instead of being able to roll with the punches and adapt to the RNG, keeping the game interesting because you're never quite sure how you want to draft your board each game, you're going to be way more constrained. Without spending a lot of money, your resources in the mobile-gamey \"roster building\" portion of the game are limited, which means you've got to make choices about which units and factions to keep leveled to make them even worth playing...which means you're basically going to be hunting for those same units and forcing the same build every game. It literally defeats the entire point of an autochess game.\n\nOh, and by the way...even if this game were balanced, it *still* wouldn't be a particularly good autochess game. The battle animations look like they could be from an early 2000s Flash game, and there's a real lack of feedback to any attacks or abilities. There doesn't appear to be an item drafting layer to the strategy, so it's missing that fun element of turning unexpected units into hypercarries, or just generally shaking things up from match to match. The round timer flies by super fast, so you barely have time to think about any of the strategy you typically would in an autochess game, like bench management, econ, selling off and pivoting to a different build, or rolling for something specific; there's an \"auto\" button to just have the CPU play for you, and the game clearly wants (or maybe even expects) you to use it. Which, again, defeats the purpose of even playing.\n\nI feel like I mostly wrote all this just to vent, since clearly this game is so poorly designed it lives rent-free in my head, but if you've read this far, I truly hope I've convinced you to give this one a pass. This isn't even good by mobile game standards, and we're on PC. Whether you're looking for a good game to play, or just to get your rocks off, you've got so many better options.\n\nAnyway, I miss Dota Underlords, but this ain't it.",
      "voted_up": false,
      "votes_helpful": 108
    },
    {
      "review": "If you're here just for some anime tiddies, I'm not going to stop you...but if you're here because you're desperate for a new autochess game, turn back now. I'm serious. Sure, you've probably seen all the negative reviews about the game being pay-to-win (and they're all true), but it's more than just that. This game is fundamentally broken.\n\nIn a \"normal\" autochess game, like Dota Underlords or Teamfight Tactics, it's very important that the roster of characters is fairly well balanced. It's not an exaggeration to say that these types of games can live or die based on balance, and the devs often make frequent small tweaks to keep everything in line. Even a slightly OP unit or faction can dominate a meta, while a slightly underpowered one might rarely get picked at all. These games are all about managing RNG and adapting to what the draft is giving you, and things need to be balanced well enough so that if the game seems to be steering you in a certain direction in any given match, you can roll with it and put together a viable strategy.\n\nNot here, though, because *these* devs did the totally cool and sensible thing of combining an autochess game with a gacha. How does that affect the gameplay? Well, let's say you're in a match and the RNG seems to be giving you tons of units from the demon faction. In a regular autochess game, that's great; looks like you're playing demons this game, and you can probably make it work. But here...oh...most of your demon units aren't a very high level, because you didn't happen to pull enough copies of them in the gacha. Or maybe you did, but you didn't have enough gold to level them, since you didn't spend any real money on it and you were stretched too thin. Or maybe there are certain key units that you don't even have at all, because you never pulled them...but there they are anyway in the draft pool, just \"locked\", clogging up a spot. You can see where I'm going with this.\n\nIf that weren't enough, this game does something else that's genuinely one of the scummiest things I've ever seen. If your units are at a certain level, they become \"empowered\" or some BS, and get a little flame effect on their icon...along with a fairly significant stat boost. Remember what I said about balance, and how important even small tweaks to the numbers can be? Yeah...it's pretty clear that here, the game is balanced around empowered units as the baseline for competitive play - meaning that if you've got units that aren't empowered, they probably aren't worth drafting and building around in a match, because they're just going to get crushed by your opponent's statistically superior empowered units.\n\nNow, you might be thinking \"well, I'll just grind enough and spend a little money until I get all the units, and get them all empowered, and then I can finally play the game as intended\". Ah, but I haven't even told you the worst part yet. Would you believe me if I said that the minimum level needed to become \"empowered\" continually increases as you rank up? Yep, that's right. This is clearly designed to be an endless treadmill of spending money on gold and on the gacha just to even maintain viability for your units as you progress. It's truly vile.\n\nAnd unless you're a mega-whale who spent enough money to have all the units and to keep them all empowered, this is going to have a significant impact on the gameplay, too. Instead of being able to roll with the punches and adapt to the RNG, keeping the game interesting because you're never quite sure how you want to draft your board each game, you're going to be way more constrained. Without spending a lot of money, your resources in the mobile-gamey \"roster building\" portion of the game are limited, which means you've got to make choices about which units and factions to keep leveled to make them even worth playing...which means you're basically going to be hunting for those same units and forcing the same build every game. It literally defeats the entire point of an autochess game.\n\nOh, and by the way...even if this game were balanced, it *still* wouldn't be a particularly good autochess game. The battle animations look like they could be from an early 2000s Flash game, and there's a real lack of feedback to any attacks or abilities. There doesn't appear to be an item drafting layer to the strategy, so it's missing that fun element of turning unexpected units into hypercarries, or just generally shaking things up from match to match. The round timer flies by super fast, so you barely have time to think about any of the strategy you typically would in an autochess game, like bench management, econ, selling off and pivoting to a different build, or rolling for something specific; there's an \"auto\" button to just have the CPU play for you, and the game clearly wants (or maybe even expects) you to use it. Which, again, defeats the purpose of even playing.\n\nI feel like I mostly wrote all this just to vent, since clearly this game is so poorly designed it lives rent-free in my head, but if you've read this far, I truly hope I've convinced you to give this one a pass. This isn't even good by mobile game standards, and we're on PC. Whether you're looking for a good game to play, or just to get your rocks off, you've got so many better options.\n\nAnyway, I miss Dota Underlords, but this ain't it.",
      "voted_up": false,
      "votes_helpful": 131
    },
    {
      "review": "Absolute slog of a money trap, they make every step of progression just barely possible without money about 2 hours into the game. Save your time and money. Goon responsibly brothers.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "Terrible Game!\r\n\r\nThis Game CHEATS HORRIFICALLY with bots that deal more damage than you even if you have the same level cards or higher! This game is expensive AF and are NOT worth the price!\r\n\r\nGooners, go play Porn and Cards It's the basically EL with no micro-transactions \r\nChess player PLAY ANYTHING ELSE!!",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Everlusting Life — A Paywall Wearing a Hentai Costume\n\nI went in expecting an 18+ adventure/strategy hybrid with a bit of historical flavor. What I got was a monetization funnel disguised as an auto-chess game with 0 mechanics and strategy.\n\nThe good (briefly):\nThe opening cutscenes and first 18+ moments are decently produced. The art direction shows promise… at the start.\n\nThe reality:\nAfter a mediocre tutorial, the game immediately pivots to aggressive monetization. Timers, energy gates, “limited” bundles— every screen nudges you to pay. Core gameplay is shallow auto-chess with minimal strategy. Progress feels gated by your wallet more than your skill. The adult content falls off a cliff after the intro. After the first few scenes, it becomes repetitive, tame, and frankly boring.\n\nDesign issues:\nPoor onboarding: teaches little, then expects spending to bridge gaps. Balance favors payers; free players hit walls quickly. Recycled encounters and copy-paste events kill any sense of discovery.\n\nVerdict:\nLooks like an 18+ adventure with strategy and story, plays like a cash-grab idle auto-chess. If you’re here for gameplay depth or meaningful adult content, look elsewhere.\n\nScore: 1/10",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "The art is nice, the game is fun, of course, BUT! I hate these developers. I wish your project would die. Why? Because you ask for so much money, it's impossible to level up. And what's with the combat setup? You should be accused of cheating for deliberately selecting strong bots to defeat players. What a disgusting attitude towards people.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "positves\nadult game with beautiful anime girls\n\ncons\nthey used AI to help make game i think more then what they say as more characters are coming out so quickly\nwallet warrior\nmatches on higher level are rigged for the wallet warriors\ngrindy which can use money to speed up\nthe energy is used to help get people to pay since its so slow\nthe DLC price is insanely high for only gettings like 1$ or 2$ worth when over priced",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Well, I give it to this game for being lewd enough right as you start. You get tits in your face and a few nfsw jpeg-s too keep your interest, also a + for having monster girls. But just as the game blasts you with boobs it also does it with their promotion ads, for which ofc you gotta spent real money. You get one of those ads by entering menus, exiting them, finishing a play, etc. they calm down after you trigger them once but still you will see them popping off every now and again.\n\n\nThe core gameplay is an auto-chess type like DOTA Underlords, was never a fan of these types of game so good thing it has an auto-battler system where you can leave it idle. Anyway, in order to play it you need characters which are locked behind an average gacha system. You get a free summon every 24hours or pay for it, and I really mean pay because the currency you need to summon is so damn hard to get as a F2P. There is also special summons for which in all my 40+ hours of this game I never got a single currency for them, they are ofc present in the pay shop. So, the gacha alone is very pay to win, what about the rest?\n\nThe level up system is based on constellations, they are just ranks (there are about 20+ of them), however each of those ranks have their own sub-rank, each main rank has 10 sub-ranks. You level up by just playing the game, BUT you de-level every time you lose. To give you an idea, in 40+ hours I could not pass beyond Wasp – 1 (this is the first stage of the 2nd rank). Think of it as a ranked LoL or something like that, you fall every time you lose, however in this game that is the standard mode!!!\n\n\nTo win you just need to be stronger, how you do that? Well by summoning characters because you can level them up using dupes and gold. You also got some boosters for them by leveling up relations, and for those you need materials, for which you grind your ass off or, do I need to say it at this point, pay for them.\n\n\nRecently they introduced Arcanas, which are a basic equipment that boosts stats, they are received from buildings which you construct with mats, and fortunately there is only 1 mat (hammers) but you need time or speed it up using hard currency. The builder mini-game is just one of those generic mobile games where you place on a set grid the buildings and wait for them to shit out resources, afterwards you click to collect them.\n\nAs I am writing this, there is an event and one of the goals is for me to summon a bunch of characters or dupes, now how the balls you want me to do that when I barely get summon currency and the free one is 24 hours away? Well the answer is money! Anyway the same thing goes for the main story, I got stuck at going beyond rank 2 – sub rank 2 (wasp-2), for that I need stronger chars, but everything is so damn limited, all I can do is grind dailys and who knows when I can get strong enough through those to continue the story.\n\n\nI started playing it when it was released, and I keep seeing it getting updated, good, I don’t mind games kept alive with frequent updates, but what else they added? Is some questionable DLCs. Every single DLC I see for this game atm is just complete BS, I mean you unlock 1 char per DLC and they cost up to 50$! How is that a good deal?, maybe if those chars are OP as hell and they carry you through the whole game, but then it would make the game even more p2w. \n\nTo close up, the game looks alright but holy crap, it smacks you in the face of how p2w is.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Basically to say that's kinda stupid game with no reason to play on it...I don't recommened it due to several reasons:\n1. Donating for anything\n2. No story (real story) at all\n3. Porno is questionable\n4. Low quality of what we have since it's AI",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "ABSOLUTE.NO.BALANCE.SHIT\n\nPlaying against bots who was 90% chance to overfarm and kill your army every single round ahahahahaha",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Big honkerzonkers but you got me fucked up if you think a splash screen and some currency is worth those DLC prices\n\nAlso, its a pretty dogshit autobattler. Ragebait map wipe abilities are fucking lame",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Highly predatory gacha game, that requires a lot of money to play with little reward.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "definitley a pay to win game, spent $25 in game on resources to get characters stronger and still get dicked over every match, so if youre a broke ass you have no chance in hell at progressing after a certain point, requirements for proceeding the story, forget it because it requires you to do shit with the online matches so you just cant proceed with anything unless you dump more money in it everytime you cant proceed anymore, if youre lucky enough to get the shit you actually need",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "A somewhat decent auto-chess game with quite some depth and great art that's sadly mostly balanced around your wallet. Best played as 2nd monitor game. The story, a good majority of future upgrades and most importantly other game modes are locked behind you climbing the ladder. If you don’t mind losing a decent number of games once you hit the first wall (Doe-X -> Wasp-I) you might get somewhere eventually, just don’t expect to roll every single lobby without spending a penny. Auto play makes suboptimal moves early game so it’s best to do them yourself manually. Oh yeah, the Mascot DLC packs are unimaginably terrible value, the 10,000 Gold, 100 Rubies and 10 Common Mystic Tomes that come with them is a complete joke, worth 5€ at a maximum, not 50€ for almost each and every one of them. If you’re looking to spend: Monthly Cards…",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "so the game is overrall pay-to-win. the artstyle is amazing and the character designs are awesome but it's just impossible to progress after you get Doe-X rank without paying money.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "You cannot go one page in this game without getting slapped in the face with a pop up or battle pass, or shop asking for 9.99 19.99 49.99 or more. It takes more than ten minutes just to go through every page to get rid of the annoying red marks. Every time you finish a match you're asked to spend money, every time you go to any menu, you're asked to spend money. Im done. Im so freaking tired of trying to play a game and being bombarded.\n\nNot even going into the bs \"players\" *cough* ai *cough* \n\nMassively pay to win, and when you pay, you just advance until you dont win again.\n\nIf you see this review, run. Leave this game to rot.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game suffers from the typical free to play gatcha curse of putting you on a power trip the first day and then MONTHS of losing to pay to win players.\n\nIf you're looking for a game to just log into once a day and upkeep some characters by VERY small increments then download this game. If not, avoid at all costs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Waste of Time. It's SUPPOSED to be a grid based combat game. However, units and unit capacity are paid for by coins earned by WINNING battles in a multi-battle encounter. However THIS part is completely unbalanced since winning gives you more coins than losing (understandable) however, since you NEED more coins to make your squad better, this essentially means If you win you're more likely to keep winning whereas if you lose, you're more likely to keep losing. Additionally, you purchase units that are randomly drawn deck-builder style from units gained from a Pay to Win Gatcha Mechanic... so RNG, on top of RNG, on top of RNG, with resources that are gained under a poor win / loss mechanic... I'm not seeing much strategy left available after all of those layers",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ok so i been playing daily for 220 hours, the game is pay to win. Computer cheats and the matchmaking is pretty bad. 90% of the time you end up against way higher levels above you who destroy you completely. During fights there is a lot of no damage registrations against the enemy of course. Otherwise this game has a potential to be AMAZING. Sadly its extremely annoying and slow to level up and earn prizes. But the biggest problem is that the game cheats and matchmaking is completely out of line.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a good game and at first you can make steady progress, but they try to make you pay for about everything after that. Most add-ons are $50. I would rather buy a game in it's enterity and then be able to enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is clearly pay to win. If you got money go for it. But over all this is a shit game.  got keep buying stuff in order to win.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pay to win, don't bother with it. its one step forward and 5 steps back.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everlusting Life could actually have the potential to be fun, but the idea of pushing you back every time you lose kills the pacing and strips away any sense of progression. After a while it’s not a challenge — it’s wasted time. The balancing feels designed more to drive monetization than to reward skill. With reasonable scoring and a less punitive design it could work; as it stands, it’s yet another forgettable title, sunk by shortsighted design choices.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Calling this game a scam would be an insult to scams.  If it wants you to win it will let you win.  If it wants you to loose you loose.  Was fun for 2 minutes in the beginning before you realize the matchmaking is 1000% rigged.  Then its just a nightmare of a BS scam.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is not a video game.  This is an illegal gambling scam disguised as a video game.  When you \"play\" the \"game\" you win when it lets you and you loose when it wants you to.  Currency randomly disappears and in combat your fighters may or may not function properly depending on how the game wants to manipulate you.  The fact that Steam does not have higher standards and protect the community from this kind of manipulative scam-con is horrific.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "So while the imagery and mechanics are fun and intriguing. This is still a gacha/grind game that relies on pay to win mechanics. Especially due to the game mechanics of the randomness to build up a squad to fight; too much randomness that can easily snowball into your favor or out of it.\r\n\r\nThe other issue is improving your girls and the limited about of resources that you can only improve some of them to an extent. Then of course there are the ranking limits and restrictions. It is very easy to reach the cap ceiling of your rank, which requires you to play the rank mode to get the improvements. The isuee to this? It is very easy to lose and drop rank to bully the weaker opponents, which has happen to me plenty of times on both being the one bullied and being the bully when my lost streak got too much.\r\n\r\nThe Adventure mode is also just as annoyingly demanding for those that want to progress the story and get those NSFW scenes. Because it is heavily linked to the Ranked modes and requires you to reach certain levels.\r\n\r\nThen the events... I tried some of them, but their timing too short, too demanding of saved up resources, and also rely on the RNG that is usually not in your favor.\r\n\r\nWhile I still play it out of stubbornness and due to playing investment on some of the characters. Likely will play for a few more weeks or months till the obsession ends.\r\n\r\nI don't recommend this game to casual players that just want a fun NSFW stuff and interaction with the female characters. As for those that want to do the grind, get frustrated with the lop sided RNG, get sweaty like they are playing League of Legends. \r\n\r\nWell give this game a try and maybe it is for you.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game matchs you with much stronger players just to get you to buy scam p2w packages. I wouldn't give a penny to a game that implements such a policy, keep going.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Matchmaking is garbage. Its absolutely pay to win. 3 separate power up mechanics that require throwing money into them all equally. These characters are in no way balanced. There are clearly better maidens that you could be completely locked from due to an event that you missed. If you had a huge bad luck lose streak and drop down 2 or more ranks (e.g Swan III ---> Wasp 5) you would still be fighting opponents whose levels are at Swan III which basically is the game punishing you more and more for not whaling. If they were to swap \"Main match gatcha slop with he tournament rules that they use then it \"might\" be a better game but that wouldn't change the intense match -making money grab this game is. The only thing going for it is the artwork but jesus if you are the poor soul who really wants to see them then be prepared to throw your entire life saving at this game. No thanks.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is bullshit!! If you don't pay, you can't win. PAY TO WIN FOR SURE. In other free to play games you have a chance to do something.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Find another way to goon, heathens. This is a bad game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Без доната вообще ни шагу не ступишь. Как и в других играх компании. 0 из 10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it is just as horrible as you've read. tons of pay walls and horrible rng. none of it is worth the rewards.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "!!WARNING!! - MASSIVE MONEY GRAB ATTEMPT\r\n\r\nOK, everything starts out great.  Then the game progressively gets crappier trying to force you into buying anything to make it better.  Does it?  Heck no!  This is just an auto battler that requires your input to start and end to keep it going.  Try taking control?  Good luck, your not fast enough to keep up most of the time with what needs to be done in the interlude.  Sex scenes, nope.  Nudes, locked behind a massive grind that money can't buy.  Is it hot?  Yea, but its made cold by the trash progression system.\r\n\r\nJust don't.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is stuck on tutorial, played for 4 hours, still cant finish the tutorial",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Most of what I've seen in other negative reviews is true. The game play might be fun if not for RNG, AI opponents with units 2 to 3 times as powerful as your and just flat out cheating. The story (what little I saw) could be fun if you didn't see so little as it is locked behind beating the AI. The character design is good, but honestly if you're here for the boobs just go find an AI generation site. You will find as good or better. Really just look at the reviews, go on the discord. Players complain about this constantly and are ignored. Just crap.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whats the difficult to just let me play at will? Geez...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "P2W >> not friendly for new players\r\n\r\nGreedy game developers!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very very very pay tooooooooo win\ndon't play this bullshit",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "just playing because of nice pics XD",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Badly designed. Money trap. Not sexy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst pay to win game I've seen so far.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you don't spend money don't even bother playing this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too much lag... PVP Doe so imbalance!...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Total money grab.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disgustingly pay to win",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just watch porn rather playing this shit game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pay To Win",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "P2W Trash",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "waste of time, the game is rigged, pay-to-win",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "riggid",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you're here just for some anime tiddies, I'm not going to stop you...but if you're here because you're desperate for a new autochess game, turn back now. I'm serious. Sure, you've probably seen all the negative reviews about the game being pay-to-win (and they're all true), but it's more than just that. This game is fundamentally broken.\n\nIn a \"normal\" autochess game, like Dota Underlords or Teamfight Tactics, it's very important that the roster of characters is fairly well balanced. It's not an exaggeration to say that these types of games can live or die based on balance, and the devs often make frequent small tweaks to keep everything in line. Even a slightly OP unit or faction can dominate a meta, while a slightly underpowered one might rarely get picked at all. These games are all about managing RNG and adapting to what the draft is giving you, and things need to be balanced well enough so that if the game seems to be steering you in a certain direction in any given match, you can roll with it and put together a viable strategy.\n\nNot here, though, because *these* devs did the totally cool and sensible thing of combining an autochess game with a gacha. How does that affect the gameplay? Well, let's say you're in a match and the RNG seems to be giving you tons of units from the demon faction. In a regular autochess game, that's great; looks like you're playing demons this game, and you can probably make it work. But here...oh...most of your demon units aren't a very high level, because you didn't happen to pull enough copies of them in the gacha. Or maybe you did, but you didn't have enough gold to level them, since you didn't spend any real money on it and you were stretched too thin. Or maybe there are certain key units that you don't even have at all, because you never pulled them...but there they are anyway in the draft pool, just \"locked\", clogging up a spot. You can see where I'm going with this.\n\nIf that weren't enough, this game does something else that's genuinely one of the scummiest things I've ever seen. If your units are at a certain level, they become \"empowered\" or some BS, and get a little flame effect on their icon...along with a fairly significant stat boost. Remember what I said about balance, and how important even small tweaks to the numbers can be? Yeah...it's pretty clear that here, the game is balanced around empowered units as the baseline for competitive play - meaning that if you've got units that aren't empowered, they probably aren't worth drafting and building around in a match, because they're just going to get crushed by your opponent's statistically superior empowered units.\n\nNow, you might be thinking \"well, I'll just grind enough and spend a little money until I get all the units, and get them all empowered, and then I can finally play the game as intended\". Ah, but I haven't even told you the worst part yet. Would you believe me if I said that the minimum level needed to become \"empowered\" continually increases as you rank up? Yep, that's right. This is clearly designed to be an endless treadmill of spending money on gold and on the gacha just to even maintain viability for your units as you progress. It's truly vile.\n\nAnd unless you're a mega-whale who spent enough money to have all the units and to keep them all empowered, this is going to have a significant impact on the gameplay, too. Instead of being able to roll with the punches and adapt to the RNG, keeping the game interesting because you're never quite sure how you want to draft your board each game, you're going to be way more constrained. Without spending a lot of money, your resources in the mobile-gamey \"roster building\" portion of the game are limited, which means you've got to make choices about which units and factions to keep leveled to make them even worth playing...which means you're basically going to be hunting for those same units and forcing the same build every game. It literally defeats the entire point of an autochess game.\n\nOh, and by the way...even if this game were balanced, it *still* wouldn't be a particularly good autochess game. The battle animations look like they could be from an early 2000s Flash game, and there's a real lack of feedback to any attacks or abilities. There doesn't appear to be an item drafting layer to the strategy, so it's missing that fun element of turning unexpected units into hypercarries, or just generally shaking things up from match to match. The round timer flies by super fast, so you barely have time to think about any of the strategy you typically would in an autochess game, like bench management, econ, selling off and pivoting to a different build, or rolling for something specific; there's an \"auto\" button to just have the CPU play for you, and the game clearly wants (or maybe even expects) you to use it. Which, again, defeats the purpose of even playing.\n\nI feel like I mostly wrote all this just to vent, since clearly this game is so poorly designed it lives rent-free in my head, but if you've read this far, I truly hope I've convinced you to give this one a pass. This isn't even good by mobile game standards, and we're on PC. Whether you're looking for a good game to play, or just to get your rocks off, you've got so many better options.\n\nAnyway, I miss Dota Underlords, but this ain't it.",
      "voted_up": false,
      "votes_helpful": 119
    },
    {
      "review": "If you're here just for some anime tiddies, I'm not going to stop you...but if you're here because you're desperate for a new autochess game, turn back now. I'm serious. Sure, you've probably seen all the negative reviews about the game being pay-to-win (and they're all true), but it's more than just that. This game is fundamentally broken.\n\nIn a \"normal\" autochess game, like Dota Underlords or Teamfight Tactics, it's very important that the roster of characters is fairly well balanced. It's not an exaggeration to say that these types of games can live or die based on balance, and the devs often make frequent small tweaks to keep everything in line. Even a slightly OP unit or faction can dominate a meta, while a slightly underpowered one might rarely get picked at all. These games are all about managing RNG and adapting to what the draft is giving you, and things need to be balanced well enough so that if the game seems to be steering you in a certain direction in any given match, you can roll with it and put together a viable strategy.\n\nNot here, though, because *these* devs did the totally cool and sensible thing of combining an autochess game with a gacha. How does that affect the gameplay? Well, let's say you're in a match and the RNG seems to be giving you tons of units from the demon faction. In a regular autochess game, that's great; looks like you're playing demons this game, and you can probably make it work. But here...oh...most of your demon units aren't a very high level, because you didn't happen to pull enough copies of them in the gacha. Or maybe you did, but you didn't have enough gold to level them, since you didn't spend any real money on it and you were stretched too thin. Or maybe there are certain key units that you don't even have at all, because you never pulled them...but there they are anyway in the draft pool, just \"locked\", clogging up a spot. You can see where I'm going with this.\n\nIf that weren't enough, this game does something else that's genuinely one of the scummiest things I've ever seen. If your units are at a certain level, they become \"empowered\" or some BS, and get a little flame effect on their icon...along with a fairly significant stat boost. Remember what I said about balance, and how important even small tweaks to the numbers can be? Yeah...it's pretty clear that here, the game is balanced around empowered units as the baseline for competitive play - meaning that if you've got units that aren't empowered, they probably aren't worth drafting and building around in a match, because they're just going to get crushed by your opponent's statistically superior empowered units.\n\nNow, you might be thinking \"well, I'll just grind enough and spend a little money until I get all the units, and get them all empowered, and then I can finally play the game as intended\". Ah, but I haven't even told you the worst part yet. Would you believe me if I said that the minimum level needed to become \"empowered\" continually increases as you rank up? Yep, that's right. This is clearly designed to be an endless treadmill of spending money on gold and on the gacha just to even maintain viability for your units as you progress. It's truly vile.\n\nAnd unless you're a mega-whale who spent enough money to have all the units and to keep them all empowered, this is going to have a significant impact on the gameplay, too. Instead of being able to roll with the punches and adapt to the RNG, keeping the game interesting because you're never quite sure how you want to draft your board each game, you're going to be way more constrained. Without spending a lot of money, your resources in the mobile-gamey \"roster building\" portion of the game are limited, which means you've got to make choices about which units and factions to keep leveled to make them even worth playing...which means you're basically going to be hunting for those same units and forcing the same build every game. It literally defeats the entire point of an autochess game.\n\nOh, and by the way...even if this game were balanced, it *still* wouldn't be a particularly good autochess game. The battle animations look like they could be from an early 2000s Flash game, and there's a real lack of feedback to any attacks or abilities. There doesn't appear to be an item drafting layer to the strategy, so it's missing that fun element of turning unexpected units into hypercarries, or just generally shaking things up from match to match. The round timer flies by super fast, so you barely have time to think about any of the strategy you typically would in an autochess game, like bench management, econ, selling off and pivoting to a different build, or rolling for something specific; there's an \"auto\" button to just have the CPU play for you, and the game clearly wants (or maybe even expects) you to use it. Which, again, defeats the purpose of even playing.\n\nI feel like I mostly wrote all this just to vent, since clearly this game is so poorly designed it lives rent-free in my head, but if you've read this far, I truly hope I've convinced you to give this one a pass. This isn't even good by mobile game standards, and we're on PC. Whether you're looking for a good game to play, or just to get your rocks off, you've got so many better options.\n\nAnyway, I miss Dota Underlords, but this ain't it.",
      "voted_up": false,
      "votes_helpful": 131
    },
    {
      "review": "Absolute slog of a money trap, they make every step of progression just barely possible without money about 2 hours into the game. Save your time and money. Goon responsibly brothers.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "Terrible Game!\r\n\r\nThis Game CHEATS HORRIFICALLY with bots that deal more damage than you even if you have the same level cards or higher! This game is expensive AF and are NOT worth the price!\r\n\r\nGooners, go play Porn and Cards It's the basically EL with no micro-transactions \r\nChess player PLAY ANYTHING ELSE!!",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Everlusting Life — A Paywall Wearing a Hentai Costume\n\nI went in expecting an 18+ adventure/strategy hybrid with a bit of historical flavor. What I got was a monetization funnel disguised as an auto-chess game with 0 mechanics and strategy.\n\nThe good (briefly):\nThe opening cutscenes and first 18+ moments are decently produced. The art direction shows promise… at the start.\n\nThe reality:\nAfter a mediocre tutorial, the game immediately pivots to aggressive monetization. Timers, energy gates, “limited” bundles— every screen nudges you to pay. Core gameplay is shallow auto-chess with minimal strategy. Progress feels gated by your wallet more than your skill. The adult content falls off a cliff after the intro. After the first few scenes, it becomes repetitive, tame, and frankly boring.\n\nDesign issues:\nPoor onboarding: teaches little, then expects spending to bridge gaps. Balance favors payers; free players hit walls quickly. Recycled encounters and copy-paste events kill any sense of discovery.\n\nVerdict:\nLooks like an 18+ adventure with strategy and story, plays like a cash-grab idle auto-chess. If you’re here for gameplay depth or meaningful adult content, look elsewhere.\n\nScore: 1/10",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "positves\nadult game with beautiful anime girls\n\ncons\nthey used AI to help make game i think more then what they say as more characters are coming out so quickly\nwallet warrior\nmatches on higher level are rigged for the wallet warriors\ngrindy which can use money to speed up\nthe energy is used to help get people to pay since its so slow\nthe DLC price is insanely high for only gettings like 1$ or 2$ worth when over priced",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The art is nice, the game is fun, of course, BUT! I hate these developers. I wish your project would die. Why? Because you ask for so much money, it's impossible to level up. And what's with the combat setup? You should be accused of cheating for deliberately selecting strong bots to defeat players. What a disgusting attitude towards people.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Well, I give it to this game for being lewd enough right as you start. You get tits in your face and a few nfsw jpeg-s too keep your interest, also a + for having monster girls. But just as the game blasts you with boobs it also does it with their promotion ads, for which ofc you gotta spent real money. You get one of those ads by entering menus, exiting them, finishing a play, etc. they calm down after you trigger them once but still you will see them popping off every now and again.\n\n\nThe core gameplay is an auto-chess type like DOTA Underlords, was never a fan of these types of game so good thing it has an auto-battler system where you can leave it idle. Anyway, in order to play it you need characters which are locked behind an average gacha system. You get a free summon every 24hours or pay for it, and I really mean pay because the currency you need to summon is so damn hard to get as a F2P. There is also special summons for which in all my 40+ hours of this game I never got a single currency for them, they are ofc present in the pay shop. So, the gacha alone is very pay to win, what about the rest?\n\nThe level up system is based on constellations, they are just ranks (there are about 20+ of them), however each of those ranks have their own sub-rank, each main rank has 10 sub-ranks. You level up by just playing the game, BUT you de-level every time you lose. To give you an idea, in 40+ hours I could not pass beyond Wasp – 1 (this is the first stage of the 2nd rank). Think of it as a ranked LoL or something like that, you fall every time you lose, however in this game that is the standard mode!!!\n\n\nTo win you just need to be stronger, how you do that? Well by summoning characters because you can level them up using dupes and gold. You also got some boosters for them by leveling up relations, and for those you need materials, for which you grind your ass off or, do I need to say it at this point, pay for them.\n\n\nRecently they introduced Arcanas, which are a basic equipment that boosts stats, they are received from buildings which you construct with mats, and fortunately there is only 1 mat (hammers) but you need time or speed it up using hard currency. The builder mini-game is just one of those generic mobile games where you place on a set grid the buildings and wait for them to shit out resources, afterwards you click to collect them.\n\nAs I am writing this, there is an event and one of the goals is for me to summon a bunch of characters or dupes, now how the balls you want me to do that when I barely get summon currency and the free one is 24 hours away? Well the answer is money! Anyway the same thing goes for the main story, I got stuck at going beyond rank 2 – sub rank 2 (wasp-2), for that I need stronger chars, but everything is so damn limited, all I can do is grind dailys and who knows when I can get strong enough through those to continue the story.\n\n\nI started playing it when it was released, and I keep seeing it getting updated, good, I don’t mind games kept alive with frequent updates, but what else they added? Is some questionable DLCs. Every single DLC I see for this game atm is just complete BS, I mean you unlock 1 char per DLC and they cost up to 50$! How is that a good deal?, maybe if those chars are OP as hell and they carry you through the whole game, but then it would make the game even more p2w. \n\nTo close up, the game looks alright but holy crap, it smacks you in the face of how p2w is.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Basically to say that's kinda stupid game with no reason to play on it...I don't recommened it due to several reasons:\n1. Donating for anything\n2. No story (real story) at all\n3. Porno is questionable\n4. Low quality of what we have since it's AI",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "You cannot go one page in this game without getting slapped in the face with a pop up or battle pass, or shop asking for 9.99 19.99 49.99 or more. It takes more than ten minutes just to go through every page to get rid of the annoying red marks. Every time you finish a match you're asked to spend money, every time you go to any menu, you're asked to spend money. Im done. Im so freaking tired of trying to play a game and being bombarded.\n\nNot even going into the bs \"players\" *cough* ai *cough* \n\nMassively pay to win, and when you pay, you just advance until you dont win again.\n\nIf you see this review, run. Leave this game to rot.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "ABSOLUTE.NO.BALANCE.SHIT\n\nPlaying against bots who was 90% chance to overfarm and kill your army every single round ahahahahaha",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Big honkerzonkers but you got me fucked up if you think a splash screen and some currency is worth those DLC prices\n\nAlso, its a pretty dogshit autobattler. Ragebait map wipe abilities are fucking lame",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Highly predatory gacha game, that requires a lot of money to play with little reward.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "definitley a pay to win game, spent $25 in game on resources to get characters stronger and still get dicked over every match, so if youre a broke ass you have no chance in hell at progressing after a certain point, requirements for proceeding the story, forget it because it requires you to do shit with the online matches so you just cant proceed with anything unless you dump more money in it everytime you cant proceed anymore, if youre lucky enough to get the shit you actually need",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "so the game is overrall pay-to-win. the artstyle is amazing and the character designs are awesome but it's just impossible to progress after you get Doe-X rank without paying money.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game suffers from the typical free to play gatcha curse of putting you on a power trip the first day and then MONTHS of losing to pay to win players.\n\nIf you're looking for a game to just log into once a day and upkeep some characters by VERY small increments then download this game. If not, avoid at all costs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A somewhat decent auto-chess game with quite some depth and great art that's sadly mostly balanced around your wallet. Best played as 2nd monitor game. The story, a good majority of future upgrades and most importantly other game modes are locked behind you climbing the ladder. If you don’t mind losing a decent number of games once you hit the first wall (Doe-X -> Wasp-I) you might get somewhere eventually, just don’t expect to roll every single lobby without spending a penny. Auto play makes suboptimal moves early game so it’s best to do them yourself manually. Oh yeah, the Mascot DLC packs are unimaginably terrible value, the 10,000 Gold, 100 Rubies and 10 Common Mystic Tomes that come with them is a complete joke, worth 5€ at a maximum, not 50€ for almost each and every one of them. If you’re looking to spend: Monthly Cards…",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I should not have to keep pumping money into your A.I. model just to progress. There is no actual effort put into development of this game, clearly A.I. is the main tool used. So the developer's are pocketing everything. I HATE GREED!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Progression in this game is non-existant. Fights feel the same on all levels.\r\n\r\nVisuals are good tho.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game and at first you can make steady progress, but they try to make you pay for about everything after that. Most add-ons are $50. I would rather buy a game in it's enterity and then be able to enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is clearly pay to win. If you got money go for it. But over all this is a shit game.  got keep buying stuff in order to win.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pay to win, don't bother with it. its one step forward and 5 steps back.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everlusting Life could actually have the potential to be fun, but the idea of pushing you back every time you lose kills the pacing and strips away any sense of progression. After a while it’s not a challenge — it’s wasted time. The balancing feels designed more to drive monetization than to reward skill. With reasonable scoring and a less punitive design it could work; as it stands, it’s yet another forgettable title, sunk by shortsighted design choices.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Calling this game a scam would be an insult to scams.  If it wants you to win it will let you win.  If it wants you to loose you loose.  Was fun for 2 minutes in the beginning before you realize the matchmaking is 1000% rigged.  Then its just a nightmare of a BS scam.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is not a video game.  This is an illegal gambling scam disguised as a video game.  When you \"play\" the \"game\" you win when it lets you and you loose when it wants you to.  Currency randomly disappears and in combat your fighters may or may not function properly depending on how the game wants to manipulate you.  The fact that Steam does not have higher standards and protect the community from this kind of manipulative scam-con is horrific.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "So while the imagery and mechanics are fun and intriguing. This is still a gacha/grind game that relies on pay to win mechanics. Especially due to the game mechanics of the randomness to build up a squad to fight; too much randomness that can easily snowball into your favor or out of it.\r\n\r\nThe other issue is improving your girls and the limited about of resources that you can only improve some of them to an extent. Then of course there are the ranking limits and restrictions. It is very easy to reach the cap ceiling of your rank, which requires you to play the rank mode to get the improvements. The isuee to this? It is very easy to lose and drop rank to bully the weaker opponents, which has happen to me plenty of times on both being the one bullied and being the bully when my lost streak got too much.\r\n\r\nThe Adventure mode is also just as annoyingly demanding for those that want to progress the story and get those NSFW scenes. Because it is heavily linked to the Ranked modes and requires you to reach certain levels.\r\n\r\nThen the events... I tried some of them, but their timing too short, too demanding of saved up resources, and also rely on the RNG that is usually not in your favor.\r\n\r\nWhile I still play it out of stubbornness and due to playing investment on some of the characters. Likely will play for a few more weeks or months till the obsession ends.\r\n\r\nI don't recommend this game to casual players that just want a fun NSFW stuff and interaction with the female characters. As for those that want to do the grind, get frustrated with the lop sided RNG, get sweaty like they are playing League of Legends. \r\n\r\nWell give this game a try and maybe it is for you.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game matchs you with much stronger players just to get you to buy scam p2w packages. I wouldn't give a penny to a game that implements such a policy, keep going.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Matchmaking is garbage. Its absolutely pay to win. 3 separate power up mechanics that require throwing money into them all equally. These characters are in no way balanced. There are clearly better maidens that you could be completely locked from due to an event that you missed. If you had a huge bad luck lose streak and drop down 2 or more ranks (e.g Swan III ---> Wasp 5) you would still be fighting opponents whose levels are at Swan III which basically is the game punishing you more and more for not whaling. If they were to swap \"Main match gatcha slop with he tournament rules that they use then it \"might\" be a better game but that wouldn't change the intense match -making money grab this game is. The only thing going for it is the artwork but jesus if you are the poor soul who really wants to see them then be prepared to throw your entire life saving at this game. No thanks.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is bullshit!! If you don't pay, you can't win. PAY TO WIN FOR SURE. In other free to play games you have a chance to do something.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Find another way to goon, heathens. This is a bad game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Без доната вообще ни шагу не ступишь. Как и в других играх компании. 0 из 10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "waste of time, the game is rigged, pay-to-win",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it is just as horrible as you've read. tons of pay walls and horrible rng. none of it is worth the rewards.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "!!WARNING!! - MASSIVE MONEY GRAB ATTEMPT\r\n\r\nOK, everything starts out great.  Then the game progressively gets crappier trying to force you into buying anything to make it better.  Does it?  Heck no!  This is just an auto battler that requires your input to start and end to keep it going.  Try taking control?  Good luck, your not fast enough to keep up most of the time with what needs to be done in the interlude.  Sex scenes, nope.  Nudes, locked behind a massive grind that money can't buy.  Is it hot?  Yea, but its made cold by the trash progression system.\r\n\r\nJust don't.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}