{
  "positive": [
    {
      "review": "Only just noticed I never reviewed this game. My favorite game. Guess I've been too busy playing to even think about the notion that someone might not know it. DST is a brilliant co-op version of Don't Starve. It is up to the individual player just how much they want to work together witth others, and there are a lot of great servers and amazing mods to play around with to always keep this game new. Devs also regualarly update the game introducing new caracters and game mechanics. You can be hardcore at gaming or even a complete noob, you can be totally selfish or a true altruist. There is something for all types of players.\r\nGive it a go, it is absolutely worth it.",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "this is not a game, but rather a well disguised cult. this is what they were warning you of in big red text at school assemblies. save yourself, never open this game.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Sooooooo... Basically it is a survival game for cooperative, but I've got no friends, and here is what I think:\nDespite being kind of a hardcore game it's difficulty decreases with your progress in one run(world). When you survive for one in-game year, it becomes really easy and makes you the desstroyer of the worlds, as you already slaimed all the bosses(if you did). Surely it is made mostly for a cooperative experience. However, it is not thaaat balanced. I think the developers suggested 2-5 players at once playing, as than it is a balanced game where you create, destroy, achieve and etc, BUT if you play alone there are sooo much less ways to revive and it is much harder to progress, so Don't Starve Together is not reaaally balanced for single-player. \nWell, anyway, it is kinda obvious. I also want to mention, that buying the game you also get a gift that unlocks this game to another person to whom you give it. HOWEVER, it works only with accounts of the same country, so keep it in your head, while buying.\n\nWhat about my attitude to the game? \nWell, I like it :)",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "DST is still a Nice & Recommendable game though, we just cant get back the happy times we had with friends(",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This is not a game, its a masterpiece that will completely engross you\n\nWhat's special about it ?\n\n1. A multi-level and diverse crafting system\n\n2. The world is divided into two dimensions: the constant and the cave, each harboring a million secrets that are revealed as you progress\n\n3. An incredible number of different bosses, from easy to quite difficult\n\n4. A huge selection of characters to choose from, each with unique abilities\n\n5. Base. You can customize your base in a variety of ways, from decor (you can decorate your base with beautiful road surfaces, lanterns and much more) to farms (apiary, mushroom, spiderweb, meat and much more)\n\nYou can also become a farmer and build a beautiful garden where you will grow huge vegetables\n\n6. Unique biomes that harbor hidden secrets\n\n7. Eccentric stylistic graphics and a billion stunning skins\n\nIf you're a fan of survival in special conditions, this game will reveal this genre like no other game",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "super cute game! i love how they improve and change things even as time pass. the game has been very fun since the day i learn how to play this. learning curve is abit steep if you have not played the single player Dont Starve, but with time and some patience, it is quite easy to learn and fun  to play with friends!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Charlie said I should write a positive review, so... The game is great, treats you with free cosmetics daily, is plenty spooky, fun, funny and challenging, looks not a day older than when it came out, and to this day is cared for by devs. Strongly recommend. Be wary of Charlie, though. Don't disappoint her and visit her often.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game to survive with friends, but need some mods to setup to better play",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Together or alone this game is fire!\r\n\r\nAlthough it can be difficult, it absorbs you and has a lot of replayability.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, better with friends. Hard and challenging. 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is rly good. I have just as much hours on console as on PC and i always come back to it. The survival and bosses are great and the game often turns into a chaos filled fun time and it awesome. 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "God I love the art style and charm of this game, but damn I still suck after 260 hours",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very good, very complicated for new player.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I might be a little biased, but this is the best game ever created and nothing else comes close.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its a very fun survial game. you have to eat and manage you other needs and with multiplayer comes both pros and cons..but overalll it is a good experince ... highly recommend and i recomend this one over the orginal Don't stave game is they have update this one alot where thet have left the singleplayer version in the dust with this one many improvements.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "such a cute game, the style alone is enough to warrant 5 stars 'cause reminds me of Tim Burton",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An excellent game by an equally excellent team.\n\nThis is the only \"survival\" game I've played that has you actually trying to survive for a majority of its playtime. At first, it truly feels like you're scrounging up whatever scraps you can just to make it to dawn, sitting by your shoddy little fire, cooking and eating your handful of picked berries. And yet, as you familiarise yourself with the mechanics, creatures and world of Don't Starve Together, you find that there is so so so much more beneath the surface to sink your teeth into.\n\nThe game is beautiful, practically everything you'll see is hand drawn in this grim yet whimsical style, exemplifying the horrors lurking around every corner. The music and sounds in this are also fantastic! I often like to turn game audio off and listen to music or videos on the side when I play games that I'm already familiar with, but I simply can't here. There isn't something playing at all times, mind you, and while the silence can be calming in and of itself, what really gets me going are the various themes that play depending on what you're doing. Tending to the plants at home? Enjoy a bright cheery tune to celebrate your green thumb! Chopping away at trees for lumber? The music will steadily chug along with you! A nightmarish behemoth has assailed you in the dead of winter? The track playing should be enough to tell you, stand your ground and fight!\n\nThe level of depth this game has is astounding, wide as as a sea, and deep as it too! On top of all of that, Klei continue to update this game, completely for free. And that doesn't mean small updates either, regularly the game receives large content updates, all adding a plethora of items, enemies, and lore to uncover. On top of giving the players new content, Klei also often revises older systems to make them grander and more interesting, and that has extended to the plentiful roster of characters, completely reworking characters largely unchanged from launch, and is even working on adding unique skill trees to each one too. These updates have accumulated so much that it feels far less like the \"Don't Starve with multiplayer\" that it began as, and much closer to a full on Don't starve 2. I could only recommend you purchase the original Don't starve to support the developers, or if you're particularly interested in the adventure mode and DLCs that are still unique to it.\n\nTo top it all off, this game gets even better when you add friends to the mix. Klei is wonderfully generous and give you a second full copy to give to someone else when you purchase the game, which is insane considering it's already priced so low for the quality and depth it displays. Whilst there are some that are more self sufficient, you'll find that pretty much every time you play with friends using different characters, you will all have unique traits that stand out and uplift each other, and especially with the character reworks, it feels that Klei have been focusing on adding ways to help others out to the whole crew. For example, a combat centred character that now has to get strong by doing more manual labour, or a utility based character that can now trap enemies temporarily to let others hack away at them unimpeded. \n\nMy biggest criticism would be that, although you definitely can and likely should find many things out on your own, this game is so massive and expansive that most times I play I have the wiki page open to check out some of the more hidden mechanics or just to see what an item does or how I acquire it. To use an example, you are able to tame a \"beefalo\", an animal in the game, except you would not understand how you need to do different activities with it to change its nature when it finishes taming or that the time that it allows you to ride it is based on the number of items fed within some time, which is separate from its hunger, since it all takes many days to happen and you can't see the progress for taming or its rideability at any given time outside of hints for when you're a bit of the way there or doing it fully wrong. For this and many other reasons, I feel comfortable calling this a \"wiki game\", one that requires the use of the wiki to properly grasp the underlying mechanics of the game and utilise them fully. Now, I myself actually enjoy wiki games, but I absolutely understand how it could be frustrating for someone trying to figure everything out just by themselves, like you would in most other games. To an extent, Klei has tried to mitigate this by adding a \"scrapbook\" feature, although it does not go into enough depth in most areas and only show you what you've made and interacted with, so it's mainly useful for checking crafting ingredients and food item stats. \n\nAnother, smaller issue I have are the prevalent cosmetics. I say this is a smaller issue because although I disagree with monetising a game past the point of purchase, I can accept that these are purely cosmetic, have no impact on the game, and help the developers keep the price low and continue to make free updates for this game that I love. They also give you free random cosmetics every day and on special occasions. On top of that, they allow to you \"unravel\" most items into a currency called \"spools\", which you can then use to craft different cosmetics that you might want more. The only true issue I hold against it is the fact that there are some characters that are locked behind an exorbitant spool price, that you must either just pay money for, or do as I did and keep track of every reward code for their website and keep collecting the daily cosmetics to unravel to then, and only after a long time of waiting, acquire a single character that you otherwise cannot try out or play as. Really wish they'd just make those few characters free to use like all the other cast.\n\nEven with those main issues, I still think it's absolutely worth it to try the game out, especially considering its price and the free second copy. Please play this game, it is incredible.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The most unique survival game I have ever played, the artstyle is engaging and charming, tho the game is a bit hard in the beginning until u get used to the difficulty and mechanics",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's wild they're still updating this game as much they do. It's fun with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "my friends abandoned me and i ended up starving. i think they dident get the objective of the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "花了一堆時間卻感覺沒做多少事的精神時光屋\r\n\r\n- 可愛的黑暗通話風\r\n- 充滿危險的世界\r\n- 豐富的設定機制跟生態系\r\n- 持續更新的製作組\r\n- 遊戲本體打折超便宜 還買一送一\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Easily the best co-operative survival multiplayer experience you can get right now while still being casual friendly.  Will always recommend this for people who want something that is not Minecraft but is similar.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game play is addictive, although if you're new then you might wanna watch some let's plays online to fully understand exactly how everything works.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My GF barely plays video game, but loves Don't Starve Together.🤠 She's really into fighting monsters.😂 I guess that says it all. Great multiplayer game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i probably won't ever play this game properly but the characters and ideas cured my sadness slump 😊",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, bring a friend or two along if you can though it's more or less necessary if you're newer to the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game wasted so much hours of my life, that I will never get back. Once you play this game there is no going back, you will get hooked, it's like a drug. This game has so much content, and plus there's mods! Half the time I had playing was with friends, so if you want a solo experience try the solo game Don't Starve first, then move up to this game, Don't Starve Together, since it's a lot harder.\r\n\r\nhttps://store.steampowered.com/app/219740/Dont_Starve/\r\n\r\nI can't stress how much content this game has! You can spend days and not get bored. One of my first few games and I'm still playing it! This game is just so much fun, and for the $14-15 price tag I would recommend for how much hours you can waste in here without even trying!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cute fun game :) always more to learn and discover. cosmetics dont feel locked up. easy to mod if you want to try another players vision. love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, always coming back to this title to play for a few days with my friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't starve together is a unique survival game that forces you into learning from your mistakes and to know how to strategically use your survivor. Each of the survivors can be played differently and follow set of rules, and they can cover most of the play styles that you can develop in the long run. With a large amount of content and with the frequent updates it should keep you busy on exploring many things. And perhaps if you're into mods you too have the ease of access to them for an impressive amount of quality of life features that often would help you.\n\nAs the name of the game suggests it's a game that relies on teamwork and mainly support co-op gameplay for it's core balancing, and that can be seen as a negative since it tends to be a bit more harsh and punishing for singleplayer players.\n\nNone the less it's a game that aged well over the years and and it's still a good game that can offer a lot of content for it's price.\n\nit's a must try if you're into survival or sandbox.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really good game, especially if you have friends who are willing to commit time to playing it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable if you're playing with your friends lots of mods to add new element in game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game to play when you don't have anything to do, also great workshop you could never get board",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7/10. Bought ages ago\ngreat for co-op gaming, gets repetative.. but has excellent supported modding and gameplay customization availability.\n\nHard to make meaningful progress without spending a dozen hours somewhere.\n\nSometimes indications of stationary enemies & environmental events are hard to detect. atleast in vanilla game.\nThe weather is quite unforgiving even when you shorten & lengthen the seasons. I find it necessary to increase the replenishment rates of atleast some resources.\n\nI thouroughly enjoy the meteorite shower feature in the mosaic & desert.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is something i always go back to, the horror of it is incredible fr.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game that the developers continue to update year after year.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun to play with friends - it has a learning curve in the best possible way",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "We just started to play again with the game after a while and almost everythjing changed. I love that after all these years thisa game still gets updates that shake up the core and keeps everything fresh but never betrays the core premise of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best survival games; it takes some time to get the basic and be able to really play this game but there are endless things to do. On top of that the graphic is really nice and all the characters are fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game both for solo playthroughs and with friends. You should absolutely buy this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you get two copies of the game when you buy it so you can play with your friends. get this at a discount and you'll be entertained for hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game for years and it never gets old. The devs work diligently to consistently bring new and updated content to the game. I also love that DST appeals to many different gamer types. If you want to boss run, go for it! Want to just build the most amazing base and avoid bosses, you can do that to! Want to play solo? No problem! Want to play with friends? DST has got you covered! I have 2200 hours as of now and have no plans for stopping. Thanks to the devs for an outstanding game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty fun game to play with friends, but a bit confusing with what some items and mechanics do, although it's nice to figure out and know what they do. However, one thing I would say is that the difficulty for a new player who has not played many games is quite high and can be hard to get used to dying, but it won't take long to get used to it. Moreover, with the addition of mods, the QOL features added from the workshop are really helpful and are recommended once you've played for a couple of hours into the game. Other than that, it's an enjoyable game. 10/10 would ruin friendships again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to play with friends. A bit hard at first, but gets addicting very fast. A LOT of content to explore. Recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best co-op survival game that I've ever played. Although I haven't tried the single player story campaign since it's a separate game, playing this one by yourself is thrilling in it's own way too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the kind of game that’s genuinely great with friends, right up until you realize friendship is apparently not strong enough to stop someone from denying you a single piece of meat while you’re literally starving on the floor (Looking at you, bro, you know who you are). \n\nMost of the fun comes from those little moments: everyone scrambling around at dusk, someone yelling about hounds, and that one friend who insists they’re “managing resources” while guarding the crockpot like a dragon on its hoard. (Yes, this kind of friend exist).\n\nAnyway, mods make everything smoother, weirder, or more chaotic depending on what you pick, and honestly they’re half the reason the game stays fresh. But nothing prepared me for the emotional damage of walking back to our base after a long, miserable night, only to discover our meat stash had been raided. Either that, or someone decided to be a menace to society and shoved a piece of rotten food in there like a calling card. I don’t know which option is worse; both made me reconsider who I trusted. \n\nStill… when it works, when everyone’s actually cooperating instead of low-key sabotaging each other (even though this is fun).\n\nit’s still one of the best survival games out there that is better with friends, trust me bro.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have had this game for literal years and its is always fun to play. I always get my ass beat past day 25 due to wolves but always fine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is one of the best games i have ever played in my entire life, this game saved me from a very intense depression, i owe a lot of my life to this game, thank you, Don't Starve Together.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS PEAKKK!!!! It's a lil hard and its like a mix of Minecraft, and Vintage Story but 2D- its fun try it, you might like it or hate it- LOL ORR BOTH cuz that's me xD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game feels like games used to be in the days, and I loved it.\n\nFirst off: If you watch a play through, that doesn't capture the essence of this game. Yea, the survival stuff is fun (if you have some frustration tolerance...) but that's not all to it. Where this games shines is adventure and boy, did it deliver. I've spent nights sailing the sea, I've had major dopamine rushes when I killed all the bosses solo, I had moments that made me happy, moments that scared me, I had moments that terrified me ... (those freaky monkeys)\nSpeaking of monkeys, this is an example of something that happens to me all the time: A friend of mine told me about poop throwing monkeys in Thailand and I was like \"what??? that's real?!\" - I actually had this a lot since I've played this game: Constant reminders in real life that make me think of this game. I've played many games in my life and can't say this about any other game I can think of. So when the game description says \"full of science\" - that's actually surprisingly true, I didn't realize this when I played but afterwards.\n\nComparing it to DS solo, I did not enjoy that as much, DST has much better User Interface and open world, plus obviously the ability to play with friends... since it can be quite time consuming, I recommend to make sure to play with people who can make the time.\n\nOnce I finished all the bosses, it felt like my favorite show's last episode. You did rush it so much just to realize you did not want it to end. But it has to end, Klei tries to extend the game but to be frank, after the two end bosses everything feels a little artificial... the loot you get is awesome, sure, but now it's like your favorite show is in a spin off, it isn't the same anymore.\n\nLast but not least, there is no annoying micro transactions or hidden cash grabs, no ads, nothing...\n\nsolid 10/10 from me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game, solo, or with friends. You might need to look some things up due to things being a tad confusing at times. It's a fun game tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't Starve Together combines exploration with resource management - as with most games of this nature, it's best to go in blind, figuring out the mechanics and recipes of the world as you play. The game provides a \"Goldilocks\" level of guidance, giving teasers and presenting mysteries left for the group to solve in time. \n\nIt's great to play with friends, but also not a bad singleplayer experience. The large cast of characters and their skill trees allows for a wide variety of specialization.\n\nIt'd be cool to see the addition of a story mode with some defined end, but I reckon the developers have many, many more things to push out before then; the lore is still being written, and Klei doesn't seem to stop with the updates anytime soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games of all time. Don't Starve Together has a charming style and amazing gameplay. It's full of surprises and fun to explore them with your friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Almost 10 years since publish, getting updates and still stands out other games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game for so many years. It is always a delight to come back to it after a hard day. Always something new and exciting to try out in the game. Will always be a fan!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game enough to say it's AMAZING. It's a little difficult at first while you get used to the gameplay, but playing it with friends is a blast. \n\nIt has a huge variety of characters and things to do, a game that definitely won't let you get bored for a second. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one of the best survival games if history. I highly recommend it and mention that dont...please dont judge this game by its graphic. its verry amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "enjoyable game so much fun and things to learn but can be overwhelwing at the start but once u start to know what u doing it gets to the addiction point",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don’t Starve Together is an example of a live game that has truly grown with its community. What started as a quirky survival experience has evolved over the years into a rich, ever-expanding world, thanks to the developers’ long-term care and commitment. New characters, biomes, seasonal events, reworks, and quality-of-life updates keep the game feeling fresh without losing its original charm or difficulty. Jumping back in after months away always feels rewarding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game, granted you have the patience to die 50 times or/and read a hundred pages of the wiki, and download some near essential client mods.\n\nBut I think it was worth it. Certainly in my top 5 favorite survival games.\n\nHave fun and DONT STARVE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic little survival game with an amazing artstyle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've purchased this game on the PS4 and played it through the PS5 and again on the PC. I love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I found this game randomly as a kid on mobile many years ago and I was intrigued by the art style. \nI begun on pocket edition and transferred to console when I got one. \n10 years later I still enjoy it whenever I pick it up. It’s difficult, but that’s the point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "虽然多数时间在挂机，但这游戏真的良心吧",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "um jogo bem massa, eu recomendo se tiver amigos, ou se quiser algumas atualizações recomendadas em equipe, mas que você e seus amigos imaginários conseguem fazer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spectacular graphics.\nHARDEST GAME I'VE EVER PLAYED.\nSo many things to do and explore, it feels like an infinite game.\nVery fun with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game it's amazing! So much fun to play with friends but also a cool challenge playing solo. The art style is amazing and there's so many items, mobs, biomes, structures, etc. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to play alone and also with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I have ever played. At first, I didn't like it much because it seemed too difficult for me, but as I learnt the mechanics of the game and how to kill bosses and survive without friends I started to like it more and more to the point where it became my favourite game. Now I try to bring all my friends in this game. Amazing game to play alone or with your friends, with tons of stuff to do and options for creating a nice base. No to mention the multiple skins that you can get for free for characters and items.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game to play alone or with friends, great mods for the game too making it even more epic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don’t Starve Together is a tough but really enjoyable survival game. At first, everything feels chaotic, you’re hungry, the nights are scary, and you have no idea what’s going on. But the more you play, the more fun it gets. The hand-drawn style gives the world a cool, creepy vibe, and discovering new things is super satisfying.\n\nPlaying with friends makes it even better: sometimes you work together, sometimes everything goes wrong in hilarious ways. It can be challenging, but that’s exactly what makes it so addictive. If you like survival games with personality, this one’s definitely worth trying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don’t Starve Together has become one of my favorite survival games, and honestly, I didn’t expect to enjoy it this much. When I first started, I felt completely lost everything could kill me, even the darkness. But that’s exactly what makes the game exciting. Every time I play, I discover something new, and no two worlds ever feel the same.\n\nWhat I love most is how the game keeps me thinking all the time. I’m constantly planning:\n“Do I have enough food?”\n“Is winter coming soon?”\n“Why is my sanity dropping AGAIN?”\n\nThat stressful-but-fun feeling makes the game addictive in a good way.\n\nThe characters also make the experience special. Each one has a unique style, so I enjoy trying different builds and roles depending on my mood. Sometimes I like exploring, sometimes base-building, sometimes fighting bosses but the game lets me do all of it.\n\nIt’s definitely challenging, especially in the beginning, but once I learned the basics, surviving felt incredibly satisfying. The art style, the music, and the world’s weirdness all add to the charm. And playing with others makes it even better cooperating, yelling when hounds attack, or celebrating a hard-earned victory is part of the fun.\n\nOverall, Don’t Starve Together feels like a game that keeps pulling me back. It’s tough, creative, and full of surprises. I genuinely enjoy it and would recommend it to anyone who loves survival games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolutely amazing game where you and your friends can challenge yourselves against monsters and a harsh world. The ability to build and decorate your own base however you like is super cool!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Posting a simple review of this for my badge, but just know Don't Starve Together is definitely good enough to have earned that almost 2k hours of play time. I think it deserves the Labor of Love award.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and should be in everybodys library ... fun fun fun !!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is always so fun, but very hard at first. Building a base is always fun too. There's tons of bosses for you to fight and many unique characters that make this game even more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don’t Starve Together is a great survival game and really fun with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a charming game but really difficult.  There is satisfaction in trying to get better and better and trying to survive longer.  I like this game more than Don't Starve, even though I play this one solo also, because of all the fun DLC's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's not much I can say aside from it's just a fantastic labor of love. I'm still terrible at it but it's never gotten old, even after 1000+ hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a classic coop survival game for a reason! The learning curve is pretty steep, but if you can put up with it you'll have fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just starting out, getting used to combat, and figuring out what to do to progress, but enjoying it alot! the characters are fun and i really like the general gameplay (+ making my base look nice!) still bad at game tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10\n\nOne of the best survival games I’ve ever played. While many survival games focus heavily on crafting, leveling up, and similar systems, Don’t Starve Together is truly about survival itself. The core of the game is resource and risk management. You constantly need to keep track of your hunger, sanity, health, temperature, and much more.\n\nYou must also prepare in advance for the unique challenges each season brings.\n\nBe aware that to truly master this game, you’ll need to invest time learning its mechanics—watching tutorials, reading the wiki, and experimenting on your own. Alternatively, you can create an Endless world and die over and over again until fire or some random boss inevitably destroys your base.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "From the art style to the gameplay it offers a unique experience unlike any other game I've played or seen thus\nfar. Not only that, the devs continue to put so much effort into the DLC and updates nearly 10 years after it's release. You won't regret playing this game, if you catch it on sale, doubly so.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Game, Quite challenging. fun in multiplayer too, slightly less challenging still difficult though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, very good for having fun, passing the time, and playing with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the visual style of the game is captivating. the survival mechanics are good. the downside is that it feels hard and has a steep learning curve. the game of course is better with friends ,hence the name.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome, i love that don't starve  is now multiplayer and has A LOT more to offer in game, like customizing you character, and more options in creating your own world. 1000% RECOMENDED.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is a whole lot of fun and discovering. this is not a game you'll find anywhere else and is NOT your typical sandbox. the art style is so beautiful and it has some of the coolest survival mechanics ive ever seen. that said, i found this game pretty hard and there is a massive learning curve. even now, im barely able to get through the seasons.\r\n\r\nsuper fun game if you're looking to learn the way of the world of a new game and support unique, authentic work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game reminds me of the times where I'd join a random official server and play with other people, mostly being in charge of food. I remember being awake past midnight and playing with great people. I miss it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally my favorite survival game. You can survive with your friends and also explore a plenty of content in this game as it updates really often and there are some events and gifts. The amount of content and characters is really wide so you have to get to know how to play a specific character and use their skills properly. Actually in this game there is no «proper» way to survive as you can develop your own technique and tactics. The availability of steam workshop is also a plus vibe feature. Also you can donate and buy some in-game stuff like skins if you want lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am lucky to find such a game.I used to play with my good friends.Now a good friend has become a girlfriend.From my point of view, this game has witnessed our love.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "-Steep learning curve\n-You might get carpal tunnel and/or wear out your keyboard, mouse, gamepad\n-Needs a better game map system with pins and lines",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun even when you are dying to the most basic of enemies which you love. (for me its dying to spiders) Get some buddies and you will have a blast dying to everything. \n\nMaybe the name of the game is a scam but I'm not complaining.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a game where you can play in lots of different styles, that has a hard learning curve, but when you get it, then it is very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game to play with friends, It has a lot to do, you can spend hundreds of hours in it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, has regular updates, can play single or with friends and for this price just go for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great, it's a survival game with aspects of boss fighting and many other things to do. Theres 18 diffrent survivors with you can further increase with mods, at first this game may seem hard but in fact after many updates it got really easy to get into. It might not be for everone but it's certainly a classic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is a good game, but after an absurdly long patch in the Astral Line update, this game is already dead.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really cool survival game makes me feel like im trying to survive with all the conditions that need to be met",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this will always be one of my go-to games to play with my friends. the updates from klei as well as the modding support make this a great survival game to head back to again and again.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The game's focus shifted from charming, creative, and kind of eerie exploration, adaptation, and survival, to a boss battle heavy story and lore progression gameplay that doesn't teach you through intuitive mechanics and designs but rather expects you to educate yourself through external sources based on its popularity. It became a wiki game, expecting players to learn its features through youtube videos, twitch streams, and wiki pages, both mechanics and features as well as lore, instead of leaving the player to discover and unravel them through fair gameplay. Not to mention, spoiling the player of the mysteries the game used to be so focused on, now outright revealed for the sake of progression, comfort, and convenience. \r\nUnfortunate to see. Still plenty charming for the people who enjoy playing in the ever growing world with their friends or alone; but the magic of the original is kinda gone, so I recommend the original instead, for the purpose the franchise tries and always tried to fulfill.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "At the heart of don't starve together is an exciting gameplay loop of exploration, base-building, and discovering wacky items like star staves, bee mines, or armor you have to feed. However, you only experience the peak of the game in a fairly narrow window of time: after you escape noob hell (the game explains none of itself) and before you know TOO MUCH.\r\n\r\nYeah, there is distinct threshold where things become to easy. Two main reasons are the overabundance of resources and the lack of difficulty scaling. Since self-sufficiency is so easy with items like meatballs or stonefruit, the game quickly loses its jazz and becomes tedious. Since the only things that truly scale are the hounds, which are trivial to deal with, you stop feeling the need to improve your welfare. At that point, survival becomes a chore, just maintaining stocks.\r\n\r\nThis game has many bosses. While some drop genuinely useful rewards (eye of terror, nightmare werepig, beequeen, ancient guardian) most of them drop garbage or items that are not nearly worth the trouble (twins of terror, toadstool, shadow pieces, antlion, moose goose, crab king, malbatross). You only do these bosses when you inevitably get bored of the core survival game. It doesn't help that the combat is boring and lacks depth.\r\n\r\nBy the time you hit \"hard mode\" the game becomes even less interesting because the only usable weapons and armor are the new \"planar\" stuff. The original roster of cool gimmicky items becomes unviable, and the game is less interesting for that. \r\n\r\nI wish there was a \"maybe reccommend\" option. This game is fun for a while, but fully expect hitting the wall of boredom not too long after. Once you do, investing any more time is not worth it.\r\n\r\nIf you want to know why my hours are high, it's because of AFK grinding and challenge mods (if you buy, i recommend the UNCOMPROMISING MODE mod once you hit that wall).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Very disappointing that this PC version of the game does not support split screen co-op whereas the PS and Xbox versions do. Very disappointing indeed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Too easy to accidentally delete your save with no change of getting it back, the button to regenerate the world is right next to other more used buttons and it completely deletes every backup. This isn't a new problem, people have been talking about it for years",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Remove this product from local co-op please since you cant play locally on pc... it is even called dont starve together someone wouldve thought you would fix something like this after so many years.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is an unfun, constantly unrewarding resource sink and I honestly regret putting so many hours into it.\r\n\r\nMy problem with the game is that to do anything fun you need to either gather copious amounts of resources for like 10 days straight for a single boss fight that will still somehow take 20+ minutes or you go in practically naked and get your ass handed to you if you're not good at kiting (and that's if you even HAVE a choice, some bosses force you to either defeat other bosses [Which are just bigger resource sinks] or complete a boring sidequest before you can fight them, like the Crab King, and some force you to wait until a certain season, like Klaus).\r\n\r\nAlso, this is mostly psychological and me-exclusive, but I feel like every single time I get hit, it feels like I need to heal instantly or I'm going to die; even with the characters that have more default health every hit from anything stronger than a spider feels like getting hit by a truck, and before I found out about stuff like sleeping bags and blue mushrooms that meant spending 2 or 3 days scouring the world for literally anything that healed you when you ate it. This culminated in me not wanting to get hit at all, so I just didn't bother with the bosses. If you have any experience with the game you know that actively avoiding the bosses is a really bad idea.\r\n\r\nAnother problem I have is the combat. Kiting is not fun. It feels boring and unengaging, like I'm putting the minimal amount of effort. Maybe if there was something more complex than a boomerang I'd be more interested, but as far as I know, there is literally only one boss in the entire FRANCHISE that has a weakness you can exploit. That means every single other boss is just \"run, hit, retreat, repeat\", over and over and over again. Way too repetitive.\r\n\r\nCharacters are fucking cool though, I like 'em, most of 'em anyways.\r\n\r\nPoint is, after 400+ hours I still have not found the \"fun\" part of this videogame, and I don't think I ever will. \r\n\r\nBasically: the bosses are too tanky and they're either absurd resource sinks or have some boring prerequisite to fight them, and even when you do get to fight them all you do is run, hit, retreat, and repeat this like 200 times. The survival elements are fun but man the combat just completely ruins it for me, it's mind numbingly boring and once I got past the survival stuff I just got frustrated.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Alright, my review. Ignore that I have 1 teeny tiny bit extra hour on the game. I've reached 4000 hours on this game, and I'm here to say a thing. This was one of my favorite games I've played from 7 years old to now. (I'm still a kid, atleast still.) There are so many cool mechanics within this game with great concepts that require a nice lot of thinking to solve, but that also cracks open a problem. The people who just started this game. I know, Tencent (And yes I'll refer to the dev as Tencent not Klei because from my knowledge many of the devs from Klei have gone working on other games) wants to create TEAMWORK by making the game more and more vague to starters, but that's not my only problem. I've had many good memories with the game, but after 2025 started almost everything went down hill with the game. The artstyle change, instead of the creepy moody and dark brown/yellow colors on almost everything we have a game filled with generators wires machines technologies in a way that fits nothing like the game should be. Other than that some of my friends have attempted coding. Not only is the app used for making sprites bad, not only is the coding bad, but the amount of work also put into each single mod. The modding in this game is VERY easy to navigate, but on one hand I have to deal with having one of my mods glitching and corrupting my server every week. This is a fun game if you have friends, but the game wants to smash everyone's head open that multiplayer is mandatory. It is a fun game if you have alot of friends, but even then getting reduced to using 10 mods is unbearable as hell. So many good flashbacks in 2024 and anything before it, and such a terrible experience in 2025. I hope you can have fun in this \"dark creepy survival game\" but I hated all the stuff I needed to experience just to play the game. I don't often play survival in DST, and I usually use big mods for creating a whole town. I had the best creative server at some point, I can't have it anymore because the game prevents me (and almost anyone else) from playing the game the way they want. You can get the game for yourself but it might not be fun at all even with the many content it has to offer. Thanks for reading, Bye! And also remember the devs barely listen to the players anymore, Or Tencent or whoever you call them.\nForgot to mention! Tencent added a setting for every lunar mob that appears in the main land. All except for the Deadly Brightshade. You know, 80% of the lunar side's problem",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game seemingly gives you a ton of options, while really you have an invisible checklist of things to do. It feels like I'm supposed to know to do unintuitive things that aren't a matter of \"oops I died because I did this, I'll learn from this experience\" and instead \"what am I even supposed to do to prevent this?\". I also don't love how the game controls and the problem is so deeply rooted with how the game is made, that I cannot just fix it in the settings. On the more positive note, this game looks gorgeous. I love the artstyle, the enemy and character designs, and the sound design is just as incredible. I'm sure if I completely forced myself into learning this game I could probably get into it, but with my current experience it just doesn't feel worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was awesome, now is downright unplayable. In a game when OHK from bosses is the norm, you're now expected to facetank because of omnipresent almighty LAG. And Klei simply doesn't care.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game ACTIVELY tries to kill you every single second, not my kind of game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to like this game. Idk what happened but I'm just gonna leave this here just so I feel better. First my base burned down (disabled it). then earthquake because i didnt feed some r-word mob (disabled it). now ANOTHER FUCKIGN R-Word ASS FUCKING MOB SHOWS UP AND STILL FUCKING DESTROYES EVERYTHING. LIKE WHATS THE FUCKING POINT. It took me 3 hours to rebuild only to get rolled. Who is this game for? No wonder people just leave shit on the floor. No thanks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pick up stick, pick up grass, die from random monster, drift around 20 minutes finding a respawn point only to discover haunting various objects around the world is a more fun game loop than the whole stick-grass-seeds-kite-monster thing. you can't build a house or any kind of safe base (within a reasonable time frame), even the pigs can.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "didn't enjoy it.  I played coop with 5 of my friends and family and even though I tried to make the best of it 3 of them quit within 30 minutes it was too boring for them.  The 1 person that tried to stick it out with me spent 30 minutes trying to find a resurrection stone but couldn't so he got bored too.  No thanks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this was just a multiplayer ds with a few more things and characters but now its almost not the same game anymore. if anyone comes around a way for launching this game for multiplayer (even on a LAN) on a version from 2019-21 or something, then please, let me know.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn't like it. I tried to, but it's too grindy and unfriendly to get into. Only get this if you are REALLY into these kinds of games, or have a few pals.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why opening this game changes my main monitors resolution from 1440p to 720 x 576 and refresh rate from 144 to 59,95 and resolution of side monitors to 720p is beyond me. Get your dirty paws out of my windows settings you grimy slimy stinker game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If u like a game with no explanation and a very slow pace, with slow combat mechanics this is the game for you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not my type of survival game.  Needs an early game tutorial mode.\n\nAlso subjective opinions here but I don't like the graphics style or the sound effects.  \n\nWould rather play rimworld or a regular survival game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is not for everyone its super hard and i kept dying but i feel like if you just master the game then maybe it will become more fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tried a few times to start a world on this game, every time its come down to spending 30 mins to try find a rock..... just running around emptyness to find a rock for it to go night.... im sure if i put the time in this is probably a good game but i honestly cant be bothered for a first time experiance have this much hassle to find a basic material, people with more paitence may enjoy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game makes no sense and makes no attempts in trying to help you figure out how to play. goodluck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game was pretty good but now i have to downvote it because anything i do the game chashes for no reason even if i don't have any mods on like this is so stupid!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know it's old, but come on, its interfaces are so buggy and clunky, the P2P is so bad it disconnects you the instant your internet dips even just a bit in speed (and takes ages for it to disconnect you), every loading screen makes windows think it crashed, it pretends to support 2nd screen playing but it bugs out the UI and makes it impossible to play when you use that setting... I regret giving it more than two hours of playtime",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My experience with this game has been, walking around looking for a few specific items in a largely empty world (with a friend). I enjoyed writing that description about as much as I enjoyed the game.\n\n The combat is undoubtedly terrible. I, as an amateur, could do better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You're better off playing minecraft but still worth a try ig",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I couldn't refund so Im gonna be a dick and give this game a thumbs down",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game , always lagging when play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "never got the hype. It's a well made game though, just not for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i don't waste 100 hours on findidng all threats and then dieing to an new one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "doesn't have any achievements to unlock",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Didn't get the idea of it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "didnt like it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont buy this !!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME CAN'T FUCKING RUN, FUCK THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't sex charlie :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i want To harm   Someone after playing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too many bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no no no no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "бабка гавно ыыыыыыыыыыы",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game straight up breaks the law in many ways. Data collection is enabled by default, the toggle off switch is hidden in some deep menu. Disabling it not only DOESN'T turn off data collection at all, it also makes you unable to play online.\n\nNothing will be done because this game is Chinesium slop now. Just saying that this game literally breaks several laws in every Western country. Playing this game sends every iota of data they have on you directly to Tencent and their advertising partners, and I wish this was an exaggeration. Every interaction you make in the game is carefully logged, down to every single tree you chop.\n\nThis info also includes personal information such as your device info, and this logically also gives them your IP address (which the GDPR considers personal data by the way). Network analysis shows this data collection STILL happens when disabled in the menu(!), which also disables all multiplayer play(!), including LAN play(!!!).",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Frustrating piece of sh*t game that punishes your ss for everything. You get bored really fast when you have no idea what you should do or where to do it. Your precious base that you’ve spent hours building can be turned into sht by almost anything. Combat is your last resort because it s*cks. Your character always seems to want to die. Whether it’s from starvation, insanity, frostbite, frog rain, or overheating, you’ll die for sure.\r\n\r\nThis is one of those games I really want to enjoy, but I just can’t. I download it once in a while when I feel like giving it another try, start a new run, make it to day 40–60, watch my base get trashed by a giant hedgehog, delete the game, and then avoid it for a whole year.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game's focus shifted from charming, creative, and kind of eerie exploration, adaptation, and survival, to a boss battle heavy story and lore progression gameplay that doesn't teach you through intuitive mechanics and designs but rather expects you to educate yourself through external sources based on its popularity. It became a wiki game, expecting players to learn its features through youtube videos, twitch streams, and wiki pages, both mechanics and features as well as lore, instead of leaving the player to discover and unravel them through fair gameplay. Not to mention, spoiling the player of the mysteries the game used to be so focused on, now outright revealed for the sake of progression, comfort, and convenience. \r\nUnfortunate to see. Still plenty charming for the people who enjoy playing in the ever growing world with their friends or alone; but the magic of the original is kinda gone, so I recommend the original instead, for the purpose the franchise tries and always tried to fulfill.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "At the heart of don't starve together is an exciting gameplay loop of exploration, base-building, and discovering wacky items like star staves, bee mines, or armor you have to feed. However, you only experience the peak of the game in a fairly narrow window of time: after you escape noob hell (the game explains none of itself) and before you know TOO MUCH.\r\n\r\nYeah, there is distinct threshold where things become to easy. Two main reasons are the overabundance of resources and the lack of difficulty scaling. Since self-sufficiency is so easy with items like meatballs or stonefruit, the game quickly loses its jazz and becomes tedious. Since the only things that truly scale are the hounds, which are trivial to deal with, you stop feeling the need to improve your welfare. At that point, survival becomes a chore, just maintaining stocks.\r\n\r\nThis game has many bosses. While some drop genuinely useful rewards (eye of terror, nightmare werepig, beequeen, ancient guardian) most of them drop garbage or items that are not nearly worth the trouble (twins of terror, toadstool, shadow pieces, antlion, moose goose, crab king, malbatross). You only do these bosses when you inevitably get bored of the core survival game. It doesn't help that the combat is boring and lacks depth.\r\n\r\nBy the time you hit \"hard mode\" the game becomes even less interesting because the only usable weapons and armor are the new \"planar\" stuff. The original roster of cool gimmicky items becomes unviable, and the game is less interesting for that. \r\n\r\nI wish there was a \"maybe reccommend\" option. This game is fun for a while, but fully expect hitting the wall of boredom not too long after. Once you do, investing any more time is not worth it.\r\n\r\nIf you want to know why my hours are high, it's because of AFK grinding and challenge mods (if you buy, i recommend the UNCOMPROMISING MODE mod once you hit that wall).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Firstly, I like the art style and sound effects, but I'd rather watch someone else play it. It's not as fun as people make it to be, unless you know what you're doing in order to progress, or have a friend who knows what to do. Having wiki constantly open and studying each mechanic/items can be tiring, especially if you come home from a long day to simply relax with videogames. Saying 'skill issue' just discourages the player from playing the game, game's simply not for me and that's okay. \n\nPerhaps I'll give it another go someday in the future.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "bundle prices in game are different from when you actually purchase them a 3$ bundle turns into a god damn 30$ one",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very disappointing that this PC version of the game does not support split screen co-op whereas the PS and Xbox versions do. Very disappointing indeed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Too easy to accidentally delete your save with no change of getting it back, the button to regenerate the world is right next to other more used buttons and it completely deletes every backup. This isn't a new problem, people have been talking about it for years",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't starve is a bit of an enigma for me, why is this game seemingly near universally beloved? The premise is solid, survival base building and exploration, some light combat mechanics and boss fights, lore breadcrumbs, unique visual identity, play with friends. What's not to like right? I can see why people do like it, I was also positive on it for a while, but man, completing the 5 maps in the single player game to reach maxwell + the caves, which at the time was basically all of the content in the game, absolutely positively burned me out. This game is so repetitive it makes carpal tunnel blush. \n\nIts kind of like 2D vanilla minecraft if you take away 99% of creative expression and redstone and add a creepy horror filter. That is to say, not good, I like minecraft a lot but I only play modded, and the creative building/ tech progression are some of my biggest reasons why I play that game. I digress. In Don't starve you can more or less see all of the content of the game from the first 10 minutes of playtime. I don't mean that you can experience it or that you can craft all the items, I meant it in a literal sense, you can look at the crafting menu and see a vast majority of the items in the game, and there are not that many. Its mostly just some variation of \"armor, better armor, something to help with rain, something to preserve food... something to help with X problem you have\". What I am trying to say is that progression feels kind of flat, sure, some things are hard to get, especially if they require unique boss materials and what not, but these are effectively trophy items, the main game loop (gather, forage, explore) is extremely flat, there is nothing really to discover or puzzle out, you are just grinding resources to become self sustaining and then to survive more conveniently. 70-80% of the discovery is in the world exploration, and while there are lots of niche obscure interactions the average player will probably never see, the novelty doesn't really last that long, there's only a handful of enemy types, materials, things to do in the game world, once the discovery stage is over, its just pure grind to prepare for a boss or maybe to go caving or something like that. I know that doesn't sound that bad, but if you haven't experienced the tedium of the core game loop (when you are not exploring new stuff but just chopping down trees, checking your traps, refilling your drying racks, harvesting berries etc.) its difficult to grasp. I think on some level the developers understand this issue, which is why they have released numerous variations for the game. For example, you can play in a sea world with different resources and structures, its basically a brand new game... but, crucially, none of the issues are really resolved, its just a reset, an alternate campaign that will have all of the same problems as the original game. You'll bumble around discovering how the environment and structures work, and then fall back into the tedium... why is it like this?\n\nHere's the rub, this game has permadeath, even tedious routine things can quickly become deadly if you are caught off guard, every however many days you will be attacked by a pack of hellhounds, if they come at a bad time you could suddenly lose it all, 10s, maybe 100 hours of progress. What do you think this ever-present doom does to the tedious grind? It makes it even worse. You have to double and triple check you always have enough food, you are not missing a light source, you're not gonna be caught without a weapon and armor if the wolves come etc. Is this engaging gameplay? I personally just find it exhausting. If the game was shorter then sure, I could see it as a survival challenge, but this game is a marathon not a sprint, you have to somehow motivate yourself to push through a slog of repetitive resource grinding while the sword of damacles hangs over your head ready to come down the moment you get complacent and sloppy. Sure, you have some tricks up your sleeve, you can make revival totems to cheat death, I think there are even items that can revive you, but those also take resources to craft, and its not a full proof safety net, if you don't have food and equipment ready at the totem you might just respawn just to die again, so that is another maintenance task you have to upkeep, or are you going to be sloppy and not worry about it? This is the kind of experience Don't starve is, after a point it becomes about what you can be arsed to do, just begging to get to new content, wherever it may be, and then even when you get to the new content... then what? You are still stuck inside this grindfest of a game, maybe you'll find a boss, that is cool, shame the combat is literally just point at click then run away in time... maybe you will find a unique item, also cool, but get ready for it to potentially do nothing, or maybe give you like a small buff to one of your stats or something. My point here is, when the core game loop is tedious and stagnant, it honestly does not really matter what the reward is at the end, unless its effectively a different game where you are subject to a different game loop.\n\nBut before the game falls into a rut, while you are still discovering things about your immediate surroundings, the game is fun then right? Well... that is when the game is at its best, but even in this stage, it has one fatal flaw. This game does not explain, teach or hint at anything. You are literally on your own. Seemingly no thought has gone into how a player is meant to discover unique and interesting mechanics, synergies etc. Let me give you an example, the crockpot. This is an item that lets you cook food, put up to 4 ingredients and discover new recipes... and the only way you have to discover them is random trial and error... does the position of ingredients matter? The amount? the freshness? who knows, let's say you have 10 unique ingredients in the game and neither position nor amount matters for the recipe, that is 10*9*8*7= 5040 recipes to check! Have fun, isn't this gameplay great? It sometimes almost feels like the game does not want you to learn how to play, its like you offended the instruction manual and it refuses to talk to you. Even the item descriptions are often jokes or just flavour text, why is the game so hostile towards the player? I just don't get it. I am all for games that ask the player to learn and experiment, but theres a way to encourage and guide the player to do so, and this game has not chosen it. I guess all I can really say is on a personal level, I find the game is fatiguing to play, the mechanics are seemingly obfuscated as if to hide the childishly simple mechanical depth of the game and the only thing that you are left with is monotonous repetitive maintenance tasks and the fear of losing all your progress to a stupid mistake.\n\nAs a survival game, an exploration game, or a story game, Don't starve is malformed. Although there are some aspects of it I enjoyed, some unique experiences I had, there is too much wrong with the game for me to ignore.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Remove this product from local co-op please since you cant play locally on pc... it is even called dont starve together someone wouldve thought you would fix something like this after so many years.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is an unfun, constantly unrewarding resource sink and I honestly regret putting so many hours into it.\r\n\r\nMy problem with the game is that to do anything fun you need to either gather copious amounts of resources for like 10 days straight for a single boss fight that will still somehow take 20+ minutes or you go in practically naked and get your ass handed to you if you're not good at kiting (and that's if you even HAVE a choice, some bosses force you to either defeat other bosses [Which are just bigger resource sinks] or complete a boring sidequest before you can fight them, like the Crab King, and some force you to wait until a certain season, like Klaus).\r\n\r\nAlso, this is mostly psychological and me-exclusive, but I feel like every single time I get hit, it feels like I need to heal instantly or I'm going to die; even with the characters that have more default health every hit from anything stronger than a spider feels like getting hit by a truck, and before I found out about stuff like sleeping bags and blue mushrooms that meant spending 2 or 3 days scouring the world for literally anything that healed you when you ate it. This culminated in me not wanting to get hit at all, so I just didn't bother with the bosses. If you have any experience with the game you know that actively avoiding the bosses is a really bad idea.\r\n\r\nAnother problem I have is the combat. Kiting is not fun. It feels boring and unengaging, like I'm putting the minimal amount of effort. Maybe if there was something more complex than a boomerang I'd be more interested, but as far as I know, there is literally only one boss in the entire FRANCHISE that has a weakness you can exploit. That means every single other boss is just \"run, hit, retreat, repeat\", over and over and over again. Way too repetitive.\r\n\r\nCharacters are fucking cool though, I like 'em, most of 'em anyways.\r\n\r\nPoint is, after 400+ hours I still have not found the \"fun\" part of this videogame, and I don't think I ever will. \r\n\r\nBasically: the bosses are too tanky and they're either absurd resource sinks or have some boring prerequisite to fight them, and even when you do get to fight them all you do is run, hit, retreat, and repeat this like 200 times. The survival elements are fun but man the combat just completely ruins it for me, it's mind numbingly boring and once I got past the survival stuff I just got frustrated.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I know this game is intended to be a multiplayer, but why would devs then add a singleplayer option during creation of the world? Events like Moon stone, and bosses like Dragonfly are virtually impossible to solo without some kind of cheesing, and no amounts of mods can fix that. Such a bitter letdown after 180 wonderful in-game days. The game has so much interesting potential, but don't buy if you're intending to play alone – you will only feel sick to your soul like I'm rn.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Ah yes i love deleting the world when dying and having zero idea of what the fuck i need to do in order to progress. No wonder the Terraria collab boss is the worst of the game. \nStop cooking",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is meant to be multiplayer yet its almost impossible to join eachother and no invite button. you'd think after all these years they would make it at LEAST moderately easy to join someone., never had a game with this issue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is annoyingly obstinate in theme, design, and user interface. It comes packaged with a flimsy combat system, deliberately useless-sounding/actually-useless tools & structures, and a slightly uncanny and weird art style that's honestly something you just have to see for yourself. \nthis is a comment i saw on a other and this is honestly the best way i could describe it my self\nwould give it a mixed review if it was possible",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Alright, my review. Ignore that I have 1 teeny tiny bit extra hour on the game. I've reached 4000 hours on this game, and I'm here to say a thing. This was one of my favorite games I've played from 7 years old to now. (I'm still a kid, atleast still.) There are so many cool mechanics within this game with great concepts that require a nice lot of thinking to solve, but that also cracks open a problem. The people who just started this game. I know, Tencent (And yes I'll refer to the dev as Tencent not Klei because from my knowledge many of the devs from Klei have gone working on other games) wants to create TEAMWORK by making the game more and more vague to starters, but that's not my only problem. I've had many good memories with the game, but after 2025 started almost everything went down hill with the game. The artstyle change, instead of the creepy moody and dark brown/yellow colors on almost everything we have a game filled with generators wires machines technologies in a way that fits nothing like the game should be. Other than that some of my friends have attempted coding. Not only is the app used for making sprites bad, not only is the coding bad, but the amount of work also put into each single mod. The modding in this game is VERY easy to navigate, but on one hand I have to deal with having one of my mods glitching and corrupting my server every week. This is a fun game if you have friends, but the game wants to smash everyone's head open that multiplayer is mandatory. It is a fun game if you have alot of friends, but even then getting reduced to using 10 mods is unbearable as hell. So many good flashbacks in 2024 and anything before it, and such a terrible experience in 2025. I hope you can have fun in this \"dark creepy survival game\" but I hated all the stuff I needed to experience just to play the game. I don't often play survival in DST, and I usually use big mods for creating a whole town. I had the best creative server at some point, I can't have it anymore because the game prevents me (and almost anyone else) from playing the game the way they want. You can get the game for yourself but it might not be fun at all even with the many content it has to offer. Thanks for reading, Bye! And also remember the devs barely listen to the players anymore, Or Tencent or whoever you call them.\nForgot to mention! Tencent added a setting for every lunar mob that appears in the main land. All except for the Deadly Brightshade. You know, 80% of the lunar side's problem",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game seemingly gives you a ton of options, while really you have an invisible checklist of things to do. It feels like I'm supposed to know to do unintuitive things that aren't a matter of \"oops I died because I did this, I'll learn from this experience\" and instead \"what am I even supposed to do to prevent this?\". I also don't love how the game controls and the problem is so deeply rooted with how the game is made, that I cannot just fix it in the settings. On the more positive note, this game looks gorgeous. I love the artstyle, the enemy and character designs, and the sound design is just as incredible. I'm sure if I completely forced myself into learning this game I could probably get into it, but with my current experience it just doesn't feel worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was awesome, now is downright unplayable. In a game when OHK from bosses is the norm, you're now expected to facetank because of omnipresent almighty LAG. And Klei simply doesn't care.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game ACTIVELY tries to kill you every single second, not my kind of game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to like this game. Idk what happened but I'm just gonna leave this here just so I feel better. First my base burned down (disabled it). then earthquake because i didnt feed some r-word mob (disabled it). now ANOTHER FUCKIGN R-Word ASS FUCKING MOB SHOWS UP AND STILL FUCKING DESTROYES EVERYTHING. LIKE WHATS THE FUCKING POINT. It took me 3 hours to rebuild only to get rolled. Who is this game for? No wonder people just leave shit on the floor. No thanks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pick up stick, pick up grass, die from random monster, drift around 20 minutes finding a respawn point only to discover haunting various objects around the world is a more fun game loop than the whole stick-grass-seeds-kite-monster thing. you can't build a house or any kind of safe base (within a reasonable time frame), even the pigs can.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "didn't enjoy it.  I played coop with 5 of my friends and family and even though I tried to make the best of it 3 of them quit within 30 minutes it was too boring for them.  The 1 person that tried to stick it out with me spent 30 minutes trying to find a resurrection stone but couldn't so he got bored too.  No thanks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this was just a multiplayer ds with a few more things and characters but now its almost not the same game anymore. if anyone comes around a way for launching this game for multiplayer (even on a LAN) on a version from 2019-21 or something, then please, let me know.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn't like it. I tried to, but it's too grindy and unfriendly to get into. Only get this if you are REALLY into these kinds of games, or have a few pals.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why opening this game changes my main monitors resolution from 1440p to 720 x 576 and refresh rate from 144 to 59,95 and resolution of side monitors to 720p is beyond me. Get your dirty paws out of my windows settings you grimy slimy stinker game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If u like a game with no explanation and a very slow pace, with slow combat mechanics this is the game for you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not my type of survival game.  Needs an early game tutorial mode.\n\nAlso subjective opinions here but I don't like the graphics style or the sound effects.  \n\nWould rather play rimworld or a regular survival game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is not for everyone its super hard and i kept dying but i feel like if you just master the game then maybe it will become more fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tried a few times to start a world on this game, every time its come down to spending 30 mins to try find a rock..... just running around emptyness to find a rock for it to go night.... im sure if i put the time in this is probably a good game but i honestly cant be bothered for a first time experiance have this much hassle to find a basic material, people with more paitence may enjoy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game makes no sense and makes no attempts in trying to help you figure out how to play. goodluck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game was pretty good but now i have to downvote it because anything i do the game chashes for no reason even if i don't have any mods on like this is so stupid!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know it's old, but come on, its interfaces are so buggy and clunky, the P2P is so bad it disconnects you the instant your internet dips even just a bit in speed (and takes ages for it to disconnect you), every loading screen makes windows think it crashed, it pretends to support 2nd screen playing but it bugs out the UI and makes it impossible to play when you use that setting... I regret giving it more than two hours of playtime",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My experience with this game has been, walking around looking for a few specific items in a largely empty world (with a friend). I enjoyed writing that description about as much as I enjoyed the game.\n\n The combat is undoubtedly terrible. I, as an amateur, could do better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You're better off playing minecraft but still worth a try ig",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I couldn't refund so Im gonna be a dick and give this game a thumbs down",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game , always lagging when play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "never got the hype. It's a well made game though, just not for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i don't waste 100 hours on findidng all threats and then dieing to an new one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "doesn't have any achievements to unlock",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Didn't get the idea of it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME CAN'T FUCKING RUN, FUCK THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't sex charlie :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i want To harm   Someone after playing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too many bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no no no no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "бабка гавно ыыыыыыыыыыы",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game straight up breaks the law in many ways. Data collection is enabled by default, the toggle off switch is hidden in some deep menu. Disabling it not only DOESN'T turn off data collection at all, it also makes you unable to play online.\n\nNothing will be done because this game is Chinesium slop now. Just saying that this game literally breaks several laws in every Western country. Playing this game sends every iota of data they have on you directly to Tencent and their advertising partners, and I wish this was an exaggeration. Every interaction you make in the game is carefully logged, down to every single tree you chop.\n\nThis info also includes personal information such as your device info, and this logically also gives them your IP address (which the GDPR considers personal data by the way). Network analysis shows this data collection STILL happens when disabled in the menu(!), which also disables all multiplayer play(!), including LAN play(!!!).",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Frustrating piece of sh*t game that punishes your ss for everything. You get bored really fast when you have no idea what you should do or where to do it. Your precious base that you’ve spent hours building can be turned into sht by almost anything. Combat is your last resort because it s*cks. Your character always seems to want to die. Whether it’s from starvation, insanity, frostbite, frog rain, or overheating, you’ll die for sure.\r\n\r\nThis is one of those games I really want to enjoy, but I just can’t. I download it once in a while when I feel like giving it another try, start a new run, make it to day 40–60, watch my base get trashed by a giant hedgehog, delete the game, and then avoid it for a whole year.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game's focus shifted from charming, creative, and kind of eerie exploration, adaptation, and survival, to a boss battle heavy story and lore progression gameplay that doesn't teach you through intuitive mechanics and designs but rather expects you to educate yourself through external sources based on its popularity. It became a wiki game, expecting players to learn its features through youtube videos, twitch streams, and wiki pages, both mechanics and features as well as lore, instead of leaving the player to discover and unravel them through fair gameplay. Not to mention, spoiling the player of the mysteries the game used to be so focused on, now outright revealed for the sake of progression, comfort, and convenience. \r\nUnfortunate to see. Still plenty charming for the people who enjoy playing in the ever growing world with their friends or alone; but the magic of the original is kinda gone, so I recommend the original instead, for the purpose the franchise tries and always tried to fulfill.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "At the heart of don't starve together is an exciting gameplay loop of exploration, base-building, and discovering wacky items like star staves, bee mines, or armor you have to feed. However, you only experience the peak of the game in a fairly narrow window of time: after you escape noob hell (the game explains none of itself) and before you know TOO MUCH.\r\n\r\nYeah, there is distinct threshold where things become to easy. Two main reasons are the overabundance of resources and the lack of difficulty scaling. Since self-sufficiency is so easy with items like meatballs or stonefruit, the game quickly loses its jazz and becomes tedious. Since the only things that truly scale are the hounds, which are trivial to deal with, you stop feeling the need to improve your welfare. At that point, survival becomes a chore, just maintaining stocks.\r\n\r\nThis game has many bosses. While some drop genuinely useful rewards (eye of terror, nightmare werepig, beequeen, ancient guardian) most of them drop garbage or items that are not nearly worth the trouble (twins of terror, toadstool, shadow pieces, antlion, moose goose, crab king, malbatross). You only do these bosses when you inevitably get bored of the core survival game. It doesn't help that the combat is boring and lacks depth.\r\n\r\nBy the time you hit \"hard mode\" the game becomes even less interesting because the only usable weapons and armor are the new \"planar\" stuff. The original roster of cool gimmicky items becomes unviable, and the game is less interesting for that. \r\n\r\nI wish there was a \"maybe reccommend\" option. This game is fun for a while, but fully expect hitting the wall of boredom not too long after. Once you do, investing any more time is not worth it.\r\n\r\nIf you want to know why my hours are high, it's because of AFK grinding and challenge mods (if you buy, i recommend the UNCOMPROMISING MODE mod once you hit that wall).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Firstly, I like the art style and sound effects, but I'd rather watch someone else play it. It's not as fun as people make it to be, unless you know what you're doing in order to progress, or have a friend who knows what to do. Having wiki constantly open and studying each mechanic/items can be tiring, especially if you come home from a long day to simply relax with videogames. Saying 'skill issue' just discourages the player from playing the game, game's simply not for me and that's okay. \n\nPerhaps I'll give it another go someday in the future.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "bundle prices in game are different from when you actually purchase them a 3$ bundle turns into a god damn 30$ one",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very disappointing that this PC version of the game does not support split screen co-op whereas the PS and Xbox versions do. Very disappointing indeed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Too easy to accidentally delete your save with no change of getting it back, the button to regenerate the world is right next to other more used buttons and it completely deletes every backup. This isn't a new problem, people have been talking about it for years",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't starve is a bit of an enigma for me, why is this game seemingly near universally beloved? The premise is solid, survival base building and exploration, some light combat mechanics and boss fights, lore breadcrumbs, unique visual identity, play with friends. What's not to like right? I can see why people do like it, I was also positive on it for a while, but man, completing the 5 maps in the single player game to reach maxwell + the caves, which at the time was basically all of the content in the game, absolutely positively burned me out. This game is so repetitive it makes carpal tunnel blush. \n\nIts kind of like 2D vanilla minecraft if you take away 99% of creative expression and redstone and add a creepy horror filter. That is to say, not good, I like minecraft a lot but I only play modded, and the creative building/ tech progression are some of my biggest reasons why I play that game. I digress. In Don't starve you can more or less see all of the content of the game from the first 10 minutes of playtime. I don't mean that you can experience it or that you can craft all the items, I meant it in a literal sense, you can look at the crafting menu and see a vast majority of the items in the game, and there are not that many. Its mostly just some variation of \"armor, better armor, something to help with rain, something to preserve food... something to help with X problem you have\". What I am trying to say is that progression feels kind of flat, sure, some things are hard to get, especially if they require unique boss materials and what not, but these are effectively trophy items, the main game loop (gather, forage, explore) is extremely flat, there is nothing really to discover or puzzle out, you are just grinding resources to become self sustaining and then to survive more conveniently. 70-80% of the discovery is in the world exploration, and while there are lots of niche obscure interactions the average player will probably never see, the novelty doesn't really last that long, there's only a handful of enemy types, materials, things to do in the game world, once the discovery stage is over, its just pure grind to prepare for a boss or maybe to go caving or something like that. I know that doesn't sound that bad, but if you haven't experienced the tedium of the core game loop (when you are not exploring new stuff but just chopping down trees, checking your traps, refilling your drying racks, harvesting berries etc.) its difficult to grasp. I think on some level the developers understand this issue, which is why they have released numerous variations for the game. For example, you can play in a sea world with different resources and structures, its basically a brand new game... but, crucially, none of the issues are really resolved, its just a reset, an alternate campaign that will have all of the same problems as the original game. You'll bumble around discovering how the environment and structures work, and then fall back into the tedium... why is it like this?\n\nHere's the rub, this game has permadeath, even tedious routine things can quickly become deadly if you are caught off guard, every however many days you will be attacked by a pack of hellhounds, if they come at a bad time you could suddenly lose it all, 10s, maybe 100 hours of progress. What do you think this ever-present doom does to the tedious grind? It makes it even worse. You have to double and triple check you always have enough food, you are not missing a light source, you're not gonna be caught without a weapon and armor if the wolves come etc. Is this engaging gameplay? I personally just find it exhausting. If the game was shorter then sure, I could see it as a survival challenge, but this game is a marathon not a sprint, you have to somehow motivate yourself to push through a slog of repetitive resource grinding while the sword of damacles hangs over your head ready to come down the moment you get complacent and sloppy. Sure, you have some tricks up your sleeve, you can make revival totems to cheat death, I think there are even items that can revive you, but those also take resources to craft, and its not a full proof safety net, if you don't have food and equipment ready at the totem you might just respawn just to die again, so that is another maintenance task you have to upkeep, or are you going to be sloppy and not worry about it? This is the kind of experience Don't starve is, after a point it becomes about what you can be arsed to do, just begging to get to new content, wherever it may be, and then even when you get to the new content... then what? You are still stuck inside this grindfest of a game, maybe you'll find a boss, that is cool, shame the combat is literally just point at click then run away in time... maybe you will find a unique item, also cool, but get ready for it to potentially do nothing, or maybe give you like a small buff to one of your stats or something. My point here is, when the core game loop is tedious and stagnant, it honestly does not really matter what the reward is at the end, unless its effectively a different game where you are subject to a different game loop.\n\nBut before the game falls into a rut, while you are still discovering things about your immediate surroundings, the game is fun then right? Well... that is when the game is at its best, but even in this stage, it has one fatal flaw. This game does not explain, teach or hint at anything. You are literally on your own. Seemingly no thought has gone into how a player is meant to discover unique and interesting mechanics, synergies etc. Let me give you an example, the crockpot. This is an item that lets you cook food, put up to 4 ingredients and discover new recipes... and the only way you have to discover them is random trial and error... does the position of ingredients matter? The amount? the freshness? who knows, let's say you have 10 unique ingredients in the game and neither position nor amount matters for the recipe, that is 10*9*8*7= 5040 recipes to check! Have fun, isn't this gameplay great? It sometimes almost feels like the game does not want you to learn how to play, its like you offended the instruction manual and it refuses to talk to you. Even the item descriptions are often jokes or just flavour text, why is the game so hostile towards the player? I just don't get it. I am all for games that ask the player to learn and experiment, but theres a way to encourage and guide the player to do so, and this game has not chosen it. I guess all I can really say is on a personal level, I find the game is fatiguing to play, the mechanics are seemingly obfuscated as if to hide the childishly simple mechanical depth of the game and the only thing that you are left with is monotonous repetitive maintenance tasks and the fear of losing all your progress to a stupid mistake.\n\nAs a survival game, an exploration game, or a story game, Don't starve is malformed. Although there are some aspects of it I enjoyed, some unique experiences I had, there is too much wrong with the game for me to ignore.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Remove this product from local co-op please since you cant play locally on pc... it is even called dont starve together someone wouldve thought you would fix something like this after so many years.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is an unfun, constantly unrewarding resource sink and I honestly regret putting so many hours into it.\r\n\r\nMy problem with the game is that to do anything fun you need to either gather copious amounts of resources for like 10 days straight for a single boss fight that will still somehow take 20+ minutes or you go in practically naked and get your ass handed to you if you're not good at kiting (and that's if you even HAVE a choice, some bosses force you to either defeat other bosses [Which are just bigger resource sinks] or complete a boring sidequest before you can fight them, like the Crab King, and some force you to wait until a certain season, like Klaus).\r\n\r\nAlso, this is mostly psychological and me-exclusive, but I feel like every single time I get hit, it feels like I need to heal instantly or I'm going to die; even with the characters that have more default health every hit from anything stronger than a spider feels like getting hit by a truck, and before I found out about stuff like sleeping bags and blue mushrooms that meant spending 2 or 3 days scouring the world for literally anything that healed you when you ate it. This culminated in me not wanting to get hit at all, so I just didn't bother with the bosses. If you have any experience with the game you know that actively avoiding the bosses is a really bad idea.\r\n\r\nAnother problem I have is the combat. Kiting is not fun. It feels boring and unengaging, like I'm putting the minimal amount of effort. Maybe if there was something more complex than a boomerang I'd be more interested, but as far as I know, there is literally only one boss in the entire FRANCHISE that has a weakness you can exploit. That means every single other boss is just \"run, hit, retreat, repeat\", over and over and over again. Way too repetitive.\r\n\r\nCharacters are fucking cool though, I like 'em, most of 'em anyways.\r\n\r\nPoint is, after 400+ hours I still have not found the \"fun\" part of this videogame, and I don't think I ever will. \r\n\r\nBasically: the bosses are too tanky and they're either absurd resource sinks or have some boring prerequisite to fight them, and even when you do get to fight them all you do is run, hit, retreat, and repeat this like 200 times. The survival elements are fun but man the combat just completely ruins it for me, it's mind numbingly boring and once I got past the survival stuff I just got frustrated.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}